{"id": 16776, "submission_id": "13clcfy", "title": "AITA for planning to move out of state for college, leaving my single mother sister alone?", "selftext": "I (18f) have a twin, Mary. We don’t have any more siblings. Mary got pregnant when she was 14. She couldn’t find the father to tell him she was pregnant and he is still nowhere to be seen.\n\nWe have lived with our parents in a 2 bedroom apartment for nearly a decade now. So when Mary gave birth, her baby had to stay in our room. My parents worked more so they could provide for the baby so it was mostly Mary and I at home taking care of her baby. If I wasn’t at school, my parents would demand that I go home and help my sister with her baby. I had no life, no privacy and no love or attention since my sister had her baby. I know obviously the baby and mother take priority but I felt so alone. At 14-15, it was very hard for me to come to terms with my parents not asking me how I’m doing anymore, not congratulating me on my achievements, coming to my games, taking care of me when I’m sick etc. I became resentful of Mary and my parents but I did a pretty good job at never showing them that. I knew the feeling would pass and it did by the time I was 16.\n\nI got at a job at 16 so I had some time to myself outside of school and my niece. My parents then coerced me to contribute almost 80% of wages to help Mary take care of her baby. I’ve always been a pushover so I couldn’t say no, especially because Mary and the baby did actually need that money. Most of the money my parents made was going to bills, rent and car payments. \n\nAnyway, i told my parents I got into a very good college out of state on a near full scholarship and that I’m planning to go. They asked how I can think it’s ok to just leave them to take care of Mary’s baby. I asked why I should stay in a shared bedroom with my sister and young niece for my college years? They said not everything is about what I want and sometimes people make sacrifices for family as they are doing. Mary jumped into the conversation by saying she wouldn’t go off to another state and leave me a single mother alone if the roles were reversed. I said she isn’t alone, our parents are here. She said it’s not the same because they’re always gone for work.\n\nAITA?", "created_utc": 1683626963, "permalink": "/r/AmItheAsshole/comments/13clcfy/aita_for_planning_to_move_out_of_state_for/", "score": 4870, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1 - I decided to move out of state for college\n2 - because it means my sister will be alone\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Obviously NTA. What are you supposed to do, put your life on hold for the next 14 years untill the kid grows up? Go, get an education and live a good life. You are not responsible for your sisters kid.", "NTA...please tell me that you're taking this opportunity. It's time to live your own life. Feel no guilt.", ">Mary jumped into the conversation by saying she wouldn’t go off to another state and leave me a single mother alone if the roles were reversed\n\nI highly doubt that. Someone so selfless wouldn't ask you to drop your dreams to take care of their baby and their problem.\n\nI get your parents are tight on money at the moment but its not your problem to deal with. \n\nNTA\n\nJust curious. Does Mary have a job?", "NTA.  But make sure you hide anything to do with your scholarship and college acceptance so that they cannot do something to cause you to lose your scholarship.   Start hiding your money, stop giving it to your sister, she chose to have a baby at 14, she needs to care for her child and pay, not you, the baby is not your responsibility.  Do you have a friend you can leave your documents with, birth certificate etc?  That way they can't be hidden from you.  Start storing the things you want to take with you somewhere else if you can, that way if they try to stop you leaving all the things you really need will be secure somewhere else.", "NTA at all, Im so proud of you for working hard and finding a way out of this towards a great new future! You've shown so much maturity and Im so sorry your parents and sister have taken so much advantage of you and taken you for granted.   \nMaybe they won't forgive you (right away) but maybe this will force them to find a new way of being, your sister really needs to step up and the baby should be around 4 now so absolutely no excuse for her to not find a job etc.  \nWishing you the very best of luck and I hope you have an amazing time at college and a wonderful life.", "You didn’t get pregnant at 14, and therefore have no sacrifices to make. Go to school and don’t even think about staying for these people.", "Just make sure you inform your school and scholarship people that no one is to email or call on your behalf about withdrawing your admission or scholarships. I would also look for another place for any school related mail to be sent. Right now your parents and sister are desperate. NTA", "NTA. Tell her to look after her own damn child like the rest of us do. Live your life for you and don't let someone else's mistakes bring you down. Please take the scholarship.", "NTA \n\nAre you still working? Stop giving Mary any money at all. That is your money that you earned. You are going to need it. Put it into a bank account your parents do not have access to. It's kinda ridiculous you had to give 80% of money you earned to her. It's time she got a job and stood on her own two feet.", "NTA!!!\nAlso run, get out of there an build a life for yourself, it is about you not your sister and niece!!!", "NTA, and i would suggest considering staying away for the first few holidays (between terms/semesters), go backpacking, stay at a friends or even stay at college at the very least\n\n&#x200B;\n\nThis will give you enough separation that it may make it sink into their heads that you are not the one that got pregnant and while your sister deserves support you aren't a serf to look after her and the kid for the rest of your life.", "NTA.\n\nYou've made your compromises and sacrifices (way too much, in my opinion). It's time for you to have your own life that revolves around you and your future - you didn't have a baby, she did.\n\nIf they really believe in that whole sacrifice and compromise for family, then it's time for them to return the favor and support you.", "NTA she decided to have a baby it’s her responsibility to raise her. Hold not yours. Your family ATA for expecting you to be her free labor maid/nanny. You shouldn’t have to Scarface your future, happiness, mental health for your sisters mistakes. Go to college, enjoy yourself, learn and grow and never look back. They don’t deserve you.", "No, you're not the a\\*hole. You have the right to live your own life, and at 18 you're an adult, so your parents can't force you to do anything.", "NTA, get your important documents together, and start saving as much as you can. Quit giving all of your money to your sister. Go out of state, and live your life.", "NTA, and make sure the university knows that only you are allowed to make changes to your offer. You don't want them calling up and cancelling the scholarship, for example.", "NTA!!! RUN.", "NTA. You sacrificed enough. Go and take advantage of this opportunity and don't let them guilt you into staying.", "NTA\n\nYou made enough sacrifice already. Go and live your life!", "NTA. Your parents are behaving very strangely. Get the fk outta there & go low or no contact. You deserve your own life. You may be twins but you’re individuals, not actually two halves of one a whole.", "NTA, look up parentification. Also every time people say \"family makes sacrificed\". Tell me, how many times Mary or your parents sacrificed themselves so you would have free weekends and spend time with your friends. Every time someone says \"family makes sacrifices\" it's one sided. Leave and never look back. Mary chose to have that baby, not you.", "NTA - congratulations with college. Go and have the best time investing in yourself.. you more than deserve that", "Mary really has it made. Three people to financially support her and her baby, and babysitters at her beck and call. You’re NTA. In fact, run out of there. Your parents will be taking care of those two until their last breath and then you will inherit them, get out now.\n\nIf they don’t forgive you, that’s there loss. They will come crawling back when Mary needs something, guaranteed. But you will have freedom", "NTA - take that scholarship and get the hell out. It's time for your parents to...idk...parent? And for Mary to step up and also parent. Not your baby, not your problem.", "Oh hell no. Get out of there. It's impressive that you've managed to earn a near full scholarship despite being forced to share a room with your sister and a baby. These people will suck the life out of you if you give them the chance. They've already stolen your high school years, don't let them steal your college years. All the best for your future! NTA", "NTA. You are well within your right to go. Your sister and parents should be happy for you. If I were your sister, I would be encouraging you to go out and build a future for yourself. Besides, your niece is now old enough that your sister should be looking into getting a job and daycare.", "NTA. They are perfectly capable to take care of the child and themselves without you in the picture. They are just not willing to do that.", "NTA. \nLeave as quickly as you can, and don’t look back.", "NTA. Go live your life. You don't have to be responsible for other peoples doings. Actually, I admire you that you manged to indure all that. \n\nEnjoy your college life, pursue your education you have worked hard to get it.", "NTA.    Pack your bags and take off for college.  Enjoy every moment and have a great time meeting new friends.\nMary's  problems are not your concern.", "NTA\n\nYou've done way more for Mary than can be reasonably expected from a child already. Besides, you're not leaving Mary alone, you're leaving her with her parents. That's three people to care for the baby.", "NTA Run Run Run. Go get your education and don't look back. Your sisters issues are hers and your parents. She literally Fucked Around and now she is finding out. Its a sad situation but you shouldn't have to sacrifice your future because of your sister and her baby.", "NTA\n\nYou have to live your life, not Mary’s. Mary needs to learn to manage on her own, she could get a job in the evening when your parents are home or a work from home job.", "NTA. Go to that college and move on with your life, but once you get through it all and get a career established, just be ready for them to put their hands out again for support. That's up to you whether or not you want to help, but at this point I wouldn't continue to help. Sounds very selfish on their end.", "NTA. Not going to college (especially on a large scholarship) is a decision that will impact your entire life. It's time to start living for yourself, especially as the baby is getting closer to pre-school age so they don't have the excuse. \n\nHeck, try framing it as \"well I'm hoping the degree will give me a good job so I can help more in the future.\"\n\nAnd then don't come back.", "NTA.\n\nYou have seemingly sacrificed your high school experience for a baby that is not your responsibility. It is not your fault that your sister got pregnant so young, and I am so incredibly sorry that your parents and family have failed to realize that. I know it is tough, but a new door has opened and you need to use it. It is time to take care of yourself and live your life for you.", "NTA.  Taking care of yourself through the betterment of your life is a good thing,  Life will take you a lot of places, just hold onto your seat and enjoy the ride.", "NTA. How can they think it's okay to force you to give up your life for Mary's baby?", "NTA it's not your job to take care of your sister's mistakes. Go to college, get out of that house and DONT look back! It's time Mary learns you're not her kid's other parent", "NTA. Is Mary working to provide for her child also? Or are your parents taking care of both? Has she looked for assistance? Child care assistance? There's a lot of help out there for young single mothers that will take some of the load off your parents.", "NTA...\n\nPretend you're gonna stay and then disappear and go to college. \n\nSounds like the parents will sabotage you so you'll stay and help. \n\nYour sisters child isn't your responsibility, you didn't get pregnant at 14 she did. \n\nPlease be very careful going forward. Get to college and live your life but be prepared for them to throw a fit over this.", "NTA\n\nTime to focus on your own life. She (and your parents by not educating her better) f’ed up and got herself into that kind of responsibility, she can’t demand you to partake in her responsibilities and sacrifice your life for her poor choices.\n\nCongrats on the scholarship.", "NTA\n\nYour sister is your parents responsibility, her child is her responsibility.\n\nGo and enjoy your life. Nuff said.", "NTA. You’ve been making sacrifices for 4 years, having to share a room look after the child and give them most of the money you make. Mary’s poor life choices are not your problem. In this day and age I’m sure she could track the father down if she really wanted to. Get out of there as fast as you can and don’t look back.", "NTA Please go and live your life. It is not your fault your sister got pregnant or that your parents are allowing her to do nothing. She can work, go to school etc. Congratulations on ALL of your achievements.", "NTA.\n\nYou have already done more than your share to support your sister's mistake. You need to think about your own future.\n\nGo.", "NTA.. go get your degree and work hard to make YOUR life as comfortable and happy as you can.", "NTA at all.\n\nYou need to take care of yourself and your future first. In principle you'll be better able to offer support once you have an education and are able to get a better paying job. \n\nDon't let your family hold you back on this one.", "NTA at all! Take this amazing opportunity and get out of there. The child is not your responsibility. Mary is not your responsibility. Your parents’ bills are not your responsibility. You have been parentified, exploited, and ignored for years and now that you have the chance to get out, go. Live your life and have new experiences and enjoy the freedom and chaos and pain and joy of being an adult, free from the constraints that were placed on you too young. \n\nMary has your parents if she still needs help, and the baby won’t be a baby forever. They must already be at least 3-ish, so in a couple of years hopefully Mary will have an opportunity to get an education or job that she enjoys while her child is at nursery or school. But whatever her decisions and choices are, it’s not on you to make them possible. You’ve done more than your share in this situation and it’s time for you to have your own life. Enjoy it!", "NTA. \n\nLeave these people behind, they'll survive and they've already made your teenage years all about them. Your parents just aren't that into you, and it's all about Mary and her needs. \n\nThink to any time in the last few years where you've needed support, love or attention. Have they been there for you? If the answer's no, then what happens in twenty years time when you're working a minimum wage job because you didn't get to go to college on a scholarship because you had to look after your sisters kid and you ask them to make up the last twenty years because you sacrificed for the family and now it's time for the family to sacrifice for you? I take it you'll be on your own. \n\nYour life can't be about Mary, and they've already co-erced you into giving all your money to her. Live your own life, you aren't a babysitter and cash cow for your sister.", "NTA.\n\nYou are now old enough to be in colleague. She is now old enough to be solely responsible for her own child.\n\nI’m sorry you are forced to become the co parent to this child. It doesn’t make sense that your parents had to work extra but still need 80% of your pay to cover for her expenses. Does she work or anything? Sell photos of her feet at least?", "Your niece is 4 now correct? Are there any programs that offer pre-school so Mary could at least work and get out of the house? This isn’t healthy for her either. But NTA, as some have suggested; take steps to protect your scholarship and admission. Also most colleges offer mental health and support services (included in your tuition fees) I recommend seeking that out and taking advantage. You seem to be handling things as well as possible. But after the last few years, college is going to be a huge adjustment to what you have been doing in high school. And the a counselor can hopefully help you work through these feelings of guilt.", "NTA  \n\n\nThey robbed your highschool experience... Don't let em rob your prime!", "NtA, the kid is 4years old not a baby! You are not the parent of the child or grandparent. Go live your life, you deserve it, this is your oportunity to get out and be happy, do not waste it! You have a scholarship and good university to attend! Be proud and go!", "But....but......we're FaMiLY!!! Girl please!!!! Go Live Your Life. They're always gonna have a reason for U, your time, & your $$, 2 stay!", "NTA - it’s time for your life to be about you.", " NTA. I get you care about your sister and that is why you feel guilty, but your nibling is three or four now? More a child than a baby, at what point could you actually have a life of your own if not now.", "NTA.  Time for the rest of the family to “make sacrifices” for you.  You’ve done more than your share.  Get out of there and go live your life.", "NTA. GO GO GO. You've been neglected enough. Choose for yourself and for your future. You really deserve it.", "NTA", "NTA. Go to college, learn, have fun, and live your own life. Save every penny you earn - you’ll need it.", "Eek, run away. NTA, OP. Give them time to figure themselves out while you find yourself and your own life. If you want to come back and support them a little do that. But don't do it because they're guilting you into it", "NTA and Mary gets ZERO say. She ruined her life with your parents support and now she wants to ruin yours. Run far and fast.", "NTA. \n\nYou busted your buns to get this scholarship.  Take it and run with it, OP.  If you let it go, you’re going to be miserable and living on the daydreams of what could have been.  Your sister can start pulling more weight to take care of her child and your parents can go ahead and help her if they want to. \n\nAll and all, I am rooting for you!  Go to college, get a degree, and live your best life!", "NTA, this almost sounds like a cultural expectation and I’m not sure what cultural you are, but it’s not fair to you to have to be forced to stay with your sister forever. Your niece sounds like she’ll be going to kindergarten soon and that’ll give your sister plenty of time to work while her kids in school. I would continue pointing that out that your niece will be going to school soon and your sister will be able to work while she’s in school.\n\nIn the meantime:\n\n-Open a separate bank account in ONLY your name. Because if you opened it at 16, your parents have access to your money and can legally empty your account. Credit unions have no fees so I would go with a credit union. \n\n-go online to Experian and Transunion and freeze your credit. This will keep places from running your credit score for loans etc. Your parents and likely sister may have access to your social security number and can open credit cards and buy a vehicle under your name. It would be fraud if they did but if your sister has a history of stealing, I wouldn’t put it past her. You’ll have to continually unfreeze your credit to get a credit card, car, student loan etc. but immediately re-freeze it. Many people do this, including myself so get used to blocking and unblocking access to your credit.\n\n-contact the school and scholarship provider to let them know that nobody else is allowed to make decisions on your behalf so your family doesn’t try to sabotage you.\n\n-make sure to grab your social security card, birth certificate, and any forms of ID. You will need these for many things including housing and it’s easier to grab the originals than order new ones.\n\n-assume nobody is going to help you and prepare financially for that. Prepare to find a bus ticket to the out of state school. If you have a car, make sure it’s only in your name or they can legally take it from you. If it’s not in your name, you’d need your joint title holder to sign over the car to your name, so you might end up with no car.", "1.\tLock down your scholarship with a password at your school.\n2.\tTalk to your school to make sure they won’t cancel anything if your mom or sister try something \n3.\tCreate a new separate checking account so your parent don’t have access to it, so they can’t take any money that you deposit from your scholarship or earnings.\n4.\tCreate a P.O. Box address from the Post Office to have your mail delivered. P.O. Box address can have a full address so it looks like a house. Ask the post office for how to do it. They will give you the full address.\n5.\tApplied for EBT. You qualify. You should also recommend your sister apply too. Do so separately. Send it to your P.O. Box address. \n6.\tYou can apply for a free car. Google free car for low income or college or job. There are both state and national agencies.\n\nNTA\n\nI wish I can help some more, but all I have are some information. \n\nGood luck.", "NTA. I mean I can understand what your parents are trying to say but how long will you keep pretending to be okay when you are actually not?", "NTA, run away and never look back. They don’t care about you, they just want to use you to support your sister.", "NTA go, these people will just keep taking and taking until you have nothing left. \n\nYou didn’t have a child your sister did, her life has to change to accommodate a baby not yours. Your parents life has to change because their minor child has a baby not yours.\n\nGo and love your life and don’t let others make you feel guilty. Contact the college and tell them not to accept any correspondence/ rejections from your parents without confirming with you first. Change your bank details too and check your credit score.", "Go!!!! You are not an AH for this. Take your opportunity while you have it because one’s like this get harder to find as you get older!!! Save your soul seriously!!!!!!!! I’m so serious", "NTA OP\n\nyou need to run and run far away.", "NTA. Run", "NTA and honestly, I'd go nc with all of them", "NTA. You’re her sister, not her parent. You’ve already sacrificed so much of your childhood and while it sucks that Mary had to do this as well, it is not on you to reap the consequences for her actions. \n\nPlease, OP, I beg you: take that scholarship. Go to that good school. Open every door you want to and when you feel guilty, because you absolutely will, because you’re human, know that it’s because you are a good and generous person and that you have already given so much more than your parents should have allowed.", "NTA - The roles aren't reversed, and if they were, she would most likely feel the way you do. Make the most of this opportunity, go to college and get your degree. In a few years, you will be in the position to help your entire family far better than you can now, IF YOU WANT TO. It is not an obligation it's a choice. Right now you need to choose you!", "NTA. Please don’t give them any more information about your plans because they’ll try to manipulate and sabotage you. Just keep silently planning for your move and act as though nothing is going on at home. Plan for the move as if they’ll give you zero help.", "NTA. You have sacrificed enough, now go live your life! Congratulations on your scholarship!", "Nta This is your ticket!! Go!!! Run!! And don’t look back. Congratulations on the full ride. This speaks very highly of you. \n\nThe scholarship is your opportunity to break free. They’ve been taking advantage of you, and the parentification will only get worse if you stay.\n\nConsider reaching out to the college and let them no that under no circumstances should your parents be involved with your student account. You wouldn’t want them to call and cancel your scholarship.", "NTA, and please please please go to college and get out of that house. Mary had options. The decision was to have a baby. It’s is so grossly j fair the way you have been treated the last few years. You are in no way obligated to help out. Please go to college and do something for yourself, for your future.", "What country first of all? This sounds absolutely insane to me ! (USA) But I do know other cultures put taking care of family higher in their priority list than say we do. \n\nBut this whole situation is absurd. Mary had sex unprotected- not your problem\n\nMary had a baby- not your problem\n\nMary couldn’t find baby Dad- not you problem\n\nMary needed $ and help- not your problem\n\nPack your shit and leave in the middle of the night my friend. \n\nJust think by the time you’re done raising Mary and her baby, your parents will be aging and then you will be stuck taking care of them!\n\nMaybe tell em you knocked someone up far away and need to go take care of her now lol. Jk\n\nAbsolutely NTA!\n\nAbsolutely take the scholarship", "NTA - OMG! Your sis has to take care care of her kid alone? Welcome to motherhood! You sister has a kid - Time for her to take responsibility for it. That‘s not your job. Their milk cow is leaving! That’s bad! If I were you, I would go NC after I leave. Enjoy your life!", "NTA- move out and dont even look back", "NTA, and I bet if the situation was reversed, Mary would jump at the opportunity, especially having a nearly full scholarship. \n\nYou didn't have a baby at 14, Mary did, they are not your responsibility.", "If u r in the US, there are programs to help teen mothers. Doesn’t sound like Mary or your parents participates in any.  Some might even give money for bills.  Or help find the father who can pay child support. \n\n\nDon’t hold your college back b/c of this.", "NTA - sweetie run, run as fast as you can to college and don't look back.  That baby is not your responsibility, nor is it your responsibility to fund your sister's life.  Run.", "All I have to do is read the title to answer this.\n\n**NTA**\n\nIn fact, RUN. *DO NOT LOOK BACK OVER YOUR SHOULDER.* \n\n**Finish school, get a career, and start a new family of your own. Do NOT get sucked back into this bullshit and do NOT let it affect your education, future career and family.**", "Move out, go to college, cut the rope and don't look back.  Your mother is delusional and  being completely unfair to you.", "Ok, OP. First of all, NTA.\n\nSecondly, I'm going to say what your parents SHOULD have said.\n\nPanda, I'm proud of you. I can't imagine how hard it must have been working hard enough to gain a scholarship while helping with a young child, and working as well, but you did it, all by yourself. You're amazing - truly exceptional. \n\n<virtual hug>\n\nNow go to that college and catch up on the life you should be living! Work hard (I know you will) and have a blast.", "You are absolutely NTA. Sounds to me like your family is treating you as a piggy bank and free babysitter.\n\nYou've already put your life on hold long enough, time to leave them to their own thing and never look back, because Mary and your niece are not your responsibility.", "NTA \n\nThey’ve been using you for years , cut ties and make your own life.\n\nAnd not even knowing Mary, I know she’s lying, if the tables were turned she would bolt , and I have a feeling the parents wouldn’t stop her or care.", "Start preparing to leave now, lock down scholarship so no one can interfere, explain to college ( don’t be embarrassed they’ve heard it before) and get password protected, go to a clinic and begin birth control for your own safety. Have a bank account you parents have no access to information. Gather all your important documents and hide at friends or get safety deposit box. Get a duffel and slowly add an item or two you’ll need at college into duffel every week, so no one sees you packing. Same with cash start adding small amounts to duffel hide at friends if necessary. Think of an exit plan if family tries to physically prevent you from leaving. Stop talking about leaving family will never agree so be quiet and don’t share any information.  You are almost to the beginning of a new life, so plan carefully to get to the new life, be quiet, secretive and smarter than your family. You a bright future ahead of you just grab it!", "I’m so sorry they did this to you. You are NOT responsible for your sister or her choices. Your parents have completely mishandled the situation. Your sister needs to be working to support herself and her child. ITS NOT YOUR JOB!  Please get out now. Don’t listen to anyone who tells you that you need to stay. You’ve already done far more than your share. NTA", "This is your life. This is your one big shot to get away and carve out your own path. Do it and don’t look back! And please get some counselling to help you work through the severe emotional abuse you’ve been subjected to for so long. NTA and good luck!", "Absolutely NTA. Sounds like you need to get the hell out of there and never look back. \n\nI’m sorry to say, but your parents/sister want to use you as a cash cow/free babysitter forever.\n\nRun away from them as fast as you can.", "Your education is the most important investment you can make in yourself. Under no circumstances should you give up your education to care for your sister’s child. \n\nNTA and get out now while you can OP!", "Run and don't look back. NTA", "For not telling them you’re planning to apply for an out of state uni and just springing it on them like that could have been dealt with better but for wanting to experience uni and live your life independently after sacrificing so much at such a young age you’re not the A at all, your sister had the baby not you, yet helped as much as you could and you also financially supported her and now that that’s being taken away they are behaving like this, you could have told them in a better way but you’re not selfish for wanting to lead your own life and experience things you won’t be able to at home, your parents are A’s for expecting you to give up everything because they chose to financially support your sister and work a lot, your sister is a mum and needs to think how her daughter would feel in that position and how she’d feel as her mother, would she really want her to have the same life as you? It seems they only want you around because they need you and they are not thinking within your best interests.\n\nAnd lastly can I just say that I’m proud of you, you’ve helped raise a child, been a hands on aunt, lost countless nights of sleep, still did well at school as well as hold down a job to financially provide for family members and you still managed to work hard enough to get a scholarship into a decent uni with all that going on! You are brilliant! You matter and your achievements matter! And don’t let anyone tell you otherwise!", "NTA but please be careful, ensure you have all your documents and do not get coerced into staying. This will decide your entire life.\n\nOn another note, this is why abortion should be legal.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (18f) have a twin, Mary. We don’t have any more siblings. Mary got pregnant when she was 14. She couldn’t find the father to tell him she was pregnant and he is still nowhere to be seen.\n\nWe have lived with our parents in a 2 bedroom apartment for nearly a decade now. So when Mary gave birth, her baby had to stay in our room. My parents worked more so they could provide for the baby so it was mostly Mary and I at home taking care of her baby. If I wasn’t at school, my parents would demand that I go home and help my sister with her baby. I had no life, no privacy and no love or attention since my sister had her baby. I know obviously the baby and mother take priority but I felt so alone. At 14-15, it was very hard for me to come to terms with my parents not asking me how I’m doing anymore, not congratulating me on my achievements, coming to my games, taking care of me when I’m sick etc. I became resentful of Mary and my parents but I did a pretty good job at never showing them that. I knew the feeling would pass and it did by the time I was 16.\n\nI got at a job at 16 so I had some time to myself outside of school and my niece. My parents then coerced me to contribute almost 80% of wages to help Mary take care of her baby. I’ve always been a pushover so I couldn’t say no, especially because Mary and the baby did actually need that money. Most of the money my parents made was going to bills, rent and car payments. \n\nAnyway, i told my parents I got into a very good college out of state on a near full scholarship and that I’m planning to go. They asked how I can think it’s ok to just leave them to take care of Mary’s baby. I asked why I should stay in a shared bedroom with my sister and young niece for my college years? They said not everything is about what I want and sometimes people make sacrifices for family as they are doing. Mary jumped into the conversation by saying she wouldn’t go off to another state and leave me a single mother alone if the roles were reversed. I said she isn’t alone, our parents are here. She said it’s not the same because they’re always gone for work.\n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA.  I’m sorry for what you’ve been through.  What about the baby’s father’s family?", "NTA, nobody in this scenario is your responsibility except you. Go. Enjoy college and get out of there. Make your own family of people who do appreciate you and are there for you.", "Don’t you DARE pass up this opportunity.  If your family doesn’t care enough about you to want what’s best for you, you’ll have to care enough about yourself.  I’m so sorry they don’t see you as your own person.  Hugs and best wishes for an amazing future!", "Don’t ever look back", "NTA\n\nThe \"baby\" is old enough for Mary to be working and supporting her own child.\n\nYou're being used.", "Nta. Get the h#@@ out", "NTA. Go, enjoy, get back the time you lost, and excel.", "NTA. You wasted enough of your life helping them. It's time to take care of yourself. Hope everything works out for you 💜", "NTA. Get out and live your life.", "NTA. You owe it to yourself to go. It is time to put yourself first. You have done very well, and you have acted honorably. You only live once, and you sound too smart to become a free live in nanny. \n\nDont even concider staying! You have NOTHING to be ashamed of!", "NTA their expectations of you are selfish and completely unreasonable. Go to school! Have fun! Get your own life!", "NTA. get out of there and please don’t return if possible. these people are borderline abusive and it’s better you go LC with them.", "NTA get all your documentation and leave happily. Do not come for holidays and learn to say no before your life is consumed even more. Work on and around campus and build a savings and experience to where you will not have to love back.", "OP, don't you dare sacrifice your future and to burn yourself to keep others warm.  I know they are your family and that you love them, but they are completely taking advantage of you. Please, please don't let them. NTA.", "NTA.  You are 18; go enjoy your life that you deserve at college.  It is bad that you had to be parentified to take care of your niece and twin during your teenage years.", "NTA!  It is NOT your responsibility to take care of your niece and sister.  Tell them straight that you're going out of state to college, and that's that.  Don't let them railroad you into doing what they want.  They are using you.  Don't let them.  Good luck.", "NTA. Your parents and your sister are abusive towards you and highly exploitative.\nYour sister made an awful choice and it's HER responsibly not yours.\nShe can get off her ass and get a job, or start seriously tracking the sperm donor.\nHoney get the hell out of dodge as soon as you can.", "Definitely NTA\n\nYou've sacrificed enough, you are not the babies parent.  Yes it's good of you to help your sister in this time but she is the parent and has to stand on her own two feet.\n\nGo and live your best college life and don't look back and don't feel guilty.", "NTA. Everything’s already been said, but seriously you already gave too much of your life (**and paycheck**) when it wasn’t even your responsibility. Your family should be grateful for everything that you’ve done.", "NTA. Please please please leave your living situation behind and find your life. I’d make a mental plan of not returning home on school holidays unless I have a last-minute escape plan. \nI’d consider you a victim of abuse at this point.", "Please just GET OUT OF THERE. This is never gonna stop, they’ll always want more, and your wants and needs wont matter. \nI know it feels like you are responsible for your sister and baby, but you are not.\nI would leave ASAP and go no contact/low contact.\n\nEdit to say NTA", "NTA. You need to get out of there. They will drag you down for the rest of your life if you let them.", "NTA & I'm sorry some of your formulative teen years have been spent pressured into a life that wasn't your own... I am the type of person who always wants to help others, however, you've already given up more than enough so far and it's unfair of anyone to expect you to put your life on hold, so *you* can't build your own family (meeting partner, making friends who may become your chosen family) until your sister has found someone else to take care of her. It is *not your job* to look after your sister & her child. I hope you have an amazing time when you head off to college!", "NTA at 13 i was still playing lego. She is still a child, didn’t have to keep the baby - she could have gave it up for adoption or abort. I dont get minors who are f*cking like rabbits…", "Don't walk, run to that college.  It's your parents job to parent their child, not yours.  NTA.  Go live your life.", "NTA. Go get your butt to college and work hard as you have to graduate and get a kick ass job. \n\nYour sister and parents are AHs though. If they persist on trying to stop you, I would, and I’m sure it would feel sucky, is go low contact. If they continue to try and pressure you, may ultimately have to go no contact. But that’s a bridge to cross at a later time. \n\nI feel for you. But down let them drag you down. Shoot for the moon. Even if you miss, you’ll still land amongst the stars.", "NTA. You do you boo", "Run far far away and never look back.", "NTA\n\nLEAVE!!", "Massively NTA op! Please go and make the most of this amazing opportunity. Hopefully one day you can have a nice relationship with your family but please put yourself first because they definitely won’t.", "NTA your family sounds like a bunch of horrendous manipulative people", "Please go. Please don't spend the rest of your life thinking \"what if...\"! Please go!", " NTA,run don’t walk to that college and create a life for yourself. Your sister made her bed.", " NTA I was a teenage mom although I was 18 and not 14 when I had my son. He was MY responsibility and not my siblings’! I appreciated their help when it was offered but I never expected it. It’s ridiculous that you’ve been expected to take care of Mary and her baby. \n\nYour parents are also screwing up here. Mary should have been using this time to develop her job skills and get some additional training or education so she can support her daughter herself. It’s stupid to sit around and wait for a man to save her. She needs to be an adult and manage her own life. \n\nGo and enjoy your life!", "Nta.  Why can't your sister take care of her own child if she doesn't work?  Do not give up your life and dreams because the people who birthed you have none.", "NTA. Save as much as you can. Keep as much of your wages as you can. Contact your college as early as you can and set up some privacy restrictions on your information so your parents can’t try to un-enrols you. And the second you can leave for college, run!", "Take the scholarship, move out, and do not look back. NTA.", "Don't sacrifice your future any further, she made the mistake, not you, it's up to her to deal with it.  She could have aborted or given it up for adoption, it never was your burden to bear too.\n\nNTA.", "NTA leaveeeeeee and live your life.", "NTA - You have your life to live. Your sister has hers. No one who really cares about your best interests is going to ask you to sacrifice your future or such a great opportunity for something that isn't your responsibility. \n\nBeing an aunt does NOT make you responsible for your twin's child. You are both adults now. You both need to get along in life and start being responsible for yourselves. \n\nThey've relied on you because it was easier. They're scared of how much extra work there is without you. But it just means your sister needs to step up as a mother and get a job.", "NTA leaveeeeeee and live your life.", "NTA, it's time for your sister to grow up, like you were forced to do. She needs to get a job, the baby isn't a baby anymore and will start school soon if she isn't already. No need for sister to sit at home all day and mooching off of you. You've given more than enough to your parents and sister. You should be able to enjoy yourself going to college and live your best life. Leave the moment you can and start living for YOU! You earned it and very much deserve it.", "Please OP, go live your own life. You deserve it.\n\nYou are definitely NTA.", "NTA. You have been a mother to child that isn't yours from a young age. Your parents are pretty crappy too for making you support her financially", "NTA\n\nYes, family should make sacrifices for each other. Surely they can make the sacrifice to make do without you so can live your own life and build your own future. Mary is not your responsibility, her kid is not your responsibility. You owe it to yourself to leave and stop being this pseudo-spouse to your teen mom sister. She can fend for herself, but if she can't, she's more than capable of learning to. She also has your parents there for support, so just leave.", "NTA\n\nRun as soon as you can.", "NTA. Please go and live your life away from these people. You are not responsible for your sister's mistakes and it is incredibly selfish of her and your parents to ask all of this of you. Don't let them guilt you out of the rewards for your hard work. Please, OP. Get as far away as possible. They will drag you down and keep you there.", "NTA. It's time for you to cut ties and live your life. Mary can take care of her own kid. Dont send them any money home. Get your education and save as much money as you can so you won't have to move back home.  I would live at least a few hours away from them after college so that they dont try to force you to let mary and her child live with you", "Obvious NTA\n\n1. After a while stop arguing with your family, and focus on having a solid (and secret) plan to slip away to college. \n2. Please find out if the university has guidance counselors or other staff who can help you make the transition. You have an incredible story, so network with the college staff and anyone else you trust to build a support mechanism. \n3. Prepare for the worst from your sister and parents. Expect them to sabotage your plans. Hide your id's and emergency cash etc. Think of ways in which they can try to stop you. \n4. Stay focused and good luck", "NTA. It’s one kid and she can take care of it. Go to college. If they guilt trip you don’t go home as much and limit your time with them. They’re being selfish.", "NTA. Your sister’s poor life choices aren’t your problem. You lost your teen years, don’t give up your college years, too. Go and enjoy yourself.", "NTA- honey I am so sorry they have treated you like this! What they have done to you is literally neglect and financial abuse/control. It’s obvious your crappy family isn’t proud of you but clearly reddit is! Go girl! Get that degree, start your life, you bloody deserve it! You’ve sacrificed more than any child ever should have to.", "You're sisters life choices do not make for your punishments. Wtf NTA. I draw the line at forcing you to give up money at 16 that you made towards her. If you wanted to help babysit for free every now and then, that's about the extent of what's expected of you. Save your own money, go to the university you got into, and live your own life. Your parents stopped recognizing you as their own child 4 years ago. Have fun in college and don't get pregnant lol", "NTA. That’s a 4 year old. Not a baby", "NTA\n\nYou already sacrificed your teenage years for your family. Go enjoy college out of state!", "NTA.   \n\n\nOh so very NTA.   \nRun girl, run. Get out while you can!", "Dios mio NTA, felicidades por entrar a la universidad que querías! Eres libre de ir a donde quieras, tienes 18 años, ellos no pueden decir lo que puedes hacer, da igual lo que ellos harían si los papeles fuesen al revez, esta es la realidad y ya sacrificaste tu adolescencia por tu hermana h sobrina, ya cumpliste y no les debes nada", "No, you've gotta live your life. As a person who delayed everything out of fear about my mom's health, you've got to do what's right for you.", "I would go and go low contact. Live your life.", "NTA. Mary needs to stop being a parasite to you and your parents and grow up. You weren't there when she was having fun making the kid, so why should you suffer the consequences? Them gaslighting you into financially supporting your sisters offspring is terrible behavior on everyone's part. Leave and don't look back. If you don't, you'll resent your family for the rest of your life. Let them know that you need to live your life and they need to live theirs. Maybe if you become successful, you can help out again, but for now, I repeat, live your life. You deserve it.", "So, what are you supposed to do? Work your way through community college, only for your family to lay a guilt trip on you for prioritizing school over a baby that isn't even yours? Perhaps you should skip college and work shitty low-paying jobs to support your niece until she either gets a job, or finds herself a sugar daddy. Chances are she'll make the same mistakes her mother made, and come crying to Uncle OP for help. \n\nYou are definitely NTA. Take advantage of your scholarship, and build a good life for yourself. God knows you deserve it, especially since your adolescence was stolen from you. Don't let your family ruin your life.", "NTA, but you need to be extremely careful around your parents and sister because they may very well try to sabotage your scholarship by trying to give it up in your stead to force you to stay.  \n\n\ngiven the way you've been relegated to a servant and a wage slave for a kid that isn't even yours, i wouldn't put it past them to try anything to keep you chained down to their household.", "NTA. Go to college and live your life. Mary and your parents made their choices now you need to make ones for you. I would go very low contact with your family as they will probably harass you the whole time you are in college.", "NTA. Holy hell run. And start gathering your documents. Put them somewhere safe your parents can't get. Also I'm not share as much of your income as you want.", "NTA, you’ve already sacrificed enough. Sister will need to be responsible.", "Not your fault that your sister spread her legs at that age and ended up having the baby. Love your life the way you want specially considering that you suffered and compromised and yet got a scholarship and achieved what you wanted. Go live your life. Your parents are far from rational and logical so don’t think they will be let you do your thing. But you have a future ahead of you and you should make it bright unlike your sister.", "NTA. Move as soon as you can. You didn't make that baby you're under no obligation to watch or contribute to the kid. It's easy for Mary to say she wouldn't go to college because she's used to everyone else sacrificing for her benefit.", "NTA - go live your life and have a great time.", "Hell no.  Your parents are horrible people.   You've helped more than enough.   \n\nNTA", "NTA- Mary and her kid are not your responsibility. You’ve already contributed so much more than you should’ve. Don’t worry about them- it’s time to live your life now", "Run run run.  This is a ridiculous living situation that should never have been allowed to happen.  You are escaping, and don’t feel guilty over that.", "NTA. Please run from these people.", "The nerve of them to ask you to sacrifice your college education and your scholarship 🙄\n\nNTA\n\nLC I suggest", "Your sister and your parents sound very selfish. They made you a 2nd parent to that child when she's not your responsibility. \n\nSince you are the same age your sister, maybe she could get a part-time job or even a full-time job. The child is 4yo and assume is at school most of the morning. Your sister needs to step up to her parenting now. It's hard for her since she's such a young mother but you helped enough. Now it's time for you to live your life, get your education and your degree. Don't let me them make you guilty for thinking for your future.\n\nNTA", "NTA you gave them nearly all of YOUR hard earned money and time for FOUR YEARS.\n\nPlease take the opportunity and live your own life! You are important too and your decisions are only YOURS. Same with your sister. It was (hopefully) her decision to have sex, her decision to keep the pregnancy and her decision to keep the baby. I won't say that these decisions were bad, because they were perfectly okay for HER. But you didn't make them.", "A 4 yr old isn’t a baby, & it’s troubling that your parents are treating your sister as if she’s still a young girl. You’re the same age, yet developmentally you sound much more mature. \n\nYour parents are her parents. They shouldn’t expect you to give up any more of your life & future because of your sister’s choices. Three adults can handle a child, especially when one is a SAHM. Your sister has no idea what most single moms go through.\n\nNot only should you go, it may turn out to help everyone, OP. Maybe seeing you advance will motivate your sister to get her act together, start thinking of her own future. And your parents will have to see her as she is, without you taking up the slack. Hopefully they’ll get her help getting her life together.\n\nCongrats on your scholarship!", "NTA - it seems like you’re being punished for your sister’s poor choices. You deserve to have a life of your own. I know it will be hard, but you need to put yourself first for once. Well done on the scholarship, that is a huge achievement.", "NTA and I REALLY hope you go and leave them behind. You may have to block them from your life completely; but you have to be number one for yourself.", "NTA. Your parents are gone for work. You would be gone to college. I'm sorry about the situation of your sister but you can't help her more by standing on the same place. You need to have your own life, job, interests, and in future potentially own partner and kids (if you want that) and you can hardly do this if you are playing second mom to her child. I can imagine it is difficult for her because you are also twins, but at some point you grow out of your nest and got to fly alone.", "Wtf nta run and get out", "NTA.\n\n> They said not everything is about what I want and sometimes people make sacrifices for family as they are doing\n\nSometimes yes. Not always. You were being patentified for/ by your twin!", "NTA. Go girl!  Run. Be yourself. It's not your job to live for someone else. I hope you succeed gloriously", "\"Mary jumped into the conversation by saying she wouldn’t go off to another state and leave me a single mother alone if the roles were reversed.\"  \n\n\nI wouldnt get pregnant at 14 by a stranger", "NTA. Congratulations on all you have achieved in spite of the obstacles actively hurled in your path. Please go to college. Make sure you take all your important documents and belongings with you. In fact, I suggest renting a safety deposit box at a local bank and putting your birth certificate, academic paperwork, etc there until you leave.", "I am so proud of you for standing up for yourself and living your own life! \n\nWhat you have done for your sister and niece should never have been asked if you, but it is amazing. Raising a baby is hard!\n\nNow go live your best life\n\nAlso, if you haven't yet, you might find the mom for a minute sub helpful (don't know how to link). As you move on your own they are always happy to give advice or internet hugs. \n\nAnd big hugs from this internet mom who is so proud of you!", "Nta. She chose to have sex at 14 and have a baby without a dad. Her bad choices should not affect your life. You have sacrificed enough already. Go and live your life.", "NTA RUN!", "NTA life your life", "NTA, but you sound smart so you already know this. You will feel guilty for going and they will try to play on that. Go to college on your full scholarship and have the most fabulous life xxxx", "I’m so excited for you! You are going to have so many wonderful adventures in college. You’re not wrong to leave at all! They’re just using (and also abusing) you while your sister gets a free ride. Don’t let them try to make you feel guilty. Go live your best life!!!", "NTA. If your family refuses to acknowledge and support your accomplishments/education would have allowed you to help yourself and sister more in the long run… that’s on them. \n\nGet out. Never go back. And when you find yourself at crossroads of education/school etc…. Remember why you are not going back… ever. \n\nCongratulations - you are a intelligent, wonderful, kind and powerful individual for your accomplishments. College acceptance with a full ride is quite the accomplishment. \n\nI’m a parent. I’m proud of you. Today my Reddit daughter (Abject_Panda_27) announced she got accepted into college with a full scholarship while working and supporting her sister when she didn’t have to. \n\nHey fellow Reddit parental - tell our reddit daughter how proud you are of her.", "Holly parentification Batman NTA\n\nYou are not the parent, it's not your job to financially support or give up all your free time. There are a lot of posts that cry 'parentification' over just casually helping out but this isn't one of them. \n\nRun, run as fast as you can to YOUR future. You've supported to an utterly unreasonable level for four years already. You've gone above and beyond, you are long overdue being able to focus on you and your needs.", "NTA. Sweet, you are entitled to live your life for you, however you wish. You shouldn’t be expected to shoulder responsibility for your sister. Congratulations on achieving such a wonderful opportunity! Look how well you have done despite the circumstances at home. Just imagine how wonderful you will do when freedom is on the cards. You have a bright future ahead, don’t feel guilty or second guess yourself for that. This stranger is proud of you and cheering you on. All the hugs.", "You’re most certainly not the A! Go to college! Go!", "NTA.  If she was 14, isn't the baby 3 now?  So will start kindergarten in 2 years?  Your sister can work part-time when that happens.  Your scholarship won't wait 2 years.  The hard part is in many ways over.  Three year olds are social, have routines, can be at least day potty trained so no diapers or less diapers.  No special food.  Can wear Salvation Army or Value Village clothing; there are beautiful items for that age group.  Books from the library.  Some elementary schools will allow 4 year olds to start kindergarten.  They are tested. Must be able to hold scissors or a pencil, have some listening or social skills.   You could look into this and encourage your family to read to the child, teach her abc's, prepare her.  It will ease the burden of the household in your absence.  Regardless, good for you for working hard and creating this wonderful opportunity for yourself.  Good luck.", "NTA. Run. Come back and visit but don't allow them access to any information they could use to sabotage your new life.", "NTA. Run! You are not responsible for your sister’s poor life decisions. Since your sister decided to have and keep a baby at 14 she needs to be responsible for the child, who is old enough for school at this point so is no longer a baby. Move out, find your own life, and don’t come back.", "NTA- run, break free! You've been used long enough. Prioritize yourself since your parents haven't for years. And don't feel bad or guilty, they only want you around to maintain their status quo at your expense. Please, go! You'll do more for your niece by setting that example than you would sticking around.", "NTA\n\nYou didn't get pregnant but you're getting treated like you did. Go live your life. You've given enough to the baby that isn't yours.", "NTA. And it’s not your job to solve any of this but if it makes you feel better, by my calculations the “baby” is old enough for preschool if your area offers a free program and next year will be old enough for pre-K. \n\nI’m not trying to shame anyone for being poor. Our social net in this country is not great. \n\nBUT your sister can get support outside of you if she gets off her ass and finds it. It sounds like she hasn’t even tried.", "NTA. Grasp that college scholarship with both hands and RuN for it. Congratulations on your accomplishment and on surviving adverse circumstances. Please don’t allow yourself to be turned into a human sacrifice.", "NTA.\n\nGo. This is a once in a lifetime opportunity with the scholarship and YOU NEED TO LIVE YOUR OWN LIFE.\n\nYou know you have a hard time saying no but they know that and have been taking advantage of you. Maybe purposefully or maybe not - the fact remains that you will lose years of your life, and your future, if you stay wrapped up in the family dynamic built over the last four years. You need to strike out. DO IT. \n\nI know it's easy for me, an internet stranger, to say that - but Mary and the baby will be fine. Mary's 18, she's an adult with a kid now, and your parents are still young and helping her out. You are the bonus person here who makes their lives easier but the baby is 3/4 now and it's preschool time. You and Mary should go to college to your respective choices, your niece to preschool, your parents to work, and everyone's lives will be easier and better for it.", "NTA and you never should have been made to feel responsible for Mary’s baby. I get helping out, but you should not have to give up your hopes and dreams and goals for Mary.\n\nTake that scholarship, go to college and live your life. If you don’t, you’ll end up resenting your family.", "NTA nor is your niece, but your sister and parents are. What kind of parents let their 14 yr old keep their baby when no one can afford it? She should've been put up for adoption. Also if she needed money so bad to raise her child, then she should've gotten a job instead of mooching off you.\n\nTell them to have a nice life and go live yours. She is not your problem nor is your niece.", "NTA  OP, you're actually being abused and you need to get out ASAP. Do you have all of your important documents in a safe place? Documents that you would need to actually live your life or do your parents have them? I also think you need to speak to the non-emergency police line and ask them what you can do because your parents will not let you leave for school if it gets that far.", "NTA nor is your niece, but your sister and parents are. What kind of parents let their 14 yr old keep their baby when no one can afford it? She should've been put up for adoption. Also if she needed money so bad to raise her child, then she should've gotten a job instead of mooching off you.\n\nTell them to have a nice life and go live yours. She is not your problem nor is your niece.", "My grandfather was in a situation like this and his family didn't want him to marry and have his own life bc he was the only boy of a widow. He eloped and came back home and kept it a secret for 6 months until he finally worked up tje courage to tell his mother. His sister's never married. They stayed tied to their domineering mothers side forever. Moral of the story, Get out while you can.", "NTA. Your family is in a shitty situation but it's not your responsibility to solve it. Going to college will also, hopefully, allow your to get a job with much higher earning power than staying with your parents which could help your family in the future if you're willing to help them. Considering your story I would probably go low or no contact with your family, if you do get a better paying job in the future they will most likely only see you as a cash cow. You could probably also use some therapy. \n\n Tbh most sane people would have argued that your sister should have had an abortion at 14.", "Sorry I'm fixated on Mary at 14 having sex with so many guys she couldn't figure out who the father was.\n\nNTA, run girl run and get away from these people.", "NTA, please go finally live your life! What your parents did to you it's abuse a theft. And they are trying to guilt trip you to stay. I would honestly consider at least LC for some time.", "##NTA\n\nOP, leave now when you can; otherwise, you’ll NEVER leave and you’ll regret it for the rest of your life (and resent your sister and her child forever).", "You’re being abused. This is abuse. You are being manipulated into handing over your money and taking on their responsibilities. If your parents really cared about you they would be encouraging you to go to college. Especially on a full scholarship. It’s very hard to understand when you’re young and it’s a horrible thing to have to accept but your parents DO NOT care about your happiness. They don’t even see you as your own person. You are a means to an end for them. I seriously think you should be considering no contact but at the very least you need to leave. Do not do something so stupid as to give up this scholarship. Are you planning on having a family of your own one day? Do you want your kids being treated like this? \n\nFucking RUN and don’t look back", "NTA make sure your parents don't have access to your email or anything, so they can't pretend to be you and turn down the opportunity. Also confirm when opportunity with the school as soon as possible, and if you think your parents will try to call the school either pretending to be you or pretending to act on your behalf let the school know.", "NTA. Go away for school. Go get your own life! You didn’t decide to have a child, your sister did. You’ve done too much already. Go be free!", "Nta. YOU NEED TO LEAVE. Your niece is NOT your responsibility it’s your SISTERS.", "Be careful your family doesn't hack into your email account and send a rejection or something. NTA.", "NTA\n\n\nGO!!! For the love of god, go!\n\n\nThey aren’t asking you to put your life on hold they are asking you to give up your entire life. The result of you not taking the opportunity will impact your life forever. Don’t listen to your selfish family as they just want free help. Not even free, you’re paying to help.\n\n\nGo and live your life, not your sisters", "NTA, OP. Keep moving forward, your sister & her baby are not your problem. Live YOUR life now. Good luck out there.", "NTA - you have sacrificed enough", ">They said not everything is about what I want and sometimes people make sacrifices for family as they are doing.\n\nWell apparently NOTHING is about you or your wants and needs. I think you have sacrificed enough for that family. Mary made her choice, your parents made their choice. Now it is your turn and you need to choose you! No one else is going to put you first and they haven't for 4 years. You be the best you can be, go and find freedom and watch how much you blossom and thrive when not tied down to being a provider and built in babysitter. You deserve a life and now is the perfect opportunity. If you don't, they will forever guilt you and manipulate you into staying, and you will resent them for losing out on such an opportunity.", "NTA any day of the week. I'm angry on your behalf. They're all taking advantage of you.\n\nIf you pass on this scholarship you will regret it for the rest of your life. You've more than earned the right to live for yourself after paying for your sisters baby from your own paycheck.\n\nSpread your wings 😁", "NTA. Look, yes it's going to be hard for the family. It always is. But this isn't your responsibility at the end of the day. You are your own person, and I think moving will be the best thing you could do to reclaim that. Don't put your life on hold for your family's choices!", "You've already given up a significant part of your childhood for Mary, it's time to leave and learn to be you, to live for yourself for a change. This isn't about a few years, it's about the rest of your life and choosing a course of action that potentially gives you a well paying job, meeting a future husband/wife also with a well paying job, or being stuck on minimum wage for the foreseeable future! NTA. Get out and grow, have fun and don't be burdened by guilt for choices you didn't make.", "NTA. Please do go out of state and start living your life for your sake. It’s not your responsibility for Mary’s actions.", "Very clearly NTA, and as many other commenters have said, you should go live your life and enjoy your freedom during your college years and beyond.\n\nOne extra note I wanted to make; please please please don’t be guilted into sending money back to your parents when you get a job in the other state and attending college. You don’t deserve to be left vulnerable and without that money when you’re making a new life for yourself. You deserve that money you worked for, and shouldn’t have to send it back. When you leave, take your money with you and don’t take the finance responsibility of paying your sisters way with you; leave that at your parents house. \n\nGood luck OP", "NTA Be sure to contact admissions and let them know your family which includes a twin is against your attending and it’s very possible someone pretending to be you might try calling to say you aren’t coming or otherwise sabotage your place. They’ll have dealt with hostile families before.", "First of, congratulations! That is such a huge accomplishment! As a mom, I want to say I'm proud of you even if I don't know you personally. I understand how hard you must've worked to achieve your scholarship.\n\nSecondly NTA. Make sure you respond to the college and has accepted the scholarship as soon as you can. I think you shouldn't be telling them your plans anymore. You don't want anyone acting sneakily and derailing your dreams. Save up now and make your exit plans now. You've been a good sister, auntie and daughter. You've done something that was such a huge thing to ask of you at your age. It is now time to live your life. Good luck!", "There’s something about Mary — she’s an AH. You don’t need to give up your life for her choices. And your parents are AH.\n\nIt’s probably for the best you give her less help — less time for her to possibly go out and get pregnant again.\n\nLeave and don’t look back.\n\nNTA", "NTA- you didn’t have a child and you have been more than considerate. Your future matters and congratulations on getting into college!!", "NTA. Fly free. \n\nYour parents and sister are so incredibly selfish, I hurt for you. \n\nLoeve your best life and stand up for yourself! No one else will. People treat us how we allow them to. Don't forget that.", "NTA  - Run girl, run far away from this and don't look back. You need your life, not sacrifice it to someone else mistakes.", "Get out now or you never will. They want you to sacrifice your future to help the family which isn’t fair to begin with and is quite silly instead of realizing that you could help so much more down the line if you get an education and a decent job. \n\nJust stop engaging or justifying bc they aren’t thinking or even arguing logically. \n\nWhy should you give up your entire future bc she got knocked up at 14? That makes no sense at all. Your sister has PLENTY of support and needs to take care of her own child (who should be old enough for elementary school by now.)", "NTA I’m so sorry they have conditioned you into thinking you don’t matter.  She could have given the baby up for adoption if it was such a financial burden.  The baby is her responsibility.  Her situation is not yours to fix.  F them all for guilting you.  Get out of there now.", "You’ve got to be kidding. You’re not a slave and they’re not entitled to treat you like one. You need to get far away from them and live your life. You’ve sacrificed so much already and she needs to be an adult and take responsibility for her own actions. Don’t miss out on this major opportunity just because they want to coddle their favorite child. Don’t set yourself on fire to keep others warm", "NTA, absolutely, and best wishes for college, from an Internet stranger!", "NTA, congratulations and I hope you can go to college with a clear heart after this thread. \n\nIf it helps, I believe they will forgive you in time (and you them, possible longer). People a) hate change and b) want an easy life. For a while, they will be like children from whom you have taken away the stabilisers on their bike - afraid and resentful. \n\nBut you need to do this. And they, to be honest, need you to do this. \n\nIt’s hard thinking about your niece being left at the mercies of a family who are freaking out this much about how to look after her. But better that she has an aunt to look up to and talk to in time, who is independent, happy and living her best life. \n\nGood luck! Have a wonderful time at college!", "NTA  \nRun and build your life. Your sister would do the same if the roles were reversed.", "NTA seize the opportunity you’ve got and run with it. This should never have been placed on you in the first place. You didn’t make Mary fall pregnant and you should never have been given the responsibility you were. Live your life as you deserve to. Your parents and sister will have to figure it out. It’s not your problem.\n\nI wish you all the best. I’m sorry to say your parents and sister will not make this easy for you and it will strain your relationship with them. I sincerely hope they ease up once they can’t stop you. Whatever you do, please do not back down. This will be the first step in being able to have reasonable boundaries with them into the future", "NTA at all, but your mum & sister are. It’s not your responsibility to provide for them and you shouldn’t have to put your life on hold. Hopefully you can move out & enjoy your freedom!", "NTA \n\nYou’ve done more than your fair share. It took me over a decade to come to terms with the fact that my younger sisters were not my responsibility. You’re ahead of the game by prioritizing your own future. \n\nAfter doing a bunch to financially and emotionally support one of my sisters through lockdown, she still goes on about how it wasn’t enough. Another regularly asks me for money (I say no because it’s her boyfriend asking). \n\nI just finished grad school and have my own young kids. I get to prioritize my future with them. So do you. \n\nThere are three adults to take care of that baby. That’s 2.5 more than I had. And your sister’s (Sorry to be rude) misjudgment doesn’t lock you into childcare duty. You’re her twin not her. \n\nLet them all be jealous.", "\n\nNTA, but you need to start planning for the eventual reality that your parents—and Mary—will try to stop you from going, if they have not already. \n\nYou need to start gathering your SSN card, birth certificate, bank statements, documents proving things like ACT/SAT scores, financial aid papers, college admissions papers—anything that has vital information on it that you would need to finish application processes, or that could have information that can be used to lock you out of your admissions account. \n\nChange all your passwords to sites involving banking, admissions, social media, and emails. Speak to an admissions counselor to make sure none of your aid is reliant on FASFA info from your family. Make sure you are not filed as a dependent on their taxes or on yours going forward—it can screw up any further financial aid you may need! \n\nIf you have anything they pay for: car insurance, phone, ect, start looking at how to get off of it ASAP. Open up a new banking account and start splitting your checks between the two just in case they have access to your old one/their name is on the account.  \n\nOnce in school, I definitely recommend looking into their mental health assistance programs! College is a big transition on its own without any other issues!", "Good grief girl! NTA Push on with your own life.", "nta. mary made choices supported by your\nparents. they can continue to support her in those choices. also how old is mary’s baby daddy that he just fell off the face of the earth.. not very typical for a teenager. is there a possibility something more sinister happened?", "NTA. Run, do not walk, to that school. Get away from your toxic environment as soon as you possibly can. Mary's baby isn't your baby.", "You have given up a lot to support your sister and her baby. She made the choice to keep her baby. Your parents although supportive of your sister are being incredibly selfish to expect you to give up this great opportunity for college. You need go and not feel guilty about it. Your parents should be supporting your choices as they are doing for sister. If you don’t go you will regret for the rest of your life.", "NTA at all", "NTA.  Go and learn to be your own person now!  Grow and learn and make friends and enjoy your freedom!  And if you get a job, don't let them know! You've sacrificed time and money for years and now you don't have to do that any more.  You can start to be the fun aunt if that's who you want to be, or choose to put them out of your life if that's who you'd prefer to be.\nYour family is going to harass you, so you may need to block them so you can call when you want to instead of being called/texted all day and night.", "NTA Congratulations on this huge accomplishment!!!  Make sure you get all of your important documents together and store them out of the house if possible- that way you can GTFO this fall for school!!", "NTA, and you really need to get out of there. I was pregnant at 17, lived with my parents for awhile, and my little brother was a friend to me, a good uncle, but never did I expect, or my parents expect, him to take his niece on or set his life aside for me! That's just insane, and it's doing your sister absolutely no good at all—she needs to be working on how to grow out of that scenario as well. Night school classes, finding other young mothers to bond with and make her support system with—and eventually get an apartment with.  Go! You deserve the life you have worked to make for yourself!!!", "NTA\n\nRun as far as you can from these people. You have done so well!!\n\nAnd if you have sex make sure you are protected!!!", "NTA another open and shut reddit case for the OP to go low/no contact and go live their own life.", "Do you", "NTA, I sympathise with your sister but her child is her responsibility and you have done more than enough of your share in helping her and your niece. Go to college and enjoy it.", "You are NTA, OP. Run and don't look back, go get an education, live your own life and focus on yourself. I do believe it's high time for Mary to become a parent for your niece because she's not your responsibility anymore.\n\nI also suggest getting your important documents out and notifying the school that you alone are to be notified about anything regarding your admission and scholarship because there's a high chance that your parents and sister can and will sabotage your college dreams to force you to cave in.", "NTA Go. RUN. Fast. NEVER go back!!!! It's not your responsibility to take care of someone else child. They should've never taken your money! Don't go back no matter what. Go live your life. I'm so proud of your accomplishments! A full scholarship is amazing kiddo ❤️❤️ wishing you all the best", "NTA\n\nIf they come at you again about the financial burden of you not contributing point out to them they will no longer be feeding you. I’m glad you’re getting out. Maybe with you gone your parents will see just how little your sister is a drain on the household.", "NTA, and please leave without any regrets. You deserve your own life and your parents have treated you horribly.", "Nta. A pregnant 14 year old is the responsibility of her parents as is the baby. Not another 14 year old. You deserve your own good life.", "NTA run!", "NTA - you're a kid too. You've sacrificed already. Great you helped out and to Such an extent, but now your studies dictate a move. That's life. Trying to hold you back is a small-minded move.  What happened to your sister was statutory rape - was it reported to the authorities? Were options (eg adoption) discussed? The guy who \"can't be found\" (take it it was an adult then, as this implies he's old enough to move around) should have a child sex abuse charge over their head - Rape is a tragedy, but it's not one the whole family should have to pay for. One or both of your parents has a martyr complex. Your sister doesn't know any better, she's probably afraid to be left alone with Them.", "NTA. Elsewhere you said you think your parents and sister won't forgive you for leaving. You're the one that should not forgive them for robbing you of your adolescent years.\n\n\nTake the scholarship, get tf away from your AH family and maybe look into therapy while at college - this will have damaged the way you view yourself and the world in ways that you may not realise. It will be good to have a sounding board of what is normal and what isn't.\n\n\nWell done on the scholarship by the way, I wish you a wonderful and full life of your own design.", "NTA. I am sorry for your sister and your parents, but this is not the time to sacrifice your own future for their current needs, that you are not responsible for.", "Am I the only one with “here’s your one chance Fancy, don’t let me down” running through their head?", "NTA. Leave. Don't put your life on hold for other people's decisions. You'll be better positioned to help financially and professionally (if you choose) with a free college degree.", "NTA go to college.  Trust me they’ll figure out how to make things work. They just don’t want to use other options because using you is easier for them", "NTA. Not the father. Not the mother. Not your child. I know it's a damn sight more complicated than that  when families are involved, but that's the crux of it. It is not your fault your sister had a baby so young. It is not your fault your parents chose to parentify you instead of dealing with things themselves. It is NOT your fault your sister has chosen to rely on you so heavily instead of taking on the role of single mum as she should have done from the start, and it is certainly not your job to clean up the mess left behind. Please, go. Live your life. Perhaps being forced to step up alone without you as a crutch is exactly what your sister needs. Also, your parents have a lot to answer for here. 80% of your income? That was their job. Not yours.", "And please check in with us once you are settled in at college!", "NTA. RUN! They have been financially abusing you for years. They want the money and free nanny. They don’t want you. Go to college and don’t let them guilt you anymore. Don’t give them any more of your money. Your sister should be working and supporting her own baby.", "NTA go to school do not let your family ruin your life.", "NTA. Sounds to me like you’ve already done more for your niece than her own mother. Time for Mary to step up to the plate and take responsibility.", "I actually asked my mom when it would be acceptable for me to leave and live my own life and she said when Mary isn’t a single mother anymore. So I have to wait till she gets a serious boyfriend/husband and move in with him till my duties are done? I’m not willing to do that.", "There’s no way I’m giving up the scholarship. I’ve worked way too hard to get it. And I’ve been counting down the days till I can leave this household and live for myself. I’m not even contemplating staying to be honest, but I’m wondering if it’s wrong of me. I get the feeling Mary and my parents won’t forgive me if I leave.", "No she doesn’t have a job. She had two jobs since the baby and she got fired from one for stealing and the other for being constantly late. She hasn’t tried to get another job since and the last job was a year ago.", "See and this is where you would respond to Mary with something like \" you're right, this is where we are different I would leave to live my.kife, but at the same time I wouldnt get knocked up at 14 and try and hold my sister/parents hostage with my dumbass mistakes\"", "Jumping on this comment to say: If your bank account is not ONLY in your name, change that ASAP and open one that only has your name on it. Then, transfer any of your money you've saved to that account. This will protect you from ANYONE going into your account and taking your money because \"mArY/fAmIlY nEeDs It MoRe\" NTA", "Now why did this make me cry 🥹 thank you so much. I really appreciate it.", "Yeah the kid will be in kindergarten in a year or so.", "I hadn’t even thought of that. Will do. Thank you!", "Your parents may be desperate enough to open credit cards in your name. So lock down your credit. There’s excellent resources on line.", "Ooh good idea. Don’t go rushing back every break.", "Also, the way OP describes her late childhood, she may not even have many friends. If so, put some energy into making a network outside her immediate family. College is a great way of making friends. If she has friends, she should prioritise them and school.", "I agree about NTA but I do want to point out that there are red flags anytime a 14 year old girl ends up pregnant. I wonder if her parents pressured her into keeping the child. I also worry about whether the circumstances around conception were consensual. Still not OP's responsibility but I do feel sorry for the young mother.", "I wish I could upvote this all the way to the top. She needs to watch out. Gather documents. Open a new bank account.", "Fuck them and fuck your whole family.  My wife's family made her pay their entire mortgage from the age of 14 and said she was lucky she had such a good life.  Stories like this piss me the hell off.  You didn't have sex, you didn't have a kid, you didn't do anything and you need to get out...NOW", "The child isn’t that young anymore either so even if they’re not at nursery yet they’ll be at school in the near future! Mary needs to sort herself out.", "in 10 years time send them a check for $3 as a contribution :)", "Theres a current post about a mother letting her kids pick if they want to share a room or have thier own and yet here OPs parents are 'You WILL stay in the same room as your adult sister and a toddler'\n\nSuch a contrast", "I wanted to tell them when I was applying but they have issues of interrupting me when I’m talking and/or just not paying attention to what I’m saying. When I first brought up looking into colleges, my dad must’ve interrupted me like 5 times. I just stopped trying to say what I wanted to say. It gets tiring trying to talk to them about myself when it’s clear they couldn’t care less. They wouldn’t be paying attention to what I’m saying or they’d interrupt me and move onto a different topic. I didn’t even bother with telling them about the applications because I didn’t want them to brush me to the side again. I don’t speak to them much unless it’s about my niece or Mary. \n\nI told Mary about applying to colleges out of state but she would be on her phone and just reply with one word answers. I think she thought I just wouldn’t get in. When we were younger I wasn’t that bright. My grades started picking up when I was 14 ish and that’s the time they all stopped paying attention to me so she didn’t know I was doing well in school. \n\nThank you so much 🥺. Your last paragraph is what I really wanted to hear from my parents. They haven’t been proud of me since before my niece was born.", "It was just one guy. She just doesn’t know his full name or any details we could use to find him", "Did you get your sister pregnant? No? Great, not your kid, what they're gonna do? Sue for custody? Demand child support?\n\nGo, live your life, be happy", "Your mom is delusional.", "And I bet your sister will have more kids that you’ll be expected to parent. Please go to university and leave these AHs behind. You’ve sacrificed your late childhood to these people, don’t give them any more.", "Hey Op if you accepted your offer contact your school and notify them that only you are able to make decisions.  That your parents or sister may try and sabotage your admission.  See if you can set up a password.  I've seen people pose as the applicant to withdraw.", "Nta\n\nGet out of there asap and don't look back. You've already done enough for your sister and niece. Go live your own life. That full ride won't be an option if you put it off for years. This is your opportunity to get an education for free", "And you shouldn’t be willing to do that!!! Please - go and live the live YOU chose, and leave her to live her life. You’ve done so much already - she should be grateful. NTA obviously", "I'm honestly guessing your parents resent your sister too in a way, and don't want to be miserable alone or have to do even more work to fix your sister's mistakes. \n\nIt's not your job, live your life. You may lose your family, but it honestly sounds like you already have.", "Holy crap! That must have hurt to hear your mom say that. Your sister needs to get a job too, put your niece in daycare when needed. Every cent she makes will probably go towards that daycare but she needs to get out of the house as much as you do. Sounds like your parents dictated she would be stay-at-home? She probably feels trapped too. Get your degree and a better paying job. Then help your sister do the same if you can.", "Nor should you be. Selfishness rears its ugly head eventually", "Nah, girl, live your life", "Not your monkey. Not your circus. Be selfish for once and put yourself first.", "Bruh tf is that kind of logic? You’re just supposed to waste a good chunk of your life helping out her own mistake? You really should get out of there and live your own life you shouldn’t be tied down", "Absolutely shocking. Tell your parents to get fucked. Live your life. Your sister will understand eventually. NTA", "Absolutely not. You’re not a teen mom. Mary is. Get out ASAP and don’t look back.", "You’ve done way more than enough already. You don’t have to ruin your life anymore just because someone else ruined theirs. Go.", "Sheesh. Mary doesn’t need a boyfriend, she needs a damn job/education/marketable skill. It kind of sounds like your parents are looking to shove her off on someone, like she’s damaged goods.", "Then Mary needs to get busy because you start college soon! Go! Save yourself at least. In most places a college graduate has more earning opportunities than a high school grad. You could actually help your niece more by going to college.", "This is some weird-ass parentification. \n\nAnyway, NTA. Please get an education and a good job to break those chains. Maybe if you are so inclined and to note are by no means obligated to you can help in a more meaningful way. Though for your mental health and well being, I suggest LC to NC.", "Girl tell them to all fuck off. You've given them so much more than they deserve. They're basically just taking advantage of your niceness", "NTA- I would tell you mom, you going to college is the only way your family will ever break the cycle of poverty. Also you not being home is one less mouth to feed.  You’re families logic is backwards. \n\nCongrats! And good luck with your future endeavours.", "FYI, you’re 18 hun, a legal adult. You could leave that house today and not a thing can happen to you. They cannot force you to sacrifice your life and money because your sister was irresponsible and had a child while still a child herself. Obviously NTA", "That's awful. Life your life OP.", "Oh my god, Is there any way they can stop you from leaving? I hope you can run away", "Nahhh live your life", "Put a password on your scholarship at the school, just in case they try to force you to stay", "There’s nothing to forgive you for. You have been a child for the vast majority of your nieces life, and you’re neither your nieces parent or Mary’s parent. Your family has neglected, parentified and extorted you for 4 years. The question you should be asking isn’t “will they forgive me”, it’s “should I forgive them” - and that’s a question to answer once you’re fully independent from them and have had space to process and heal from the last 4 years.", "They sound selfish and honestly you shouldn't seek their forgiveness. Mary made her choice and that isn't your choice. It's not your job to take the father's role you are a just becoming an adult. You gave your late childhood to Mary, you shouldn't feel guilty that it's enough", "Make sure that they can't cancel anything in you name. Not sure about the option where you are based, but maybe you could ask a school councelor to help you make sure that nobody can screw this up for you. Easy and obvious is making sure they can't access your email accounts or physical mail.", "If they don’t forgive you so what! Live the best life that you can, and that means leaving. Go to college, enjoy! NTA", "Please contact anyone associated with the scholarship or school that you and only you can make any decsions regarding your future. I would not put it past any of your family to sabatoge this chance for you.", "Not sure if it’s been said but look into what moves you need to make to ensure you can get away to college. \n\nBirth certificate\n\nSSN\n\nnew bank account at a completely different bank to your parents with a branch near your future college. \n\nThat type of stuff. \n\nParents do craaaazy stuff to try and keep you locked down and dependant on them. Don’t let this opportunity slip away from you. Well done on the scholarship! \n\nNTA.", "If they don’t forgive you, it will hurt like hell, but frankly OP you deserve to be free of these people. They are treating you unkindly. They do not want what is best for you, sadly, so you must want it all the more for yourself.", "Just be careful i knew a girl who was in almost the same situation just didnt share a room. Went off to an ivy league school ended up pregnant herself before the end of the first year. She was finally free and used it to let loose.", "Why should everyone’s life be ruined because your sister made a poor decision as a 14 year old and your parents allowed it? She was a kid and kids make bad decisions all the time but I cannot believe your parents let her go through with the pregnancy in the first place.", "Listen, I’m just going to say that they are not going to take this well even if they are in the wrong. They have undermined your well-being for hers before and they will continue doing it. Take the offer, and be ready. Don’t let your electronics that have your admissions material just lay around, get anything important to you out early (maybe a friends house), and just be prepared all around. It could be overkill, but I’ve seen this end poorly way too many times before.", "It is not wrong of you. It’s is incredibly wrong of your parents to have put such expectation and pressure on you for years.", "Take any documents you may need. There may be some resentment for a while but it will subside in time.", "They’ll survive without you, go live your life.", "Crabs in a bucket. \n\nYour dilemma sucks but I’m so proud of you as a stranger for being intelligent and wise enough to make the right choice here. \n\nYou’ve already sacrificed, and clearly there’s no end to how much you could sacrifice in situations like this. \n\nYou know what would make my life easier? If a sibling moved into my backyard in the shed and watched my dogs and my kids and did all the cooking and cleaning for me free of charge. That would just be great, because I work a lot and have lots of responsibilities and that sucks. \n\n… but life isn’t fair and if you don’t set a line somewhere some people will take and take and take because they’ve also got a lot on their plate. \n\nYour sister and their child will seemingly be fine. The fact that she’s still able to live with your parents is huge. She doesn’t need a free babysitter as much as possible. She’s a single mom who needs to take responsibility for that. \n\nSure maybe she wishes she was a stay at home mom with a billionaire husband, but that’s not the reality anyone lives in and that’s the reality she has to live with. Your parents probably wish she didn’t get knocked up as a teenager but got married in a few years and had a grand kid. That’s not how things played out and it’s ultimately not your responsibility. You’ve contributed and care about your family, they **should** recognize that and cut you slack at this point if not long before. \n\nUltimately my point is it’s like anything else, don’t focus too much on changing their hearts and minds if they’re upset you won’t sacrifice your life for any struggles your family has. Because they’ll have to change their mind on their own. \n\nIt’s like bumping into a crazy person on the street that demands you stop watching them with flying cameras. Do you do *everything* you can to genuinely change their mind and make sure they agree with your perspective? \n\nNo, you accept that they’re not going to change their mind no matter how much you wish they would in your perfect world and deal with it and live your life.\n\nYou move on, let your family know that you love them, maintain that relationship at a distance while you get your adult life started… and if they want to be bitter and resentful and passive aggressive those are choices they’ve made as other independent adults in your world.", "Password protect your stuff with the school and let them know only you can make changes", "These people that are your family should be supportive and want what is best for you also. Instead they are  judgemental and delusional. \n\nOP, when you get to school go to health services and get a good counselor. It will be helpful to break free of the unreaonable expectations", "I’m so PROUD of you! You are doing amazing! I hope you know that!", "Not wrong at all in any way shape or form. What a huge achievement you're earned!\n\nFWIW, my daughter just graduated college this week and the love and pride I have is overflowing so i have plenty for you. Congratulations on that scholarship, go set the world on fire and do amazing things!", "You said you are a push over and this thinking is continuing that. Stop giving them your money please. Make sure your documents are safe. Grey rock them until you get away safely. \n\nPart of growing up is learning to grow a backbone. You can do this!", "You’re not in the wrong.\n\nThey may not forgive you if they don’t see it for themselves, they all seem to be very “in their own world” here and don’t see past the baby. \n\nYou NEED to go live for yourself. You did not get your sister pregnant. You did not poke holes in condoms or swap her pill out or force her baby daddy to ejaculate inside her. \n\nYou are her SISTER not another parent. You have no obligation to raise her child for OR with her.\n\nYou can help out and visit and maybe even send cash if she needs it and babysit once in a while because that’s what family does. Family DOES NOT force their child to miss out on education and a living home life… so what are your parents even doing??? \n\nIf they want to play the family card, tell them to start treating you like family. End of.\n\nGo to your college and enjoy it!!! I’m rooting for you OP!", "Your parents are wrong in this. But the only thing I’d caution is to have a little sympathy for Mary. All those feelings of loneliness and resentment you had as a young teen, did she have them too? Stuck in the house since 14, no friends no job? Or were you both able to maintain friends in high school and do things outside of the house?", "You shouldn't forgive them... You've been paying for Mary's mistake for the past 4 years ,your niece isn't your responsibility", "You need to secure all important documents and also contact the college and make sure your parents can't mess with your admission. There's a high possibility they will try to stop you from going.  \n\n\nEdit: Spelling", "So what if they don’t forgive you.  You’ve done absolutely nothing to be forgiven for.  If anything they should be thanking you for all you have done.  Your parents don’t care about you they only care about what you can do for them.  They are the ones who need to ask you for forgiveness for what they have done to you.  Can you move and block them somehow?  Even if it’s just for 6 months or a year so you can mentally separate?", "Unfortunately even with all you have done for her, there is still the possibility of that. But it is big wide world out there to explore and build new relationships. You will be fine. Once you are making money, expect to hear from them again. Confused why your sister is not going to college, almost sure she would qualify for training of some sort due to her situation", "They should be worried about whether or not you will ever forgive them for their horrible mistreatment. \nBut they probably will be very angry and emotionally manipulative. I wouldn’t give them any information bc it’s just going to cause endless arguments.", "They will all forgive you super fast when you get a good job after you graduate!", "Time for Mary to start pulling her own weight.\n\nTime for your parents to start holding Mary responsible for bringing some money into the house.\n\nTime for you to run.", "So your parents want you to put your life on hold for a petty their, teenage mum who can’t hold down a job?  \nNTA.", "If I could reach through the internet to hug someone (if hugs are your thing) I would. You seem like such an incredible and mature person and I’m just sorry you were forced into the role of an adult before you should have been made to carry an adult’s burdens. You absolutely deserve to have your own college experience, and your own life, outside of a twin you can love but cannot save until she is ready to work hard, as you have, for herself, as you have. \n\nYou’re incredible. Stay strong and get out of there. I hope college surprises you in all the ways you want and so many ways you aren’t even expecting.", "So despite all the support including pretty much giving up your whole salary and time and energy, your sister still stole from her job and arrived late? You are both the same age but you are clearly much more mature and responsible. You know that you will never have your own life if you stay at home. Go ahead to college and thrive! I know you will succeed and be amazing and successful! NTA", "So your sister isn’t helping herself. That’s not on you!!", "So she expects you to deal with her problems for her, while she keeps making more.\n\nRun. Don’t look back. You are not your twin’s extra person. You deserve to live your life.", "So your sister isn't able to find the father of her child (however that works unless it was rape), doesn't try to provide for her own child and expects everyone else to do the work for her and generally doesn't even try to pull her weight.\nSurely she's be selfless enough to not leave ASAp if the roles were reversed...\nAnd what is that bs from your parents saying you can start living your life as soon as your sister isn't single anymore? It's partially their own fault they allow you sister to freeload instead of pulling her weight. They are enablers and want you to help.\nJust go to your dream college and go low contact. You are not a free baby sitter or substitute parent and your parents should be ashamed to treat you like that since you became an aunt.", "Your sister is the master of her own destiny as you are for yours. Your sister has made choices, and she and your parents have tried to tie you down to those. \n\nPlease contact the university and/or scholarship provider(s) to let them know that under no circumstances will you be turning down admittance and acceptance of the scholarship(s). Please tell them that your parents, twin sister, or others might impersonate you or attempt to speak on your behalf. Also, let them know that any communication they send or you believe you are sending to them might be interfered with. \n\nAlso, please let your high school know that your parents are not to be given any information regarding your grades, school records, university applications and acceptance, etc. You’re 18 so an adult. \n\nGet all of your important documents (birth certificate, Social Security card, passport, etc) to a safe space. Could you possibly store them at a trusted friend’s house, for example? \n\nYou really are incredible, doing all of this on your own and staying motivated. Think about what an unbelievable role model you’ll be for your niece. She’ll look to your example and (hopefully) be inspired. \n\nStay strong. Stay focused. And know that many of us out here are proud and in awe of you.", ">. She had two jobs since the baby and she got fired from one for stealing and the other for being constantly late. \n\nShe sounds charming.", "Please be careful about your school papers that may come in the mail, if able use a PO BOX or a trusted friends address. You don’t want to miss any deadlines, and feel like your parents or sister may try to sabotage your chances to keep you there.", "If you didn’t already switch banks and put passwords on everything. You would be surprised, people still finding out their custodial accounts show their parents have access.", "Also she’s your twin so you need to be worried about impersonation. Also lock your credit", "Yes. Also that she “couldn’t find the father to tell him” — this wasn’t a boyfriend. Still doesn’t entitle any of them to demand OP sacrifice her life, of course, but the red flags are waving.", "Both her and my parents are against abortion. She wasn’t going to get an abortion under any circumstances and my parents supported her through that because they have the same pro-life views (I don’t). \n\nThe father of her child was a 15 year old boy she didn’t know well. They met for the first time at an amusement park. They were flirting and having fun together for a bit and ended up having sex in his friends car a few hours later. She said she didn’t enjoy it so she didn’t bother get his number or his full name, and just went home. Hence why we can’t find him. All we have is his first name, and we live in a big city. I asked her if he pressured her and she said she was the one that initiated it actually. So no consent issues there.", "*They haven’t been proud of me since before my niece was born.*\n\nThis is heartbreaking OP, I’m so sorry for the way you’ve been treated. You deserve better, and like the person above said, you’ve done so incredibly well for yourself despite the situation you’ve been placed in. \n\nAllow me to join in and say that I’m proud of you too 💕", "Make sure you have complete control around communicating with your college and that they’re not allowed to. You don’t want them messing around and login into your email or whatever and rejecting the admission for you", "Sorry but unless it was a rape, I can't believe she doesn't know. She just doesn't want to say. \n\nRun OP run! And bless you for being a  so good to your sister and family whose actions stole your teen years.", "Guessing they will demand child support once OP graduates and starts earning a good salary because \"that's what your sister would have done\"", "How did you assume OP didn't live in Alabama?\n\n(/s obviously)", "Sister is just as delusional too!", "This! Especially with *twin* sister, please OP, set that password.", "Do this. And get completely separate bank accounts at a different bank. And get your vital docs like passport, birth certificate, school records and anything sentimental out of your parents house. Get a storage unit and start slowly moving out what you can fit in your backpack. \n\nOh and let them rage but stop giving 80% of your paycheck. Throw them a $20 if they absolutely insist but you need that money for college more than the 4 year old needs a new barbie.", "Well said, internet friend.", "This should be top comment 🥇", "I have nightmares of this happening!!!! I’m so uptight about relationships and a boy even kissing me makes me panic because I don’t want to get pregnant. I know it sounds ridiculous. I’ll have my fun in university but I don’t think sleeping with anyone is in the cards for me anytime soon. I’m terrified. Knowing my terrible luck I’d probably get pregnant the day I lose my virginity lol.", "Why does Mary get any sympathy? She got herself into this situation, this entire predicament is her fault… she couldn’t even find out who the father was. Mary and the parents are massive assholes… I feel sorry for OP and the baby.\n\nNTA. Go to college, cut these people out of your life if they continue to guilt trip you. Go and live…", "Pull your own weight Mary.\n\nMary must bring some money home.\n\nTime for OP to run.\n\nI gave insomnia & family problems, so I thought I d turn your comment into a haiku.", "Hug are definitely my thing, *virtual hug* 🥺 \nThank you so much. I appreciate this more than I can say.", "Yes as others have suggested can you get a document box and store it (and your important documents) at a friends.", "Why does an internet stranger telling me they’re proud of me actually have me bawling my eyes out? 😭 thank you so much", "I would love to know if it's even possible to get child support out of an aunt?! Sure, she was forced to help out WHILE SHE WAS A CHILD HERSELF, but that does not mean that she must continue to help out.", "So OP gets punished for the rest of her life because Mary became pregnant at 14. That's totally fair, I mean everyone knows twins are one person puppeting 2 bodies. /s\n\nSeems completely on brand for the mother's logic based on the above.", "When you're at college, look over your options for birth control (pills, IUD, nuva ring, etc) just in case, and if you ever get to the stage where you want to sleep with someone, do not agree to be without a condom.\n\nAnd as someone else pointed out, be careful at parties!\n\nI hope everything works out well for you once you get to college! Live your life for yourself and no one else.", "Have you been to a gynecologist to find out what options you have? Perhaps you could “go on the pill” to allow yourself to be less terrified of this happening to you. \n\nBe careful that when you go away to university you don’t “go crazy” with your new found freedom. You have a great head on your shoulders, so take things slowly. \n\nWhen you go to parties or even out with one other person, always control your drink. Ask for unopened cans or bottles. Don’t drink anything anyone hands you that comes out of a tub or punch bowl. If you need to go to the bathroom, take your beverage with you. And there are strips that can be ordered to dip in your beverage to see if it’s been “spiked.”\n\nYou’re going to do great at university and in life. You’ve worked hard, gotten a job, a scholarship, etc! This is your time, and your parents should be incredibly proud of you.", "Oh man, that sounds so traumatic for you. I would seriously consider talking to a therapist once you're out of the house, as being terrified of pregnancy is going to make you much more anxious at College. You deserve to be happy, most people don't do what your sister did and there are lots of ways to be safe so that you don't need to worry. Please don't downplay or dismiss the effect that your sister's pregnancy/your parentification has has on your mental health.\n\nThis kind of anxiety can really mess you up if untreated (I know from personal experience after being shown a full birth video at the end of primary school - that did a number on me so bad).", "You should get an IUD or an implant. I'm not saying you need to be having sex, but that maybe if you knew you have protection even if something happened/a condom broke, it'd be one less thing to stress about.", "If you are able to, I would suggest going to a sexual health clinic / planned parenthood to get on birth control if you can, or at least get some Comprehensive sex education (and some free condoms). If you’re in the US (not sure about other countries) there are mail-order BC pills you can get. Worked well for me in between IUD’s, but hormonal BC isn’t for everyone. \n\nIf you do drink, my personal rule was to always have 1 glass of water for each shot/drink, eat while drinking, and just try and pay attention. \n\nCongratulations on your scholarship, don’t let anything or anyone hold you back!", "Just be careful at parties, dont drink alcohol and you  will be fine.", "And stop giving them your money!", "Copper IUDs are amazing and you don’t even have to worry about hormones", "If abstinence eases your mind, there’s no shame in going that way either. Even with contraception, I’d panic thinking “am I the .0001% that this failed???” And I’d stress until my period started. You don’t need that.", "When there, look into what counseling programs they offer. Your family has left wounds that you need to learn to heal. Just getting physically away is not enough", "Please call the college today and enact some protections on your file/account with them so that your parents or sister can't impersonate you and turn down the scholarship.", "I'm old enough to be your mother, obviously am not yours. I am so, so extremely proud of your hard work and dedication to improving yourself and your life. Your efforts at helping your sister and niece, which should NOT have fallen on your shoulders, is commendable. You are your own person and deserve the ability to shine on your own. Your light is yours and controlled by you. I'm so proud of how you are back from others who want to do nothing but diminish you. Congratulations and I know you've got nothing but success in your future!", "Just go get a degree, graduate, get a good job, then come back and take your niece out for a meal/day out as you and her are the only none assholes here.\n\n&#x200B;\n\nedit (well as much as 4 year olds cant be an asshole :) )", "I will also put in my 2 cents of encouragement.  Go, live your life because you deserve it.  Shame on your family for putting you through all this and thinking it's OK.  Do whatever it takes to get out to that college, buy a plane ticket, and go.  Make sure they can't sabotage you and be careful at college. Anything can happen, but not if you are smart and vigilant (which I see you are).\n\nAlso, I am very proud of you as well with everything you accomplished, even with the deck stacked against you.  Enjoy your college years and land a good job. That is your future not playing nursemaid to your sister and niece.", "First off congrats on the scholarship and getting into college .. Big NTA For wanting to leave, Now is the time to live for you.. You have had enough taken from you ..Before you leave I would make sure ur able to get your documents like your passport, birth certificate, social security card so that they don’t try and withhold it from you .. Also on the day you leave I would make sure they are not home because they might try to forcibly make you stay..", "It is not possible.", "I'm guessing it will be a demand in the form of a guilt trip. Families are great at those.", "And most importantly have protected sex!", "You need to listen to this OP. Sometimes shitty things happen.", "Also make the call when you are away from them so no-one can overhear you by accident.", "Hey Op! \n\n👉🏽👉🏽Make sure you call the university and ensure that no one can decline your scholarship. Make sure to put passwords as not to share your personal info or classes etc. with anyone. \n\nEnsure you have separate bank and that you have your personal ids sorted. \n\nI wish you the very best in your future! \n\nNTA", "GET OUT OF THERE NOW! Mary made her choices and so did your parents. For whatever reason, they felt you didn't deserve choices of your own so now it's time to show them. Don't let them guilt you into sacrificing any more of your life for their convenience. NTA but they sure are", "Maybe if your parents were more present your sister wouldn't have had a child while she was a child. So it is totally unacceptable for them to expect you to parent another person child when they couldn't even parent their own.\n\nYou're NTA. You need to leave and not look back. Don't give anyone any money, don't do any babysitting and don't let them guilt you into being a parental figure for a child you had no part in making.", "NTA- Get out before  Mary announces baby number 2. You did not get pregnant at 14, and this is not your responsibility. \n\nGo to college out of state and see if you can stay on campus during breaks so you don't have to come home.", "NTA go live your life and actually have a life. You didn’t get pregnant. That’s on Mary and your parents. They took enough of your life from you. You owe them nothing", "NTA.  I want to first say congratulations on your scholarship!!!  ❤️❤️. To earn a scholarship of that level you put in a ton of hard work and sacrifice yourself - read my word again, you EARNED it yourself!!  You should be incredibly proud of yourself and know that this internet stranger is proud of you.  It’s time for your sister to adult-up.  This is not your problem or your deal.  I promise you that you will meet a whole other family in college that is going to support, love and treat you like a family does. \n\nBut parroting what others have said, you must contact the school (yours and future) and tell them that absolutely no one is to have access to information or make any decisions about anything other than you.  Do you have a trusted counselor or teacher you can leave things with to not leave them at home??  Don’t give them an inch to take this from you.  Also get your own bank account!   I work at a bank - you are 18 you are more than qualified - password protect it too.  With something they wouldn’t know and inform the bank no one is to inquire or have any rights to on the account.  That should be standard but they can use the backup of notating the account in case they walk in to a branch or something.", "NTA. Go to college. You're not the one who had unprotected sex at 14.", "NTA.  Your family is using you.  Move out and live your life how you want to, not how they tell you to.", "Seriously NTA. What the hell is wrong with your parents? Take that scholarship and RUN honey, and never look back. I know you had no choice but to comply when you were a minor and living under their roof, but trust me when I say that if you don't break free NOW and start living your own life, it's only gonna get harder and harder. Next thing you know they'll be demanding you skip classes and miss work to take care of the baby while Mary does whatever, because \"your sister needs a break\", it's not your goddamm problem Mary went and slept with some guy and got knocked up. Frankly she SHOULD struggle a little, since she's the one who got herself into this position and not you. PLEASE don't let your family guilt you out of this opportunity, take it and put yourself first, you deserve it dear.", "NTA. Your parents ruined the last of your childhood by forcing you to take responsibility for a baby that you didn't have. Leave. You aren't responsible for your sister.", "Congrats! Job well done. Go get that education, explore a new world and find yourself. \n\nYou've earned it. \n\nYou sound like a good kid, so go make the most of this oportunity you have earned yourself. Don't be afraid to ask for help from your new school and new friends. \n\nAnd again, Congrats!", "I normally lurk here, but NTA.\n\nChange all passwords, make a new email address specifically for communicating with this college. Never leave any tech unattended. If they know what college you are going to out of state, wait a week or two, then go to them and say you got a better scholarship at another out of state college and then only talk about that college. Tell them a fake day when your semester starts, then leave earlier. Get a new phone number. If you have a car, start getting all your stuff in a storage locker(if you didnt share a room with your sister, id forgo this step) so that when you leave, you can leave in the middle of the night and get your stuff loaded without them knowing. \n\nThe goal is to become a ghost to them. Completely vanish. These fuckers do not care about you in the slightest anymore, so dont care about them, and go live *your* life how *you* want to.", "NTA and please move out of state and go to that college, don’t let them ruin your future", "NTA and I'm sure it's been said but please...RUN FAST, RUN FAR!!", "This is toxic af. This is emotionally manipulative and exploitive. The fact they already have been stealing 80% of your wages is mind boggling. She laid down to have the baby. The baby is her responsibility. If your parents want to help her that’s fine but you are under no obligation to do so. Time to start your own life! Look out for yourself #1 because they’ve made it abundantly clear they aren’t looking out for you. You need to do what’s best for YOU. They need to do what’s best for themselves. Please take care of YOURSELF and do not allow them to guilt trip you into ruining what could be some of most amazing years of your life because your sister ruined hers.", "NTA. Not your baby, not your problem.\n\nIt's real easy for your sister to say she'd never do that to you when she's not the one being asked to set her future on fire. She's just trying to manipulate you. Don't blow up your life because she blew up hers.", "I don't understand why the baby was costing so much money if there is no childcare involved.  I mean my kid costs me a fortune in childcare but incurs very little additional cost otherwise. Sounds like a bit of a piss take to both take your money and rely on you for some of the childcare. How are both you and your parents having to work to provide for this kid? Is the baby eating gold?", "NTA. Get out of there, go live your life. You deserve to. Mary’s baby is not responsibility, and neither are Mary or your parents", "NTA. Go to that school. Get out of that house.", "NTA and I think you should leave and don’t let them talk you out of it. \n\nNot only have you worked hard and deserve to go to the university of your choice. But if you aren’t already super resentful of your sister and the child. This will push you over the edge. \n\nWhat if you were to fall in love and get married instead ? Will they allow it or do you have to stay to help Mary again. \n\nYou have been very kind and helpful already. They aren’t worried about your dreams. They aren’t worried that they will miss you. No they are worried about free labour and money. \n\nSucks to be them. Your niece should be starting school soon. They won’t need as much child care. And even so. It’s time Mary learns what it’s like to be a teen mom. She made a mistake and there are consequences. Most teen moms don’t have mommy and daddy and sister paying for everything and helping out. I was a teen mom. So I know. Not that I want her to struggle but she’s had an easy ride and a 4 year old is a whole lot easier to care for than a baby. She will be fine.", "Leave. Go. Run. Enjoy your college years. You've been amazing to your sister and family. Now focus on you. These will be the best times of your life. As someone who had their first child at 16, please listen to me. Don't let your parents and sister control your life. Do not let them guilt trip you. It's time Mary stepped up. She will be just fine I promise. \n\nHave fun and be careful <3", "Your parents should have parented better if they didn’t want a 14 year old single mother daughter, and Mary should have made better life choices-their bad decisions is not your burden to bear. Fly the nest, go to college, live your life the way you want. NTA", "NTA, please go and live your life. Take the opportunity. Go get your education, have fun! Mary or your niece is not your responsibility or financial duty. Your family will probably put you down, but your life shouldn't be on hold just because of what your sister did.", "NTA I have a similar situation mostly giving all of my check to my mom and at first when I made a good check I was ok with some not all but now I Hardly make any money and I have to give all my check and she got mad that I don't want to go back to my old job but I was mentally exhausted emotionally exhausted sometimes you just have to say I am doing this it is going to be hard but it will be so much better in the long run I promise you you need to get out of that cycle somehow", "NTA \nrun. run as far from your family as you can and just never look back", "NTA.  Take your opportunity and make your own life.  They are trying to prevent this.  Don’t let it happen.", "NTA , it is not your responsibility to take care of your sister baby. You contribute if you can but you should go to college. You’re a person who need to grow up and not take care of other children ( even if that child’s is your nephew. Good luck in college", "NTA your parents have asked you to give up your youth, time, and wage for someone else's mistake. They cannot ask you to give up your future also. This isn't about you turning your back on them, this is about you and your life going forward. A once in a lifetime opportunity. \n\nThey cannot hold you hostage over your sisters mistake. It sounds like your sister has done nothing to support this child. Good on you for furthering yourself and dealing with this horrendous situation with grace, even at such a young age. \n\nI hope all your wishes and dreams come true, I hope your parents wake up and realise how much of a Saint you've been, and they put nothing further on you. They decided to support the child, it's their job to continue to do so. \n\nBest of luck with your scholarship!", "You are not your sister's keeper. Have a good life. Family always makes things complicated but try to remember this is the only life you get,  you are not responsible for other people's decisions. NTA", "Nta, and colleges regularly have summer employment with free housing and most count winter housing in your housing contracts so you won't have to go home", "First and foremost CONGRATULATIONS!!! What an amazing thing you've achieved. I am so proud of you. It's not easy to maintain success at school while working to provide for your family. That grit and determination will take you far in life!! Second no you are NTA. There comes a time in your life when you will have to stand up for yourself. I love that at your young age you see the value in yourself to do what is best for you. You deserve this and most importantly you've earned it. You have done enough for your sister and parents. Enjoy college, keep those grades way up.", "NTA! \n\nWhy should it be your problem your sister got pregnant with a dude that fell off the face of the earth.", "NTA but definitely have a plan for summer because who knows if they’re going to be welcoming you back with open arms if you leave now", "nta and do not give in you gave already your childhood for your twin and parents.  do not give up college as this would your ticket to not only leave but to learn and make something for your future.  your parents are wrong and on top of it at 18 your an adult and you do not have to do anything they tell u.", "NTA the A-holes are ur parents and sister. You have sacrificed enough now it's time for you to leave and live ur life. No-one told ur stupid sister to get pregnant at the very young age of 14. The consequences of her action should only be faced by her not you", "NTA\n\nSo the \"baby\" is about 7/8 years old now? Yeah...don't sacrifice your future for other's \"mistakes.\" (I'm trying to find a more polite word here) Seriously, you've already gone above an beyond anything that should have been expected of you. Move on to the next stage of your life.", "The only people responsible for taking care of that baby are the people who contributed to its conception, i.e. your sister and the dad. You didn't get your sister pregnant and neither did your parents.\n\nThe fact that you and your parents helped all these years is incredibly kind and very admirable but at the same time from your post it feels like your sister has taken this help for granted and has grown up to become very entitled.\n\nYou're being treated unfairly and as a teenage girl who has also been parentified by being forced to raise my little brother (11 years age gap between us) my heart breaks for you. I am 25 now but the burden of having to care for a child and be so responsible at such a young age is a pain I still carry with me to this day.\n\nPlease go to college and live your life. So much of your young years were spent being responsible for someone else. You need this time and space to grow and become your own self.\n\nBoth your sister and your parents are very entitled, inconsiderate, immature and (dare I say it) fuc*ing insane for asking you to put your life on hold until your sister gets her shit together (which by the looks of it might not be very soon).\n\nObviously NTA.", "NTA. This is your out, take it! They asked too much from you.", "NTA. You have to live your life for you and not for them. It is not your fault your sister got pregnant. You should not have to take care of a child that is not your own. I am even more shocked that the parent are forcing this on you.", "NTA. I think maybe you need sit down with your parents and calmly point out to them that over the years you’ve made a lot of sacrifices for Mary and her child.  It is her life and her mistake, you do not need to pay for that forever.  They have asked you to give up your life for far too long and holding you back from going to college is a big mistake, and is quite frankly a guaranteed way to make sure you won’t be around as they are slowly suffocating you.  You’ve helped out for 4 years at least by the looks of it, and as you aren’t actually the child’s parent.  I would seriously point out how they treated you growing up, tell them how it made you feel, and that you deserve the chance to thrive now.  \n\nIf they are that adamant you’re in the wrong for going then I think you should consider parting ways but in one act of pettiness, you could always point out the financial positives to going to college as there are better paying jobs which means a better support package afterwards, but then when you’re at college get counselling and really understand why you are not wrong to go away to college, and why never have follow through with giving them more money afterwards, and also dealing with the fact that they have abused you through neglect and emotional manipulation.", "NTA and run. I'm so sorry this has been your life. You're not Mary's baby's father they aren't your responsibility. You need to get as far away as possible. And yes be selfish with your time and money going forward when it comes to your family. Mays is the one that needs to be busting her ass to take care of her child. Not you.", "NTA. Do what these people are suggesting. Set up a password NOW that there's no shot your family will know. Get a separate bank account and password that, too. Start getting your documents together and be ready to leave. They WILL sabotage you because you're a cash cow to them.\n\nI would also gently suggest low or no contact for the duration of your studies, maybe longer. It'll hurt but it will be for your benefit.", "NTA, you deserve to live your own life. If you don’t take this opportunity, they will be just as bad or worse to you when you do finally decide to move out. I realize this will sound heartless, but your sisters baby is not your problem.", "Agree, not the ah. Live your life!!", "They stole your childhood and took your money. Leave and don’t look back.", "NTA. PLEASE GO LIVE YOUR LIFE. You've worked so hard and to give it up for people who just want to are advantage of you will be something you will regret for the rest of your life.", "NTA \n\nThere are selfish assholes in this story but you aren’t one of them OP. Your sisters bad life choices can ruin her life but it is messed up they want to ruin yours too. Her kid and her finances are not your problem. Your parents have been enabling her behavior this whole time and thats their problem, not yours. None of the issues they bring up have anything to do with you and everything to do with them. So don’t feel guilty and leave them to lie in the beds they made.", "Nta\n\nDepending on how this all plays out you may consider going low contact with them once you're out. That'll help out some distance between you and them so you can live your life in peace.", "NTA. Go live your life. You had to put your whole life on hold for her. You got neglected as a result. When we make sacrifices, we still get a “reward” for it. Parents make sacrifices and get a good, healthy, well-rounded kid out of it (ideally). And honestly, you were still a kid too. Just because there’s a baby in the picture doesn’t mean they need to neglect the kid who didn’t have a baby.\n\nThey seem to be jealous that you have an opportunity to get out of there and live your life.\n\nDoes your sister get to have a life outside of the baby? It seems like she expects everyone to do the work for her.\n\nMy mom was a single mom too. Granted, she was 24 when her and my dad split up, and she got support from her parents, but she still did the parenting herself and did almost all of it on her own.\n\nBut congratulations on the scholarship and for working so hard for this. Im glad you’re taking it. Don’t feel guilty. You’ve given up enough already and you should be able to enjoy your life. So please do that. Enjoy your college years and young adulthood! 💜", "I want to second all of the comments regarding contacting your new college/your high school/college scholarship people and tell them what is going on. Warn them that your relatives might pretend to be you and reject the offers. Password protect everything you can, change your mailing address, get you documents, medical records out of house!", "I am sending you a virtual hug. As a mom my heart breaks for you. But, I am proud of the strength you have to pull through despite your circumstance. It's not easy improving your grades. Kudos to you for that accomplishment. \n\nYour college years should be the time for you to find yourself and start the foundation for the beginning of the rest of your life. Instead your parent's and your twin have caused you to have anxiety and fear of the future. For that I am sorry. \n\nSex is overrated. You will be fine if YOU decide to wait until you graduate to engage in sex. Remember no means NO. If need be get a self defense key chain.\n\n1. Take your scholarship, \n2. Get a PO Box (before you leave for school) and update your mailing address, \n3. Do not give in to your parents or your twin attempts to coerce or guilt you into giving up your scholarship and \n4. Be the best YOU you can be.\n\nNTA. \n(Virtual high five, virtual smiles and virtual hug is on the way)", "NTA op, your parents on the other hand are TA, you need to go and live your life, please take the scholarship and don’t look back!", "NTA - RUN RUN RUN", "NTA.  Please go love your life.  You are not responsible for your sisters child.  Life will go by either way - please spend it doing what you want.", "NTA.\n\ngtfo girl and don't look back. Mary made her own choice to keep a baby at 14, but it's not your baby.\n\nSpread your wings and be free! Make sure you take all your important documents (birth certificate etc) with you, and get a bank account at a different bank from your parents. \n\nAsap stop paying them any money. Don't get guilted into paying for anything more for your sister's child. It's not your responsibility", "NTA, you've done a great job and secured a future for yourself. Congrats! Just make sure to keep you're money away from your parents and keep your documents in a safe place. Also talk with the school and make sure they know your situation. All that being said, push through and keep your head high! You'll make it and will be so proud of yourself at the end of it all! Your family doesn't deserve your kindness <3", "NTA.\n\nAnd Mary's right, she probably \\*wouldn't\\* take off...BECAUSE SHE HAS A FUCKING BABY TO TAKE CARE OF.\n\nFlee as far and as fast as you can, and when you get there, transfer your cell phone ## to a Google Voice ## and get a NEW cell phone number they don't know.\n\nIf possible, don't let them know your address at school, either, by getting a PO Box.", "I'm going to scream this at the top of my lungs ITS NOT YOUR FAULT SHE HAD A BABY ITS YOUR PARENTS PROBLEM BECAUSE SHES A MINOR YOU WERE NEVER SUPPOSED TO HAVE TO TAKE CARE OF A BABY THAT ISNT YOURS. LEAVE! DO YOURSELF A FAVOR AND LEAVE! Go live your life and be happy! They're your family but not your responsibility. They made their choices they can stick with their choices, but you didn't make them, run, run far away. It's so BAD that they made you contribute to a child that isn't yours. They treated you as its other month, which you are not. Run run run! Go to college! Live your life! Be happy", "Your sister made the choice to have a baby at 14, not you. And your parents made the choice to become abusive and neglectful and to parentify you and steal your money when you should have been busy being a kid yourself. None of this should have been your responsibility. \n\nGo live your life. Have a wonderful time and don’t get sucked into the messes others have made.\n\nNTA", "Your parents are treating you as though you and your sister are one Unit instead of individuals.   N t a", "NTA, and please, please do everything you can to protect your education and finances, passwords, etc, as posted by others too. And honestly (I seriously hope this isn't necessary), but go no contact if you have to. You and your sister are not one person because you are twins. You were careful and responsible and did way more than you needed to do so far already, considering it was not your baby. Go live your life. It is the least you deserve.", "NTA\n\nGo out of state and don’t look back. Blooed doesn’t mean family. These people are *not* your family, forcing you to parent a shild that isn’t yours, forcing you to give them money, then manipulating you into staying??? Oh hell nah. Get out of there girl, build a life for yourself. Stand up for yourself, it’s what you deserve! Your sister was stupid and got pregnant, you don’t have to suffer from that!", "NTA. I’d be so far away as soon as I could.", "NTA, leave, make a life for yourself, you dont deserve to pay for your sister's mistakes. Selfish is your family for trying to hold you back.", ">My parents then coerced me to contribute almost 80% of wages to help Mary take care of her baby.\n\nYeah, gtfo of there. My SO had that shit happen when she was a kid. And from other comments it sounds like they're expecting you to wait to do your thing until Mary gets her shit together. Spoiler alert, that's not happening until mid to late 20's at the earliest. \n\nI'd be wary of expecting to go back and live there for breaks though. Because if they feel like you shouldn't be going it would make sense that they won't help you get there either. \n\nGood luck and congrats on the opportunity.", "Fellow redditors nailed it here. NTA OP. Live your life guilt free and free yourself from this toxic environment. Good luck in college and beyond. This Mama is rooting for your success and happiness! Awesome job on earning that scholarship too!", "NTA obviously, get out as fast as you can. Also, besides what everyone mentioned regarding your family trying to withdraw your application and mess up your future, I wanted to ask if your sister is an identical twin? By the sounds of the whole thing, wouldn't put it past them to make Mary impersonate you and make it seem to the school that you withdrew your own application. \n\nYou're going to be great for yourself, and given the amount of emotional abuse that you've been through, maybe look for some sort of therapy while you're at the university. They would probably have someone available for students.\n\nBest of luck, don't back down!\n\n*Edit: Spelling", "Theyre selfish. Plain and simple. You have your life as well. Just cause theyre family doesnt mean you owe them your life. Be successful jn your own ways. It boggles my mind how strangers online supports you more than your own family.", "NTA. You have done more than enough for your family. Take your opportunity now to live your life.", "NTA.\n\n\nAnd in  this case everyone else is assholes. Your sister sleeping with a dude or dudes she doesn't know and thinking you should put your life on hold is an absolutely asshole move. \n\n\nYour parents trying to sabotage your life is also an asshole move.", "NTA. Get out and be happy. You deserve it. You did much more than anyone could ever expect from you. It is ok to ask for your help in this unusual situation, but really?\n\n&#x200B;\n\n>my parents not asking me how I’m doing anymore, not congratulating me on  \n my achievements, coming to my games, taking care of me when I’m sick   \netc.\n\nThis so horrible. Not coming to every game could be acceptable if they really worked their butts of to help your sister, but everything else is just plain cruel even without considering what you sacrificed for somone else's mistake.\n\n&#x200B;\n\n>They said not everything is about what I want and sometimes people make   \nsacrifices for family as they are doing. \n\nNot everything is about what you want, that is correct. But nothing is about what you want, is not how it should be either!\n\nGet out. Enjoy college. Find a meaningful job. And be a good aunt anytime **you** want!", "OP would still probably have to work to \"help pay for nibling's college/car/first house/wedding what have you\"", "Yes this is exactly what her family wants from her, to live her life for them and deal with her sister’s screw up.", "She got knocked up. You didn't. Don't let her bad decisions be consequences for you.", "Yes! That is what I came here to say. A four year old should be in daycare and about to start preschool. There is literally no reason for you sister to not be working!\n\nCongratulations and go low/no contact if they try to guilt trip you into staying.", "I agree with all of that except that she chose to have a baby at 14. We don't know the circumstances of the birth. If they couldn't find the father, I highly doubt he is another 14 year old. We don't know if abortion was an option for her, either legally or if her parents would allow it.", "Too late. OP already spent years of her life constantly making sacrifices. And the thanks they give her is trying to intentionally destroy her future to continue to make their own lives easier. I'm sorry OP, but your family sucks. Take this well-earned opportunity and don't look back. NTA and congrats on your exciting new future!", "100% this!!!", "> These people will suck the life out of you if you give them the chance. They've already stolen your high school years, don't let them steal your college years.\n\nPeople like OP's family will take, take, take. They will eat all of OP's seeds, leaving OP with nothing left to plant for her own future harvest.\n\nOP has to cut them off.", "Get your SSN and birth certificate away from these people!! They can open credit in your name and ruin your credit score hurting job, housing, and loan prospects!!! Put a freeze on your credit immediately!! She will feel entitled to your identity for \"abandoning\" her and your niece! Do it NOW!!", "Why is mary such a complete loser?", "Whoa, whoa, whoa! Mary isn't even trying to hold down a job? She flaked/self destructed at the ones she did have? And YOU are expected to work and give up your pay, and SHE is not?\n\nOh no. Hell no. Mary has 3 people to help her with childcare and she is NOT working? Your parents do not insist she do so?\n\nYeah, you are done here, OP.", "NTA.\n\nPlease, I can not stress this enough. DO NOT fall into the guilt trap. If you got a scholarship like that for college, then go! Ruining your life by missing this opportunity will lead to regret and resentment for the rest of your life. Think of it this way. If you do want to help, then getting that education and a career will help more in the long run. I say this from experience. You can not live your life fixing other people's mistakes. Especially in this important stage of your life.", "The kid is what, 3-4 now? She will go to school very soon if she isn't already, so your sister can start acting like a responsible adult and get a job. I don't know the circumstances, the sex-ed you both had or what options she had available but, in any case, she is the mother, and it's time to stop dragging you down with her. She is not your daughter, and your niece is not your kid. Prioritize yourself because, as you've seen, nobody else will.", "They want you as a forever-slave", "Your family is completely insane. You need to get away from them.", "NTA. Please go live your life and be free. Mary needs to get a job and your niece will be in school soon anyway. \n\nYou've already given up far more than you should have had to.  Has Mary had any DNA testing done in an attempt to locate the father?", "not to pry, but it really sounds like Mary does not have a job and it sounds like she has no intentions in finding one. It sounds like she would rather find a boyfriend or a husband to take care of her than be responsible, and IF that is the case I would be slightly concerned for her parenting skills if she’s not even willing to provide for her child. it sounds like she’s kind of immature and irresponsible", "Leave as soon as possible and stop giving your sister your paycheck now so you have some funds.", "r/momforaminute is a great place to vent and get some validation if you need it.", "And if it doesn’t force them to realize they are wrong I hope you can come to terms with that. And realize you deserve to live a life.", "Along with this advice, if you have access to your documents (birth certificate, social security card) please take them and put them in a safe place where your family won’t know.\n\nI’d also suggest running a credit report on your social security number to make sure no lines of credit have been opened under your SSN.", "And open a bank account at a bank they don’t use. Get everything from them online. No paper statements sent to the house.  Make up new passwords they wouldn’t even think of as well.", "You can a safety despot box at certain banks. They are a small box you can keep documents in and it requires the same types of ID to open as a bank account. You can even attach a password so if someone stole your key they would need the code word to have access. Keep your important documents and school stuff in that until you move", "I'd make sure you switch banks altogether. There have been people on here with problems after just switching to a new account. \n\nThere might even be a bank at your new collage that you can switch to.", "Yeah the 'she couldn't find the father to tell him' reeeeeally makes me wonder if the baby is an incest baby or one of the parents friends........", "> OP already spent years of her life constantly making sacrifices. And the thanks they give her is trying to intentionally destroy her future to continue to make their own lives easier.\n\nI can understand why the sister is selfish. After all, if she's stealing and slacking off on the job, she is the type to prey on her sister's kindness.\n\nWhat I don't understand is why the parents are willing to destroy OP's future. I just don't get the logic in them wanting to have two daughters who amount to nothing. From a self-interest perspective, they should want for at least one of their daughters to get a good start in life. This is baffling to me.", "Aw man I wish I can hug you so tight, OP. I know I posted already but I want to say it again. I'm so proud of what you have accomplished and what you will accomplish. Now it's time to plan out your life. I hope you listen to the majority: don't tell them your plans, pretend you'll stay, lock all information, contact schools, get all important docs, keep it safely away, have digital copies if needed. Have everything on a hard password. Let school counselor know, if you can trust them, of the situation so they can guide you as well. \nDon't be too unkind to your parents in the years to come. It's all they know right now. Hopefully it will change. Your sister needs to learn how to be responsible and you need to live your life. No matter what, know that us internet strangers are rooting for you. ** hugs", "Yes, and if you have a guidance counselor at your high school or admissions counselor at your college, let them know what’s going on.\n\n As somebody who’s worked at colleges for 15 years, things like this happen a lot. The college will be better prepared if your parents try any shenanigans to ruin your chances (rejecting the offer, rejecting the scholarship, etc), if they know there’s something to do. \n\nYou don’t have to get into details you can just say don’t talk to my parents or anyone else about this/I don’t give you permission (since you’re 18 they don’t have permission unless you give it to them) if you’re in the US.  But also let them know parents may try to sabotage this or however, you want to soften the edges of saying it to maintain your own confidentiality.\n\nAlso if you haven’t already, have your mailing address as a PO Box or the address or someone you trust. Most colleges don’t send snail mail anymore. But if they do, you don’t want your parents intercepting it.", "u/Abject_Panda_27, yes! Passwords and tell the school you don't want records going to your parents address. \n\nFreeze your credit and make sure all passwords and security questions are ones your family cannot guess. \n\nMake sure your bank account is secure and they can't access it.\n\nThey may try to make you feel guilty, but they really should be happy for you and proud of you for getting such an amazing scholarship. \n\nYou're doing the right thing. Go make your life a success. Take care of your own financial future first. They're all adults who need to do the same instead of using you.", "I have no awards, but take my measly upvote. \n\nBecause seriously, OP. They should be apologizing to you. They all, including your twin, stole some of the most important years of your childhood.\n\nAdolescence is a time for forming your own values, learning about relationships, and experimenting with different aspects of your identity. You were not allowed to do that. You should be so proud that, despite the dearth of support from your family, you continued to achieve academic success, meet the moment, and get this scholarship. \n\n\nYou’re amazing, OP. And this redditor is so so proud of you!", "Exactly", "THIS is the TRUTH!!", "And if they try to hide anything like that, you can request a new SSN card from a Social Security office or online, and at least in my county, you can go to the court house/public records and request a new copy of a birth certificate.\n\nSomeone else mentioned, but freeze your credit if you have too, if you can’t for whatever reason, be checking constantly, and don’t be afraid to dispute Everything you don’t recognize. I get near instant notifications when my credit has even been checked. \n\nYou got this OP.", "> Easy and obvious is making sure they can't access your email accounts **or physical mail.**\n\nThis would be the time to get a P.O. box.", "It won't. this isn't about a baby. this is straight up control. Unless the parents get a huge amount of therapy and truly confront their toxic behavior, chances are OP will go no contact at some point in the future.", "They demanded 80% of her salary from her after school job, so yeah they demanded child support.", "Exactly. This is everyone's fault BUT OP's. Mary had unprotected sex at 14 and the parents (those who were actually responsible for her since she was minor) decided that the other KID should sacrifice the next 18 years for her niece? Make it make sense. \nI'm usually trying not to judge anyone including teen mothers but what they are doing to OP is horrible. OP, please leave! Good luck and NTA.", "**Make a new master password**. Odds are you currently use some variation of birthdates, a new version of an original password (kittens --> k!tten$). \n\nGet a password manager app (personally i like Keeper, theres other ones). CHANGE ALL PASSWORDS. **USE GIBBERISH FOR SECURITY QUESTIONS**. Put the gibberish security questions in the Password app. Do not use a compromised account to 'back up' a new account. \n\nYou might consider locking your credit. If needed I'll link how-to thats super easy. Your family might pull out credit in your name as \"fair compensation\" for you \"abandoning\" them", "YES!!!!!!!!!!!!!!!!!!!!!!! They will try to sabotage your college attendance. PROTECT YOURSELF!", "Please please please do this!!!\n\nYou are Soooooo NTA", "Sadly, I think this will likely be the case. From OP’s comments, Mary sounds entitled, lazy, and irresponsible. This will not be the last time that Mary demands money or help from OP. If OP isn’t careful, Mary will probably try to leech off of her for the rest of her life.", "Daycare in most places is significantly more expensive than a minimum wage job would earn...and it sounds like the parents are already working hard. I don't know if she applied for any public assistance, but I doubt it's a case of her parents dictating she stay at home. And she's was a minor up until very recently...I don't know if she was completing high-school, but as a minor, there are restrictions on hours worked and they wouldn't necessarily be the hours daycare is open. \n\n\nEven with adult couples, where the lower earner wants to work, there are a lot of times where they would be losing money. Or daycare isn't available....there is often a multi year wait list. \n\n\nHopefully they have free public kindergarten at least.", "Yeah, I read this story and I'm very concerned that a 14 year old didn't know who the father of her child was.  Like what happened there to make a 14 year old get pregnant?  I know that isn't the point of this story, but if I had a 14 year old get pregnant, I would be raising the absolute roof to make sure no one had taken advantage of my child.  Like I keep hoping it is fake because of the horror of a pregnant 14 year old distresses me.", "That’s a huge jump. Much more likely an ill advised hook up than incest. 14 is young but not unheard of. \n\nI have many friends who were sexually active around 14 with boys of similar ages. As was I. It happens. And more than one friend hooked up at a party with a friend of a friend. Sometimes only knowing first names. Finding those guys in case of a pregnancy might be a challenge. \n\nAdmittedly is was in the 90’s and stuff was harder then re tracking people down. But\nIt’s not unheard of.", "Because they're selfish too. Right now OP is not only doing an insane amount of childcare for free, but also contributing financially to the household. These so-called parents would rather destroy her future, then put in the extra work they should have been doing themselves all along.", "Hon, it is a red flag that your sister engaged in very casual public unprotected sex at age 14 with a stranger. That is very high risk behavior. Did your sister have a history of that kind of behavior?", "Does Mary have a lot of trouble with impulse control? Between this and stealing from her job, I’m a little concerned she has some sort of disorder going on there.", "I respect your sister's decision, but it is so crazy to me that they could all be anti-abortion despite the age she got pregnant and the affects it's had on your lives.\n\nI do hope that when you get to school you're able to breathe without them impeding on your life, and maybe the time away from them will help them see some sense. Although if they don't, that's okay too. You deserve to become your own person after 4 years of taking care of your family and niece ❤", "Given the circumstances this would have been a really good candidate for an abortion, but at the same time your sister chose and your parents supported, but that doesn't obligate you to stick around and tend to the child. They made the decision.", "23 & Me could probably chase down the father in short order.\n\nI think they don't WANT to chase down the bio-dad, because then sister would have a chance of escaping parents' control, and bio-dad would have input into how the kid was raised.", "I have serious doubts this is the real story. Within three hours of meeting someone, your pro-life sister chose leave the amusement park so she could lose her virginity to a stranger in a car in a busy amusement park parking lot?", "Has anybody considered DNA testing the baby in order to find someone from their paternal family?", "Also, from personal experience, if the college is aware of the messy home situation, they can be helpful in getting declared as independent on your FAFSA. My own situation was so messy and well known that my scholarship program director went to bat for me.", "Maybe have everything sent to guidance counselor at school?", "This is good advice!!  ^^", "Note on the bank account, make sure it's not a joint one either opened years ago with a parent, as they have the right to empty it.", "That’s not a haiku though", "None of those lines follow the haiku syllable rules", "A haiku follows a five-seven-five syllable format. Yours is six-eight-six.\n\nStill good, though. 😊", "Here’s another hug from an internet stranger then 🫶🏻💕 (And absolutely NTA-run far, run fast, and stay strong and sure in the knowledge that you are doing the right thing.)", "Here are more hugs 🫂 🫂🫂🫂🫂🫂🫂🫂🫂🫂  you shouldn't be punished for your sisters mistake! Go live your life guilt free.", "Oh yeah, OP will be expected to help care for this kid until THEY go to college. It will never end, EVEN if twin gets a partner. They'll want to have ALONE time/date nights and will expected OP to drop everything to help out.\n\nOP: It stops here. The baby is now preschool age and will be going to school in a year or two. They don't need you to stay and help, they are being selfish. I REPEAT: THEY ARE THE SELFISH ONES. You've done way more than you should have. Sharing a bedroom with a newborn? Giving the majority of your wage? You've done more than any teen sister should. Don't let them take this amazing opportunity away. Your twin is speaking from resentment that you can go away to college. They stole 4 years from you already, don't let them steal this. NTA", "they can demand child support all they want but they won't get a dime of it because she's not responsible for it and the courts will make sure they won't receive anything", "And then OP can and should say “tough shit.”", "Good luck getting that past a judge! They'd likely try emotional manipulation, or should I say *more* emotional manipulation.\n\nNTA, OP, and get out of there asap! They're totally taking advantage of you, your parents have been neglecting you for the past 4 years, and you owe them NOTHING. Get out and live your life. Go low contact, or even no contact, for a while, until you find your feet and are better able to deal with them.", "I am also going to make a guess that since the sperm donor effectively disappeared, he was significantly older than Mary. If he was another teen in the same town, finding him would have been simple.\n\nThe family needs to track down the sperm donor and make him take financial responsibility. He got a free ride, and OP paid the price.", "Mary was likely statutory raped at age 13.  If it was one of the boys at school it be simple to track him down.  No, it was an older man who raped a child.  Mary may be taking advantage of her parent's favoritism, but she's likely a victim of her parent's \"pro life\" agenda, shame culture (she may know who the father is but is ashamed to say)  and some older man's manipulation.", "Unprotected sex with someone random or enough someones to be unable to find the father at that. And while i can reflect on some of my older teen years i perhaps could have had the same problem it is just like that one extra bit of giant mistake that OP should not be responsible for.", "No guarantees there. It is a family of four in a two bedroom apartment with a fourteen year old single mom who was like, \"obviously keeping the baby is best for everyone involved.\"", "OP, please take this advice and the advice about letting your college know that no one can communicate with them on your behalf. And yes, change all your passwords. This may seem extreme, but it’s better to do this and not end up needing to than not do it and wish you had.", "Not that you should be required to contribute anything, but I also find it helpful to purchase what someone needs more than giving them the money to do it themselves. Baby needs formula? Buy the formula. Too often the person receiving the money buys just for simple example, less formula + 1-2 candy bars or a pack of cigarettes because they’ve justified it somehow.", "Also place a credit freeze on your credit report.", "OP may not be able to get a storage unit at their age, or afford to keep one for as long as college takes, may be better to keep those things at a trusted friend or relative's house.", "THIS. THIS. THIS.\n\nYour university will provide you a username and password. Usually both follow a pattern of some sort. Definitely change the password on your university account and **DO NOT SHARE IT WITH ANYONE EVER**. \n\nAlso the using gibberish is great advice. People don't realize how easy it is to social engineer information and get passwords based on security questions. (What's your first grade teacher? Sandwich. Your oldest niece's name? 2022 Airplanes)", "You should use a combination of 3 words for the most secure password. My old emo password was MyCyanideCatharsis. Gibberish can be cracked much easier which is why bitcoin wallet seeds are words. Jsyk!", "> a new version of an original password (kittens --> k!tten$)\n\nBest practice is to make a password longer. Here's a chart to follow. \n\nhttps://thesecurityfactory.be/wp-content/uploads/2020/05/crackingspeed.png\n\n\nilovemykittenssomuch (a password with just lower case letters) would take 1 quadrillion years to crack vs. k!tten$ which would only take 49 minutes.", "Yep. Some girls in Mary's situation would be off to college or a trade school program themselves. They would have finished high school, maybe through an online program, and they'd be looking forward to learning how to do hair and nails or be an LPN or a lab tech or a welder. The fact that Mary doesn't seem to have done any of these things is ... concerning.", "Sounds like sister needs to pick up some night work when the folks are home to watch her baby!", "Or a safe deposit box at a bank", "Yeah she’s very impulsive. She doesn’t stop to think whether something is a good idea or not. She got worse when her boyfriend broke up with her. I guess she just wanted a distraction", "She definitely does. If something crosses her mind, she has to do it immediately. Even if I try talk her out of it, she’ll still do it. Once when we were 16, a friend of our parents came for dinner. He held my niece and kept saying how cute she was. My sister told me she thought he was really handsome and she would shoot her shot. She said him holding her baby made her think he would be a good dad. I was like wtf??? I told her to stop messing around, he had a wedding ring on and looked even older than our dad. She got his number from my dads phone and started texting him. I went through their texts and she was being extremely inappropriate. He blocked her number soon after he realised what she was trying to do.", "I think part of the reasoning could be that the impact has been so huge that the only way to bear it is to think it was the only path forward.", "Pro-life people think abortion is literally murdering an innocent baby. So why would the age of pregnancy be relevant at all? If anything, I'm surprised they didn't give it up for adoption", "To be honest a lot of her story wasn’t making sense to me. Like how does no one else know who this guy is? Their two friend groups were chilling together the whole time but apparently none of her friends have any of the phone numbers of the guys they were hanging out with all day or full names at the very least? \n\nI do believe that she slept with him within a few hours though. My sister is really impulsive, and she always has been. She started dating her previous boyfriend in a similar manner to this. He was our friends step brother and she slept with him the first day she met him, and they went on to date for about a year. She said the guy she slept with at the amusement park wore a condom so she didn’t think that it was risky.", "I hate admitting this but I have bpd and at 14, my hormones were so much crazier than they are now and I was way worse then. I did something very, very similar to this (minus the pregnancy part).", "You must not have been around teenagers in a long time. This is not new to impulsive, hormonal teenagers. Hell, some adults are the same way. Being pro-life doesn't always make  someone more cautious when having sex.", ">I have serious doubts this is the real story\n\nTo me, it reads like a cover for sexual abuse, especially with the parents reaction; as if they're trying to cover it up. Add in the sister's extreme behaviour... I really hope I'm wrong and just cynical here.", "Because you’re not used to hearing it and it’s overwhelming to take a compliment because you’re not used to receiving them 😢", "Another internet stranger here to tell you you are doing amazing. You have a right to live your life, to make your own choices, your own mistakes, your own path. You are not your sister and you should not have to suffer the consequences of her choices. Do not for a second feel guilty, you deserve all of this, you worked hard for it, you are worthy.\n\nAs for your parents, remember living well is the best revenge", "I have read all of your comments on this thread OP and this broke my heart. Reading your comments has shown me you are a very intelligent and strong woman. Coming from another mother, I am so proud of YOU!", "This! If 80% of your pay was going into the household OP, your parents income shouldn’t be counted for ability to pay for college. Def talk to admissions/student services/whatever department handles loans in your school if you do plan to get loans. If you can get independent status you’ll qualify for Pell grants on top of being able to take out federal loans in your own name up til all your aid/loans adds up to the cost of tuition and fees plus cost of living calculated by the school.", "Also, I +highly+ recommend the website [Scarleteen](https://www.scarleteen.com/). A lot of safe sex is knowledge around safe sex and consent.", "Many larger universities will have health clinics on campus, and this is one of the largest areas they serve due to the nature of college.", "This is great advice. OP, please read this! There are so many birth control options available now that weren’t available in the last 15-20 years. IUD is completely safe. Please visit a OBGYN office for a check up and they can help guide you. You are making the right choice in leaving for college. I certainly wished I did. My mom left my father for another man and I was stuck raising an 11 and 13 year old by myself (as a senior in high school) because my dad didn’t want to parent. I stayed home and went to a local college. My parents have never apologized for putting me in that position. It’s been over 20 years and my relationship with them is just cordial at best. Go live your life, OP!", "Be sure to get the HPV vaccines too if you haven’t already. Don’t fuck around with HPV", "And for the love of everything good, if you are going to drink, learn and know how to drink responsibly!", "Yeah honestly I already have anxiety, I can’t imagine hoping my period shows up every month. The risks associated with sex don’t sound all that worth it to me to be honest. The terms of maintaining my scholarship are also quite harsh so I’ll have to be on top of things. I want to have fun but not like that. The anxiety probably won’t even let me enjoy it.", "Not only alcohol can be \"roofied\", any drink you have can be drugged. If you are at a party, bar, someone's home, keep your drink with you AT ALL TIMES. If you happen to leave your drink unattended FOR ANY AMOUNT OF TIME, it's done. Don't drink from it again.\n\nSounds dark, but hey! Better safe than sorry.", "Always protect your glass, never leave your beverage unattended so that someone would be able to drop something in it.", "Dang it, my “A” in the haiku unit was a long time ago.", "Shit I tried ☹️", "Exactly! Mary is resentful because OP didn't screw up her own life like Mary did, and so young, too. OP should get out now, while she still has a chance.", "It sounds like OP is the only person in her family that values education.", "This is what I don’t get. The baby will be in preschool or kindergarten by the time OP is a sophomore. How will she be taking care of the kid then? It’s in school! \n\nPlus, something tells me Mary won’t have to get a job when the kid is in school.", "You put into words what I was trying to figure out how to say. On what planet is it right for her sister's choice to wreck her life too? It doesn't even sound like it's plural though, it seems like she is the only one being punished for her sister's choice. Its time to get out of there and let them figure it out, and not feel guilty for wanting her own life.", "Well at least it's internally consistent: they're the same people, and also they're the extension of the mother, so when she has to support one of her daughters, the other one can't just like, live her own life when she herself can't?! /s \n\nFamily for some people really means dragging each other down to your level instead of trying your best to lift them up.", "Honestly-I wouldn’t be surprised if they were freaked out by their 14 yo being pregnant and didn’t do this in part to keep OP away from boys!", "Legally? It’s not. They would guilt her into doing it but no court is gonna entertain that for a second.", "There have been cases where a not-the-father guy was forced to pay child support because he took on being the \"father figure\" to the child. The mentioned guys were not related to the mother at all, so I'm not sure if an uncle was successfully sued for child support. Still, OP is luckily a girl (meaning she cannot be a mother figure to the child because the damn mother is still there) so they can't even approach her with all that child support bullshit.", "Families will require child support when OP is educated and has a good job because “that’s what Mary would have done for OP.” \n\nOP, that is NOT your obligation.", "I agree. Even if he was a minor, he probably isn't anymore. I don't know what the law says about this case (becoming adukt AFTER the baby is born) but they should at least try to get money from him.", "If you ask me every teen mom/dad is victim of someone/something. However, making OP victim too won't solve anything. Mary needs psyhological and financial support and OP needs to get her life back.", "This isn’t a baby anymore of it was born when they were 14 and she’s graduating. This kid is pushing pre-k and definitely should be out of both diapers and off formula. \n\nYour point stands but this “baby” doesn’t need infant supplies any longer.", "I left things at a relatives house that was then influenced by my family when I left town and I lost those items. Better to ask the trusted relative to co-sign for a storage unit lease than leave precious sentimental items with anyone the parents know. \n\nAlso, usually the age restriction can be bought lol\nIf you offer a deposit, they’ll usually rent one to anyone with a pulse.", "That level of impulsiveness is very concerning. \n\nHas she ever been assessed for adhd or mental health disorders?", "So. She needs to see a professional about this. But that’s not your job, not your responsibility. But maybe it helps you to know that you literally could never help enough. There will never be a point where she thinks you’ve done enough and she needs to take over. \n\nDon’t sacrifice your future success and well-being on this altar. I’m a big believer in family supporting family but my family would never ask this of me or anyone.", "I am the more impulsive one in a set of twins while my twin was very organized and productive and my behavior drove them nuts. They always asked why I acted like everything was my last chance to do something. At your age, I would’ve resented their leaving and going off for an experience that I couldn’t share, but later would’ve realized it was the right thing to do. It was hard the first time I moved away, where I wasn’t “one of the twins” for the first time, but it actually did wonders for my confidence and independence as my twin was definitely the more dominant one. Your lives will not continue in parallel so don’t pass up this wonderful opportunity you have earned. Don’t let your family’s fears for themselves hamstring your future.", "So you have a good idea of who your sister is and that she's trying to drag you down?  She resents her own circumstances created from her own decisions so she wants you to suffer and use you until there's nothing left.  You are capable of thriving after you get a good education and people who actually love you wouldn't want to destroy your future", "Surely they must have mentioned which school they go to at least?! Which area of the city they’re from?\n\nHer story sounds very suspicious. My money would be on an older stranger, not a 15 yr old boy.", "I'm sorry, but your family is annoying. If you CHOOSE to have a baby then it should be your own responsibility. You can ask for help occasionally, but it sounds like they're treating you like \"the baby daddy\"(they take more from your paycheck then child support would). Tell them to go out and find that father! Scary men at work have found me on Facebook using only my name tag! That baby is her and your parents responsibility. They wanted to keep it they can take care of it. You need to stand up for yourself. Yes you love your niece and I don't know what country you live in, but minimum wage isn't going to cut it. You need higher education/skills in order to have the BASIC NECESSITIES. Do not set yourself on fire to keep them warm! \n\nYour sister needs to think about her future too, one that doesn't require you to give up your future for. There are programs for medical billing coding etc. For no/low income parents that provide childcare (at least in Cali) tell her to look into those. She could be doing anything to help herself and her baby, but it's easier to take your money and time. Don't feel bad for her it sounds like she's been coddled, she steals and is lazy and I blame your parents. Your niece will be fine...maybe not having you as a fallback will light the fire under her ass.", "Kiddo, you can do this. You’re more prepared than most college students moving out of state in terms of forced maturity of child rearing. Your big goal is to make sure your education lands you in a place to support yourself. Make every decision with that goal in mind and you’ll make it through. \n\nYou don’t have a traditional family safety net but colleges are generally good about having counseling services you’ll just have to ask around to find the right service to have a conversation about a given decision you are trying to make. \n\nLook into establishing residency in your new state. You might have trouble with vacations and I’m really sorry to put this out there but depending on what direction your parents go, they don’t have to accept adult you back.\n\nEdit: syntax correction", "You sound like you have a great mindset and a clear goal for your future. I am wishing you the best!", "I’m past 30 and still a virgin. In my case, I’m just not interested, but I’m doing just fine without sex in my life! Don’t let anyone pressure you to have sex or worry about the stigma of being a virgin, there’s nothing wrong with not being sexually active!\n\nThat being said you should see if your college offers cheap therapy options, mine did. While there’s nothing wrong with choosing abstinence, you have very practical reasons for doing so, you don’t want your anxiety to run your life. Take care of yourself!", "And double bag.\n\nCondom + pill.\n\nBetter yet, stick to girls. Jk.", "I enjoyed it. Lol", "I'm fairly sure this is about OP no longer working and giving 80% of her wages to the family. They don't want to lose that income. They've proven by their response to her GETTING A FULL SCHOLARSHIP that they do not care about what is best for OP.", "I’m curious how a 14yo got pregnant and the father was able to just disappear before even being told", "Good luck with that, since it seems like OP has a spine. Once she's out she'll look after herself, helping here and there but I doubt she'll let them guilt trip her, if this post is any indication of her character", ">Still, OP is luckily a girl (meaning she cannot be a mother figure to the child because the damn mother is still there)\n\nAlso, she was luckily a minor when all these burdens were put on her, so even if it were possible to establish some sort of track record of responsibility in a case like this (which it's not), that possibility wouldn't apply to her. She never willingly took this on at an age when she could undertake legal commitments. \n\nWhichever way you look at it, the only power the family has over this young woman is guilt, and it looks like she's reclaiming that from them. Good for her.", "There have been cases where a child was raped by an older woman who became pregnant and gave birth.\n\nAnd then the courts deemed the child fit to pay for child support.\n\nFucked up world we live in.", "The mother is also an adult now and unless I missed it I don’t think the mother is working nights/weekends to help herself in anyway.", "ADHD impulsiveness results in hyperfixations, like overspending on a new hobby and abandoning it after a month.  It doesn’t result in risky sexual behavior and theft.", "I will add that all the “help” that was required for you to give could actually be preventing her from getting the real help that she needs. \n\nBe prepared for things to appear to be falling apart after you leave. Remember that it could be a necessary thing in order for things to fall together for the whole family, especially your niece. If it’s too difficult for you to watch happen then don’t look until they’ve make progress after getting real help. \n\nYou can do this. It’s not going to be easy but you can do this. Best wishes to you going forward.", "Different ADHD people express their impulsiveness in different ways. It can 100% result in risky sexual behaviour and theft.", "Not typically. This sounds more like manic behavior-an indicator of Bi polar disorder- than ADHD. \nWhile ADHD people can do high-risk sex due to impulsivity, the theft and such does make me think more bi polar."]}