{"id": 16805, "submission_id": "13cwzgm", "title": "AITA for having a party at my apartment while a neighbor was studying?", "selftext": "2 weeks ago a college student that lives to the apartment next door, went door to door to every single apartment on our floor and the floors below and above us to warn each neighbor that she has her college exams coming up and she's studying so we better not have any parties until the end of May. She was somewhat kind and having been through the stress of exams I was compassionate and agreed that I won't have any loud parties but I told her that my birthday is on May 5 and on Friday night I'd probably have a couple of friends over and have some low music.\n\nShe got annoyed when I told her that and told me that I better be quiet then. I didn't like her attitude considering the fact that I was trying to be empathetic and also told her I'd not do anything crazy for a party besides low music and some friends over.\n\nOn Thursday evening after I came back from work I saw two notes, one on the building entrance and one on the elevator which said \"I'm the college student from floor 7. Please refrain from any kind of social gatherings that might disturb my studying during this stressful time\".\n\nI didn't give much thought to it. I wasn't planning on a party as I said.\n\nOn Friday night I had my three closest friends come over. We didn't party. We just chilled at my apartment and had some low music which barely could be heard to my own bedroom let alone next door apartments.\n\nOn Saturday morning there was a note on the elevator once again, straight up naming me saying how \"Lady Y from the 7th floor and apartment number X broke the agreement and had a social gathering on Friday night completely disrespecting the stressful time I'm going through. She said she's be discreet but this is not enough. I could still hear some laughs and discussions because I had my windows and my balcony door open and disrupt my peace and focus. Let this be a lesson the next time someone decides to disrespect stressful times like this. You will be called out\".\n\nCertain neighbours defended me and said the college girl was being unreasonable with her demands but other neighbors believe I was an AH and that I should go to a restaurant or a bar instead of having a gathering at my house.", "created_utc": 1683647409, "permalink": "/r/AmItheAsshole/comments/13cwzgm/aita_for_having_a_party_at_my_apartment_while_a/", "score": 1309, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I may be TA because I didn't follow the instructions of a neighbor who was studying for her exams.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. \n\nIt is completely unreasonable for her to ban other people from having (pretty quiet) social gatherings for six weeks.\n\nShe wasn't even prepared to close her windows! She sounds unhinged, to be honest.", "NTA. This woman sounds incredibly entitled. I love that she thinks she can go around demanding that people not have guests *in their own homes* and then seems to think that this created some sort of \"agreement.\" If quiet is so important to her, then *she* can go somewhere else, like the library.", "NTA. Quiet studying is what the university library is for.", "NTA\n\nIf this girl really wanted peace, she would have shut her door and windows.\n\nAlso, expecting an entire apartment building to be silent and for no one to spend time with friends at home for a whole MONTH is not reasonable", "NTA. \n\n>  told me that I better be quiet then\n\nHow to get someone to throw the greatest rager of all time.", "NTA\n\nThis person is unhinged. There's no social agreement and all she is entitled to is typical noise levels (i.e. no blasting music) and quiet during quiet hours.", "NTA - She's the AH for asking too much of what are mostly total strangers. It's extremely presumptuous to ask this many people who you do not know to put a part of their lives on hold for a month. She can go find study areas at her school that are quiet an (usually) open 24 hours a day. Not your problem", "NTA. Has she heard of a library? Or oh idk. Closing the doors and windows? She can’t expect everyone to put their lives on hold just for her. What would she do if she was living in a dorm? You didn’t agree to anything. There was no legally binding contract saying you had to be completely silent and walk on eggshell covered thin ice around her. If you’re gonna live in an apartment building you’ll have to prepare to put up with some noise because it’s not a little isolated hut on an otherwise deserted island, it’s a building full of people who have lives outside of sitting in silence to please her.", "WOW. I mean... wow.\n\n/r/ImTheMainCharacter\n\nI'm the type to be empathetic, too, but that's too much. Anything above and beyond the noise ordinance guidelines for your area is a favor, but she's acting like your silence is her right.\n\nTell her to buy some f\\*cking earplugs.", "NTA. Expecting a whole multi story apartment building to sit in complete silence for an entire month because you have exams is actually insane.", "NTA. She has no right to demand people not make noise because she is studying. She can study in a library or close her windows etc.   \nWhen you live in an appartmentbuilding, you'll need to learn to expect some sound from others. \n\nHer 'ask' was unreasonable and her calling you out was childish and petty. She needs to grow up.", "NTA the gall of her to act like a hall monitor is shocking. Imagine if she had spent all of that time studying?", "NTA- your neighbor has main character syndrome and seems to think that everything is about her. The audacity to go around door to door and tell people they need to be quite for 6 weeks so she can study!?! If she an issue with sound she should put in headphones or ear plugs. I would be reporting her to the landlord TBH but I'm petty", "NTA, you had guests over. Ignore her or report her to the RA.", "NTA\n\nIt’s not like you threw a rager, it was 3 people… How much noise can 3 people make? \n\nBut honestly, how she can waltz around expecting people to be quiet for a month is beyond me. She’s the one being unreasonable here, not you. Sure, you can *ask* your neighbours whatever you want, but that doesn’t mean they *have* to comply.", "NTA, you didn't do anything wrong. She on the other hand is harassing you. She lives in an apartment complex, her neighbors will occasionally have visitors, she can't dictate what everyone else is allowed to do within reason. I'd go print what the law says about it and post that where she posted her signs. It doesn't sound like you did anything that would break any laws or that was even remotely unreasonable. If she wants absolute quiet, she can go to a library to study.", "NTA\n\nIt’s your apartment. Sure, maybe you were a little louder than you thought to give her benefit of the doubt, but at the end of the day she’s making demands of what people do in their own space. If it bothered her that much, she could buy ear plugs or go to a library to study. \n\nSincerely, someone who has also gone through finals week and knows what sort of Hell it can be.", "NTA. She really needs to get a better grip on reality because she does NOT get to dictate the lives of everyone around her like that. Just wow.", "NTA.  Lol what entitlement!  The Queen is studying so all her subjects must remain silent!  Introduce her to the concept of earplugs.", "NTA\n\nShe was unreasonable. It's an apartment building. People are going to make noise. She can go to the library and study.", "NTA. If she wants some quiet, she should try the library or the dark side of the moon. It is not everyone else's job to be quiet. I would have an extra loud party just cause I am a vengeful person, especially with entitled people.", "NTA she sounds like a dick! \n\nHonestly she cannot control what neighbours do, there was no agreement, she made a request, you gave her the heads up. If she is that distracted by a few people and quiet music then she needs to figure out how she can be more focused. She has options, closing the balcony/windows for one, putting on music she likes, or ear plugs if she wants total silence. \n\nGoing to all apartments is weird in the first place, you don't preempt people are going to disturb you. if they are disturbing you and within reason, you speak to them as and when it happens. She's made herself look like a dick. You're fine.", "NTA. Your neighbor thinks she's the main character in everyone else's story.\n\nYou were under no obligation to honor her request but it was nice of you to be considerate. Her attitude is impressively demanding and encroaches on your personal living space. \n\nAs long as you abide by the rules of your tenancy, you're fine. I wouldn't give her another thought, especially given her entitled attitude.", "NTA- she is entitled and needs to get some perspective.", "NTA\n\nThis is why God invented noise cancelling headphones.", "If she wanted silence she could have closed her windows or gone to the library, your life doesn’t revolve around her. \n\nI notice she only mentions no social gatherings. Sounds like the perfect time to watch an action movie. On top volume. Alone, since you can’t have friends over.", "NTA.  Report her to building management/landlord for harassment.", "She can study at her library for one whole night", "NTA. Unreasonable request and behavior imo.", "NTA, but I am and petty and vindictive. The night before her exams, I'd throw a raging kegger.\n\nETA: spelling corrections. My drunken autocorrect gnome thought kegger should be keeper.  Lol", "NTA, you were being reasonable and it was a Friday night.  This student has major issues and this one event is just the start of her hard life.", "NTA—— one the music wasn’t super loud or wasn’t played until late at night, then she can’t dictate what you can and can’t do in your apartment! When I was in college, the library was open 24hours/day during Finals week, and they were lots of tables/study rooms available for use.  Maybe she can try studying there. -_-", "Lol. NTA. She should have closed her damn windows if she didn’t want ANY sound coming in.. or get some headphones or plugs or whatever. She can’t expect the world to stop and cater to her.", "NTA - If she thought she would be entitled to complete peace and quiet in an apartment building, she thought wrong and will be surprised when she continues to get push-back for the rest of her time in college (and beyond).\n\nI would also want to be petty and call her out also in a note stuck to the elevator (but I don't have the courage to so wouldn't blame you if you didn't do this either).", "This is INSANE. NTA. This young woman is the most entitled person I've ever heard of. Lot of people have stress. It doesn't mean that the lives of neighbors come to a screeching halt to accommodate it. And it cracks me up that she thinks her posting a note constitutes an \"agreement\" on your part. If you have a decent relationship with your landlord or management company, I'd get in touch and say this woman is making you feel unsafe/uncomfortable in your home. I'd sure as heck feel unsafe if some random neighbor was posting notes criticizing my entirely acceptable behavior. My opinion is based on nearly 2 decades living in apartment buildings in NYC.", "NTA she doesn’t own the apartment building, you were completely respectful to her the entire time and just had a few friends over for your birthday if that is too much maybe a dedicated study space would be good like hmm idk the library 😂", "NTA.\nBut your neighbor sure is.\nWho the hell is she to demand everyone in the building cater to her?\nI’d call the building manager on her.", "NTA\n\nWow, your neighbor’s behavior is terrible & entitled.", "NTA. She is fucking delusional.", "NTA. She can study at the library. There's no reason to expect your entire building to be quiet like mice for 2 wks", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n2 weeks ago a college student that lives to the apartment next door, went door to door to every single apartment on our floor and the floors below and above us to warn each neighbor that she has her college exams coming up and she's studying so we better not have any parties until the end of May. She was somewhat kind and having been through the stress of exams I was compassionate and agreed that I won't have any loud parties but I told her that my birthday is on May 5 and on Friday night I'd probably have a couple of friends over and have some low music.\n\nShe got annoyed when I told her that and told me that I better be quiet then. I didn't like her attitude considering the fact that I was trying to be empathetic and also told her I'd not do anything crazy for a party besides low music and some friends over.\n\nOn Thursday evening after I came back from work I saw two notes, one on the building entrance and one on the elevator which said \"I'm the college student from floor 7. Please refrain from any kind of social gatherings that might disturb my studying during this stressful time\".\n\nI didn't give much thought to it. I wasn't planning on a party as I said.\n\nOn Friday night I had my three closest friends come over. We didn't party. We just chilled at my apartment and had some low music which barely could be heard to my own bedroom let alone next door apartments.\n\nOn Saturday morning there was a note on the elevator once again, straight up naming me saying how \"Lady Y from the 7th floor and apartment number X broke the agreement and had a social gathering on Friday night completely disrespecting the stressful time I'm going through. She said she's be discreet but this is not enough. I could still hear some laughs and discussions because I had my windows and my balcony door open and disrupt my peace and focus. Let this be a lesson the next time someone decides to disrespect stressful times like this. You will be called out\".\n\nCertain neighbours defended me and said the college girl was being unreasonable with her demands but other neighbors believe I was an AH and that I should go to a restaurant or a bar instead of having a gathering at my house.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. Just how apartment living is.", "NTA. Tell entitled college student to go to the library, get some good earplugs or suck it up because the entire world doesn’t stop just because it’s finals.", "NTA. \n\nI wouldn’t have listened at all just because of her sheer audacity. To think you get to tell dozens of other adults what to do in their own homes for an entire month lmao.", "Clearly she has other issues. Wow- her sense of entitlement is amazing. She has a lot of time to go door to door and hang up notes. You paid for the place and have a right to enjoy it, within reason. To demand you not have people over denies you use of your space. It was a Friday night and if it was a problem, she could have knocked on your door instead of being so passive aggressive.", "Write a condescending note to this person. Just a war of ridiculous escalating notes. I would throw parties everyday that comply with the noise ordinance.", "NTA. if she wants quiet then she should move into a house in the countryside, not an apt. If she wants to dictate how ppl live in their homes the  she can pay their rents.", "NTA and you're far kinder than me; I'd make the building rattle with my soundsystem in response", "NTA, I've lived next to neighbors who throw pretty loud gatherings on frequent occasions and I just use noise cancelling ear plugs and headphones.", "WTF. The audacity of this girl. Absolutely insane. There was no \"agreement\". There was her demanding something and you being polite enough to try. I would be ripping down every single one of her notes as soon as I saw them and dump them in front of her front door.", "NTA. That would be speakers next to the wall playing the bassiest shit I could find every day from the moment quiet hours don't apply to the legal cut off time. I'd keep doing it till they moved.", "I'm sorry, but absolutely no one studies for six weeks straight without needing to take a break. Neighbors too loud? Go take a walk to destress. Dog barking across the street? Take a moment to get a snack. Calling for all out silence is impractical for one night, let alone a month and a half. No one is actually using all of that time to study.", "NTA your neighbor is way out of line. I'd consider having another party just to spite her.", "My note the following day “this is resident Y from floor 7. The College student should maybe see a doctor.  Every morning she gives birth to what sounds like pudding being squirted from a balloon.  Not only that, but having the windows and such open in the spring the smell is gawd awful.  It smells somewhat like dirty underwear marinated in a monkey house drain. “", "NTA tell her she ll have a say in your life when she ll pay your rent. \n\nWhat is going on with people in 2023.", "Hmm, if i were op, this might be the time I suddenly developed a taste for heavy metal music…\n\nNTA OP.", "NTA\n\nI'm all for not being a public nusiance and respecting your neighbors but there's a big difference between that and having some stranger try and impose on my rights. I'd get real petty with the noise until exam time if it was me personally", "NTA. Everyone is supposed to put their lives on hold for her? That’s bonkers", "Ffs princess, go to the library.", "NTA. I would be tempted to play all of the GWAR songs from the AV Club’s Undercover series pretty loudly, on repeat for all of May.", "Good grief. There are these magic objects called \"ear plugs\" that block noise. Your ridiculous neighbor should try them while studying instead of being a petty dictator. NTA", "NTA she shouldn't live in a shared space the audacity to knock on everyone's door 🤣", "NTA. Report her to your building manager for harassment so they can tell her to chill out. She needs noise cancelling headphones or to go somewhere else if she needs sensory deprivation level quiet during non-quiet hours.", "NTA. \nBut please throw a party this weekend", "NTA\n\nShe cannot dictate to people what they can or cannot do in their own homes.", "NTA. I would have posted a notice that she could have gone to a library if she needed absolute quiet.", "Do any if your friends have a baby that would like to visit? Preferably a cranky one? Her requests are unreasonable and she isn't even closing her windows or balcony door for her own privacy. NTA", "NTA, she doesn't have the right to dictate to everyone in the apartment building what they can or can't do in their own apartment.", "A neighbor told her that she should close her windows and doors next time if she's that annoyed", "She could hear laughter and conversation - the horror! \nWhat was she going to do if someone in an apartment near her had a baby who had the gall to cry while she was studying for her exams?!", "When I told my friend that she was so petty she wanted to throw an actual party for me but I tried to calm her down and told her I don't want any trouble 😂 turns out loud party or quiet gathering the girl had an issue either way", "Holy shit you’re not kidding. I’d throw an all timer  out of spite.", "Oh I haven’t even thought about that. I assumed since OP repeatedly referred to the girl as “college student” not “classmate” and the building as an apartment not a dorm that OP wasn’t in college. \n\nOP, your lease (or dorm guidelines) should have quiet hours listed. As long as you were within those guidelines you are fine. Report her to the building manager (or RA), I’m sure you can’t posts personal signs outside of a billboard", "Personally I'd go for a TV marathon, with a show that had a loud opening theme and would jolt her at regular intervals...this would also be the perfect time to vacuum or get rid of all those eggshells I've been saving to go down the garbage disposal...", "More than two weeks. The neighbour asked two weeks ago and expects quiet until the end of May. That's more like 5 weeks.", "If she's in that dire need of quiet, she should look at alternative places to study, such at a library.", "I'm gobsmacked that ANY neighbors actually agreed with her and called you out. \n\nWhat did they say to you? What is their reasoning/justification that an entire building has to go on lockdown for a month, because a single tenant simply demands it? And that the tenant doesn't themselves need to ensure their peace and quiet, by closing their windows? \n\nI'm genuinely curious about the mindset of anyone that actually finds this tenant to be acting reasonably.", "I would have told to f... off for dictating what I can and can't do in my own apartment. If she was that concerned about having quiet sh should have gone to the library.\n\nNTA", "In any case, the neighbor has no expectation that the whole building will be quiet for weeks on end.", "Yeah I find it aggravatingly hilarious that the neighbor thinks that she’s the reasonable one here. I’m a big time introvert and I would’ve found reasons to have people over every night til her exams were over if she’d tried to pull this.", "Some people are such followers that they just side with the person who is the most upset. For other examples see American politics.", "Please leave a rebuttal note where she left hers \n\n\"entitled student from Y floor and apartment number X thinks she is the main character. Just because you ask \"politely\" does not mean people have to comply with your wishes. Note that if student wanted peace she could have easily closed her windows and balcony door she so smartly decided to leave open. It is not my responsibility to cater to your needs. Grow up and be better\"\n\nNTA", "> Lady Y from the 7th floor and apartment number X broke the agreement\n\nWhat agreement?  You didn't agree to anything.  A unilateral demand does not an agreement make.\n\nNTA, you were way more considerate than most would be.  If it were me, I would get into a passive-aggressive note war with this demanding student, to the effect that I never agreed to anything and the whole building doesn't revolve around her schedule.", "NTA. I would have thrown a rager. If she isn't paying your rent she can GTFO", "NTA.  Tell your neighbors who agree with her to buy her noise canceling headphones. \n\nI’d call your landlord and let them know that this person in apartment xx told everyone they couldn’t have parties for all of may. And that when you had a few friends over, she complained because you were laughing and she heard it through her OPEN door and window. \n\nLet him know she continues to harass you and to please have him tell her to stop.", "NTA. My petty ass would've thrown the biggest, loudest party the very next day I read that note.\n\nYou still have time, tho. Throw that rager 😈", "NTA, but her reaction would make me one. Put a speaker facing her wall and play baby shark on loop for the next several days.", "If that happened to me my petty ass would post flyers all over the place documenting her entitled attitude. NTA", "NTA, she lives in a block of flats, she's gonna hear noise. She can't demand nobody has friends over.", "She could have gone to the library to study or to the park or cemetery (I heard it is quiet there). Why make the WHOLE building tenants adhere to HER needs? The entitlement is unbelievable. An acknowledgement of request is not a formal contract of agreement. This student doesn't own the building, does not set the rules, hence NTA.\n\n\nNTA.", "I would be telling her it's time to be in the real world....no one is going to stop living for one person.\n\nNTA", "NTA  \n\n\nLMAO - she can't dictate what people do in their own homes. OMFG.  \n\n\nI would report to landlord now, only because this is some next level entitlement, and this won't be the last time.", "NTA - there’s something called a library where being silent is required.", "What is with entitlement these days? If YOU have an issue, YOU need to resolve it; and that DOES NOT include demanding others acquiesce to your preference. College girl didn’t even keep her windows closed! You are NTA here. Who does this girl think she is, demanding strangers basically put their lives on hold to accommodate HER and HER alone? If she needed quiet to study, she can go to the library. And her college campus probably has study areas she can use as well.", "NTA. You are nicer than me. I would have had loud music playing everyday after she was rude and entitled to me.", "NTA. I would talk to building management as she is harassing you and calling you out for doing completely reasonable things. \n\nGirl needs a reality check. She left her doors and windows open and heard… laughing?! Heavens no!!! \n\nThis is crazy.", ">I should go to a restaurant or a bar\n\nShe should go to a library or cafe. Why does one person get to decide what every body else in the building gets to do or not do?\n\nShe couldn't shut her window? Get headphones? I would be complaining to the landlord/management company about her notes and her aggressive entitlement. \n\nNTA at all.", "NTA\n\nThat isn't reasonable. The weekend before finals? Reasonable. The whole week before finals? Maybe reasonable. More than that? Nope.", "NTA. I wouldn’t even call you an asshole if you had actually thrown a party on a Friday night.", ">she has her college exams coming up \n\nNot your problem.\n\n>we better not have any parties until the end of May.\n\nFuck that.  She can go to the library if she wants silence.  \n\nNTA.", "Is she paying everyone’s rent for the week? No? Then she has no say. Time to take up tap dancing. NTA", "oh no not *laughs and discussions*. NTA", "NTA\n\nPerfectly reasonable request to ask neighbors to keep it down past a certain time, like quiet hours, but in no way can you ask neighbors to not make noise for weeks on end while not doing anything to mitigate the noise you're hearing (closing windows, doors, headphones, etc.)\n\nIf they really need quiet for studying at any time, then they need to find a location that is guaranteed that, like ya'know, a campus library built for that purpose", "NTA. Lmao wtf", "NTA - you are fully entitled to do anything in your apartment which is in line with your lease and in line with local laws.  Her request was unreasonable and is essentially harassment from her as you were within your rights as the apartment occupier.", "As long as you are not interfering with quiet hours, you're fine. Most townships set 10 or 11 pm for reduced decibel levels. Most college libraries have quiet rooms your neighbor could have gone to. I did the dorm life: 24 hour quiet rooms are a thing on many campuses. Not odd for commuters to stay at ours, either.\n\nNTA\n\nShe is also rude, just do what you want and ignore her. If you get another note on your door, tape it back to hers with \"return to sender\" stamped on it. She is completely out of line here. Also, if you want to have a gathering, have a gathering. If she says anything, make it clear that she is rude and needs to sort her stuff out without inconveniencing everyone else.", "I would have laughed in her face. NTA", "I totally get being stressed and needing a quiet environment to study, but you can't expect complete silence when you live in an apartment.  Her expectations are completely unreasonable.", "NTA and honestly I’d file a complaint with the landlord/property management company/whomever runs the apartments. Not just because she’s being wildly unreasonable, but that behavior isn’t going to stop and who knows how she will escalate to any future perceived infractions. Plus I would be PISSED if someone put my name and apartment number in a public space like that. You never know if someone is hiding from an abusive ex, stalker, estranged family, etc. and they just announced exactly where you are.", "NTA If her neighbors are too loud, she can go to a library or put on headphones. It's not her place to demand the entire building be silent for a whole month. And she left her doors and windows open? Is she going to police how loud people are on the street now? AH needs to check herself.", "Lol if she wants to study with her windows and doors open and then complains because she hears the noise then that’s on her. NTA", "She should have bought some noise cancelling headphones. NTA op.", "NTA\n\nShe is being totally unreasonable with her demand that everyone in the building remain silent for a whole month so that she can quietly study.", "3 Guess in your apartment is not a party. NTA", "WTF? NTA, libraries exist. The audacity of thinking that an entire building will revolve around your schedule.", "NTA - You are not going to stop all activities because of her. The world isn't gonna stop turning just for her. She's probably unhinged like others said. Maybe you should put the contact info for the local Counseling and Psychological Services for students next to her notes.", "Nta. Unless she’s paying your rent she can go suck eggs.", "Bwahaha this crazy chick is in for suuuuch a rude awakening when she moves to anywhere that's not your apartment building! I can't believe everyone tolerated her catty note-leaving. Oh my lord. I had to beg the people above me to stop having raves in their apartment and stomping around like wild elephants at 1a--they kept telling me and the leasing office \"we're being as quiet as we can be!\" And they seemed so nice! Dang. Life will be hard for this one.", "NTA - lol I woulda told them to eff off and learn how to study with noise. Like come on.", "NTA that is totally ridiculous.  How can one person expect a whole apartment complex to do what she wants?   How entitled!  I’d bring it up to management", "Um does she own the whole building? NTA she can go to a library if she needs quiet.", "NTA. The students way out of line clearly. What an entitled little princess", "NTA  Since when do your neighbors get to tell you when you can have guests in your home that you pay for?  She needs to get over herself.  The world does not revolve around her.  The entitlement is astonishing.", "NTA\n\nIf I was going to be called out like that for some small gathering I would make sure it was worth the call out. OP have a rager. Go all out. 20 people, music shaking the walls until 2am. Feck it. If you are gonna get shit on for something might as well make it worth your while.", "NTA - Hahaha, you should hang a sign that says, \"No one cares about your exams. This isn't a library. Stop harassing people.\"", "NTA there’s this great new invention called “noise-cancelling headphones.”", "NTA, wtf is wrong with that gir? I'd be posting a response note directly next to her note like\n\n\"My sincerest apologies! I was still under the impression that this was my apartment, and hadn't realized you were taking over the building for an entire month! I expect that you will be compensating myself and everyone else in the building for the month's rent for which you claimed agency over these spaces? Unfortunately, until such payment is received, I will have to continue assuming that this is still my own home, and will celebrate my birthday as I see fit. Good luck on finals!\"", "NTA.", "NTA. I also live in an apartment and if one of my neighbors asked me this I’d laugh in their face. Print out all these comments and tape them to her note. Then throw a normal volume party every Friday until the end of May. Your neighbor is nuts if she thinks she can ask an entire building to be quiet for a month. Maybe see if you know someone with a colicky baby and bring the baby over and see what the girl says.", "*On Saturday morning there was a note on the elevator once again, straight up naming me saying how \"Lady Y from the 7th floor and apartment number X broke the agreement and had a social gathering on Friday night completely disrespecting the stressful time I'm going through. She said she's be discreet but this is not enough. I could still hear some laughs and discussions because I had my windows and my balcony door open and disrupt my peace and focus. Let this be a lesson the next time someone decides to disrespect stressful times like this. You will be called out\".*\n\nWrite a note and tape it to the elevator.\n\nCollege student from the 7th floor does not own the building. It is unreasonable for her to demand that other tenants need to refrain from normal apartment living for a month because of a HER PROBLEM. If she can not figure out how to study with normal levels of noise from tenants who pay to live here, she can go somewhere else to study like her college library or study rooms. She left her windows and balcony doors open, did she expect the whole city to be quiet because she had to study? If she ever makes a ridiculous request like this again, the landlord will be notified that she is interfering in the rights of the tenants to enjoy their apartment.", "NTA. This is unhinged! If they need silence to study, then they need to go to the quiet/study section of the library.", "NTA\n\nShe has plenty of options such as noise canceling, white noise, going somewhere else to study... the audacity.", "NTA. Honestly, I'd talk to the management/landlord about this. No action item really just, put it on their radar that she's expecting complete silence with even her windows and doors open. She's a complete asshole.", "NTA.  You pay rent for your apartment.  You can do what the hell you like  the apartment you pay rent for. Your neighbor may be stressed but she is also disrespectful.  Her studies do not trump life in general. Her attitude is beyond entitled. You had a simple get-together for your bd, not a kegger.  She is lucky you're nice enough to ask if you are the AH. Someone with no fucks to give would have cursed her out.", "NTA. Fuck them kids.", "NTA\n\nI live in an apartment complex. I'm somebody who does not like noises. Every little noise distracts me, but I have strategies like putting on a fan so it drowns out noises. I also don't tell my neighbors they have to be completely silent. I complain about it, but don't make demands. Your neighbor is being unreasonable in demanding quiet. Also, what's up with your other neighbors? You get to celebrate your birthday wherever and however you like. Sorry if this sounds like ranting.", "NTA. This is completely crazy. I work shifts and don’t get upset at people doing DIY while I’m on night shifts and trying to sleep. That at least is noisy, it sounds like you had a quiet gathering and she could have closed her windows if she needed silence. She can’t ask other people to pause their own lives", "Seriously NTA!! I would've told her \" you don't pay my rent here!\" Go directly to the Library do not pass GO!", "She should study at a library if she needs the peace and quiet that much. And/or get noise canceling headgear. If she were living in a dorm or something she might have a point, but she’s living in a general apartment building apparently. You can’t police your neighbors like that. She can ask for understanding, but nothing more. If someone doesn’t want to than tough luck for her. She can’t make her problem that of everyone else in the building. Especially not for a month.\n\nNTA", "Im sorry but is she the owner of the building? What makes her think she have the right to DEMAND for everyone else to modify their lives for her?\nAnd more important.... Why doesn't she close her frikin windows or wear headphones if she gets so easily distracted?\n\nYou are NTA at all, and are way better than me because I would have make it a point to have all the parties of the year concentrated in that time.", "Or use noise--canceling headphones.", "She’s lucky OP has reported her to the apartment management for the audacity to dictate to other tenants what they can do in their own apartments. If they are still up, OP needs to get them and show them to management if needed.", "NTA - please tell me someone wrote back on the note and said that", "Headphones exist as well.  Jesus she sounds insufferable.", "She rents an apartment and not the building.  NTA.  She deserves to be called out.  She can put on head phones or better yet, go to the library, which is a quiet space.", "LOL\n\nHeadphones. Library. Turn on her favorite show/music.\n\nOr simply close your damn windows.\n\nI could think of some petty ways to respond...\nThe most inocent would be to gift her a PINK FLY PALLETE with a nice message \"to help her study, not even a fly should be around\".\n\nI bet that the other neighbors, who defended her, are as much as in need of a fly pallete as her.\n\n>I can hear you breathing... Stop\n\nMy husband isn't that nice. Disturbed, all the sound system at full volume (who knows how many speakers we have, but they're awesome at movies).\n\nThen the tribal soundtrack.\n\nMy youngest only slept on Disturbed 😅\n\nNTA but your neighbors are TA", "I would honestly take pictures of the notes and notify your landlord/leasing agent because calling you out by name when you're complying with the terms of your lease and accommodating her request within reason is not okay.", "Wait, what kind of building do you live in?  Is it a student dorm building or just a residential building with a variety of residents?  Because  if it's the latter then it's astounding she would have the cheek to ask the entire floor above and below her to not have gatherings for how many weeks?  Wow.  \n\nNTA.  If she need peace and quiet wear earplugs or noise cancelling headphones.  Also she needs to learn the world doesn't revolve around her and plenty of people are studying exams in a lot worse living condition.", "You can also respond with your own note. \n\n“Lady Y from apartment x is laughing hysterically at the delusional College Student from apartment x who thinks that she controls the lives of everyone in the building. She needs to purchase noise canceling headphones, keep her windows closed or study in the library. Hope she passes her classes!\n\nLady Y will continue to go about her daily life and not adhere to the ridiculous edicts of College Student.” \n\nDon’t really do this- it will only add fuel to the fire. But have lots of fun making up come-back notes. College student is being beyond controlling and is delusional if she thinks she has any control of what you do in your apartment as long as you’re following the rules of the building. NTA", "That was my go-to in college. Half the time I didn’t even have music playing in them, but they acted as sort of blinders to keep me focused on studying.", "I would have written \"I did not acquiesce to the Non-Gathering Accords of May 2023. Henceforth, be advised to vacate to the dungeon of learning, aka the library, or close your windows if you desire absolute silence. \n\n Toodaloo, \n\nYour friendly neighborhood person who exists at a reasonable volume.\"", "So, uh, what are your plans for every Friday for the rest of the month? :D", "Lol, this is ridiculous, NTA by a mile. I bet if you hadn't told her you were having friends over she wouldn't have even noticed it. It's seriously insane your neighbors are acting like this, you have the right to enjoy your living space and shouldn't be expected to put your life on pause.", "As someone who lives in Northeast USA....they clearly don't live in this area because every neighbor would've told this \"college student\" to F off, myself included.", "Good point! If she wants to dictate what everyone else does in the building, she can pay their rent. \n\nI'd happily be quiet as a little field mouse the whole month of May if someone paid my rent for me. \n\nBut until that happens, she can sit all the way down and mind her own damn business about what other people do in THEIR homes that they pay for!", "Even in a student dorm that wouldn't fly, the RA would just tell her to book a study room at the library.", "Life is short, party on a Tuesday night too!", "Even if I didn't have anyone over, there would be action movie nights every evening and video game marathons every weekend. Get some noise canceling headphones, find enough money to buy a house that doesn't share walls with other households, or shut the fuck up.", "As someone in an apartment in southeast USA, I also would have told her to F off. Colleges have libraries for finals week if you need silence. Also close your damn windows if you want silence.", "I have a set of tower speakers I haven't set up partly because I haven't been able to get a receiver/amp yet and partly because I live in an apartment. If this happened, my spiteful ass would be getting that receiver that weekend for \"hifi\" audio game night", "Lol, this is ridiculous, NTA by a mile.", "So, so many problems on Reddit could be so easily solved with the simple use of earplugs. The silicone ones are comfortable and leave you with a cool little sculpture of your ear canal.\n\nMaybe the neighbors criticizing  OP could chip in together to buy a pack for the entitled neighbor before her next exams.", "NTA. This isn't a reasonable request. She lives in an apartment. She can't expect people to limit their behavior in their own homes for *weeks* to suit her. If she is this easily distracted she should get earplugs or noise cancelling headphones. Better yet, she could study at the university library where it's reasonable to expect everyone to keep quiet.Your life doesn't stop because she has exams.", "Whaaaa?? Wow this is next level unhinged behavior!! The level of entitlement is strong in this one 🤦‍♀️🙄\nOP you’re NTA.\nI literally locked myself in my apartment for 1.5 months while I wrote my Master’s Thesis & this woman can’t be bothered to simply close her doors and windows 🤦‍♀️\nYou’re not responsible for her study habits of her exam results. If she wants peace and quiet, she can head to the Library .. Unbelievable!", "NTA. Has she ever heard of a thing called headphones?", "NTA. Sorry college girl, but other people are also paying rent to live there and can do as they please with their time and their own apartment. Of course under any circumstances, it is typically frowned upon to have a large, social, and LOUD gathering in an apartment unit; however, your get together with a few friends and having music playing at low volume is completely harmless. College girl needs to have a reality check and realize the world does not revolve around her. She can easily go to a nearby library, book store, coffee shop, or anywhere else that is considered a quiet, public gathering area to study. She also willingly had her windows/balcony door open. It sounds like she was looking for an excuse to complain.\n\nI lived in an older apartment complex (built most likely in the 50's) while in college where typical, everyday noise was heard easily throughout the units. They were also hardwood floors in all of the units, so that made it all the worse. I had many late nights of studying, online exams and classes, and even Zoom job interviews while living there with neighbors' babies crying, televisions turned up loud (an elderly couple lived below me), and other noise distractions. I never once complained or requested my neighbors to be quieter on my behalf. If you are truly focused and determined on what you are working on (at least for me), it is easy to drown out the background noise anyway.", "I understand her needing to study, but you live there too. If she needs absolute silence for an entire month she needs noise cancelling headphones, college housing, or she can go to the library. NTA", "NTA, part of living in an apartment is dealing with sound from your neighbors. You held a small gathering without playing music too loud which is very respectful to your neighbors and apartment community. If she’s needs dead silence to study she should go to the library.", "lol who died and made her King? If she wants silence and for people to not act like people there are hilltops faraway she can camp out on if necessary. Or she can do what most of us want when we need silence: get earplugs or noise cancelling headphones. She's being completely ridiculous and deserves to be called out as well for demanding other people obey her. NTA", "She has no right to demand this.  I would have played Led zeppelin all night, she's definitely an entitled a'hole", "No you're NTA, she's an idiot. Campuses have libraries. Hell towns and cities have libraries, she could've chosen any of those options other than inconveniencing all her neighbors.", "NTA", "NTA\n\n> she has her college exams coming up and she's studying so we better not have any parties until the end of May\n\nCramming is the biggest crock.\n\nYou're **supposed** to learn what you need to *during* the semester. *That's* what you're being tested on. If you didn't learn it then, you've already failed, and last-minute cramming is only cheating yourself.", "NTA. It’s nice to be empathetic but she expected you to stop using your home for a normal purpose. If you want to be petty you could put a response note back, or have friends over regularly, but otherwise I’d be direct and let her know you have no plans to stop your life because she needs to control everything.", "7 floor apartment building (or more) and she expects everyone to be perfectly quiet? What??", "NTA guess who’s just decided to PARTY Every day the rest of may? \n\nIgnore her entitled ass.", "NTA report her for harassment, see how stressful that is on her.", "nta. have a party with all your neighbors, this girl had lost her damn mind", "Nta. You pay rent as the student does. You can have people  over. It is outrageous that she expects the neighbors to kowtow to her demands of silence. There are noise canceling  headphones.", "She cannot dictate what you can and cannot do in your apartment. It’s shared living and if she has an issue with parties she can go study in a library or another place like a park. It’s not your place to cater to her needs because she has to study. As long as you guys aren’t disrupting anyone’s peace, which I highly doubt, then she needs to back off. NTA", "NTA. She can go to the library to study, or she can close her windows. I'd be bumping this up to a petty revenge story by having parties every day for the rest of the month.", "NTA now you should throw a rager to demonstrate difference in noise levels :) \n\nAlso let her know that if she wants to get in the zone and study maybe she should, idk, CLOSE THE FUCKING WINDOW", "NTA\n\nShe had an entire semester to prepare for exams.  She lives in an apartment. She can ask for nothing loud past quiet hours on a school night. She can't demand that no one in her building socialize in their own homes at any point for an entire month.", "NTA. In college? The library is free, she can go use it. Write that on her moronic notes - I mean imagine being so dumb you try to study with your windows and doors open then announce it on some ridiculous note. Who studies for 6 weeks straight? No amount of silence will help that moron pass.", "NTA \n\nWhy would ANY neighbor think that was reasonable?  Not so certain I wouldn’t put music on every evening after that.", "She’s gonna suffer really bad when she realizes that world doesn’t revolve around her. And that comes from a person that had to study for the residency exam while my neighbors were renovating. Her audacity is astonishing. I’m petty so I’d probably really throw a party. Post me where ever you want lady, the other neighbors can come too. NTA.", "NTA. She is the AH for deciding what entire apartment complex can and cannot do for over a month. She is delusional", "She should go to the fucking library then \n\nNTA", "NTA your neighbours sounds like an entitled nut bag", "NTA. Please tape a pair of earplugs to her note", "NTA - and the stressed out college girl should not have had her windows open or balcony door because that makes her apt an uncontrolled environment. honestly I am a petty bitch and would have thrown a rager that very night because no one can tell me what to do in my own home and she needs to learn a very valuable lesson her parents apparently did not get around to. the world does not revolve or stop for 1 person. life is stressful and you cannot expect others to coddle you. Time to grow up and put your big girl panties on college kid and deal with the messiness and stress of life.  Noise canceling head phones work wonders by the way maybe send her a link on amazon or print a pic out and and attach it to every one of her lil notes.", "Neighbour is an ass, since when is it your problem? They should go study elsewhere if they are distracted by people living their lives. Forget about it!", "NTA You we’re much nicer to her than I would’ve been. I would’ve laughed and closed the door in her face the first time she asked. If you want complete silence don’t live in an apartment. That’s why I saved and bought a house. \n\nI understand that not everyone is privileged enough to be able to afford a house, but in that case other people’s noise is the trade off for affordability. It sucks but that’s life. She can get noise cancelling headphones instead of expecting everyone to cater to her life choices.", "Start learning to tap dance.", "Does she pay your rent? NTA", "NTA. Leave a response note requesting that she pay a small portion of your rent so that she has the right to tell you what to do in your own home. You should also recommend noise canceling headphone as opposed to her attempting to control the actions of an entire apartment complex. You could also point out that next time you'd be within your rights to make even more noise.", "Okay at this point your neighbor is just being ridiculous you didn't do anything wrong OP 0/10 not the ahole", "NTA.  Why should you go to a bar when she can go to the library?   Also, if she wanted it quiet, why were her windows open?!  As long as someone isn't break the noise ordinances, everyone else just has to accept that if they live among people they will hear noises.", "Where on Earth is this even a thing?  You don’t get to tell a whole building to be quiet to suit you….", "NTA, she has absolutely no right to try and dictate what others can, and can’t do! Especially for weeks at a time!\n\nShe’s a tenant in the building, not the owner!\n\nUnless you were breaking some ordinance or HOA rule for the building/complex, she can take her passive aggressive notes and shove them! \n\nIf she honestly needs a quiet place to study, she should try her colleges library or at maybe look into some noise canceling headphones! Frankly, figuring out the best way for her to study is her problem, not yours or anyone else’s \n\nAnd her getting pissed at you for just living your life is some hypocritical/unhinged BS! Especially when she wasn’t even willing to make the minimal effort of closing the doors/windows to lessen the noise!\n\nHonestly, if that were me, that would be the last straw for me, trying to be considerate/nice to her.", "Woah. That neighbor suuuuuucks. You OP are NTA. They need a reality check of not being the main character. They could have done their studies elsewhere, played their own soothing music, maybe just getting off their high horse that there are other people in this world..and it doesn't revolve around them.\n\nJust because she has exams doesn't mean she can dictate others' lives for her own gain of peace and quiet to study. She has issues and problems. Harassing you the way she did is probably a nono in the lease agreement.\n\nHow petty do you want to get...?", "NTA. She could go to a library.", "NTA, I would literally fuck with her till she failed every single exam.", "NTA. You are allowed to have a life in the space you pay for. She has absolutely no right to complain about this (if it had been a rager that would have been different). If she's having such a hard time she can study at the library.", "NTA notify her of the existence of libraries.", "NTA. I would be having parties all the time just to piss her off. What an entitled brat. She can close her doors and windows. Better yet, go to the library or put on headphones.", "Yep I would have been that neighbor… my birthday my party. Invite the whole neighborhood and have a barbecue social. As long as it’s not breaking city ordinances for noise and not late into the night; I m good. Now I get exams are stressful… but silencing the neighborhood is ridiculous.", "What agreement? All I see is an unreasonable demand from the neighbor and an 'I'll try to keep it down' from OP, who did exactly what they said they would. If the neighbor needs it so bloody quiet, she should a) shut her damn windows and/or b) go to the library! If it was my birthday and I wanted to have a party, I'd have a party. Somebody's graduating? Bridal shower? Baby shower? Cinco de Mayo? Saturday in May, and it's nice out? Party time! Neighbor can go pound sand. She lives in a fricking apartment. There will be noise. There will be people playing music, watching TV, talking. Deal with it or move.", "NTA…what the what?!   I would put a note saying..when so and so starts paying my rent, they have a right to say what goes on in my own home. And I did warm so and so that I would be having a few friends over for my birthday, so why in the world would she have her windows and balcony door open if she did not want to be disturbed?  Has she never heard of noise canceling headphones?”", "The audacity is kinda hilarious\n\nBut unless she is paying full rent and utilities for everyone she asked to be quiet, she gets no say in what you can or can not do. \n\nThere often are rules like no loud noises after 11, so she can study in the night\nOr she can study at the library, it even comes with people to shush others for her.\n\nNTA", "[removed]", "[removed]", "NTA, but take that note to apartment management and tell them to protect you from further harassment. She may escalate.\n\nTake a picture of the note, and follow up with an email to management, so you have a trail.", "NTA. You pay rent…you have the right to live there as you see fit in accordance to your lease. If I were you, I would bring this up to management saying a tenant is telling you how to live in your own apartment. She needs to realize her studying and needing quiet is one of the reasons libraries exist.", "NTA. If she doesn’t pay your rent she doesn’t get a say in what you do in your own apartment. She can fuck right off with that entitled nonsense.", "If she was going to pay your rent then maybe she would have a say", "You are definitely an ahole", "It's unreasonable of her to demand anything of anyone in their own homes at any time for any length of time.\n\nTBH, I would make my own complain to the management about this woman trying to inflict her desires on the rest of the tenants.", "NTA. Sounds like your neighbor is an entitled brat that expects the world to revolve around her. Has she never heard of a library or headphones? smh", "NTA. There are libraries and study lounges for a reason. Also, ever hear of ear buds? Headphones? She would never have survived my state college. Parties going on 24 seven.\nEdit for spelling.", "Yeah she's pretty lucky people haven't actually retaliated.", "Your comment has been removed because it violates [Rule 1: Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_civility)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates [Rule 1: Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_civility)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Seems like she knows she is going to fail her exams and trying to manufacture an excuse(perhaps for parents)", "The hell are you paying rent and tuition for?? Tell her to rent a cabin for 6 weeks in the woods to get peace and quiet. \n\nCall her out by saying \"Dear neighbor in Z. I pay rent just like you do and have a right to use my PERSONAL SPACE as needed. Rent a hotel for 6 weeks if you need to study so deeply that I cannot enjoy the space I pay for. Y\"", "college senior going through finals here. i live in a building with two musicians who practice regularly which disrupts my studying, so i’ve been basically living at the library for a week. you know, that designated quiet study space provided by the institution I pay to attend. your neighbor sounds entitled as fuck for expecting her apartment complex to be her personal library rather than studying here with us plebes", "Contact your landlord. This goes beyond typical neighbor squabbles and crosses over into harassment.", "We just got a new TV and can't quite figure out how to correct the volume..... the theme songs and whatnot are SOOOO loud, but the voices are not.  I fiddled with it enough to get the voices and sound effects about the same (so I don't go deaf every time something explodes) but the damn intro music is still SO loud!  OP can borrow my TV 🤣", "Or noise-canceling headphones", "Seriously… I am typically a very accommodating person, but this request is beyond unreasonable. For one random night, sure hun, get your study on. For a month? Yeah, no. Libraries exist. Closing your godamn windows exists.\n\nI agree with the unhinged statement. The entitlement is outstanding, and the fact that a lot of neighbors agreed even more so.\n\nIf I were called out like this, I would simply leave my own note stating that I will abide by the lease agreements of quiet hours between 10pm-7am (or whatever the lease says). I would also note that there is a thing called a library. It is unreasonable to expect multiple people with differing life circumstances to abide to the “study hours” of ONE person, for weeks. Nope.\n\nThe more I read on this sub, the more I am angered by so much fucking entitlement lol", "I’m just imagining blasting Disturbed’s cover of The Sound of Silence on repeat.  Lol.", "A couple years ago a new couple moved onto our street. Less than a month in they put notices in everyone's mailboxes saying they were having a backyard wedding from 1- 5pm on X Saturday so people needed to refrain from parking on the street as they have many guests coming and that we be quiet during the span of the wedding and some people might need to use our lawns for parking. I don't know who did it, but at 130pm someone fired up their lawn mower. Then the gas powered hedge trimmer. Then the gas powered weed whacker. Then the leaf blower to clean up all the clippings or something. They were outside doing yard work the entire time the wedding took place. I love how petty they were.\n\nEdit time flies. This was prepandemic by at least a year so more like 4 or 5 years ago.", "If this girl really wanted peace, she would have shut her door and windows.", "Slasher movie marathons. Complete with LOTS of screaming.", "That was rather rude of them.\n\nWith the sole exception of expecting to use lawns as parking, hosting one party, one time, that's a once or twice in a lifetime event, at their own house and asking for relative quiet for 4 hours and for cars to be in the driveway if possible isn't an unreasonable ask at all.", "I’m sure that the library is too loud for her to concentrate too. Other people breathing and turning pages and whatnot.", "Why in the world is it a reasonable ask that people put their lives on hold because they decided not to pay for an actual wedding venue? If you have a wedding in the backyard of a house in a neighborhood, you have to deal with normal neighborhood sounds, which do include lawn work. If you have a wedding in a neighborhood, you have to expect that other people will be parked on the street - people who *live there* - and your guests might have to walk. Same as if you had a wedding in a downtown venue without parking or at a hotel with other guests. \n\nAnd the demands are especially unreasonable given that they were new to the neighborhood and hadn't had time to form relationships with the neighbors! People might be willing to accommodate someone they've known for a while and know this is an unusual request, but at less than a month into living there? For all the neighbors know, these people expect a big party to be accommodated every month!\n\nPlus, putting a notice in people's mailboxes that they need to do these things isn't asking. It's demanding. And even if it was the most reasonable request in the world, it becomes unreasonable when it's a demand rather than an ask.", "Most people don't tally up how much of a relationship they have with their neighbors before deciding if they're going to acquiesce to a very simple, benign, one time request. I have happily moved my car for a few hours for a neighbor's party (yes, I even had to walk! Oh woe is me) and I'd do it again so her kid could have space to play with his friends during his birthday.\n\nLife is too short to start beef in your community, like deliberately using every piece of loud gardening equipment you own during the hottest part of the day \"conveniently\" disrupting your neighbor's wedding and people who do that are petty, sour people who don't have anything better to do with their time. They're insecure, and trying to make a retaliatory statement about how \"important\" their time is.\n\nIt's rude and not funny. It's downright adversarial. They better hope they never need to borrow anything, a misdelivered parcel or need a favor from their neighbors because after that adversarial performance they're sure as hell not getting it.", "Sure, if my neighbor *asks* me to move my car, I probably will. If my neighbor drops a note in my mailbox telling me I have to move my car, that I have to be quiet for four hours in the middle of a weekend afternoon, and that they may have guests park on my lawn? I'm not the one who started the adversarial relationship. \n\nAnd while it's likely that the dude was responding to their adversarial opening with retaliation, we don't know that for sure. Maybe that was the only free time he had to do lawn work for a couple weeks. \n\nI can see how, to some people, these might seem like benign requests. And I might agree, *if they had been requests*. But they weren't. They were demands, and the couple who wanted the whole neighborhood to put life on hold for their wedding didn't even have the courtesy to talk to their neighbors and ask them these things.", "Wait a minute. She expects all her nearby neighbors to tailor their social lives around her study schedule? I don't think so. \n\nThere's a reason her school has ***a library*** for students to use. She can also use noise-canceling headphones instead of trying to control other people's day-to-day activities and their social lives. NTA.", ">On Saturday morning there was a note on the elevator once again, straight up naming me saying how \"Lady Y from the 7th floor and apartment number X broke the agreement and had a social gathering on Friday night completely disrespecting the stressful time I'm going through\n\nI would legitimately take a picture of the note and send it to whomever you're renting from, assuming you rent from some company and complain about harassment. OR post your own note in reply with a picture of noise cancelling headphones and a picture of a house for rent. If she needs silence she can feel free to purchase either one of these. Having noise id part of living in an apartment and despite what her parents clearly told her growing up, she's not a special princess around whom others will rotate. She doesn't get to dictate to an entire apartment complex how they live their lives for 6 weeks. \n\nI would play music at reasonable level every single night until whatever date she set, and then I'd be silent. This person is stupid entitled and needs a reality check - the world is not here to cater to her needs. Grow up.\n\nNTA", "NTA.. you pay rent just as she does. She can’t tell anyone what to do. The entitlement is soo strong,  but clearly her mind isn’t.", "She is literally provided a quiet place to study through her uni. It's called a library.", "NTA. She's acting like she still lives in a dorm and can go tattle to the Resident Advisor", "NTA, you were trying to be good and her demands are 100% unreasonable.  What would her argument be if you were just 3 people living in the apartment together all the time who liked to be able to actually laugh?\n\nAlso the passive aggressive notes used to manipulate the neighbours, what a skeevy move.", "NTA, she can go to the library or wear earplugs. She doesn't have any right to dictate other neighbors' social lives as long as they are being reasonable and not blasting music.  She called herself out with that note.", "NTA. You live in an apartment. There’s going to be noise. It’s unreasonable and unrealistic to assume that everyone has to walk on eggshells to accommodate her needs. I’d talk to the manager and notify the woman if she continues you’re going to file a restraining order.", "NTA, as a student myself, this is why libraries exist.", "NTA. The aucacity to expect that how many people mute their lives not for just one day, but one whole month? Does she really study 24/7? Why does she have to study that much?\n\nAnd what a horror to hear some 'laughs and discussions', because other people have a social life.\n\nI think, this is a wonderful example of the 'Main Character Syndrome'.", "NTA\n\nYour neighbor is wholly unhinged and entitled. She has no right to dictate what her neighbors do. As long as you are abiding by your apt lease rules then tell your neighbor to 1) shut her door & windows AND invest in a pair of noise canceling headphones OR 2) go to the library to study.\n\nI would write that up and stick in on every door of the building.", "NTA - no one gives a shit if you’re studying or not, if it bothers you that much, buy some Noise Cancelling Headphones. But if you’re having such a hard time that the entire world needs to tip toe around you, you have bigger issues then loud decibels.", "NTA.\n\nI'm sure whoever is running the apartment building would love to know that one of their residents is giving out names and apartment numbers on full display. It doesn't sound like a violation of anything at all /s\n\nNext time, ramp up the party. Hell, id throw one out on the lawn and blade the music right up at her. Better yet, take up learning the drums.", "NTA.  If a neighbor is being loud she ought to just go by that one neighbor and say hey do you mind being more quiet I'm studying for a exam thank you or something as needed.  But for her to just go to every single person and say do not have a social gathering for several weeks and calling it an \"agreement\" is pretty ridiculous.  She lives in an apartment, not a house.  She sounds incredibly entitled.", "NTA. She can go to the library and study", "NTA\n\nI’d make sure to have friends over or music/TV on constantly for the next 6 weeks. It was fine for her to make a reasonable request, such as turning down music, but it’s not okay for her to expect every single resident to be quiet as a mouse for 6 weeks.", "You're the victim of harassment. Show the flyer to the cops and the apartment management. NTA", "NTA the entitlement to think that everyone in a building should curb their plans because she has to study!!! What is happening to people?!", "NTA\n\nTime to throw a real party, I don’t think she understands the difference.", "Nta Report her to management of the complex and send her a cease and desist from all contact over her grand delusions.  Then hold another Friday night gathering with friends", "NTA wow…the entitlement is strong with that one. There are college/uni libraries for just such a purpose. It’s funny she claims you violated the “agreement”. It sounds like you did exactly what you said you would, and were reasonable in your noise level. Which was kind. She has no right to ban gatherings/parties in other people’s apartments, tho nothing wrong with asking. You also didn’t have to agree to anything in particular. Requiring many people to adjust their lives for her comfort is pretty over the top and her note completely violates your privacy. I’d take it up with your landlord for your protection.", "NTA if noise bothers her she can get noise cancelling headphones.", "NTA - she needs to take her ass to a library; not request everyone else in the building conform to her needs for a month.", "Nta- I’d retaliate by blasting metal music mixed with the sounds of screaming babies through the rest of May", "NTA. You have the right to have gatherings at your place. She is being really rigid and unreasonable. \n\nIf you wanted, you and the other person called out should consider talking to the landlord/management company about her ridiculous demands so they are aware she is causing issues.", "I guess you should have your friends over as many nights as you can tolerate.", "NTA. Hi college girl, welcome to sharing the world with other people. As long as your fellow apartment dwellers are not breaking the building's noise bylaws, you have no expectation of silence. Shut your windows and doors, and put on some noise cancelling headphones, if other people living their lives bothers you that much. Your exams are a you problem, and one not shared by the rest of the world.", "I think this belongs on r/EntitledPeople\n\nNTA", "YTA. You should have gone to a restaurant or a bar instead of having a gathering at your house.", "NTA - she can’t control what other people do in their own homes. And it’s not like you had a raging party with the bass going… she could have put on noise cancelling headphones on to study if such low noises were going to bother her", "NTA\n\nYou live there and have rights to have guests, her request is unreasonable. You pay rent and can dictate how you spent your time and with who in your place.", "I also can’t believe anyone would think her demand was reasonable at all.", "NTA. I have a masters degree in STEM. That’s what libraries are for. She’s ridiculous.", "NTA - why tf did she have her windows and balcony open while trying to keep it quiet?!?! It sounds like she was *asking* for someone to disturb her. Tell her you have just as much of a right to have people over at your place as she does to study. Sounds like a terrible resident to live with", "NTA, the second group of neighbors are very, *very* stupid. The **Student** can go study for exams at the **quiet library specifically designed to maintain a quiet atmosphere specifically for students to specifically study in a specially quiet atmosphere**. There is no need for you to have gone anywhere. There was a clear need for the student to go somewhere. \n\nYour whole building was entirely too sympathetic for her in the first place. “You better not be loud” is an asinine way to make a request that she could choose any number of places for a quiet get away, including but not limited to: aforementioned school library, public library, coffee shop, a different coffee shop, yet another different coffee shop - ad nauseam, a tea house, a book store, a park, the forest, her car, a friends house, she could have used noise cancelling headphones - or perhaps borrowed a pair from the library.\n\nYou were more than reasonable, and I would say you were NTA even if you invited the maximum number of guests permissible under your lease and threw a normal birthday party with loud singing and merriment ringing through the halls.\n\nDemanding dead silence in communal living is the most self-absorbed thing I’ve ever heard, and not even for 1 afternoon, but for *the rest of May*??\n\nIf she needs 20 days to study for exams, she’s going to fail either way. You are not the asshole. She is. And the neighbors who support her are beyond stupid for suggesting you take 3 people to a restaurant instead. She should just go to the library.", "NTA but I'd take pics of the notes and send them to the management company. That's entitled and ridiculous.", "I wish I had the ability to accumulate this much audacity within myself 😵‍💫 this girl is crazy!! I'd leave a note in reply saying eff off go move to the middle of the woods if you want total silence. (Except she'd probably try to leave passive aggressive notes for the birds and the crickets)", "NTA Does she pay your rent? Did you break any noise ordinances? Did you sign a contract to 'not party'? Then tough. You can't put your life on hold for over an entire month to placate a whiner. She sounds like she needs a party to let off some steam.", "NTA. There is multiple way around this \"problem\" : ear plugs, headphones, go to the library...", "NTA - She sounds really unhinged, like my looney neighbor that makes all kinds of notes like this and everyone ignores him.", "LMAO so these people live somewhere that has no children in the whole apartment building!!!!????? \n\nThe dude in the condo above me has one, single toddler and GOOD GOD it sounds like a herd of elephants multiple times a day. That’s show biz, kid.\n\nNTA, OP!", "I myself would be fighting the urge to throw a rager after being put on blast for audible laughter…", "NTA. When I was in college my roommate was incredibly loud. During exams I mainly stayed at the library so I could concentrate and study. You can't make everyone accommodate your exam schedule. OP, if she has another exam, open all of your windows and blast Rocky Top on repeat for a few hours. That will do the trick!", "Yeah I howled at 'agreement'. She's in college and doesn't understand what an agreement is.\n\nGah wonder what her major is?", "And got herself some earplugs", "/u/Advanced_Scene9528\n\nPlease just start writing #IAmthemaincharacter on all her notes 🤣🤣", "I chime in, haven't you people ever heard of closing the goddamn door...", "How? She’s entitled to use her private space how she wants.", "Or go to a library!", "So, feel free to report her to the landlord. Send them pictures of the notes if you've got them. She is harassing you and that is not okay. Get the paper trail started now because you are going to need it.\n\nAnd NTA.", "Imagine a car with a running engine down the street.\n\nNTA. Shes delusional", "NTA, tell your friend to go ham on that party and not invite that girl if she shows up saying something along the lines of \"you owe me\" or something. Make up bday party.", "Basically every college has extended library hours during finals week. I'm in college myself and this woman sounds unhinged and delusional. Earbuds with speech masking white noise. Closing your windows. Going somewhere else. She has limited herself to the one option that requires everyone in the building falling in line with her asinine demands without even trying anything else.", "This is what I did. Lived in the party flat (legit had several other flats come to my flat (of 7) to party. I’d just go to the library. Couldn’t focus in my room anyway.", "Can you imagine if this twit lived in a dorm and the reaction she'd get from fellow students?", "Absolutely do really do this!\n\nCollege student clearly missed the class that says she's not the center of the universe", "Honestly, the petty part of me would have just written 'prepare for war' on her note and either had an actual party or just played music and conversation sounds every Saturday night going forward.  \n\nHow do people who live in the building with several roommates escape her? OP basically just described 4 roommates relaxing at home on a weekend and she tried to publicly scold them like an over dramatisation of a mean school teacher.", "Blast Rocky Top on repeat for hours. That should do the trick!", "I had a pair of construction headphones that worked well.", "Lol maybe that's why she's not in the dorms now!", "Probably unnecessary to ask in a student dorm since (assuming by exams they mean finals) everyone has finals during the same week or 2 window that the vast majority are following the golden rule even if they happen to finish early.\n\nAlthough they also wouldn't be asking for silence for 6 weeks. What kind of exam(s) are they spending 6 weeks of dedicated time to study for? The Bar is the only one I can think of off-hand. But, maybe there are other specialized exams or different country?", "\"Might need to use your lawn for parking\"? In the same way that you might need to use the local tow company for towing?", "Would you kind sharing the brand? The variety of noise canceling products is overwhelming for me.", "Pretty much any profession that requires specialized licensing has a pretty rigorous licensing exam. Architecture, real estate sales, zoology, any sort of legal or medical professionals of course... even trades like plumbing or electricians.", "OMG. I had to sell my floor standing speakers when I moved into my condo, because they would have literally taken the roof off.", "I don't remember the brand, but I bought them at Lowe's.", "3M has great options for noise cancelling! Use em at the gun range and doing outdoor chores (mowing the lawn, pressure washing etc)", "NTA, if a neighbor tried to pull that shit on me, I would’ve been AH and had an absolute rager the next night.", "That’s…… not how it works. NTA", "NTA this girl needs earplugs and a total reality check. She needs to figure out how to live in the world she’s in rather than trying to make it revolve around her. You did nothing wrong, her behavior all around is completely selfish & appalling!!", "NTA. While it’s reasonable to ask for silence the night before an exam, you cannot ask for total silence for 6 weeks. If she really needs a quiet place to study, she can go to a library.", "Nta she can go to the library time to throw a rager", "NTA. If she wanted a perfectly silent study space, she could've booked a room at her local library. They usually don't cost, can be booked for hours, and are SILENT. Don't ruin everyone's weekends in an entire building just for your entitlement.\n\nAlso I hope you print this out for her to passive aggressively find in the elevator!!", "I guess I would be the AH because if someone came to me demanding I could not have a party on my birthday I would have basically thrown a rave. Lol, who am I kidding, i would have done it even if it wasn't my birthday.", "NTA\n\nI hope to god she isn't studying to be a doctor or social worker or any other profession that requires trust from the public.", "Who the fuck does she think she is? The whole apartment complex is supposed to put their entire lives in hold so she can study? I woulda had a party every night if someone came at me with that attitude. If she wants quiet she can go to the library.", "A gathering… three people is a gathering.. NTA. You didn’t have a party, you didn’t break any rules, and true, she’s going through a stressful time, but she has no right to try and control strangers.", "NTA. You live in an apartment building. I’d have told her to go to the fucking library if she wanted quiet", "So this collage student moved into an apartment complex and expects all of her neighbors to be silent for her? Nope, nope, NTA. Her entitlement reeks!", "NTA.\n\n>I had my windows and my balcony door open\n\nI am surprised that the sounds from cars or birds or whatever didn't disturb her peace then. She should get noise cancelling headphones if she wants absolute quite and of course shut her windows and balcony door. \n\n>broke the agreement \n\nThere was no agreement in the first place. She made an unreasonable demand she has no right to. I would go to your landlord and complain about her behavior.", "NTA. My wife is in college studying for finals. If the kids are too loud or she really needs to focus she puts on her noise canceling headphones. To try and force a whole apartment building to be quiet so you can study is ridiculous. She isn't the only one to be there. What if you had roommates. Are you just supposed to text each other instead of talk?", "NTA  \"I had my windows and my balcony door open\" suggests her request be disregarded. I would keep a copy of her elevator note.", "NTA by a mile. \n\nThe entitlement here is absolutely astounding. Honestly, I would have posted a reply notice: \"this is an apartment building, not your personal palace. You do not have the right to tell people what to do in their own homes. Out of sympathy for your situation, I only had three friends over for a tame evening on my birthday. But now due to your entitlement, I will accord you the same lack of courtesy you have given me.\"\n\nIf you don't have enough friends to throw parties nightly, I would freaking YouTube clips of the loudest parties and orgies I could, and just leave them on loud until midnight each night.", "NTA \nYou’re allowed to entertain; you especially respectfully as you did.  She has zero right to make  her priorities anyone else’s.   She’s in for a lifetime of disappointment when she learns the world doesn’t revolve around her.  She could have chosen to study elsewhere,  especially when you informed her in advance.  She could have shut her windows.  She also needs to learn to manage noise,  and other interruptions while she’s studying .  Or she’s going to fail in her future endeavors.  I’d call her right back out;  leave a note sharing she had advance notice and her priorities aren’t anyone else’s but hers.\n\nEdit:  better yet just print this out with the comments and put it under the door and wherever she left her call out notes.", "As someone who grew up in an apartment building and has studied for a hell of a lot of finals in one, this is straight up unhinged. When I was studying for the biggest exam of my career I mentioned it to my next door neighbor because they'd gone away for the weekend and their dog was barking 24/7, and felt like I was being unreasonable. Going door to door is ridiculous, asking people to be hermits for **a month** because she has the same exams as every other college student is absolutely beyond, and calling you out BECAUSE SHE HAD HER WINDOW OPEN AND HEARD SOMEONE CHUCKLE is psychotic behavior. 0% the asshole and I'd be contacting my management company/landlord/any and every higher power to flag that this girl has absolutely no idea what apartment living entails and doesn't know how to function on any level.", "Asking 3 floors of an apartment building to refrain from social gatherings for a month is completely and utterly laughable… her making that request is a total clown move... NTA.\n\nTell her to invest in some noise canceling headphones if the local monastery is full - there’s no other multi-family dwelling that will be as quiet as she seems to need.", "NTA and call her out for her one sided agreement. I’d make a point to say she thinks the world revolves around her.", "NTA. People living in apartments should  always be considerate of their neighbours, but they are allowed to live their lives while trying to make a minimum of noise. You can't expect a neighbour not to entertain, play quiet music, or watch television because you are studying. \n\nIt is a good thing this girl doesn't live in a college dorm.", "NTA. I’d have caught several charges.", "Lol, NTA\n\nDid she just admit to leaving her windows and balcony door open!? So maybe if she just closed them she would have been fine?", "What??? That is so awkward. I remember a night during finals in college when I yelled to some other college kids who were using shopping karts to sled down an icy hill outside my apartment to be quieter. They were screaming and chilled out when I asked. But it was one night and they were extremely loud!", "NTA her request was unreasonable and she thought calling you out with a note was going to do something. I would of left a note and said you were told and no one owes you anything. Many tried to be empathic but you decided to act like a child and get treated like one.", "NTA. She’s a college student, she couldn’t go to her college library to study?", "Tell her to not harass you. Neighbor harassment is a somewhat broad category of behavior that is usually defined based on two factors: the intent of the person doing the harassing, and the effects of that behavior on others. \n\nThe intent is clear, she will publicly call out people by name along with their apt number. The effect is to have neighbors discuss your personal life and this could lead to you being ostracized. The rub is that she states you broke your agreement. You told her you agree, except for your birthday and described what ended up happening. Since she misrepresented what happened she is beyond free speech and she is committing libel. \n\nYou should approach her and let her know what she is doing will not be tolerated and if she continues you would feel harassed. Let her know everything will be documented and if necessary you will report her to your landlord and file for injunction relief.", "NTA. Tape a pack of ear plugs on her door. She can't expect the whole world to stop just for her convenience.", "NTA\n\nUsing her logic, I could tell my whole building right now to be quiet during the day because I work night shifts. Even to me that is unreasonable.", "during undergrad I had neighbors that would have 30+ person parties in their tiny apartment that overflowed into the hallway and lasted until 4 am on WEEKNIGHTS. that's what I imagined when I read the title of your post. I'd love to see your neighbor deal with that, jeez. obviously you're NTA", "I’m on your side as long as it was dead quiet by 10pm.", "NTA, just not the smartest. If all you were having was a quiet gathering you had no reason to think would disturb her then telling her just served to get her back up. I'd keep a record of the whole thing, especially the notes, in case she decides to take it to the landlord- they *probably* won't care, but might decide to if she kicks up a big enough fuss.", "NTA\n\nI get wanting a quiet environment to study but part of the deal with living in an apartment is that you can’t control the noise level. And it wasn’t for one night. It was for weeks. She can go to a library if she needs silence.", "NTA I’m sure her college has a library. She’s very entitled to think she can demand you don’t have a social life for 6 weeks.", "Does she not know what a library is for? Or noise canceling headphones? \n\nShe doesn’t pay rent on the entire building - she has no say over what you do in your apartment \nAs long as you aren’t breaking rules of your lease she needs to handle herself in her own space and leave everyone else alone!", "No no no no. She needs to go to student union or a library to study. NOT demand neighbors doing whatever the HELL they want IN Their OWN SPACE not do normal activities. Take those notes to the landlord and call her out. She is being way too entitled and unreasonable.\n\nNTA", "OP, I suggest you leave the following note:\n\n“Dear College Student - you are not special. I pay the same rent as everyone else and will live my life as I see fit. The only person being shamed here is you, by yourself. But some ear plugs and stop making your problems everyone else’s. Good luck on those tests!”", "NTA. There are these amazing places called “libraries” where one can now go to study…", "NTA. This chick lost all her social skills", "NTA. The audacity to ask anyone to be quiet for her ‘Stressful time’! And the sense of entitlement to strangers.", "NTA and you should leave a note in the elevator that says \"I chime in with a 'haven't you people ever heard of closing your goddamn windows'\" or just blast that song on repeat tonight", "NTA. Has she ever heard of a library?", "YTA They had an exam. You had a party. Plain and simple.", "NTA. Sounds like she needs to meet slurm McKenzie", "Don't worry about the signs. She's calling herself out as an AH.\n\nYou just have to roll with it all when you're in college and studying. It's up to you to find a sufficiently quiet place to study.\n\nI'm petty and would be tempted to put up a board of people in the building to see how many could get on her list, like a bingo game lol", "NTA I just had my finals, and I have 2 kids to take care of while I'm studying. If she can't handle having neighbors go to the library or close your windows...", "Bro fuck her does she own the whole apartment? So no she can't tell u what to do I would purposely be loud just for her thinking that she owns the whole building", "NTA\n\nThe “agreement”.  \n\nShe opened her door and could hear people talking.  Somebody call a whaaaambulance.", "NTA\n\nThis is what we (used to) have libraries for. Their college likely has ample places to study. You’re not beholden to their school schedule.\n\nLMFAO, this kid unilaterally telling everyone they better be quiet or else does not constitute an “agreement.” I hope they aren’t studying law.\n\nBecause they had their balcony and window open? Well that would be opening the apartment to public space. They brought that one themselves.", "NTA \nI’m always curious about how people like this will cope after school. Do they all find jobs where everyone around will be totally silent whenever they need to focus on something?", "I'd sew scarlet Ds (for Disruptive) on all my clothes and parade around the apartment building.", "seriously, if she’s demanding and threatening in a public summons she should take some steps to be proactive. headphones, closed doors and windows. \n\npersonally i’d find that i suddenly needed to play a hour long playlist to prepare for work during the month of may. \n\nshe already called you out for nothing. might as well have fun being the villain in her story.", "Also, one person's request doesn't constitute an agreement. This was merely a request What if there was an infant in the apartment next to her? Would she demand that the family needed to move out for a month during finals?\n\nNTA", "Yeah. Report her harassment to management. Include photos of the notes. You did not break any noise rules and were actually quite considerate. She is bonkers.", "Not to mention all the time she likely wasted working herself up into a rage over-- gasp-- conversational tones!", "Why? It's her apartment and she was quiet at least according to the post. It's unreasonable to be told in a space you pay for that you can't do anything that makes noise for an entire month. The neighbor is entitled to think the whole building should be on pins and needles so she can study. Are roommates not supposed to talk to each other either in case she might hear them? No TV or music in case she is deep in study? Neighbor can get some headphones.", "And if you were my neighbor I'd be buying you a nice new speaker or fun little drumkit. Anyone saying Y T A in your building is just trying to avoid her line of fire", "Edit: NTA! Whoops 😅", "This neighbor is going to be shocked to learn that the world doesn’t revolve around them and their schedule. Feel free to ignore this neighbor and if they confront you again tell them you can’t fulfill their delusional requests", "INFO: Where does she get off acting so entitled? Also, why are so many people in your apartment being doormats to this girl's unreasonable demands? You all live here too, and you have the right to enjoy your own home at a reasonable noise level.", "How dare you suggest the main character do something so inconvenient.", "There are libraries on college campuses open late during exam season for this reason. NTA", "She is not the only person out there who does not truly understand what that means.", "I would be passive aggressive petty and post a list of places that are suitable for studying that are quiet if people find normal apartment living to be that unsettling that they are unable to concentrate. Also, make suggestions on things that can help if the low volume noise of people living is bothersome such as noise cancelling headphones. Make it as public as her notice. If it continued to escalate, I would invite all the neighbors to a block party during the day.", "This is what I would do as well. She has no right to demand silence from everyone in the building.", "No, it's much better to face these kinds of things with a sense of poise and rationality!", "If they were normal people living in a city or a town, yes. But this is a student place. Only students live there. Was the requesting silence one entitled? Yes, she was. But the birthday girl could have gone to celebrate somwhere else. It was not like a \"forever\" request. It was finals about. Or course birthday girl has right to do stuff in her space, but could have helped too. It was just one night. Just my opinion.", "> I'm gobsmacked that ANY neighbors actually agreed with her and called you out.\n\nI'm not. Any random group of ten or more people is bound to have a couple deranged idiot.", "I always had music playing but I never actually listened to the music, because that was what kept me from getting distracted by random noises strangers would make.", "🤣 thas an UNDERSTATEMENT!", "I think they should take up tap dancing", "Well, in fact\nWell, I'll look at it this way....", "No where does it say this is student housing just that a student lives in their apartment building. It's common for people to not live on campus after the first year. I'd get it if she threw a rager but a couple friends, low music, and talking at a decent level is not anymore disturbing than a TV on or talking with roommates.", "At my old uni, students had 24hr access to library and a computer block with lots of sofas and a shower block during the term and then during the holidays you could organise after hours access to the areas (homelessness was a real issue among students) and even then things were unlocked from 6am to 12am.", "Hell, Mondays need lightening up with a rager as well!", "As I said, just my opinion.", ">need to use our lawns for parking\n\nI mean that one went way too far. I wouldn't want my lawn harmed by cars either. \n\nAll the other demands might have worked if they asked very politely and personally and invited everyone at the same time to a barbecue party a month later as a thank you, so practically bribing them with a later party with food and beer.", "That's fucking fantastic", "Wow! At first I thought that the couple was being pretty considerate giving their neighbors a heads up about the wedding and traffic problems. But being told to shut up and let people park all over your property…? I wonder how they liked their new neighbor Petty Crocker’s “wedding gift”?", "I have the 3M Work Tunes connect. I love them. I used to have Bose and bunch of other fancy ones, but these are awesome for $40. They do a better job blocking the sound than any of the white-noise based headphones I’ve tried. The battery lasts a while. And I like that if I really really need to canceling noise, I can wear in-ear plugs under them (and crank the volume a smidge to hear the music). I do this primarily when I’m doing construction and using a saw or something loud. \n\nSound quality is fine. I’m a bit of an audiophile, and  I love that these are cheap, have great isolation, and sound fine. \n\nThey aren’t the most comfortable for long term use, though. The tips of my ears get a bit smushed, which can get annoying after 5+ hours (eg, plane flight).", "Was about to post the same thing, park on my lawn and when you leave you’ll be taking a taxi to the impound.", "It is adversarial. But that’s because the “request” was adversarial. Majority of people will react better to a neighbour coming by saying “hey I’m having a wedding Sunday in my backyard and we’re crossing our fingers it won’t rain and that the city noises won’t be too loud” versus a (new!) neighbour sending mail saying “don’t make noise Sunday because it’s my wedding in my backyard”Catch more flies with honey and all that…", "It doesn’t matter what anyone else thinks. Your home- do what you want. You were not disrespectful. If she was so desperate for silence why did she leave her windows and door open? I think I would be going over there and telling her face to face if she ever thinks about pulling that crap again guess who will be called out by name.", "NTA. It wasn’t a party and it was a Friday. When I was in grad school I literally lived next door to an a cappella group and we agreed that certain nights would be quiet, but certainly not Fridays or Saturdays and definitely not for over a month. Write her a note back and tell her to get some headphones.", "NTA \n\nShe doesn’t own the whole building and it is unreasonable to expect absolute silence for weeks.  Was she willing to pay for a party venue for you?", "Call me out for having friends over at a place I pay for. Then petty petty me, windows and balcony door open and loud rock music playing for the entire day.", "NTA. College libraries exist for a reason. This is one of them.", "NTA, the college student sounds very entitled to believe that neighbors shouldn’t be living their normal lives because she has something important going on. Also, why doesn’t the neighbor use headphones?", "NTA. Put up notes in the same spots that she did and write, \"Entitled College Student needs to learn that other residents have the right to enjoy THEIR lives in the homes that they pay for! Life doesn't end for others just because you have stressful times. Please be smart enough to buy yourself some noise isolating earbuds or earphones and close your windows and balcony door next time!!\"", "NTA- I could understand asking for quiet the night before a big exam, but demanding people throughout the building not live their normal lives for weeks is ridiculous.", "NTA\n\nIt's her job to manage the stress that accompanies her own life choices", "NTA honestly I would be taking pictures of everything and complaining to your land lord. It is inappropriate to ask other tenants to modify their lives for a week to accommodate someone with non-quiet hours expectations.", "NTA. was it an agreement or just a decree? also expecting a whole 2 floors of apartments to agree to HER demands is crazy.", "NTA. College student should find somewhere else to study rather than harass and shame an entire building of neighbours. The audacity is unreal.", "I’d write a note back that just says, “try closing the doors and windows and use these.” Attach a pack of cheap earplugs.\n\nNTA", ">other neighbors believe I was an AH\n\nThey are out of their freaking minds. \n\nThat cow named you? You need to put her in her place.", "NTA", "So on Cinco de Mayo you're not supposed to have any gatherings.  She's a pill.", "NTA.\n\nTime to have loud wild parties until the semester is over. She sucks and is unreasonable. Libraries are open during exams so she can study there if she has a big issue. In fact, why don't you post the library hours on a helpful notes all over your building?", "Man, I'd have been showing her what the only enforceable quite hours were for the rest of the month and any other period she deemed difficult after that til she moved tf out.\n\nNTA", "It’s not a dorm! NTA", "Oh NTA. If I were you now, I would be playing music all day long (until 10 pm quiet time, or whatever the time limit is for your complex). She cannot control the entire building and what activities you are doing in your own apartment. She can study at a library, park, coffee shop. Hell, she can study at SCHOOL. Ridiculous. Life is not going to treat her well if she acts like this wherever she goes", "NTA, if she can’t put on headphones she can close the windows and door to study, airflow be damned.\n\nIf this were me I’d be playing the same plausibly deniable low music that most people could fall asleep to but would torture this person.", "I'm petty, so I'd scan the original note and bring in some responses...\n\n\"Lady Y from the 7th floor and apartment number X broke the agreement\"\n\n* Stop right there. We never had an agreement. I said that I would be respectful, but that I would be having people over for my birthday on Friday.  \n\n\"and had a social gathering on Friday night completely disrespecting the stressful time I'm going through.\"\n\n* I had three people over to celebrate my birthday in my home that I pay for. While I understand that this time is stressful for you, I have no obligation to stop my life just because you have exams. Life is stressful for all of us, not just you. Wanting to enjoy my birthday (or someone else wanting to have a dinner party or whatever) should not have to be delayed for one whole month because one person is stressed out. \n\n\"She said she's be discreet but this is not enough. I could still hear some laughs and discussions because I had my windows and my balcony door open and disrupt my peace and focus.\"\n\n* Lesson learned for you, I guess? Close your windows and balcony doors if you are trying to have peace and focus. ~~But~~ Buy a white noise machine? Life doesn't stop for everyone else just because you have something going on too. Also, oh my goodness you heard some laughs and discussions. Sounds like I had QUITE a party. 🤦‍♀️\n\n\"Let this be a lesson the next time someone decides to disrespect stressful times like this. You will be called out.\"\n\n* Back at you. There are lots of other apartments in this building. You are NOT the main character in everyone else's life, much less in this building. I didn't invite the neighborhood and party hard until dawn pumping out bass that shakes the walls. My level of noise was respectful. You want perfect quiet, go live in a library. Heads up, you'll still hear people talking there, too.\n\nNTA", "NTA that's fucking insane.Tell her to buy noise canceling headphones, or to move. You have the right to live in your own home, and she's creating a hostile and controlling environment in the building. I'd report it to the landlord.\n\nI'm a petty bitch though and tbh I'd retaliate and play music all evening until your local by laws say you must refrain.", "NTA. A big part of becoming an adult is realizing the world around you doesn’t cater to you and you can’t control people. She’s about to have a rough time if she doesn’t figure that out soon. Yikes.", "NTA. That's why they make study rooms in the school libraries....", "My reaction would have been, \"Bitch, please!!! Get bent.\"\n\n\"Lady Y... broke the agreement\" is laughable. What agreement? Did she offer to pay you and all the other neighbors $$$ is exchange for her intrusion into your lives?\n\nYou have every right to go about your business and do whatever you like as long as you don't disturb the peace or violate any local ordinances. You are under zero obligation to put your social life on hold for weeks to accommodate your neighbor's insane request.\n\nIf I were you, I would turn the stereo up and enjoy some tunes all day, every day. \n\nHer leaving her windows open and complaining that she heard laughter is the craziest part. As your neighbor said, if she wants it quieter, she can close her windows. But I really don't think that goes nearly far enough. If she wants peace and quiet, she can head to a library or a hotel. Her wanting to be surrounded by silence is her problem, not yours.\n\nAnyone who tells you her demands are reasonable is wrong.", "NTA. Reply to the note with “Lady Y pays rent just like you do”", "NTA. Reply to the note with “Lady Y pays rent just like you do”", "NTA but the student expecting the whole building to be quiet so she can study is outrageous. Talk about entitled!!!!  Her request is beyond out of line. \n\nThis girl needs to go to the library or somewhere else. You or others in the building have no obligation to accommodate her demand. Btw, an agreement takes more than one person making up rules. There was no agreement.  \n\nShe's out of her mind if she thinks this is how the world works.", "NTA. I would definitely make sure to have loud parties every weekend after that crazy behavior.", "NTA. You shouldn't have door shaking parties at any time, or moderately loud parties after a reasonable quiet hour (often explicitly defined by building policy / lease), or parties every single day, but if you don't violate those guidelines, she can go fly a kite.\n\n&#x200B;\n\nYou are entitled to reasonable socialization while in a multi-unit building.\n\n&#x200B;\n\nAlso, her asking for 24 hours might be reasonable, but a whole month? Get the fuck out of here.", "I would have blasted music. Daily once that note was posted. You weren’t unreasonable and were compassionate to her.", "does she think she’s the landlord or something", "NTA. You were better than what I had during college exams. You pay rent, respect quiet hours, and you have a cool day to have a birthday. \n\n\nThis girl can pass all the exams she wants, but she won’t get a job and keep it very long acting like this.", "NTA. \nFuck that lady. Straight up. It’s your birthday. And Friday night? Does she have an exam Saturday morning? \n\nYou pay the same amount as her to live there, if not more. She’s not your landlord.", "NTA. Maybe college student should go to the library to study? Or invest in some noise cancelling headphones.\nHonestly the audacity here is remarkable", "That’s what they have school libraries for that actually have extended hours during the time of the year when exams take place. 100% NTA", "As a recent college grad, dorms will have quiet hours around exams (often that start at around 11). People that have a few friends over and play quiet music are NOT in violation of those quiet hours. These hours also only start a week before exams. She's literally trying to hold an apartment complex full of non-college adults to a stricter standard than college dorms. \nNTA", "NTA. had this been my neighbor i purposefully would’ve thrown a huge party.", "Nta this just might be the most ridiculous thing I’ve ever heard… The entitlement!", "NTA. You gave her advance warning and told her what to expect. She can go to α library for one night- or study with a friend in the same class.\n\nApartment living is noisy. She cannot impose her quiet hours on the rest of the building for a whole month. That’s totally unreasonable.", "NTA they have these places called libraries where you study in quiet. Maybe you could suggest it to your neighbor", "“You’d better not have any parties and you’d better be quiet.”\n\nSorry, child, but you aren’t not OP’s parent, OP isn’t renting a room from you and nobody in your apartment building entered into any sort of agreement with you.\n\nYou don’t hold any authority over anyone else in the building and they aren’t beholden to you or your demands.\n\nOP and the rest of your neighbors are well within their rights to tell you to piss all the way off.\n\nNTA, OP…your patience with this level of entitlement is far and away greater than mine would be.\n\nEdit: fixed some typos", "NTA.", "Apparently she's never lived in dorms during finals lol. People would be shouting and hollering outside and throughout the halls all night after parties. NTA", "NTA this kid isn't interested in studying she is interested in creating drama and being a centre of attention. If she has time to stick notes and call out people then she has zero interest in studies per se.", "Fuck her.\n\nNTA. \n\nShe needs to learn that she isnt the center of the universe Nd nobody besides her and her parents care about her studies.", "NTA. Was her exam th next day? Lol what a loser", "NTA\n\nPeople go through stressful events all the time.  That doesn’t give them the right to interfere with  fellow tenets rights to the enjoyment of their homes.  You did nothing wrong and were very kind to give her a heads up so she could plan accordingly (which she failed to do).", "Can this be true? How do you expect to silence an entire development that you do not own?", "NTA. She really could have went to the library, OR buy noise-cancelling headphones.", "NTA... You gave her the time and date that you would be having friends over, so if she knew that this would desturb her she could have gone to a library or a friend or familys house with a quiet room.", "You need to throw a rager. She doesn't get to unilaterally decide that other people in the building cannot live their lives. NTA.", "NTA \n\nhow entitled can a person be?? And the neighbors that said you should have gone to a restaurant like… why do you PAY to have a place of your own if you can’t have a lowkey night at home with a couple friends? Her behavior and this whole situation is insane lol.", "NTA when I was in university I practically lived in the 24-hour areas when I had a ton of work to do. I never expected my neighbours to accommodate me. Their life didn’t stop just because mine went into temporary chaos. She won’t even close her windows/doors to help herself. Also, to the people who expected you to have gone out, tell them you appreciate them footing the bill for any future gatherings :)", "NTA. She is overstepping her boundaries.  Every university has a library that is designed to study in. This behavior is from learned entitlement.  She thinks she is entitled to run everyone life on the street because she has to study. Tape up the location of a store that sells noice canceled headphones on the door", "NTA- Jesus H. Christ she needs some help. She can't seriously demand an ENTIRE apartment complex to be ABSOLUTELY SILENT for an entire month. How neurotic. She needs to invest in some sound proof headphones and move into the library like everybody else.", "NTA. You didn’t have a rager, but frankly, even if you did, you’re well within your right. She is completely out of her mind thinking that she can restrict everyone from having social gatherings for six weeks until she finishes with her tests. The only neighborly obligation on you was fulfilled— you let her know when you would be having people over. The onus is then on her to either put up with it or decide to study elsewhere that evening.", "NTA - I have done *a lot* of studying in my lifetime, in various places, and can definitely say your neighbor is the AH. As others have said, if a quiet study environment is required, close windows and doors or go to the library, or get earplugs or some such.", "NTA. \n\nTime to hold a party and invite ALL of your neighbours.", "NTA - you pay rent and she cannot dictate what and when people have friends to their house. Noise cancelling headphones were invented for this exact scenario.", "NTA. This girl sounds ridiculous. If she would’ve shut her windows and door she likely wouldn’t have heard anything. Also she could easily go study at a quiet place like the library.", "When I saw the title, I was immediately thinking y t a because I have awful neighbors that party loudly every night of the week and it’s a constant problem, especially since the lease specifically prohibits loud noises after 10 pm on weekdays and no social gatherings during exam weeks. But yeah this is ridiculous. 6 weeks? I mean when I need to focus I go in my bathroom with the fan on as sort of a sensory deprivation tank setup, but not even closing the windows and complaining because of noise? This girl would have a stroke if she lived at my apartment complex. NTA.", "Oh, she was **100%** leaving those open on purpose. She’s been *stewing* on this for days. Leaving OP some kinda 24hr notice. Then sitting around just *waiting* to hear a wayward laugh or song. She’s doing so much you can tell she lives for the drama.", "Her need for quiet study time is her problem. How very entitled is she that she thinks she can make demands of people in their own apartments? She can’t, because she isn’t paying anyone else’s rent.", "My guy reaction is to feel like that seems too extreme for me to do. But then I realize you’re right, she’s literally harassing people when knocking on everyone’s doors making demands. And posting threatening letters on communal property.", "I’m pretty sure mine ran nearly 24/7 during finals and like a week or so beforehand.", "Or put “prepare for war” and do absolutely nothing, just for a psychological advantage in this, now, Cold War", "This right here!", "And it's incorrect. It literally says a college student who lives in the apartment next door. Not we college students in the dorm. The audacity of someone to expect complete silence and no social engagements for weeks due to studying is unhinged. OP is not the asshole in the slightest and your opinion is misinformed.", "NTA. The world doesn't revolve around your neighbour and her inability to mind her own business. Maybe this will be the life lesson she needs to learn to understand that. She sounds like she's got some strong main character syndrome vibes right there bud, good luck it.", "NTA\n\n  I'm too petty for stuff like this. I'd make a note back just talking shit. I would then always have friends over friday/Saturday nights. She's acting like her \"calling you out\" should make you fear her...like ma'am...", "NTA I'd be petty and take a red marker to her note calling out all the things she could have done. Circle \"agreement\" - I made no agreement, mearly said I'd be considerate, underline \"disrespecting my stressful time\" - Disrespecting my special time and quality of living, \"laughs and discussions\"- normal human behavior, not a party; \"gathering\" - 3 people,  \"my open windows and doors\" - seems like the solution would've been to close them, \"I will call you out\" - I will call you out. It is not your neighbors obligation to accomodate what are your responsibilities. You can take steps to mitigate your environment or go to a library.", "NTA. Is she paying everyone’s rent for the month? No? Then she has no right to demand anything. That is your living space that you pay for and you are entitled to use it as you see fit.\n\nAs long as you are not violating your lease or any laws, you’re in the clear. I would print out a response and post it to call out how ridiculous she’s being.", "Unless she's paying your rent that month I'd say do as you please with being respectful to your neighbors. Which it seems you were.  But next weekend I'd have more people and music louder just to be petty for her calling me out. Lol", "NTA libraries exist for this exact purpose lol and I say this as a student who is very sensitive to noise 🤷‍♀️ it’s fine for her to ask but this is unhinged behaviour and unreasonable to expect imo", "She should have taken her ass to the library\n\nNTA", "What? absolutely NTA. in fact, you wouldn't even be an asshole if you there a huge party. It's not her money paying for your rent, she has no say. she needs to learn a real world lesson and go to the library.", "Hahaha holy shit… someone needs to tell the student that isn’t the way life works! NTA She is ridiculous and would probably cause me to have parties with that attitude", "What in the audacious fuck did I just read? How has no one laughed this entitled child straight out of the building and down the street? \n\nYou owe her not one moment of silence. You and your neighbors pay the same rent she does and have the right to live your lives within the bounds of your lease agreement. Anything beyond that is a favor and not subject to the irrational demands of a spoiled, self-absorbed brat. \n\nI get her frustration—I have noisy neighbors and stressful work, too. But I *also* have an awesome $40 set of noise-canceling headphones, a white noise app and a shred of human decency. \n\nNTA. You do you. She can go to the library.", "NTA. I mean she’s obviously insane", "To be fair, you didn’t go back on the “agreement” you told her you were gonna have a few friends over and some low music and that’s exactly what you did. It blows my mind people like her exist. Like the whole world needs to stop and revolve around her. \n\nDef NTA OP", "NTA. I would have been loud just to piss her off. She’s entirely too entitled to think the entire complex needs to be quiet for her. She left her windows open. She wasn’t even trying. I’m a college student, too. I know it can be stressful but libraries and headphones exist.", "NTA I was in my clinical year of vet school and it NEVER occurred to me to start going to my neighbours expecting them to stop their lives so I could study. Even when my neighbour got their kid a drum set! Like if she needed the peace and quiet so much why not study on campus? Noise cancelling headphones? Also you had people over on a Friday night so she can go F herself", "That’s what libraries and other on campus areas are for.  NTA.", "I'll try to be sympathetic for just a minute. She was within her right to let her neighbors know that she would be studying and to please try to keep loud parties to a minimum. YOU are just as much in your right, to ignore her. Your \"rager\" sounded like a small gathering. If she has that big of an issue she should be in the library, or not living in apartments. NTA", "Who the heck does she think she is?? If you want peace and quiet and to have absolute control of noise levels then buy a house. There’s no way someone could behave that way and I just be ok with it. I understand common decency and respect but she was way out of line", "NTA. She lives in off campus housing and expects everyone to adhere to rules that wouldn’t even be reasonable for on campus housing? No way. That’s ludicrous.", "nta. put signs up under them stating that \"Lady Y from the 7th floor and apartment number x has informed the dictator of the apartment that she will be celebrating her birthday on this night with a couple of friends. It was a quiet gathering and she only heard anything because she chose to open her doors and window. She could have chosen to study else where that night or wear noise canceling headphones, but instead she wants to control who has company over or not during this time.\"", "NTA. You pay to live in the building too. If she wants to study, she should go to a bookstore or somewhere on campus with study rooms, or libraries, or whatever the case may be. It isn't the entire complexes responsibility to coddle her.", "NTA. The girl shouldn’t expect everyone not to have gatherings for a month. That’s just ridiculous!If it was that important to her, she should’ve studied elsewhere.", "NTA \n\nThat was a totally unreasonable request to begin with, and her passive aggressive call out note post is immature.\n\nHow does management feel about this “agreement” that you broke??", "NTA Your neighbor is way entitled assuming there was an agreement just because she made an announcement about what she thought everyone should do,  she could go to the college librarary, buy noise cancelling headphones, use a white noise app on her phone, etc.  If she knows she’s going to be studying which may be stressful then she needs to plan ahead on how she’s going to reduce her stress.  Not how everyone around her is going to reduce her stress.", "NTA\n\nWow, the girl is out of control. If she wanted total peace and quiet, she should have gone to the library to study. It is unreasonable to expect total silence when living in an apartment.", "NTA, there is a place called the library, your neighbor should look into it.", "Why can’t she go to the library? I am a college student and that’s ridiculous. NTA", "NTA, this is absurd. She lives in apartments and cannot control what other people do. It’s so unreasonable to expect people to not live their lives because she has to study. I’d be stomping and playing music and partying my ass off super loudly every night after that. She can leave if she doesn’t like it. And she can move if she wants more quiet.", "NTA I refuse to believe that a real person acted like this. Entitled child. Just close your damn windows", "she is unreasonable. mc vibes\n\nNTA", "I’m on my period 1 week a month. I would like absolute silence from all of my neighbors during this stressful time. I will call you out /s. NTA", "And mine was open extra long hours during finals time", "Of at least seven floors…", "Exactly. If a stranger is walking their dog and it barks is she going to run outside and hunt them down to “out” them?? I’d report her harassment to management. Fuck her.", "I'm kind of wondering if she's failing her classes and just wants some other situation and person to blame it on when she tanks her exams.", "“I'm disinclined to acquiesce to your request. Means ‘no.’ “", "I'd pin a flyer for a party at my place onto the end of her note"]}