{"id": 16820, "submission_id": "13cw4i9", "title": "AITA for asking my friend when she’s going to get a real job?", "selftext": "My friend, Ruby (f31) and I (F32) have known each other since we were 18. \nRight after her masters, Ruby decided she doesn't want to work in her field and decided to start a small business selling candles and soaps. She claims she's been able to make a living doing that but I've never seen her business accounts so I can't confirm nor deny. She lives alone so unless her parents are helping her (her parents are dirt poor though) she must at least make a minimum wage.\n\nI never questioned her life choices although I found them odd. What's the point of getting degrees but not using them for anything is beyond me. \n\nI met Ruby for coffee on bank holiday Monday and we were chatting. I complained about work, that I was overlooked for promotion again. She sympathised. But when I asked her what's new about her work, she perked up. Honestly, I kind of expected her to keep her success on the downlow considering that I was down regarding my job but she didn't hold back. Apaprently, she's just finished editing her book (i had no idea she was writing one) and she sent it to an editor for edits before quering. And she's about to launch her true crime youtube channel because she's been filming videos for the past few months so she has a few months prerecorded.\nTo say that my jaw dropped would be an understatement. This is a woman in her 30s who's still playing around like a child. No real responsibilities, jumping from one thing to another without a care in the world.\n\nI care about her so I thought someone had to say it. I asked her when she was planning on getting a real job.\n\"What do you mean,\" she asked me.\nI explained to her that I thought it was the right time to get a real job as she can't play all her life and it'll come back to bite her when she's older and needs some professional experience when her little ventures fail.\n\nShe got really offended and told me she never expected me to say this and thought I was supportive but I was like the other people who belittled her accomplishements.\nI said I was nothing like them and I wasn't belittling them but recording a few videos and make a few candles wasn't that big of an accomplishement and that with her intelligence she was selling herself short when she could be really accomplished if she only worked in her profession.\n\nShe told me to fuck off and left the lunch.\nI thought she'd call apologising but no luck. My husband told me I was the asshole because she's my friend and even if I didn't like it, I should've played along but I don't know if I agree with him. Real friends tell the truth and I couldn't just coddle her, she needed someone to show her that she's wasting her time.\nShe still hasn't called and I am starting to worry, perhaps, they're right and I should've kept my mouth shut for the sake of our friendship. AITA for asking her?", "created_utc": 1683646502, "permalink": "/r/AmItheAsshole/comments/13cw4i9/aita_for_asking_my_friend_when_shes_going_to_get/", "score": 67, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I guess i might be the asshole because I asked my friend when she’s going to get a real job because she’s been acting like a child when it comes to her career. I only wanted to give her a reality check but she got offended and I supposed, asking out loud is what may make me the asshole. I suppose I could’ve stay quiet and let her learn from her own mistakes so I wouldn’t be the asshole for speaking the truth.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YTA.\n\n> Honestly, I kind of expected her to keep her success on the downlow considering that I was down regarding my job but she didn't hold back.\n\nTell us you're jealous of her without saying your jealous lmfao, girl bffr. She is thriving doing what she wants instead of forcing herself into a position/field she doesn't want, stop being bitter. if she's making enough to live alone in the current market she is a lot better off than most people and it doesn't matter what you think of her job, its working for her.", "YTA\n\nSo she's highly educated, runs her own business, and is about to be a published author; and you went out of your way to belittle her accomplishments? Yeah you owe her an apology.", "YTA. This is hysterical.\n\n>She claims she's been able to make a living doing that but I've never seen her business accounts so I can't confirm nor deny.\n\nDo you ask to see the accounts or wage slips of everyone you know?\n\n>What's the point of getting degrees but not using them for anything is beyond me. \n\nEducation is not the same as training.\n\n>This is a woman in her 30s who's still playing around like a child. No real responsibilities, jumping from one thing to another without a care in the world.\n\nUnlike you who\n\n>was overlooked for promotion again.\n\nWhat a success! The rest of your post is even more bizarre.\n\nTo summarise: she has a life and you are a seething bucket of envy and bitterness.", "So in recap: \n\n- You complained about your work which is presumably “a real job”\n\n- You asked her how her work was going\n\n- She had nothing but exciting things to say\n\n- You shit on her positivity and told her to get “a real job” which is precisely the thing you were complaining about just 5 minutes before.  \n\nDoes that pretty much sum it up?\n\nYTA", "YTA for being an adult with childish jealousy.", "YTA - like a really big one. Are you from the past?  \n\nPeople make money in all sorts of ways now. She is building a multi-media strategy with ecommerce, video content, a book, holy cow. She is crushing it! And she is able to live off that?   \n\nA true friend would celebrate! Want to watch the vids and smell some candles.  \n\nSeriously- you are a giant giant a hole for your response. Real job- she probably makes more money than you now.", "YTA \n\nJust because you’re bitter and hate your job doesn’t mean you need to shit on someone else’s success and aspirations", "YTA. you were in a bad mood about work, and took it out on a friend. You resent her for her happiness and attempt to drag her into the misery that is the working world. That's not friendship.", "YTA.\n\nYour attitude toward your friend is condescending and contemptuous. If she's making money, it's none of your business whether it's \"childish\" or not. People can be very successful that way. I suspect she will be one of those successful people, and I suspect you're jealous. She's not going to apologize; YOU are the biggest asshole in the room.", "YTA for how judgy you sound. Also, saying 'I'm not belittling you but your accomplishments are not that important' is only fooling yourself. That is belittling someone who is supposed to be your friend and you sound bitter and jealous.\n\nEdit: a word", "YTA. Why would she apologize to you? You are the one that insulted her life, she didn't insult yours. You don't know her finances, maybe she is wealthly via parents, what does that matter. Seems like you were in a bad place, not receptive to hear good tidings and lashed out to her about her life when truly you were just down about your own circumstances. Happens, but to expect an apology is frankly nonsensical.", "YTA - is farmer a real job? advertising exec? radio host? street sweeper? Your prejudice about what is and isn't a real job is full of crap.\n\n&#x200B;\n\nIm willing to bet at some point Bill Gates was told to get a real job and stop messing with those computer thingys. Im also aware of multiple millionaire streamers/youtubers/tiktokkers who dont have 'real jobs'\n\n&#x200B;\n\nShe is following her passion and even if she only has $1 left after her bills every month that's on her and if she's happy who cares. \n\n&#x200B;\n\nYou asked her how she was doing, if you don't want the answer don't ask. just because you are unhappy at your job why should she be. Maybe you need to take a leaf out of her book and do something you like instead.", "YTA. If Ruby is happy and she’s not asking your for money, it’s really none of your damn business what she does or doesn’t do for a living or how she does or doesn’t use her degree. It sounds like you are just jealous that she doesn’t have to deal with corporate bullshit like you do. And FYI, making and selling soaps and candles, IS a real business.", "YTA \n\nI dunno how you can call Ruby your friend when you treat her like this.  You got upset that she was doing better in life right now and you lashed out by belittled her pursuits as \"being a child\".  When you tell her that what she's choosing to do is \"playing around like a child\" YOU ARE BELITTLING HER.  \n\nI dunno what hole you crawled out of OP but podcasts, videomaking, and running your own business is something a lot of adults do in our century.  Most of these brands you see on the shelf of stores now came from folks who started their own business.  Just because her jobs don't fall into your narrow definition of what \"being an adult is\" doesn't mean you can put her down for it.  A lot of people get degrees in fields and then never end up working in that field.  \n\n**You're the only one that needs to grow up here OP**", ">I complained about work, that I was overlooked for promotion again. She sympathised. But when I asked her what's new about her work, she perked up. Honestly, I kind of expected her to keep her success on the downlow considering that I was down regarding my job but she didn't hold back. \n\nIt sounds like you were just jealous. YTA", "YTA.\n\nShe is an entrepreneur, and she's killing it. She's doing product development, multi-media content creation, and digital strategy. She's about to be a published author, WHICH IS A BIG F\\*#KING DEAL. \n\nYou yourself said her parents don't have the means to support her, so if she's not homeless or being hounded by creditors, then she's supporting herself just fine. She should not need to show her TRUE friends her bank statements to prove she's worthy of their support.\n\nAnd let's be clear: You're not happy at your job. Because most \"real jobs\" these days are crap. And anyone who can support themselves without being subjected to the demeaning and dehumanizing culture that is the modern job market--that person is my hero.\n\nAlso, I don't ever want my friends to downplay their own success and happiness just because my life isn't going how I want it to go at the moment. No matter how disappointed I may be in my own circumstances, I always want to celebrate my friends' accomplishments and good fortune. Yet you want your friend to keep her \"success on the downlow\" for your comfort. I'm so glad to not count you among my friends. I don't need that BS in my life. And neither does she.", "Yta. Do I really need to tell you why??", "YTA -  Being a maker is a ‘real’ job. Plenty of people work in a more traditional career and are miserable so they make a conscious decision to change paths. It sounds like that’s what she did and you’re telling her all of her hard work is going to fail when she’s very obviously making it work. You’re not seriously surprised she got offended are you?", "So you’re asking if you’re an asshole for telling your friend that all of her life choices suck and everything she is working on is going to fail?\n\nHmm, that’s a tough one.\n\nYTA, I guess. I mean obviously it could go either way here /s", "YTA obviously she's making a living doing what she's doing and you're jealous. It's so weird that I'm older than you but you're the boomer lol. People can and do make a living doing these things. They're much more \"real\" jobs than whatever 9-5 you're doing if we're dock measuring on Capitalism. These are start up businesses that could fail at any time. They also have the potential to really make it big. Your \"real job\" will pay the same now as it will 10 years from now and if you're lucky you might get raises that match inflation but probably won't.  \n\n\nAnd let's say even if you're world view was right. You're still an asshole for shutting down her happiness. Why does everyone feel entitled and compelled to put others down? (Ironic I guess while typing this out). But at least you asked me. Did she ask you what you thought of her job or were you just butting your opinion in where it wasn't wanted?", "YTA- And a big one too! Not everyone is going to have an office job 9-5, pencil pushing. She's doing things she's passionate about and she must be doing well for herself if she can pay all of her bills and still have free time. Why are you so judgmental and entitled? \"Real friends\" support each other so if you actually care about her you'd apologize to her.", "YTA.\n\nsome people settle into a career and need that stability and never stray, and some people have a more entrepreneurial spirit that takes them from passion to passion. \n\nyou don't get to judge someone just because they don't want to live the same kind of life you do. she's not asking you for anything, she's perfectly self-sufficient and is apparently really excited about what she's been doing. how many people are lucky enough to say the same?", "IN FO: When are YOU going to get a real job? With your intelligence you're obviously selling yourself short playing around like you've been for all these years.\n\nJust kidding, YTA. She seems to be doing well enough, she's not asking you for money, you just decided you were better than her without having a clue what things are like for her. That's kind of the definition of \"asshole\".", "YTA. She's supporting herself doing what she enjoys. She isn't hurting anyone by having a non-conventional career.\n\nIt sounds like you resent her for pursuing her own happiness rather than immiserating herself in the pursuit of empty status and an ever increasing amount of money like you did.", "YTA.\n\nI mean, you said that you care about her and that's fine but it's her choice at the end of the day. It's not up to you to decide what your friend should do with her own life, especially if she appears to be happy and stabilized and pays her own bills without asking you for anything.\n\nYou discredited your friend's work and that's not being a good friend at all. And if that's what your friend wants to do professionally, you should support and encourage her, not put her down.\n\n\rI don't know if I'm reading the situation well but it seems to me that maybe you're a little jealous of your friend's courage to pursue her dreams and that she's succeeding doing what she really likes.   \n\n\n(\"I explained to her that I thought it was the right time to get a real job as she can't play all her life and it'll come back to bite her when she's older and needs some professional experience when her little ventures fail.\")\n\nWhy do you immediately assume that she will fail? \n\n&#x200B;\n\nYTA!!!!!", "Yep HUGE YTA, just because you stuck to traditional 9-5 job and feel overwhelmed and stressed about your life doesn’t mean that everyone should. Sometimes people pursue higher education and degree to open multiple paths for them.\n\nShe is pursuing what she loves and just because you are unhappy with your life and jealous of her perkiness doesn’t mean she is doing it wrong, she is taking more risks and could easily get more gains and better rewards than you FYI.\n\nAlso, real friends aren’t judgemental and so closed minded. If you don’t know her financial statement, you have no right to question it. It’s her life and her choice, she is focussing on her passions and making a living out of it.", "YTA. Not everyone’s work looks the same and what difference does it make to you if her work doesn’t fit a particular mold? If she can afford to live alone, she’s likely earning much more than minimum wage with her projects and even if she weren’t, it shouldn’t be a factor in your friendship. Go apologize.", "What you did isnt truth telling. YTA big time here. What u did was completely diminish her accomplishments at doing stuff that makes her happy and provides for her financially.", "YTA and you deserved what she said to you. Mind your own business. Learn to be supportive of your friends.", "YTA. You seem to be oblivious or jealous. You're complaining about your \"real job\". Meanwhile Ruby may well be doing great as an entrepreneur and is branching out into writing and producing.\r  \n\r  \nInstead of being happy your friend is enjoying her work and successful with what she's doing, you tell her she could be as miserable as you if she'd just settle down.  No wonder she didn't take that so well.", "Yep YTA for judging her on her life choices when they in no way affect you at all! She's happy and excited about what she's doing and you should be supportive or be a good friend and not say anything at all if you don't agree with her.", "YTA - sounds like you are unhappy in your current work situation/life. Your friend shared she had positive things going on work wise and you chose to tear her down. Why? Because what she does for work, you seem to think it’s beneath you. How do her decisions impact you? She’s able to afford her bills and is happy in her situation. Not everyone feels the need to live to work. Your friend sounds content and happy with her life, whereas you don’t. As her friend you should be happy that she is in a situation where she is thriving and all is going well for her.", "corrr... you sound bitter af! \nbutter she is chasing the dream, and you're working a job you hate and being overlooked for another job you'd hate. \nhonestly, YTA.\nshe deserves better than you", "YTA. I hope your friend is able to find a more supportive circle of people. \n\nShe doesn't have to abide by your metrics of success and adulthood. I think you're just upset seeing her thrive while forging her own path at a moment where you're frustrated by the lack of promotions you've received in your more traditional path. It's sad you took out your frustrations on her instead of just supporting your friend.", "Wow. YTA. Your idea of what is a \"real job\" is just your opinion. Frankly, you sound jealous of her ability to live her life doing stuff she likes. You don't sound like a good friend.", "YTA absolutely and ruby’s doing better in life than you are by the sounds of it. What an asshole move to downgrade her accomplishments and ask something like you did. Then to expect her to apologize??? No f***ing way! Tou owe her an apology. I hope she moves in from this “friendship”. She deserves friends that will cheer her on, support her and not be so damn judgmental just because they don’t think it’s “a real job”.", "You sound bitter over the fact that your friend is moving along with her life and has been living the life she wants. \n\nNews flash OP, entrepreneurship is a real job. You have admitted that she's making enough money to live by herself meaning she's doing great. YT can be a proper job to those who use it with the intention of profit. Being an Author is also a real job. \n\nYour friend might have gotten a degree but that doesn't mean she has to use it. You sound judgemental and incredibly jealous. You're going around calling her kid when in fact her career has moved on.\n\nYTA\n\nYou need to grow up.", "YTA - your definition of a \"real job\" is different from the universally accepted definition of a \"job\", which is a task you complete in exchange for money. \n\nPeople make their way in all kinds of fashions now. Just because someone's chosen path misaligns with your own does not automatically make it less than or a bad path. Your misfortune at work does not lessen your friend's success. \n\nYou did not demonstrate the behaviours or traits of a good friend in this interaction. If anyone should be calling to apologize, it would be you. Please do better.", "YTA.  you weren't telling her the truth, you were sharing your opinion.  if you care about her, you'd be supportive of her.  it's not like she's engaging in anything illegal or that could potentially harm her, and she isn't actively failing or in debt to the point where she needs help - in which case your opinion might have been helpful in the way that she would need to hear the truth, but she isn't there.  i'm not sure why you think what she's doing is \"playing\".  honestly it sounds like you're unhappy in your life, and maybe a little envious that she doesn't feel like she needs to be a slave to the 9-5 grind.", "Let's see, since your friend got her Master's, she has:\n\n1. Started her own small business, which sounds like it is successful.\n2. Written a book.\n3. Launching a True Crime YouTube Channel.\n\nMeanwhile, the only thing you seem to have going for you is complaining about your current job. Sounds like you are jealous that she is following her passions. That makes YTA!", "YTA. She has a real job- she’s a business owner. A pretty successful one at that if she is able to spend so much time on other hobbies. I’m astonished you felt that SHE would call YOU to apologize. You owe her an apology for being such a judgmental person. It’s not her fault she’s happy with her professional life and you’re not.", "YTA\n\nholy smokes. you keep claiming you're telling her the truth and you're trying to help and protect her but you have literally zero nilch nada no evidence that there's anything wrong with her lifestyle?\n\ni think ur probably just a lil bit jealous that you aren't living a happier lifestyle and dont believe its possible for anyone just because its not possible for you", "YTA. You don’t have to agree with someone’s life choices, but you could certainly be supportive. Belittling someone and your attitude of being better than her because you have a “real” job (defined by you btw) isn’t a positive character trait.", "YTA. I hope she finds better friends. This was an easy one.", "You weren't trying to help her. You were trying to knock her down to where you were. You aren't happy with your job & you didn't like hearing that she doesn't feel the same about hers. \n\nYTA because you were & still are belittling her. From the beginning of your post until the end you were judging her choices because they weren't the ones *you* made. \n\nShe has a business which is making money whether you think it's a real job or not. If she wants to make videos & write books then that's all right, too. As long as she's able to live & not asking you for money, then it's none of your business. \n\nThe only one who needs to apologize is *you* for your bad behavior. The green of your eyes is blinding from how jealous you are. She's done nothing wrong, but you did the moment you chose to say what you did. Be the adult you claim you are, apologize, & learn not everyone has to go down the same path to be successful & happy in their life.", "Major YTA. Just because what she does doesn't fit your definition of a real job doesn't mean she isn't making a real living. \n\nAs a side note: You should have been more open-minded. Maybe she would have hired you. Maybe what she is doing now will be the Next Big Thing tomorrow. You could have been in on the ground floor. Instead, you will be in your cube, overworked, underappreciated, and passed over for promotion *again*.", "YTA!  Ruby is living her best life doing what she seems to love.  You, on the other hand, are complaining about being overlooked for another promotion.  You sound jealous and you are kidding yourself if you think she owes you an apology.  And clearly Ruby is using her knowledge from her degrees to be an author and business owner.  You don’t have to work in the field in which your degree is in to be successful.", "YTA what she's doing is far more demanding than turning up to be a desk jockey day in and day out.\n\nIf she's your friend you should be celebrating that all the way!", "HAHAHAHAHA!!!\n\nI mean, obviously YTA, but also thank you. Your complete lack of self-awareness was the best laugh I've had in ages. I mean, you just publicly and without prompting admitted to thousands of people that:\n\n\\- Your friend just keeps being wildly successful at everything she does in multiple, unrelated fields, despite having taken the huge risk of setting off on her own as an entrepreneur outside of her field of academic training, whilst\n\n\\- You are miserably unsuccessful, working for someone else in the are for which you trained and were educated, and not only haven't accomplished anything at all of note, you aren't even good enough at your job to live up to your boss's expectations, so that you've been REPEATEDLY passed over for promotion.\n\nThen, having considered (or perhaps I should say NOT having even the basic common sense to have considered) these facts, you still somehow came to the utterly inane conclusion that YOU ought to be giving HER advice; and the advice that you gave her was that she should, um . . . stop doing all of the things that she is doing that are having so much success, because you (again, the person who has had literally *no forward professional momentum whatsoever*) don't think much of them, and should instead try to follow a similar career path to your wildly unsuccessful one. \n\nI feel like I want you to see the irony here, but you're definitely not going to. \n\nSo here it is plainly: YTA. Your friend has been exponentially more professionally successful than you have, by every measure. You giving her professional advice is ridiculous on the face of it. You belittling her career path doesn't come off as wise or sagely helpful, or whatever you had it as in your head; it just sounds pompous, childishly petulant, and reeking of exactly the inflexible, self-important mindset that has likely kept your own career from advancing.\n\nOn top of which, you were just incredibly rude. \n\nBut again, thank you for the laughs.", "Yta. If she's happy and surviving let her get on with it. Most millionaires didn't to \"proper\" nine to fives", "Another jealous friend post. OP pretends that their life is being lived in the only correct and right way and anyone,  including close friends,  whose lives are going differently are in trouble and need OP's tough love advice (especially if said friend is happier and more successful than OP).  When OP'S friend then cuts OP off after OP hits them with insults and dismisses any accomplishments in what OP calls the \"hard truth\", OP acts all surprised that they weren't thanking OP for showing them the light. It's asshole behavior every time.  YTA", "YTA - If she is paying her own bills, living her own life and doing what she enjoys, what do you have to criticize?  You actually sound jealous.  If she were the one complaining because she doesn't have enough money, then you start talking about \"real\" jobs.  If she is happy, not asking for money and not complaining that she doesn't have any, then you congratulate her on her success and try and fix your own life.", "YTA\n\nIf she can afford her life there's no issue. You just seem to be jealous.", "YTA. Get real, OP. You didn't \"ask\" her when she was getting a \"real\" job because you wanted to know. You were being indirectly insulting. You and a lot of people need to take a hard look at yourselves if you judge people on what people choose to do for work. Maybe you were coming from a good place but you were/are so incredibly rude to someone you call your friend.", "YTA. She told you what to do. So do it.", "YTA for so many things in this, I don’t know where to start.\nSomeone needs to show your their business ledger just for you to believe they’re doing well? If someone is able to live alone, they are obviously doing better than minimum wage, especially since she also seems to be able to pay off the loans she must have taken out to get her masters since her parents are “dirt poor”.\nAnd you expect as friend to keep quiet about how well they’re doing, when you asked the question, because you don’t like your corporate gig? Is no one allowed to enjoy their work because you don’t?\nIf you don’t think telling someone that what they do for a living, especially if it makes them happy and keeps a roof over their head and food on their table, is playing and not a real job isn’t condescending or belittling them, then you are just a clueless a$$ and someone I would not want to be friends with.", "NAH - I think you do need to reflect though. You obviously don't know a lot about how her life is going. \n\nI have a buddy like Ruby, who has done nothing but waste money his entire 20's. He's got no savings, no education, no skills besides motorcycle mechanics. He pissed away an insanely cushy deal that sounded like a motorcycle guys dream, he was in charge of maintaining a guys private collection. He always has \"something\" going on, but he still lives at his parents house at 29. I'm hoping this is his last round of college and he can commit to actually following through, because I'm his friend and want him to succeed in life and not be broke/destitute. I have a hard boundary that I will help him move, just not into my house. \n\nSo for Ruby, you do need to apologize. And you do need to withhold judgement in your own life as long as her needs are met. But you are right, if everything she's talking about is just \"fluff\" made up to save face with people around her, that's a whole other issue. \"sent a book to an editor\" is not \"book about to be published\", it means you sent it in for edits. Everyone with the strict YTA votes is missing that nuance in your post, IT'S ALWAYS SOMETHING NEW WITH THIS LADY, NOTHING HAS EVER TAKEN OFF, IT'S JUST ALWAYS \"in the works\". So I get why OP is so disdainful, because I've heard this song and dance before.", "NTA..maybe…I’ve got a couple decades on you.  Your intent is correct.  I dont know if your delivery was correct.  There is a right and wrong way to share concern.  “When are you going to get a real job” doesn’t sound productive, if thats how you said it.  I agree it sounds like your friend needs some direction…and I agree when your friend gets old and has nothing (in the way of savings/retirement) they will be in a wold of hurt and mad at themself.   Peter Pan is never happy with their choices when they are 65yo & broke.   You have appropriate concern for your friend…but you need to frame it in a more loving way.   I hope you get the chance to say it again the way you actually meant it.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy friend, Ruby (f31) and I (F32) have known each other since we were 18. \nRight after her masters, Ruby decided she doesn't want to work in her field and decided to start a small business selling candles and soaps. She claims she's been able to make a living doing that but I've never seen her business accounts so I can't confirm nor deny. She lives alone so unless her parents are helping her (her parents are dirt poor though) she must at least make a minimum wage.\n\nI never questioned her life choices although I found them odd. What's the point of getting degrees but not using them for anything is beyond me. \n\nI met Ruby for coffee on bank holiday Monday and we were chatting. I complained about work, that I was overlooked for promotion again. She sympathised. But when I asked her what's new about her work, she perked up. Honestly, I kind of expected her to keep her success on the downlow considering that I was down regarding my job but she didn't hold back. Apaprently, she's just finished editing her book (i had no idea she was writing one) and she sent it to an editor for edits before quering. And she's about to launch her true crime youtube channel because she's been filming videos for the past few months so she has a few months prerecorded.\nTo say that my jaw dropped would be an understatement. This is a woman in her 30s who's still playing around like a child. No real responsibilities, jumping from one thing to another without a care in the world.\n\nI care about her so I thought someone had to say it. I asked her when she was planning on getting a real job.\n\"What do you mean,\" she asked me.\nI explained to her that I thought it was the right time to get a real job as she can't play all her life and it'll come back to bite her when she's older and needs some professional experience when her little ventures fail.\nShe got really offended and told me she never expected me to say this and thought I was supportive but I was like the other people who belittled her accomplishements.\nI said I was nothing like them and I wasn't belittling them but recording a few videos and make a few candles wasn't that big of an accomplishement and that with her intelligence she was selling herself short when she could be really accomplished if she only worked in her profession.\nShe told me to fuck off and left the lunch.\nI thought she'd call apologising but no luck. My husband told me I was the asshole because she's my friend and even if I didn't like it, I should've played along but I don't know if I agree with him. Real friends tell the truth and I couldn't just coddle her, she needed someone to show her that she's wasting her time.\nShe still hasn't called and I am starting to worry, perhaps, they're right and I should've kept my mouth shut for the sake of our friendship. AITA for asking her?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA and bitter af.", "What exactly is a \"real job\"? Is it only \"real\" if it makes her as miserable as you are with your job, because that's how it sounds like. YTA, friends tell the truth but aren't threatened by each others' success or happiness.", "YTA. You basically admitted that she can support herself without a \"real\" job. Which makes it absolutely not your business no matter how long you've been friends. (By the way, this snobby attitude might play into why you're being passed over for promotion.) Instead of being happy for her you put her down in a really offensive way. You're the one who should be apologizing, but I wouldn't be surprised if you just permanently broke your friendship.", "YTA. I hate to drop the real world on you, but your friend understands how the new economy works.  You need to catch up or get left in the dust.", "YTA you were clearly lashing out and punishing her because she didn't downplay her success for the sake of your feelings. Congrats on nuking your friendship.", "YTA, a jealous wench and a crappy friend. Maybe self reflect a bit.", "YTA everyone’s path to happiness is different. It honestly sounds like you’re jealous of her. You want her to downplay her accomplishments because your job sucks, but then *you* try to downplay them! She’s accomplished so much with her “little” ventures, why does that bother you? Why does her career bother you?", "Are you serious? Yes, YTA. Your friend has found a way to support herself while pursuing her passions; that should be a goal we all have! It sounds like she’s living a fantastic life and succeeding. Just because what she’s doing doesn’t fit into what you think a career should look like doesn’t mean she’s doing anything wrong. Had she been asking you to financially support her, sure, I could see your point of view. But seeing as you weren’t even aware of all her projects, it sounds like she hasn’t needed your support. And since you don’t support her career choices or carefree lifestyle, it sounds like she also may not need you as a friend.\n\nMaybe you couldn’t make that kind of lifestyle work for you (I don’t think I could either - this isn’t a slam on you) but those who can and use that success to plan for the future can have quite lucrative careers and lives.\n\nIf anyone’s owed an apology, it’s your friend.", "YTA. Clearly you aren't her friend if you're this judgemental about everything she does. \n\nYou didn't tell the truth, you just showed her how closed minded you were. Real friends want the other to succeed and you clearly don't want to see her do well, because she didn't make the choices you would've made.", "YTA.\nIt seems that you’re jealous of her being happy at her job when you seem miserable at yours.\nWhy do you want her to be unhappy at her job like you are?\nBe happy for her that she’s doing something she  loves and can make a living from it.\nThat’s what a real friend would do.", " \nYour friend is thriving . And you are stuck in your life . Don't be a jealous bit** . Learn from your friend and find your passion. \nAnd as for your friend i hope she is cut all contacts with you . She deserves better friend.", "YTA\n\nYou’re not “telling her the truth” you’re trying to tear her down so she’s as miserable as you are. She’s happy. She’s self-supportive. She’s excited about what she’s doing. And you’re jealous and bitter about it all. \n\nI’d cut you off if I was her. No true friend would be so belittling.", ">Real friends tell the truth\n\nThen, tell the truth.\n\n\"My friend has successfully made a living doing something she loves and has time for hobbies and other pursuits. I am miserable in my job and jealous, and the only way I feel able to express it is to insult her chosen occupation. If I can't be happy, why does she get to be?\"\n\nThe needed reality check is the one you need - your college degree doesn't have to dictate your life. Nobody said that being an \"adult\" meant you had to suffer. If you hate where you live, work towards moving. If you hate your job, try to pursue a different career. **There is nothing wrong with those things.**\n\nYTA", "YTA. She’s obviously been hiding things from you for a reason. She sounds like she has a few successful avenues and things are working out. Just because people don’t have the traditional 9-5 doesn’t mean they’re being children. YOU ARE A CHILD OP. Grow up and be supportive of your friends because you sound bitter. This is absolutely ridiculous", "Your just jealous. YTA", "YTA. You’re being extremely condescending, seemingly because your friend is happy with her atypical career path.\n\n\nFirst of all, you seem to have expected your friend to hold back from sharing her successes, simply because you didn’t meet your own career goal. Dulling other people’s shine to make yourself feel better is sad, at best, and cruel, at worst. You asked your friend about how her career is going and got an honest answer. Instead of being happy for her, you’ve tried to bring her down to wallow disappointment. Be happy for your friends! Life isn’t a competition.\n\n\nNext, you’re insulting your friend, a small business owner looking to expand her portfolio with other venues, by minimising her successes, simply because they’re creative endeavours rather than white-collar jobs. Ignoring the classist implications of this, it seems you don’t understand that someone can be accomplished despite building a business from scratch, simply because it’s creative.\n\n\nUltimately, I don’t understand why you would treat a friend like this. You say that it’s out of concern, but let’s be real, hiring managers adore successful entrepreneurs - there’s no indication that your friend is anything but successful. Whilst you may not be consciously jealous of your mate, it may be worth thinking about why you found it so pertinent to bring her down and challenge some of your own stereotypes about self-employed people and those in creative industries. She certainly deserves an apology.", "YTA. You aren't her friend. Stop saying that. You are just someone who is jealous of her accomplishments. To you, she should be miserable to \"have a real job\". Turns out, it's you who is the problem.", "YTA you're miserable and don't like that she's happy", "Let me get this straight, your friend runs her own business - which seems to not only support her but feeds her creativity AND is expanding; while you are complaining about your job and how you got passed over for ANOTHER promotion. It looks like your ‘little venture’ is the only thing failing here. YTA.", "If only people minded the business that paid them. You're also weirdly judgemental about someone you apparently consider a friend. \n\nHard YTA.", "Why would she take advice from you when she is more successful than you at everything?\n\nYTA", "You could learn a thing or two from your friend. Yta", "HUGE YTA. Good for her if she’s able to make a living doing things she loves! She sounds extremely motivated, organized, and successful. If she’s able to support herself without, as you would say, a “real job,” then let her. You come across as jealous and jaded in this post. I encourage you to find a new job where you find joy and happiness, and then maybe you can be happy for others (like your friends)", "YTA you come across jealous and bitter of your so called friend only because she dared to take a different path in life. Get over yourself", "YTA. What’s it to you what she does professionally to make money?", "Sounds like she knows how to hustle and likes it better than the daily grind and you’re salty about it because you have to grind. Got it. YTA", "YTA. You need to do some internal work to process why you feel the need to belittle her accomplishments. Do you tell all business owners they need to get a \"real\" job?  It sounds like you are upset that you did the \"right\" thing and went to school, got a \"good\" office job and are upset that your hard work didn't give you the results you felt like it should. Your friend took the unconventional route and is successful and you're jealous.", "YTA.  You’re jealous because she’s making a living following her passions and you’re stuck in your job.  Also, her choices are none of your business.", "This can’t be real. If it is then OP is incredibly obtuse. Obviously, the friend is both happy and supporting herself with a variety of interesting pursuits. OP- YTA.", "YTA 100%", "YTA\nyou sound jealous and bitter. you couldn’t even fake e smile, and pretend to be happy for your friend.?", "Wow you sound bitter. She working for herself and being happy while you sit and moan and groan about corporate life. YTA for being so unsupportive especially with that line about expecting her to tone down her success because your life is a mess", "WOW YTA!!! \n\nWhat a terrible friend you are, lots of people out there making millions from YouTube, and selling soaps and others things… \n\nMy partner and I own a small business ourselves selling decals/stickers, it pays for our living. You going to tell us to go get a proper job? My partner has degrees and all sorts but wanted to work for himself rather than someone else and make his own way… you should be supportive! She’s making her own way in this world and being happy rather than working a stressful job she’ll never actually enjoy, you should apologise and hope you still have a friend because right now she’s probably thinking what she has done isn’t worth it because you made her feel worthless in her chosen work… I hope she doesn’t quit pursuing her dreams because of you.", "Info: why do you care?", "YTA. Her life choices are her own and ad long as she earns a living and is happy there's no reason to belittle her achievements. You sounds jealous and it is sad because your friend obviously expected better of you.", "YTA. Ruby sounds awesome and I want to be her friend.", "YTA. Come on, you know fine well you were belittling her.\n\nIt's ok to be jealous. Very human. But it doesn't mean you can shit on other people and expect them to sit there and take it.", "YTA and an incredibly pathetic one.", "YTA.\n\nYou're being judgmental and kinda ignorant about how much work running your own business, writing a book, and (about to) run a YouTube channel is. Honestly, given that she's been able to translate all of her interests and hobbies into viable streams of income is quite impressive, and the fact that your kneejerk reaction is to belittle her kinda demonstrates that you're the child.\n\nAlso, do you know how much YouTubers - especially in the true crime genre - can make? If she blows up she can easily outpace her business, her book, etc. People have left stable work to pursue YouTube full time (Tasting History with Max Miller comes to mind), so you're coming off like a dinosaur as well.", "YTA some people just want to live their lives differently. How does it hurt you?\n\nNot everyone wants the house, husband/wife, kids, SUV, office job, etc. \n\nThis sounds like you’re jealous of her on some level. Maybe you regret some of your choices. Don’t take it out in her if that’s the case.", "YTA\n\nIf you were really real friends you’d know you are TA without asking random strangers.\n\nJealousy is never a good look.", "YTA and painfully jealous lol", "You're an incredibly large AH.", "      There are people ,a few ,that make more money from this shit ,not a real job youtube ,video shit that i will make in a lifetime working till 100 years ,every day 24/24 .\n      You can call it a fake job or not a real job or a job for stupid people or whatever but every job that gets you money is a job ,even if she is making more than you .Candle maker ,write a book,videos made in the last 3 months .Damn i have a feeling she is making also alot of money .\n       Talk with her ,apologize and ask her about her work ,how did it started ,maybe it was their dream to be candle makers but her parents wanted to go to uni ? \n       Tell her you do not understand about this type of work ,bussiness called and how is she doing all that stuff ? \n      Tbh i also cant imagine making a living from candles but there is a market for it and the candles that are made are from Fairry tales !!  I bet one of her candles are worth 30-50 dollars minimal .If there are clients that like to buy then she can easily make 200+500 dollars in a day and 1 kg of that stuff is what ? 10-15 euro if i remember good.\n     I have also a candle that looks like an old tree with a face and i found it at a second hand ,paid 1 euro  but i know new one ( this one wasnt used ) would be in the 50-100 euro easily .,i think", "YTA - She is living a cool independent life doing things that make her happy. Your standards of what an adult should be are antiquated. Let her live her life. She seems rad af.", "YTA. A really jealous AH, too.", "YTA.  Define \"real job\".", "Of course YTA. No ifs, and or buts. Do better as a friend", "I didn't even need to read all of this. YTA. You are a bad, unsupportive friend.", "Sp you have a real job, which doesn't let you have fun or do the things you want to do.\n\nShe has a job that she can live off of and has time to do the things she loves.\n\nAnd yet she needs to grow up? Seems like you need to take a good hard look in the mirror and decide what kind of a human being you want to be. A slave for the 1%, or someone who enjoys life to the fullest doing what they love. \n\nIf you love your degree, use it. She obviously doesn't. You don't have to use your degree, sure it helps usually but it's not mandatory. People change their likes and dislikes, she found something that works and it's doing well for herself.\n\nYTA, grow up and relax a little.", "YTA\n\nYou don't pay her bills, she is not requesting your assistance and she is not struggling, what makes you think you have the right to say these things to her? \n\nI hope she cuts you off, you sound like a bitter jealous person.", "YTA .  You are a hot mess of judgements.  If she is happy and able to live, what business is it if yours what she does?   \n\nApparently she gets more satisfaction and a healthier outlook doing what she does than you doing what you do.  \n\nDo less judging.  Do more living.  And stop believing that you need to climb whatever bullshit corporate ladder is laid out before you.", "Careful, your jealousy is showing. YTA.", "YTA\n\n&#x200B;\n\nYOu are just jealous that she is more successful than you are.", "YTA you were just jealous and everything you said stemmed from that. Lmao be for real, you’re just made you sold out and she didn’t and is doing just as well if not better.", "YTA, real friends don't shit on their friends when their friends are happy. Who are you to dictate what a real job is when you cannot even get a promotion?", "YTA - Why in the fuck do you get a say in how Ruby spends her time? She does not depend on you for anything, which evidently includes support. Ruby needs to look for better friends.", "Make a few videos and some soap and write a lil book. It's not easy. You're sounding real snobby and sour grapes and you owe your friend an apology.....if you actually still have a friend.", "I swear I have read this exact same post a few months ago...\n\nWether this is a real post or fake.. YTA.", "YTA. Sounds like she's found a way to keep money coming in (regardless of how much its enough to keep her afloat, as you say) whilst doing 5hings that she actually enjoys.\n\nYou sound jealous. I don't blame you though - 8 got a little jealous reading it. Sounds like a charmed life and good on her for escaping the rat race.\n\nThe question here is, do you still want to be her friend? If you do, I'd suggest a bit of soul-searching to find out what the real reason you laid into her was (if it wasn't jealousy) and then give her a genuine apology. From the way you describe it, she was genuinely excited to share her accomplishments with you and you threw them back in her face. So apologise and then focus on being an actual friend to her and support her like it seems she supports you.", "YTA. And not a real friend", "\"Real job\" = job you hate that pays less than you're worth and makes you unhappy\n\nFriend's job = making money doing fun things that friend enjoys doing. \n\nOP, YTA. Your friend is making a living and enjoying herself,  she has nothing to apologize for.  You, on the other hand, are judgemental and jealous.", "Lol she DOES NOT owe you an apology. Yta", "YTA There are plenty of people who make a good living from \"recording a few videos\" for YouTube, with some being millionaires. She is obviously doing well in her candle business and is filling her spare time with things she obviously loves doing. Not everyone wants to join the rat race, and plenty make a living out of it. YTA", "YTA- I can shorten this for you “I’m mad that my friend is enjoying her life doing what she wants and making enough money to be happy so I was condescending about everything she is doing. The end”. It’s appalling that you expect her to call and apologize for being upset that you belittled her accomplishments. Misery loves company.", "You really thought things were gonna go your way coming here, didn’t you? Lol.\n\nLet’s see….she’s able to support herself through self-employment via a business she started. So, she’s a business owner. People love candles. It’s a good money maker. That’s a real job, obviously, especially since it pays the bills. \n\nShe’s writing a book—so she’s about to be a published author. \n\nAnd she’s filming true crime documentaries, which she’ll be able to monetize. Making those kinds of videos aren’t easy. A ton of research and time goes into them. There’s definitely a demand for those. \n\nWhat about this self-made business owner says child? \n\nYTA\n\nAnd ignorant.", "Real friends tell the truth? Then you should tell Ruby that you're jealous of her. Be honest. You're miserable and she's making a living doing something she loves. YTA. The only person who needs to grow up here is you.", "I'm not surprised she told you to fuck off, I feel like doing the same and I don't even know you. YTA. What makes you such a master of career wisdom?", "YTA. Don't hate. If I could do what she does and make a profit I'd do it in a second. Corporate America sucks.", "YTA.\n\nYes you were belittling her businesses. \n\nLet's see, she has a successful business since she seem to be able to afford her lifestyle. Selling \"candles and soaps\" is a very lucrative and growing field of business where you dont even need middleman to sell your products. Sounds like she looks for opportunities and goes for it.\n\n\"she could be really accomplished if she only worked in her profession.\" \n\nLike you are? Ms. \"overlooked for promotion again\", which to me says low ambition, low drive. Are you looking for a new better job elsewhere? Maybe find the position you're trying to be get promoted to elsewhere? I'm willing to bet you haven't even kept your resume up to date. \n\nYou're the type of person that has the toxic crab mentality. \"If I can't have it, neither can you\". Smart and accomplished look for opportunities, they dont wait for them.", "Ya know… if my friend was able to sustain themselves doing things they love, I’d be jealous too… SIKE I LIED\n\ncuz guess what, I support my friends regardless, and only care if they’re happy and safe and growing in whatever they choose to do. YTA", "YTA.  \n\n\nDamn I want to be Ruby so bad. She sounds cool af. Good on her for living her life.", "YTA and a shitty bitter jealous “friend” who needs to get over herself", "YTA.   If she is paying her bills and not complaining to you about lacking money or job satisfaction, then she is succeeding fine.  Your job is to be thrilled that her little \"games\" are working out as a career, not to be judgmental.  She has as many responsibilities as you do. She has bills and is paying them. \n\nIt sounds  like you like her as a friend because she is less successful than you are. When you don't get a promotion and she is happy with exciting ventures,  she messed with the narrative.  She has a small business, wrote a book, and is about to start a Youtube channel. Why do you get to decide those skills and experiences are meaningless? \n\nThis isn't a matter of whether you should tell \"the truth\" or not. It is a matter of you thinking your values matter and hers do not.", "YTA - all labor is real work. You are being classist and incredibly unsupportive. You also have no idea how much labor it takes to get a book to publishing let alone getting a YouTube channel running. And she's making soaps? You should apologize.", "So your friend is successful enough to be living on her own in an economy that currently barely allows us to, and definitely not on a minimum wage job, has written a book and is launching her own series, and all you hear was she's wasting her time and she'll fail? Where did you get any indication that she's failing at anything?\n\nYou're a massively jealous asshole. You live to work, whereas she works to live, and it sounds like she's doing something she loves which lucrative to boot so she probably doesn't even feel like she's working. You, on the other hand, are the one hating you're life right now so you're taking your jealousy out on someone who you supposedly care about.\n\nYou need a reality check and you need to be a better friend. YTA", "Yta she's not asking you for money or expressing any money issues so it's clearly not an issue.\n\nSeems like you just have a huge case of jealousy that your friend is cool, brave and creative.\n\nShe deserves better than you.", "YTA and Ruby sounds like a ton of fun. I’d love to get coffee with her.", "YTA you don’t know her finances. She may be doing great. Besides she’s not asking you to pay her bills so why is it your business.  I always wonder about people who say “friends tell each other the truth”.  Would you be ok with hearing other people’s truth about you?", "So much AH’ery in your post.  Wow.  Just wow.  Hopefully your friend distances herself from\nyou and has other friends who respect her choices and aren’t just waiting for her to fail.", "So she should spend her time like you, being unappreciated in a job where she's miserable, because it's what adults do? None of her \"little\" ventures sounds like they're failing, and she's making a lot more than minimum wage if she's living alone. It sounds like you're jealous. You followed the traditional \"right\" path, you keep getting passed over, and you're unhappy. You don't like hearing about her success, so you denigrate her accomplishments. She's running a successful business and pursuing other artistic interests. Sounds like a great life. Stop being sour about it and do something about your own situation if you're unhappy. YTA.", "YTA. How does it affect you whatsoever how she makes ends meet? With a “friend” like you who needs enemies?!", "YTA. You can't have possibly meant well. If you actually meant well, you'd have been much kinder and non inflammatory. \"That sounds really exciting, I'm glad you're happy! Have you thought of talking to anyone about making a plan so that you can keep it up long term? It would be great to make sure you can keep it up!\" ... and then maybe recommend a financial planner or something actually useful. You're not a friend. You ought to do some thinking about why you need your \"friends\" to fail or be miserable in order to feel better about yourself.", "YTA: \"not belittling\" ----- and then use the words, \"few\" \"wasn't that big\" \"selling short\" which of these isn't belittling??\n\nIf your friend is happy and enjoying her life she is doing better than you.", "YTA OP\n\nyou are nothing but jealous.\n\nLets see here your friend.\n\nLives on her own and supports herself just fine with her business. She is also about to be a published Author. You do know that it is a profession to run a business and be an author right?\n\nYour friend or soon to be ex-friend she is living the life she wants and she makes a lot of money.\n\nYour husband is correct you are in the wrong and you should have kept your mouth shut. You are showing your jealousy and had to belittle her accomplishment. You should have congratulated her and been happy for what she wants to do.", "YTA. Some of these you tubers make millions! For true crime videos! And while most don't... I know a guy who makes $40,000 a month  just for playing on Tik Tok!!  I also know some you tubers who makes hundreds... Very helpful in today's world.", "Yta how is that even a question.", "YTA, and/or fake.", "Yta. \n\nThe only time waisting happening here is you accepting misery instead of finding ways to be happy in your own field so you need to bring her down due to your own jealousy and ignorance.", "You’re so much the asshole OP that I almost wonder if this isn’t a joke post. Because you’re that villainous.", "YTA. She's an independent adult living her life and enjoying herself. She wrote a book and your first thought was that she should've held back on her own success, and then that \"her little ventures\" will fail. Like you sound extremely bitter. She's not asking you for money so stop worrying about where hers comes from. If you want to salvage this friendship you better be outrageously apologetic and blame it on your work blues. Being honest about your jealousy might be the only way to do it.", "Yes, YTA.  Sorry OP, but your friend is happy and apparently, not wanting for cash.  What OP views as accomplishment clearly doesn't match what her friend views as accomplishment.  \"Playing around like a child\" - not OP's concern.  Since when is writing a book considered \"playing around like a child\"?  I can picture OP looking down her nose with disdain.", "Yeesh you're so jealous. YTA.", "> To say that my jaw dropped would be an understatement. This is a woman in her 30s who's still playing around like a child. No real responsibilities, jumping from one thing to another without a care in the world.\n\nThese really truly might be the most bitter pair of sentences I've ever read directly from the source.  OP is *mad* mad that  someone *:checks notes:* has interests other than impressing the fictional overbearing immigrant parents in a 2005-era comedy movie\n\nYTA", "YTA What’s her podcast called? I want to check it out!", "Do you pay her bill's? If her not having a \"real\" job works for her & her life..then why do you feel the need to input your opinion?", "This is obvious bait come on.", "YTA for passing judgment. At one point in time, maybe her path was the corporate/career life, but since getting older she found that something else makes her happy. Maybe the most important thing to her one day is to be a mother, and this career may give her the life/work balance she is looking for.\n\nSuccess comes in many different forms. To you, success seems like how far you can climb the corporate ladder. For many others, success looks like general well being, life/work balance, and family balance.\n\nShe’s obviously smart if she owns her own business. I envy her!", "YTA. You don’t deserve this friend", "Like don't ask if you don't want to know! ALSO don't ask if you only want to hear about her failures... ur not really a friend at all.", "I'm not sure whether or not OP knows this.. But the reason we know what \"candles\" and \"books\" and \"videos\" are is that there are candle makers, authors and videographers.  These are professions (also known as \"real jobs\")\n\nImagine not needing to bitch to your \"much more successful\" friends about being passed up for a promotion AGAIN! because you own the company.\n\nOP needs desalination", "i had my brother call me a few months ago and privately vent about his best friend getting a super cushy 80k a year job for a nonprofit that basically exists to make the wealthy cokehead owner seem like a good person. her “side hustle” is being a food blogger which gets her and her partner free, nice meals 4x a week or so.\n\nhe was complaining to me about how it just sucks to work as hard as he does himself and then see someone do objectively much less work and make a lot more. it’s normal to feel that! but he has the smarts to only express that to me, get it out, then go back to being happy for his best friend", "Also had to laugh at this.\n\n>Honestly, I kind of expected her to keep her success on the downlow considering that I was down regarding my job but she didn't hold back.\n\nAnd then says.\n\n>Real friends tell the truth and I couldn't just coddle her, she needed someone to show her that she's wasting her time.\n\nSounds like there is a reason OP did not get the promotion. But the friend was being a good friend and know OP needed to be \"coddled\".", "That she can afford to branch out into other interests also tells just how well her initial business is doing.", "Jealousy's an ugly color, Bankfarter.", "YTA. The problem with you is you did judge her choices. Just because they aren’t what you would have made, doesn’t make them any less valid. \n\nA better friend would have taken an interest in her ventures, asking her what interested her in pivoting into those spaces. Instead you made some huge assumptions that were clearly wrong and ended up hurting a dear friend.\n\nMaybe it took her until graduation to realize all that hard work she put into her studies were all for naught and she wasn’t interested in it. Or maybe she has a kick-ass business plan for how to monetize her videos. Instead of showing interest in her professional ventures, you looked down on her just because it’s not the path you would have taken.\n\nShe doesn’t need to apologize… you do.", "Not to mention if she lives on her own she is making WAY more than minimum wage.", "Yeah usually you want to be happy for your friends. NOT OP.", "Yeah, but I'm gonna be mad at Ruby if she allows OP back into her life. OP has some terrible opinions about how everyone needs to be miserable in their jobs, put down Ruby's parents (dirt poor instead of don't make a lot of money), and shit all over a clearly successful business that allows someone to pursue writing a book as well.\n\nOP needs some fucking counseling and to decenter herself from her friend's success - that's such a gross personality trait, I wouldn't want anything to do with her again.", "These are honestly pretty funny to read.  \"My friend is smart, fun, interesting, successful, and happy, how do I put a stop to it?\" is legit a pretty well-crafted joke for being made by accident", "OP sounds INSUFFERABLE. Even the tone of her post made her sound like an AH.", "Getting strong \"you're not a Real Adult unless you're miserable\" vibes from OP.", "“I hate my choices. Why do you get to be happy?”", "This, 100%", "Well said", "I’m self employed and making $90 and hour plus $400-$500 a week in tips. I would have laughed my ass off if I were the friend.", ">if you don’t want the answer don’t ask.\n\nIt’s so simple yet, so many people just can’t grasp it. \n\nOP, YTA. If she earns an income it’s a real job.", "It’s not only what a lot of people do, it’s -hard-. I like working for someone else because I don’t need to worry about my health insurance, my retirement savings, or paying all of my subordinates. I trust the person I work for not to run the business into the ground…and I do not have the fortitude to do what Ruby is doing because, again, it is hard! \n\nOp, YTA.", "Agreed. You weren’t truth telling. You were upset that she’s doing well, even though she’s working outside of the box you built for yourself. You tried to tear her down to make her feel as bad as you feel. When instead you could actually be asking for her help and advice since she’s so much more successful than you are.", "but dont you know at 18 all people are handed a set of SLA's and KPIs and if they dont meet them they are failures", "Lol right?! Ruby should stop everything successful she’s doing because you and OP think her endeavours are “childish”. She should join the 9-5 workforce and be miserable and not do the shit she actually enjoys. /s", "Also shows how but actually cares about her if they have not asked them what they have been doing for over 3 months, instead of just talking about themselves.", "OP's birthday party is adding peanut butter to the plain rice cake", "and a 1950s concept of 'real jobs'", "Show me your retirement fund from making soap and going to renaissance fairs.  I promise…nobody that has to work until they die is happy they wasted their youth.  She likely isn’t paying into social security so she won’t even have that.  I see people who live with the results of failure to thrive.  It’s not pretty.  “Earning years” are called that for a reason.", "Not only did she not ask, she EXPECTED her to not mention her success.  Which is crazy, since OP doesn't consider any of what she's accomplished success.  It's just playing around, recording a few videos, making a few candles.  OP didn't want her \"friend\" to talk about what're basically her childish hobbies.\n\nShe fully intended for the conversation to go..\n\nOP:  \"I was passed over for a promotion.  Again.\"\n\nFriend:  \"Well, at least you have a whole career which you worked so hard for because you're a ROCK STAR!  I didn't follow through after school, so now I'm just rotting away at home, slowly starving to death since I didn't get a BIG GIRL, big paying REAL JOB like you, OP.  Gosh, I'm so flippin' envious.  You're so much better than me\"", "Neither you nor Op knows Ruby's finances. For all either of you know, she’s very successful. \n\nSo STFU.", "Even self employed  earn social security or are you saying she dodging her taxes? Based on what basis?\n\nMaking Soaps and Candles are very, very lucrative business if you get can going as it's a consumable product.  People who buy candles and soaps are often repeat customers as candle burn out and soap run out."]}