{"id": 16876, "submission_id": "13dsncu", "title": "AITA for getting a pregnancy craving during a party?", "selftext": "I 29 female am pregnant with my boyfriend Sam 32. Sam and I went to a party for his family. No momentous occasional just a normal family get together. During my pregnancy I have had intense cravings. \n\nWhile we were at the party I told Sam I was craving a slushee. About 30 minutes away. We had just arrived about 20 minutes prior. He said to give him a little while and we’d go get one. \n\nAfter about 30 more minutes I said it again to Sam. He said fine get in the car. On our way there we got into an argument and he thinks the craving could have waited a couple hours. He’s now mad at me we have to leave the party early. We see his family 2-3 times a month sometimes more and I don’t think it’s a big deal to leave when I have a craving. \n\nAITA?", "created_utc": 1683729579, "permalink": "/r/AmItheAsshole/comments/13dsncu/aita_for_getting_a_pregnancy_craving_during_a/", "score": 408, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I think I’m the AH because we had to leave early and he’s mad at me\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YTA. You were in the middle of a family event and demanded he either spend an hour driving to get you a slushy, or leave the party after only just getting there. At the very least why couldn’t you go yourself? I understand pregnancy cravings are tough but it’s hardly a medical emergency. If you were in the middle of a work day would you just dip for an hour because you needed a slushy?", "YTA. Someone will have to explain to me in detail why a craving would need to me immediately satisfied to get me to change my view. Why is this a \"leave now\" and not a \"we will get one when we leave\" thing. \n\nCause otherwise you can use \"craving\" as a eject button for any interaction and it beholdens him to your any whim.  \n\nThere has to be a reasonability element to a request.", "**1) You really want something right now.**  \n\\- It's something you can get any day of the week.  \n\\- He wants you to wait 2 hours.\n\n**2) He really wants something right now.**  \n\\- It's something that happens once a week or less.  \n\\- You want him to wait a week or more.\n\n**Why do you win?**\n\nWhy do you get to decide that his want isn't important and he should wait instead of you waiting AND probably also being able to get what you want just 2 hours later?\n\nYTA.", "YTA.\n\nA pregnancy craving isn't a reason to leave a family event. You had just arrived and immediately wanted to leave. That isn't fair. \n\nIf you were at work and got a craving, you wouldn't just leave 50 minutes into your shift.", "YTA. You don’t have to have everything you crave during your pregnancy the second it pops into your head. You could have waited.\n\nAlso, why couldn’t you go yourself and get it if you wanted it so badly? Why did he need to go with?", "YTA, a craving is something you'd really like to have, not life or death. You acted poorly, like a child, and made both of you go. Why couldn't you go alone?", "YTA\n\nThis wasn't a life or death situation. You could've curbed that craving or waited. And yes, I've had 4 pregnancies with intense cravings so I know where you're coming from. There was no reason to leave just because you \"had\" to have a slushie right then. Also, why didn't you just drive yourself.", "YTA, pregnancy doesn’t automatically make you lose all social grace and personal agency.", "YTA. I've been pregnant, I've had cravings. This is so ridiculous. You could have just gotten one on the way home or possibly just gotten some ice and juice at whoever's house you were at. \n\nCravings aren't a need. No matter how strong, they're a want. And expecting him to leave a family gathering and drive an hour round trip for this is just ridiculous", "YTA.  Just because you get a craving doesn't mean everybody has to drop everything to accommodate you.  If you don't get the slushy, you'll live.  \n\nEven in such a short post, you come off as childish and entitled.\n\nEdit:  I've got 5 offspring.  There's nothing you can tell me about cravings I haven't experienced.", "YTA. Cravings aren’t a necessity—they’re a want. You could definitely have waited.", "Is there a word for pregnant women that’s synonymous with “Bridezilla” for brides?\n\nThere should be.\n\nYTA for not being able to wait an hour longer.", "YTA I've had two kids. I get cravings. But you don't get to demand that your BF leave a get together 20 minutes after you have driven 30 minutes to get there. Yes, he put it off and you were oh-so-not-patient for another 30 minutes. SMDH\n\nIt is a big deal and honestly, seems like a total power play. I would really consider how long he's going to stick around for this kind of disregard for him and his wants.", "YTA. The craving could’ve waited. It’s a slushy, not a meal. You wouldn’t be starving if you didn’t get the slushy.", "YTA\n\n> About 30 minutes away.\n\nThat is objectively too far to travel for a snack.", "YTA. Cold sugar water can be replicated without an hour round-trip.", "YTA \n\nYou would have been just fine without a slushee. Calm down and think about how your affect others with your BS", "YTA - there were 2 appropriate options here: go get your own slushie or wait a few more hours to get it. You’re not going to be harmed by holding off a craving for 2hrs. You don’t get to have every single thing you want just because you’re pregnant.", "YTA an hour round trip drive for *slushee* 20 minutes into a family gathering? And you needed a chauffeur? How are you confused about being the asshole? That’s an obviously rude and selfish demand given the circumstances.", "YTA. Cravings are not an immediate *oh my god must have it now or I will perishhhhhhh* need. Grow up.", "Having 4 kids I understand cravings but I do not understand why you couldn’t solve this problem on your own. You literally wanted crushed ice & sugar. Ice cubes & any kind of juice thrown in a blender would work.\n\nYTA\n\nbtw — it is a big deal to hand your problems to someone else & expect them to fix them. You’re pregnant, not incapable.", "Why didnt you go drive to the store and buy a slushee?  Make your boyfriend leave a family get together because you wanted a slushee.  Sounds like a kid demanding a candy at an inconvenient time.   \n\nA slushee is not a life/death need & your boyfriend is not a slave to obey your every silly whim.  Maybe if you had to inconvenience yourself and drive to buy a slushee, youd learn to curb these cravings.  YTA", "YTA. Very much so.", "YTA, cravings aren’t a medical emergency", "YTA. Your craving could have waited a couple hours, it won’t harm you to not immediately get the snack you want.", "YTA. U absolutely could have waited til the drive home for that slushy. Or you could idk get urself there so he can continue at the get together uninterrupted.  Your pregnancy cravings don’t give you a right to get your way on everything.", "YTA\n\nNot for having a craving, that is out of your control,  but for thinking that your craving is an emergency that must be attended to.", "You’re not T A for getting a craving, but YTA for acting like you have zero control and your cravings should suddenly be the top priority regardless of what else is happening.", "Pregnancy cravings are legit but your timing was awful. Drive 30 mins away after only 20 minutes at the party? I would be pissed too. You could have waited. YTA", "YTA. A craving is a want not a need. You didn’t have an acute case of slushy deficiency, you just felt like one. We’ve all dealt with pregnancy cravings and they’re not fun, but you’re a whole ass adult and more than capable of waiting a few hours to get a slushy.", "YTA. I can’t imagine being so incredibly self-centered to disrupt a family gathering (your husband’s family at that) due to a craving. Please sincerely apologize to your husband, and do better going forward.", "YTA, I've been pregnant, I've had cravings, they suck, but the world doesn't revolve around them. You shouldn't have to make others leave a party in order to fulfill them. If you wanted one that badly, go get one yourself or find a way to get one delivered to you, but don't put others out when getting a slushie is not an emergency.", "YTA. Come on here.", "YTA the world doesn't revolve around you and your cravings.  You're a fully grown adult who can wait.  Or just drive yourself if it's so important", "YTA. 30 minutes away?!! Pregnancy isn’t an excuse to be a selfish jerk, taking him away from his family for an hour. I promise you’ll survive if you quell your cravings once in a while to be a normal, thoughtful human being.", "YTA. You could've tried to create something slushee like with ice cubes and kool-aid in the kitchen.", "YTA. \n\nCravings are not something you need to fulfill immediately. You could have waited.\n\nEta - I’ve had 2 kids. I had cravings in both pregnancies.", "YTA Wow you couldn’t even wait for an hour at least. I understand cravings but at the point you shouldn’t have even shown up.", "YTA.  Gimmee a break.  So you craved a slushee.  Stop blaming everything on pregnancy and acting like it's some uncontrollable thing.  Also, you're not special because you're pregnant.", "Yta. A craving is a want, not a need. You could have sucked it up for a few hours or gone to get it yourself.\n\nYou’re in for a big lifestyle change when you have to put your wants aside for a child who is 100% reliant on you.", "When I was pregnant, I had such intense cravings for mint that every time I brushed my teeth, I had to talk myself out of eating toothpaste straight from the tube. Needless to say, I managed to avoid eating toothpaste for 9 months. You could've waited until the party was over and got a slushie on the way home. YTA.", "There's nothing dangerous or harmful about ignoring pregnancy cravings and I'd think that, as an adult, you might be able to hold out a few hours and grab a Slushee on your way home. \n\nOr, depending on how pregnant you are, there's probably nothing keeping you from getting in the car and grabbing a Slushee if it's absolutely more urgent than spending more than an hour at your in-laws.\n\nFor me, the verdict is, yeah, kinda TA for not just waiting a little longer.", "YTA \n\nCould you not drive yourself? Are you too pregnant?\n\nEven if you could not drive yourself, asking someone to drive 1 hour round trip for a slushee when you just arrived at a family get together is super obnoxious.", "\"I don't think it's a big deal to leave when I have a craving\" read that 10 times, if you still think you're in the right after it then there is nothing we can do to change you. \n\nJesus, it's not insulin - you'll live. YTA.", "YTA. Your pregnancy is not a disability. You did not need a medical slushee intervention. You should have waited.", "YTA", "Yta", "YTA", "YTA. I'm currently pregnant and wouldn't even think about doing something shitty as making my husband or anybody leave party or whatever because I have a craving. You just want to eat something specific, it's not Like you have to or something would happen to you or baby. If you're that hungry eat anything and have slushy or whatever you are craving when you have a chance (iz certainly can wait few days). Really, really don't get that spoiled and entitled behavior.", "YTA. Drive yourself to get a slushee and come back to the party? You should like you're 19, not almost 30 and about to become a mother", "Definitely the AH. Pregnancy does not make it okay to boss others around to get you frivolous stuff.", "YTA. If it was just 5 minutes away and you offered to pick stuff up while you were out - that’s acceptable. But you stayed at the party for less than an hour before you decided to have you and your husband leave his family for a slushee. It’s literally just crushed ice and sugar, why not have a cold drink at the party to try and quell the craving? I strongly suggest you reevaluate your priorities going forward and learn that not every feeling/craving needs an action", "YTA. I had cravings too. But I could wait for an appropriate time.", "Yeah YTA.  Not for HAVING a craving, but for acting like a toddler about it.   I've been pregnant, cravings can be intense, but they're not emergencies.  You could have waited until later, or even the next day.  I can't even imagine leaving a family event (even a minor one) for a craving.  Get a slushee on the way home.", "YTA and entitled.  The world doesn't revolve around your pregnancy cravings.  My sister is 30w pregnant and gets cravings all the time, but that sure as hell doesn't make her inconvenience people.  If she can't get it, she deals.  Have some grace and common decency.", "YTA. Being pregnant doesn’t make you the queen of everything who gets to demand everyone do whatever you want. Pregnancy cravings are strong I get it, but you’re not going to *die* if you don’t get it. \n\nYou are an adult, you are perfectly capable of enjoying a meal and being a polite guest. When it’s time to go home you can get yourself whatever you want. \n\nYour boyfriend is not your slave. \n\nHe deserves an apology.", "Hooo boy.\n\nYTA OP. I empathize, I really do, but... nope. \n\nLook, I'm in my third trimester. Cravings are a real b\\*tch. You hyper-fixate, you can't think about anything else, you want that one specific thing from that one specific place and damn it you want it now.\n\n... but we're adults. We can't just pout and stamp our feet and whine like toddlers and demand our SOs drop everything and leave planned events/wake up at 4am/etc because WE WANT THE THING AND WE WANT IT NOW (Veruca Salt voice). I have Celiac. Do you have any idea how many things I've craved that I literally CANNOT HAVE without it making me extremely sick? Does it suck? Yup. Do I suck it up? YUP.\n\nIt was not okay for you to pitch a fit and demand your SO leave his family party to get you what amounts to overpriced crushed ice and sugar syrup in a cup.", "YTA. Of course you are. \n\nMost of us had cravings when preggers. Most of us understand it's okay to forgo those cravings. You acted very entitled. You are pregnant, not sick, not disabled. \n\nGet in the freaking car and get your own damned slushie or just, ya know, suck it up and get over the craving.", "Yes, YTA\n\nIt’s a craving, it’s not life or death. You could have waited untill you were done at the party. \n\nNext time ask for some ice to chew on", "I’m pregnant rn and don’t force other people to deal with my cravings right in the moment when it is inconvenient to them, that’s selfish imo. YTA. I hate when people use pregnancy as an excuse to boss people around and act entitled. \nYTA\n\nIf this is just a small glimpse into how you act when you’re pregnant I can’t even imagine how you are the rest of the time. He is probably sick of it already lol", "BuT mY cRaViNgS… YTA cravings are just that.. cravings .they are not a life altering situation where you should disrupt events or someone’s life to cater to you.", "YTA", "Yta getting a craving is fine. Demanding you both leave the party to go get a craving is ahole behavior. \n\nYou had 2 reasonable options\n\n1- you, and you alone,  could have left and come back\n2- you wait until the end of the party\n\nYou will not die from not immediately getting what you want.", "YTA as a pregnant woman, I am constantly craving sweets. I also have gestational diabetes and need to control my diet. So I just say no. Cravings are not contractions, cravings are not morning sickness. Not being able to sacrifice a \"craving\" for a little while is really telling of your will power and what you prioritize. Major YTA.", "YTA. Learn some self control", "Why could you not just make yourself a slushee? Isn’t it just juice and ice? Why was the nearest slushee 30 minutes away? \n\nYTA.", "YTA, I have been pregnant and have had the slushee pregnancy craving. It can wait.", "YTA. \n\nIt's a craving, not a medical emergency. You absolutely could have waited a couple of hours to get your frozen sugar water.", "Is this for real? Of course YTA. Grow up.", "YTA. Congrats on your pregnancy but your behavior is 100% selfish and performative.", "You are ridiculous! Craving are wants not needs, yes you could have waited you spoiled brat lol", "YTA \n\nSometimes my pregnancy cravings don't get satisfied because I just don't have time to drive an hour away or I need to cook dinner for my family. Priorities.", "Birth doula here. Try increasing your protein intake. Might help with the sugar cravings. \n\nApart from that, YTA. Why didn’t you go get it on your own?", "YTA. Jeeeesh, lady. I went through pregnancy twice, I had my fair share of craving but I would have never nag my husband about it during a visit to his family. Go and get it for yourself. Pregnancy isnt an illness and absolutely don't give you a free pass to be an annoying ah.", "YTA Cravings are not life or death. You could have waited till you left the party.", "YTA. Take it from a mother of several children….being pregnant doesn’t turn you into a giant infant yourself. Pregnancy cravings come and go, and you don’t have to pander to every one of them. That’s really immature and indicates you must be the center of attention at all times. Not great for a mom who literally will never be the center of attention again if you’re parenting correctly. Good luck to baby daddy.", "YTA.", "YTA and cravings aren't gonna kill you, would it have hurt you to try and fix something for yourself in the kitchen instead of demanding Sam drive you.  I feel bad for Sam.", "I've been pregnant 3 times and yeah cravings are intense. But most of the time I didn't get to have exactly what I was craving but something similar.. Having something similar to your craving usually curbs the craving.. wouldn't leave a party after 20 mins after a 30 min drive to the party. YtA", "YTA, \n\nI know this may be different but I used to be a really heavy smoker and vaper (nic free now!). When I would go to events where that wasn’t welcomed I would suck it up, even though I had a serious addiction and cravings, sometimes getting a headache. God forbid you can’t wait a couple of hours for a slushee of all things.", "YTA. \n\nYou should have gotten it on the way home, not left specifically to indulge.", "YTA. What is this with some of the pregnant ones that thing craving is a thing that has to be solved immediately? It is not. And you are not entitled to demand from others to stop everything to get you what you want. You wanna something? Go get it yourself! You are pregnant, not ill.\n\nI wouldn't dream of doing something like this to anybody while I was pregnant with my son. I think no decent woman would.\n\nShame on you, really.", "YTA. Learn how to drive a manual in the future because if something more serious happened and you needed to drive it, you’d be stuck. \n\nI know how intense cravings can be but the world doesn’t stop for you because you want a slushie.", "YTA, why do you have to cure your craving right then and there? Why did HE have to take you, you're an adult, sure you're pregnant, but you can drive yourself to get a slushee. You sound like a child using illness to get your way.", "I believe we have a princess here.  She couldn't drive herself?", "YTA - your craving could have waited and you know it. As somebody that's gone through pregnancy twice I'd never do that, nor have I.", "YTA. This is a very good way to become a single parent. You are an adult human who can manage to simultaneously want a slushee and also not get a slushee. You may find this hard to believe, but the world doesn’t revolve around you just because you’re carrying a fetus. Signed, someone who has carried four children and managed not to be an asshole.", "YTA and you couldn’t just go to get yourself a damn slushie because…..?", "I’ve been pregnant and had crazy cravings and I’ve never made my bf leave a family event so we could go get French fries.", "You really expect everyone to drop what they're doing and cater to your every want or need while you are pregnant?? You're pregnant, not disabled. If you weren't able to get this slushie yourself, then you should have waited or gone without. It's a craving, not life or death. I have a feeling you're going to be in a for big surprise after you have the baby and the attention is not on you anymore.", "Why didn’t you make a slushee run?", "YTA", "YTA. And this is coming from a woman that craved slushees in their first pregnancy.", "YTA- seriously?!", "YTA, It definitely could have waited.", "YTA\n\nYou're pregnant, and perfectly capable of ordering a slushie by delivery or to drive and get it yourself and return.", "Yta are your arms broken? Go get yourself a slushie. When I was pregnant I had a dream about a Twinkie, I woke up craving a Twinkie. I went to three stores to find one, not my husband. Sure once in a while I’d call him and ask him get me ice cream on his way home from work. But leaving a party, no.", "YTA sorry but your craving isn't an emergency.", "You have a lot of growing up to do before being ready to raise a child, but I guess it’s too late for that. YTA", "YTA. I craved goats cheese the whole time I was pregnant, which I obviously couldn't eat. If I can wait 34 weeks you can wait a couple of hours.", "YTA. When I was pregnant I had a strong craving for French toast. But I was working and couldn't make it until Friday night. I waited a week to satisfy that craving. You could have waited until the end of the gathering or even the next day. Or, use stuff in the house. Get ice water, or juice or something.", "YTA you are acting like a craving is a medical emergency.  You’re not going to die if you have to wait a couple of hours for a slushee.  Good grief", "You're not an AH for having a craving, YTA for expecting your BF to drop everything and drive 30 min to go get you a slushy while at a party with his family.", "Oh lord, YTA. This is ridiculous..\n\nBeing pregnant doesn't give you the right to act like a spoiled brat and pull your boyfriend away from his family, no matter how often you see them. No matter what kind of craving I was having, I never made anyone drop everything they were doing to tend to it.", "You are N T A for having a craving. YTA for demanding it be catered to immediately.", "YTA.\n\nI’m pregnant too and craving slushies but I sure as hell am not interrupting dinner to get one. Sounds like you’re making excuses to leave", " This can’t be real.", "YTA - I get that cravings can be bad, but they are not a reason to leave an event like this. Real life is not a TV show, we don't always get what we want immediately because 'pregnancy craving', that is just not a real world thing!", "YTA ask if you can use the blender crush some ice ans add juice. That will help you till the party is over. Cravings are normally your body saying you need something in the food you crave so just redo said items there", "Yta who is weaponizing your pregnancy to get your way. Please be better you will be setting an example for a humans behavior, please don't raise an entitled human.", "YTA. Being pregnant doesn't give you license to behave like a spoiled brat.", "Info: could you not have gotten Uber eats or something?", "YTA - You sound like you are selfish and high maintenance. Good luck to Sam, having to deal with your crap!", "YTA- think you need to take a moment and see that what you did was wrong.  You wont die if you dont meet a craving,  but you did harm your relationship by being pushy and thinking you are the center of the world. You aren't.  He wanted to see, talk and catch up with his family, you just wanted some sugar coated ice drink.", "YTA\n\nYour craving can wait. It's not a need. Drive yourself to get it if you're that desperate", "YTA. Cravings can be powerful, but they aren't emergencies. You made him leave his family gathering after less than an hour just because you wanted a slushie? Do you not hear how entitled that sounds? \n\nAlso, delivery services exist, if it was really that big of a deal to you.", "YTA. Leaving plans early cause there is something you want to eat is lame. Pregnant or not.", "This is not going to end well.  YTA.", "YTA. Drive your own ass to get your own slushee, don't make others lose out on things they want to do just because you won't control yourself. Pregnancy isn't an excuse to be an inconsiderate asshole.", "YTA\n\nAnother pregnant woman thinking the world revolves around her, your craving for a slushee doesn’t trump family time\n\nYou could have ordered a slushee, made something to pacify you til it was time to leave, yet you chose to do literally nothing but complain and insist that your itch for ice and syrup was the most important thing\n\nYou sound insufferable", "YTA - I have been pregnant.  You're an adult, you're not a zombie.  Cravings can be controlled.  You aren't an asshole for getting a craving, but you are an asshole for insisting that it be acted on immediately", "YTA. You definitely could have waited. Or at least taken the car yourself and let him stay. It seems awfully convenient that you only got a craving once you arrived to his families house. Do you just not like them?", "YTA \n\nI don't understand pregnant women who thinks the world revolve around their pregnancies. I've been pregnant 3 times, and I've changed my tires, did the lawnmower, the snowmower, repaired the washing machine, did some renovations in my house and much more. \n\nYou're not special because you're pregnant. Pregnancy isn't special. Suck it up next time. Or go there yourself.", "Why can’t you take yourself to go get one?", "YTA.. pregnancy doesn't give you the right to be a diva. You're not gonna die not getting a slushie..selfishness is not a symptom of pregnancy.", "YTA pregnancy cravings are just that, cravings. They are not a need, they are a want. How incredibly ridiculous that you think your every want should be met because you’re with child. Your poor boyfriend. I’m guessing you also wake him up in the middle of the night because “the baby” wants ice cream.", "Go get your own damn slushee", "I once drove 112 miles round trip to get my pregnant wife a Date Shake because she was craving one. But I am still going to say YTA.", "YTA. You would’ve survived a couple hours before getting a slushy. Stop acting like your bf should immediately cater to your every whim just because you’re pregnant.", "YTA and such an entitled one. My god you’re selfish", "You don't think it's a big deal..\nIf he doesn't want to leave it's a big deal to him. I can only imagine how many times a month you're milking this pregnancy to get it your way.\nYTA", "YTA, I’m pregnant and these cravings are not nearly as all-consuming as movies and TV present them to be. You absolutely could have waited. You just wanted to get out of the family party, just be honest.", "YTA you where at a celebration and you just decided to make it about you and your pregnancy. Your cravings could wait 2or3 hours. Being pregnant doesn’t make the world revolve around you.", "YTA. A craving is not something you have to have. He was spending time with his family. You didn't need it that second. Or just go get it yourself if you must.", "YTA, a craving isn't a physical necessity. Also, why couldn't you have driven yourself there and back?", "OP was craving attention, not a slushie.", "YTA, I’m sorry princess but a craving is no reason to leave a party.", "INFO- why couldn't you drive yourself to get the slushi? Could you not have had an alternative sugary beverage to curb the craving until you left the get together?", "yta.  You want a craving , you can get it as in by yourself. It's ridiculous he had to leave his family because you think you're a princess.   It coudl have waited a couple of hours.", "You really couldn't have waited a couple of hours? He already told you you would get one\nYTA", "Reason 231 to never get pregnant:\nApparently, pregnancy cravings are as urgent as a stab wound.. you absolutely MUST have it.. you absolutely CAN’T wait even for few hours, no matter how much adulting you’ve done in your life!", "YTA\n\nA pregnancy craving is not an emergency. Your BF is under no obligation to drop everything to satisfy your craving. A pregnancy craving does not need to be immediately satisfied. \n\nYou are an adult, if you don’t already you know how to manage your desires and delay gratification you better learn fast because the baby’s needs will take precedence over every little whim of yours. Or do you plan to abdicate all parenting responsibilities in the same way you seem to have abdicated decent partner and adulting responsibilities?", "Info: Are you too pregnant to drive?", "YTA….you in the wrong.  You just arrived and had to get a slushy that was 30 minutes away?  Maybe it was just me, but in all my pregnancies, I never needed to satisfy my cravings immediately.  But then I do have a lot of patience.  You sound entitled.", "YTA. They're called cravings not needs. You could have just chilled out", "YTA\n\nhaving a craving doesnt mean you have to get it right there and then. you are a grown up woman and can do without a craving. there are women craving non food items badly, like me with listerine, doesnt mean they go ahead and have them.", "YTA for your behavior to Sam AND for the misleading title of your post. The issue was not you \"getting a pregnancy craving,\" it was treating your craving like an emergency and pressuring Sam into leaving the party over it! I know there is some evidence that pregnancy cravings are often related to what nutrients you need, but I'm having trouble figuring out what part of a slushee was essential to your health or the health of your pregnancy. (I guess maybe you could have had low blood sugar, but surely there was SOMETHING else at the party you could have consumed to help with that.) Being pregnant does NOT turn \"I want a slushee\" into an emergency. You treated a craving like it was your water breaking.\n\nPlease do some reflection about your selfishness before you become a parent.", "YTA. Pregnancy cravings are nice to indulge in if they’re easy to find. But what you asked for was more than just that - it was to dip out of the family meet-up altogether, plus drive a significant distance. Not cool.", "YTA\n\nUnless there’s more you’re leaving out, pregnancy isn’t a disability, and a craving is just a want. Get that yourself or wait.", "If the cravings were that bad you couldn’t have made an alternative. All a slushy is is juice, ice and sugar.", "Did you come on here thinking anyone would really take your side ?  YTA. the slushie could’ve definitely waited. so you asked him for a slushie 20 minutes after being there, then 30 minutes later. you weren’t even there a full hour. the world doesn’t revolve around you just because you’re pregnant. definitely TA", "YTA. Not for getting a craving but for insisting you go get it. It’s ok to not go indulge in every craving. Things like this give pregnant women a bad name, I’ve been pregnant 5x and have never insisted on e leave something to go indulge in a craving.", "YTA, pregnancy cravings don't have to be satisfied. Do you have an issue with impulse control? Drink some juice and get the slushie otw home. Ugh so dumb.", "YTA clearly this was some kind of power trip or loyalty test.  I can’t believe you typed that all out and still couldn’t see you were in the wrong.", "Dang idk…. I’ve never been pregnant but like idk maybe it could have waited the one time", "YTA", "YTA - uh...drive yourself rather than make him miss out on a party?", "Ugh, I can't. YTA", "YTA you could have waited. its a food craving not a medical necessity. Source: i have 2 kids.", "YTA ~ pregnant or not you still have willpower. Why not just admit you didn’t wanna be around his family and used a craving as an excuse to ruin his evening.", "YTA.   Seriously?  You're 29 years old. Grow the fuck up.  Was your pregnancy not getting you the attention you thought it would? I seriously feel bad for soon to be ex and your future child", "YTA. Had two babies and with the first I craved chicken and salad. I could eat it every day if allowed but guess what? Some people don't want to eat that every single day and I'd just not have it. Grow the f up before that baby is born. We don't need more narcissistic parents. You're pregnant, not dying.", "Let’s hope you don’t get GD cause there’s a lot of cravings you won’t have. \n\nYTA (as a currently pregnant girlie)", "YTA.  I realize those cravings can be intense, but to leave an event, drive 30 minutes to get something to satisfy the craving....that's a whole other level of diva-ness.", "YTA. The craving absolutely could have waited. There’s no reason he can’t spend time with his family because you wanted a slushee. That’s unreasonable. Cravings are not emergencies that supersede everything and mean that everyone around you has to immediately bend to your will. It’s was rude and selfish to demand he leave his family get together because you had a craving that absolutely could have waited.", "You’re not the AH for having the craving…it’s an involuntary thing that happens and you can’t control it.\n\nYTA for forcing your SO to leave his family’s celebration in order take you somewhere that was an hour long round trip to satisfy your craving which, in all fairness, could have waited or would have passed, regardless of the intensity.\n\nEdit: typos", "NTA for having cravings, but YTA for expecting the world to bend to them.", "YTA for being a selfish, entitled brat that couldn't wait for an appropriate time to get a treat.  This is toddler stuff now, come on.  \n\nI would have died a thousand deaths before asking this of my husband during any of my pregnancies.  Because I have patience and social sensibilities, and I know my husband is always down for a treat run *when it's appropriate*. \n\nAnd if it was reversed?  If some maniac asked me to drop everything and drive 20 miles for some flavored ice simply because they had sex a few months ago??  That would be a **fight** and no one is getting a slushy at the end of it.\n\nYou're going to be a mother...please grow up, fast.", "Idk I like slushees too and I’m not even pregnant. Only thing I would’ve done differently is I would’ve just gone myself to get it. I would’ve been like hey I’m feeling a slushy rn so imma go get one anyone else want one ? You’re not wrong for having cravings and wanting to satisfy them you just went about it wrong that’s all", "YTA. And I say that as someone who survived Hyperemesis twice and lived by my cravings.", "YTA grow up", "YTA. That's spoiled princess behavior, not grown woman behavior. And yes I've had a pregnancy with cravings. I hope you get used to things not being about you once that baby comes.", "Cravings that have to happen \"right now\" only count if you are weak from all-day sickness, and can not keep anything but your craving down because at that point you desperately need whatever nutrients you can get(but that has to be able to get to you in a reasonable amount of time.) \n\n\nYou said intense. So you just really really really wanted it, might have even been hyperfocused on it. But you still could have waited until it was actually time to leave the party instead of pestering him until he altered/swayed the plans that you agreed to. If your cravings are really that intense, start taking your own car. YTA", "INFO why couldn’t you drive? Also, was this party for a special occasion that your boyfriend didn’t want to miss?", "YTA. \n\n-pregnant lady", "YTA. Your \"cravings\" are not medical necessities.  Grow up. God.", "another one where reading the title made me think not the ah, but in context yeah YTA.", "YTA", "You could drive yourself or door dash it. Or, god forbid, just not get a slushy...", "Good lord. Pregnancy cravings aren’t a medical emergency. YTA", "YTA.  Jesus christ, pregnancy isn't a line in the sand wherein nothing else matters.  You could have waited 100%.  If recovering heroin addicts can outlast their cravings, you can wait 2 hours for a fucking slushee.", "INFO: How often do you have these intense cravings? Do they happen more when you are with Sam’s family?", "You weren’t even at the party for an hour. YTA. As a man I will never understand what being pregnant is like, but everyone that I have ever talked to about the cravings portion, as a lot of my friends are starting their families, not one of their wives have had bad cravings or anything of that nature. Drink some water, ask if they have juice or a popsicle, chew some gum…but to make him leave the get together after being there for less than an hour to drive 30 minutes to get a $1.99 slushy is pretty ridiculous.", "Yta.  An hour round-trip for a slushie is a long time.  A pregnancy craving is not life-threatening.  And in general, I never ride with someone if I couldn't drive their vehicle.", "That’s crazy, whenever pregnancy is mentioned I would assume all the people here would lift and point their forks and torches against the man, but I was wrong lol, a lot of YTAs here", "ETA because Sam is obviously giving in to your cravings all the time making you think that kind of behavior is acceptable (hint, it’s not in this case).", "YTA. Currently pregnant. You for sure could have waited, you just didn’t want to.", "Ofcourse you don't think it's a big deal, your pregnant and craving something.\n\nIt doesn't matter, or should not matter how often you see his family. Arriving 20 min prior and already leaving at that point... Your bf is right, it could've waited. It's a craving, not a matter of life and death.   \nI honestly don't get why so many pregnant people think their pregnancy is so darn important it trumps everything and everyones feelings. YTA.", "YTA\n\nMan if you can’t wait 30 minutes to have your wants/needs met before getting demanding you’re in for a hell of a surprise.", "Come on. You know you were being demanding. You know you and the baby would absolutely be fine putting off the craving for a little while. You wanted him to drive one hour round trip to cater to you. You know YTA. \n\nThis is coming from a pregnant person. You should apologize. Don’t make things out to be urgent when they’re not.", "YTA. You could have waited until you were heading home. You guys arrived only 20 mins prior to want to leave right away", "YTA. You arrived and after 20 min, wanted him to drive you a half hour for a slushee? He said give him a bit so you bugged him about it again? It wasn’t two minutes away, it was a whole half hour away. It could have waited. And if you absolutely needed it that moment, you could have just gone yourself.", "YTA, craving is just that, not like you can't control your impulse or an emergency,  is not bleeding or a contraction, is just craving.\n\nYou are not 12.", "Yta", "YTA. I am 7 months pregnant and have never had a craving so intense I couldn’t wait until after a get together to get it…you’re using your pregnancy as an excuse to be selfish", "YTA, but only slightly. Pregnant women don’t get to dictate every moment of everyone’s lives just because of a craving. Idk how annoying you have been about this stuff. It’s fair to say he might have been tired of it.\n\nThat being said, I’ve been told pregnancy cravings can be very powerful. The guy should be there to fulfill your requests within reason. 30 minutes away is a bit much tho.", "YTA you don’t need to eat every freaking craving you have.", "Yep, YTA. You also sound childish and self-centered. I hope you're ready for parenthood, because you might be shocked.", "YTA - pregnancy cravings should not require your partner to end a visit with his family early. You could have waited.", "YTA.\n\nYou make your guy leave his family get together for... a suger-water drink. You could have had any other kind of sugary treat to kill the craving. You could have done the adult thing and simply said \"no\" to your craving. You could have ordered in. \n\nBut you up-ended the poor fucker's day to get you something of no value and it's OK because you're pregnant and preggos get what they want? What the hell, princess.", "YTA. I've been pregnant twice and I know what the cravings can feel like, but you can do without whatever you're craving and let your boyfriend visit his family for longer than 30 minutes.", "YTA. You had a craving, manage it. Pregnancy cravings are not an excuse to try to control those around you and you don't have to give in to every craving, regardless of how intense.", "YTA \n29 years old and you can’t handle not having a slushy?\nPregnancy cravings aren’t like low blood sugar. You’ll live.", "INFO \n\nDid you go back to the party after?\n\nCan you drive?", "GFY. You wanted your husband to get a slushee for you that's an hr round trip???", "Lol did you really just leave a party early for a food craving? Just get one after the party on the way home. YTA", "Soft YTA. I’ve been there, girl. There’s a difference between that awful shaky feeling you get when you’re pregnant and too hungry and a regular craving. The first has to be addressed immediately, but the second can wait.", "Yeah, YTA. No doubt.", "Yta you are pregnant not broken, you can wait. I had pregnancy cravings too but the presence of a foetus doesn't mean the absence of willpower", "Yeah, you're obviously TA. Crazy you would need to ask. Your \"cravings\" aren't an emergency. It's ridiculous for you to expect everyone to drop everything because you fancy a slushy and are unwilling to wait and act like it's something out of your control.", "I get that you are pregnant but wouldn't it have been a good idea to ask for the slushie before you left for the party. Especially since you know that the cravings are that intense. He has a right to be upset that he couldn't even stay an hour with his family", "YTA - A craving doesn't mean it's life or death. You could have been polite and waited. \n\nForcing your bf to waste an hour of a family get together to go get a slushy is an asshole move pregnant or not.", "YTA\n\nYou could have waited until the drive home", "As a 7 month pregnant woman who goes through intense pregnancy cravings, YTA. It's not that hard to wait. He was just wanting time with family and you were impatient. You don't have to give into them immediately, if at all. You essentially cost him an entire hour or more of family time for something that's not gonna kill you if you don't get it.", "YTA an on your way to pissing off everyone around you. Power trip all you want but very quickly the family is going to realize you are a Pregzilla making your spouse jump just because. Grow up.", "You’re a child", "YTA, you’re a pregzilla.", "Yta, I get it, I've had 2 kids & cravings can be major, but that's no excuse to be rude about it. Why did you both have to get a slushie? Why couldn't you have gotten one then come back? Why couldn't you wait? You weren't even there for an hour before wanting to leave.", "Yta yta yta yta yta yta yta yta yta", "YTA. What will you do when during midnight you want a specific dish from a specific restaurant that already closed?", "YTA it could absolutely wait", "Good grief, YTA. Contrary to popular belief, the world does not revolve around you because you're pregnant.", "YTA. Just because you have a craving doesn't mean that you need to act on it. You need to be more considerate to the people and events around you. Always acting or making someone act on a craving is incredibly selfish.", "NAH, I’d be annoyed if I were him, but he’s a sweetheart for taking you anyway. You didn’t pressure or force him to take you, and as a pregnant lady, those cravings (ESPECIALLY if you’re anemic) are all-consuming. I’m the same way with my popcorn ice", "A pregnancy craving is not a medical event. YTA", "YTA. Omg I am so embarrassed for you that you actually think we will be on your side. Girl. Grow up.\nImagine thinking you're that important just because you're pregnant. The entitlement knows no bounds.", "NAH. I would have said YTA a few months ago, but I’m in my first trimester and it’s horrible. I can’t eat anything, nearly everything is a food aversion, I’ve lost over ten pounds and I was only 115 to begin with. It’s terrifying. When I get a craving, and it’s something within an hour, I have to rush to get it because it might be the only thing I can tolerate. So, girl, I get you. \n\nThe combo of extreme nausea and hunger is horrible. It’s annoying, for sure, and your boyfriend has the right to be frustrated, but girl - I get you.  Nobody prepared me for how bad first trimesters could be. \n\nI think you should both give each other grace.", "My friend once had a pregnancy craving for capri sun, like baaaaaaaad. So her kind husband ran to the store and brought her the capri sun. When he got back with it she was like meh, I dont really want it. Idk if you’re t a or not nor do I know how my story is relevant to yours, but it’s a funny story to me. 🤣", "My brother would have run (literally) if his wife had a craving and allowed her to act like a spoiled brat if she didn’t get what she wanted immediately! In my case, people were happy do indulge me, calling to see if I wanted something when headed home - occasionally making an ice cream and lemonade run for me, and I appreciated it immensely!  Sounds like she wanted to show his family that she was more important to him", "The closest gas station shouldn’t be that far. Why not get the drink and go back to the party? Seems like the real problem was communications and not the 15 min it would take to get a slush.  Did you or him never discuss just heading back to the party? If you can’t take the drink inside you could sip in on the probably five minute car ride to satisfy your craving and head in when you get back.", "[removed]", "ESH\n\nYou could have driven yourself to get the slushee. \n\nBf could have said “no, here’s the keys. Get it yourself,” but didn’t and then got mad at you for it. \n\nI’m with you that the frequency of hangouts with his family means it shouldn’t have been a big deal to leave early. But since it’s not such a big deal, why didn’t you just do it instead of making it his problem?", "ESH. You two should maybe work on your communication. It’s okay to have that craving and it’s okay to ask your partner. If he says no tho you have to accept that (not ask over and over again) or get that slushy yourself. But he also has to articulate his boundaries and not do something he didn’t wanted to do in the first place and then being mad about it.", "NAH.  People tend to forget pregnancy brain is not a rational brain.", "ESH yes the craving could have waited but he should have communicated that he didn't want to leave the party before saying \"fine\" and arguing about it in the car. Does he often hold his tongue and blow up on you instead of communicating properly?", "NTA\n\nYou didn't demand he leave and get you a slushee this instance, you verbalized your craving. He could've ignored it, yet he chose to react as such.\n\nOP being pregnant is irrelevant honestly. You crave something to your partner, you bring it up later. It's not really that big a deal.\n\nAt the core of it, he **chose** to get upset over something trivial. I understand if it were some super special occasion and it being a special occasion to have dinner with his family, but it isn't?", "Hmm. Thats tough. Was there anything similar to a slushee at the party op?", "NAH never been pregnant but in may family we cater to our pregnant women. I have been on many late night runs for cousins and aunts to get a snack. \n\nI do think you should learn  how to drive manual. It’s super easy. \n\nI think you guys should drive your car going forward in case of emegencies. \n\nI say NAH becsuse y’all see his family several times a month.", "NTA, you are carrying his child for 9 months and will have to deal with labour the least he can do is buy you a slushee when you’re craving it", "NTA pregnancy cravings are legit. That's the least he could while you are caring his child and your body is going through a lot", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI 29 female am pregnant with my boyfriend Sam 32. Sam and I went to a party for his family. No momentous occasional just a normal family get together. During my pregnancy I have had intense cravings. \n\nWhile we were at the party I told Sam I was craving a slushee. About 30 minutes away. We had just arrived about 20 minutes prior. He said to give him a little while and we’d go get one. \n\nAfter about 30 more minutes I said it again to Sam. He said fine get in the car. On our way there we got into an argument and he thinks the craving could have waited a couple hours. He’s now mad at me we have to leave the party early. We see his family 2-3 times a month sometimes more and I don’t think it’s a big deal to leave when I have a craving. \n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "[removed]", "Or just driven herself", "YTA. Be honest, you didn’t want to go to the party and just used an excuse to leave it.", "YTA Who are you, Big Mom? Wait an hour, it's a craving.", "YTA. Cravings are not a dire need. I NEVER would have pulled my husband away from family for something like that. At most maybe \"Hey babe, I'm really craving a slushee, can we stop for one later when we leave?\" He's not a personal errand boy.", "YTA- pregnant woman to pregnant woman : cravings can wait. They aren’t necessary to satisfy right away. Would you make him find a 24hr store to get you a craving at 2am? C’mon be realistic… you can get the slushee on the way home", "Definitely YTA. Pregnancy cravings are not a reason to disrupt life. I've been pregnant with twins and singles, and had cravings, but never used them to force my partner to drive 30 minutes, especially while in a social situation. This whole post tells me you are insecure about your partner's commitment to you, and you are using \"cravings\" as a flex to test him. Young and immature, I assume.", "You are not an asshole for GETTING a craving. YTA  for acting on it. I have had hundreds of cravings. You jaut have to deal. I used to crave whole cucumbers at 2am. Guess what I wait till a store opens and it's not the middle of the night", "YTA and putting unnecessary strain on your relationship as well as your relationship with your boyfriend’s family. Cravings aren’t the end of the world. Your bf must be a saint.", "YTA. I honestly hate it when women get this demanding with their cravings when they’re pregnant. It’s so extra. If you want to have it, you can wait like an adult that you’re suppose to be. And yes, I’ve been pregnant before.", "Girl what? YTA. 30 min away? Suck it up.", "YTA: craving…. Come on. For some reason you wanted to show dominance. It you really just made yourself look foolish. And you emasculated your husband.", "Lol. YTA.", "YTA. Your pregnancy does not make you the main character  100% of the time. Read the room.", "Yta. Grow up", "YTA. Are your feet and hands broken? You can't drive yourself?", "YTA. Listen, I’ve been pregnant, I know how shitty cravings can be. But you’re *also* an adult. And you made your husband leave a gathering with his family—whom he doesn’t see much—so you could get a slushie? \n\nThat’s asinine and you know it. You could’ve either waited and gotten it on the way home, or gone yourself to get it and come back. But no, you made him take you. Ridiculous", "INFO: do you tend to have cravings that require you to leave an event that you want to be at?", "I’m pregnant right now. Second pregnancy. Being pregnant you deserve a little extra kindness from your partner. But you are not entitled to have them at your beck and call. You are taking advantage of your partner and using your pregnancy to do so.", "YTA you made him leave a party early just because you wanted a slushee???????", "NTA, I understand how bad cravings can be", "Yta,  and I’ve had terrible pregnancy cravings", "YTA. Must be exhausting to be the husband", "YTA. Do cravings suck? Yes. Does being pregnant entitle you to getting whatever you want when you feel like it? Absolutely not.\n\nYou are an adult, best start acting like one. Your needs will come second very soon.", "It is a big deal and honestly, seems like a total power play.", "YTA. This was spoiled and childish.", "YTA massively. You don’t need to have whatever you’re craving. You’ll survive. \n\nWhat’s with pregnant people acting like they are the center of the universe? If you wanted it that badly you could have gotten it yourself. You’re not disabled. Not to mention, a slushee isn’t exactly a healthy treat when you’re gestating another human.", "yta. you may not be able to control your cravings but as a grown adult you can control how you react to them. I was pregnant at the height of covid when everything was closed. when I got a craving my option was to deal with it and you know what? I survived", "YTA. Lol, control your shit.", "YTA. If you needed a slushee that badly you could have just downloaded Uber Eats or one of the million other food delivery apps, instead of asking someone at a family gathering to drive for over an hour to get it.", "YTA.", "I’d hate to have you as my partner. Grow up. I have a feeling that you use you having a as an excuse for everything", "INFO: Do you like Sam’s family? Did you want to go to the party? Or was the slushee craving an excuse to leave?", "INFO: why didn't you use grubhub or something?", "YTA. im sorry babe but youre doing too much. its just a craving...if it was like 5 minutes down the road where you easily coudve come back to the gathering then sure but 30 minutes?", "YTA, it is a craving. Not a medical necessity.", "No verdict but I suggest learning how to drive a manual. You state you only have two vehicles with a baby in the way you should probably learn how to operate both just in case. Also maybe next family gathering you drive and take your car to avoid this again.", "YTA - the post of the women these days, like no one else in the world has ever been pregnant. LOOK AT ME... The are two minutes pregnant and they cradle their stomach like the are carrying the christ child, asking the spouse to drive 30 to 120 minutes for their craving. Grow up. You're pregnant, like millions of women before you. You could have lived an hour or two without your slushie. I bet if you were at your friends or families gathering the craving wouldn't have been near as strong.", "INFO: so you not have access to skip, or Uber? Because you can just order that shit.", "YTA - the baby is going to be fine if you don't have a slushee right this minute.  Act like an adult, you're abusing your pregnancy to get your way with your BF, and it's not a good look.  You made your craving everyone's problem here.", "YTA", "With so little willpower I'm shocked you can even get out of bed in the morning. YTA.", "YTA. Being pregnant doesn’t mean the world revolves around you and your cravings. I’ve been pregnant, the world would not have ended if you had waited two hours. I’m sure the host would have crushed some ice and added pop to it for you. You just didn’t want to be there, at least own it.", "YTA. The way you are phrasing this is a bit manipulative, too. Of course you're not the asshole for having a craving. You want people to feel like they're invalidating your feelings if they call you an AH, but they're not. The craving is not the problem. It is how you chose to deal with it that is. YTA. You had better choices you could've made. That's been covered adequately by others. I'm awarding you extra AH points for trying to emotionally manipulate us.", "Info: how intense are these cravings? do they jeopardize the health of you or your baby? \n\nJk, YTA.", "YTA", "YTA, i've been through pregnancy cravings and while they are real, they go away without detriment to yourself or your child. And 30 minutes drive for a craving is ridiculous", "This reeks of attention seeking behavior. YTA.", "Do you think only pregnant people have cravings. Suck it up. It’s not life or death.", "YTA. I have kids and never made my husband leave or drop what he was doing to get me something I was craving. Also why couldn't you have driven yourself? Are you incapable of driving?", "Have all the cravings you want, no one cares.\nBut a \"craving\" does not equal a medical emergency.\n\nBeing pregnant is not an excuse to push to have your own way, having zero consideration for your partner.\n\nYTA.", "YTA. A craving is a want. Not a need. \n\nIt wouldn't have killed you to wait until after the gathering to get one. You were extremely inconsiderate to start pestering him less than 30 minutes upon arrival. It is a big deal to leave just for a craving because, once again, you were being inconsiderate and selfish. The world doesn't stop turning just because you're pregnant.", "YTA you can’t drive when your pregnant? 🙄", "Y’all are all acting wild. My mom had cravings and they were ignorable. She kept her common items in the home and didn’t worry to much when she didn’t have them. My sister had cravings and when she had one she would get physically sick at the sight/smell of anything that wasn’t exactly what her craving was until she satisfied it. It was wild and she was very frustrated because of it. Luckily it was mostly salads and the ones she wanted took 30s to make and took nothing to keep on hand. \n\nJust because you had cravings that weren’t a big deal doesn’t mean this person is the same. ESH because I’m sure there was a work around that didn’t involve leaving that early but if y’all go that often it wasn’t that big of a deal to leave and he could have given you a timeline for leaving so that you could cope. I would also recommend you learning to drive his car for future needs like this.", "Kind of couldn't ask for food there or something", "YTA you wanted a slushee. You didn’t need one. His family is more important to him than a slushee. Understandable that he was upset that you made him leave for such a silly reason.", "So what are you going to do when you have important responsibilities with this child and maybe you're pregnant again and you start craving something. Are you going to not be able to make doctor's appointments because you needed to stop for a snack 30 minutes away. Is your kid going to be late for school because you had a pregnancy craving. It's one thing to manage your own schedule money and time but your parent now.  And it's more than just being a parent you are a partner and you have family. You aren't baby anymore. I understand how intense and crazy hormones can be during pregnancy I've been there myself. And I totally understand cravings, it was a nightmare for me to throw up everything I ate for an entire 9 months and only be able to eat the two or three items I was craving and having to ensure that if we went anywhere I would have something that I wasn't going to throw up. I get that. But it really seems like you're putting yourself first and foremost which was probably fine when you were young and single and carefree but you're a family now. You can wait, and you're going to have to learn to do that real quick cuz you got a baby coming.", "This is why a lot of people find pregnant women obnoxious. YTA.", "YTA. I got my own stuff when I was craving while pregnant with triplets after 4 years and many failures and miscarriages. You can take care of yourself and not force BF to miss stuff. If it’s such a desperate need, get in the car and get it yourself.", "YTA\n\nI am pregnant, and having a craving doesn’t mean you need to act on it at the inconvenience of others. Why didn’t you just wait? What do you do while you’re at work, just get up leave? I bet not!", "YTA not for having the craving, but insisting on satisfying it right then.  You're an adult.  You can ignore food cravings, even strong cravings.", "YTA. I’ve spent the past three years popping out kids. This is entirely unreasonable.", "YTA. Grow up. You didn’t need a slushy that bad. I’m 8 months pregnant rn and can’t imagine being this selfish because I want something.", "Why couldn’t YOU just drive there and drive back?", "YTA. You could have gone yourself since you’re the one that wanted it or acted like an adult and waited until you left. I’ve had 3 kids and you won’t die from not having a craving. Real life gets in the way sometimes", "YTA - being pregnant doesn't mean you get a blank check to be entitled. He has to wait weeks because you couldn't wait hours. Be kinder to your other half.", "YTA\n\nPregnancy is not an excuse to have no self control. You could have waited.", "Yikes YTA", "The song Pregnant Women Are Smug is in my head now thanks ro you. YTA.", "Mom of 3 here, & had tremendous cravings with all 3. Cravings will pass, & they're common. They're not the end of the world, & you're not going to die from them. You could've waited longer & grabbed a slushy on the way home instead of making your boyfriend leave early because you acted like an entitled brat.\nYTA.", "YTA for sure! I was where you and I for sure dealt with my own cravings. You wont die from not having a slushee and I highly doubt your baby would have been hurt.", "YTA. Pregnancy is not a license to do what you want when you want, regardless of other people. Believe me, I understand pregnancy cravings. My big one was for store-bought, blueberry muffins (like the ones that are weirdly, sweet and shiny on top). I had to wait a week to get my muffins. Did I cry when my husband handed them to me? Yes, yes I did, because pregnancy is weird. But I did not demand that anyone drop everything to go buy muffins just because I wanted them while pregnant.", "YTA. You are not two years old.", "As a Husband to a currently pregnant wife, yes YTA. The world doesn't revolve around you and your cravings. If there was a gas station right up the road where you could get a slushie then cool but to make your husband leave a family gathering 20min after you guys arrived over something that could have been gotten at any 24hour gas station on the way home is a bit of a AH move", "YTA\n\nYou're pregnancy doesn't make the world revolve around you.  And if getting a slushee was that important, why didn't you drive yourself?", "YTA.  Get over yourself. That’s ridiculous. Being pregnant does not give you the right to order Eppley around like that. We all had cravings when pregnant and you don’t die if you have to wait. \n\nYou give pregnant women a bad name with your Princess attitude.", "YTA - a craving can wait ffs!", "Pregnant women are irritating and I say that as someone that's been pregnant. The world doesn't stop because you're craving something. Pregnancy also isn't a disability. Drive yourself and get your own slushie, you toddler.", "Why would you even drink a slushee while pregnant? The baby is going to absord all that shit", "YTA. Look, I think pregnant women are to be revered, and when they have a craving, the dad is supposed to do something to help. But not drop everything almost immediately like in this case. “CHANGE OF PLANS, SAM! KISS YOUR MOM BYE-BYE BECAUSE WE’RE GOING TO KWIK-E-MART RIGHT NOW!” You could have easily waited.", "YTA During the last month of my pregnancy, I was craving a gyro, the closest greek restaurant is almost 2 hours away. Two years later, I'm still craving that gyro. Cravings can be ignored.", "YTA! You’re about to have a baby but you are behaving as if you ARE one! Grow up! Everyone gets cravings.", "Diva", "YTA. Maybe I’m biased bc I never had desperate cravings like people describe so I assume you can exert some self control. Your slushee could wait. \n\nThe bigger concern is you saying that since you see his fam 2-3 times a month it’s not a big deal to just up and leave. This shows the lack of value you have for your boyfriend’s family. Not only did you give him that impression by harping on your slushee, but you proved it by saying that in your post. \n\nYou are going to be seeing a lot more of this family after you have this baby because they’re YOUR family too now. You need to reevaluate the respect you have for their value in his life. (And yours)", "YTA. You actually typed this all out and hit post.", "YTA it was a want not a Need. \n\nYou could have waited if you had either a little bit of self discipline or if you had any regards for your husband’s feelings.\n\nNot even gonna touch just how rude it was to everyone else there as well.", "yep, yta", "YTA\n\nI had really intense cravings during my pregnancy, during lockdown. Know what I did? Sucked it up. I researched what the craving could indicate I was missing in my diet and tried to supplement that way.\n\nCravings whether pregnant or not are just cravings. Not having a slushee the instant you crave one isn’t going to have any effect on your health or your child’s.", "I wonder how you are going to react when your hubby is craving a bj tomorrow night? Or the next night? Is 30 minutes enough time to wait to ask again?\n\nYTA", "WHY couldn't you drive yourself and he stays?", "YTA, honestly all pregnant women can be brats. I am including myself in this. Next time go alone and come back you didn’t need him to go with you.", "Yes YTA. You don’t have to satisfy every single pregnancy craving the second it hits. That’s just ridiculous entitled behavior. Do you satisfy every single craving instantly when you’re not pregnant? If everyone did that we would all weigh 500 pounds. If you get a sex craving mid day do you leave work to go get it on? Come on, you know this is absurd. And if you wanted it that bad, go get it yourself. It doesn’t take 2 people to get a slushee.", "YTA and I'm saying that as I'm currently in third trimester of pregnancy with second kid. I had cravings even very intense annoying ones. Never, not even once I behaved so entitled.", "Exactly what I was going to ask.  After constant nausea & 3 x daily vomiting for 5 months, I had intense cravings for the remainder of pregnancy with my daughter, but I worked right up until 2 weeks before my due date.\n\nI couldn’t just get up from my desk and drive into town to get a satsuma/porridge/scotch egg/whatever I happened to be craving at the time.  Sometimes it was something I could take to work with me, but often it wasn’t. 🤷🏻‍♀️\n\nOp u/Legitimate_Shop_2621 YTA.  If you knew you were going to crave a slushee, why didn’t you stop and get one on the way and walk into the party with it?", "During my pregnancy I had so many cravings and I really didn’t pay much mind to them. \nI mean intense cravings are valid because I craved seafood all the time but I didn’t need it.\n\nSo I don’t understand how she thought it was reasonable to leave a gathering so quickly after getting there. \n\nLike I really hate the pregnant women who think that they should have special treatment cus they’re pregnant. \n\nOP YTA majorly.", "I was just thinking; it's hardly like incontinence where you have to go NOW! I think it happens too often that pregnant people don't seem to grasp that nothing will actually happen to them, if they don't get what they want, and have everyone tending to their every want like an emergency", "If it were a five minute drive, I think I could see the reasoning behind it a little bit better. But 30 minutes one way? Nope", "There ARE cases where I could see this being reasonable, tho I still wouldn’t have done it. I had something called Hyperemesis Gravidarum during pregnancy, which is like morning sickness times 1000. I was sick 50+ times a day, lost 20% of my body weight. Couldn’t eat, couldn’t drink. I was advised to eat what my body told me it wanted because it had a higher likelihood of staying down. All diet restrictions were out the window for me- if I was craving sushi, malnutrition is much more real than the risk of getting sick. If I craved a sheet cake, I was encouraged to eat the whole thing for the calories. \n\nThat said, I still never ever made my partner leave a family get together for me unless it was to the gas station a block away and I couldn’t wait. This is just lousy behavior on OPs part, if OP had a valid reason to need it asap, it would have been included.", "I’m not sure why some pregnant women feel as if their wants outweigh everyone else’s, such a weird sense of entitlement. Plus, the way she worded it is driving me nuts. \n\nIt’s not “Am I the asshole for getting a pregnancy craving at a party.” It’s more “am I the asshole for making my spouse leave a party early to drive me 30 minutes away to a slushy.”", "Well put!", "I think YTA as well (because it can wait 2 hours to get a slushie), but you're leaving out a huge variable in your breakdown. She's pregnant and dealing with A LOT of physical and hormonal changes. She's basically sacrificing her body for their baby for 9 months (and longer if she's planning to breastfeed). A good partner will absolutely go out of his/her way to help their pregnant partner to feel better when that person is \"taking one for the team\" by growing their baby.", "As much as I hate entitled boomers, I can kinda understand why they call our generation soft when shit like this happens lol.  My mum worked through the end of her pregnancy and my asshole of a father never indulged any of her cravings.  She had to deal with it herself.  Not justifying his behaviour (he was a dick) but this trend of infantilizing pregnant women is concerning.", "We didn’t have my car with us and I can’t drive his. It’s a manual.", "I’m with you. I’m 30 weeks pregnant and the cravings are weird and real. But I don’t make anyone go out of their way for it. And it’s childish for sure. You’re not going to die without it. I can’t just go tell my boss I’m craving a slushee so I’ll be back and get what I want like a princess. Yeah the hormones suck but just because you’re pregnant doesn’t mean you should be catered to.", "I don’t understand why some people are so intense about their pregnancy cravings. I’m almost 26 weeks pregnant. Sure I’ve had cravings where something sounded good/nice. Never have I ever absolutely needed to have it. Most of the time I ignore my cravings, in fact, because a cupcake/burger/mashed potatoes with pickles and mustard are not exactly health food. \n\nThe only time pregnancy cravings should always be indulged are if they coincide with extreme nausea/food aversions (I had some days in the first trimester where the only food I could keep down was an impossible whopper…and I don’t even like burgers, never ate them before getting pregnant). And even then, you get them at an appropriate mealtime/when it’s convenient, you never need to get them immediately.", "I didn’t have my car with me and I can’t drive his car. It’s a manual and I don’t know how.", "Yup. Been pregnant, had cravings, agree with all of this.", "YTA\n\nThis wasn't a life or death situation. You could've curbed that craving or waited. And yes, I've had 4 pregnancies with intense cravings so I know where you're coming from. There was no reason to leave just because you \"had\" to have a slushie right then. Also, why didn't you just drive yourself.", "I agree. I have had 4. Cravings can be satisfied with other things. Things that don’t require leaving. You craved a shlushie? You are craving sugar. Go speak to the future grandma! I bet she had something on hand to satisfy that craving and would probably have been happy to help her unborn grandkid! This was an opportunity to bond with them. Instead you made it look like you hate visiting them and probably really hurt everyone around you. Huge YTA", "Yup. Studies show a lot of pregnancy cravings are psychological and psychosocial. Just because you crave something doesn’t mean you need it. Coming from someone that is 8 months pregnant right now.", "Preggosaurus.", "Pregzilla", "Pregzilla?", "This is that first time pregnancy bullshit.", "Uh yeah fr, when I was pregnant I craved gasoline. Guess how many times I consumed that lol", "YTA big agree, that snack would have to save the baby in order to be worth 30 minutes one way", "Yeah, I've had daily milkshake cravings with this pregnancy for what might be a month now. They're intense. But they're not the end of the world, and I certainly don't make the whole world stop to get me one. In fact I haven't had one in almost a week right now. Pregnant women can still have self control.", "Exactly, I had cravings for ice with both mine like I wanted to eat it 24/7 but i never had my husband leaving family functions or getting up in the middle of the night for to get me ice i got it my self.", "Also what kind of slushee only exists 30 minutes away? Circle K has slushies and you can find one every few blocks.", "There's no such thing as \"too pregnant to drive\" unless you're on doctor-prescribed bed rest.", "YTA. There are a lot of women who can't afford or don't have access to nutritious or healthy foods or even adequate amount of food during pregnancy.  Their cravings take no priority. Your partner is upset because they are concerned about the immaturity and life skills capabilities levels of the woman carrying his child.", "Literally. I'm 7 mo and literally had the meanest craving for choc cake but I waited a WEEK for it to fit it in our budget. There are some times where I don't give into mine bc it would be inconvenient.", "Just curious, but have you tried eating any gluten during pregnancy? I'm only asking because my ex was very reactive to any dairy before pregnancy (would literally be in the fetal position for hours on the couch if some place accidentally put butter on something), and she started craving ice cream (cliche, I know) like crazy and decided to try some and it was fine. Turned out that she could eat all dairy during both of her pregnancies, and for about 4-6 months afterwards. Then she went back to having really bad reactions to it again. We assumed it was due to changing hormones, but never got a good explanation from her doctors. I know gluten/celiac is different, but it might be worth a little experiment!", "Actually it’s been scientifically proven that if you ignore pregnancy cravings the baby grows up to be a republican.", "When ppl on this sub talk about having kids I feel so bad for their future children 😂", "I craved Brie, yep can't eat that when pregnant. Oh well i'll have some after baby is born.... oh I don't fancy it now 😂😂😂", "Exactly! A craving isn't mind control. You don't become a zombie that eats only slushies. What have you done all your life when you were at work and suddenly thinking of a snack? Grow up OP.", "Honestly I’m disabled and I wouldn’t have forced someone to leave a party they were enjoying unless absolutely necessary, especially not a slushy 😳", "Just because you couldn’t eat it doesn’t mean anything for her, she can have her slushee", "This isn't even close to accurate, the human body will cannibalize its own parts to deliver them to the fetus if it isn't getting them. **An expectant mother's brain can shrink by up to 20% if she isn't getting sufficient nutrition.**\n\nMost omnivorous animals get cravings - it is their brain directing their body to seek out what it needs. It drives goats to climb up mountains to lick mineral off rocks. Humans aren't exempt from that - especially when we have such incredibly calorie-costly pregnancies. And the building of a human life isn't something you can stick on stand-by while you humor the in-laws.", "Was it a cup of liquid by the time you gave it to her?", "… too much man", "Hope it was an excuse to get out of the house", "ding ding ding!!!!!!", "Yes, I joke with my husband that I \"wasted\" my pregnancy by never once making him run out to get something I was craving. It wouldn't have hurt to have made him drive to McDonalds once or twice during those nine months. But during an actual get together? No, never! That's never going to be reasonable if it's not a medical emergency.\n\nOP, you have some growing up to do. YTA", "I don’t think there is any such thing. I drove myself to the hospital in labor….TWICE.", "Or ordered one on UberEats!", "Don't you get it? Pregnancy cravings are Royal Edicts that must be instantly obeyed. This was a very particular craving that could not be satisfied by any other sugar-loaded icy beverage!!", "And it was a family get-together.  She's setting him up for a me-or-them dynamic.  I've got a hunch that this isn't the first time she's done this type of thing (possibly for other reasons besides pregnancy cravings), just the first time he get angry.", "Or you're the ah for thinking a pregnant woman would fake a craving to get out of seeing his family. Hormones are wild for pregnant women, so while any other person could decide to ignore the craving, it is significantly harder for pregnant women", "Not every pregnancy is the same though. My sister has 5 kids and even hers were different from kid to kid.", "I had my husband pick me up French fries from sonic around 10 o clock at night. He didn’t check the bag and they gave him tater tots instead. I cried so hard because I don’t like tater tot’s even when I’m not pregnant but despised them during that pregnancy. I told him don’t worry about it because it was getting late but he knew I wasn’t going to eat it and went back and got my fries. He’s a very patient man. \n\nI also cried during my first pregnancy because I just really wanted raviolis and forgot my can opener at work. Luckily, the maintenance department next door (worked on a college campus at the time) used the industrial size one to open it and also gave me a cheeseburger because they were grilling. It turned out to be a great lunch.\n\nPregnancy is weird 😂", "I was 16 weeks pregnant with our twins (had a 4 & 2 yo) & sent my husband to get jarred turkey gravy to put on mashed potatoes ... for breakfast at 6:00 am ... & then promptly threw up after eating it.", "It was funny 😂🤭", "hey now.", "Op said that his car is a manual so he had to go with her if she wanted to go", "😂😂😂😂😂😂😂😂😂 for a craving. So what you gonna do when it's food you can't eat? You know deathly allergies but you crave it? You let \"pregnancy brain\" take over and kill you instead? What a stupid comment. You have plenty of control over cravings otherwise there would be some very poorly or dead women.", "No, wait, I have kids and I'm a very rational woman, is not like pregnacy turn women on wild animals, we are not pets, I was able to work my very stressful demanding rational job until very advanced in pregnancy and did just fine.\n\nIs pregnancy, not a mental issue, and pregnant women are rational, saying otherwise is infantilizing and patronizing.", "I mean he asked to give him some time to enjoy himself, I’m guessing he didn’t think she’d insist again 30 minutes later..", "i'm pretty sure he asked her to wait tell after the party?", "Well he did communicate. But she asked twice in the end like a brat.", "Argument≠blow up. Lemme guess, u’ve never been in a relationship.", "you're right men should be expensive to drop everything and leave a party because his wife couldn't wait a bit to get a slushee since she can't drive herself apparently", "uhmmm miss gurl there is a difference between reasonable „cravings“ and unreasonable „cravings“ \n\nwant some pizza but there is no place that can deliver, only for pick up? reasonable to ask you husband to drive \nwant a slushee that is 30 min away from a location that took 20 minutes to drive? absolutely unreasonable. \n\nand sorry but „you’re carrying his child“ is not an excuse for absolut everything. she can also compromise and ask the husband if they can go AFTER the meeting. \n\nYTA", "What? Mother of 2 here and a craving can wait a few hours just fine. It isn't an actual emergency. Also she can learn to drive stick and take her own self to get a slushee if it is that important. She sounds immature as hell. YTA for sure.", "It’s starts in pregnancy with the entitlement and spans their entire lives thinking others should care and cater to  their children", "I really cannot understand why some women become so entitled during pregnancy. I know everyone has a different experience during pregnancy but I never considered making unreasonable demands. No I’m not expecting everyone to change activities or what they’re eating or leave the house in the middle of the night for food. YTA op", "It’s unreasonable to expect that just because someone is pregnant they should get whatever they want whenever they want. \n\n“Sorry, boss, my pregnant girlfriend wants takeout from her favorite restaurant that doesn’t deliver, I gotta go take care of that.”\n\n“Sorry, bride and groom, I know it’s the middle of your wedding ceremony and I’m the best man, but the wife wants ice cream. Peace”\n\nHaving three children, I understand the strength of pregnancy cravings, but OP is TA here, nobody else.", "If it was that serious she could have gone on her own for it or waited like an adult. Not giving into a craving isn’t the end of the world especially when something more important is going on", "So there’s comfortable and wanting something.\nA lady shouldn’t have to stand for a long time while pregnant. Her need to get off her feet is important.\nThis isn’t the same thing as wanting a specific snack.", "Then no drink for you", "I think you need to start learning how to drive a manual. What if there is ever an emergency and your car isn't available?", "Okay, so? Then you don't get a slushie, or wait until you're on your way home. I don't understand why you cannot grasp this concept.", "Learn how to drive manual!!", "you’re old enough to create life, you’re old enough to wait for a slushee", "Uber it then", "Sounds like it's time to learn how to drive a manual.  That's a life skill.", "Driving a manual isn't hard. I think I had it mostly down in about an hour in a car with a super touchy clutch. (I'd kill it going from standing still to moving, but then I'd just restart the car and try again.)\n\nThe only pass I would give is if you live in a super hilly area like San Francisco or Seattle. That could be a little stressful to adapt to those steep hills.", "Pregnancy cravings are weird and they do create an urge for one, but christ almighty, it doesn't make you an out of control monster who will Godzilla the town if you don't get it.", "I’m on pregnancy 4, and honestly not for each pregnancy but some I’ve had intense intense cravings! That being said… the most that happens when you don’t indulge worst case scenario is sudden hormonal reactions like crying 🤣 (which your still entirely aware is just your hormones in your conscious is funny and not life or death). That being said… yeah it 100% can wait or she could’ve gone alone that was a bit rude to make them go too… pregnancy is hard but a slushee is definitely not a must have in that moment lol.", "I second this. I had cravings of non food items (dirt and chalk). I didn't eat those, of course, despite craving them really bad.", "Is it a boy? Boys make you crave meat", "As a life skill, learn how to drive his car.", "If one of the two vehicles you own is a manual transmission, it is important that you learn the basics of how to drive it. If you have an emergency with your child and it's the only car available, you need to know how to operate it. It sounds like at least his family is pretty rural, if the closest slushie place is 30 minutes away. Emergency services in rural areas can take a while to arrive because it's often all volunteers.\n\nPregnancy cravings are not emergencies. It is fine to ask, but the craving can wait. Your partner is an asshole for not telling you no and then getting mad about it. What is wrong with your relationship that causes him to he feels he can't express his wants and needs. Would you have thrown a temper tantrum, or unpleasantly sulked if you didn't get your way because \"you are pregnant\" . You need to think about this, because you are going to have to postpone your wants many times to care for your child's needs", "I assume this slushie was from a specific place, and you couldn't possibly get one from five mins away?\n\nAre you going to cater to your kids like this? Cause they'll be absolute brats if you do. Or are you going to ask them to be more reasonable that how you acted?", "Have you never heard of uber? Doordash?\n\nIf there was absolutely no other way to get you your slushie you should have waited like a grown up.\n\nDid you want to go to the party at all? Cause it feels to me like you didn't and just wanted an excuse to leave.", "YTA learn to drive it or drive your car since your cravings are so show stopping", "Poor Veruca Salt, it’s not her fault! She wanted that slushee now! She *would* have gotten her own slushee, but no one ever taught her how to work the machine! She already waited a whole 30 minutes from when the craving popped into her head, why can’t anyone understand?\n\nETA: everyone telling you to learn how to drive stick is missing the point. You need to learn to delay your gratification and your outsized sense of entitlement. Many people do not know how to drive manual transmission vehicles, but still manage to not be assholes to their loved ones.", "Did you have a phone? Could you uber eats or door dash? Are you a child who thinks a craving overrides everything? YTA", "It's not hard, you should learn.  YTA.  You could've simply waited a few hours.  There is absolutely nothing healthy in a slushie so it wasn't something your body wanted for the health of your child.  Given that you're about to have  a baby, it's time for you to be a grownup.", "Omg. That’s such a funny excuse 🤭😂\n\nI really thought those were made up memes 😂😂\n\nSorry, almost sorry. This is just so hilarious to me.", "Way to grind his gears though. YTA.", "Seems like that is a YOU problem.", "9 months pregnant here! This is true! You can easily combat them mentally and get your fix later.", "They aren't dangerous to ignore but for both pregancies my mom apparently kept craving chocolate milk (she can't stand the taste of regular milk), she was constantly low on calcium and that was her body's way to make up for it.\nI've never been pregnant but often have low bloodpressure. I know now that if I keep craving salt chances are my bloodpressure has been dropping below what's normal even for me.\nIt never hurts to double check your cravings to understand your body better :)", "This is the one 😂😂😂", "Or Pregzilla..", "Were you low iron by any chance?", "There is when you’re 5’1” and your legs are too short to reach the pedals without your belly pressing the steering wheel 😂\n\nBut I can’t help but assume that’s not the case here", "Eh I am not going to pretend like I know everyone's situations and neither should you.", "I cried over ice cream on Sunday 🤣 Hubs found a gf ice cream place but we had to wait until today to go. SO worth the wait!", "I craved sushi… couldn’t have that either.. and what do ya know.. I survived without sushi (and had it after the baby was born).. \n\nYTA op", "So you’re saying that if she doesn’t get that flavored crushed up ice, her brain is going to shrink?", "Oh yea, her body is totally going to start self cannibalizing from lack of nutrients if she doesn’t get a slushie. \n\nPure fructose and food coloring. It does the body good!", "Just no. \n\nShe isn’t craving a freaking slushee due to some calorie or nutrient deficiency. It was a want.\n\nNo one is saying pregnancy isn’t demanding on the body. But this is nothing other than “I wanted a slushee and demanded to get it because I’m the pregnant center of attention.”", "Lolololololol yeah, no. I’ve been pregnant and I fully understand cravings. There is absolutely nothing in a slushie that’s going to provide any type of nutrients the baby needs. Try again.", "What?", "That seems like a bad idea tbh", "I must have really short limbs, or have been carrying weirdly, I couldn't drive around month 7 or 8 because I couldn't reach my brake pedal with the seat far enough back to not have my bump on the steering wheel.", "How do you not like tater tots? The fuck", "I cried when my toddler dropped my container of white rice when I was like 35 weeks and going to give birth in a few weeks. \nI was so upset and crying and yelling. \nMy boyfriend was like it’s not that big of a deal, and then went do you want me to go get you some more and I was just so emotional I went into the kitchen and made broccoli cheddar rice-a-roni which my two year old ate very well. 😹", "Omg 🤣 that’s so funny but also I’m sorry LOL", "Yes!  Let’s jump to the most extreme example.", "I’m sure everyone is exactly like you.  Because every pregnancy is identical,  an no one has pre existing mental health issue ever.", "It’s called compromise, she’s doing the heavy lifting and is now dealing with intense cravings carrying both of your child. I don’t think it’s wrong to show a bit more understanding and attention to your pregnant partner", "And a craving for sugary chemical liquids isn’t good for the baby so it’s more of a desire than an actual ‘pregnancy craving’ which is when your body requires a specific nutrient/s for the baby’s development and loudly asks you to eat something which contains this nutrient. If she’s craving pure sugar hits she needs to be careful of gestational diabetes and preeclampsia", "Of course. Which is why I said YTA. But I just thought the person above me's \"breakdown\" of the situation was rather misleading. OP and her husband are not on equal footing at the moment. Her pregnancy is very relevant to the conversation, and she should be given deference in some situations because of it.", "Because OP's instant gratification is more important to her than the wants or feelings of her husband and by extension his family.\n\nYTA, OP.", "She was answering a question. Like yeah, she was in the wrong, but this whole thread feels like people taking the opportunity to bash on this woman.", "*unless* the car has a “hill holder” where you can push the brake a little extra when stopped on a hill and you don’t have to worry about rolling backwards when you’re starting. Subarus used to (as in the 1990s) have them they rule", "That’s just the closest place to us to buy a slushee.", "I drive for one of those companies you mention and you really don't want to have a slushie delivered--It wouldn't survive the drive and who knows how long it would take to actually be delivered.", "eh, I never learned to drive a manual transmission because everyone around me had an automatic.  But I wouldn't make my husband leave a party to drive me 30 minutes one way to get me a snack, either.", "eh idk how to drive manual. i think a lot of people in the u.s. dont. i tried to learn when i was a teen but i was practicing with my dad’s car and kept stalling it so he got nervous about me damaging it and the lessons ended. it has literally never come up since then.", ">Preggosaurus rex\\*", "Aye with both my wee girl and wee boy, doctors gave me iron tablets but they didn't seem to help.", "It’s a better idea than delivering a baby at home or in my office alone. L&D isn’t like on television. Your contractions start out gradually increasing in frequency, duration, and pain. When you realize your contractions are regular and moving toward delivery, it’s not uncommon to drive yourself.", "One of the lunch ladies I worked with went into labor. She finished milking all the cows on her farm, then drove herself to the hospital.", "It is, if you crash the car whilst in labour there’s no way insurance is paying you out because you were driving whilst impaired! Not to mention you’re risking the lives of people around you", "For real?!? I guess I never thought about that. I am pretty tall at 5’9” so yeah….that could be a thing.", "I had the same problem, my car at the time was quite small and I’m barely over 5 feet so my stomach was touching the wheel by 32 weeks! My partner’s car must have been configured slightly differently though, I had about 3 inches more room.", "😂 I don’t know", "Tater tots are the worst form of fried potato.", "I’ve been pregnant 4 times; the last one was with twins. The pregnancy stories I have are crazy and almost all of them revolve around food.", "Lol... I asked him several more times to pick up gravy (who knows why ... so weird) he said “okay but maybe you should wait a little bit & try eating plain mashed potatoes”. He wasn’t wrong. The craving always passed. You couldn’t pay me to eat jarred gravy now lol!!", "Don't use pregnancy as an excuse to be an entitled brat.\n\nPre existing mental issues are maybe the reason people behave irrational, don't you think?\n\nI hate the misogyny of treating pregnant women like kids, wtf.", "She chose to be pregnant. Dropping everything for a pregnancy craving is stupid and just seems controlling.", "And you were going to die if you  had to wait an hour or two to get one????  I mean its one thing if you had been at the party for a while but it was 20 min.\n\nso selfish... feel bad for your BF having to put up with this behavior", "YTA still, but seriously, learn how to adult.", "What do you do if you get a slushee craving when none is available, say in the night?", "YTA it wasn't an emergency you could have waited. You sound like an entitled brat!", "Please grow the fuck up before you fuck up your kid.\n\nCravings are not necessities. Pull up your panties and apologize for being an idiot. YTA", "Way to ignore the interesting part of the question about if you’ll raise your kid to be this entitled.", "I hardly doubt the closest gas station was 30 minutes away.", "The point is, you didn’t NEED it.", "Maybe it's a regional thing. I'm used to ordering milkshakes and they're always fine. \n\nI have noticed these services seem to work better in my country than in the us, though, (based exclusively on the complaints I see on reddit) so maybe that's it.", "they own a manual transmission car. it really is weird that she hasn't bothered to learn to drive it.", "I mean my belly is getting bigger so my arms and dexterity are shrinking so I'd say this is the right term.", "I read this in your accent and now need to watch your reality show where you raise your wee babies. Thank you 😊", "If you ever are pregnant again, please try spatone sachets, they are easier to absorb. Literally changed my life", "That is not at all how insurance works. Playing on your phone is riskier.", "It's been a while, but I completely forgot, this was my car I couldn't drive, I was fine in my parent's van, just not my small car.", "My parents had a van where the steering wheel was higher up, I could safely drive that one because my belly went under the steering wheel so I didn't have to move the seat back as much. The car I normally drove was fairly small though. I was also pregnant well before things like adjustable height seats were common.", "Booooooooooo", "Get out", "Youre actually insane", "From 30 minutes away? I'd deliver a slushie 2 or 3 miles away, but not from 30 minutes away.", "i dont think it’s that weird but OP is definitely the AH for acting like a child in the situation", "I must watch this show as well."]}