{"id": 16914, "submission_id": "13e51hi", "title": "AITA for snapping at my aunt who said I wasn't a real doctor?", "selftext": "\nI (35f) am a plastic surgeon, I went through years of medical school and residency but it was worth it,I originally started med school with the hopes of going into psychiatry but surgery really interested me.\n\n the problem started years ago when I first told my family that I was going into plastic surgery because it was what interests me the most, my parents,siblings and bil were all supportive and whenever I felt like giving up they were always there to push me. But a lot of my other family members weren't as supportive, my aunts always made snide comments about it, as well as my cousins, uncles and grandparents on both sides, they were all happy when they knew I was in med school but completely flipped when they found out I was pursuing plastic surgery. \n\nIt annoyed me at first but I learned to just move on from it.\n\nBut recently my cousin (40f) on my dad's side, who's the daughter of the aunt who keeps making comments about my job, done a plc  on nursing and childcare, which didn't bother me I couldn't care less what she does, but my aunt thought I should know everything that's happening with her daughter, everytime I see her she goes on about how smart her daughter is and how amazing she is for doing a plc in nursing and childcare, but the last time I seen her she said something that really annoyed me.\n\nme and my sister were over at her house because she had some hand me downs to give to my nephew, we were all eating when she said \"it's great that she's going into medical school (she's not she doesn't even have the brains for medical school) maybe we can finally have a REAL doctor in the family\" I sat there in silence for a second thinking wtf is she talking about? And then looked at my sister who looked equally as pissed off as me, I snapped back and said \"her changing kids soiled pants doesn't make her a doctor and her knowing how to clean a cut doesn't either, she's not in medical school she's too dumb for that, she wouldn't even last a week before dropping out\" my aunt looked really pissed off and yelled at me for being rude and then she told me I wasn't much of a doctor either, I yelled back at her that I went through years of med school, and residency, and that I'm a licensed doctor and surgeon and that she doesn't know what she's talking about. \nMy aunt started crying and left the room so me and my sister just left, a few hours later I got a text from my cousin calling me a b*tch for what I said and \"attacking\" her mom, I got more texts from other family members and it somehow travelled to my moms side of the family as well, majority of them are telling me to apologise for yelling at my aunt but my immediate family (mom,dad,brother,sister,in laws,girlfriend) are telling me not to, now I'm being shunned by both sides of the family and they're all refusing to talk to me and won't even let me tell my side of the story, so was I ta?", "created_utc": 1683756775, "permalink": "/r/AmItheAsshole/comments/13e51hi/aita_for_snapping_at_my_aunt_who_said_i_wasnt_a/", "score": 82, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I yelled at my aunt and made her cry so I think that makes me the asshole\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA - \n\nOh did it \"somehow\" travel around the family?  \n\nYou can tell them I said to piss off.   And that the plastic surgeon who fixed my 5 year sister's face when a dog ate is,  so now that within a year nobody could tell it even happened changing her life for the better was, IN FACT madam, a REAL doctor.   And so is the \"plastic surgeon\" who put my friends chest back together after her double mast giving her back confidence and her mental health so there!  We're taking those new ta-ta's to Hawaii this year and bringing a happy emotionally healthy friend with them!  \n\nOh I'm so angry on your behalf.", "NTA. A lot of people have an out of date/Hollywood idea of what a plastic surgeon really does within medicine. They think you picked your specialty so you can get rich giving wealthy vain people boob jobs. They forget about all the people that need reconstructive surgery because of car accidents, fires, flesh eating bacteria etc. Your aunt sounds ignorant.", "I feel like I should add that my attack on my cousin wasn't just something random, she's as bad as my aunt, she always makes comments about my job and other things in my life and always has, she's rude to everyone in my family and is just a generally bad person to be around, also before I got into med school she'd go on about how you have to be really smart to get into it (insinuating that I wasn't smart enough)", "NTA. According to your family, accident victims don't need facial reconstruction surgery, huh? They assume that you are just out there catering to liposuction and nose jobs for people with too much money.", "NTA. God I have no idea how people can be so uneducated; plastic surgery is one of the most competitive fields to match into. You would need to be the cream of the crop to even consider it as a field, and your dumbass aunt is shaming you? If I were you, I'd cut out every single family member who supported this shaming and drive away in my Ferrari.", "NTA for snapping at your aunt, I completely understand that\n\nIf your cousin also made those comments, then you're definitely NTA", "NTA. If your aunt and cousin are gonna make snide remarks about your job, which absolutely is a doctor, they don't get to throw a tantrum when you give them a taste of their own medicine, pun intended.", "NTA for going off on your aunt, YTA, though for the strays that hit your cousin who wasn't even involved in this conversation apparently.", "Your family seems toxic. Everyone is the AH, but especially the aunt.", "I wish that you had years ago sat down and shown them the good things you (hopefully) do as a surgeon. Then if they continued treating you badly, you could have limited contact with them, including eating with them. yta if you allow yourself to be in a position to explode (you could have stood up and left).", "ESH, but it's not evenly distributed. Your aunt is toxic as hell. You would have done better to attack her than your cousin, since your aunt was the instigator... but then, she was lying about both your cousin and you, so your reaction is understandable, at least. Your cousin is only involved because your aunt brought her in (and she was willing to be brought) - so she's a bit of an afterthought, for all that she sounds like a piece of work. If you'd attacked your cousin to her face I'd think that was more of a problem, but your aunt ran to her to pull her in, which is just fuckery, and not your fault.\n\nThis is a perfect time to seek some distance. Refuse to apologize. Go off and do your own thing. Work on getting your head free from these family dynamics.", "Aunt can dish it out but can’t take it, pfft. NTA.", "ESH. Calling your cousin dumb and too stupid for school is absolutely the wrong tack even if you were insulted by her mother. There was cruelty in what your aunt said about you, but there was also cruelty in what you said about your cousin.", "NTA at the aunt, YTA about the cousin.  She wasn't there, so let her say stuff to your face before you drag her into it.\n\nNext time, just tell them that you'll never do any work on them, because you'd hate to have their ugly outsides not match their ugly insides.\n\nAlso, I love that you got to do what you loved for a career.  It's rare that people get to follow a passion and make it work for them.  Show them all up by becoming stupid rich.  They can call you \"Dr. Lastname\" and pay the friends and family price - full price plus 40% AH tax - if they ever need your services.", "ESH\n\nHer for being so judgmental about your specialty and you for reacting so viciously and for your absolutely unwarranted dismissal of nursing skills.\n\n.  You could have left off the your assessment of your cousin's intelligence.\n\nAs a surgeon,  you should already be very well aware that nurses play an utterly vital role in every facet of health care and it's inexcusable that you should dismiss that pursuit so callously.", "INFO\n\nWhat is a plc?", "NTA.  Screw those people.", "NTA. So ur a female McSteamy. Hun. You ARE a real dr. Say it with me. The trash just took itself out. Block em. Why would you want to keep these kinds of toxic asses in your life. Your better than that. Block them. And move on. Set boundaries if you want to keep a familial connection. Take it as far as seeking a lawyer to draft a cease and desist if the behaviour escalates. Do NOT keep abusive people in your life.", "NTA!\n\nI'm not sure what kind of plastic surgery you practice, but I got diagnosed with breast cancer a year ago, and my plastic surgeon has been an absolutely phenomenal to me.  Thank you so much for all you do.  A good plastic surgeon is doctor, scientist, and artist.  Thank you for all you do for your patients!", "These comments are ridiculous, and so are those shitty family members. Even plastic surgery done for less \"virtuous\" reasons is still surgery and thus require four years of meducal school and at least one surgical residency to be done competently. \"Yes you're a real doctor because sometimes breast implants are given to cancer survivors\" is a nonsensical statement. Might be a mild ESH becausr there was no need to drag your cousin into the line if fire, but the aunt is worse.", "ESH, two wrongs don’t make a right.", "ESH.  Disrespecting your cousin as a way to validate your choices because of what your aunt said makes you an AH. And you do owe your cousin an apology (and try for a bit less arrogance than what’s in your post) for your insults to her abilities.  Your Aunt is also an AH who, you are correct, has no understanding of what you do nor the trials you have endured to get where you are today.  And, congratulations and bravo, you do vital healthcare reconstructing faces, hands, etc  that allow people to function and live and not be self conscious.", "ESH\n\nYou're all assholes.", "I don't blame you for getting angry, but all you accomplished was to help her play into a victim role. Unless you're going to make the long and sustained effort to change her mind about cosmetic surgery, simply do not engage. Why does the opinion of your aunt matter enough to you to make you angry?\n\nESH including the family demanding that you apologize to her for years' worth of belittling your profession. You worked hard to get where you are, and you deserve to feel proud of that.", "ESH.  I do not blame you for getting angry, but you attacked the wrong person.   Your aunt is the issue and it's messed up to insult your cousin because of your aunts words.  \n\nIt's a bit crazy not to see a plastic surgeon as a real doctor.  There's always stories in the news about even licensed doctors not knowing what they're doing when attempting cosmetic surgery.  That's not something you just go to school for a year and jump into.  \n\nI recommend apologizing to cousin and explaining that you were just hurt and then cutting off contact with aunt.  Hopefully someone had pointed out to her already how much plastic surgery can improve lives.  I'm guessing she just things it's all boob jobs and butt lifts and doesn't think about situations like burn victims?", "Have to say that your behavior doesn’t sound like that of a 35 yr old surgeon.", "NTA for being upset about your family being dismissive about your education. You have every right to defend your accomplishment. Although, I would have communicated my response much different. And although I understand that it may be hurtful that your family doesn’t recognize your profession accordingly, the medical board does.", "I can’t say you reacted in the best way, but I can applaud you for all your hard work, drive & dedication.  Plastic Surgery is NOT merely vanity surgery!\n\nAnybody with any sense or compassion can easily think of countless scenarios where your skills have made a huge difference in the lives of your patients.\n\nI thank you and all people in the medical world for your hard work.", "YTA. My dude, stop punching down.", "YTA\n\nWhy are you letting this silly, delusional woman get you keyed up?\n\nYou've achieved this great thing, but then you put yourself in the mud, slinging insults with your aunt.\n\nI'd send a group text so that everyone gets the same message, something along the lines of, \n\n'Aunt X, I apologize for my words last week. I'm sure you didn't mean to infer that I wasn't a real doctor and I congratulate cousin Y on completing her plc. All the best, your niece OP.'\n\nAnd then never speak of this again.\n\nHaters are going to hate. Jealousy is an ugly, ugly monster, and you will always encounter those that will try to bring you down because they are intimidated by your accomplishment.\n\nDon't jump into that mud pit.\n\nEnjoy your fabulous career and surround yourself with those who like you for yourself.", "YTA It’s really hard to believe based on your behavior that you’d be a plastic surgeon, let alone that you’d be a real doctor. I understand the relieve in your family that they don’t need to tolerate your presence at family gatherings any longer.", "I'm sorry. But I must say I cancelled an appointment with a PS (I am old) when I got a distinct feeling of coldness and took a look at the spa like office. On the other hand I am aware of the fantastic work PSs do with restorative surgery after accidents and birth defects.", "NTA but you're not a real doctor. You're a cosmetic surgeon. \"Ohh but he has a doctorate\" yea that's cool but we all know what we think when we hear doctor", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n\nI (35f) am a plastic surgeon, I went through years of medical school and residency but it was worth it,I originally started med school with the hopes of going into psychiatry but surgery really interested me.\n\n the problem started years ago when I first told my family that I was going into plastic surgery because it was what interests me the most, my parents,siblings and bil were all supportive and whenever I felt like giving up they were always there to push me. But a lot of my other family members weren't as supportive, my aunts always made snide comments about it, as well as my cousins, uncles and grandparents on both sides, they were all happy when they knew I was in med school but completely flipped when they found out I was pursuing plastic surgery. \n\nIt annoyed me at first but I learned to just move on from it.\n\nBut recently my cousin (40f) on my dad's side, who's the daughter of the aunt who keeps making comments about my job, done a plc  on nursing and childcare, which didn't bother me I couldn't care less what she does, but my aunt thought I should know everything that's happening with her daughter, everytime I see her she goes on about how smart her daughter is and how amazing she is for doing a plc in nursing and childcare, but the last time I seen her she said something that really annoyed me.\n\nme and my sister were over at her house because she had some hand me downs to give to my nephew, we were all eating when she said \"it's great that she's going into medical school (she's not she doesn't even have the brains for medical school) maybe we can finally have a REAL doctor in the family\" I sat there in silence for a second thinking wtf is she talking about? And then looked at my sister who looked equally as pissed off as me, I snapped back and said \"her changing kids soiled pants doesn't make her a doctor and her knowing how to clean a cut doesn't either, she's not in medical school she's too dumb for that, she wouldn't even last a week before dropping out\" my aunt looked really pissed off and yelled at me for being rude and then she told me I wasn't much of a doctor either, I yelled back at her that I went through years of med school, and residency, and that I'm a licensed doctor and surgeon and that she doesn't know what she's talking about. \nMy aunt started crying and left the room so me and my sister just left, a few hours later I got a text from my cousin calling me a b*tch for what I said and \"attacking\" her mom, I got more texts from other family members and it somehow travelled to my moms side of the family as well, majority of them are telling me to apologise for yelling at my aunt but my immediate family (mom,dad,brother,sister,in laws,girlfriend) are telling me not to, now I'm being shunned by both sides of the family and they're all refusing to talk to me and won't even let me tell my side of the story, so was I ta?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "[removed]", "ESH but given your comments about how you've been treated over the years I don't really blame you for finally reaching a breaking point with their nonsense.", "NTA relatives who try to play the comparison game risk getting called out. \n\nShe effed around one too many times and found out. It’s science.", "I was going for EAH but seeing as your cousin had been abusing you too in the past, NTA. \nThe real question is why are you still talking to them ? That level of direspect for your profession that took years of dedication and for yourself is pretty mindblowing. I would go NC and never think about them again. Let them sulk far away from you", "ESH for how you spoke about your cousin.", "Write your aunt an letter explaining how her comments hurt you and made you feel devalued after all of the training you did. I would enclose a colour copy of you MD certificate and any certificates from your training but that’s me and I’m petty !!", "NTA It seems like taking a break from your family would be good. You don't need snobbish people belittling you. I can only imagine how badly they diss you behind your back.", "NTA\n\nYou can tell them all to F right off. Their opinions are life aholes everyone has one and it theirs doesn't matter.", "NTA\n\nAnd I would go LC/NC with everyone who takes her side without even asking for yours. Don't go for visits, if they call with any questions about anything tell them to ask your cousin, if they want anything from you, say no. (Remember \"No\" is a complete sentence). But I am petty that way.\n\nThe people in your life that matters knows the truth of the situation, and the rest can go to Hades. If they can't take five minutes to ask for your side, then you don't need them. Blood may be thicker than water, but it still washes away.", "NTA.\n\nA plastic surgeon did my breast reconstruction after my mastectomy. They listened and did everything they could to give me the results I not only wanted but felt like I needed to recognize myself when I looked in a mirror. \n\nPlastic surgeons are doctors.", "ESH\nYou had every right to yell at your aunt and defend yourself, but you didn't need to tear down your cousin to do it", "Haters gonna hate!!! You got into one of the most COMPETITIVE specialties and a fuckin SURGEON. Everyone is going to have an opinion on your life but baby you are making bank and helping people all the time. You getting into med school was a feat, becoming a plastic surgeon is amazing. Even if you became a family doc, pediatrician, internist, etc etc YOURE A DOCTOR. Ya aunt deserved to be put in her place, don’t be guilty for defending yourself!", "Remind them it’s illegal for a nurse to call herself a doctor. NTA", "I don't understand how they don't think you're a real doctor. You cut people up with skill. Do they know plastic surgeons only help with vanity projects? Nta", "My best friend was mauled by a dog and an absolute magician of a plastic surgeon reconstructed her nose and cheek. The very realest of doctors did that work and it was amazing. NTA", "You’re not a doctor? \n\n\nI know people with mastectomies who would beg to differ.\n\nI know people who couldn’t breathe due to deviated septums who would beg to differ. \n\n\nI know people born with physical deformities who would beg to differ. \n\n\nI know people who have been in horrific accidents or were the victims of violent crimes who would beg to differ. \n\n\nYou’re not only a doctor, but you’re doing life-changing work. \n\n\nNTA", "I’m sorry. All I can think about is Seinfeld and “Pimple Popper MD”. 😂😂\nYou are absolutely NTA. Your aunt, and anyone else who chooses to diminish your field, is ridiculous.", "Not a real doctor? I’ve started some online classes so I can pursue a career is medical coding. Just in medical terminology it’s clear that plastic surgeon’s are ESSENTIAL. They save the lives of burn victims, they can help people who have been disfigured and help them reach some normalcy. And even superficial elective stuff is important! If someone wants a nose job or something to make them feel better about themselves, they should! Nobody should feel ashamed for doing something to make them feel better about themselves, and you should not be shamed for helping them . I am sure that you have improved so many lives. On behalf of all those people, thank you, because medical school is difficult and then there’s residency. It’s hard to get through and it’s mentally draining. But you did it! You’re an amazing person for deciding to dedicate your life to help others. Anyways, NTA. The disrespect is disgusting. And like any of them could get through a year of medical school. You’re a badass Queen and don’t let anyone tell you otherwise!", "Sometimes it's best to cut off unsupportive family. \n\nNTA", "NTA. You’re a licensed doctor. Your aunt/cousin are asshats. I’ve dealt with similar shit before, because no one knows what ICU or anaesthetic doctors really do. \n\nI’m just a former ICU doc who now happily anaesthetises for a living. But I can tell you from my experience on the other side of the drapes that there are incredible things being achieved in plastic and reconstructive surgery. \n\nThere are plastic surgeons like this gentleman. Who reconstructed a man’s leg with a 3D printed scaffold to encourage native bone regrowth. \n\nhttps://stories.uq.edu.au/medicine/2021/visionary-surgeon-targets-further-world-firsts/amp-index.html", "NTA. A plastic surgeon IS a doctor, a brilliant one at that. They don’t just do cosmetic surgery, they also repair damaged faces and give women back breasts who have gotten a mastectomy due to cancer, your Aunt is just jealous that you’re doing so well.", "NTA. On top of all the other things your aunt is ignorant about, she seems to think plastic surgeons only do elective cosmetic surgery. Nothing could be further from the truth. A friend of mine was in an accident and suffered some nasty injuries to her face. She felt like she would never be able to go out in public again. After her plastic surgeon was done with her, you could barely tell where her injuries had been. I hope your aunt is never in a situation where she needs reconstructive surgery.", "ESH. You're aunt SUCKS. Being a plastic surgeon is a great accomplishment and she's awful for denigrating that. \n\nBUT instead of calling your aunt out you just... Insulted your cousin. That's an Ahole move too. She wasn't even there!", "NTA, but your aunt sounds like a jealous harpy. You went to school for years to get your MD and then went on for intense specialty training and residency to become a surgeon. You know your worth, don’t let anyone make you defend that. I feel sorry for your aunt, not because you yelled at her, but because she sounds like a small, miserable person who has to tear down others to make herself feel better. Sounds like it is time to cut ties with a toxic family member to me. Thanks for your service in healthcare, it is a tough field and you are helping people everyday.", "Your aunt is jealous so she is belittling you.\n\nYou do not owe her an apology. \n\nNTA Even if you did escalate it somewhat. But after years of med school I reckon you are entitled to be pissed.", "Aloha to the ta-tas!", "A guy in my high school went through a windshield and absolutely destroyed his face. Plastic surgery got him looking almost back to normal.", "Tell your friend to buy an amazing bikini and rock those new ta-ta’s", "*They forget about all the people that need reconstructive surgery because of car accidents, fires, flesh eating bacteria etc. Your aunt sounds ignorant.*\n\nThis right here. So many people focus on the \"cosmetic\" aspect of plastic surgery and don't consider how valuable and specialized their skill set is.", "I'm curious- in the United States, plastic surgery is one of the top earning specialties, up there with neurosurgery and cardiothoracics. Higher probably, because most plastic surgery is elective, so it's a cash business with no insurance to negotiate. Is it different in Ireland?", "Look, you’re not an AH, but you KNOW you stooped too far, otherwise you wouldn’t be here. While it’s understandable that you snapped after so many backhanded comments for so long, you went real low and real hateful—and the words you chose were dripping with ego. It is what it is. They probably deserved it, but you definitely stained any sort of moral superiority that you did have until that point. Probably justified, but the words you chose certainly calls your emotional maturity into question. You can snap without being hateful and mean. ESH.", "I feel like I must add my cousin has also made comments about me not being a doctor and has encouraged her mom and others to invalidate my job, she's also just generally rude to everyone in my immediate family", "I second this!", "I actually regret not just leaving, I acted emotionally instead of actually thinking rationale", "I replied to someone else who mentioned my attack on my cousin, she's also made many snide remarks over the years about my job and other things in my life and has been generally rude to me, my siblings and my mom for no reason", "This is the answer. Cousin didn’t deserve to be called brainless etc…\n\nAunt did deserve a takedown", "I've already replied to someone about my cousin and her being a \"nurse\", a plc doesn't give you any sort of medical licence, it's basically like a construction worker doing safety training, and I reacted viciously because this has been going on for years,constant remarks about me and my job and I just snapped, I might not have had the best reaction but I feel like it was reasonable after years of rude comments by my family", "Plc is a post leaving cert or level 5, I don't know if they have different words for it in different countries but I live in Ireland and its basically a level of education between graduating secondary school/high school and college or university:)", "I'm so sorry for your diagnosis but I'm glad to hear you have such an amazing surgeon, good luck on your treatment and I hope you make a full recovery ❤️", "I do feel like I may have reacted harshly, but my cousin and my aunt are one in the same, my cousin has been rude to me about my job for years and even said before I got into med school that I'm basically too dumb for it. And yeah,they think I just do boob jobs and stuff like that, I was going to originally go for that but I work with burn victims,dog attacks,facial reconstruction.etc", "How many surgeons have you spent time around? As an undergrad, I worked for a neurosurgery department, and the stories I could tell you...", "Didn't know there was a way I had to act or behave", "Agreed. The tone, grammar and spelling are iffy, too.", "That would be a mature way to deal with it.", "The only reason I acted the way I did was because of years of comments and snide remarks about my job and my life and many other things,that was the last straw and I snapped,I didn't act the best but I think my actions and behaviour were slightly justified", "Your comment doesn't make any sense. A cosmetic surgeon isn't a doctor? What? They're literally cutting someone open and preforming a surgery. That's a doctor.", "1,I'm a woman, 2,I'm not in cosmetic surgery I do mostly reconstructive surgery or people with scars,burns.etc, 3,cosmetic surgeons are real doctors", "OP is a woman- so you’re sexist AND stupid.", "Your comment has been removed because it violates [Rule 1: Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_civility)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "I get the breaking point part and agree ESH…but the comments about the cousin not being smart enough for medical school seem needlessly cruel and judgmental.", "Haters gonna hate!!! You got into one of the most COMPETITIVE specialties and a fuckin SURGEON. Everyone is going to have an opinion on your life but baby you are making bank and helping people all the time. You getting into med school was a feat, becoming a plastic surgeon is amazing. Even if you became a family doc, pediatrician, internist, etc etc YOURE A DOCTOR. Ya aunt deserved to be put in her place, don’t be guilty for defending yourself!\n\nALSO your cousin needed to be knocked down a peg or two too 😂 I would’ve said a lot worse if someone in my fam said I wasn’t a “real” doctor considering how much work I’ve put into this shit so far.", "Ooohaas to that ta-tas!!", "Plus, its not like you dont need the same surgery skills to do the boob jobs. Its very much surgery either way.", "In Ireland plastic surgery is also one of the top earning specialties, although is is below Cardiac and Neuro I'd say its definitely in the top 5 paid specialties, in Ireland some forms of surgery are covered by insurance, like when I was younger I needed a reduction and my insurance covered nearly everything we only had to pay for the consultation, I work in reconstruction mostly and not cosmetic so all of the surgeries that I do aren't elective and majority are emergency surgeries, but a lot of insurance companies here will cover emergency surgeries which is absolutely amazing, I think I covered everything if there's anything I missed please tell me :)", "Yeah, I definitely let my emotions get the best of me and didn't think properly before speaking (or yelling) if I could go back and change things I would, I regret a lot of what I said though I think it is justifiable in some sense", "NTA. Honestly, this made me so mad I had to empty my own trash can out. Like another commenter said, they have this outdated idea of plastic surgeons giving rich trophy wives boob jobs when they perform life changing, incredibly complex procedures for people who are genuinely suffering.", "You're both rude by the sound of your post...", "You choose to be a plastic surgeon rather than a real doctor. So why are you so bothered by people pointing that out?", "Family can made you go a bit mad! 🤗🖖", "Ah, that changes things a little. That's more of a justified asshole move then. But in the future, maybe say something more along the lines of, \"the next time I rebuild the breast of a cancer victim/do reconstructive surgery on a burn victim, I'll make sure to let them know I'm not a real doctor.\"", "I'm glad you clarified this. NTA at all!!!!!", "Read OPs comments the cousin did derserve it too bad she wasnt there to hear it first hand.", "So cousin is NOT a nurse, not in Uni let alone grad school. She’s an aid with a first aid certificate. Not even a parametic level of medical training and they think that is more of a real doctor than someone who fixes major injuries.\n\n\nYeah NTA \n\nAnd thank god for plastic surgeons, my son wouldn’t have been able to walk without plastic surgery because his vestigial twin was attached to the bottom of his foot at birth. Definitely a real doctor", "I come from a family of medical professionals and I suppose I’m just surprised that you would allow these people to rattle you so. Make no mistake, I have deep respect for, and knowledge of, surgeons. I just can’t imagine that you would care that much what they think.", "Yes we figured that one out. You sure weren’t taught a way to act or behave. You made that abundantly clear.", "Didn’t say there was…just made an observation.", "I don’t think you’re being honest now. You’re whole post is filled with contempt for everybody but yourself. Being a plastic surgeon isn’t something to be ashamed of per sé but you make it sound like it makes you better than a nurse.", "You are an MD,  any idiot should know that.  NTA", "Yea reconstructive surgery so cosmetic.\" This person is dying we need a doctor\" just because you have a doctorate doesn't mean your getting up. Like a dentist who walks around bragging they're a doctor but we all know dentists aren't doctors", "Exactly. I keep joking with a friend I'm going to get a BBL from some dude in a van.  She does NOT fond me funny and the first time I said it, she begged me to research heavily and find a board certified surgeon lol", ">I work in reconstruction mostly\n\nYou have my utmost respect. I worked briefly as a circulating RN in the OR, and was amazed by the artistry of reconstruction, watching mangled bodies puzzled back together.\n\nYou're NTA in any way, shape or form. Your relatives are lunatics.", "I would tell everyone in your family to fuck off and enjoy making bank. Your life will probably be a lot less stressful.", "For sure. There is some justification in snapping, like I said, and not everyone knows how to control their words when they do. But even doctors have things to learn, and this may just one of those things for you, I think. A) How to keep the mean thoughts in your head. And B) Maybe how to go low-no contact with toxic family? \n\nIt wasn’t exactly right, OP, but it’s just one of those things you have to shake off. I wouldn’t lose sleep over it. Good luck!", "ETA: Intricate af procedures. On soft tissue, sinews, and muscle fibers, which are ridiculously complicated mechanisms. Meanwhile, you have orthopedic surgeons who literally take a hacksaw to their patients. And they are ALSO real doctors.", "Wtf is going on with these comments? A plastic surgeon is a real doctor.", "What is even up w/ this whole \"real\" doctor BS? \n\nCan *you* adequately reconstruct someone's entire face after they suffered horrendous injuries from a brutal accident? Can *anyone* who doesn't have the kind of education and training that OP has? \n\nEven if all OP did was elective, cosmetic surgeries like breast implants and tummy tucks, do you legitimately believe that you could just pick up a scalpel and do the exact same? No? Then why the fuck are you saying that a plastic surgeon isn't a \"real\" doctor?", "They go to medical school? Plastic surgery is a specialty on top of general medicine so actually “more” of a doctor, if you will, than a general practitioner? These comments about plastic SURGEONS who literally reconstruct people’s bodies after trauma are so bizarre.", "Have you had any encounter with a plastic surgeon? Like the first comment,  but mine is first person. Mine built new breasts out of my stomach fat so I could feel normal after my double mastectomy.  He and another plastic surgeon worked for 12 hours. \n\nHe was late for one of my appointment due to a child getting attacked by a dog.  \n\nHe and every plastic surgeons are real Drs.", "wtf is not real about it? they perform surgery", "Plastic surgeons are real doctors. You’re clearly ignorant and have no idea what it is that plastic surgeons do", "You know those moments where you're thinking back to an argument and wish you said something, this is that moment", "It's likely OP is the only high achiever in her family. Jealous family members can be really nasty people. They're like heat seeking missiles trying to find the tiniest target to blow up.", "I assume you're addressing the original poster, not me?\n\nI think it's common for people to get pulled back into earlier patterns when they return to spend time with family. And the training for an MD sometimes eats up so much of the rest of your life that some of the growing up and learning how to deal with people as a grown up lags a bit. It depends a lot on the person, of course. And the specifics - way back when I was working with a med student who used to be a social worker, and darn, she came in with more interpersonal skills than most people get, ever.\n\n(Not an MD, a PhD - Biology, Neurobiology and Biomechanics - who has worked a lot with both premeds and med students - and has a number of former undergrad researchers I've stayed in touch with who are in their residencies now. I may well have gone for an MD/PhD had I not been dealing with a spine injury, but there you are.)", "I'm sorry if I made it sound like I think I'm better than any other medical profession, that wasn't my intention at all, if you're talking about the fact that I don't think my cousin is a medical professional because she done a nursing plc that's because she isn't, a plc isn't a degree and it doesn't give you any kind of medical licence, she's no more a nurse or doctor than a construction worker who done safety training", "You do know I have experience in nearly every specialty right?I had to go through years of training and am able to do more than reconstructive surgery, it's just my specialty, so you don't view people who help burn victims,scar victims or birth defects as real doctors?what is a real doctor?", "Yeah 100% no one knows everything and people are learning everyday, I've learned from this and I also should add im not one to usually let my thoughts (mean or not) out of my head, and I'm definitely going to go low to no contact with them, thank you:)", "because people forget that plastic surgeons aren't just for elective surgeries like breast implants etc. like plastic surgeons reconstruct after accidents and limb attachment etc", "It's funny how every single commenter saying that would fail an introductory biology course, let alone have the academic chops to get where OP is at. Some peoples' stupidity will never cease to amaze me.", "Technically they are indeed and some of them are in the more proper sense too. I’m just really annoyed by OP’s disdain for nurses and everybody else in her post.", "Bonus point for the ones trying to find a middle ground like \"well, OP is a real doctor cause they're not just doing cosmetic stuff\"\n\nLike, you think its less of a surgery just because its for vanity????\n\nThis whole thread is confusing.", "That makes sense.", "Is PLC the equivalent of a CNA in the US? It's a certificate that qualifies you to wipe butts and be apart of a nurse's army of minions?", "Just like  Stew from the hangover \"we need a doctor\" \"I'm a doctor\" \" stew you're a dentist shut up\" a doctor is someone I would see at a hospital saving lives. Heart doctors, brain doctors you know, the real doctors", "No worries! But FYI, I take back the emotional maturity part. 😅 You seem like you’re doing just fine!", "Even elective surgeries aren't necessarily about vanity either. I have a friend who got a tummy tuck after having 4 kids. During her surgery they also fixed a hernia she got when she was pregnant with twins and did reconstruction on her pelvic floor. She's very happy to have a flat stomach and to not pee herself when she laughs too hard.", "You don’t need to put down breast implants to talk up other things done by plastic surgeons. There are strong reasons women will have Brest implants, from reconstructive surgery, to gender affirming surgery, to mental health after being told they’re not “woman enough”. And honestly just because they want to. No one should ever be made to feel less than because of choices they make that don’t affect anyone else.", "I think you're projecting onto OP. Her family has ragged on her for years because they don't understand her specialty. Then they tried to elevate another family member who doesn't even have a college degree to her level of expertise. You're coming across as an AH for saying OP isn't a real doctor.", "Plastic surgeons who only do elective surgeries for vanity purposes are real Doctors.  But I figure noting that many of them actually do much more than elective work is necessary because Somehow some people don’t understand that. I don’t get it either.\n\nI was not trying to state a middle ground.", "OP explained what a PLC is here https://www.reddit.com/r/AmItheAsshole/comments/13e51hi/aita_for_snapping_at_my_aunt_who_said_i_wasnt_a/jjnwjts?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=share_button.\n\nI'm not 100 %sure how it'd compare to a CNA, but it's lower down than a nursing degree for sure", "So me literally saving someone's skin cells and rebuilding them after they were in a fire isn't helping them? And by that logic majority of specialties in the medical field aren't \"real doctors\". Are you a doctor?did you go to medical school?if no then you don't have a say on what a \"real doctor\" is", ">a doctor is someone I would see at a hospital saving lives.\n\nThis is one of the stupidest comments I've seen on reddit.  What about PCPs or pediatricians? They aren't in hospitals saving lives.  They aren't real doctors then? What about all the other specialties that aren't in the ER actively saving lives? Not real doctors i guess according to you.", "OP did the same studying in medical school as every other medical doctor does... I'm not sure if you're a troll or just dumb (or just severely misunderstood how OP's job works, which would indeed make you kinda dumb given how clearly they explained it to you) . OP is a real doctor, she went to medical school... She just chose that as her speciality after med school, the same way that a cardiologist chooses that as their speciality after med school. OP works with burn victims, people who've been mauled by dogs etc. That's life saving stuff. Even if OP only did boob jobs etc, that's still surgery! You still need immense medical knowledge to do surgery like that, just the same as a surgeon doing any other surgery would need.\n\nFor example, I had leg surgery recently. It wasn't life saving, but it helped my quality of life. Was that surgeon 'not a real doctor' because it wasn't life saving surgery and because it wasn't heart/brain surgery?! No... The person that did that is just as much as doctor as OP is!! Plenty of doctors do 'non life saving' things as a majority of their workload, doing solely life saving work isn't what defines a doctor", "I think most of the defense comments are because of the stigma attached to plastic surgery these days. There's still a lot of people who think plastic surgeons exist to inflate the backsides of the Kardashian family. They believe if a person gets cosmetic surgery for a vain reason it's somehow not a real surgery. When in fact anytime you have a surgery it traumatizes the body and there's serious risks involved. So it's highly insulting to say a plastic surgeon isn't a real doctor."]}