{"id": 17018, "submission_id": "13f8uon", "title": "AITA for not making child inclusive plans that someone in my friend group can’t attend", "selftext": "Howdy guys, recently my friend group has been divided on an issue. I have a group of six friends and their significant others from highschool. All of us are in our mid 20s. The only person in our friend group is Jessica, who has two young children and is a single mom. \n\nI’m the only person in my friend group that can host, as my husband and I own a decent sized house and don’t have anything stopping us from hosting I guess. One doesn’t want to host, two live with their parents and can’t, another has roommates that won’t let them, etc. we all live in a rural area so there isn’t really anywhere to go for more than a quick dinner, so someone hosting is the only way we can all hang out really. When I host it’s always later in the day; around 7 pm ish. That’s when most of us are off work. I also have a no children rule for my house, since my dog is afraid of children and I honestly don’t like kids anyways. (My nephew yanked my dogs tail several times so now my dog growls at kids). \n\nI had a gathering last weekend, a dinner time bbq. Everyone was invited; same rules as norm. Jessica asked if she could bring her kids, because she can’t afford a babysitter and since both of their dads aren’t involved at all. I said no, because of my dogs and also because I don’t want her baby and toddler at my house. The last time she brought them she kept trying to push them off on other people who didn’t want to hold them so she could relax. Also her toddler puked on my 5k white couch, which I had to replace. No she didn’t pay for it.\n\nJessica blew up on me in the group chat, and said that I always exclude her. I told her I’m not excluding her, I’m excluding kids. All kids. She’s welcome to come if she finds someone to watch her kids. I also told her she’s welcome to host. She kind of went on about how none of that is possible and now she isn’t talking to anyone. Our group is split, half think it’s my house my rules. One said maybe if she screwed better guys she’d be able to have a babysitter. And two think that I should just let her kids come. To be honest, if it was someone else I would maybe cave. But I don’t like Jessica that much, especially since she didn’t pay for my replacement couch. \n\nAITA for making child not friendly plans that someone in my friend group can’t make it to?", "created_utc": 1683860759, "permalink": "/r/AmItheAsshole/comments/13f8uon/aita_for_not_making_child_inclusive_plans_that/", "score": 1346, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I hosted at my house and have a rule that children can’t attend, and someone couldn’t attend because of the rule. I could be the asshole because it wouldn’t kill me to let her kids come I guess.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Nta bordering on ESH….She should be watching her kids and paying for the property they damaged.\n\nThat being said, the comments about her reproduction choices, is not kind.", "Let’s be real. You are not Jessica’s friend and you make excuses, some semi reasonable and some alittle far fetched. \n\nJessica needs a better friends, but your house your rules. So NTA for establishing rules for your home but YTA ow.", "NTA, you don't want kids in your house and you are free to make the rules. That you weren't compensated when damage was caused by her kids affirms your choice. Also, the friends who said she should screwed better guys are aholes.", ">One said maybe if she screwed better guys she’d be able to have a babysitter.\n\nHonestly, I think Jessica needs better friends.\n\nEdit: Thank you for the award.", "You buried the real reason right at the end when you said “I don’t like Jessica that much”.\n\nNTA for your question because you can absolutely decide who to have in your house. But don’t dress this up as a blanket rule for no kids in your house if it’s not.", "NTA\n\n> Jessica blew up on me in the group chat, and said that I always exclude her.\n\nNo, you exclude *her kids*. She's your friend, not them.\n\n> She’s welcome to come if she finds someone to watch her kids.\n\nHer inability or unwillingness to accept this solution is on her and her alone.", "NTA for having that rule, but reading this you kinda just sound like an asshole", "NTA she decided to have kids, and life changes. You have a few valid reasons for saying no, but the only reason needed is simply that you don't want kids there.", "After that sofa incident…yeah, I’m with you. \n\nNTA", ">To be honest, if it was someone else I would maybe cave. But I don’t like Jessica that much\n\nJust stop lying to yourself and admit it's just because you want ot exclude her.", "NTA. You have valid reasons for why you don't want Jessica's kids there. But, I wouldn't invite Jessica either.", "Honestly ESH. Y'all are bad friends, she is an asshole for not paying for your couch and you are an asshole for the way you speak about her and your obvious intent to exclude her without verbally excluding her is just that - obvious.", "ESH you don’t like Jessica should be at the top, and neither do your friends. \n\nI am not sure Jessica is being an AH actually.", "NTA. Your house your rules. The world doesn’t revolve around her poor choices. 🤷🏻‍♀️", "NTA. You're being a responsible dog owner.", "NTA.  It is a reality of having kids that you will be invited to things that aren't always child friendly.  It also sounds as though she doesn't watch her kids, and it puts you at risk because if your dog bit one of her kids you(and the dog)could be held responsible.  Additionally, she already damaged things in your home.  If she would like things kid-friendly, she or one of your other friends can host it.", ">One said maybe if she screwed better guys she’d be able to have a babysitter.\n\nBoth dudes are homeless drug addicts? If you don't like her and Dave doesn't like her because she cheated on his brother why on earth are you still speaking to her? \n\nNo one's opinion actually matters because it's your house. I would have banned her after the couch incident.", "It’s obvious you don’t like her, which you admit. So I think that already support’s Jessica’s claims that you’re purposely excluding her. And for you guys being “friends”, One’s comment is hella misogynistic and gross. Technically NTA since it’s your home but you all sound unbearable.", "NTA It's your house.", "NTA. Your last two sentences are reason enough for me. Not everyone in the world is going to cater to children, and entitled parents will never accept that.", "NTA - your house, your rules", "NTA, lol. A lot of the Y T A comments boil down to \"HOW DARE YOU INSINUATE THAT THE WORLD DOESN'T REVOLVE AROUND KIDS!!!\" Unfortunately, parents and kids tend to be placed on a pedestal where the rules of being a decent human being don't apply for the most part.  If you swapped out kid with dog, people would unanimously back you.", "YTA, you can not want kids at your house and not be an asshole about it, you didn't though. And you don't need to replace a 5K \ncouch because of vomit, I've worked with restoration for a long time, your just making up stories. Stop being this woman's friend, you admitted you don't like her, she deserves better than you and your snobby friends.", "Is it wrong that I dont care for any of these people?", "NTA, your house your rules.", "Your house, your rules. NTA.", "NTA - It is your right to choose how you make plans. Sucks you cant accommodate everyone. You shouldn't feel like you HAVE to accommodate anyone. Accommodate those you want to attend your plans.", "NTA because if you’re the one hosting you can have whatever rules you want. But I’m glad I’m not in your “friend” group and I’m guessing YTA in a lot of other situations.", "Title isn’t accurate, title should be ‘AITA for doing all I can to exclude someone who I don’t like who is friends with my friends’", "Sheesh you make this difficult! On the one hand, sure, your house your rules. On the other you are at best a shit friend at worse a shit person.\nI feel so bad for your friend it’s so isolating being a single parent and meeting at someone’s house is generally a good option with kids.\nI’m leaning towards YTA cos you make your hate of kids as a personality trait and come across holier than thou", ">One said maybe if she screwed better guys she’d be able to have a babysitter. \n\nLOL. There's your answer right there.\n\nNTA.", "NTA, you don't have to like or include kids, and she's probably jealous that she can't do as much as you all can.", "You do not need to replace a couch because a toddler threw up on it… but like, I think ESH.", "This may be unpopular, but YTA.\n\nWhile it is your \"house\", your \"rules\", and you are not necessarily an AH for setting boundaries, those boundaries, in my opinion, reek highly of entitlement and a hatred for women who are not child-free. Your insistance on bringing up the $5000 price tag of the couch shows it all.\n\nAnd while it does suck that she didn't pay, also hypothetically speaking if Jessica could not afford a babysitter for a night, then what made you think she'd be able to pay for damages on a couch that expensive?\n\nTo get to the crux of the matter though for why YTA, see below:\n\n>**I told her I’m not excluding her**, I’m excluding kids. All kids. She’s welcome to come if she finds someone to watch her kids. I also told her she’s welcome to host. She kind of went on about how **none of that is possible** and now she isn’t talking to anyone.\n\nJessica already let you know she cannot afford a babysitter, nor can she host. Those are not viable options for her. While you already, technically, in the clear for establishing your boundaries, you are not in the clear for lying. And that first statement \"I'm not excluding you\" is a bold faced lie if you know there is no other way for her to hang out with ya'll and meet the requirements of your rule. Want what you want, but you don't get to want what you want while not calling a spade a spade.\n\nDo the right thing. Tell Jessica it isn't working out. Stop stringing her along and lying/guilt tripping her. As many people have pointed out she needs better friends that are over all the cattiness and don't make judgemental, petty offhanded comments about her person.", "If you don’t want her there, just say that to her privately. Tell her you don’t like her. However, you absolutely are allowed to decide who can and cannot come into your house. Also, I’d be pissed if i had to replace a $5,000 couch as well, so I can understand that and the dog thing.", "[deleted]", "NTA. I was the first to have kids in my friend group. All parties, no matter who's home, were adults only. House rules are up to the host.", "NTA - I can’t believe someone can’t find a sitter for a couple hours if they want to attend an event.  \n\nAnd it’s your house, but you could put the dog up in your bedroom - or garage for a couple hours too.  I’ve put my animals up for a few hours during parties because I didn’t want them under guests feet (or to get out).  There are options", "NTA. Respond to her on the chat with your reasons. Challenge her to address them.", "NTA, tell the friends that think you should let her bring the kids you will once they pay for the replacement coach and put a deposit for future damages.", "NTA. Your house your rules especially since no one else will host   It is a turn off when someone is trying to push their children into you when you don’t like kids. Also you said her child reunited your couch", "NTA. Your house, your rules.", "Jessica needs better friends. All of you sound insufferably up yourselves. ESH", "YTA. Not for the fact that you don't want kids at your house, but for the fact that you can't just be an adult and admit you just don't want Jessica around. For the couch thing too, because that's absolutely ridiculous. Your dog's kid anxiety is obviously just your cop-out and you seem absolutely insufferable. Also TA for feeling the need to flex your money in the post and comments. \n\nWe get it, you think you're better than Jessica. But in all honesty I can guarantee Jessica is way better than the rest of this \"friend group\".", "NTA- do I get the vibe you don’t like Jessica? Yeah, and you should probably own that. But I also wouldn’t let kids in my place, 1. For their safety and my dogs, if the dog is known to growl at children and 2. After the time you did let them over they ruined your couch. Immediate no from me.", "i'm gonna say nta you're not obligated to like someone or their kids. why make your dogs who are in your house uncomfortable. you mentioned in a comment jessica cheated on one of your friends brothers and if that happened to me i probably wouldn't like jessica either. kids don't need to be at every event", "YTA \n\nNot for the situation... but based on how you wrote the post, you are an AH. Lots of projecting going on based on how little you like kids. \n\nI'm very split on the couch. Yes, she should offer to have it professionally cleaned/replace it.... but given she couldn't possibly afford to if she is a single mother with two different baby daddies and can't afford childcare for the night, it's unreasonable to expect her to and hold it against her.", ">But I don’t like Jessica that much\n\nYou should have lead with this. ESH", "NTA. You have a right to control who is in your home and also to exclude others and/or their kids from your invitations. The fact that this person didn’t offer to get the sofa restored shows their interest is about themselves not you. Your first best interest should be to yourself.  That means sometimes saying and doing some things that not everyone around you will be happy with, especially if it doesn’t feed their own wishes.", "OP is NTA - Jessica is an entitled person who needs to learn about consequences for her actions. She was invited in the past, she didn’t do anything right.", "So Jessica can’t afford $100 on a babysitter for one night for her two kids but is more concerned that she can’t go to a party? What if there was an emergency? Instead of focusing on people who don’t like you worry about making a living Jessica. Wow this is what baffles me most about this post. \n\nTbh I can see why you don’t like Jessica.", "YTA\n\nNot for this.  You just sound like an asshole", "NTA for the house rules. YTA for being a shitty human that hides behind a *anxious dog that you threw thousands at to get it fixed* but basically you hate kids and don't want them near you.\n\nBeing child-free is a good thing, nobody should force you to have them or entertain them but your disgust towards them is very visible in the post. \nStop hiding behind excuses and man up, be honest and stop using Jessica as a punching bag. \n\nThe comment about her screwing someone better is a low jab and it doesn't matter that she cheated X years ago. \n\nI hope Jessica finds better friends who don't look down on her just cause they have a superiority complex", "Overall post is screaming Nta. Your comments are making me think yta. Jessica can find some better friends than you. What’s the point of having her in the group when it just seems like you hate her? Seems a little two faced to me. Cut her out, or treat her with more kindness", "YTA because you’re not even her friend.\n\nJessica needs better “friends” than people like you. \n\nDo her a favor and tell the truth.", "NTA. But, your attitude makes you YTA.", "Anyone who (1) mentions the price of a couch and (2) replaces it because a kid threw up on it, is an AH.", "NTA it’s your house and she should respect your rules for it, however you are an AH for commenting about her choices.", "NTA. Judging from your description of past behavior, I get why you don’t like Jessica all that much. And honestly, I’m with Dave on this one.", "Esh but you “i may be open to others but I don’t like her” and the friends that think she “should screw better guys” more \n\nShe should find better friends", "YTAH - be kind ffs.", "You couldn’t get the couch cleaned? You had to replace it?  As you get older you’re going to find that people will need to bring their kids to these events. I can’t remember the last thing I did at someone’s house that didn’t have a few kids. We’re all friends and understanding of each others needs. YTA.  Put the dogs in a room for a couple of hours.", "Nta, I’m a parent. And my worst nightmare when my kids were that young was having to take my kids to non-child proofed homes, for that exact reason. I can’t imagine destroying something that expensive and not even offering to pay. Don’t get me wrong I couldn’t afford that but I would be paying what I can when I can. It’s ok to not want kids at your house, the reason doesn’t matter. If someone destroyed something that expensive in my house and didn’t even try to make it right when I’m already making an exception for them, I would absolutely be pissed off at them and I damn sure wouldn’t want them or their kids in my house again.", "NTA your house isn't kid friendly and she's proven that her kids (and her) can't behave in your home.  It isn't your fault she chose to have children. Meet at a restaurant. You guys aren't child care on your nights off either. The comments about screwing better guys is trash too\n\nAlso,  why would you buy a new couch? Just use an upholstery cleaner.  They're 150 bucks and get shit out if you catch it right away. A girl spilled red wine on my couch, i handed her the green machine and it was out in 10 minutes with no stain.  Now i put dog pee pads on the couch under a cover. I don't blame her for refusing to pay for a new couch when all you needed was a couch cleaner (that most people have on hand when getting a white couch anyways) or a professional cleaning.  The replacement was your choice.", "NTA in that it’s your house your rules.\n\nHowever you are the BIGGEST AH generally.  For all of your mean comments and the fact that you’re making up rules to exclude one person specifically.", "NTA. You are not responsible for other people's children. They may not like that but it's your house your choice. Especially if the parent is someone who tries to foist their children on to other people. And while it's a mean comment for your friend to make (re screwing better guys) it's unfortunately true and the children are disadvantaged because their mother was so irresponsible.", "YTA. Equal and equitable are not the same thing.", "You're NTA in this specific scenario, but you and your friends are a hs for continuing to pretend this woman is your friend. Cut her loose and let her make friends that actually like her.", "NTA but ya she isn’t your friend either.", "NTA. People saying otherwise have clearly never dealt with this type of \"friend.\" What are you supposed to do? Lock up your dog while they're over and provide free babysitting for kids you have no real relationship with? Jessica is imposing on you and pissed that you're saying no. It sucks for her that she can't make this week but sometimes things work out that way.\n\n\"Oh but OP is being mean towards Jessica.\" Yeah well Jessica sounds awful. She doesn't respect people's boundaries, tries to dump her responsibilities on other people, and cries when it doesn't work out. OP is already making a huge concession letting this person in their house. Expecting them to be happy about this situation is insane.", "NTA\n\nSome people are weirdly up in arms about this. You've got a clear rule, and Jessica's kid has already reinforced part of why you have that rule in place.\n\nAs you said, Jessica is welcome to host something herself.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nHowdy guys, recently my friend group has been divided on an issue. I have a group of six friends and their significant others from highschool. All of us are in our mid 20s. The only person in our friend group is Jessica, who has two young children and is a single mom. \n\nI’m the only person in my friend group that can host, as my husband and I own a decent sized house and don’t have anything stopping us from hosting I guess. One doesn’t want to host, two live with their parents and can’t, another has roommates that won’t let them, etc. we all live in a rural area so there isn’t really anywhere to go for more than a quick dinner, so someone hosting is the only way we can all hang out really. When I host it’s always later in the day; around 7 pm ish. That’s when most of us are off work. I also have a no children rule for my house, since my dog is afraid of children and I honestly don’t like kids anyways. (My nephew yanked my dogs tail several times so now my dog growls at kids). \n\nI had a gathering last weekend, a dinner time bbq. Everyone was invited; same rules as norm. Jessica asked if she could bring her kids, because she can’t afford a babysitter and since both of their dads aren’t involved at all. I said no, because of my dogs and also because I don’t want her baby and toddler at my house. The last time she brought them she kept trying to push them off on other people who didn’t want to hold them so she could relax. Also her toddler puked on my 5k white couch, which I had to replace. No she didn’t pay for it.\n\nJessica blew up on me in the group chat, and said that I always exclude her. I told her I’m not excluding her, I’m excluding kids. All kids. She’s welcome to come if she finds someone to watch her kids. I also told her she’s welcome to host. She kind of went on about how none of that is possible and now she isn’t talking to anyone. Our group is split, half think it’s my house my rules. One said maybe if she screwed better guys she’d be able to have a babysitter. And two think that I should just let her kids come. To be honest, if it was someone else I would maybe cave. But I don’t like Jessica that much, especially since she didn’t pay for my replacement couch. \n\nAITA for making child not friendly plans that someone in my friend group can’t make it to?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NAH\n\nIt's not really a question of being an AH. When a woman becomes a mother, her and her kids become a package deal, because most of time childcare falls primarily on the woman, so without help, a woman can't really go anywhere until her children can be left alone. So having a parent in the friend group when you're so fiercly child free at the moment is difficult to navigate. \n\nAlso, it does take a village a raise children, and if you're unwilling to be her village, I don't think it's a choice you should be shamed for, but then don't pretend to be her friend.", "ESH. You are excluding her and you are not her friend. You need to own that. And own that as an adult, people's children are kind of part of the package and should be invited to most things if you really want to see the parents. But you don't have to be friends with her and I understand why you might not want to be if she is passing off her kids and letting them ruin your property. It's unfortunate for Jessica now because in a rural area, it's probably hard for her to make new (better) friends. But I'm going to go ahead and guess in about 10 years, the tables might turn.", "NTA. She can find a babysitter or host an event herself. That’s how it works once you have kids.", "YTA. And Jessica is right. You *are* excluding her on purpose. \n\nJessica needs better \"friends.\" You are not her friend.", "Frankly, it is your house, your rules, but you and your other friends could certainly offer to help with the cost of a sitter unless you are all really just passive aggresively trying to oust her from the group. Real friends care. If the friendship is done, simply say that it has run its course.", "Jessica needs better friends. You guys sound horrible.\nYTA", "NTA - your house, your rules. But...\n\n>so now my dog growls at kids\n\nYou might want to sort that out.", "INFO: would you be able to afford to pay for a babysitter for her kids, every once in awhile? Or have a few friends chip in? Because I feel like if you actually aren’t trying to exclude her and *only* her kid, like you said are (even thought you “don’t like Jessica that much”), you’d be willing to think outside the box and figure out how to include her and give her some much needed time away from her kids.", "NTA—your house, your rules. Whomever in your group doesn’t like it, tough luck. OR they can host…and if they can’t then they should STFU.", "Esh. Why are you all hanging out with people you can't be cordial to or about. As adults you should have left high school mean girl behaviour behind. Socialise with people you like to do things you all enjoy. This toxic clique business is ridiculous. Nobody sounds nice here. But you're all toxic for each other. Invite people you like from work or met as adults. Drop the group chat, it's run its course.", "NTA. Your house, your rules. Tell the two who think the kids should come, that they are more than welcome to host Jessica and her kids themselves.", "NTA. Those who are criticizing you need to figure out a creative way to host themselves or shut their mouths. Expecting you to welcome her kids back after one ruined a $5,000 couch is outrageous.", "And as always - the friends who think OP should cave can just feel free to fund a baby sitter themselves - especially if they never host. Else they can invite everyone - including her kids to their place", "Obviously, your house, your rules. However, you and most of your friend group sound childish and insufferable. Just because you can treat people like shit doesn't mean you should. Stop bullshitting around, Judging her, and coming up with ridiculous reasons you don't want her or her children there. You don't like this girl. Own it.  So stop being 2 Faced and be honest with her. You're adults, so act like it. YTA", "ESH.  You don’t sound like a good friend. You also sound very snooty.  Your friend also made her bed now she’s laying in it although for her sake , I hope she finds some new friends.", "What was unreasonable in saying no kids allowed at the hosts house? Her house her rules, if Jessica wants to attend it is HER duty to find someone to look after the kids, not OP's . OP even mentioned that even if the kids were allowed, Jessica hands the kids over to the friend group to relax herself. Jessica isn't being a parent. If you have kids , they are your responsibility , not your friend's. Sure they can help out, but that's something they have to offer, not something someone can demand.\n\nEdit: misspelled in", "I’m not her friend, yeah. But we’re in the same group chat/ friend group. Do you think I should say “hey guys bbq at my house everyone but Jessica can come”", "Dave kind of hates her because she cheated on his brother in highschool. He’s a pretty nice guy the vast majority of the time, he volunteers all the time, helps pretty much everyone move, etc. I like Dave a lot more than Jessica so maybe I’m biased. It was definitely an unkind comment, but not really wrong. Her kids two fathers are both homeless drug addicts", "Yeah, this is one of those narratives that even though they are NTA for the scenario they still come off as a total asshole.", "I doubt she can find any in their rural town where everyone knows everyone and more than likely marry right out of high-school.", "Um if Jessica is pawning her kids off on other people and not offering to pay (send some money for cleaning) after her toddler destroyed a couch, I don’t want Jessica as a friend.", "Eh if someone didn't even offer to help pay for kids damages Id be annoyed with them too\n\nAnd I actually like kids!", "Yup. And why replace a whole couch when it only needed a shampoo? I would refuse to buy a whole couch because someone didn't want to shampoo it too. Who owns a white couch without a shampooer anyways?  Something is off about this post", "Yep. It's obvious OP is deliberately sticking to this rule specifically to exclude Jessica from these get togethers because she doesn't like her, not just because of her kids. She's using Jessica's personal circumstances to her advantage. Also, who spends 5k on a white lounge and doesn't have it protected by getting it scotch guarded or the like, and also who buys a lounge that colour where it's unable to be cleaned and has to be completely replaced?? OP is YTA and Jessica needs to get good friends not shitty ones who expect a single mother to be perfect and have the money to pay for a new lounge. I find it hard to believe it couldn't be cleaned. Wait til the rest of the friend group starts having kids, she'll either exclude them too and they'll see her true colours, or magically find a solution to her dogs being able to be put away during get togethers etc\n\nEdit-thanks for the award", "The OP is not her friend \"To be honest, if it was someone else I would maybe cave. But I don’t like Jessica that much, especially since she didn’t pay for my replacement couch.\"", "Who replaces a whole couch when a cleaning would do?  either is bullshit or they're moronic financially", "She is very much welcome to come without her kids. And if anyone else in our group has kids they won’t be welcome. Neither my husbands nieces and nephews or my own are welcome anymore after the tail pulling incident.", "1000% cheaters are TRASH. Cut her off", "Unbearable indeed.", "I wouldn't be friends with them either", "Everyone on this post thinks that person is sooo mean for saying that 🙄 sounds pretty true to me. Truth hurts", "It was a stark white couch with a giant yellow stain in the middle. It looked disgusting, and we got it professionally cleaned and they couldn’t get it out.", "Lack of financial wiggle room on Jessica's part does not constitute immunity from the consequences of her or her child's actions. OP has every right to go after her for reparations for the couch.", "[deleted]", "My dog won’t attack kids but growls at them and them being in her house stresses her out. We went to some training sessions but the trainer basically said there was nothing they could do after us blowing thousands on some sessions. Also I explained in another comment why the couch had to be replaced, in more detail. I don’t hate Jessica, I tolerate her. Whether she is there at something doesn’t make that much of a difference to me.", "Correct.", "op said they got it professionally cleaned but it still left a big yellow stain in the middle of it", "Just send the invites to the people you actually like/want to attend.", "Um. Are you really 15 years younger than I am and you don't know how to initiate a new message thread or make a new group, or whatever the young kids on the new app are doing these days?", "Look man technically you're right, your house your rules and pawning off kids to people isn't cool but at the same time all I hear is this can't happen because it is inconvenient for me. You don't like kids fine, but I don't like kids I still make reasonable accommodations for my friends because that is what friends do for each other. Friends make compromises to support each other and let's be clear you are NOT her friend, friends don't talk shit about each other behind their back or look down on them. You sure as hell don't treat her as one from what I've read here. If you don't want to be her friend because you don't like her that much nut the fuck up, be an adult, stop pretending to be her friend, make a new group chat that doesn't include her and invite the people you want to be friends with. And when they/she ask why you didn't invite her and you say \"I don't think me and her/you are compatible as friends with each other\" and it gets awkward and uncomfortable suck it up and deal with it.", "Isn't that what you are already doing? I mean it's a slightly convoluted way to go about it, but the rule of no kids only affects her out of all the people invited.", "Leaving aside how very tempted I was to edit my judgment to an E S H over this utter failure at attempted justification of those comments, even if the statement was vaguely factual from a certain pointof veiw, *there was no need whatsoever to verbally attack her personally*. Dave's grudge, while understandable, does not justify his comments. Two wrongs don't make a right. Especially over something done to a relative in *highschool*. In a similar vein, *I do not care if he is otherwise a saint*, that doesn't give him carte blanche to insult people he doesn't like.", "Okay, by saying the comment is \"unkind but not really wrong,\" I am deleting my previous comment and saying YTA. \n\nYou also said if it wasn't Jessica, you might consider \"caving,\" so it really isn't the kids, it's Jessica.\n\nYou've made me feel sorry for Jessica. I hope she can get away from small town judgemental hell.", "I'd rather have no friends than friends who demean me.", "Someone in their mid-20s who doesn't have a fully stocked household?", "I don't care how good of friends I am with someone, I would be pretty done if they destroyed a $5,000 couch and refused to replace it", "You already said that you'd break the \"rule\" for any of the other friends.", "You come across a spiteful, miserable person.", "> Her kids two fathers are both homeless drug addicts\n\nOP said this in a comment... like... facts are facts.", "A white couch is a brave choice for a pet owner too.  What would you have done if the dog had made a mess on it?\n\nYou don't have a kid-friendly house, nor are you interested in making your house kid-friendly.  That's perfectly fine.\n\nBeing upset at Jessica for not reimbursing you at all for the couch is understandable, but do you honestly think she could have?\n\nUltimately, NTA, but not by much.  Honestly, you all sound snobby, judgmental, and immature.", "Could have looked into just replacing the cushion. Upholstery can be expensive but is probably cheaper than a new couch.", "Kids puke. Get over it. It’s not like a small child thought to themself, “I can’t wait to puke on this stuck up guys expensive couch”", "[deleted]", "> her or her child's actions.\n\nHer child action was a baby puking. It's not like the baby was being naughty.", "Are you describing OP or her friend who brought children over and never paid for the damage they wrought? Dumping your kids on other people is entitled behavior.", "What crap teacher was that? Thousand on some sessions to not being able to train a dog 🤣🤣🤣🤣\nStop flexing because it's not a flex (yes, I am focusing on the dog here)", "[deleted]", ">blowing thousands on some sessions \n\nDo you just throw money around for the bragging rights?  5k for a couch, thousands on training your dog. Most folks would realize the dog is untrainable before they spent thousands on lessons.", "She would still know about it if she’s in the group chat", "But it looks like they had compromises before, they kids were invited in a previous event where the mom tried pawing them on others and then proceeded to not pay for damages caused by her children. I think it is reasonable to have a no kid rule after this. \n\nOp comments (a friend maybe) about Jessica's love life were super rude.", "She has dogs who are afraid of children.\n\nIn her house.\n\nWhere they live.\n\nMy German Shepherd is a giant softy who has never hurt anyone in his life.\n\nBut he's an old dog who has never grown up around children and doesn't like them.\n\nAs such we don't allow children in our house because kf the fear of what could happen.\n\nBut if you're cool stressing out an animal and putting children in danger... then that's you.", "It IS her house! Why would her inconvenience be not be of utmost importance? \n\nHosting is not an obligation. \n\nYou make reasonable accommodation? Good for you. Doesn’t mean that’s the norm!", "Dave sounds like the worst AH of all so far. \"He volunteers all the time\" probably makes it worse.", "Wanna bet it's the type of group that's all helpful towards eachother as long as your a certain skin colour and a certain sexual orientation?", "Well to be fair, clearly OP did cave at some point in the past in order for the kid to be in the position to puke on her couch in the first place.", "I’d rather have no friends then a friend that pawns their kids off in me while wrecking my $5000 couch they didn’t offer to pay any money to help get fixed/replaced", "I'm right there with you.", "A kid puking on a couch once is not cause for replacement. She could've had it spot cleaned and it would've been as good as new but she had to flex her $ instead.", "It wasn't destroyed. It needed a shampoo. Op pitched a fit and did the most irrational thing. Plus,  who buys white furniture without a shampooer and doesn't cover it during parties?", "Maybe if they were older kids and I would consider caving. Probably not but it’s a maybe. Jessica basically throws her toddler into anyone’s arms so she can fuck off and relax and make someone else babysit her kids while she’s here. Some of my relatives do the same. So no babies or puking toddlers for sure", "My dog isn’t allowed on couch and knows that. No problems there. Any other furniture is fair game though", "I mean Jessica is legally bound to paying for a replacement, no? Also, dont people in America have insurance for such instances?", "So it wasn’t a couch with a bunch of cushions on it. The couch was one whole piece and it was designer and a bit hard to have repaired. I’m usually not the type to go designer, it was the only piece of expensive furniture I ever bought but I really loved that couch. It was artistically designed and I like art", "So Jessica shouldn’t pay for the damages because… kids are known to puke?", "Did she offer to spot clean it? Or even get it professional cleaned?\n\nLike I’m sure the couch didn’t need to be fully replaced, but unless OP is just purposely leaving out information, she didn’t even offer to pay for it to be properly cleaned.", "I think this is such an important point here. Your kid being a brat and you do nothing to stop the and they destroy my couch, I’m going to blame you. A baby puking? These things happen with no warning and can’t be helped sadly.", "Even if the action was beyond your control, it doesn't mean that it doesn't affect someone, and it doesn't mean that it's not your responsibility. If your pet rooster wakes up half the neighborhood, it doesn't mean that you were being negligent, but it does mean that you are still responsible. Same logic applies to a baby.", "She still carries the whole legal responsibility for it… It is her baby.", "It’s a lot easier to just not have kids at my house. I don’t like kids anyways. Why go above and beyond to fix my dogs issues with kids when I don’t want them at my house anyways?", "Money can’t buy common sense it seems.", "I mean, he could have trained the dog before this happened. All my big dogs were trained before we had kids. Never any issues arose and the dogs knew that if someone pulled their tail, fur, ear, not to snap. I also never let a young kid alone with said dogs but hey, that's me I guess.", "Again, it's about the fact that it's clear, op doesn't like her, and their lifestyles don't work together, she clearly doesn't want to deal with kids at all and finds dealing with the burdens of having a friend with kids REALLY unpleasant. She said it herself she doesn't like her that much. And that's fine, some people aren't compatible as friends. but rather than sitting there stewing and grumbling, she should just stop being her friend and make a new group chat that doesn't include her. Maybe it will be awkward for a while but sometimes that's just what you have to do.", "This isn't about the house or the dog it's more about the fact that they never try to accommodate her & her kids in any way. maybe meet on neutral ground maybe one who is kid friendly hosts even if their house isn't as nice.  Friends make compromises. They make an effort to understand and appreciate people's different lifestyles. They don't want kids in the house, and for her to hang out at the house, she needs to accommodate them by taking the time and money to get a sitter. Which is a reasonable accommodation for her to do for them. But if she wants them to accommodate her? Like, find a place where both kids and adults can hang even if it's not as fun as the house? Nope! Not our problem, you want us to hang together you figure everything out. It's all on you. They also laugh about how \"she should have screwed better men\" instead of \"It's awful the kid's fathers are deadbeats, and she's a single mom\"\n\nThey have every right to not want her kids in their house, and to ask her to leave them at home even if they don't have a dog. And yeah it's a not ok to not pay for the couch,  or at least offer to do a payment plan of some sorts. But still these people are assholes to her too, and it's clear they aren't compatible, and rather than pretend to be friends with her they should just admit they don't like her, deal with the fallout and go their separate ways.", "The dog could stay in another room for a couple of hours.", "Some stains don't come out, especially when it comes to white upholstery. It doesn't sound like this friend offered to have it cleaned, either. You're speculating a bit here.", "Just fyi, NTA. I’m not sure why this other person think this is an asshole comment. It is the worst when people bring their kids to things and expect everyone else to entertain and watch them.", "Every comment you make yourself sound worse. YTA.", "Well now I wanna see the couch 🤣", "I don't know about you but I have an insurance for that because well.. kids puke and kids break things and dogs bite etc", "Op had a kid over before and the kid puked on the couch. Op knew Jessica’s financial situation. It’s like op was asking for it to happen. Bottom line is, why is  op still “friends” with Jessica. If op grew up and cut Jessica off, this wouldn’t have happened. Instead, op is stringing Jessica along for whatever reason.", "There’s definitely info being left out, when OP leaves out she’s only ever “tolerated” Jessica, and didn’t lead with “I don’t like her”. Bound to be bias.", "Yeah I’d immediately be cleaning it myself if my baby did that", "It easily could have been an adult accidentally spilling red wine on the couch. Accidents happen. Couch covers are a thing for a reason and don't cost 5k.", "So it doesn’t attack kids in the future…?\n\nAlso, very convenient you ignored everything else I said. Can’t have accountability on your high horse, can we?", "She’s a single mom so the kids are solely her responsibility. Her childless friends don’t need to accommodate her. If she wants to go then she needs to get a sitter. If she can’t or doesn’t want to then she doesn’t get to go", "It’s the dog’s house. And I wouldn’t want kids I knew weren’t being looked after in my home; it’s a liability and it also means expensive things, like couches, get ruined.", "Hell no.\n\nIt's their fucking home.\n\nI ain't stressing the shit out of my dog in their own home for hours at a time.", "How about no? the dog DOESNT have to be restrained. And no, the other guests DONT have to babysit for this woman, and OP absolutely doesn’t have replace furnitures no matter what.\n\nThe comment on her reproductive choices are unkind, but if you try to use others for free babysitting then they can feel entitled to unkind comments.\n\nIt doesn’t make OP “technically right but you’re TA anyway”.", "How about they do that with the children instead.", "Omg we feed our dogs pumpkin and if they puke and it’s not immediately like steam cleaned it leaves a stain… I have a carpet that has not recovered because we were not home when the dog puked. Stains can def be not fixable especially on a white couch!", "I have 2 kids, and I've owned plenty of white furniture (against better judgement). I've never had an issue removing a puke, poop, or food stain on any of it. The only thing that's ever been any trouble was fruit punch and grape juice. Unless the kid has some superhuman puke it's safe to assume she overreacted by insisting on a replacement. \n\nIt's also pretty obvious the friend couldn't afford to even if she wanted to.", "A professional cleaning will 100% get it out.  I had red wine spilled on mine and its gone", "Asking for it to happen…what!?! So if she didn’t invite her “poor” friend over in the first place because they couldn’t pay for damages if their kid happened to damage something I’m sure you would then be calling her elitist and classist. So on that question what’s your solution? \n\nBecause regardless of her feelings about Jessica, she either invites Jessica, (like she already did) and her kid ruined the couch and now bc of that and other reasons she doesn’t feel like being super accommodating in letting the kids over again but still invited if Jessica can make it work, or she should have never invited Jessica in the first place because she has kids and because she’s poor and can’t pay for hypothetical damages and OP doesn’t want to, as you put it “ask for it” by inviting “a poor”…) (note my sarcasm bc your comment is ridiculous tbh)", "Inviting someone over to your home with their kids is not asking them to puke on your white couch", "Just because it is an accident doesn’t mean you aren’t responsible for fixing it?", "And if it was an adult, accident or not, I’d equally expect them to pay for the damages, same as I would expect the parent of a child to pay for their kids damages. Have parents stopped teaching “you break it (or in this case damage it), you buy it (or fix it)” bc these comments sound pretty entitled. \n\nRegardless of Jessica’s financial situation she should have made restitution to OP to have it cleaned or replaced. She didn’t and now is complaining her kids aren’t invited back… what did she expect when it seems she didn’t even try to fix this.", "If you don't want to accommodate your friends then you shouldn't be friends. It's really hard to have a relationship with anyone if you don't want to meet halfway.", "Totally, I don't think the kids should have free roam of the house either.", "Who owns a white couch that also owns a dog? I can’t get past this enough to care about the rest of the story lol", "What if the kid threw up fruit punch lol", "The solution is simple, cut Jessica off. It’s clear op doesn’t see Jessica as a friend. So there’s no point in op inviting Jessica over. Jessica should find better friends tbh. Not some two faced people like this", "A kid isn’t planning to vomit in a place their invited to lmao. In fact, kids never plan on vomiting", "“It’s like op was asking for it to happen” \n\nWhich is also pretty victim blamey", "You do realize we’re talking about young kids here right? They get poop on their clothes, they vomit on their clothes. A parent always needs to pack a couple extra outfits when they go places. It’s sucks that his white couch was puked on, but shit happens.\nLien I said before, op doesn’t even seem like they want to be friends with Jessica, so why be two faced and continually invite her over?", "NTA. I don't understand the other judgements. OP was already accommodating, and it failed. The last time Jessica was over, other guests were turned into babysitters and a couch got destroyed with no recompense. Then there is a safety issue: OP's dogs are not kid friendly. Jessica, on the other hand, seems entitled. Even a \"I'm sorry about your couch. There's no way I could replace the couch, but I could send a small amount over a period of <insert appropriate time> to help offset the cleaning cost?\" would have gone a long way. While the one \"friend\" was out of line for the snarky comment about Jessica's disposition, Jessica needs to grow up and find an appropriate solution to having someone watch her kids so she can get a break from parenting.\n\nThat said, OP needs to just suck it up and make a new list of invites/friends and let the chips fall where they may.", "My ex friend would always bring her spoiled toddler and would expect us to babysit him while she relaxes, last time I saw her in that setting she told me \"now it's your turn to watch him\". I said \"I didn't come here to babysit\" and we were not friends since haha. It's her kids, her problem. My dog is also scared of kids and your house is your dog's safe space. NTA", "NTA not only is it your house your rules but too many parents are inconsiderate to their host when they let their kids behave badly at other people's homes. I once had a friend's kid spill juice all over my soundbar pretty much destroying. Not only did they not replace it they didn't even help me clean up. Needless to say they weren't invited again and we're still in the same friend group.", "NTA if your friend group is unhappy someone else can make a plan for a child friendly get together.", "Life is too short and happiness is often a fleeting thing. It is your house, and your life. Live it as you wish, with the people whose company you enjoy. It really is that simple.", "Nta. Tell her she needs to replace your couch first pronto before she can come (not like she will anyway) but that can ward her off", "NTA at all. I can see why you don't want Jessica's kids there. It seems like the one time she did bring them, she expected other to look after them for her and ruined your furniture.", "NTA. Most importantly, the kids aren't safe at your home because of your dog! You would be insane to let the kids into your home. The kids could die and the dog would be put down. Does your dog need more training, yes, but don't bring kids around if the dog is not ready for it. This alone should be reason enough. \n\nAlso, it's normal to not want children at gatherings. She also tries to have others babysit her children. Her choices are not your responsibility. You are nice enough to always host, probably meaning most of the costs are for you. You are being more then generous. Tell anyone complaining that they can organise next time. If they continue I would just not host them anymore.\n\nEdit after reading some more comments: I think Jessica should be lucky she hasn't been kicked out of the friend group. She is a cheater and even cheated on the brother of another friend. She tries to dump her children on others, while the friends didn't sign up to that. Also HER children destroyed something and she hasn't paid for the damages or made a payment plan. She should be lucky that she still got invited, but decides to complain about someone who was generous enough to completely ignore the damages Jessica made. Jessica sounds insufferable.", "NTA. It’s your home, and you don’t want kids in it. How Jessica feels about that is irrelevant. \n\nAdd to this that she’s already had a chance and how she reacted to that was to palm her kids off on others and not pay for damages? Plus her not wanting to host herself? Hah, tough luck Jessica. If anyone else has an issue with it, perhaps they’d like to host instead.", "NTA. Jessica seems like one of those single parents just popping out kids but blaming everyone else for her situation. She’s clearly not taking responsibility for her kids actions and trying to palm them off onto others isn’t ok either. Stick to the rules I would.", "Nta. It's a no kids gathering. Also her kid ruined your sofa.", "NTA. your house, your rules. And the fact Jessica pushed her kids off to other people who don’t want them…. Yikes. Plus her toddler puked on your couch and didn’t even send any sort of compensation for it? Absolutely not. The comments about her reproductive choices are rude and you really shouldn’t invite her if you don’t like her. But NTA for standing your ground on your house your rules.", "Honestly, you said her kids threw up on your coach. I wouldn't risk that either. .\n\nSounds like her issue that she can't find a babysitter or got with deadbeats that aren't watching their own children. \n\n\nIt's your house. Your rules. Nta\n\n\nI also don't like to be pushed to be a babysitter so the parent can relax. Not replacing things your kids ruin is just makes me quit the friendship. Clearly, they don't respect me enough to apologise or make an instalment plan.", "I don’t put my dog in a room for any amount of hours when people come over, she is well- trained. They can bring their kids anytime but they absolutely must watch their kids and once I notice their kids messing around with the dog or my cat maliciously,They must leave with their kids. There is no leeway. I’m sorry, but my home is also home to my animals. I would also expect if their kids “vomited or whatever” on my furniture they(the parents) would “offer” to do something to clean or even replace if it came to that. I don’t know why people are saying in comments about OP having a white couch and a dog. Why is that relevant?? My dog or cat has yet to puke up on my furniture and when/if they do, that’s MY problem!", "I don't think it's a matter of who's the asshole here. Your friendship if it ever existed had been stained to nothing. The friend group splitting up was overdue. Move on and let it rest instead of trying to get some kind of moral high ground.", "NTA. She isn't a good guest and she won't pay to fix her children's damage. She is free to host a gathering at any time, even if it is just reserving a spot at a park.", "NTA\nThe dog is reason enough to stand firm on the rule. \n\nAs for the couch, I know a bunch of ppl have said replacing it was an overreaction, but if it was white and suede or velvet or another really hard to clean material I could see that warranting a replacement. If you are a childfree house where the only guests are adults, then going for a nice couch in a fabric that is hard to clean probably wouldn’t be unheard of. And regardless, she could have at least offered to pay for the cleaning. And being in a rural area as they claim, it’s believable that finding the service would be harder/unrealistic for their location. \n\nI would also be wary of bending the rules again if the last time I bent the rules it was just a bad time overall. Sofa vomit, pawning off the kid, and messing with your dog’s ability to be comfortable in your home together equal NTA to me.", "YTA \n\nNot because of not wanting kids at your house, that’s fair game. \nBut because the spiteful way you guys all talk about Jessica while pretending to be her friend, which just got worse in the comments. There’s not an ounce of empathy to be found.\n\nJesus. It’s not high school anymore. You’re allowed to drift apart as life and circumstances change. But Mean Girling her behind her back isn’t nice.", "NTA.   \nShe sounds like a terrible friend.", "NTA I’d let your kids come if you’d replace the things your children damaged but you don’t so too bad", "Nta …. I have kids and I’m a single mam but if someone’s kid destroyed something and they didn’t even offer to pay towards it they wouldn’t be coming back in my house it doesn’t matter that she’s a single struggling mam OP and many other work hard to buy the things they have just because it was a child that did the damage doesn’t override that parents should be responsible for their children", "NTA re: not wanting her or her children in your home. I don’t know why you’re being vilified for not liking someone and not wanting someone who abdicates responsibility for their children onto others in your home. If someone’s child/pet wrecked something I owned and they made no effort to make it right, I’d be very reluctant to have them in my home again barring some extreme mitigating circumstances. \nYTA re: commenting about her reproductive choices - that’s unhelpful but I’d be lying if I said I hadn’t judged other peoples decision making in the same area. Having said that, I recognise that that was a dick move, so perhaps personal growth is still achievable.", "NTA…..but wind the clock forward 10-15 years and your get-together arrangements are probably going to centre around children for some, if not most of the couples involved.\n\nI’m just saying that perspectives and situations change as you move through life and your view is understandably where most mid-twenties people’s heads are, which is on themselves, their career, having a good time and not focused on kids.\n\nYour girlfriend needs to accept that her life choices have left her out of step with her peers and she needs to make arrangements accordingly if she wants to be part of your circle and not expect everybody to accommodate her specific needs.\n\nWhen you have small children (I have 2, but teenagers now) you get used to a bit of puke on things, its unavoidable, so you prioritise your life (and your expectation of sofas) accordingly.\n\nIn the future it may well be the childless couple that feels left-out of arrangements. A few years from now you may well be fighting over your girlfriend’s teenage kids to babysit, how ironic will that be!", "NTA-she somewhat did this to herself, her kid puking on the couch and she doesn't pay for it and pushing her kids onto other people, that's already enough to not have the kids invited anymore or at all, and then your dog doesn't like kids so it wouldn't be fair to the dog and it's not good to stress them out. She, as a parent, has to accept that her kids will not be invited to some places or not be allowed.", "NTA, your house your rules", "NTA at all. It's your home and you have every right to make the rules about who enters it and who doesn't. I appreciate Jessica has kids and might find it hard to get babysitters, but that is NOT your problem. She'd have the same  issue for any event that excluded kids attending.", "NTA. your house your rules.", "NTA. Jessica’s inability to manage her shit is not on you. You tried to accommodate her previously and she still screwed up.", "[Hey, OP, I actually just remembered you had a theme song](https://youtu.be/4KH7hV4BWFE)", "If you are truly good friends and then maybe everyone including Jessica can chip in for a babysitter?", "YTA for buying a couch that is so fancy is lacks any ability to be cleaned when you have a dog?!?", "NTA she should have paid for your couch", "NTA.", "NTA. Her kids dress your dog out and one threw up on your couch that she didn’t clean or replace. If she wants to be included, like you said, get a babysitter or host herself. Same how’s for the others who think you are an AH - they either need to step up and host, or accept your terms", "NTA. Her choice ultimately to have these children. To absent fathers…at a pretty young age. Let’s not discount your dogs either, it’s your house and you are doing the right thing as I’m sure your friend wouldn’t like it if something went wrong with that.", "NTA. \n\nThose who think you should just suck it up can feel free to host her and her kids.", "YTA.\n\nI also dont want kids. I dont like kids. In my early 20s I excluded people with kids. And its a shitty thing to do.\n\nEither Jessica is your friend and you welcome her and her immediate family (partner and kids) to the get together, or you're not her friend.\n\nGrow up. Get over yourself.\n\nOh, and train your dog. They deserve to be supported and get through their fears.", "Yeah. I'm calling you the asshole and a host of the people replying. Jessica can't help the fact her kids fathers are absent. Yall don't want the kids there yet yall want Jessica, help her get a baby sitter. Also, you are an asshole for having a 5k white couch without a cover knowing you were hosting. Then you bitch and act like it's her fault you didn't want to take precautions. She didn't pay? Well no crap, single mom of 2 kids who can't even afford a sitter to be around a fake friend. Jesus Christ I thought Regina George was a made up character. You're a terrible friend. Also, reiterate, Jessica is a single mom 7 days week 365 days a year. Not a single one of her \"friends\" would willing hold a baby to give her a break? No wonder the baby daddies aren't around. She's a horrible judge of character thinking you're inner circle of people were her friends. Let the girl go so she can enjoy her life instead of running around with fake people who just post about her on reddit. \n\n#JusticeForJessica", "NTA nobody wants to be around toddlers who's parents don't even want to watch them or pay for what they've damaged.", "There literally no way a child puking on your couch called for you replacing the entire thing 🙄", "Why do I feel like this whole post is written around the fact that OP owns a $5000 couch?\nYTA", "NTA- But maybe have an event where the kids can come (and some that they are not there. ) \n     \n     I get it, kids are a pain but I feel like Moms get stuck with the kids, and yeah they didn’t plan ahead well or whatever but the kids are here and a little kindness goes a long way.  \n\n     PS: definitely get a good slipcover! Good luck to you!!", "NTA.\n\nYour house, your rule, and your choice on who you want to be there.\n\nAnd while the friend who said what they said re her exes was really crass and unhelpful with the comment, it is probably what all your friends are thinking, because it is true.", "ESH i think. you do purposely exclude her. like you admit you don't like her. And if she can't afford a sitter i'm not shocked she can't afford a 5k couch.\n\nbut her trying to pawn her kids off speaks volumes on she's worn out but doesn't also consider not everyone wants to care for a child. this is why i skip events. i don't have the energy to chase my kids (i have medical issues that can cause mobility issues) and my husband is only person.\n\nlike i don't blame you for your house rules but the fact that you don't care that it excludes her speaks volumes on you as a person.\n\nthe friend who said she needs to screw better guys is gross and a bigger AH than even you.\n\nand jessica's inability to accept that having children shapes her life differently and gives her different responsibilities makes her join the AH crowd.\n\nbut she wasn't wrong about calling out the fact she feels you exclude her, it's clear you want to regardless of her kids", "Maybe Jessica needs to find a way to bring something along to entertain the kids for occasions like this, sure...\n\nBut why TF can't you just separate the dog and the kids??\n\n>her toddler puked on my 5k white couch\n\nYup, shit happens.  Could have been a toddler puking, could have been you or any one of your friends spilling food or drink.  If that's a problem for you, maybe you shouldn't spend $5k on a white couch, I mean *holy shit*.  You sound like Anette Benning's character in 'American Beauty.'\n\n>One said maybe if she screwed better guys she’d be able to have a babysitter\n\nJudgmental AH.\n\n>But I don’t like Jessica that much\n\n...\n\nSo why are you friends with this person you're so judgmental of?\n\n>especially since she didn’t pay for my replacement couch.\n\nShe can't afford a babysitter and you think she has $5k for your stupid couch??\n\nYTA.", "YTA.\n\nAnimals and children can be in the same house if you want to make it work. And they don't have to interact with each other. \n\nJust be honest, you don't like her and you are making shit up to exclude her. Why you are in a group chat and invite someone you don't like to your house seems childish and like you never left high school", "You answered yourself by stating that you really don’t like Jessica", "YTA for looking for excuse. The more i read the more you are judging J morality. You almost admit it though : it’s not about kids . It’s about J . And wonder how a baby puck can ruine a 5k couch to the point it has to be changed. Sounds very weird to me.", "All of you are in your mid 20’s? Soon Jessica won’t be the only one with children and you won’t be able to use it as a lame excuse to exclude her. YTA.", "You could've got the couch cleaned?!?! Instead of replacing it! Seems excessive. Unless the toddler went full Exorcist.", "NTA for having rules at your house but YTA for basically being you.", "NTA in this situation but YTA as a friend in general", "If what OP wrote is indeed fact based then ESH.", "Was voting NTA until you brought up that one of your friends said \"If she'd screwed better guys she'd be able to afford a babysitter\"\n\nNow I'm camp ESH- your \"friend\" (who you openly dislike) is going through some tough times- maybe you should treat her less like shit while also maintaining your boundaries healthily?\n\nAlso, you saying that you might've caved if it was for anyone OTHER than Jessica kinda confirms her suspicions that You have a problem with her.", "Share the cost of her babysitter between all of you. Problem solved. Sounds like you can afford it.", "With friends like you, who needs enemies?!\n\nETA: your dog not liking kids is a great excuse for a while, but you have to try and socialize the dog so he doesn’t react poorly to people/kids. Also, your nephew should learn not to pull on a dog’s tail. At some point more of your friends will probably have kids and they’ll want to come, better prepare your dog for that scenario.", "You sound insufferable. You own dogs and a white couch, but only a toddler made it dirty? You ate in a group of friends in their 20s - an age when many start to make families - and are vehemently antichild.\n\nBased on half your other friends' comments, I concur with those saying that Jessica needs better friends\n\nYTA", "Just admit you want to exclude her lol ESH/YTA", "OP is the AH. True friends would come together and pay for a sitter so the entire group could be included. Terrible friends lie about having to replace a couch, talk about you behind your back, and make snide comments about friends' sexual partners.", "Your whole circle of friends is TA, including you. \nHow about you guys just tell her straight up that you don't want her anymore?", "INFO: do you like Jessica? \n\nI have friends who have kids, some who don’t. Some gatherings are kid free, some are not. Honestly the kids drive me mad when they’re not related to me (even then a have little patience). \n\nNot your responsibility but if you want to hang with Jessica but can’t see a way around this could you kitty a babysitter occasionally? Not for every time you want to see your friends but the odd time. Just shout the woman a night with her friends in a peaceful environment. Not your problem as not your kids. But your so-called friend has children and clearly bad taste in men. If this is your way of cutting her out then fine, just do it. If you like her then make a compromise.", "NTA, jessica and her kids annoy me even though i don't know them x)\n\nPulling tails and puking on couches is just too much if you just wanna hang out with friends.\n\nYour house, your rules. And you are very nice that you don't sue her to pay the couch. \n\nAs you said, she is not a friend - you tolerate her. Alsp very nice of you to still invite her.", "NTA…\n\nYour house, your rules. If more of OP’s friends or they themself had kids then maybe they’d be more willing to have children over during an adults gathering. However I don’t think it’s entirely abnormal that OP doesn’t want to have the children over for the time being, as they’ve mentioned..\n\nJessica has tried to dump her children on the friend group on past occasions which is rather inappropriate AND the adults probably want to let their hair down and have a few drinks without  having to be conscious of children around during this time. \n\nOP obviously has the means to afford higher prices furniture in her home and it only makes sense they don’t want things being destroyed when the children have ruined items before. I’m sorry but vomit on a white couch??? That would traumatise me unless it were my own child. \n\nIt sucks that Jessica is a single mum and doesn’t have much support from the fathers of her children but that doesn’t then make it everyone else’s responsibility to ensure she’s able to take her kids adult only gatherings! People on Reddit can be so unrealistic", "NTA. Your house, your rules. Her life choices, her consequences.", "NTA. I don't know why parents think they should be entitled to burden others with their kids. She should have considered things like this before having kids if it's a problem for her.", "NTA why are people calling you so mean and TA for not liking Jessica and excluding her?\n\nReasons to not have Jessica come:\n1. Your dog doesn’t like kids. 2. You don‘t like kids. 3. Jessica has a history of shoving her kids onto other people. 4. Jessica‘s kids destroyed something in your house and she didn’t bother to replace it. 5. You don‘t just exclude Jessicas children but basically every child. 6. Jessica whines about not being able to afford a babysitter which is due to her own silly life choices (let’s be honest, if I had a friend that willingly has 2(!) kids with two different men who are BOTH drug addicts then I would also not want to help around that, y‘all act like Jessica is such a poor women when she is grown up and is the only one responsible for what she’s done)\n\nThey are all valid and even if Jessica never was an unbearable mother and you just didn’t want kids at your home it would still be okay.", "NTA. No, you are not wrong for not making child friendly plans. It is your house. You have no children. You have a dog that has been terrorized by children and is now unfriendly to kids. It is just the way it is. She can leave her kids home or stay home. As long as you keep the rules the same for all, you are fine. Actually, her kids did already ruin one couch, you certainly have the right to prevent the kids from having the chance to ruin another. She has to understand that not everyone wants kids at this point in their life and that means that she has to accept that not everyone will want her kids to be in their lives either. Maybe she needs to find a group of friends that already have kids in attendance, so hers will be welcome. Even parents with kids have the right to say that for this get together, there will be no kids allowed, when they got someone to take their kids for the night and don't want to deal with anyone else's kids either.", "NTA. Her kids already did 5K in unpaid damage, of course they're no longer welcome in your house. That's a huge amount of damage to go unpaid. Then there's your dogs who'll get upset, the children will get upset from the dogs, etc. It's simple. The kids can't come to your house. \n\nThe two who say the kids should just come can host it? Then everyone can come, problem solved. But well, apparently they can't according to your story, so there goes their opinion on what you should allow in your house.", "NTA it’s not anyone else’s problem that she had kids and can’t afford a sitter, she’s gotta learn at some point that not everyone will want her kids around all the time. The fact that she pawns her kids off to other people would piss me right off if I were hosting, we’re trying to have a good time, not take care of kids we never had.", "NTA. I have kids, I hate kids. I don't want kids ruining my adult get togethers.\nDifferent if you all had kids and they played but no, get a sitter or suck it up.", "NTA", "YTA and so is your $5K couch", "Honestly ESH and I'll explain why:\n\nJessica is TA for not controlling her kids or repairing the damage they caused. \n\nYou're TA for being a bad friend, which you outlined by saying you would cave for someone else but you just don't like her. (And your friend is TA for \"One said maybe if she screwed better guys she’d be able to have a babysitter.\"\n\nBUT you're NTA because it is in the end your house and your rules. \n\nSo yeah, NTA for this specific set of plans, but ESH because Jessica's friends are talking badly about her behind her back and Jessica doesn't cover damages her kids cause.", "Imagine saying “to be honest I don’t like ______” about any other group of people, but somehow folks feel confident saying it about kids.", "Even though you are NTA, you do sound like a bad friend. It doesnt sound like you giys treat her like a friend, so I'm not surprised she's desperate to catch a break and blowing up on you.", "NTA because her kid damaged your couch previously and she didn't pay for it.\n\nIf that incident did not happen, YTA.", "NTA - your house your rules however E S H for your attitude, sounds like you haven’t grown up much since high school.", "YTA. The bones of your story are in your last sentence. You don't like her. If you did like her you would probably be more accommodating. No couch needs to be completely replaced just because a child vomits on it. I would have refused to pay for that too, but I would have paid to have it professionally cleaned. Bottom line is it's your house and you have the right to refuse her kids. But you're being a bit mean imo.", "Your house, your rules, but YTA", "This is a prime case of “you can be right and also an asshole”\n*Can* you exclude kids from your house? Yeah, you can. But all your reasons are super petty and you come off as a massive asshole. YTA. You don’t *actually* have to replace a white couch because a kid threw up on it, you can live with a stain. Expecting a single mother to foot that cost is also kind of insane. You can also crate your dog or put them in a room for a day, it’s not hard. And about “forced babysitting”, an easy solution is just, baby-proofing a small area of the house, asking her to bring her own playpen and toys, and just let the kiddos do their own thing.\nSure, your house your rules. You don’t owe anyone anything, but don’t think your morally in the clear for this when there are a ton of easy solutions. YTA", "The only thing here that makes you slightly N T A is the fact that your dog can't be around children and you're right to set house boundaries.\n\nHowever:\n1. You refuse to attempt to train your dog out of their behaviour towards children (and admit this in your comments). He can still be a danger to children he sees in public. As a dog owner myself I find your attitude very irresponsible.\n\n\n2. I also question how dangerous your dog is when you still allowed your friend to bring her children before. Surely if he's that dangerous you'd be responsible and not \"cave\"\n\n\n3. The whole replacing couch rather than cleaning it explanation is a bit doubtful, not to mention it was an accident and you know full well she couldn't afford to replace it (I AGREE SHE SHOULD'VE OFFERED but she clearly couldn't pay that amount. She does have children to protect and raise, is clearly struggling, and I do sense some snobbery here directed at her through the tone of this post).\n\n\n4. Your friends made horrible comments about how she should \"screw better guys,\" and you admit in the comments that you don't really like her and others don't because she apparently cheated on someone. \n\n\nWhilst on the surface it seems this is about setting boundaries in your own house, the more I read this, the more I sense a strong contempt and superiority coming from yourself and your friends towards her.\n\n\nIf you really wanted to include her, then you would find a better way to hang out. I live in a rural area and find your excuses a little BS. But you don't see her as a friend, so stop messaging the GC for invites and let her find some other friends. Why keep up this charade when it's clearly hurting her?\n\nYTA.", "People so sensitive in these comments. Please OP is NTA. Not everyone likes kids and that’s 100% fine. Don’t go trying to guilt everyone because you’re a mother. Especially since she didn’t take responsibility for the last time. Please I dislike entitled people.", "NTA", "Nta\n\nHivemind going nuts over you not wanting to be involved in the raising of someone else's kids.\n\nI'm sure you're bearing the consequences of your own life choices; why are you an asshole for asking someone to bear theirs? \n\nIf that ends up that they can't attend your stuff, how is that your fault? There's a difference between a helping hand and a crutch", "NTA. You’re not obligated to put yourself out in your home especially in a situation you’ve already tried and had backfire (the couch situation). But you and your friends are pretty rude with how you speak about Jessica’s kid’s fathers. Maybe work on that or just cut her out if you don’t like her so much instead of talking shit about her.", "nta", "NTA because it's your house. but \\*wow\\* the \"If she screwed better guys\" was kind of gross..", "NTA, but puke comes out of couches.  Could have definitely gotten it professionally cleaned instead of buying a whole new couch.", "ESH", "”…two think that I should just let her kids come.”\n\nGood, it seems like there are two volunteer babysitters. Or better yet two people willing to host a child friendly gathering! Perfect! /s\n\nBut it seems this friendship group has run its course and you should break it apart in different groups that meet for different purposes. I don’t know if I would want to come to a party with people who slut shame others, anyway. (Seriously, did anyone protest the slut shaming, or do you all just nod along?)", "ESH, you clearly want to exclude Jessica,  just don't want to be rude about. Jessica is stuck with her shitty situation.", "all these people are kinda not getting it. no one likes everyone in their friendship group the same, that’s just like genuinely a fact, but you’re still inviting/not excluding her which is better than what some people would do. You’re allowed to make your own house rules and if that means no kids then no kids. if that only applied to jessica’s kids it would be different but i doubt you want kids in your house at all because of the dog and the couch. so my verdict i NAH\n\nalso as much as your friend was an asshole for saying that shit about Jessica, he’s also partly right", "ESH \n\nJessica should not expect you to allow her children in your home if she is not willing to watch them or pay for damages they cause. \n\nthe friend who said maybe if she screwed betters guys she would be able to have a babysitter is awful, what a terrible thing to say.\n\nYou say you are not excluding her and she is welcome to come if she finds a babysitter, but then you say you do not like her and would probably cave if it is somebody else so maybe it is time to stop pretending and just be honest with her so she can find new friends.", "I have kids. Mine are older now, but I've seen my fair share of vomit. Why did you have to replace your couch? There are tons of professional cleaners, which aren't cheap, but they're a HELL of a lot cheaper than a new couch. \n\nMaybe did Jessica offer to pay for a $250 cleaning and you refused and demanded she give you $5k?", "ESH\n\nYour “friend” group sounds awful.", "Homestly it's time you all had a talk. At least some of your group seem to dislike Jessica or at least not feel strongly about her.\nYou just keep pretending she is part of the group when that's actually isn't the case. Seems like since she is the only one with kids she doesn't really fit in anymore.\nOf course she has less time and isn't as flexible as you guys but it also seems like she doesn't really has anyone to help her out every now and then.\n\nIf you don't like her be honest, cut the friendship and stop inviting her. No one needs fake friends.\nI would still say NTA for the no kids rule. You have good reason to not want them at your house.\nA relaxing evening with friends after work is not a place for kids regardless and that time would be too late for toddlers to be up anyway", "I'm gonna go with NTA because I can personally relate. I (30F) have a large friend group and until 2 years ago when I had my son, nobody else had small kids except for one couple who had kids at like 20. \n\nProblem is whenever they are invited, they bring their kids with them and they let them do whatever the eff they want. One of them once came walking out the house with my husband's Xbox.. he was 4 at the time and it easily could have dropped, and the parents do not have the funds to replace anything their kids break. The parents did nothing except instruct the then 6 year old to . Then roll around to our housewarming at our new house - They brought their kids and refused to watch them properly, they teased my german shepherd and now he hates kids that are not my own. \n\nSoo.. when we have get togethers now and I have to host, I purposely exclude children (even my own) and make it an adult only event so that they don't feel excluded but also so that I don't have to spend all evening worrying about my dog or worrying about their kids getting up to shit. It's crappy because now I don't really get to incluce my own children at events we host so that I can tell others with kids to leave them at home. All because one couple cannot handle their 3 menaces.", "NTA Jessica is a mom now and needs to deal with that. Also if  no one really likes her make  another group chat without her", "Y T A for paying 5 grand for a fucking couch.", "NTA. I was on the opposite side of this argument in my 20s. Most of my friends had kids. I was often (usually) excluded because I did not. Everything was \" family friendly \" and revolved around the kids. I'd hear things like \"oh, we didn't think you'd want to come because the kids will be here\".  I eventually gave up on those folks and found different friends. I didn't resent them, we just had different interests.", "YTA. Just be honest and don't invite her. Stop making shitty excuses.", "NTA. It is dangerous to have children around your dog if it's afraid of them. Who knows what could happen?\n\nCurious though, why is she in your friend group? From your comments and some of your other friends, it doesn't seem like she is liked by the whole group.", "ETA: NTA \n\nMaybe just say when the kids are a bit older (5+) and can sit down and watch a movie to let all the adults relax/not annoy the dog, then your stance on children in the home will change, but for now, you’d prefer she hire a babysitter. I mean, if it were my friend who was a struggling single mum, I might suggest to all the friends we chip in $20 each towards the babysitter so she can come for a few hours. I’m sure then she’d feel valued.", "N-T-A for not wanting kids at an adult party.\n\nBut absolutely YTA for shaming your friend. \n\nYou know what adults with 5,000 dollar couches do? Speak civilly and kindly to their friends. Make sure no one feels like they are being shamed and mocked in their friend group. \n\nAdults don't triangulate, \"we all think...some people say...\" \n\nAdults don't live their life by consensus, \"two people say....one people says....four people say...\"\n\nAdults can hold their boundaries and be kind.\n\nYour whole friend group sounds exhaling and immature. Hangin out with the kids sounds funner then coming to your house and backstabbing the friend with the kids.", "NTA\n\n You have the same rule for everyone, so you're fair. I wouldn't let them come either after her kid ruined your couch\n\n>And two think that I should just let her kids come.\n\n Nrxt time, these 2 can host at their house and let anyone come.", "NTA as a parent myself I completely understand your rules about not wanting kids in your space if you aren’t used to them, kids are messy. But the comments about making better choices or whatever was unnecessary. And then you said you don’t even like her, why even invite her in the first place? Being a parent is hard enough when you have a partner to do it with, being single and raising kids is a whole other level of difficulty. It just sounds like y’all need to cut the shit and just tell her you don’t want to be friends with her. It will save her time and allow her to find friends elsewhere, instead of people who just tolerate her presence.", "ESH\n\nYou’re AN asshole, but maybe not THE asshole in this situation. As people get older they start to have families. Are you eventually going to stop inviting all your friends around?\n\nETA I have kids, I would’ve offered to pay for the cleaning of your couch. But I’m also a nice person and I would never take money from a single mum if one of their kids did it to my couch. Especially if could casually afford to replace it for 5k.", "NTA for the actual reason you feel like one, though outside that reason it’s questionable", "She didn't make those comments.", "Eh.. Do we have to be kind to dumb, immature, irresponsible decisions?\n\nSpecially ones that are then sprung on someone else?\n\n2 kids, 2 dads, both not there. All by the age of 20 something, right? \n\nI know the type, I have a niece who is a product of that type of person..", "Are those comments false though", "Right they sound insufferable", "What does it matter that some of the other reasons are far-fetched as long as there is ONE reasonable \"excuse\"? If someone doesn't want kids in their house because they have had prior incidents where their dogs have reacted poorly to kids, does it matter that they don't enjoy hosting kids that are too young? The latter does not invalidate the former.\n\nJessica does indeed need friends that have more in common with her. (BTW, Jessica was still welcome -- provided she found a sitter so she could attend a no-kids get-together.) There is nothing wrong with having kids, and there is nothing wrong with not wanting to have to host kids. But you're coming off just as judgmental of OP for their choices as the \"friend\" that make the snarky comment about Jessica's sex partners.", "You must be a shitty mom/dad who is exactly like this :’)", "You can’t read? She stated more arguments than one for not wanting kids in her house. I wouldn’t want them either if they’re misbehaved like that", "OP admits she's not jessica's friend and that they just happen to be in the same circle", "An entitled parent who pushes her kids off on others and won't pay for the couch HER kid ruined needs better friends? No. SHE needs to be a BETTER friend.", "Oh yeah. Jessica sounds like a great friend. Who doesn't want a friend who fucks up your couch and doesn't pay, or takes responsibility for her kids behaviour?\n\n2 Jessica's for me please!!", "Why doesn't she offer to host? It doesn't have to be a big thing. Some pizza and everyone brings their own drinks. It would make things easier.", "Jessica needs to be a better mom and person", "How? They stated facts, mid 20 with already 2 kids from different dads? Lmao someone here is making poor life decisions", "Because they don’t wanna hang with a shitty entitled mom? Ok.", "referring to her children as “her poor\nchoices” is misogynistic and gross", "The majority agrees that kids aren't the world.  And everyone can say they don't want kids in their home.  It's the fact that he openly hates her and says and does rude shit. The ah behavior has nothing to do with the kids tbh.", "I'm a single mum of 2, and I can't understand the Y T A votes at all. OP is allowed to have who she wants in her personal space, and most people don't want their adult, evening gatherings, revolving around babies and toddlers. It kills the vibe. Also, the dog has a right to be safe in its own home. If the toddler pulls dogs' tail or pokes them in the eye and dog snaps, the dog is going to get the blame even though it is not the dogs fault. \n\nYes, it is crappy being a single mum sometimes, and that means I have to miss out. But it was MY decision to have MY kids, and on the rare occasion, I do get a babysitter for an adult hang out, I don't want kids there. \n\nNTA", "Nobody’s calling her an AH because of the kids. Yea her house her rules blah blah. \n\nBut They’re calling her an asshole because she’s fucking insufferable and doesn’t want to admit she just wants to exclude Jessica. She’s basically using the kid thing as a cop out because OP doesn’t want to act like an adult. \n\nAlso the comment about Jessica her other friends made was so unecessary. She needs better friends", "Scrolled too far to find this comment. Who replaces a couch because of BABY vomit?! With the cleaners and fabrics available now, I’m pretty sure some soapy water would have gotten it clean.", "Yup. I feel like Jessica is probably stretched so thin as a single mom of two littles. She needs a friend group that will lend her the support that she needs and want her to be able to relax too. This post kinda reminds me of how nowadays a lot of parents don’t have that “village” they say it takes to raise children. OP needs to just grow up and have a conversation with Jessica and end the friendship, and then also with the rest of the friend group so everyone is on the same page.", "oh she admits jessica is not her friend i only said they all sucked because jessica does try to pawn her kids off at events. and it sucks especially since i bet someone has mentioned it to jessica. and if they haven't they need to.", "THIS, thank you. There are babysitters. She just needs to put the effort into finding someone she trusts and then she can use them all the time. She's either too cheap and expects her friends to pick up the \"cost\" by effectively palming the kids on them, or she's too lazy and prefers drama to addressing a problem.   \n\n\nAlso the situation with the dog should make this incredibly black and white. The dog is a member of your family.", "And who replaces a whole couch because of VOMIT. \n\nOn another note. Happy cake day!", "What a stupid comment. Poor people are allowed to have friends.", "Then she comes up with a payment plan or some t other way to make even with OP. What she doesn’t do is just throw her hands up and think “oh well I can’t afford it I’m a single mom”. She chose to be a mom so she’s responsible for the damages of her kids. And since she didn’t take responsibility by replacing OP can absolutely hold it against her (which tbh I don’t think OP is holding it against her, they’re just saying the kids can’t come back. Jessica is still invited just not her kids who caused damage)", "Don’t you find it difficult to believe that she can’t afford childcare for a couple hours? Like there’s no cousin or something who can do it at a decent price? There’s gotta be a way", "She said a professional attempted to get the stain out, but it didn’t work. Also it’s a designer art piece type of couch (the one expensive furniture she treated herself with), there are no individual cushions so they can’t be replace either. Also the cover thing, I’m assuming a cover would take away from the look", "But she's happy to repeat them, and doesn't refute them with any sort of caveat.", "They’re not your children or your responsibility. Pointing that out only serves to shame them. And what does that do? You lot are really showing your true colors", "They don’t need to be wtf?", "I have a feeling that in 10 years you’ll all be cringing at yourselves for being so hung up on high school drama in your mid-20s. What is the game plan when your friends have kids? As a childfree woman, I get it, but this “I won’t be around kids” lifestyle isn’t sustainable if you want to keep your friends.", "Sounds like you didn’t like her before you even met. Jessica never stood a chance. Also, you’re super judgmental. What is the point of saying “her two fathers are both homeless drug addicts”?", "You're a judgmental person who expected a single parent to pay $5k for a lounge that just needed to be cleaned.", "You basically are saying that.", "If they still make the couch…you can often order replacement fabric and get part of the couch reupholstered too. \n\nI had to do that soooo many times for work.", "Because there are stains you cant get out of something?", "If a friend of mine brought their kid around and they ruined expensive furniture, I would expect them to offer to pay, and me not being an AH (I hope) would mean that I would have to turn them down. But they should offer! And probably try to give a gift of some sort in order to show they're sorry because if your kids ruin something, you take responsibility. Once the offer has been made and I've turned it down, this is then forgotten and definitely not something I would bring up again.", "This “friendship” has evolved to a stage where there is no common ground.", "Yeah like if I go to a BBQ party I’m probably there to relax with friends, have a drink, enjoy some food by a fire pit maybe. Not get barfed on by little kids because the mom thinks group gatherings = free babysitters.", "A kid puking isn't going to necessitate replacing an entire couch.  A cleaning?  Sure.  Maybe, at worst, replacing a cushion or two, which you can have the store you put based the couch from order for you.  Should the mom have offered to cover that cost?  Yes.  Cover replacing the entire thing?  That's unreasonable.", "OP didn't have it cleaned. OP replaced it. I have no idea WHY OP wouldn't have it cleaned for $250 or less rather than replacing a $5k couch and demanding Jessica pay for the replacement. I can't think of a single reason to do that, other than to flaunt money.", "The toddler didn't destroy the lounge by puking on it", "NTA, you don't want kids in your house and you are free to make the rules.", "Have you ever tried to get child vomit which can be bright orange out of any furniture.", "It depends on what this child had eaten when they puked. If it had been blackcurrant juice and spaghetti plus a cup of milk, it might have been very hard to get rid of the smell and colour.", "And who owns a white couch if they have a dog?", "THIS! Plus who owns a $5,000 white couch and has \"dogs\" I mean unless you can afford to replace them $5,000 white couch without every blinking and eye or mentioning it in a reddit post. (I know someone like this and she would die before ever mentioning the cost or griping...she just replaces because it's Tuesday)", "Yes. A white couch in a rural area with dogs, that has to be replaced entirely because a toddler threw up on it? I’d definitely offer to help clean up the sick but replace the whole thing? Someone is taking the piss here, and I’m not convinced it’s Jessica.", "*Also, who spends 5k on a white lounge and doesn't have it protected by getting it scotch guarded or the like, and also who buys a lounge that colour where it's unable to be cleaned…*\n\nAnd someone with a dog no less. Not buying this post.", "Ps. Don't use scotchgard, that stuff is toxic as FUCK. it contains PFAS, an emerging class of toxic substances. Avoid at all costs.", "While I completely agree that op is TA for using jessica’s situation to exclude her I disagree with the judgment of op for owning a white couch…. Op has no children so in her house a white couch might make sense to her and her husband because it is expected that the two adults living there can/will keep the couch clean", "I think OP is lying about the price and having bought a new sofa.  OP doesn't like Jessica and is arranging situations to exclude her.\n\nYTA", "You realize “facts” don’t need to be pointed out right? Especially when it serves no purpose but to shame someone?", "No it's not. If you have kids, you can't expect the world to cater towards their needs all the time. They are YOUR responsibility, the fact that Jessica insists on bringing her kids to places where she isn't welcome and makes other people watch them is already entitled as fuck. This goes for both single women and men.", "Sounds like Jessica is irresponsible and wants other people to take care of her, likely, poorly raised kids. OP didn't say anything about her not coming but they are probably also sick of having to deal with her kids and have some disdain because of past experience", "Why is it on the rest of the friend group to raise her kids though? OP made it clear that Jessica forces her kids onto other people\n\nAlso, maybe if she didn’t cheat on one of the groups’ brother they’d be more supportive of her", "could jessica realistically afford to pay for the cleaning or the replacement couch?", "Then your cleaner completely sucked and shouldn't have been paid. I get red wine, pasta sauce etc off mine with a cheapass green machine no problem. The quarterly pro cleaning gets it factory fresh. Now i put dog pads and a washable cover on for when party people are over. You have to reupholster or recover white couches every 2 years anyways and a 5k couch is city furniture type cheap, so if it's under 5 years old the warranty covers it. Just have her pay half or most of that cost. You decided to do the most expensive option on purpose. It has nothing to do with the kids.  Im not pro kid and she should pay for the cleaning or upholstery. But you did the most financially and sustainably reckless option. Even if you took her to court they'd never have sided with her covering a new couch.", "Jessica sounds like a train wreck of a person tbh. Truth hurts kids make you poor being poor is hard. Government assistance is a thing. If someone shoves a baby into my arms while I’m drinking / drunk that’s the last time I’m being put in that situation.", "Whether I find it difficult or not, if she says she can't, I'll choose to believe her.", "She is repeating them despite having nothing to do with the story. She clearly endorses them and use them to help her reach some sort of moral high ground", "Exactly!! They AREN'T. And someone wants to make them someone else's responsibility and are trying to shame them for not taking that responsibility. Fuck. That. Shit.", "It sounds like most of these kids come from money and Jessica doesn’t to be honest. This is obviously about the person and not the “rules” OP is either too much of a coward to say it or enjoys torturing Jessica.", "Please explain to me why having kids with homeless drug addicts who make her a single mom and pay no child support is in any way a good sensible thing to do in your opinion.", ">I hope she can get away from small town judgemental hell.\n\nWith decision skills like that, I doubt it, especially with 2 kids in tow. \n\nNTA OP. She can find other single moms to pass her miserable existence with. Looks like she's jealous of her childless 'friends' because they are not burdened like her.", "Some stains don't come out, especially when it comes to white upholstery.", "I know.  It's not that hard to sart another group chat.  One second I think OP is 14.   Then they are 90...", "You can just get the fabric changed though", "Also, if I was that mum I'd be far too embarrassed to bring my kids to that friend's house again, after ruining their couch.", "Let's be real... 5k for **replacing** (why not cleaning? Was replacing really the only option?) a couch is just outside the price range that many people can afford. So, if she doesn't have the money, I understand why she didn't offer... It's just too high as a price. If someone spilled a drink on it, would they have to pay 5k? It's too much and unreasonable imho.\n\nI think it's trickier if replacing it was really the only option... But I have the suspect it could have been cleaned in other ways tbh. Even the most expensive usually can. If it really was the only option (and if the host refuses to cover the couch as a precaution, since at this point it clearly needs it during parties), I'll be honest: I think the host should advertise how expensive and fragile the forniture is... So people can decide if the risks are worth it. If I spill a drink on someone's couch and they didn't give me a notice about how crazy expensive it is, I wouldn't pay 5k euro, honestly... I'll give 200 euro (or more, but not 5k)  and they figure it out a reasonable solution. I would feel scammed otherwise, 5k is not a normal scenario and you should have notified it imho.", "It's a WHITE couch!", "[deleted]", "Yeah exactly I am glad someone else said it. A whole couch?", "And it doesn't make you an AH for that rule", "It’s less about what they said and more about the tone of the post and what seems like an endorsement of what the friend said to Jessica.", "Especially the kids of someone that won’t pay the damages they cause", "You also have a 5k couch but won't help a single mother of 2 get a sitter to enjoy a night out with some fake ass friends..op is the asshole", "This was my thought, too, but I didn't want to get into a reddit battle over the limitations of home shampooers. Lots of kids' foods are high in artificial colors. I've seen kid puke that didn't come out no matter what method you used. Even milk can be oddly hard to get out of fabrics that can't be thrown in the wash. Ruined a favorite dress with a small amount of milk.", "Exactly. My friend’s child’s vomit was on my carpet  for no more than 2 mins before we started to clean it up. Resulted in a big orange stain that could not be fixed with a home shampooer. I had a professional come out and they couldn’t fix it either. I ended up having to replace the carpet.", "Yes. Some kid vomit looks like a radioactive burst of alien gloop.", "Yes, alll of the bodily fluids… it is usually not that hard, especially if you clean it right away. Folex spot remover, it’s magic. Also white is easier because you can bleach it. Getting it out of a car seat is an added degree of difficulty, but also not impossible.", "You can rent a Rug Doctor upholstery cleaner for less than $50.", "But can afford a $5k WHITE couch? If you’re in your mid 20s buying a $5k couch and would rather buy a second $5k white couch than even pay to have a cushion professionally cleaned I would think they could afford a shampooer", "If you get a 5k white couch, you should probably get cleaning supplies at the same time as you get it. Even without kids in the house, adults (even sober, but definitely when drinking) can spill things or sit in something that could stain or whatever.", "So you'd buy a whole second couch instead of the $100 shampooer?", "Don’t have a fully stocked household but has a $5k couch and a large house they own?", "Let me fix it for you.\n\nAn idiot in their mid 20s who rather spend 5k on new couch instead of max 100 on cleaning it... 🙄", "Not everyone let’s their pets jump on furniture.", "We have expensive furniture, our dog knows she can't jump in it because we didn't teach her to to do it when she was a puppy?\n\nDogs don't jump on furniture off their own, they do it when the owners taught them to do it or always picks them up and put them with them in the couch.", "Came here to Say this. A White Sofa with A Dog . I smell Shite.", "Yes, that was another point I made in a reply to someone who took offense at my lounge comment, just because they're 2 childfree adults, I said well they have dogs too?", "Oh I do. The way she talks down about those less fortunate (still looking at you Jessica) and her gaudy life style. This woman was born with a silver spoon in her mouth that has never been removed.", "Agreed. This is made up.", "It doesn't anymore", "I didn't say she couldn't have a white lounge and didn't judge her for having one. But she has dogs, and if you're dropping that kinda cash on a white lounge, or any for that matter, you get the material protected, and I struggle to see why it couldn't be cleaned and had to just outright be replaced", "Why? Because she doesn’t want other people’s kids forced on her? News flash, your kids are your problem not every other adult in your friend groups’", "Referring to kids as \"poor choices\" has nothing to do with what you just said...\n\nIt is an awful things to say. There is no if or maybe about it.", "I’m not saying Jessica isn’t at fault either. That doesn’t mean OP isn’t an ass", "Yeah “ bend your life around my poor choices and support me no matter what” reeks of entitlement.  yeah you can’t come you’re being excluded because of your choices. Sucks to suck", "How is she asking anyone to raise her children FFS. Such exaggerating nonsense.\n\nShe's a single parent and obviously struggling. She gets to go out once and it is her chance to have a little break. Sure you can be an inconsiderate arsehole to your supposed friend by not helping with the kid for a few hours, but don't act like she is trying to not parent her kids because she is trying to have a break. BTW in many social circles and cultures it is normal for people to take kids off the parents during group events to help them have a break. That is a communal way to deal with parenting and most people aren't hateful towards their friends or the kids.", "It's a bit shi*ty judging her choice of furniture based on her having pets. Pets can be taught not to get on the couch and taught not to chew furniture,  that's pretty much all you need to not have problems. While on the other hand,  as a parent you must be prepared to replace anything your child may ruin. It's just common sense as most people can actually sue you if you don't. Especially if it wasn't a friend's house but a museum or some other public/ government owned place.", "She was informing us internet strangers about her groups split decision on the situation. She heard what her friends had to say and is now asking the internet. To say it has nothing to do with it is very disingenuous.", "I bet if Jessica won the lotto at the weekend she’d suddenly be welcome.", "Oh, and they all bad mouth and trash talk anyone who isn’t there.", "If any of this is even true.  There so much lack of common sense in their post and their responses.", "You know that most homeless drug addicts haven't always been homeless drug addicts... Yeah?", "Jesus Christ do you people seriously not hear yourselves ?", "If only there was another way to invite people...", "Then you don't buy a whole new lounge, you reupholster the section or many other alternatives. Honestly. It's clearly a bullshit post.", "If anything, starting another group chat with only Jessica excluded would be even more passive aggressive / a signal that she has been cut from the entire group.", "She's a single parent and the OP expects her to pay 5k for a whole damn couch when it needed cleaning. I call bullshit", "Most owners have a place they can temporarily put their dogs, it’s not unreasonable for most people lol whether it’s a backyard, a bedroom, whatever. Have you never had guests that were afraid of dogs? Or needed to put them away for utility workers? There’s no “right” answer here and it’s really weird for you all to be *this* “objective”", "…. Hosting is not an obligation. You said it yourself. Why offer if you don’t give a fuck about one person? Just don’t invite them. There’s nothing to complain about when you stop being passive and childish", "Yeah, when we were kids mum took us to the house of a woman she was in a mother's group with and the other mum was like \"the kids are fine playing in here\", in a room that had white furniture and carpet and my mum was like \"I think you're overestimating my children, they will destroy this room\" and wouldn't leave us alone in there. I still think op could have done more to clean the couch, but the other woman should have done more to address what her kid did.", "If you had coloured food or drinks, it leaves a stain that cleaning wouldn't get out. \n\nI was sick once and had eaten orange puffy crisps (don't remember the name) and I threw up on my cover. Even after washing it, it still had an orange stain. And you can't exactly pop a couch in the washer so your options to clean are limited.", "Yeah, I definitely agree with this. If everybody was acting reasonably, Jessica should have offered to pay to have it cleaned and op could have taken that offer or not without being the ah.\n\nIf you invite guests into your house, you accept that things can get accidentally damaged. I said in another comment that adults can make a mess almost as easily as children, and if she's not comfortable with potential damage to something, maybe warn people. I wouldn't judge somebody for a couch that was expensive and they were careful about, but I probably wouldn't sit on it, with that warning, in case I had some dirt on my butt or got my period unexpectedly or something.", "Have you never seen what happens with a kid that has had too many grape sodas and literally sprays puke everywhere within two or three feet of themselves when throwing up? It is not a pretty sight. Yes, it could definitely ruin the upholstery on a white couch that a cleaning could not be enough.", "Some stains can't be removed, or the smell.", "Not saying it’s right, but considering they bought a 5k white couch twice + a big house, I can see why she’d think they don’t need it. Seems like a friend group with a lot of resentment", "It's not her responsibility to subsidize the woman's childcare.  The friend is welcome to host instead as OP said.", "Are they her children?", "Why on earth should op pay for a babysitter??", "If you can't afford a sitter when you need it, DON't HAVE KIDS! Don't expect your friends to pay for YOUR CHILDREN so you can have a night out. \n\nA single mother of 2, from 2 different dads, neither of whom are in the picture, she needs to get her act together and make better choices for herself and kids, and not blame others for her shortcomings.", "Hell, getting it professionally cleaned would have cost much less than $5k.  But OP's tone I doubt she would have accepted anything less than full replacement.   I'm with the ESH crowd.", "Or buy a secondhand Bissel with furniture attachment off Marketplace/Craigslist for $40", "She did have it professionally cleaned, as she states in a comment.", "Plus OP has dogs! Dogs can absolutely puke on things, scratch things etc and do as much damage as a child, if not more", "Um, yeah. Housing is a necessity. Furniture is a necessity. (And someone who is building their life and acquiring these necessities is allowed to buy what they want). An upholstery cleaner is not a necessity. I don't know why you're assuming it's a standard possession to own.", "Bruh I thought I was *so* grown up when I bought my first $300 Ikea couch when I was 27 and you better believe it's spotless. I spent 6 months paying that off I'm gonna take care of it for at least 10 years no matter how many people puke on it", "We don't know that she didn't try cleaning it or having it cleaned.  \n\n\nETA: OP states in another comment that they DID have it professionally cleaned.", "They don’t need to.", "It still does. Its not PFOS, but PFBS, which still falls under the umbrella of PFAS, and I personally don't trust the 3M company to give accurate safety information, as they lied about the effects of PFOS for years now.\n\nI have a feeling that PFAS will eventually exceed lead in the amount of damage done to a population. And there's still a ton of lead based paint in older buildings, a toxic legacy that has poisoned people for generations.", "Not to mention the risk just inviting people over to drink and eat (like for a smokey, sticky eat with your fingers BBQ, with (possibly inebriated) people walking in and out of a house in a rural area) At some point an accidental spill or mistake is bound to happen. No matter how careful a person is, at some stage it’s going to happen - even if it’s just once.", "Not every dog gets on the sofa. The OP is child free and doesn't allow kids into the house is might not feel she needs to have something over the sofa to protect it.", "It literally says in the status that she tries to push them off on other people\n\nThere’s nothing wrong with her having a little break, what’s wrong is expecting your friend group to put up with your kids when they’re enjoying their own little break from their daily lives and responsibilities \n\nIt’s insane that you don’t realise Jessica is being an inconsiderate asshole by EXPECTING her friends to look after her kids. If the friends want to help that’s fine, if they don’t want to help that’s their decision and parents can’t be made at people for not wanting to mind someone else’s kids. \n\nGood for those many cultures and social circles, in mine you parent your own damn kids unless someone offers to help", "But a couch isn’t art, it’s a piece of everyday furniture. It sucks the kid puked on it and that the obviously rubbish cleaning crew couldn’t handle it but at the end of the day, white couches are going to take a hit. Be it coffee, wine, whatever.  We get the feeling that if it had been one of your actual friends this wouldn’t have been such a big issue.\nSurely you have home insurance anyways?", "Do you not take your dogs outside? What happens if they see a child in the \"wild\"??", "Oh cool!  Animal abuse!  You sound like a swell owner!", "No they were born that way and always have been and always will be, don't you know anything???", "People like Jessica don't hear themselves, or anybody else for that matter. That's why they go on making the same dumb choices again and again. Give 5 more years and two kids will become three.", "I think they mean she’s in the friend group so she’s going to find out one way or another. Unfortunately being passive aggressive doesn’t solve most interpersonal problems, and being assertive is polarizing.", "And assume no one on the group chat would mention it or talk about it?", "If only….", "Evite suddenly becomes relevant again!!", "I will say that sometimes in these long-term friend groups people will turn on you if you make decisions against people or state you don’t like them even for totally valid reasons. I had a friend group almost collapse because we wanted to (and did) oust someone who was actively, repeatedly trying to get with another member’s girlfriend. And then 80% of it fell apart because they wouldn’t stop inviting some of the most inappropriate people I’ve ever met to hangouts.\n\nThankfully I live in a populous area but OP may not have the luxury of finding another friend group.", "But OP is not Jessica's personal friend. I agree Jessica's close friends should absolutely find ways to hang out with her that accommodate for the fact that she is a single mom. I don't see why the events hosted by OP are the sole opportunity to hang out.", "The dog lives there.  The kid does not.", "You’re right, there’s nothing to complain about when you stop being childish and expect everyone to cater for you and your kids. I’m glad we agree.", "Or strawberries. With my toddler it was throwing up a load of strawberries.\n\nLuckily, our sofas are brown and can be scrubbed pretty hard!", "Um, you must have missed something because OP states she is the ONLY one who can host. Seriously, her attitude IS exactly what entitlement looks and sounds like. None of yall had parents with good China that would get put up when guest come over? Same thing. She hosted, so she knew what what was up for.", "Does she want her friend to attend? I don't know about you, but if I'm hosting friends I do things to make it easier for them to come, not harder then blame it on them.", "I didn't even think about that! Honestly, if I had dogs, I wouldn't get a white couch. You can still get a nice couch, but a white one is probably going to backfire quickly, unless you get the special fabric that's specifically designed to be pet friendly, but if OP had done that, a child puking wouldn't have been a problem.", "Kid puke is greater in volume and worse in smell than dog puke.", "All I can think of in my head is the scene from hocus pocus, and OP everytime she looks at the lounge going, *I smell CHILDREN* and deciding it had to go, idk", "Well, if I have a nice couch I might want to not cover it ruining the aesthetic? With an adult, the same thing holds true, of course they are responsible for fixing it. Why should the owner of the couch be liable for the damage some baby or other adult does?", "Animal abuse? By teaching my dogs gently that not everything warrants a bite? I wasn't ripping their fur out, noe was I punching them 🤣 it's called prevention training", "It’s explained in the post but…honestly these people just sound lazy. There’s nowhere else to go and nothing else to do other than go to OP’s house? What is everyone else in town doing?", "No one said they NEEDED to. The point is that we can all CHOOSE to be nice and compassionate people who are capable of granting understanding and grace to others. Jesus Christ", "They are not her friends if they are not willing to accommodate and if her having kid is showstopper.\n\nThey are acquitances she is stuck with. But they are not her friends and never were friends, just someone who pretends to be one when it suits him.", "Jesus Christ it’s a suggestion and a reasonable option that most people offer anyways. Both of you have valid points however it is so odd of you guys to be this defensive of normal things", "Well, we don’t know what the fabric may have been or if it was a teeny little 2-seater or a mult-piece sectional. And it’s not as if anybody is here to judge OP’s couch choices. Op says you can’t clean the couch so I take it as face value.", "The friend could still try to figure out how to host I'd she really wanted to. Either that or quit whining that her ill behaved kids aren't allowed.", "Yeah, it’s way easier to teach a dog to put up with abuse then to teach kids how to behave around animals.  After all, if the dog fails the test you can just kill it, right?", "It cannot be understated how badly ESH.", "I think the single mom will find herself friendless based on the ops comments. No one wants to be taken advantage of and forced to watch a kid that isn’t theirs while their mom parties. She chose to have her kids/keep her kids so if that means she has to stay home with them then that’s just how it is. Kids/toddlers don’t belong at parties with people in their 20s who are drinking and having a good time; that’s just bad parenting to even consider bringing them", "It sounds more like they’ve been stuck with her….", "Someone who trained their dog well.", "Not all dogs are allowed on the furniture", "exactly my thought. went into different scenarios, dog wearing pajamas, crate training, most obedient dog of the year prize… we clean our paws before we enter the house! rules", "I didn’t say I had a white couch I said I had a dog puke on a rug. And I imagine if I couldn’t get it out of the rug no matter what I did, a white couch would be impossible. Only crazy people own white couches and also have a dog.", "Ill behaved? One is literally a baby, the other a toddler.  There is no such thing as behaved or Ill behaved at that age.", "Also, I want to say 1 thing, if this was male OP running q mother and kids through the dirt.. yall would've already grabbed pitchforks and torches to storm the gates.", "To your comment about asking for it I mean. Because by your logic anyone with kids that’s poor shouldn’t be invited anywhere unless the owner of property is prepared to eat the cost of damages by the child. And if they’re not then they should just never invite over the friend? (even tho it’s very reasonable to expect for restitution no matter who damages your property)\n\nOn your solution: OP sent a message to their larger friend group inviting any of them that the plans worked for over. If the plans don’t work for Jessica then she’s free to make her own or not come. You don’t need to cut people off just because they’re not your best friend or can’t accommodate them. Life isn’t that simple. The invitation is there for the taking if Jessica wants it & no one is forcing her to go or not go. Come or not. Also it’s not 2 faced and I don’t see how OP is being that. You don’t have to get on with everyone in a large friend circle but it’s still courteous to extend the invitation when your hosting (and tbh Jessica should feel lucky she’s invited over again at all after the couch fiasco)", "No, but the parent should have asked to sit anywhere else where there wasn't an expensive couch... The mother and children could have sat on a chair. The mother can also use her brains to prevent things like this.", "My kid knows how to behave around dogs and my dogs know not to be afraid of babies because unlike popular beliefs, baby's grab at stuff without realising what they do. Toddlers should know better and should be the ones taking responsibility of their actions.", "She can become friends with other single moms then. Agree with your other points.", "And with dogs, while no supervising her kids!", "Real friends are usually happy to hold their friends baby for half an hour.\n\n>that’s just bad parenting to even consider bringing them\n\nIt's a BBQ, not a rave.", "Obviously you've never owned a dog 🤦‍♀️\n\nThe best trained dog will still shed hair, and puke if they're sick. Training a dog to not jump on the couch isn't a magic solution to stopping either of these things from getting on the couch 🙄", "But not well enough to not growl at kids \n\nMy well trained dog had unfortunately had his tail and ears pulled by kids previously. He’s still well trained and doesn’t growl at anyone.", "Ok so if the dog sneezes too hard too close to the couch and snot goes flying on it…. Is that part of training?", "I was agreeing with you and referring to OP about the couch lol", "Sure there is. Toddlers can be told no. They can be taught to mind. Instead she just pushes them off onto other people instead of being a parent. \n\nOf course she isn't going to be welcomed with her kids in that situation. She can host, or she can shut up.", "I don’t think it’s the toddlers responsibility to be aware of their actions, it’s their parent’s responsibility.  I think no matter how well behaved the dog, children can be unpredictable.  They’re small and move unpredictably and make dogs nervous.  It only takes a second for something horrible to happen.\n\nAnd most dogs don’t automatically resort to biting.  They try to get away or they growl.  If a child is climbing on the dog like furniture or yanking it’s ears or tail, the child shouldn’t be interacting with the dog until they can understand how to treat the dog.  They usually only bite when they’re cornered or they’ve been taught not to growl.\n\nBut it’s just not worth the risk, because say the dog has a small injury on the ear or tail that’s being yanked on?  No matter how well behaved the dog is it might snap at the child.  A split second response that it’s not even in control of, and something horrible could happen to the child.  Not worth it.  All interactions should be very closely supervised until the child is old enough to learn how to understand what the dog is “saying” and when to give it space.", "I am not comfortable holding my SISTER'S kids for five minutes. I would not hold my friend's kids for anything less than an emergency.", "I’m not comfortable holding any child for a half hour, except in emergencies.", "My dude. No one wants to hold your literal baby for 30 minutes. If that friend likes babies/ your baby then maybe!!! \n\nDon’t just assume that about people. They also do not care about seeing pictures of your baby doing activities. They are pretending because they are your friend.", "The op said in one of their comments that as soon as the mother arrives at these get togethers she hands off her kids so she can drink or do whatever. That’s irresponsible and makes it sound like she’s there to take advantage. Maybe if she asked instead of just expecting people to watch her kids it would be different", "Of course it is not the solution, but you can train dogs to not go to specific rooms for example. Like a lot of people train their dogs to not go into the kitchen.   \nYou need to train your dog according to your needs. If you want a white couch and a dog you should probably teach your dog to really stay away from the couch.", "I own a dog and a white couch. Our dog is trained not to go onto the couch or go near couch; she doesn’t shed either. This is not some far fetched scenario.", "That’s a risk someone can choose to take, or not. Risk/reward of owning a dog doesn’t necessarily equate to risk/reward for having unwanted kids in your house.", "u train them not to shed", "I have to be honest, i think the growling is tolerable. At least it is better than if he would just start biting.\n\nOften situations where dogs bit someone \"out of nowhere\" happened because the warning signals the dog sent where either ignored or worst case he even got punished for it. So the dog learns that warning does not help him so he goes straight to attack.\n\nI am not saying that you dont have to train the dog further by showing him that these interacions with kids can be nice and rewarding, but as a start you have to accept that the dog does not like it an shows this, and work from there.", "That's why you never leave a child unsupervised. My son was/is never alone with none of our dogs, big or small. But it was my responsibility to make sure my dogs also knew that no harm would be done to them. And I did this by gently tugging at their tail while sleeping so they learned that this wasn't meant to harm them. Same at their ears etc..\n\nI never hurt them and they never even growled at any child. Even now, I only allow children to pet my dogs when they ask and still I watch with a hawks eye. I had a boxer, husky and Labrador"]}