{"id": 17038, "submission_id": "13ffsx4", "title": "AITA for telling my mom I am not babysitting her stepdaughter for her?", "selftext": "My mom is married to Joe. Joe has a daughter April who's 7 now. Mom has me 17m, my older brother 19m and my older sister 20f. Our parents are divorced. My siblings and I chose to spend more time at dad's house when we got old enough to have that decision. Joe is battling cancer and has been admitted to hospital to undergo treatment and there is no real idea of when he gets released yet. My mom is looking after April and is struggling to juggle everything. She asked my dad if he could watch April after school for her and he said no. She asked my siblings and they said no. Then she asked me and I also said no, but she pushed harder for me to do it because I'm local and I am her kid and she thinks I should want to be there for April. She considers April mine and my siblings little sister while we never saw April as a sibling. She's just Joe's kid. Joe's just Joe or mom's husband. We're not close to them. We're also not very close to mom. Mom told me she needs someone and I am the only one left who can realistically do it. I told her I won't babysit and that's final. That she can pay someone else to do it or figure out alternative arrangements but I'm not interested in helping.\n\nAITA?\n\nFor some bg on why the not so great relationship with mom. She messed me and my siblings around a lot after her and dad's divorce. She had so many boyfriends, moved so many guys and their kids in, would expect so much from us regarding being a family and no relationship lasted very long so we moved around a lot with her, had people in and out of our lives and she was critical of us not bonding with them. One guy she was dating for three months, broke her lease to move in with him and when they broke up we ended up moving again and then she had another guy living in that place two months after we moved in. So we were never very close to her. Dad was our constant. He was our support. And it was too late for mom to undo all that crap when she did settle down with Joe.", "created_utc": 1683882992, "permalink": "/r/AmItheAsshole/comments/13ffsx4/aita_for_telling_my_mom_i_am_not_babysitting_her/", "score": 2996, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I told my mom I won't babysit her stepdaughter for her and made no room for compromise when we talked. She is my mom. Her stepdaughter is only a little kid with her only parent sick and maybe it's being an asshole not wanting to help out knowing everything that's going on.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. \n\nShe didn’t prioritise you over her rotating stream of boyfriends. But now she expects you to drop everything to babysit? \n\nYou don’t owe her anything. Don’t let her guilt trip you into agreeing to something you don’t want to do. This is a situation of her own making. Not the cancer part, but the being isolated from her children part.", "NTA\n\n\nI never understand parents who remarry and demand that their children see the new stepsiblings as full siblings. There is a reason why you (and your siblings) chose your dad. At 17yo, you have your own life and friends and honestly, you don't owe your mother anything. Not after how she messed your life and your siblings's.", "NTA. Your mom has been quite selfish so I don't see anything wrong with you not babysitting her stepdaughter", "NTA. Blended families are hard, they take patience and work on all sides. Her marrying Joe does not automatically make you one big happy family, no matter how your mother feels about it. She does not get to unilaterally decide what sacrifices you would be willing to make.", "NTA, if you don't make the kid any and all babysitting is considered a favor or the job of babysitting for which you should charge upfront. Don't let her guilt you, two other siblings of yours already said no she's not your problem.", "NTA.\n\nI could have argued, that you help your mom, when she's in a troubling situation (and would have nothing to do with \"bonding\" with your step sis). But you seem to be rather distant to her for good reasons. It is her fault, that her children don't want to help her anymore. It's a harsh truth, but understandable.", "NTA. You don't owe her a thing. Let her hire someone or better yet, where is this child's mother?  Doesn't she have family?  Sounds like your mother never made her own biological children a priority.", "NTA she thinks she can pressure you into doing it because you're the youngest. Don't give in.", "Nta\n\nBut do you have a bad relationship April?", "Nta\nBut I feel really sorry for that little girl :(\nRemember she's a 7 year old child her dad is sick and she's also had to start with a new family most of who don't want anything to do with her.\n\nThat's not a dig because I fully understand all of you after your mums actions. \nWhat a hard situation. \nHopefully she can find a babysitter or childcare.\nWhat's worrying is I'f let's say Joe dosnt make it who's going to be responsible for April surely she and him have some family that can help?", "NTA-you don’t have to babysit, but I’m not a fan for how you told the story. First, own it. Don’t speak for your other family members by saying “we”. Second, you show no empathy for April. Yes, you aren’t obligated to help your mom, but April is a bigger victim in all of this. Her Dad is sick. She has been forced to move into another family home and she’s only 7 and from what you have said, is all alone. I hate that for her. Where is her mom?", "Normally I'd agree with you but this line changed my mind...\n\n>My mom is looking after April and is struggling to juggle everything.\n\nYour mother is asking for help and you are just dismissing it as it's not your kid and not seeing it as it truly is. She's not asking you to raise the kid, but to help her in the moment.", "NTA for putting up a boundary with your Mum but I would try and think about things from April's perspective.\nShe's only 7 and her Dad is sick, possibly dying.\n\nI'm not saying you have to be her brother but maybe spending some time with someone who she can have fun with might help her not be so scared.", "NTA for refusing to babysit.\n\nBut, maybe, *maybe*, your siblings and Dad can organise something to help her and the kid out? Between you 4 your Mom, maybe pay for a proper babysitter? I'm not saying you have to. But it would help the kid during a tough time, and also stops your Mom being able to play the \"you never helped\" card, later.", "Info: do you have a bad relationship with April?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy mom is married to Joe. Joe has a daughter April who's 7 now. Mom has me 17m, my older brother 19m and my older sister 20f. Our parents are divorced. My siblings and I chose to spend more time at dad's house when we got old enough to have that decision. Joe is battling cancer and has been admitted to hospital to undergo treatment and there is no real idea of when he gets released yet. My mom is looking after April and is struggling to juggle everything. She asked my dad if he could watch April after school for her and he said no. She asked my siblings and they said no. Then she asked me and I also said no, but she pushed harder for me to do it because I'm local and I am her kid and she thinks I should want to be there for April. She considers April mine and my siblings little sister while we never saw April as a sibling. She's just Joe's kid. Joe's just Joe or mom's husband. We're not close to them. We're also not very close to mom. Mom told me she needs someone and I am the only one left who can realistically do it. I told her I won't babysit and that's final. That she can pay someone else to do it or figure out alternative arrangements but I'm not interested in helping.\n\nAITA?\n\nFor some bg on why the not so great relationship with mom. She messed me and my siblings around a lot after her and dad's divorce. She had so many boyfriends, moved so many guys and their kids in, would expect so much from us regarding being a family and no relationship lasted very long so we moved around a lot with her, had people in and out of our lives and she was critical of us not bonding with them. One guy she was dating for three months, broke her lease to move in with him and when they broke up we ended up moving again and then she had another guy living in that place two months after we moved in. So we were never very close to her. Dad was our constant. He was our support. And it was too late for mom to undo all that crap when she did settle down with Joe.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. Daycare for April isn't your problem and you are not obligated to help out with that, especially given the history. Stand your ground on this and don't allow her to drag you into it.", "NTA", "She doesn't have a mother in her life but I'm not sure why.", "I don't have any relationship with April really.", "That's really not OP's problem though, may I remind you he's 17 and has also suffered because of his mom? Not everyone has it in them to constantly think about other people's feelings and experiences and especially not a 17yo kid. The fact that April is suffering because of this and that doesn't make it his responsibility to help her or make it better and how the hell do you expect him to know where her mom is? Bffr", "Some of it is stuff I have spoken to my siblings about, hence the we being used. I have no idea where her mom is.", "Mothers don’t get to ask there children to help with other peoples kids when they couldn’t even be bothered to be there for there own children", "I disagree the situation sucks but getting your 17 son to babysit a 7 year old that he basically doesn’t know and isnt related to isnt a great choice either. \n\nHowever if there are other chores etc that is something he should help with.", "It’s not the responsibility of OP, a minor himself, to take on the considerable burden of the adult responsibilities of his mother and her husband. Daily after school childcare is raising a kid, but OP is still a child needing a parent to finish raising him.\n\nThere seems little to nothing for OP in this parent/child relationship between himself and his mother, long predating his mother’s marriage to Joe. His mother is now struggling, that’s a reality worth sympathy, but it’s not something for a child who has suffered from her parental neglect to resolve. She failed him as a parent and he’s busy trying to mentally and emotionally deal with that, telling him to “look at things from her perspective” is incredibly dismissive of his reality.\n\nRight now the only thing on offer for OP in this relationship is unpaid labour. Thankless, entitled attitude driven, unpaid labour at that. He can nope that without qualms.", "So spending time with a stranger who has no desire to spend time with her might help her how exactly? Besides, at 17, i doubt op is willing to spend time with a 7yo whom he barely knows.", "Our dad would never. And honestly I'm not sure any of us care if mom plays that card with us. We're all not that close to her and don't really feel like she deserves help from us.", "I don't really have any relationship with her.", "It doesn't sound like Mom wasn't there for her kids, it's that she brought in other men and kids to their never settled, home. \n\nI think OP is, understandably, fed up looking after yet another of his Moms step kids (albeit April and Joe are in a real relationship with her).", "TBH, it wasn't her, more April, I was thinking of. But I certainly don't think you owe her that help, any more than any other kid facing the same problems.", "Then you shouldn't feel any obligation to do anything. It all boils down to if you want to help your mom or not. And I won't judge that.", "Bringing a string of random men home to your children and moving them in and out of different homes is definitely NOT being their for your children", "NTA. The revolving door of men proves she put her own life above that of her kids. Bit rich to play the family card now", "NTA. Your mother’s stepdaughter is not your responsibility .  She is not entitled to get help from you", ">She asked my dad if he could watch April after school for her and he said no.\n\nWhat is it with people asking their exes for favors like this? You don't have much of a relationship with your mom so her insisting you need to help her isn't going to happen. I think NTA because she needs to find steady childcare not continue to try to harass someone into it. \n\n>she thinks I should want to be there for April. She considers April mine and my siblings little sister while we never saw April as a sibling.\n\nThis is just unrealistic. There's also the issue that you are 17 and in school yourself. You probably have homework, activities, etc...you don't even live with her.", "NTA. I hope you can stand firm in your decision even though it must be hard. This is your mother's issue to deal with.", "NTA, most definitely. You replied in comments that you don't have any kind of relationship whit this child, so it would be strange for everyone. And second of all, you don't owe your mother anything, considering your past with her. She didn't put you first in any stage of her life, but instead all those men, which can be traumatizing even. Don't let her pressure or guilt you into anything!", "NTA You're not obligated to solve her problems for her. She's an adult and will have to figure it out somehow without relying on her children.", "NTA. Another case of c\\*ck before kids.", "NTA. Just saw the additional info why you and your sibling aren't close to your mom. I gotta say, I'm glad your dad is a stand up guy. \n\nRegarding your mom, Joe and April...\nLove is like a fart, if you have to force it it's probably crap.", "NTA, You don't have a responsibility to babysit and it's up to you. BUT: if a casual acquaintance asked me to help out with a child who was dealing with a parent with cancer, I can't imagine saying no. Let alone to a family member (unless that family member actively abused you or was unsafe). It isn't about obligation, it's about basic compassion", "Nta.  You can't force family.  Mom can't force you to take care of a 7 year-old because she has burned all her bridges.", "NTA.  Your mom put herself first all those years, it's time you do the same to her so she can maybe see what that did to you.  But don't take it out on the kid; it's not her fault.  None of this is.  Seems like she's as much a victim in this as you are.  I've had a stepdad.  He and I got along pretty well.  I learned a lot from him.  He helped raise me and he was as much a dad to me as my bio father.  But the one constant in that household was that Mom put the kids first.  (Me and two sisters).  They dated for almost a year before we even met him.  THey were together for about eighteen months before they decided to get married, and they asked us if we'd be okay with it before they made the decision.  But that's my situation, not yours.  You do what's best for you.", "Yta-just because the 7 year old needs help. Her dad is  extremely sick and she is just innocent. You don’t have to live her to give her help. I mean your step sister.  Also your siblings and dad are TA’s too.", "YTA. Your mom is going through a crisis and you can't be bothered to help at all? Sure, she's not perfect. Pretty sure you aren't either. But babysitting a 7 year old is easy - hand them a device and then play on yours. Done. Heck, you could probably have your friends over and no one would care. Try it once - see how you feel. O bet you'll be glad you helped someone out what was in a rough spot.", "I’ll say your on the line, it doesn’t sound like your mom, joe, or his daughter has done anything intentional (edit) harmful or disrespectful against you other then not being close to you. \n\nIf you have the time and it’s not a determent to you the decent thing to do would help out but it’s not necessarily an AH thing to say no\n\n\nEdit: Inactivity when knowing that said inactivity will lead to harm (especially of a child) is being an AH", "Yta\n\nYour choice to make, but I think kindness goes a long way. She's not asking you to watch your stepsister to go out and party. She is caring for a very sick man. I hate saying yta because I don't know your family dynamics but I know what it's like to see relatives sick with cancer and the toll it takes on the person who has to care for them.\n\nLeading with kindness is always the best thing.", "Soft YTA. Very soft. I'd have done it, not for your mum, but for April. She's a 7 year old who is about to lose her father. I'd see it as an opportunity to be her big sister sort of and be there for her for if she needed someone to talk to about her feelings. It's hard being a kid dealing with such a close death at a young age. I can see you've been terribly damaged by the way your mum treated you all, but I'd have done it for the innocent child in all this.", "NTA she has alienated a great many people in her life and this is the result as none of your siblings want to help her. you are not along because your siblings are doing the same thing.", "I can’t stand parents like these.\n\nShe wants to fool around. That’s fine, people can fool around and their relationship is their own business. We are no one to police that.\n\nHowever, this changes once someone has children that they are responsible for. Mom can no longer fool around and move in with her next fling and try to mingle two families in such short notice… she’s playing Happy Boyfriend and Happy Family but this is not a game. Fooling around days are over once she was responsible for raising her children.\n\nNo wonder OP and siblings wanted to stay with dad. They need a rock in their life. I’m sorry to hear that only one parent could step up to the task.", "I have never seen any family of April's around other than Joe. He's estranged from his parents and has no siblings, I think. No sign of any maternal family either.", "How is my dad an AH? He has nothing to do with her?? He's not her family, he's never even met her.", "I'm not perfect but if I had a kid or kids, I would do my very best to give them stability and I wouldn't bring random people in and out of their lives the way she did to us.", "Lol, I can never get enough of the sheer audacity some of you have.", "My mom gave me no stability when I was a kid. She was moving around, bringing random guys and random kids into my life all the time. That's pretty wrong in my eyes.", "NTA I think the mom burned the bridge with the kids by moving them around and prioritizing her wants over their needs. When you do this there comes a time no matter who your are people are done with you.\n\nIt’s not op’s responsibility to pick up the slack here. I think op and his siblings suffered a lot at moms hand. They don’t owe her anything.", "You do it then.", "Sounds like mom's problem. She didn't care about her own biological children, and they were supposed to care about her? Where is your outcry for OP and his siblings? Caring isn't a one-way street.", "Such a martyr", "Well, it's not your problem, and you're not obligated to do anything.", "I'm sorry you had this experience with your mother it's likely to cause a lot of long-lasting pain. It also sounds like April will be having a hard time, she may be about to lose her father and with the only parental figure left being your mother you understand the position she may be in.\n\nSometimes life is not fair but sometimes you have to treat life better than it has treated you. It sounds like April might really need a big brother here, it doesn't have to be you but her life and world would get a lot better if it was you.  \n\n\nI think you'd be fully justified in saying no, but I also think you have opportunity to be very kind to a kid who really needs it, and it would be remembered.", "Ignore it. Some commenters on here lack reading comprehension and some think that women can do no wrong.", "None of you are THE A H. However I think this is a good opportunity to show some compassion. Pass along a little good in the world. Even if your mom doesn't expressly deserve it. There is a child and cancer and it wouldn't be hard to set boundaries on how often you watch the kid. It's up to you.", "Your dad isn’t the AH. It’s unfortunate what is going on with Joe, but that’s not your dads problem.", "He doesn’t live with the mom. Why should he help her. She ruined his and his siblings childhood. \n\nMom lost all rights to ask her children to help. Being alone and your children not wanting to be around you is an consequence to her actions.", "Yeah, I was amazed by the audacity your mother showed by asking her ex-husband to babysit her stepdaughter.", "I get that. I don't think it's in me to be her big brother. I have zero interest in the kid. But I understand her life might get a whole lot shittier than ours was because we had dad at least and she might end up with just mom if Joe doesn't get better.", "Go and volunteer at the big brother/sister program if that’s so important to you.", "NTA - does Joe not have any family who will support care for April? Can mom not afford a babysitter? Why is her 17 year old son, with whom she has a strained relationship, the only choice here?", "It's a truly sad situation. NTA. I would be more likely to babysit for a distant acquaintance than I would expect you to help your mother out. It's one thing when it's someone you vaguely know and don't care about other than human compassion. You have real anger towards your mother, justifiably so, and probably should look into therapy to help get over it. Keep your distance as you need, it's OK, look after yourself.", "Nta", "NTA. Her responsibility.", "NTA\n\nYou said no. She needs to figure something out.", "NTA. It's not your problem that she has no one else to rely on. Absolutely, she should pay someone to do it.", "NTA, but feel bad for April...  She a young child, her father is very ill & nobody really wants her", "Nta that sucks for April but April is not your responsibly.  And babysitting a kid going through some hard stuff is much harder than regular babysitting.\n\nWhere is Joe's family? Parents?  Siblings? Aunts? Uncles?\n\nOr April's mom? Or grandparents on moms side?", "NTA.  She’s not owed this from you, you don’t have that kind of relationship- with her or her step kid.  The only reason she’s pressing you harder than the others is because:\n1.  You’re the youngest and technically still a minor, so she thinks she has the added leverage with you of “I’m the mom, you’re the child, you have to do what I say because I said so.”  Except that you two don’t have that kind of mother-son relationship, and that’s a result of her own (in)actions.  So it’s not working.  \n2.  She keeps pressing because you keep allowing yourself to engage in the discussion with her about it. Don’t do that anymore. She brings it up again, then you state calmly but firmly that “my answer is no, that’s final, and I’m not going to discuss it anymore.”  And then refuse any other discussion on that topic, period.  Like leave the room, hang up, leave her on read, etc.\n\nAlso, you’re not her only option.  You’re just the last of the easier options, and the others take more effort, which she’s trying to avoid.  Like her step child has a whole other side of her family (mom and mom’s side), one that presumably actually knows her.  She should be pressing *them* to help out.  She also has options like paying for a babysitter, investigating childcare options at the hospital, etc.", "Wow people in here are cold hearted.  I get it but this baby is about to lose her dad and be left with what sounds like a not so good parental figure.  This is a great opportunity for a young man to learn how to be a real man who treats people better than he’s been treated…. I’d say since your mother has to pay someone anyway you might as well make some money and do it.  Get the money up front of course.  Who know that little girl could grow up to be rich and she’ll remember the kindness you didn’t have to show her 🤷🏽‍♂️", "No assholes here. Where's April's mom?", "NTA…\n\nBUT\n\nThink of it this way, you baby sitting for 1 single evening really isn’t that big a deal, after some time passes you will barely even remember you did it\n\nOn the other hand, your mom would probably be forever grateful you did this for her.\n\nTLDR NTA but it seems like it isn’t THAT big a deal to do, but would mean a lot to your mom to do", "Where is April’s mom in all this?", "NTA\n\nPoor April. It looks like her childhood is going to be just as horrible as yours. Let's hope she has a mother or other relative who can step in and save her. While April is not your problem, don't think she doesn't know that everyone dislikes her. Sad all-around. Your mom should have just gotten day-care for her so she wouldn't feel like no one likes her.", "NTA this can open up the door to parentification later on and I'll say it again.\n\nParentification of a minor is abuse, 👏 👏  \nParentification of a minor abuse, 👏 👏  \nYour sibling is not your responsibility you didn't choose to reproduce,  \nParentification of a minor is abuse. 👏 👏", "My vote is ESH and only the 7yo suffers in this situation. \nALL of you suck.", "I guess NTA based on the history. That said I think you need to specify to her, how that connects to your willingness to support her with this help", "[deleted]", "NTA, but you have a choice to make here. You can choose not to help someone who’s asking because you don’t feel they deserve it, or you can choose to help knowing that you’ve made someone’s life easier.", "Soft YTA - April has no other family and is 7.  Your awful childhood was your mom having new partners often and moving you atound.  Hers could be losing her father, the only family she has and being raised by a stepmom who's other children reject her or being sent to foster care.   It would take little effort for you make it easier by helping out and getting her mind off her father being sick.  Instead though you want to punish your mother which is also hurting a child.  You seem very selfish.", "[deleted]", "NTA and you don’t owe anyone shit. However, here is a golden opportunity for you to tell your mom that her actions damaged you as a person and that she was a shit mom. But that April deserves to have a family too and that you want to spend time with her and see if there could be a relationship there. Bring her around your dad, show her what an actual family looks like. It has the potential to be very healing. This is a cold world and sometimes we have an opportunity to make it a little better.", "ESH yes, purely based on logic and your poor relationship with your mother, saying no is fine. However, April is a young girl whose only family is seriously unwell. The basic laws of empathy and being a human would say you should all offer at least an hour a week to support her while your mother is doing hospital visits etc. for her, not for your mother. She’s a child just like you were with the same thoughts and feelings and emotional pain. Reddit will always recommend Individualist/cut them off/go no contact answers but in the real world you’re all kinda being dicks about a sensitive and nuanced situation.", "I was going N-A-H, but I feel like I’m swinging to a slight YTA. You have a right to say no. But she needs help so she’s going to ask and her reason she needs help is legit. It would be reasonable to expect one of you could do her a favour so she can see her very sick husband in the hospital. I get that she wasn’t a great mother to you, but that doesn’t really seem super relevant to throw in her face right now.", "NTA", "NTA. your mums step children aren't ur resposibility", "NTA.  A traumatized child age 7 doesn’t want to be pushed off onto a stranger, especially a teenager.  She should have an adult already known to her, maybe the family of one of her friends, or rotate families of friends to split the load.  But someone who has enough life experience to offer more than a pulse.  \n\nYou are probably a wonderful teen, but you haven’t the life experience to navigate a traumatized child in the way an adult might.  And it sounds like this child, while you don’t feel antipathy towards, is little more than a stranger \n\nYour father should shut your mom down if she keeps this up.", "NTA obviously. But OP why did she say you’re her kid? I thought your other siblings are all from your Mom and Dad. And I hope your father makes a speedy and healthy recovery. God Bless You OP.", "NTA, all this people seem to think April is being abandoned or something, she isn't mom is caring for her so the argument of \"do it for April\" doesn't work because i can guarantee a 17 year old that she doesn't know at all isn't going to give her more comfort than a step parent that seems to care (at least for know). So the only one person who would be benefiting from the babysitting, would be the mom, who I don't think really deserves the help after prioritising random men over her kids.", "NTA.  Given the background information about how your mother treated all of you growing up, the current situation is not your problem to deal with.  Where is April's bio mom?  Where is Joe's family (parents, siblings) - perhaps they could help out.  Otherwise, your mom should get a sitter to help out.", "NTA, that is quite a bit to ask. Especially under the circumstances.  Does she really not have anyone else in her life that could help? Siblings? Friends?", "NTA\n\nThere's a lot of reasons you're supposed to work on yourself before you go looking for love, and this is a bunch of them.\n\nI hope you get some therapy yourself, as attachment issues in your own relationships are almost assured.", "NTA especially with the added back ground information.", "Nta not your responsibility", "NTA. I wish there were more you could realistically do for the little girl, because she is quite innocent relative to the adults in the situation and is losing everything so rapidly. But, you are also your mother's child, and still a minor, and have been sidelined time and again for her flings and ill fated \"relationships.\" There's no sign that you'd be able to maintain healthy boundaries if you agreed to spend some time with April, no sign that this would be kept manageable for you. It's very sad, but you aren't wrong or bad for declining.", "NTA. From experience watching your parents date after a divorce is rough, especially how your mom went about it. One thing I can commend my parents for was how they tackled dating after their’s. My brother and I had no clue they were dating other people until months after they were seeing my step-mom and step-dad respectively (my mom waited an entire year to even mention my step-dad’s existence) and throughout the 20 years my parents have been with their respective partners we were never pressured to be a happy family. It was always with our comfort in mind, so that now my brother and I have a fantastic relationship with our step-parents, our step-sister, and their families", "NTA", "Nta\nI mean your mother wasn't prioritising you guys in the first place as children, so why should you help out and prioritise april when she never prioritised you?\nThis isn't your thing to deal with\nLeave your mum to her own problems", "NTA, it’s never a child’s responsibility to do a parent’s job. They can get a sitter. Good for you for setting boundaries, don’t let people push you into anything you don’t want to do.", "NTA.", "NTA.  She asked, you said no.  You don't live with her so it's not part of your household obligations.  \n\nI feel for April, but this is Not Your Problem.", "If we were living in an ideal world, I'd say that watching over your stepsibling could be expected (for a reasonable time). But we're not living in an ideal world and she's been far from the ideal mother. She chose men and their kids over you and your siblings, multiple times, apparently expecting you to immediately bond with every single one of them.\n\nI get that she must be pretty desperate and worried, her husband is sick and in the hospital, that's surely very tough for her, maybe even terrifying, and I'm sorry for her for that. But none of that excuses anything she's done, repairs your relationship or magically forms a bond between you and the little one. Has she ever acknowledged her favoring partners over you? Has she ever apologized to you and your siblings? Did she make a genuine effort to make it right and mend your relationship?\n\nNTA. You're not obligated to babysit your mother's husband's daughter. Your mother is not an ah for asking you, either, but for continously pressuring and trying to guilt trip you. If \"fAmIlY\" and family bonds are so important to her, she should have put more effort into the already existing ones. Don't play with fire around bridges you might need to cross in the future.", "NTA.  Mom's new family is her own responsibility not yours.  You don't owe Joe's kid a second of your time and mom needs to hire a babysitter because she doesn't have a leg to stand on with trying to say \"you owe me\".  You don't owe your mother, that never put you first, a damn second of your life.", "NTA but I'm over here trying to rescue April.  Poor April!  Her father is sick with cancer, her mom is MIA, her step-mom is not the best, from what it seems, and her step-siblings barely know her. \n\nYou have no obligation to her.  But, and that's a big but, if Joe's battle with cancer doesn't go well, what happens to April?  In your (adult siblings') position, I'd be building that relationship with the little girl ASAP.  Poor kiddo.", "NTA. Nothing against April, but it's a little late to play the \"mom card\" when the only time she even bothered to play that role was for a kid she didn't even give birth to. Even in that case, it might only be temporary. OP has no obligation to a mother who practically threw her own kids to the wolves just so she can go play house with whoever her new flavor of the week is. I feel awful for the kid, but even if OP were to decide to step in, I think April needs way more than what a 17 year old can provide.", "Dang I feel so bad reading about the carousel of men in yalls younger days. Then I feel so bad about step sisters father being so sick. I'm so sorry those things happened and so sorry that her daddy is sick. I really hope things get better for her and her daddy and that your mother starts respecting \"no means no\" from you. Good luck beautiful fellow human!", "[removed]", "I mean, I watched my ex's step kid all the time.  She was family to my kids, and I adore kids.  \n\nBut my ex is an entitled, abusive jackhole, and it really does seem like something that should only be offered, not requested.\n\nI was happy to give  the tiny kiddo time away from both her caregivers, both of whom who abused her and my kids, until I was able to legally end my ex's access.", "I feel for April, but that is not an issue for another child to solve.", "He is estranged from his parents and doesn't have siblings or any extended family.", "The OP is still a child and not responsible for fixing the issues caused by adults.", "I agree, but OP is 17 - he is still growing as a person and if he's not comfortable babysitting, he should prioritize himself. If he was an adult with his life together, that would be different. The situation sucks for the 7 yr old, but sometimes there are things we have little control over.\n\nEdit: pronouns", "No siblings or aunts and uncles and estranged from his parents.", ">You’re just the last of the easier options\n\nMore like the last of the free options that they can guilt into it.", "There is no mom in the picture or extended family. Not sure why but it's been that way as long as I've known. But yeah, paying for a babysitter or even getting one of her friends would be a better option.", "I don't know. Not in the picture is all I know.", "[removed]", "I really don't want to step in and be a big brother to have. I have never really cared about having a relationship with April.", "Where did you get the idea it's for a single evening? It's after school, indefinitely, until April's father comes home from the hospital or dies.", ">Leading with kindness is always the best thing.\n\nNo, is not, because people take advantage of you. \n\n> I don't know your family dynamics\n\nHis mother moved them from place to place, never gave them any stability and now wants them to play happy family with her stepkid.", "That's not ops problem. Leading with kindness is a load of bs. Just because they're technically family doesn't mean op is required to be their daycare.", "Not in the picture. Not sure why but she's never had a mom in her life as long as my mom has been with her dad.", "She doesn't have a mother or other family in her life. Just her dad and my mom.", "OP is 17 and won't be a minor soon. Although I agree with your statement, Not sure it really applies here. Especially if they ask for money to do it like several have suggested.", "Not op responsibility", "You can do it. You have the same relationship op has with her, none.", "Why is that ops problem though?", "I couldn’t down vote this awful take enough.", ">You seem very selfish\n\nHe's not. There is nothing wrong with not having a relationship with your mother's stepkid.", "OP DOES NOT OWE APRIL ANYTHING.\nOp has stated he has no interest in looking after April. One might take that as them not wanting to look after April, this has nothing to do with them wanting to punish their mother. I think you just wanted to have a reason to call them selfish, to add weight to your argument. \nThere are other options for April, daycare, hiring a babysitter, etc. Op said no, he owes her and his mother nothing.", "it's basic human decency", "Why the hell would this be op's dad's problem?? I'm always confused when people ask their ex help for their new kids/stepkids", "I don't really have any strong feelings toward April. I don't want to be her brother or in her life really. We don't have a relationship really and I am good with it staying like that.", "The three of us have the same mom and dad yeah. April has a different mom and dad. My father isn't sick. April's father is.", "No mom in the equation. Joe has no siblings and is estranged from his parents.", "She has never acknowledge it or tried to mend anything with us. As far as mom is concerned none of that actually happened and we just didn't want her to find anyone.", "I'm guessing my mom will keep her though who really knows. Even if she does though we won't be around all that much anyway, if at all.", "Eh. She could Stull fool around. It's the constant amd quick moving and forced integration attempts thar are the problem.", "She could fool around out of the house. She could have dated these guys solo secretly for months before deciding they'd be good enough ugh. She was foolish", "So what is your mom’s plan if Joe doesn’t make it? Instead of working to guilt you into helping, she needs to start tracking down all of April’s living relatives to find someone who will take her.\n\nIf Joe settled your mom down, she’s going to lose it and dump April if he dies so she can start looking for the next Joe.", "What kind of babysitting is she asking for? If it's every day with no end in sight, I understand you saying no. If it's every now and then so that she can get other stuff done, well, you are still within your rights to say no, but it would be a kind thing to do.", "That’s very sad, and I understand why she asked you. But you said no, which is also completely fair and understandable. If you were close to April, I would encourage you to reconsider; but as you aren’t, your mom needs accept that no is a complete response and you shouldn’t be guilted into it. It won’t be nice for you nor April for you to be doing it reluctantly. She has to make alternative arrangements for April, and it’s not on you to take responsibility. \n\nAlso, I’m sorry she wasn’t a good parent to you, but glad you had a constant like dad in your life.", "Then they need to pay someone or find an adult willing to volunteer to help. \n\nThis isn't on you.", "OP is a guy.", "Oof. That really sucks for April. But she's going to need more help than any 17yo can supply.", "Exactly. Schools have after-care, for example, but you have to pay.", "I guess I just have a different perspective than you. Isn't that the point of a discussion?", "That's fair enough then. Your choice. I was just offering an opinion. I'm an older woman and I guess your perspective just changes as you age. But I'm with you 100%. Your choice. So many downvotes. Can't people take a different opinion these days? It's not like it carries any weight at all.", "For this comment, YTA. It’s okay to say that you don’t have a relationship with your stepsister but to say that you don’t want one going forward means you are punishing a 7 year old girl for the sins of your mother. Not cool in my opinion.", "They all suck.", "I didn’t say any of this was OP’s problem, and I didn’t say any of this was OP’s responsibility. My only objection was to HOW the story was told. It’s also perfectly reasonable to ASK where the mother is-at least more relevant to the story than OP’s siblings and Dad are relevant. If OP doesn’t know, OP can respond saying so (which is exactly what happened). \n\nAnd I disagree. It is perfectly reasonable to expect a 17 yo to have some basic empathy. Empathy and babysitting are two different things. You can have one without doing the other (and vice versa).", "Thank you for the additional info. Bottom line, you aren’t responsible for this situation. Your mom asked for a favor; you definitely have a choice. If you opt to babysit, you should be compensated as any other neighborhood babysitter.", "Talk about a slap in the face. You were not important, but my new family is!", "[deleted]", "Sometimes you help not because the other person deserves it, but because that's the kind of person you want to be.", "Oh, Sorry OP. I hope April’s dad gets better quickly then.", "I think she plans to keep April but I have no idea really. I just assume that's the plan when she's keeping her now and making no effort to find bio family of hers.", "You're getting absolutely blasted, but you're 100% spot on and its insane how this reasonable view is being utterly demolished in here.", "I don't really know. I know it's an after school thing Monday to Friday.", "My bad", "[removed]", "How is he punishing the kid? They just know of each others existence just cause their parents married, that has nothing to do with them and were it not for that they probably wouldn't ever have met each other.", "I mean, we're not blood related and I can't see myself having a relationship with my mom so it's naturally not going to happen with April even if I wanted one. But I don't. Never did. She was always just Joe's daughter to me. Not a sibling.", "He doesn't owe them anything. They can hire a babysitter, put her in daycare, or see if Joe's family will have her. Why is everyone acting like if op says no, she dies alone.", "Not wanting a relationship is not \"punishing\" her. Just because parents marry doesn't mean kids have to accept and love the new stepsibling.", "I think it’s be way worse for April to develop a relationship with OP just to lose it in a year or 2 when he starts his adult life- potentially moving away, going to college, etc. at the same time as losing her dad. OP is making the mature decision to establish and maintain boundaries", "Constantly moving your children around, preventing them from having a stable home, constantly bringing other men in and out of their lives, other children in and out of their lives, is 100% definitely not being there for them. She may have physically been there, but she wasn't there for them in any sort of way that actually counted emotionally or mentally.", "I don't blame her for it but I don't want to start developing a relationship with her. We don't have one now and I don't want to be more involved than I have been, which really was never much.", "Why? April is no one to OP.", "It's not op's fault either.", "That was beautiful. Shall I ask OP to let his mom know you are heading over to help?", "this is a genuinely mature perspective. April is going to need a lot more than a 17 year old boy who has his own stuff to deal with can provide.\n\nGood on you for maintaining your boundaries. NTA.", "Fair enough, it's tough out there for people with parents who aren't able to do what is required. Both mine were alcoholics so while our pain isn't the same I can empathise. Good luck out there, therapy will help.", "If a friend was asking you to babysit, would your answer still be no?  I get that there's a ton of baggage here.  The question is any part of the decision making independent of the baggage or is this solely about getting back at your shitty mom?", "It's a shame you have such a jaded and bitter perspective on the world.", "I don't think it's a question of fault. It's a question of basic human decency. When someone is in crisis, and a little help from you would be a big thing for them, you help - regardless of if the person is family, friend or neighbor.\n\nCertainly if the person asks more than you can give you set boundaries, but unless you're ready to go NC/LC I'd err on the side of helping out.", "Absolutely. If OP is in Boise, ID, DM me and we'll make arrangements.", "If a friend wanted me to babysit or someone I am close to I'd do it. Though not as a regular thing more than likely. But I'd help as much as I could because of that relationship.", "But will you volunteer?", "It's a shame you expect more from other peopl than you are willing to give.", "If that person constantly jerked you around for your entire life, was responsible for providing you a stable loving home, failed to provide that on multiple occasions, and is now all of the sudden turning around to be a perfect and great parent for someone else's kid, then no I don't think you owe that person anything. The person who was supposed to be able to provide a stable loving environment never did. The person who was responsible for creating a home for OP, failed over and over and over and over again. Constantly prioritized everything over her children. Now she's trying to play super parent to someone else's child. If you can't even do that for your kids, then you do not get to have the stones to ask for any help from them ever.", "What about everybody who's suffering outside of Boise?", "But what about everyone outside of Boise?? There are plenty people outside that town that need help as well, are you just going to allow city limits to stop you from being the person that you want to be? Where do you let that stop? Where do you draw the line? Was it hard for you to just draw the line at your own city? Or was it easy?", "Nonsense I'm not in this kids life, look I'm not saying he has to just saying he had an opportunity to do something really kind for a kid that is in his life. People on reddit are so quick to be hostile wow.", "Huh? What are you even talking about, where did you get that from? Why do people on reddit treat everything like it's an argument", "It’s insane how people are attacking you for basically saying that OP can do some good but doesn’t have to.", "You just called someone else \"jaded and bitter\" but now you're trying to pretend you're not argumentative? You really were preaching from your ivory tower.", "I know right! They're acting like I'm this kid's mother or fighting for her right to get him to babysit lol. I guess what do I expect people come on here all hot and bothered and use their downvotes as some kind of outlet like it means anything", "That's not being argumentative it's just accurately describing their response to my perfectly reasonable comment, jeez man relax people are allowed varying opinions. I give up.", "Yeah, they’re acting like you’re forcing OP to babysit just because you pointed out that everything is not so black and white. Not everything is an argument jeez", "NTA", "Am I the only one who feels sorry for the little girl?\n\n/I honestly don't care who the asshole is here - mom, the kids, the ex. It all pretty much sucks, and I hope the Mom figures something out.", "Hot take, might get downvoted, but NHA. You are in all your rights to not wanting to be close with the kid or your mom, that’s completely fine.\nBut! We are talking about a 7-year-old whose father is in a hospital fighting cancer, so…", "ESH. \n\nI totally get why you don’t feel you owe your mom, or Joe, a favor. Because you don’t. \n\nBut a little kindness toward a child, even if the child is a stranger, probably wouldn’t kill you. It may even make you stronger and help you grow as a person. \n\nBabysitting at that age isn’t that hard. Make her a snack and set her in front of Minecraft or Disney+. You don’t have to view her as a sister. Just as a neighbor that needs someone to watch her. \n\nYou don’t have to do it. You’re not under a moral obligation. If you do, you can set boundaries. Like once a week for 3 hours. Maybe if you have any friends that actually LIKE kids you can invite them to hang out on those days too. But none of her parents’ shortcomings are her fault and it sounds like she only has her dad, who is in the hospital and may or may not recover, and your mom, who you’ve already said is unreliable at best. \n\nI just feel really sorry for this little girl. Heck, if she is close I’ll watch her once in a while.", "Yta. Be kind to the kid losing her Dad", "Esh, I am leaning NTA, but in the end you aren't doing this for your mom, Joe or yourself, you would be helping out a 7 yr old little girl that probably doesn't understand exactly how sick her dad is. She might one day soon be in the same position without a dad the same way you grew up without your mom. Think about April before completely shutting it down, even if you could watch her for a few days a week. At the core of your post, this is about a little girl that's probably going to be losing her dad, and she has nothing to do with how your mom raised you.", "INFO: Where is April's mom? Why doesn't she have her? If Joe is sick, her mother should be the obvious choice. If not the mom, doesn't Joe or your mom have any other family or friends? Or just hire someone who wants to make some money. She's guilting you because she wouldn't pay you.", "NTA. Oh man, I'm sorry your mum messed you guys around so much. It wasn't just unfair and emotionally difficult for her to force you to be around and adjust to new partners all the time, it was reckless. Allowing men you've been in a relationship with for only a few months to have access to your children at all, let alone LIVE with them, is extremely dangerous. She showed you that you weren't her priority. Maybe if she hadn't been so selfish at that time, you and your siblings might have a more functional relationship with April and her dad. That isn't what happened, though, and you have every right to step away from this situation. Also, you're a teenager who she barely knows, you have your own stuff going on, and you shouldn't be expected to know how to support a child in a situation like that. I do hope April's father makes a full recovery. Please keep looking out for yourself.", "OP, NTA. April is not your responsibility.", "NTA\n\nYou are not responsible to make your mother's situation work. April has a mother somewhere and it would seem either Joe's family or April's should be involved here.", "Is your moms name tiffany?", "NTA\n\nThis kid is no one's responsibility except for Joe. She willingly took this child on, knowing full well her husband was going into hospital for treatement. She can either hire someone, or contact Joe's family.", "NTA", "NTA - Your mom sounds horrible...", "NtAH - even without the edit and additional info.  You are a 17 Male and if you don't want to babysit a 7 female that is understandable.  Your mom and Joe need to figure out childcare.  There are agencies that help with childcare when there are medical issues going on and lack of funds for childcare.  All she needs to do is reach out to Dept. of Social Services or Family Services - whatever the local is called and they can start to process her application.  Also depending on insurance for Joe - some insurances now help cover childcare, house cleaning and other things - so she could also contact her insurance company and see if they offer any of that.", "NTA your mom showed you early on what/who her priorities were and it wasn’t her kids. Seems like she maybe a better mother to Joes kid than she was to her own, you are 100% correct in saying that you don’t owe her. The audacity to ask an ex husband to watch your newest flings kid is just mind boggling idc what the reason is behind it.", "NTA. Her children are her responsibility and it sounds like you have good reason to not feel close to the little girl. I feel sorry for the kid though. You know what she is in for in her future as you lived it.", "NTA if you refuse to help. It is a hard situation for your mom maybe you could offer to help one day a week as an act if kindness.", "Sorry to hear about Joe, but your mom is responsible for his kid. Asking her ex to watch her and her current husband's kid, is way over the top. It is just too back this little kid is caught in the middle.", "NTA. Mom is a leech", "NTA", "NTA\n\nIt sucks she's in that situation but you're not responsible for her or her kids and it also sounds like you're just not comfortable with her in general. So you had a valid reason and even more support on top of it", "NTA - from the above, you owe her no favors. That being said, you have every right to tell your mother no and why, but the kid is only 7 and I hope you wouldn’t tell the kid off as this isn’t her fault", "NTA", "NTA. Where is April's mother?", "NTA. She had it coming", "You’re NTA but one thing to keep in mind (and I can also keep in mind I have no idea of the personal dynamics at play) is how that 7 year old girl feels.\n\nYou’re not obligated but I’d figure she must be pretty scared. I understand not giving a damn about mom or Joe but you do have a chance to brighten up a little girls day who is going through something no one should have to.\n\nYou’re not obligated to do anything but I from what you’ve described, I think it would mean far more to that 7 yr old girl than it ever would to mom and Joe.", "NTA - It's reasonable, considering the past, that you would feel the way you do. Your feelings are absolutely valid. That said your mother has had a very unstable life since the divorce. Much of that seems her own doing, but one way that you could help her create stability is taking the time to watch April. Obviously you're not under any obligations to do so, familial or otherwise, but you would be kind to do so. It would also be a kindness to April too, watching her dad go through cancer is probably very traumatizing for her and while you aren't family, and you aren't really close it might be beneficial to her if you were to take care of her. \n\nTLDR While you're under no obligation to do so you would be doing a kindness to watch April.", "ESH. I’m going to join all the downvotes at the bottom of the page for that probably, but this thing where you can’t see past your contempt for your mom enough to have a small bit of compassion for a CHILD is kinda disturbing. “Not my problem”, although it’s really popular in the AITA forum, is not a great way to go through life.\n\nI agree that you shouldn’t babysit though. There’s a reason you were the last resort.\n\nDo you know any other kids, friends from school maybe, who babysit? Maybe you could help by recommending someone?", "NTA.\n\nIt's not the 7yo's fault that their dad is poorly; you aren't close with this 7yo and aren't obligated to watch them.\n\nThe 7yo's parents need to arrange care for the 7yo- and you have clearly communicated to your mom (and Joe) that it's not going to be you.", "My mother did something very similar. She expected me to be totally okay with her and her numerous boyfriends while I grew up with no one to call my constant except my grandparents. They looked after me while she would go out with guys left and right, new guys coming through for the run down every week. Mothers who do that are less than human sometimes. Anyhow, back on topic, you are by far not the asshole. You don't want to watch some weird guy's kid when it isn't your job to do that anyway. You do you and ignore her attempts to guilt you into it and you'll feel great!!!", "NTA.", "NTA", "And that’s for the step mother to step up and sort", "Sure that’s nice n all in theory but as another poster said, April needs more help than another minor can give.", "Man when you see some of the actual shitty comments why are people downvoting an info request", "I think it shows a lot of empathy that he took time out to seek advice on Reddit.", "He’s a kid himself.", "Bring her around... her step-mom's ex?", "Her mother is not in the picture. Not sure why.", "With a joint custody arrangement there’s plenty of time for her to “fool around”. That’s not the problem. The issue is that she made this a situation for her kids. They shouldn’t be meeting anyone that mom’s been in a committed relationship with less than 6 months in the first place and then waiting to see how that works out with increasing interaction before moving in together. Kids who’ve already had to deal with their family breaking up don’t need to deal with this nonsense. It would be nice to help the kid whose dad has cancer for the kid’s sake, but mom isn’t owed anything and I agree that she brought the alienation of her kids on herself.", "Bot", "Oohhhh he said “after school”, didn’t say “after school every day” \n\nDefinitely took that differently then\n\nNew opinion: fuck that, you are not baby sitting every god damn day lmao", "Didn’t realize I was saying that he should be her be all and end all.  It’s babysitting for a couple hours.  Rly not that big a deal", "Ok, Sorry OP, I wish April’s dad a speedy and healthy recovery. I am guessing now she called you her kid bcuz you’re not yet an adult and your siblings are now considered adults maybe? NTA OP, its sad but this is not your responsibility.", "Wow. What a selfish person. I'm so sorry you had to grow up with her. I wish I could clone my mom and give everyone with crappy ones one like her. If possible, lower your contact with her, for your sake. Write her a letter, not text or mail, write it down on paper. I don't know if it will help her understand, but maybe it can help you. My guess is that you never had a chance to really get it all out and explain how that affected (and still affects) you. I just can't wrap my head around what has to go on in someone's mind to tell their own child that they just didn't want their mother to be happy with a guy. Wish I could give you a big hug.", "As a single mom that's how I rolled. My kid met one guy by accident when he turned up to the house unannounced (I broke it off via text once I sent him on his way cuz that was out of order) when they were 3 and my now husband. Even though he's the only father they've ever known, they still call him Papa <first name> and they were never forced to accept him as their dad, though after 8 years he's their dad", "[removed]", "[removed]", "My first guess is the guy was paying the bills in those relationships.", "Right? Full around all you want just do it outside the house away from your kids. \n\nNTA", "[removed]", "Or put this poor kid through the same rollercoaster as OP and his siblings. But if there’s no one else, maybe that’s why she contacted her ex first, to get him attached to April so she can con him into taking care of her too.", "Absolutely. Poor kid.", "Who knows how long mom will be with this man? She won’t be able to keep April if he dies, op isn’t punishing a child, the child isn’t their responsibility", "Bot", "[removed]", "Bot", "I wish I had free childcare every afternoon lmao.\n\nNTA", "You sound like you have your head on your shoulders. You and your dad have no obligation to help out but I guess, given the situation, and the the fact that the kid probably needs all the sane input she can get maybe your dad could offer some time at your house every now and again. I don’t know, only you know your family and anyway it’s not really the problem of a 17year old. Maybe show your dad this thread?", "It was sincerely meant. Just an opinion. Not worth any more or less than yours.", "Well, it's not your problem.", "I think she plans to keep April but I have no idea really.", "Why won't you volunteer to be a big sibling to some kid who needs it, i mean. Because you seem to expect other people to do it", "NTA\n\nYour Mom can pay to put her Stepdaughter in after school group child care.  \n\nAlso, does the school summer break start soon?  If so, then Mom isn't really asking for \"after school care for a couple hours a day\"; she's actually actually probably trying to manipulate you into 50 hours a week of free childcare for the ~12 weeks of summer.  Don't fall for it.", "NTA", "NTA, but you may find that being nice and doing someone a favor—like a 2 hour babysitting stint 1-2x a month—is as good for you as it is for them.\n\nRelationships are more than transactions. Acts of kindness repay the giver.", "ESH\nYour mom mistreated you and I get you not being close. Whether you “count” her as a sibling or not Joe and your mom are married and she IS your sibling. She is now at a point where she could lose her dad and because you hate your mom she’s having to suffer even more also??", "YTA. You’re a dick.", "Nta. Also she should look to Joe's family for help with April.", "NTA… \n\nYour mom was selfish and put you through hell as a kid. \n\nJust do April a favor and don’t judge her based off of your mothers mistakes. If April ever reaches out to you personally do your best to be there for her because even though she’s not blood, she’s still distant family. It’s not her fault she’s in this situation and losing someone to cancer that young is very hard and confusing. \n\nStand your ground on not babysitting, not your responsibility. Your mom can hire a sitter. Just don’t let April grow up like you did. Having a big brother as a girl is a huge benefit. Just have some compassion for April. \n\nBest of luck!", "Helping watch April would be generous of you, but you are NTA if you don't do it.", "Where are Joe’s family in this?", "With the background you laid out, I'd have to say NTA. She has disregarded your feelings with regard to this kind of thing so much without learning or considering how she's impacting you. It's no wonder you seem to justifiably resent that she's pressuring you for this help. Under different circumstances it might seem like you're excessively cold-- but I don't think so here.\n\nOlder generations' concept of familial duty and loyalty is so warped. We don't owe them shit for rubbing their parts together and pushing us out. Animals can do that shit. It's about the life they planned and followed through with providing for the new living ***people*** they chose to create. Unplanned? Dumb reason, should've aborted. People have kids as a thing to do and a way to accessorize their \"family.\" Then they realize they were never ready to stop prioritizing themselves, when that should've been behind them.\n\nNTA", "NTA. I have to commend you for having the assertiveness to set these boundaries with your mother at the ripe age of 17, no less. That is very admirable. \n\nIt sounds like your mom wants is thinking only of her desire to have the Brady Bunch style blended family, and not of what it would it takes for the children in such a family to make these bonds. That has to be your decision, and not something she can force onto you. \n\nLikewise, despite our societal tendency to think of babysitting as a job so easy a teenager can do it, it is a big responsibility. I don't think anyone who is not fully committed to accepting that responsibility should have it thrust upon them simply as a matter of convenience for the primary guardian. In an emergency with no other options, maybe. \n\nFurther, the fact that you suggest that she should pay someone else to do this suggests that she hasn't offered to pay you. This does not reflect an understanding of the level of responsibility would be accepting – that is the responsibility for the well-being of a child. That's discouraging.", "There may be a social worker at Joe's hospital who can assist your mother in making arrangements. It's worth a try.", "100% NTA. Sorry you had to go through your childhood like you did - it's a rubbish way to grow up and it's nice you've grown up to have some stones. It's hard to not let yourself get walked over and used. Stay strong and firm :)\n\nTake care out there.", "If she were a complete stranger and needed help while someone she cared about was hospitalized with life threatening issues, I would help. It sounds like emotion and resentment might be affecting your choice, but, there are just some things that are no question for me. One is: help out when someone is dying or has died.", "NTA. Yet another example of the \"I married someone new and you owe me helping taking care of this new family just like they were your own.\" Screw that. Stick to your guns. If she gets too difficult about it move to your dads and ignore her.", "NTA", "NTA your mom is forcing something that isn’t there. Sorry that she is going through a hard time but you guys don’t seem close at all and she is just asking for favours. She needs to find another solution", "#", ",,,,,,,,,,,#", "#", "NTA, but look: if there’s one time to suck it up and be there for your mom, it’s when her husband is in the hospital with cancer. Your relationship to the step sister is irrelevant: your mom is in a crisis and needs to be with her husband while he’s unwell. That means they need childcare for the child in the home. \n\nI would do this for a neighbor I didn’t know super well. If you have any relationship with your mom, if you have any loving family feelings for her, help her out until her husband is out of the hospital.", "NTA. You don't owe her anything and you have no reason to take over her responsibilities for her.", "I doubt a casual acquaintance will have treated you the way OPs mother treated him and his siblings. So, there's that. \n\nIt's not about compassion. It's about a parent who performed their duty in such a poor way. Her kids don't want to do anything for her.", "That’s what I wanna know. NTA either way.", "I don't mean to sound cold, but in times of emergency like this, you call in all of the potential back ups. He needs to reach out to his parents and his former ILs to ask for help with April while he is undergoing treatment. \n\nThis should not all fall on a 17 year old - there ARE adults to help. I would find it hard to believe that everyone on his side as well as the mother's side are not fit to be around April. So if it is a personality dynamic issue between them and him then he needs to suck it up.", "I like that perspective. Thank you.", "Because he knows your mom and how very hard it can be for a little girl to be in that situation.", "That’s fine. The op’s mom is terrible at being a mother. That’s established by op. The op’s step dad is deathly sick. Mom isn’t going to care for the 7 year old properly and op knows how the existence feels. She lived it and lives it. 7 year old needs help. That’s my stance.", "I also find that even when you do a favour once for a parent like this - it gets weaponised to be \"remember it was no problem last time\" perpetuating a guilt train.", "I never said op’s mom isn’t a terrible mother, just the opposite actually-the mother is so terrible that those who lives through that experience would, in my mind,  have empathy and would try to help the little girl.", "OP is LC/NC with his mom.  “Stepdad” infers some kind of parental relationship.  OP has said that is not the case.  Joe is simply mom’s husband.  As a result, the little girl is of no relation.  Yes, she is in a bad situation.  But I don’t see how that makes it OP’s concern more so that any other little kid out there in a crap situation.  Although I am much old than OP, I have a similar situation with a parent.  LC/NC with my father.  Dad’s wife is simply dad’s wife’s. Her kids are simply dad’s wife’s kids.", "NTA. Where's April's family? She has a mom, grandparents, possibly aunts and uncles. There ate cancer respite organizations that may have people who will babysit.", "NTA, not very compassionate but NTA.\n\nI'd tell mom that she has mad too many bad choices on how she has dealt with you and your sibs to have any hope of being family. She has all those other guys and their kids she can ask for help, this family is closed to you. Your choices carry consequences. Sorry, not sorry.", "Soft NTA - You have the right to make boundaries, and you don't owe her anything. However, as a human being, consider helping (with limits) out of pure compassion. \n\nIt is hell watching someone you love suffer through cancer. Not just for the Mom you're (justifiably) angry with, but that 7 year old kid. It doesn't matter if you were close to her, she's just a vulnerable child like you were once.  Maybe your Mom could find one of his relatives to help, maybe she doesn't have a lot of options. Just saying it's worth considering out of kindness. I'd also suggest at some point having a long heart to heart with your mother explaining why you keep your distance and how she's made you feel if you haven't already gotten that off your chest. Try to do it on a day you're feeling calm and write things down if you feel you might lose your train of thought. She should know that you and your siblings still feel the pain of those years.", "NTA", "NTA. If it's a one time thing I'd do it (but for April more so than your mom). But from the comments it sounded like your mom wants you to watch her every day after school for the foreseeable future or something, which is a lot", "NTA. She had the audacity to ask your dad to watch her stepkid?", "NTA\n\nSooner or later, you and your siblings are going to realize that you are better off without your mom in your life\n\nAnd the only way your mom is ever going to realize that she needs to fundamentally change who she is for the better, is if all her kids cut her off\n\nI know that sounds harsh to some, but actions have consequences and it's high time your mom started seeing her chickens come home to roost", "YTA not necessarily for not wanting to watch her, but for how you say things. She is literally legally and otherwise your mom's kid because they are married", "NTA, but that’s pretty cold.  Karma.  Poor April.", "Yta\nI agree with you and I would do the exact same thing in your situation but it’s kinda an asshole move. Not that you owe your mom anything or your half sister just not helping when your mom is struggling is kinda an asshole move. But I would totally do the same thing and your moms a dick for the stuff after the divorce. Good luck!", "I mean, you do you, but if an acquaintance (not even a family member) was struggling with a partner with cancer and a small child, I would help out a bit.  I wonder when we all decided basic acts of kindness weren’t desirable.", "NTA, you are not her inhouse babysitter.  You are old enough to move permanently with your dad, aren't you? It may be time for that.", "She has none except for her dad really. He has parents he's estranged from but that's about it.", "I want to rethink my prior answer. I agree with etds3. This is a 7yr old child without a family and dad may be dying for all she knows. You don't have to be 'family' to help out a scared alone child. You KNOW what she can expect from you mom. I would stand up and take care of the 7yr as if she was my child. Show her that their can be a + future for her outside of your mom. Be her friend if not her family. Be the parent to her that you wish your mom was to you. Break the cycle.", "[removed]", "She already knows. She doesn't care. As far as she's concerned she did nothing wrong.", "[removed]", "Not even gonna tell us why. Its like babysitting a complete strange frankly this comment its quite dickish", "Nta sounds like you didn’t really have a mom in your life either.", "Then they need to look into respite care places and cancer Charities or a friend or neighbor for babysitting referrals. \n\nAnd provide therapy for April. \n\nIt would be kind of you to search for resources for her and send a list of options. But also suggest she ask friends or neighbors for referrals.\n\nA neighbor kid in my parents neighborhood was in high school and babysat for a nurse; she got paid to spend the night and get the kid ready for school in the morning. \n\nThere are also after school programs and your mom should look for one for April. My brother worked for the local school districts summer program but went to Catholic school so didn't during the school year.\n\nYour mom should talk to the social worker at the school or hospital as they usually have lists of programs.", "I never lived in a place for longer than 4 months until I was 14, during my brothers 3 year battle with cancer we moved 16 times. I understand what lack of stability does to a child. I have owned my home for over a year and I still have stuff packed in case I have to move again. If nothing else, believe that I can understand that trauma.\n\nNow I could say your mom probably had/has mental illness or illnesses that lead to the behavior but honestly that doesn’t matter.\n\nHating your mother or not wanting to help or even talk to her doesn’t make you an asshole.\n\nBut stop thinking about your mom for one moment, April is a child going through the compounding trauma of lacking stability and having a parent fight cancer.\n\nYour not an AH for not helping BUT your not helping April because it would also help your Mom.\n\nThe way it I look at it,\nEssentially willing to let April come to emotional harm to get back at your Mom for not giving you stability when you were younger, and that is AHish", "Step up then.", "That is unfortunately the way with some people. They have too much of their own baggage to be able to empathize. I'm sorry that's the situation, it sounds hard and it's understandable why you wouldn't want to be around that. Please take very good care of yourself. Whatever you decide to do, I appreciate the fact that you're kind enough to at least think about it.", "[removed]", "Lmfao who the hell starts babysitting random kids they never met because once upon a time a decade ago they banged that randos step mom? You live in crazy town.", "[removed]", "Ok. But it’s not a rando woman. It’s the mother of his children.", "Ok. If that’s what you think.", "Why on earth would her ex husband do that ?", "[removed]", "Yh i guess", "NTA background or not. Stepsiblings are NOT siblings period. An just an FYI, I divorced my husband and had a pretty good string of boyfriends. My kids met 2 that were long term enough. Unfortunately they didn’t work out but my kids never had to deal with what you did. They met the two after I had been dating them awhile. I won’t move in with any man until there’s a hint of more certainty yet, even without kids. Now I raise my grandkids, same policy. My reason behind it is that if the kids really can’t get along with the boyfriend even after a decent trial period, I will end the relationship. No kids don’t live with parents forever, but they still have to be in contact so getting along is essential!", "NTA. There are professional services for this and the kid will be better off", "Nta", "NTA", "NTA, she burned all the bridges to her kids. She should call Joe's family for help, or suck it up and figure out a way to handle her.", "NTA. Sad for April, but she's nothing to do with you. You would be doing it as a favor to your mom, who you are no longer disposed to grant favors to.", "That’s why, until mom started insisting, I was going to say NAH, except cancer. Being an AH in the past doesn’t make her an AH in this situation. Until she started trying to force the issue.", "That’s how I feel.", "Nope.  OP's mom is a FUCKUP, and OP is properly fleeing the disaster that mom is making.", "After my divorce I had a string of boyfriends, but my kids never knew because I wouldn’t introduce them until I had been dating awhile. OP’s mom is seriously horrible and I can’t imagine how she could ever justify that!", "She’s a human being, not a ticking time bomb", "They are going for what they think is the easy answer...her mom won't back down. She needs to live with her Dad.", "That’s how parents are supposed to do things! That saved you and your family a bunch of heartache!", "NTA. \n\nDoes her school perhaps have some kind of after-school program, drama class, or other activity program that she might be able to participate in? This might be something to have your mom check in to. It might be a solution to the after-school babysitting issue. Idk 🤷‍♀️", "OP's \\*mom\\* isn't practicing basic human decency to OP \\*or\\* OP's bio siblings, all of OP's life.\n\nThis is just the mom trying to victimize OP YET FUCKING AGAIN, and it's not OP's problem to clean up their mother's fuckups YET AGAIN.", "YTA she is your mother and needs your help. Little girls are wonderful people, usually. We all make mistakes in life, so you should forgive your mother who nursed you when you were at your most vulnerable, and love her. Do this good thing for your mum, and the little girl whose father is very sick. Why would you hold back from doing an easy good deed?", "So where is Joe in all this?  He’s the dad, why isn’t he helping with his child?", "NTA\n\nIf you had a strong relationship with your mother my answer would be different. Sounds like you don’t owe her anything. If she had been an amazing attentive mother I’d urge you to help your mom out even though you don’t technically owe her anything. Relationships are give and take but your mom sounds like a user.", "NTA\n\nYou reap what you sow. She didn’t care about her relationship with her own kids so she can’t expect favors when she needs one.", "this sub hella gay lol topkek\n\nMfw mods snowflakes", "You’re NTA, it’s a huge ask at 17 from a mother who hasn’t been there for you as she should, that said. The truest compassion is often that which you give to the undeserving.", "NTA at all. You don’t owe her any free or even paid labor. Sounds like she wasn’t there for you when you needed it, and now (that you’re still a kid yourself with your own responsibilities & life) she wants you to drop everything & prioritize her. Don’t let her guilt you.", "NTA you are not even an adult yet, this is absolutely not your responsibility. It wouldn't be even if you were one year older.", "NTA. She can pay someone.", "That’s not a problem for OP to shoulder though and not something they should be guilted into. NTA", "Everyone does but that is not OP’s problem and OP is NTA", "Horrible take. OP is still a child with their own responsibilities and life. It isn’t about “compassion”, it’s about a mom who wasn’t there for her own kids wanting to guilt a minor into babysitting a 7 year old they barely know.", "He is a child who is being asked to take care of a 7yr old that he has no relationship with. NTA at all", "OP is literally a minor, and yeah caring for another life is a big responsibility. Especially a 7 year old that you barely know, who might not be okay just sitting and watching tv but might get problematic or loud. Stop trying to guild OP who is literally a child themself. NTA", "Learn to be a real man? That little girl could be rich? Wtf is this horrible take? \n\nOP is a child who doesn’t owe anyone his time. You’re horrible for trying to guilt him.", "OP is a kid himself.", "Selfish? Because OP, who is a minor himself, doesn’t want to watch a 7yr old who he barely knows instead of proceeding w all his other responsibilities? Not to mention the whole situation with him mom and their horrible relationship?", "OP is a child himself with school, college apps, possibly a job, etc. babysitting is a big commitment, you’re responsible for a human life and he doesn’t owe anyone that", "You’re an ass for trying to guilt a child who has been through enough already.", "He’s a minor dealing with his own stuff… it is not his responsibility to care for a 7 year old (big task btw being responsible for the life of a child you barely know)", "No, he’s not.", "ban me ban me ban me \n\nI said gay ban me", "I’m not guilting him!  It’s just giving a different way of looking at the situation and thinking about the other baby!  And anyway I’m not even talking to him I’m talking to all the people like you who want to encourage the cycle of being a shitty person.  Y’all frail af in here.", "Not wanting a relationship isn’t a punishment. We walk down the street every day and don’t start convos with everyone we meet. That’s not being rude. Also, OP is 17 and April is 7, it’s not like they have a ton in common to bond over before OP probably leaves the area for college.", "You’re “not guilting” him but say that not volunteering to watch a random 7 year old is “being a shitty person”? Sounds like you’re the ass here lol", "How is he letting her come into emotional harm by not babysitting her? His mom could easily hire someone, and he is a kid so it is not his responsibility.", "How? OP is a child with their own responsibilities, they don’t owe anyone free labor.", "I didn’t say that either you’re putting words in my mouth.  Different perspective that’s all… don’t understand why you people find that so hard", "She can hire someone, assuming that she can afford it. Which in the US is unlikely.  \n\n\nEither everyone has to take responsibility to put good out into the world when they can or society is going to keep degrading until it collapses.", "People are not endless pots of goodness. By your logic you should be happy to spend every waking moment volunteering to help others so why are you on this subreddit when you can be putting good out into the world instead?\n\nOP is a child, is not responsible for another child that he barely knows, and shouldn’t be expected to be or pressured to be in this uncomfortable situation.", "NTA.", "NTA. Everyone else turned her down. Why would you be TA for doing the same? It’s not your sister and not your kid, so it’s not your problem. Mom can figure out something else and doesn’t get to be mad at you about it. She’s trying to manipulate you into agreeing to babysit—don’t let her.", "NTA.", "I undedstand your POV so NTa, but her husband is dying. It would be kind of you to help ease some burden", "Nta, however if I were you I probably would, just cos I’d feel sorry for the girl and I would probably get a heavy conscious if I didn’t, from looking at your comments it sounds like she has no one but your mum who sounds horrible and her father has cancer and might die, id just do it so she had someone else she could look up to and someone who’s there for her and to cheer her up. However your mum was horrible to you and even if she’s in need now you were in need when you were a child and she sounded very promiscuous which always messes up children.", "NTA & stick to your decision. \nShe'll figure it out", "NTA Very good point.  Not OP’s responsibilities nor obligations, I agree.  But all I’m thinking about is this poor girl.  Maybe this girl will repay your kindness some day…idk.  Just throwing it out there.  And also, the fact that you would come onto a forum and ask strangers shows you’re a good person.  If you didn’t care, you wouldn’t have asked. I don’t blame you if you don’t do it.", "You literally say “encourage the cycle of being a shitty person” lol", "\\*When they can\\* is the key point of that statement.  \n\n\nNo one can spend every waking moment volunteering, But when an opportunity to put good in the world arises and requires nothing but your time. It is selfish to say no.  \n\n\nAt the very least you should strive to put more good out into the world then evil.  \n\n\nOP is 17, so unless he has a mental deficiency (and no trauma doesn't count) he has the same faculties as an adult and would be judged as one if he committed a crime, so why is it wrong to judge him as one here.  \n\n\nHe asked his question on this reddit so he was looking for peoples opinions on whether he was an asshole or not and incase you didn't notice, I said he wasn't an asshole \"but it is close\"  \n\n\nDoing something an asshole would do with justification doesn't necessarily make you an asshole, but the justification doesn't make the action any less asshole like", "ESH. Your mom was out of pocket forcing you all to go through that growing up, but you and your siblings are the selfish type of people I avoid like the plague. Your step sibling has no bio mother around and could very possibly lose her father. You and your siblings could be a boon to that young girl during an impossible time but you’re worried about you. Pathetic", "NTA You stood up for yourself and established a reasonable boundary. \nThe kid is going through a rough time. Is there a grandparent/aunt anybody in her dad’s family who can help?", "No attempt to guilt here. It’s a genuine choice depending on what they value the most.", "Your mother has made a series of decisions and now she has to live with the consequences of her choices. You're not responsible for April, your mother is. \n\nNTA.", "Where is April’s bio mom?", "My mom hated my grandma for doing this to her. She was openly hostile around her. It was bad. This kind of behaviour of your mothers never seems to heal. Nta", "Nope.  NTA and your patience with your mum is astounding.  But, she's just that - your mum.  Her job is to take care of you, not the other way around.  Sounds like she has put you through hell, and it is neither your job, nor your issue, to look after her or her stepchild.  You've had to live with her decisions, now it's her turn.", "NTA. Not your problem bro. Let her find someone else. Just cuz she wanted to have another kid doesn’t mean you are responsible at all for the child nor obligated to do anything for them. Parents do this mind rot tactic that they expect something done because they birthed you, very strange concept. I have a similar issue but not that similar, my dads gf makes arrangements for my sister and I to come over and hangout when we don’t want to be associated with them, I’m 23 my sis is 26, and we were verbally and mentally abused at a young age by parents. Here’s the lesson I learned, you owe nobody anything."]}