{"id": 17125, "submission_id": "13gbdmg", "title": "AITA for asking my husband to keep his career goals between us and not discuss them with his parents?", "selftext": "I (23F) got married to my husband (27M) seven months ago. Me and my husband are both university students. My husband is currently working for his mother and gets paid for renovating an old property of hers. The pay isn't much and hardly pays off the bills and groceries. I will be soon graduating and getting a job for myself. I however, want my husband to focus on his career as he won't be spending his rest of the life on his mama's property. His mother clearly does not want him to get a better job. She keeps discouraging him every time he talks about applying somewhere. It annoys me because it's about our future not hers. I asked my husband to keep such conversations between us which he agreed to. A while back he told me that he told his mother about the job he has applied for and she has threatened him that she will no longer pay him and sell off the property when he is still working there. This made him reconsider his decision. I felt absolutely betrayed. I don't care if she sells off the property but threatening him so he can reconsider his decision shows how much she cares about her son's career. I had a talk with my husband and now he is accusing me of tainting his relationship with his mother and that I am trying to dictate him for what he should be talking about with his mother. AITA?", "created_utc": 1683965433, "permalink": "/r/AmItheAsshole/comments/13gbdmg/aita_for_asking_my_husband_to_keep_his_career/", "score": 52, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1)I asked my husband to not discuss his career goals with his mother as she doesn't support him and felt betrayed when he did. 2) My husband thinks I am an asshole for trying to ruin his relationship with his mom but telling him what he should and should not talk about\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. His mother is hugely controlling, and I would argue her behaviour is a form of abuse also.\n\nIt was perfectly reasonable for you to ask him not to tell her about his plans. You didn't do it out of spite or a desire to hurt her. You did it so she wouldn't be able to threaten and manipulate your husband.\n\nYou need to talk to him about this. I don't see much future for your marriage if he continues to put his mother over everyone else.", "\n\nNo, you are not the asshole for asking your husband to keep his career goals between you and him and not discuss them with his parents. It is understandable that you want your husband to focus on his career and not be discouraged by his mother's negative opinions. It is also reasonable to expect that your husband respects your wishes and keeps such conversations between you and him.\n\nHowever, it is important to communicate effectively with your husband and understand his perspective. He may feel that he needs to maintain a good relationship with his mother, even if it means compromising his career goals. It is possible that he sees your request as an attempt to come between him and his mother.\n\nIt is also concerning that his mother is threatening him and using her financial control over him to influence his decisions. This is not a healthy dynamic and can have long-term effects on your husband's career and personal growth.\n\nYou and your husband need to have an open and honest conversation about your concerns and find a way to address the issue together. It is important to respect each other's feelings and opinions and work towards a solution that benefits both of you. It may also be helpful to seek the advice of a couples therapist to navigate this issue.", "Run, OP, Run\n\nNTA", "NTA. She's a serious problem and unfortunately he doesn't see it. Your future as a couple shouldn't be determined by what she wants.", "As someone with more experience dating people with overbearing/controlling parents, NTA.\n\nI also grew up in a situation where I was forced to live under the financial control of an abuser, so I sympathize with your husband to an extent. But he should be trying to get out from under her control, and not lashing out at you for trying to help.", "NTA.\n\nYou could throw the argument back at his face cuz if he’s saying you’re dictating what he can talk about with his mother, then you could say his mother is dictating what kind of job he should have. But the difference is that your goal is a reasonable one of wanting to be on a good financial footing for the both of you as a couple, while hers is to keep her grown, married son close to mommy.\n\nIt sucks, but count yourself lucky that this kind of issue is surfacing now instead of years down the road. Sorry to say it’s probably just a preview of much bigger problems later.", "Actually mil is a Hugh-control freak. She doesn’t want him to leave her and will do anything to keep him with her. So definitely nta mil is an a-h", "NTA but I don't think he is either. MIL certainly is a controlling and abusive woman to act like that. It's possible husband thinks she'll change one day. It's very common with people who grew up with adults who are like her, they keep hoping they'll be good enough for mama to change one day.", "NTA, his MIL is I’ll intended and is toxic. This will not change and he might not fully understand and realise. She will sprinkle bad luck on anything you do, including children, where she will make sure to undermine everything you say and do, husband too and will be even worse now that she is not the centre of attention. It will be a constant pull between MIL and children. I would get as far away as possible from her. Tell him to tell her he changed his mind, or even apply for a job out of town and leave her grasp. This will not be fun for you if you don’t.", "NTA- you have the right to discuss with him what you want but he also has the right to do it or not. I do agree you aren’t an asshole because some parents just cross the line.", "NTA. This is not normal, it’s not ok.", "NTA. Y’all are going to have to cut ties. If your husband doesn’t, he has made his choice. Don’t stay in a losing situation.", "Only to yourself.", "It would be a *good* thing if mama followed through with her little threat and sold off the property that OP’s husband has been working on. Unemployed and uebmmcumbrred, he could focus on his education and getting a better job. \n\nBut don’t worry about mama doing that, because if she *sold* the property, she couldn’t control her son and hold the paycheck over his head. And you can tell that mama likes the control. \n\nNTA Mama needs to be kept on an information diet. But your husband  needs to be willing to distance himself more, and he is having some trouble with that. I am sorry.", "ESH but your husband. Yes, it's wrong for you to try to dictate what your husband can tell his mom about himself. This isn't something like your own personal info that you'd have a right to set boundaries around. You are acting like his career goals belong to you at much as him, or even more so, and that's just not true. You may be practically right that it would be a good idea not to tell her, but you're just trying to replace his mother's controlling behavior with your own. And healthy relationship you can sit boundaries around your own business and life and contact with his mother, but it's overreaching to try to set boundaries for him.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (23F) got married to my husband (27M) seven months ago. Me and my husband are both university students. My husband is currently working for his mother and gets paid for renovating an old property of hers. The pay isn't much and hardly pays off the bills and groceries. I will be soon graduating and getting a job for myself. I however, want my husband to focus on his career as he won't be spending his rest of the life on his mama's property. His mother clearly does not want him to get a better job. She keeps discouraging him every time he talks about applying somewhere. It annoys me because it's about our future not hers. I asked my husband to keep such conversations between us which he agreed to. A while back he told me that he told his mother about the job he has applied for and she has threatened him that she will no longer pay him and sell off the property when he is still working there. This made him reconsider his decision. I felt absolutely betrayed. I don't care if she sells off the property but threatening him so he can reconsider his decision shows how much she cares about her son's career. I had a talk with my husband and now he is accusing me of tainting his relationship with his mother and that I am trying to dictate him for what he should be talking about with his mother. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "INFO: does he have equity in the property and will be get a cut of the sale? \n\nIf not OMG he needs to get a different job, if so, I can kinda see putting up with the bullshit until payday.\n\nEither way, you are NTA.", "NTA, but you need to address the root cause, just tell him to keep the conversation under wraps. You should sit him down and say you’re concerned about the fact that he doesn’t see how she’s trapping him into this, and that it’s not fair for you to suffer for his inability to see it. \n\nYou need to make it clear that this is not sustainable, and you cannot expect to have a good marriage together if he isn’t as focused on shaping a good future for you both as you are", "NTA I'd sit him down and explain you can't live like this where his mum basically owns his future and he needs to get his independence for both your futures as he choose to be with you and to marry you", "NTA. Sounds to me like his mother is perfectly capable of tainting their relationship all by herself.\n\nI usually side with in-laws, as trying to compete for love between a spouse and birth family is a fight that will always have a loser, but in this case, your concerns seem very real. While it's his decision what he wants to communicate with his mother, he had committed to you not to talk about this subject with her. If he wanted to go back on that decision, he should have been a big boy and re-opened the discussion with you first.", "nta ... i wish someone would stand up to his mother and say you can choose to keep your property or your son", "NTA for asking, but don’t expect change overnight.\n\nConversation about how you will support yourselves as a couple and what you want for your future are best had before getting married. What is he trained to do? Is he passing up some serious earning potential in order to help his mom?\n\nGiven that you are already entangled in this mother-son dynamic, you will have to be patient and allow your husband to figure it out. He may eventually come to the conclusion that tipping her off about his independence only makes her hold on to him\nMore tightly. Your complaints will only reinforce the idea that you are the outside opinion in this codependent relationship with his mother. \n\nIf the arrangement he has with his mother continues to be a challenge in your relationship, you may want to secure your own future by setting aside some of your new income for yourself. Once you accept a position, sit down with your husband and talk about a budget and set some goals.\n\nIf you have been together a long time, this may bring conflict as your income will increase and his is already at a plateau. If he can make an argument that he supported you while you were getting a degree, ask him how long you have to live like you are now in order to balance the books. Set a realistic timeline for a change and stick to it. \n\nBe sure to have some idea of whether or not you intend to relocate, buy or rent or have kids. It may be more difficult to come to agreement when you’ve invested a great deal in the marriage. Best Wishes.❤️‍🩹❤️", "So his mom gets free cheap labor, why would she wanna give that up", "MIL is the main AH, but he's a minor AH, or at least naive and manipulatable.", "It would be wrong for her to dictate his boundaries, but it's also wrong if he agreed to her wishes and broke his commitment without letting her know his change of mind first.", "It would be better to let her know that he's not going to follow it, but I actually don't agree that it's wrong for him to share his own info with his own mother without letting his wife know first. If the rule is aren't is controlling in itself, the person being controlled shouldn't consider it binding."]}