{"id": 17163, "submission_id": "13gs03x", "title": "AITA for ‘being dramatic’ and ruining my friend’s party?", "selftext": "So, to start, I (16f) have PTSD. I was the one who found my mother’s body after her extremely bloody death, so I’m very sensitive to gore in general but especially blood. Just wanted to rip the bandaid off early.\n\nAnyway, I’ve know ‘Miranda’ (17f) since the start of the school year, but we got pretty close in the last few months. She invited me to her birthday party last weekend, and told me in advance that the theme was ‘murder mystery’. I asked her for more specifics since I wasn’t sure if I could handle it. She knows that I have issues with gore and blood, but not the extent of my trauma. She “didn’t want to ruin the surprise” but assured me that it would be pretty mild and not to worry about it. I decided to trust her.\n\nWell, I got dropped off at her house and chatted with the other guests on the patio while we waited for the last person to show up. When he did, we were all escorted together into the house by Miranda’s sister, who said some rehearsed line about how she was “so glad you detectives are here because there has been a murder”. She escorted us to Miranda’s room where Miranda was laying on her bed all done up in fake blood with a fake knife sticking out of her chest.\n\nI knew it was fake, obviously, but in that moment my brain short circuited. It was like I was thirteen years old again and had just lost a person who meant the world to me. I wanted to scream and cry and run away, but instead I excused myself and fast walked out of the room. I hyperventilated on her patio as I texted my dad and waited for him to get there. A few of my friends came out to see what was wrong, and I tried to play it off. I told them I was fine and that they should go back to the party, but they insisted on sitting with me until my dad arrived.\n\nAll this week at school Miranda gave me the cold shoulder, and she’s been ‘venting’ to our other friends about how I caused a scene and took people away from the party and basically took fifteen minutes away from her party to make it all about me. According to her, “the makeup wasn’t that gory, and [my name] was just being a drama queen.”\n\nMy close friends (mostly the ones who know about my trauma) don’t think I did anything wrong, but I still feel bad for disrupting her party. AITA?", "created_utc": 1684010101, "permalink": "/r/AmItheAsshole/comments/13gs03x/aita_for_being_dramatic_and_ruining_my_friends/", "score": 214, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be in the wrong because I took guests and attention away from her party, and kinda tainted the whole party for the ready of the time?\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Your friend is an ass who doesn't understand how PTSD and triggers work. You did ABSOLUTELY NOTHING WRONG. NTA. \n\nSo sorry for your experience.", "NTA and this could have been avoided, had she been more honest about the set up. What she did was cruel, and she makes it worse, by playing the victim in this situation.", "NTA\n\nYou can’t control your trauma, and it’s clear you tried to downplay your own emotional response for the sake of the party. She should have warned you, surprise be damned, it’s not up to her what you can and can’t handle. I’m sorry, but Miranda is a fake friend. If she really cared about you, she would have apologized and tried to make things right. Instead, she went on a smear campaign. Ditch her, she’s trash.", "Of course you're NTA. What your friend did was in extremely poor taste and very insensitive to you. You handled it beautifully, in the least dramatic way as possible. It's too bad your friend is lacking in maturity and empathy. Otherwise she might be a lot more understanding towards you.", "NTA. Even if she didn't know the full extent of your trauma, she knew that you had a huge problem with blood and gore and still misled you into thinking that it wouldn't be hardly any of that. She's the AH.", "NTA. I feel really sorry for you that this happened and that your 'friend' didn't take you seriously at all. \n\n&#x200B;\n\nDoes she know what caused the trauma? How you found your mom? It might be worth talking to her and explaining why you responded the way you did if you feel comfortable enough to talk about it. If you aren't, then it might be time to cut this 'friend' out. You had a trauma response and your friend is saying you are being a 'drama queen'. Thankfully, being in your high school teen years, this will blow over as time goes on so I wouldn't worry to much about any social issues at school over it (especially since a lot of them tend to not carry over to much after you leave school after senior year unless you are in a small enough town that everyone then goes to the exact same college)", "NTA.    You were not being ‘dramatic’ and you did not ruin anything.   You are an amazing person.", "NTA. You already warned her that you might not be able to handle it, and she was aware that you had issues with blood and gore, but she still took the risk because she didn’t want to ruin the surprise. I think it’s very mean and inconsiderate of her the way she's making you feel.", "NTA, but I'm going to give you some advice. You can't take people's word for \"how gory\" something may be. It's an incredibly subjective thing to try to gauge.  It's like asking \"Is this shower too hot, too cold, or just right?\" Everyone who steps into the shower is going to have a different opinion. Next time you're in this type of situation, maybe you should ask, \"Is there any blood?\" If yes, even a little bit, it's not the event for you. Best of luck.", "NTA. She is NOT your friend.", "I’m am so sorry for your tragic loss and the trauma surrounding it. Please know you are NTA. Your friend is young and self-centered (as many teens are), and lacks empathy regarding your experiences. Please know that you did nothing wrong. Likely your friend feels stupid for making the plans that she did, but is putting the blame on you because she is embarrassed.", "NTA I also have ptsd but that’s fucking awful your friend would have that theme like wtf", "NTA!!! \n\nAre you sure your friend didn't do this deliberately to try and get back at you over some perceived slight, jealousy, envy, or something along those lines? The fact that she's now giving you the cold shoulder, being mean, and making herself out to be the victim rather than being sorry and empathizing with you suggests that she probably had bad intentions.", ">All this week at school Miranda gave me the cold shoulder, and she’s been ‘venting’ to our other friends about how I caused a scene and took people away from the party and basically took **fifteen minutes away from her party to make it all about me.**\n\nUh. That's. I'm really grossed out by this girl. That's I'd recoil from you as a human being level behavior. I don't understand why she invited you to this party at all. Does she regularly do creepy stuff? NTA.", "Oh my god- I am so sorry OP.\n\nNTA", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSo, to start, I (16f) have PTSD. I was the one who found my mother’s body after her extremely bloody death, so I’m very sensitive to gore in general but especially blood. Just wanted to rip the bandaid off early.\n\nAnyway, I’ve know ‘Miranda’ (17f) since the start of the school year, but we got pretty close in the last few months. She invited me to her birthday party last weekend, and told me in advance that the theme was ‘murder mystery’. I asked her for more specifics since I wasn’t sure if I could handle it. She knows that I have issues with gore and blood, but not the extent of my trauma. She “didn’t want to ruin the surprise” but assured me that it would be pretty mild and not to worry about it. I decided to trust her.\n\nWell, I got dropped off at her house and chatted with the other guests on the patio while we waited for the last person to show up. When he did, we were all escorted together into the house by Miranda’s sister, who said some rehearsed line about how she was “so glad you detectives are here because there has been a murder”. She escorted us to Miranda’s room where Miranda was laying on her bed all done up in fake blood with a fake knife sticking out of her chest.\n\nI knew it was fake, obviously, but in that moment my brain short circuited. It was like I was thirteen years old again and had just lost a person who meant the world to me. I wanted to scream and cry and run away, but instead I excused myself and fast walked out of the room. I hyperventilated on her patio as I texted my dad and waited for him to get there. A few of my friends came out to see what was wrong, and I tried to play it off. I told them I was fine and that they should go back to the party, but they insisted on sitting with me until my dad arrived.\n\nAll this week at school Miranda gave me the cold shoulder, and she’s been ‘venting’ to our other friends about how I caused a scene and took people away from the party and basically took fifteen minutes away from her party to make it all about me. According to her, “the makeup wasn’t that gory, and [my name] was just being a drama queen.”\n\nMy close friends (mostly the ones who know about my trauma) don’t think I did anything wrong, but I still feel bad for disrupting her party. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA\n\nYou experienced REAL trauma.  It makes perfect sense that you couldn't think in the moment.  The fact that you walked out and just texted for a ride says just how far you've come in your recovery. \n\nYour REAL friends understand what you went through.  Miranda isn't a real friend and you were NOT being a drama queen.", "NTA. The fact that she wanted it to be a surprise means she knew what she was going to do was wrong. She is not your friend. She wanted a reaction out of you, and you left instead of making a scene. I hope no one ever does that to you again.", "absolutely NTA. I'm so sorry this happened to you. You did everything you could to make sure you could handle it and she lied. She needed to give you those specifics instead of worrying about spoiling it. You guys are young and I can understand her ignorance of your situation. Please don't be hard on yourself. PTSD is hard to manage especially in a scenario like this where you've prepared yourself for something mild, then you see that. Your friend needs to be a little more understanding but unfortunately it's hard for a lot of people to understand when they haven't been through something first hand. Look out for number one first and foremost-- that's you. Flashbacks are intense. I found when I have one I was more prone to them in days that followed. I hope you have some people you can lean on if you need it.", "NTA OP.  MIRANDA, however, is.  She apparently doesn’t understand PTSD and triggers, and yet she subjected you to a murder mystery, with her as the victim?  I’d recommend getting her out of your life.", "NTA. It sounds like Miranda set you up on purpose. She is not a real friend.", "NTA- you asked questions to see if this event would be gore-filled and were assured it would be tame and you had nothing to worry about. It did have gore and gave you a panic attack. You excused yourself politely, and tried to go home without causing a scene. Your real friends were legitimately concerned about leaving you alone while you were in this state (which was a valid, compassionate response). \n\nI want to be very clear. You did not cause a scene. You removed yourself from a situation that was too much for you. 15 mins of attention is more important to Miranda than your well being. If I did something that accidentally triggered one of my friends, the whole party would've stopped until I was sure they were okay, because a friend is more important than a party theme. I would be the one calling their emergency contact and making sure they got home safe. Id call again after the party to check in and make sure they're okay. I would feel apologetic, even though some triggers are just a part of living that we have to learn to deal with (unfortunately, we cannot rid the world of all blood, you'll encounter this trigger from time to time).\n\nI wouldn't be calling her your friend anymore.", "NTA", "NTA\n\nI have PTSD too and know how horrifying it feels when I get triggered. I’m so sorry you had to go through that, and how you were treated by her later. \n\nDon’t feel guilty. You tried your best. Maybe she needs to learn empathy though.", "NTA. That would disturb me and I don't have any kind of trauma. I wouldn't have a reaction like yours, which wasn't even extreme given your circumstances, but I wouldn't be thrilled. Miranda was thoughtless to spring that on you and is vicious to make your trauma response all about her.", "NTA. Source: I'm a trauma therapist.\n\nIs this person usually a good friend or is this behavior par for the course? It sounds like she doesn't know anything about how PTSD and triggers work. I'm trying to understand how much of her behavior is ignorance and how much of it is selfish cruelty. Either way, you did absolutely nothing wrong. \n\nI hope you are doing alright this week and have a good support system. It's normal to have some after effects in the 1 or 2 weeks following a bad flashback, so please be gentle with yourself. It can be hard to hold boundaries around triggers, but I hope this incident helps you feel a little more comfortable advocating for yourself in the future, to make sure you have all the info you need to make an informed decision about whether a situation is safe for you.", "mild YTA  Next time you're invited to a murder mystery themed party, don't go.", "I'm also upset with the friends that stayed with her - personally someone watching me fall apart makes it much worse and if I told someone to go back to the party and they insisted on sitting with me it would make my anxiety skyrocket- being alone would help me calm down so much more.  Can't people just listen to what the person experiencing the issue actually wants?  Knowing everyone at the party knows you are freaking out isn't going to help anyone.", "And your friends are on your side. They probably knew as soon as they saw the scene that it was going to be a trigger for you, and they knew Miranda was being a jerk by putting you in that situation. You behaved VERY calmly: you weren’t dramatic at all. And if the party was ruined, it was because your friends were pissed at your inconsiderate host, not because of anything you did.", "That would be ideal, but these are teenagers. They know their friend was triggered, and they were trying to support her until her dad got there. They are still children who are learning how to help others through their emotions, and even if their response isn’t perfect, they’re clearly coming from a place of love.", "It’s so hard though. Teen girls and women are hardwired to be supportive and gently push past your walls to help. Good or bad, that’s sort of a common personality type. And then you have men, whose friends’ respect boundaries, but who also have an objectively observable deficit of support systems and a hesitancy to seek out help.", "I think it depends on OP's body language and responses afterwards. OP clearly didn't want to detract from the party, but I think it's very reasonable from the perspective of their friends to be more concerned about their friend having a panic attack than a birthday party. I find this situation very tricky because of course you should respect people's boundaries and their requests, but depending on how OP is and how well their friends know them, it could be an act of care. \n\nMy boyfriend (I also do this sometimes) for example will absolutely tell me to not worry about him and enjoy myself if we're out or seeing friends, but I know he'd actually feel better if I told him I'd rather be with him and get him out of his head a bit or validate his feelings.\n\nHopefully this is the case, but if OP felt worse and their friends ignored it or were oblivious I'm very sorry they had to go through that.", "NTA\n\nIn general I don’t think it’s a good idea to ambush people with a game like this; they don’t need to know all the details, but “my party we’re going to pretend someone was murdered and solve who did it” would have been appropriate.\n\nSaying a party has a theme is not the same thing as expecting people to participate in a kind of live action role play experience. \n\nYou told Miranda you weren’t sure you were going to be able to handle it - she clearly doesn’t take your issues with blood seriously.\n\nNot telling you what the party actually was going to be was certainly a misstep, but her behavior after is what puts her firmly in the asshole camp.\n\nInstead of recognizing that she was wrong, that her assessment that it would be mild didn’t take into account your tolerance is MUCH different than hers, that her staging triggered what sounds like a flashback (and from an outsiders perspective, at least a panic attack) and apologizing…\n\nShe insults you and is smearing you to her friends.\n\nAnd in my opinion even if your trauma wasn’t related to finding your mother’s body, Miranda would STILL be an asshole.\n\nBecause you told her you couldn’t handle blood and you tried to get more information to decide if it was something you could do - and she hid that information.\n\nI know it’s years past, but I am so sorry for what happened to you OP. No one should experience that let alone a child.", "You did nothing wrong NTA", "NTA. You were as polite about having to leave the room as you could be. And I can’t imagine how you did that, so kudos to you for your strength.", "NAH\n\nPTSD is not a choice.\n\nYou aren’t T A for leaving an event that triggered your PTSD. But neither is your friend for being upset about you making a scene (which you and your friends did - even though it wasn’t by choice) at their birthday. Remember - your friend does not know you have PTSD. They do not know the background. You haven’t chosen to share that information. So what they have - is you running out and others leaving with you. And they don’t have an explanation for this that makes sense. \n\nThis isn’t a matter of fault or being T A but - you could have made a more sensible decision to limit the chance of being triggered. Murder-Mystery events sounds like a poor choice for someone with PTSD linked to a violent death. That’s information to keep in mind for the future for you. This is an event you probably should have opted out of. \n\nI acknowledge that you thought you were careful by asking about gore. But your friend doesn’t know that you have PTSD and doesn’t know it is linked to a violent death. They answered your questions honestly and sincerely. To them this likely wasn’t much gore (to me it isn’t either*). \n\nI think you need to have an honest discussion with your friend. I recommend apologising for the impact on their party. Not because you did anything wrong - but because you did have an impact. It’s like - if I got sick at a friend’s party I’d be sorry I interrupted things. But I wouldn’t feel guilty for being sick. \n\nI’d recommend more openness about your situation as well. You could give part of the information. My mother died violently - I didn’t expect it to happen but when I saw you even though I knew it was pretend it felt too real - I never wanted to disrupt your party so I didn’t say anything. I don’t tell people because I don’t want people to see me as the daughter of a media headline.  An honest explanation but without having to go through everything. \n\nHow much your share would depend on how close a friend this person is and how much your trust them to respect your privacy. I’m working on the assumption this person is a friend. \n\nIf your friend is a decent person they will understand. But right now - what they can see from the information available - is you ran out - and a bunch of people (not just 1 by the sound if it) focused on you instead of the birthday person.  And from what they could tell - you were ok or just a little upset (probably because you were working hard not to disrupt their party! But they doing know that) It can be hard being the new person in a group of existing friends - and it can be easy to feel that you aren’t important.\n\n* through my work I very occasionally deal with crime scenes (most of which are completely mundane) - I learnt the hard way not to answer curious questions from people honestly - as stuff that to me was low level could be really confronting for others.", "NTA", "NTA! I am so incredibly sorry for everything you are going through. PTSD is a tough thing to live with especially at a young age. I commend you for how you handle yourself…I know from experience how hard and painful it can be dealing with the triggers that come with PTSD. Miranda doesn’t seem like a very good friend….even if she doesn’t know your whole story, she was very rude about your reaction.", "NTA.  Miranda is not your friend.", "INFO - what exactly does she/did she know about the extent of your issues?\n\nBecause I know people who have \"issues\" with blood and gore in the sense that they don't like it in TV for example. But they wouldn't bat an eye at someone pretending to be dead with fake blood. I would probably have also described it as mild. \n\nIf she knew it was related to your mother's death or you have PTSD then that's a different story.", "NTA", "NTA. My god with friends like that who needs enemies.   She knew exactly what she was doing. I am so sorry you had to go through something like this.", "NTA. My boss treats ptsd with virtual reality therapy, and she intentionally will not include blood in her scenarios. Seeing a bloody body doesn’t even need a trauma history to be bothersome, we’re humans and we’re supposed to react when we see lots of blood, it’s a good response to think “oh no lots of blood something is wrong.” Frankly your friend should have been open with all party guests about the gory makeup she’d wear, and she’s being deliberately obtuse to be surprised at your reaction.", "NTA. That asshole is no friend of yours.", "Miranda isn't her friend.  Anyone who got explained to them OP's concerns, then went ahead with this plan intending to see Miranda in the bedroom tableau is a shit person, and being a teenager doesn't excuse anything.\n\nMy guess is that fewer people than expected found Miranda's stunt entertaining, and she's trying to get people \"on her side\" about what she did.  \n\nI hope OP is doing okay, and that people (classmates, etc.) become aware of Miranda's crappy behavior.", "eh, agreeing to go to a murder party was probably not the best idea. NTA, but not a great decision maker either", "Agreed. To me, someone lying down with some fake blood and a fake knife like she was is not gory or disturbing at all especially if you knew it was fake.\n\nIf I had limited knowledge of OPs issues like the friend does I could see myself saying that it's not that bad too.", "She asked about the specifics of the party because she *wasn’t sure* if she would be triggered and (I’m assuming) because she wanted to have fun with her friend. This whole situation could have been avoided if Miranda just told her about her plans instead of downplaying and being vague about it, OP is NTA for trusting (who she thought at the time to be) her friend.", "She knows that I have very severe reactions to blood (including fake blood) due to an incident at a Halloween party, but she doesn’t know about why specifically.", "I mean “it would be pretty mild” from someone who knows I have an issue with blood and gore would make me think “poisoning” or “drowning” or maybe a gunshot wound with a small trickle of blood at the entry site.\n\nPerson with a fake knife in their chest and fake blood all over them?  Not “pretty mild.”  Especially when you know that someone attending is triggered by bloody violence.\n\nThere were lots of ways to do this that wouldn’t be triggering. Miranda did not choose one of those."]}