{"id": 17214, "submission_id": "13heggs", "title": "AITA not eating food my girlfriend's parents made at family dinner", "selftext": "My girlfriend of four years has a different cultural background than mine. Her parents are not from America and family and meals are very important to them. I grew up in America and while we had Holiday dinners and maybe a Sunday dinner every couple of weeks. For the most part, mom or dad made something and then we ate it where and when we wanted. I eat dinner with my gf's parents every week and I love it. It is important to her and I have no problem with different cuisines. It's all delicious food.\n\n&#x200B;\n\nHowever, I do not eat a lot. Growing up I was very overweight and saw a nutritionist. Stuck to a calorie deficit and worked on my portions and I've been at a healthy weight ever since. My relationship with food has changed and I no longer have the desire to tear through two double quarter pounders anymore. My gf's parents seem to get offended that I get small portions of things and don't fill my plate up a second time. They will make maybe 5-6 different food options and I'll get a little bit of everything because I want to taste it all. At some point every time I am there they ask me if I didn't like the food. They mention the small portions and how I never go back for more. I just honestly tell them that I don't overeat. They've never made a scene about it to me but I guess they've been discussing it with my gf while I am not there.\n\n&#x200B;\n\nA couple of days ago my gf told me that her parents feel offended over \"how little\" I eat. Which \"a little\" is a 100 percent full plate with a bit of everything made. And some days I eat less and or some days I eat more. It really depends. If I skipped breakfast, had a light lunch. I might fill up more for dinner. But if, for example. I got a decent breakfast, work catered sandwiches that day, I'm going to get a normal(small) sized dinner. My general goal is to have equal sized meals each time but with a busy work life that is not always possible. So some days I didn't have any food until family dinner and I am eating more than usual. My gf asked me if it were possible that I could eat a bit more just for them one day a week. She didn't push or demand, just asking if it were possible. I told her that I don't want to ruin my mended relationship with food. I don't understand why the parents are so offended. I always pack up tupperware and eat it throughout the week because it's delicious food. I don't want to disrespect her parents though.\n\n&#x200B;\n\nEDT\n\nAnother odd thing I want to add. They will make comments about my girlfriend(who is in great shape) that she is \"putting on weight\" sometimes. But also pressure her to fill her plate twice. I don't get it", "created_utc": 1684076454, "permalink": "/r/AmItheAsshole/comments/13heggs/aita_not_eating_food_my_girlfriends_parents_made/", "score": 19, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I am not eating large portions of food they worked hard on. It comes off as if I don't enjoy it would could make me an asshole\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. My extended family is this way culturally and it is considered offensive to them if you reject food/ don’t gorge yourself but culture can’t be prioritized over your boundaries and well-being. This is a good compatibility test for you and your gf. It will be uncomfortable for her but I hope she chooses to back you up.", "NTA. Your gf needs to talk to her parents about laying off of you regarding the portion sizes. Their attitude may be culturally appropriate for them, but is harmful to your health.", "INFO: Have you tried explaining to them the reason behind your calculated eating habits, as thoroughly as you are currently explaining it to us?", "NTA, eat what you're comfortable eating, don't overeat to appease someone else.\n\nDo your girlfriend's parents know about yout history and you relationship with food? If you're comfortable sharing that with them and explaining why you don't eat a lot it might help.\n\nCertainly there's no obligation to do that if you aren't comfortable, it's completely your decision, it just might get them off your back about it if they know why you keep portions small\n\nEdit: It doesn't even have to be specific, just something like \"yeah I've struggled with weight and nutrition in the past and so I intentionally keep my portions small. I promise I love to food I've just worked hard to become healtier and I need to eat smaller portions to keep it that way\"", "NTA- But they are for not respecting your autonomy. Disordered eating is already extremely difficult to overcome without people trying to pressure/relapse someone back into said disordered eating.\n\nNow, I understand in some cultures, that not 'eating enough' of a meal made for you can be seen as offensive, but that doesn't mean they can force that onto you and be upset with you for exercising your right to treat your body how you want. And I generally think that it's an archaic belief anyways, that encourages disordered eating and is objectively harmful to healthy food relationships, regardless of how they feel about it. People should be eating what they are safe and comfortable eating. Not more or less than that.", "NTA. \n\nYou weren’t being disrespectful. My culture uses food as love and doesn’t take well to not eating “everything on your plate” but the reality is you have to do things for your own well being and they will need to adjust and accept your boundaries.", "Your edit is very relatable. My grandma would simultaneously say I should eat less to lose weight, and then say I eat too little when we're actually at the dinner table. \n\nIMO, you worked really hard to have your current relationship with food and it's not fair for anyone to force you to change your hard-earned habit just so you can fit into their cultural expectations of eating a certain way. There needs to be mutual understanding and respect, and I hope your gf's parents are open-minded enough to tolerate that. If they choose not to and your gf does not defend you, that's actually a red flag to me. NTA.", "NTA. But maybe a conversation can/should be had about that cultural difference and you can add in a \"for me, I have to *really* enjoy the food to want to take some home with me to enjoy again before the next family meal\" or something", "NAH. I think it just needs to be communicated with them that you do this with all food. You used to be overweight and don’t want to be ever again.\n\nI know foreign parents can be from cultures where weight etc is talked about more freely. Discussing it with them and showing them an old photo of you might go a long way tbh. Just my 2 cents.", "NTA\n\nYou sound like you're doing exactly what you should. I'll never understand this drive to force feed people.", "Well explain this to them", "No explanation is necessary. Tell them the food is delicious and this is the amount you want. If they persist, repeat as necessary. \n\nYour gf can discuss it however she wants with them, but she should not be asking you to eat differently to please them. Tell her not to ask you again.", "NTA. This is obviously a generalization, but immigrant parents tend to have the weirdest neuroses about food and food consumption habits.", "NTA\n\nMy large extended family would always do that to me. Comment on weight and looks while simultaneously wanting you to eat more. I had to get them to stop doing that to me more so than my bf.\nI would encourage your partner to draw some boundaries for ya, or if you just let them know you love the food, and want to eat more, but aammmm jjuussst tooo fulllllll or w/e lolol. But tough situation to be in, but hopefully yall be able to help bridge that cultural divide!", "This and she has to do it now or this fight will last till the end of time. Furthermore think about how they are going to talk to your (if you choose to have any) children about food. The conflict will arise again.\n\nEdit: NTA"]}