{"id": 17242, "submission_id": "13hhf99", "title": "AITA for telling my ill friend that I can't wait for her anymore?", "selftext": "I 17F have a friend 16F, who I will call Sammy who has been my friend for many years. My friend is constantly ill and she's currently doing a lot of tests to figure out what's wrong and I mean ill as in throwing up constantly, fainting, etc. Because of this, she isn't in school a lot like sometimes she'll miss a whole week. I don't have many friends besides her so when she's not here i'm always sitting alone like in class or especially during lunch. Recently, I have made a new friend, Mary who I hang out with now during lunch. It's been so fun and we can talk about anything. We've bonded so well because we both used to just be alone but now we have each other to talk to during lunch.\r  \n\r  \nHowever, there was a period when Sammy wasn't here and i hung out with Mary more and we got close. When Sammy came back from that periodshe asked to hang out during lunch and I told her she could join me and Mary for lunch. She was confused but joined me. I thought we were having a good time but after we left Sammy told me that she thought Mary was boring. I shrugged it off because it was their first time meeting. So after that, that's how it started to be with Sammy (whenever she was here because she would only be here like 2 days a week max) coming with me to lunch with Mary. Sammy told me that she wanted me to hang out with her and not Mary whenever she was here which I agreed to because it would only be no more than 2 days.\r  \n\r  \nI felt bad for leaving Mary because she would be alone on those days but I told her we could hang out for the rest of the week when Sammy wasn't here. Whenever I would be with Sammy though she would bring up Mary asking why i'm friends with her because she's shy and just seems boring. I would tell her to stop but she would still do it\r  \n\r  \n.It was fine until two days ago when it was Mary's birthday, she had asked for me to be with her for lunch on her birthday days prior and I assumed Sammy wouldn't be here so I said yes, I would've said yes anyways if Sammy was here though. I was surprised to see Sammy in school that same day and she asked me to come with her for lunch as usual. I told her I couldn't because it was Mary's birthday and I really wanted to be there with her.\r  \n\r  \nThis started an argument and she said she felt replaced by the fact I was hanging out with Mary.I told her I wasn't replacing her and that it just wasn't fun being alone whenever Sammy was absent and that it's not fair and i shouldn't put everything on halt when Sammy comes back. She then told me that I was blaming her for her illness and that she can't control being absent. I told her i'm not and that I just can't wait for her anymore, that I needed to live my life too. She got silent, called me an a-holeand left. I feel like i might be the a-holebecause she's ill and cant control when she's not here and i probably shouldn't have softened my words.; So AITA?", "created_utc": 1684083723, "permalink": "/r/AmItheAsshole/comments/13hhf99/aita_for_telling_my_ill_friend_that_i_cant_wait/", "score": 68, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I feel like i might be the asshole here because i told my friend that i couldn't wait for her anymore but she is ill and can't control when she's there.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. You should not have to pick and choose your friends, and if someone tell you that then they are not your friend. I can get her perspective how she is alone a lot and dealing with a lot of medical issues but that is not a reason for you to put your social life and own mental well being on hold for her sake.", "NTA, but Sammy is being a jealous asshole. It doesn’t matter that she cannot control her illness and those circumstances, you’re a human being and people are allowed to have more than one friend. She is jealous that you have a friend on days she is alone at home sick. She may or may not be hating on Mary only because of this. You have to stick to your guns now; you tell Sammy that she either respects your friendship between you and Mary or she will lose you as a friend. It’s not like you stopped being her friend, you’re there for her when she is around and when she’s not there’s nothing you can do about that. Whatever Sammy decides after this is her choice, hopefully she does not decide to die on this hill because it’s a really dumb way to throw away a friendship with you.", " NTA You are completely right in saying that you can’t put your life on pause for someone who isn’t always there. You are fully in your right to make new friends who are there for you. You should live your life regardless of anyone’s absence. Sam sounds possessive of you, especially because she can’t stand you being around another person. Red flag. The fact that you have to split time between your new friend who is there and walk on Glas with Sam is not a way to live. This may sound heartless, but I would drop Sam if I were you. Illness is no excuse for being a toxic friend.", "NTA, and Sammy is for not allowing the three of you to have lunch together. Stop allowing Sammy to force you to treat Mary badly.\n\nI'm sure being ill is incredibly difficult, and Sammy's hurt that you have parts of your life that don't include her. That does not give her the right to be possessive of you and rude to your friend.", "NTA \n\nI understand where she’s coming from because deal with sickness is hard, especially when she has to go through it on her own. However, I think it’s really unfair that she’s expecting you not to make any friends, socialize or do anything else while she’s stuck at the hospital all the time.\n\nYou are allowed to make and have your own friends aside from her. Don’t feel bad or guilty for that. Mary is just as much as your friend as Sammy is, and spending time with her on her birthday is completely okay. Sammy will realize it eventually and come around, so just give her some space. Hope Mary had a nice birthday!", "NTA. But maybe you could have worded it nicely. Im guessing mary is a bit insecure about losing her only friend due to missing school so much and lashing out by making these mean comments. \n\nyou should sit down with Mary and explain that one can have more than one friend and she can be friends with Mary too if she would like to. Then if you happen to miss school Sammy would have someone yo hang out with during lunch.", "Maybe you should have stood up to Sammy the first time she asked you to not include Mary. For that, YTA and you owe Mary an apology for allowing yourself to be manipulated at her expense. Sammy is also TA, as she is so threatened by Mary that she is acting like a fool. Let her know there is always the invitation to hang out with you and Mary, and leave the ball in her court. If she can't share, that's her issue.", "She’s being jealous and it’s hard to manage when it’s three people sometime. Just say that it’s not about her being sick and about meeting people in general. She only wants you to be one on one.\n\nHow does Mary feel about Sammy?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI 17F have a friend 16F, who I will call Sammy who has been my friend for many years. My friend is constantly ill and she's currently doing a lot of tests to figure out what's wrong and I mean ill as in throwing up constantly, fainting, etc. Because of this, she isn't in school a lot like sometimes she'll miss a whole week. I don't have many friends besides her so when she's not here i'm always sitting alone like in class or especially during lunch. Recently, I have made a new friend, Mary who I hang out with now during lunch. It's been so fun and we can talk about anything. We've bonded so well because we both used to just be alone but now we have each other to talk to during lunch.\r  \n\r  \nHowever, there was a period when Sammy wasn't here and i hung out with Mary more and we got close. When Sammy came back from that periodshe asked to hang out during lunch and I told her she could join me and Mary for lunch. She was confused but joined me. I thought we were having a good time but after we left Sammy told me that she thought Mary was boring. I shrugged it off because it was their first time meeting. So after that, that's how it started to be with Sammy (whenever she was here because she would only be here like 2 days a week max) coming with me to lunch with Mary. Sammy told me that she wanted me to hang out with her and not Mary whenever she was here which I agreed to because it would only be no more than 2 days.\r  \n\r  \nI felt bad for leaving Mary because she would be alone on those days but I told her we could hang out for the rest of the week when Sammy wasn't here. Whenever I would be with Sammy though she would bring up Mary asking why i'm friends with her because she's shy and just seems boring. I would tell her to stop but she would still do it\r  \n\r  \n.It was fine until two days ago when it was Mary's birthday, she had asked for me to be with her for lunch on her birthday days prior and I assumed Sammy wouldn't be here so I said yes, I would've said yes anyways if Sammy was here though. I was surprised to see Sammy in school that same day and she asked me to come with her for lunch as usual. I told her I couldn't because it was Mary's birthday and I really wanted to be there with her.\r  \n\r  \nThis started an argument and she said she felt replaced by the fact I was hanging out with Mary.I told her I wasn't replacing her and that it just wasn't fun being alone whenever Sammy was absent and that it's not fair and i shouldn't put everything on halt when Sammy comes back. She then told me that I was blaming her for her illness and that she can't control being absent. I told her i'm not and that I just can't wait for her anymore, that I needed to live my life too. She got silent, called me an a-holeand left. I feel like i might be the a-holebecause she's ill and cant control when she's not here and i probably shouldn't have softened my words.; So AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. You're not blaming Sammy for her illness, you're just living your own life. If she was just feeling insecure and expressing that, that's one thing. But to constantly be putting Mary down, and giving her the stink eye? That's juvenile even for a 16 year old. That has nothing to do with her illness, and everything to do with being shitty at regulating her own jealousy.", "NTA - Sammy can't handle the idea that she doesn't have you to herself anymore. That sucks, and having been on your side of the equation it's easy to feel guilty for the situation. However her having friends is not your responsibility. You have a life too, and she needs to respect that.", "NTA and I would reframe it to her. You can have multiple friends and she's the one who is trying to make you pick", "NTA. You're allowed to have other friends. I get that Sammy is ill. It's unkind of her to expect you to be alone when she's not there. It's also not really something a good friend would WANT their friends to do.", "NTA as empathetic as I am to Sammy illness that doesn’t mean that life stops until she comes back around. You have a right to have other friends and please don’t feel guilty about it", ">Im guessing mary is a bit insecure about losing her only friend due to missing school so much\n\n(sammy)", "Mary feels uncomfortable around Sammy because Sammy used to be really quiet around her, not like in a shy way but in a way that Sammy would stand really close to me and just give Mary sort of a stink eye. \n\nMary told me she felt  left out when I started to hang out with Sammy whenever she was at school so I think she started to resent Sammy because she felt like whatever Sammy says, goes but she used to ask if she could hang out with us which Sammy would always tell me to tell her no.", ">How does Mary feel about Sammy?\n\nThis is a great question!  I hope OP answers.", "Ooof… well, you are in a rough spot. I’d tell Sammy, she’s not your only friend and needs to be nicer to Mary. Mary isn’t replacing her but someone you’re friends with. It honestly sounds like Mary is someone your open with, more so than Sammy. If Sammy alienates Mary, you will need to choose. Don’t say it’s because you don’t like sitting alone when she’s not there. Say you like Mary too and if she can be nice to her too, you can’t really be friends"]}