{"id": 1731, "submission_id": "yotx0m", "title": "AITA for being annoyed my boyfriend invited his friend to join our date?", "selftext": "Saturday My boyfriend and I planned a date. We were going to the golf course and then to have dinner. I don't really play golf but I enjoy riding in the cart, flirting with him, and occasionally chipping/putting. \n\nSo Saturday morning we made some drinks and headed to golf course. When we get there my boyfriend sees a friend of his, Chad, playing with some other people, so he waves at him and we say hey. \n\nAfter this we get a light snack then start playing golf. The round is going okay but my boyfriend is getting annoyed that he isnt playing so well. I'm still enjoying the sun and having fun putting and chipping. \n\nAbout half way through the round of golf, Chad pulls up in his cart. Him and my boyfriend start chatting and I hear Chad mention joining us and playing the back half again. My boyfriend agrees and gets back into our cart to move on. \n\nI ask my boyfriend if Chad is joining us and he says yes and asks if it's a problem. I explain that I thought we were playing together and would prefer him not, my boyfriend brushes me off and says we are still playing together a friend is just joining us. \n\nThe problem is we haven't had a date in awhile, Chad and bf golfed together 2 days prior, and I don't really enjoy hanging out with Chad as he's kinda condescending and I get a little anxious around people I'm not close to. So instead of putting/chipping anymore, I just stayed in the cart and played on my phone. \n\nWe got into an argument after golf and canceled dinner. Now we are at a standstill where boyfriend says he didn't do anything wrong and instead of having fun with him and his friend I ruined my own day and ignored them for my phone. I'm annoyed he put hanging out with his friend before our date, but now I'm questioning whether I should have just tried to have fun with him and his friend. \n AITA? \n\nTldr: Boyfriend agreed to his friend joining our date, I'm annoyed he didn't consider me first.\n\nETA: People are saying I should clarify. When I said \"I don't really play golf\" I didn't mean I dislike playing golf,  I just don't really know how to play. My boyfriend is teaching me but I'm at a very beginner level and still get nervous when other people are watching/judging. \n\nAlso we are late 20s", "created_utc": 1667842039, "permalink": "/r/AmItheAsshole/comments/yotx0m/aita_for_being_annoyed_my_boyfriend_invited_his/", "score": 417, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Boyfriend says he didn't do anything wrong and instead of having fun with him and his friend I ruined my own day and ignored them for my phone. I'm annoyed he put hanging out with his friend before our date, but now I'm questioning whether I should have just tried to have fun with him and his friend instead of getting upset. AITA?\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA \n\nConsidering it was supposed to be a date just for the two of you, it’s understandable you’d be upset if he asks someone else to join.", "Sorry, but does your BF have a lot of redeeming qualities? He does not seem to care about your feelings.\n\nNTA", "NTA. It was a date, not a hangout with friends. He asked if it was okay, you said no, yet he still let Chad join. You were wanting quality time with your bf from the date, but he didn’t care/see that. I don’t blame you for being on your phone as it no longer became a date when Chad joined.\n\nHe could’ve waited for another time, obviously he’s golfed with Chad recently- and hasn’t been able to go on a date with you for a while. \n\nAlso, just because OP didn’t like golfing *(edit: OP enjoys it, just doesn’t practice it),* she still was having fun with her bf until Chad decided to join them. That’s still a date to do- a lot of dates are going somewhere to have fun, and end it with a dinner/meal. She’s NTA for a part of the date (eventually the whole date) being ruined because her bf let a friend join without OP’s permission.", "Does he know how you feel about the friend?", "NTA. It sounds like you don't love golf, and if your boyfriend doesn't focus on you, it's not much of a date for you at all.", "Sounds like your BF is Sheldon Cooper and clueless. Yeah you should be annoyed or even a little pissed off over it. \n\nNTA", "YTA. It was just 9 holes of golf and it’s not like he sought out his friend to specifically create a buffer between the 2 of you. His friend kind of crashed it. You threw a fit for something that likely represented 15% of your date.", "NTA. Golf is a perfect active date. It's isolated enough that you have the illusion of privacy, you can have good conversations and you get to practice a skill. \n\nChad invited himself on a date. That's tacky. You weren't asked your opinion on him joining. That's rude. Now your boyfriend is blaming you for having an opinion on who you spend your time with and behaving according to your preferences. That's asshole behavior. \n\nYour boyfriend does not get to do whatever he wants with no consequences. Your boyfriend made a choice. He is mad at the consequences of his choice and trying to manipulate you into never making him have consequences again. To me this is controlling behavior. Just my opinion though.", "[deleted]", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSaturday My boyfriend and I planned a date. We were going to the golf course and then to have dinner. I don't really play golf but I enjoy riding in the cart, flirting with him, and occasionally chipping/putting. \n\nSo Saturday morning we made some drinks and headed to golf course. When we get there my boyfriend sees a friend of his, Chad, playing with some other people, so he waves at him and we say hey. \n\nAfter this we get a light snack then start playing golf. The round is going okay but my boyfriend is getting annoyed that he isnt playing so well. I'm still enjoying the sun and having fun putting and chipping. \n\nAbout half way through the round of golf, Chad pulls up in his cart. Him and my boyfriend start chatting and I hear Chad mention joining us and playing the back half again. My boyfriend agrees and gets back into our cart to move on. \n\nI ask my boyfriend if Chad is joining us and he says yes and asks if it's a problem. I explain that I thought we were playing together and would prefer him not, my boyfriend brushes me off and says we are still playing together a friend is just joining us. \n\nThe problem is we haven't had a date in awhile, Chad and bf golfed together 2 days prior, and I don't really enjoy hanging out with Chad as he's kinda condescending and I get a little anxious around people I'm not close to. So instead of putting/chipping anymore, I just stayed in the cart and played on my phone. \n\nWe got into an argument after golf and canceled dinner. Now we are at a standstill where boyfriend says he didn't do anything wrong and instead of having fun with him and his friend I ruined my own day and ignored them for my phone. I'm annoyed he put hanging out with his friend before our date, but now I'm questioning whether I should have just tried to have fun with him and his friend. \n AITA? \n\nTldr: Boyfriend agreed to his friend joining our date, I'm annoyed he didn't consider me first.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Yeah if it was a random round after work or something sure, but we specifically planned a date for us to spend time together.", "Yes and he's told me before that Chad doesn't really like me either.\n\nEdited to add: we both game with him some and boyfriend has even stated Chad can be a lot sometimes.", "I honestly don't hate golf. But I don't really know how to play so boyfriend is teaching me; starting with how to chip/put. I just don't want to practice infront of Chad, he changes the entire group vibe and I get anxious.", "I don't necessarily see sitting in the cart on one's phone as a fit.", "I understand your point, but it was 3 hours of our date. They just golfed together 2 days before we haven't had a date in over 3 weeks. I understand boyfriend didn't seek friend out but he could have easily said not this time we are on a date", "Since when does any point of a regular date include other people joining you if you aren't on a double date? NTA", "I don't dislike golfing, I just don't really know how to play. I enjoy going with my boyfriend as a date when he flirts with me and when its slow he teaches me how to play and gives me tips on how to chip/put. \n\nI also don't see telling a friend, \"hey man we are on a date but let's play together again this week\" as a rude thing", "It’s rude now to tell people they can’t join you and your partner on a date? You can’t be serious. And dates usually take place in public spaces. Does this also apply to restaurants, movie theaters…", "Yeah. He can play golf with Chad anytime. You had planned that time for you.", "NTA. BF was rude and inconsiderate. Chad should have caught a clue and moved off.", "NTA", "NTA\n\nThat alone makes you NTA, but your bf is one. Who invites a friend to join a date and then to top it off it’s the friend where there’s a mutual dislike?! Your bf created this mess by prioritizing his friend and golfing with him over you. Now it’s time for him to realize that and plan another date in the not so distant future for just the two of you.", "I get that. It's okay to say golf is nice when it's you and the SO, and not when you have to entertain someone else and play somewhat competitively. It's okay to like things a little bit.", "It may help if you add an edit clarifying the \"don't play\" point. It might cut down on the number of people taking it as \"I hate it\" instead of \"I don't know how but am slowly learning\".\n\nPesonally, I don't think it matters either way. You were happy enough to be there and were enjoying yourself before Chad joined you. You even said you were having fun chipping/putting.\n\nI also don't think it matters how long it had been since BF & Chad played together.\n\nWhat matters is that you were on a date. BF should have waved off Chad almost immediately.\n\nNTA.", "They canceled dinner because of it. That doesn’t happen if there wasn’t some emotions on a sleeve.", "If that’s how you feel then you should be upset that your boyfriend suggested a date where you watch him do something only he enjoys. Maybe he should have taken you to a winery or something.", "Is it really a date when you just tag along to watch him golf bc you don't like golfing? Seems like you would have a better time if you just met him for dinner rather than going to activities you don't enjoy in places where people you don't like frequent.", "Also, since when does a date involve watching someone do something that you don’t do?", "Exactly this- he prioritized his friend over his gf. *On a actual date with his gf let alone.* Sometimes third wheeling is okay, especially if all three+ are friends, but not when one of the couple is uncomfortable with it.", "It seems the emotions are on both sides, rather than one person \"throwing a fit\".", "It started out as a fun date when he was flirting with me, giving me tips on how to put/chip, chugging beers with me when he made a good shot. \n\nIt stopped being a fun date when he agreed to his friend joining and started talking golf with him instead.", ">bc you don't like golfing\n \nWho said I don't like golfing? I do like golfing, I just don't have a set of clubs and I haven't really played. \n\nBoyfriend invited me and is trying to teach me, and I want to learn so why wouldn't I go? \n\n\n>where people you don't like frequent\n\n1 person who I don't get along with and didn't want to tag along on my date.", "OP had agreed to it and was enjoying their time together until Chad showed up.", "Fair enough but it sounds like the GF made her annoyance known first. Maybe his reaction to that was too defensive.", ">I don't really play golf but I enjoy riding in the cart, flirting with him, and occasionally chipping/putting.\n\nYou said that- you don't like golfing, you like watching him and distracting him while he golfs. You've expressed zero interest (until now) in wanting to golf. \n\nYou know he's frequently there golfing with friends, it shouldn't be surprising that you'd bump into them.", "I said I dont really play\n\n>occasionally chipping/putting.\n\nIs interest in golfing\n\n>it shouldn't be surprising that you'd bump into them.\n\nIt wasn't surprising to bump into them or to say hey. We bump into people on dates all the time at restaurants and other places, but they don't normally sit down and pull up a chair to join us on our date.", "Not really playing something and not liking something are definitely not the same.", "NTA. Is your boyfriend dismissive of your feelings on other matters or just dates?", "Nta next time take the cart to the club hose wait there then drive home without a word. When he calls ask if he enjoyed his date and hang up", "Nta. Does chad have an art room that your partner frequents?", "NTA. The problem is he deprioritized you. What’s that saying about why pay for the cow when milk is free? No milk for him and maybe some counseling.", "NTA - First of all it was a date. If he didnt wanna listen why did he even ask if its okay even when he was gonna do what he wants. Anyone would be upset over this. You also mentioned he played golf with the friend 2 days ago so it wasnt a very urgent thing to include him between the date. He couldve done that later as well. And then after all of this blaming you? Nuh uh thats not at all a valid point. He better realise it and be sorry.", "NTA. Ew. I would have been pissed if my fiancée did that! He should have respected it was date day and ASKED you first before offering Chad to play the back half again.", "NTA.  It doesn't matter that you were golfing, it was a date.  Chad shouldn't have been invited.  If Chad walked into a restaurant while you were on a date, would your BF invite him to join you?  \n\nYour BF shouldn't invalidate your feelings.   You should talk and hear each other out, but your reaction was not \"wrong\".  Your BF & Chad changed the terms of the deal without asking if you minded.  You minded.  Why are you automatically \"wrong\" for wanting to enjoy the time with your BF?  Adding a 3rd wheel obviously changed the dynamic.", "NTA, have a calm sit down with your boyfriend where you have a conversation about your very reasonable needs and why one on one time is important to you and one on one with Chad isn't the same thing.", "NTA. I would have told them to enjoy their date and left.", "YTA, because you STAYED there. Next time this sh\\*t happens, call yourself a ride share and leave the lovebirds alone. In case you haven't seen it yet, YOU'RE THE THIRD WHEEL. Get out now, you're just dating him.", "Nta", "NTA but the original date didn't sound that good either if you're not into it much. Your bf doesn't seem to take an interest in spending quality time with you, but his bff he does.", "NTA. Inviting a third person on a date is rude and says he doesn't prioritize you. I'd find another boyfriend.", "YTA. You don’t seem to like the game. Yeah it was supposed to be a date but you make it seem like you would rather not be playing. Also it’s not like your boyfriend planned for his friend to be there. They both enjoy gold so you ruined it for yourself.", "I think its hard to answer this without knowing more about the relationship.  How long have you been dating?  Do you live together?  How often do you spend time together that isn't officially considered a date?  If it is a new relationship where the only time you are together is on a date, then this is absolutely not an ok thing to do.\n\nIf you have been together a year or two and spend time together outside of official dates, not a big deal.\n\nIf you rarely get 1:1 time and this is outside the norm, then it would be an issue for other reasons.", "I wondered how long it was going to take to get an art room comment. I thought the same thing.", "I'm just learning to play so yeah I would rather not be playing with his friend judging everything I do.\n\nI also know they both enjoy golf, which is why they play together weekly. I just didn't expect him to be invited to join our date when they just played together two days before.", "We don't live together. We've been dating two years. I work a lot more than him, so we don't spend as much time together. He usually comes to my place for dinner Monday and Wednesday. Then we'll do something Saturday and/or Sunday.\n\nI spent the last two weekends with him and a different friend, which was fun because I agreed to it before hand and I like this friend. But I wanted to have a date that was just us getting to  flirt without having to consider the third person there", "Also, be careful because BF having friends who are rude and condescending shows that he's okay with those qualities. I'm not saying dump him but I am saying who he is when you're not around is who he will eventually become to you. Just think carefully about how he treats you and if that's the life you want.", "There is not much to say when your bf asks a friend to join in when the friend has said that he doesn’t really like you. I think you have a bigger problem than you think, and it goes way beyond a single golf game. NTA", "NTA, but your boyfriend likes/respects Chad more than he likes/respects you.", "I rule NTA for one specific reason: He asked if you were okay with Chad joining, you said no (good on you for being honest), and then he berated you for your answer.  Ideally, he would have immediately told Chad you were on a date, and that it would have to be another time. Barring that, he should have asked you your opinion before agreeing with Chad. When he failed to do that, he should have respected the answer you gave when he finally he did ask.", "NTA: Date means the two of you not bringing a friend with! So he don't care that you ask to have more alone time with him than maybe you should have your alone time at all!             Stop looking after him, don't beg anymore and if he still not understand the basic of relationship like listen to your feelings well maybe you should question yourself why you are with a guy who prefer spending time with others than you!", "I’m pretty sure your boyfriend really only wants to date Chad\n\nNTA", "NTA It was a date, it was rude and inconsiderate to invite his friend to join you, especially someone you don't like.", "My boyfriend of 3 months as of today will ask me even if it's just his family around or his cousins who iv met 2 of before. I have. Bad anxiety at Times and usually of I'm uncomfortable play with his dog Zoe. If your man won't consider your feelings then either have a conversation about it and make a plan moving forward or RUN LIKE THE WIND. Raise your standards girl. If he won't consider u then next time get revenge have ur friends show up and see how he likes that", "Your boyfriend would rather spend time playing golf than going on a date with you doing something together you both enjoy. Full stop. The friend is a red herring at best; an obvious symptom of dysfunction in how your boyfriend handles time with you at worst. (And as others have said, tolerating condescending behavior in a friend tells you who he really is) Find a new boyfriend. NTA", "NTA. It was supposed to be a date just for the TWO of you, not three. You even told him you thought it would be you and him playing together and you’d prefer chad not to play with the two of you. He dismissed your feelings and then he got mad when you got upset.", "NTA. You should have left and told him to have fun on his date with Chad.", "NTA. Remind him this was a date not a hangout, and next time you should pick an activity that YOU like as much as your bf does golf.", "NTA\n\nMy only question is if you guys both called this a date when it was planned. I know some people dont always assume something is a date. But either way it was shitty of him to use your quality time together to play golf with his friend.", "NTA But I think you may have to reevaluate your bf here\n\nIt sounds like he does not prioritize you and you need to tell him that's why it upset you that he brought his friend along", "NTA, but I am curious: when you were planning this day, were you referring to it as a date? My partner used to do this all the time and his reasoning was that if we weren't calling it \"date night\" or a date, he just thought of it as us hanging out. I think it sounds idiotic, but if his brain works like that I can only assume other people's might too. Just food for thought.", "NTA", "NTA. Your boyfriend is the asshole here. He should have just said no to Chad joining. \"We're on a date. I'll catch you some other time,\" is pretty easy to say. Sulking is a bit immature, but you're not an asshole for that. \n\nIf you have issues with anxiety, is your boyfriend aware? Is he aware that Chad is condescending? Does your boyfriend remember/realize that when you told him you weren't comfortable having Chad join you he totally ignored you and treated you like your opinion and feelings don't matter? Your asshole boyfriend may need you to lay these things out plainly for him. If he still refuses to acknowledge fault and promise to do better going forward, dump him.\n\nYou should be with someone who actually gives a damn about you, your happiness, and your relationship. I'm not sure your boyfriend is good boyfriend material.", "NTA.  Move on to a bf that actually gives a shit and prioritizes you.", "NTA. I’d be pissed if my husband invited someone to our date without even asking me, and he would also be if I did the same. Happy cake day btw, OP!", "ESH.\nExcept Chad, who probably didn't know y'all were on a date since no one piped up to say so when he mentioned joining you.\n\nBF sucks for not saying anything about a date and you also didn't say anything to Chad about the date. You also suck for playing on your phone while they played. \n\n\nMy petty self would be over to Chad the moment he pulled up in his cart and once he said anything about joining and before BF could say anything is when I'd say \"well, we're on a date\" and see what the BF does/says. If BF says it's just the last half. If Chad said anything about the way I played, I'd remind him I'm a beginner and my BF is showing me how to play on OUR date that you're cutting into, so you can zip it. If Chad didn't leave after that and kept playing but stayed silent, then when golfing is done I'd ask BF \"now can we continue our date ALONE for dinner\"? And if BF said anything to me about being rude I'd remind him that he let someone in on OUR date without informing said person about the date and also it was a person who he played golf with just 2 DAYS prior.", "NTA Any reason you didn't ask immediately why he invited his friend on a date? Then follow with you may be attracted to Chad but I'm not so no 3 way chance in hell.\n\nIt would have embarrassed them but clued them in its a date. Or other option was for you to leave course immediately since sate was over.", "Lol I came here to look for this too!", "Came here looking for this comment", "We planned it the day before. We were originally going to play golf at this fancier golf course and have dinner at their expensive course restaurant after, but they were booked so we decided on golf then dinner not at the course.", "I could understand that and if we were just hanging out then I wouldn't have minded his friend joining. We hung out with a different friend of his the last two weekends but this was different. \n\nWe specifically planned it out the day before. We were originally going to play golf at this fancier golf course and have dinner at their expensive course restaurant after, but they were booked so we decided on golf then dinner not at the course.", "You were upfront with your boyfriend but then acted passive aggressive once Chad joined. Perhaps you could have also told Chad you were on date. \n\nSounds like your boyfriend doesn't care to be alone with you, to be honest. \n\nNTA but try to stand up for yourself more.", "My ex was like your boyfriend. He constantly invited his friend on our dates so he wouldn't be left out. I'm certain our relationship would have been better if the friend wasn't intruding on us so much. His friend was also a huge part of the reason why I broke up with him.\n\nThink about whether or not this is something you want for the rest of your life with him.", "Been real popular lately", "Yes \\^\\^\\^ Warning sign.", "NTA", "NTA, but your bf and his sidekick Chad are both waving red flags at you. Please see them for what they are.", "NTA. ITs weird to run into someone and then invite them to your date. Your BF is a bit controlling and you may want to reconsider. This type of behavior on his part will likely continue. You deserve better.", "NTA", "NTA.\n\nYour boyfriend is horribly dismissive of the fact you wanted alone time with him. Golf is the Iranian yoghurt of the situation here, which is to say it's not the issue.\n\nHe didn't value that privacy with you versus socialising with his friend.\n\nIf he can't understand that, you're at a fundamental, emotional impasse with this man.", "NTA sometimes avoidantly attached people use this as a distancing strategy -google it", "ESH. BF because it was a date, of course, but girl, you have a mouth. Speak up when you are unhappy. No one else will speak up for you.", "Ask your boyfriend if your date was sitting at home getting busy on the couch, would it be cool if his friend joined in.\n\nIf no, then it shouldn't be OK on any other date.\n\nIf yes, well, you've either got bigger problems, or not. But that's a different AITA.\n\nNTA.", "NTA. like at all. he asked you if it was okay, you gave him an honest answer and told him you didn’t want to. even if you potentially could’ve had fun, he still chose to blatantly ignore your feelings, and doing so obviously comes with repercussions (especially when it comes to your partner who loves you. when they ignore your feelings about the little things and you conform yourself around it, it often leads to being powerless and your feelings being ignored about more important things because they’ve gotten used to getting away with it). for him to get mad at you because you weren’t enthusiastic about the thing you literally told him you weren’t okay with is gross.", "NTA: bestie, you are worth more than a guy who can't get his head out of his ass. \n\nThis behavior won't change, don't waste your time with some guy that doesn't treat you like the queen you are.", "NTA", "I utterly DETEST people who are on their phones when supposedly visiting/dating/etc.... \n\nNTA.... bringing in a third to a date trumps being on the phone.... big time.... what a clueless individual your bf is....", "In this case it might be a backyard putting green.", "Or once at club house, drive home. Text home to have Chad drop him off when their date is done or uber", "Yes sit down talk to him. Let him know you have date rules. Intentionally having annoying friends crash them is 1 of them.\n\nIf he doesn't agree to this one, do you want to date him?", "Next time take the golf cart back to the car and go to the spa. Don’t waste your time and energy on a man who doesn’t care about you.", "Sorry reread and see you did tell him", "I agree with this if he doesn't then you need to punt him as he doesn't see you as that important as his buddy", "I suspect that he arranged for Chad to meet up with him.", "Yep, classic men liking women but *loving* men behavior.", "OP, has your boyfriend built Chad an art room?", "“Saturdays are for the boys!!”", "I was waiting for this comment 🤣🤣", "Just me and you, and you and me and your friend...**Steve.**"]}