{"id": 17340, "submission_id": "13ikbrs", "title": "AITA for not housing my parents on their trip to see me?", "selftext": "For context, I live in CA and they live in the Midwest. They don’t have a ton of money and really want to visit me but they’re pushing me to accommodate them in my apartment. Thing is, I live with FOUR other people to pay rent and even if they slept on the couch it would be really weird and awkward. My roommates don’t really want them coming over and I told them if they want to visit they have to find a hotel. My parents are calling me TA because it would only be for about a week. Thoughts?", "created_utc": 1684184364, "permalink": "/r/AmItheAsshole/comments/13ikbrs/aita_for_not_housing_my_parents_on_their_trip_to/", "score": 47, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the asshole because my parents can’t afford a hotel to visit me, even if I can’t accommodate them at my apartment.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. If I were your roommate, I'd be pissed if you let your parents come and crash there in our tiny apartment for a week. \n\nThe entitlement of your parents is a little much.", "Come on. Your parents are asking too much, and you live with four roommates, who would be inconvenienced. Besides, a week with your parents? That’s a long time. \n\nNTA. Final decision.", "NTA\n\nYour housing situation doesn’t allow for your parents to stay over. It’s not just your space, it belongs to your housemates too and if they don’t feel comfortable with it then there’s nothing you can do. Try explaining it to your parents and maybe help them find some affordable place to stay nearby.", "Also forgot to mention that they are helping me pay rent and go to college here, so to them I am ungrateful for their support. I am SUPER grateful I am just not in a situation to house two extra people in my apartment, even for a week", "NTA, no way. If your parents want to visit, then they have to find their own accommodations. If they don't have the funds to do so then they should make the trip when they do.", "\\*only\\* a week?\n\nNTA. Your roomies would murder you.", "NTA\n\nIf this were your place alone I could see them asking, but no, it’s not acceptable for them to expect you AND YOUR ROOMMATES to accommodate them on the visit.", "NTA you don't live alone so it isn't your decision solely.", "Would your roommates be okay with you sleeping on the couch, and your parents staying in your room? If not, then there's not much more you can do to compromise in this situation. \n\nNTA\n\nSounds like money is tight, perhaps they can wait a little longer until they can save up for a motel or if your living situation changes. Or you could visit them when you can.", "NTA. With the little info you gave, seems you can’t house your parents regardless of your preference, so case closed.", "NTA\n\nIt’s not (just) your call to make. Your parents are being unreasonable.", "NTA\n\nSharing an apartment 5 ways is pain enough, if someone's parents crashed on the couch for \"only\" a week (actually a pretty long time!) I would be ripshit.", "NTA.  A week is a long time to have your roommate's parents sleeping on the couch.  Your parents may be from families where you never stay at a hotel if you have a floor to crash on--this is a fine budget philosophy if you have *willing family* who can host you--but throw some roommates into the mix and it's game over. If they can't afford a hotel, they can't visit--it's as simple as that.", "NTA. This isn't a reasonable expectation.", "They wouldn't sleep on the couch, OP, you would.", "NTA. My kids are just out of college and I find it weird that any parents would want to stay in an apartment where their college student child has 3 roommates.  Sounds uncomfortable for EVERYONE.", "NTA. Your roommates signed up to live with you, not your guests. Your parents should look for other accommodations.", "Ask them if they really want to stay on the couch with 4 people who are going to be annoyed some old people are taking their couch for a week?", "NTA you don’t have your own place! It’s ridiculous that they expect four other strangers to house then for a week.", "NTA. You have roommates that you have to respect.", "Only a week. Only inconveniencing 4 rent paying adults, but only for a week. 😂 NTA", "NTA. They’re being a bit unreasonable her in my opinion. Even they’re helping you pay rent, you have 4 other roommates that need to agree to have your parents as houseguests for a week!! It’s not a unilateral decision your get to make alone.", "YTA They probably don't have money for o hotel", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nFor context, I live in CA and they live in the Midwest. They don’t have a ton of money and really want to visit me but they’re pushing me to accommodate them in my apartment. Thing is, I live with FOUR other people to pay rent and even if they slept on the couch it would be really weird and awkward. My roommates don’t really want them coming over and I told them if they want to visit they have to find a hotel. My parents are calling me TA because it would only be for about a week. Thoughts?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. If you imposed weeklong visitors onto your roommates, you would be an AH. Your parents should stay home if they cannot afford the trip to see you.", "It's not YOUR house.  Your roommates have a say in the matter.  You don't get to have week-long visitors without their approval.  End of story.", "NTA my mom insist she get a hotel even when I tell her she can have my bed. And my roommate doesn’t mind. \nIf they were staying one night I’d get it but a week ? 4 roomies? That’s bogus.", "NTA, tell them you would love to but 75% of the residents say no. It is what it is.", "NTA\n\nMy parents never stayed in my apartment when I had roommates. They always booked a hotel. \n\nWhen you have your own place with no roommates, it is completely different.", "NTA Tell them you do not have the permission of your roommates. End of story. If they can't afford a hotel then the trip will have to be put off, it's not just YOUR apartment", "NTA.  You have roommates and no spare space for them.", "I’m a mom to a college student. I help pay his expenses. I would never ask him to house me. Not only would it be weird for his roomies, it would be uncomfortable for me. He’s within driving distance and when I’ve gone to visit I don’t even expect to be invited in.\n\nEdited to add: NTA", "Your parents are being ridiculous. If it was your place alone, it would be different, but all the gratitude in the world doesn’t give you the right to run roughshod over your other roommates’ wishes. I get that it sucks for them having to add another expense to the cost of traveling, but you don’t have exclusive control over your living situation. They’re asking you to do the impossible and calling you ungrateful when you can’t.", "Are you a first-gen collage student? It seems like they are just not aware of basic norms", "But they AREN'T paying to support the other 4 people in the apartment so they shouldn't inconvenience those people.", "I share a room with two people so probably not, mostly they just want to hang out in CA with me cuz the Midwest sucks but I go back there over breaks anyway", "I share a bedroom with two other people and have a loft bed they can’t climb😭", "So op should put out the other four other people op lives with? Or should they share a bed with their parents?", "Nope. They’re just overbearing"]}