{"id": 17354, "submission_id": "13iu6zg", "title": "AITA for not giving up my seat to an old lady?", "selftext": "I’m a huge film fan, and very tall at 6’ 9”.  I’m 64 yo.\n\nA new film arrives, and I’m all over it.  A 45 minute drive to the next town over, and I get to the theater early.  Because of my height, I go to the back row.  Especially in a full theater, the last place I want to sit is in a middle row, or way off to the side.\n\nThe back row is setup with seven pairs of twin seats, each separated by a 5’ gap so that someone can park a stroller or wheelchair between them.\n\nI’m all set in the middle pair of seats with no one behind me I might block.  The movie starts, but then 35 minutes into it an older woman comes in pushing her husband in a wheelchair into the full theater and settles into one of the spaces on either side of me.\n\nShe whispers to her husband and I hear him say, “I’m fine, just go find a seat.”  At that point she turns to me and says, “Excuse me, I need your seat.”  He quickly says “I don’t need anything and we’re late, just find another seat.”  Nope, she wants my seat.  “My husband is an invalid!  I need to care for him, now please move!”  This she says even louder.  All I could say was, “Sorry, I need to sit back here because of my height.  And, I don’t think there ARE any other seats!  Really, you should come back for the next showing.”  Now people are glaring at us.\n\nThis goes on, with her husband telling her he can sit by himself and doesn’t need her by him, to me refusing to move, to her getting more demanding.\n\nShe leaves and comes back with a theater worker, who says he has a seat for me in the very first row to the far left.  There’s no way I can see from there and I tell him that.  He doesn’t want to deal with it, and says with a shrug, “Well, they need to sit here.”   I said, no, she doesn’t _need_ to sit here, he does, and is.  She can sit anywhere.  At that she chimed in:  “I’m not going to sit all the way down there!”  Entitled much?  Sorry, not moving.\n\nShe then goes to each of the other people in the back row, starting with the middle pairs of seats demanding their seats.  She finally guilts a high school kid into giving up his seat. \n\nThe kid makes his way down there to not enjoy his now ruined film, while the old woman triumphantly takes over his seat, nearly 40’ away from where her husband is sitting.  \n\nAfter the lady comes to get her husband, she calls me a “rude bastard with no manners!” for not giving up my seat so “I could have sat next to my husband!”  I suggested that next time they get to the theater on time, so got a parting “fuck you!” from the old gal while her husband stared at his feet.\n\nSo, AITA?  Should I have given up the movie, the $30+ spent, the 90 minutes driving for nothing, so as not to be a “rude bastard?” I couldn’t see a later showing.  I always give up my seat to ladies on the bus or subway, but on this one I’m not sure if ITA or not, thanks.", "created_utc": 1684209096, "permalink": "/r/AmItheAsshole/comments/13iu6zg/aita_for_not_giving_up_my_seat_to_an_old_lady/", "score": 472, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I’m sorry, I don’t get it.  The post says that I think I might be the ahole for refusing to give up my seat, right?  I made a decision, but was I the ahole for doing so?  I could be wrong which is why I’m posting in this subreddit for the first time, thanks!\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA.  Normally, I'm inclined to side with those who have or assisting someone who has a physical disability. I've had seating issues myself and it's really fucking embarrassing to have to ask others to swap seats.  However, the way this woman treated her husband, referring to him as an \"invalid,\" and causing a downright embarrassing scene on \"his\" behalf was just awful.  I can't imagine the struggle he goes through every day dealing with that awful woman!  That woman was definitely TA!", "NTA, you were not obligated to give your seat for her. She asked and you said no. End of story.", "NTA, first come, first served. Tbh, not to sound like a hater, but she knew well in advance that her and her husband would need a lil more time to get settled into the movie theatre, they should have planned their trip a lil better.", "NTA. As a shorter person I really appreciate your move to sit in the back.\n\nNow, as for giving up your seat. Early bird gets the worm. They should show up a bit earlier next time if possible. I feel bad for the husband though, sounds like he wanted no part of this and felt embarrassed by her behaviour.", "NTA. You're over 60. You both are senior citizens.", "NTA.\n\nOP was right every step of the way. The lady was rude and entitled.\n\nThough maybe you should have got the guy's phone number so you could rescue him from his wife and take him to the movies without her once in awhile!", "NTA-I’m disabled and my family and I have long ago learned that if we arrive too close to the start of a movie I, the wheelchair user, may have to sit alone. She’s an entitled, ableist asshole.", "One of the casualties of the subreddit requiring a 3000 character max.  My vices are a large soda and popcorn at the theater, and that’s a $20 bill right there.  The rest is the movie ticket.  That’s where the $30 comes from.  Sorry, tried to reply to the question posted, but am not able to.", "I'm trying to find an iota of sympathy for this woman's plight. I've failed utterly, but her husband has my sympathy. \n\nNTA.", "I'm 5.1. As a person who has wasted a lot of money through her life because I was unable to see what I paid for due to ignorant tall people all I want to say is THANK YOU.\nThey were rude to be late in the first place and then by starting a discussion in the middle of the movie.\nYou are NTA and thank you again!", "NTA. She’s an entitled asshole. It’s not hard: show up on time or go to the next showing, and don’t ruin the movie for everyone else by causing a scene.", "INFO:\n\n>My husband is an invalid!\n\nDid she actually say that?", "She was late to the movie. What's she sticking around for after missing so many key plot points?", "NTA, you went out of the way to consider your height to not inconvenience other people in the theater, her husband said multiple times he was fine and could sit alone and she acted like a prick, probably just an entitled lady that takes advantage of the husband situation for any perks she can get playing the pity card", "The theatre shouldn't have let them in that far into a show.\n\nBut you are clearly sitting in a wheelchair companion seat. But you are very tall so it's good for you to sit at the back, and you are a senior citizen yourself. Just a bit of an unfortunate set up.", "I dunno, the seat immediately next to a wheel chair park, sort of implies that it’s for someone looking after a person in a wheel chair. Lots of people in wheelchairs are independent, but many are not. Even if the guy was saying he was fine, it may have been appropriate to give up the seat.\n\nAll that said, the lady was an AH here. They were late and she was not respectful to you or the rest of the audience, then became abusive.\n\nI know you were being considerate in sitting at the back, and maybe I’m getting the layout wrong, but the seat immediately next to a wheelchair park ought to be part and parcel of the accessibility seating and should also be reserved. I would consider avoiding using those seats in future if possible.\n\nThat said, assuming those seats aren’t signed as such, I don’t think you’ve actually done anything wrong here under the circumstances. Maybe you could have asked the usher for a refund (including if your snacks) and come back another time as a gesture of goodwill, but you’re not under any societal obligation to do so.\n\nNTA.", "INFO:\n\nSo you were sitting in two seats? You stated there were twin seats with a gap on either side. To me this looks like: \n\n💺💺__💺💺__💺💺__ all the way across. \n\nSo then, she parks her husband in a wheelchair next to you. The situation is now:\n\nstrangers👨🏻‍🦽you 💺__strangers___ …with an empty seat next to you, and then people sitting in the other seats in the row.\n\nSo basically, my question is: were these seats in pairs of two and did you have a seat on the opposite side of you from the man in the wheelchair that was empty?", "YTA those seats are for wheelchair users and their companion and caretakers.", "ESH.  This is why I only do theaters with assigned seats so I can make sure that me and a companion have spots since we can't sit just any where.  Stop automatically going for the wheelchair companion/ or other handicap seats.  I think I'd be less critical if you were running late and the theater was packed instead of picking them when you were early.  Yes, they were later.  Maybe they are bad with time management or maybe they were later because it can be hard to do things quickly when one person is disabled.  But again you didn't end up there out of desperation.  You deliberately picked the only row that people like me can use if we want to sit with others whom we may even be sharing food or drink with.  Stop doing that.\n\nI think it might have been fine to refuse to move but just don't go there in the first place from now on.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI’m a huge film fan, and very tall at 6’ 9”.  I’m 64 yo.\n\nA new film arrives, and I’m all over it.  A 45 minute drive to the next town over, and I get to the theater early.  Because of my height, I go to the back row.  Especially in a full theater, the last place I want to sit is in a middle row, or way off to the side.\n\nThe back row is setup with seven pairs of twin seats, each separated by a 5’ gap so that someone can park a stroller or wheelchair between them.\n\nI’m all set in the middle pair of seats with no one behind me I might block.  The movie starts, but then 35 minutes into it an older woman comes in pushing her husband in a wheelchair into the full theater and settles into one of the spaces on either side of me.\n\nShe whispers to her husband and I hear him say, “I’m fine, just go find a seat.”  At that point she turns to me and says, “Excuse me, I need your seat.”  He quickly says “I don’t need anything and we’re late, just find another seat.”  Nope, she wants my seat.  “My husband is an invalid!  I need to care for him, now please move!”  This she says even louder.  All I could say was, “Sorry, I need to sit back here because of my height.  And, I don’t think there ARE any other seats!  Really, you should come back for the next showing.”  Now people are glaring at us.\n\nThis goes on, with her husband telling her he can sit by himself and doesn’t need her by him, to me refusing to move, to her getting more demanding.\n\nShe leaves and comes back with a theater worker, who says he has a seat for me in the very first row to the far left.  There’s no way I can see from there and I tell him that.  He doesn’t want to deal with it, and says with a shrug, “Well, they need to sit here.”   I said, no, she doesn’t _need_ to sit here, he does, and is.  She can sit anywhere.  At that she chimed in:  “I’m not going to sit all the way down there!”  Entitled much?  Sorry, not moving.\n\nShe then goes to each of the other people in the back row, starting with the middle pairs of seats demanding their seats.  She finally guilts a high school kid into giving up his seat. \n\nThe kid makes his way down there to not enjoy his now ruined film, while the old woman triumphantly takes over his seat, nearly 40’ away from where her husband is sitting.  \n\nAfter the lady comes to get her husband, she calls me a “rude bastard with no manners!” for not giving up my seat so “I could have sat next to my husband!”  I suggested that next time they get to the theater on time, so got a parting “fuck you!” from the old gal while her husband stared at his feet.\n\nSo, AITA?  Should I have given up the movie, the $30+ spent, the 90 minutes driving for nothing, so as not to be a “rude bastard?” I couldn’t see a later showing.  I always give up my seat to ladies on the bus or subway, but on this one I’m not sure if ITA or not, thanks.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "This is why I love assigned theater seats.  Nta", "The only reason you should give up your seat is if there was a vacancy immediately in front so you could block the old hag. \nNTA", "NTA", "NTA- you are trying to be polite by not blocking anyone else's view and i thank you for that! You are absolutely right the couple should have arrived earlier. The husband understood that and he acted like a gentleman. The wife was a nasty asshole!", "NTA. If you want the special seating, you turn up early so you can get the special seating. Especially if it's a new release blockbuster.", "NTA.  As a short woman who is generally sitting behind someone your height i wish blessings on your house for such kindness.", "Ha! Love this idea!", "I mean, I know what an evening movie costs in my Midwestern city. I was 100% prepared to believe that in a larger city the ticket itself was $30 or close to it. Honestly, I'm more surprised at the $10 ticket than I was at the $30 ticket, lol.", "Yes, and I guess that’s true if he’s wheelchair bound.  But he was able to move his chair and seemed on the ball otherwise.", ">Maybe you could have asked the usher for a refund (including if your snacks) and come back another time as a gesture of goodwill\n\nAfter 35 minutes of the movie??\n\n\nWhy couldn't the woman and her husband come back later?\n\n\nWould they have refunded Op for his snacks too? \n\n\nWhat is this goodwill gesture you speak of? The time they chose for their convenience- you think they have more time in their back pocket?", "There were zero empty seats in the theater except for the one in the very first row far left.  All the back seats were filled, including the one next to me.", "Yeah my theater let's you know that if you reserve that seat you may be moved for a disabled person and their caretaker/companion.", "No, they are for anyone to sit.  They are not exclusively for handicapped people.  Families with babies in strollers often use those spaces, or people with shopping packages.  A wheelchair space is provided on each side, and I have never seen 8 wheelchairs in any theater.", "Agree, for sure the lady was rude, but it’s generally accepted that those seats are for the disabled and their companion. Next time sit one row up.", "As I said, there’s no obligation to do something like that, I was looking for another solution that might create the best net outcome for everyone, acknowledging that this may not be it.\n\nThe gesture of goodwill is acknowledging that we live in a society and we have a mutual obligation to look after one another, especially our most vulnerable. It would be goodwill towards the other theatre goers, the usher and the older couple. \n\nThe older woman in the story was out of line with her behaviour, no doubt, but you don’t know what her life looks like, and there may have been a very good reason they were late. No excuses for her behaviour, but maybe they could use a break.\n\nLike I said, I don’t think OP is the AH here, but maybe we should strive for more than simply not being a jerk.", "Okay, definitely NTA. Especially not TA for being considerate of your size when it comes to seating in a public place.", "You’re def NTA but I’m genuinely not following this set up. The seats are in pairs, you were in one seat of a pair, you’re saying there was another person in the other seat of your pair right? Old lady just targeted you cause her husband wanted to park it in the spot between you and another person and I guess you had the more central seat?", "Those are the only spots we can do!!!!!   We can't use any other row.", "And block the person behind me from seeing the screen?  Did I mention I was 6’ 9”?  I learned from 6th grade on to sit in the very back row.", ">The older woman in the story was out of line with her behaviour, no doubt, but you don’t know what her life looks like, and there may have been a very good reason they were late. No excuses for her behaviour, but maybe they could use a break.\n\nA movie isn't something that only shows once, though. It's not some social event that you can only go to that day at that time. If the lady had a very good reason for not not making it to the movie on time, she and her husband could have seen the next showing or come back a different day. Heck, a movie that is literally selling out the theater is probably showing on multiple screens in that building. Instead, she decided to go into the theaterb showing the movie *that had already started* and ruin the experience for an entire theater of movie watchers by making noise and throwing a fit.", "There was a guy next to me to my right.  To his right was a 5’ space for stroller or wheelchair.  To my left was an identical space.  That’s where she parked his chair, then hit me up.  After I refused she went to her husbands left where there was a couple, and asked the guy to vacate, and he also declined.", "But they’re not for your exclusive use. So be in time like everybody else so you can pick your chair. Don’t bully someone out of the chair halfway trough the movie, disturbing a whole movie theater. That’s just extremely entitled. Wait for the next showing.", "I have to agree with OP here. They’re all technically seniors (60+) and it’s first come first serve. Also, my father is 6’9 and my brother 7’1, and if they were to ever sit in front of me at any point… I would be PISSED lol. You don’t realize how big of a difference it makes until you’re stuck behind someone that size. Not only would OP’s movie (and neck) have been ruined from sitting front row, but if he had sat a row forward originally, people behind would have complained and his poor knees would have been aching by the end of it. He got there at an appropriate time to be able to secure a seat that would be comfortable for his physique.", "Sit on the outside edge, or maybe situated between the extra-wide spaces of the last row. I applaud you trying to be considerate and not block people, but it’s also considerate to not sit in the disabled zone.", "I agree, she sucked here, but I’d be willing to wager getting herself plus her wheelchair-bound partner ready for an outing takes a great deal more effort and energy (in both relative and absolute terms) than OP, even if he did have to drive 45 minutes to get to the theatre. That doesn’t entitle them to anything - I’m just suggesting we have some empathy.", "Gotcha that makes sense. Glad ya stood your ground!", "I only do reserve seating so I can know if I have the correct spots or not.   But I still think able bodied people should only take them as a last resort or sit fto the ends out.  Because most of the time the wheelchair spots are within the inside of the rows. I think it's entitled of people who don't need those spots to gravitate to them when they have other choices.  A lot of the time I only have three seats to chose between even if I'm the first person to pick a seat.   How many do you? Think about that.  And start actually encouraging others to only take them when a theater is actually full and not early.  Or to go from the edges towards the middle.  My complaints have been directed only at taking them in the first place before its reasonable to assume they won't be needed.  I'm fighting back against that mentality.  Not the refusal to move after a movie Gas begun if it did indeed already start.  I'm fighting back because it sounds like he first got seated when it was mostly empty.  Even if the couple arrived when the theater was half full, they may have still not been able to have seats together.  That's what I'm arguing about.   But whatever.  At least I have multiple theaters with assigned seating and cheap Tuesdays.  I can avoid assholes and pay a lot less doing so.", "I see your point, but there is no extra wide spaces of the last row to sit between, only seats in pairs with 5’ of blank floor between them.  And if the space were marked for disabled people I never would have sat there.  There was room for 8 wheelchairs.  If there had been any other seat remotely workable I would have sat there, but all the seats were full.  I can only imagine the groans if I moved down even a couple of rows.  I’m 310 lbs as well as tall, and I effectively block anyone from seeing past me with my back and shoulders.  I had two options, leave or stay.  To me it’s the same as what would you do if the theater was full and a non-disabled person came in and demanded your seat?", "And I would, if it were something like a social get-together or something that only happened once. A movie that's selling out entire theaters? Nope. I guarantee there's another showing they were slightly early to, so they could have gotten in before the theater was full and gotten the seats they wanted.\n\nETA: Also, the *movie* had been going for a half-hour. That means they were at least an hour late to something that only lasts for 2-3 hours, because the ads and trailers don't start until the movie start time, and that's at least 20b minutes right there.", "Sit on the far end then.  Not a middle one.  Most of the  rows I have seen don't have enough room for a chair next to the end space.  I'll use A for able bodied  and W for empty space.   AAWAAWAA tends to be what I encounter.  Now I will introduce wheelchair companion if I am with someone to illustrate how we tend to sit.  ACWCCWCA .  That's why an end would be a lot less likely for you to end up with a wheelchair next to you and someone wondering if you would move.", "OP said it’s 45 minute drive to the next town, so I wouldn’t be so sure it was some multiplex - and not all theatres have closed captioning or other accessibility features that might have been important for them. We actually don’t know.", "Man, you were already being very thoughtful to not get a closer seat where you're going to block all the people behind you.  Old dear just being entitled.  NTA.", "NTA.  That woman's poor husband, stuck with such a belligerent, controlling wife.", "NTA and I would demand my money back. How dare the usher harass you and ruining your movie? It’s already ridiculous to even let them into the theater if they were that late", "NTA.  \n\nThe Usher should have managed her way better and not allowed her to harass other patrons. Honestly I’d be writing to corporate.", "NTA. My husband was in a power wheelchair for many years and had limited use of his arms/hands. Which meant I needed to sit next to him. Our solution was always to be early. If we were flying, we booked our seats together. A little bit of planning on our part made our excursions pleasant. My husband would NEVER want someone inconvenienced due to our poor planning", "Mom of 6’ 10” and 6’ 6” boys - NTA! They are *VERY* mindful of where they sit, I applaud your caring about not blocking others. \n\nSecondly, the woman is an entitled WITCH!", "An “alright mate?” Was warranted", "I feel so bad for the husband. If he really does have to rely on her, and she acts this entitled with strangers + is so willing to embarrass and condescend to him, I hate to think about how many boundaries she must be crossing “on his behalf” everyday.", "I absolutely cannot imagine going to a movie without a big ol’ popcorn and soda pop, so I completely understand this 😂 I rarely go to the movies anymore because I know how crazy the prices have gotten.", "I see your point, but the way it’s laid out back there, if you can picture it, ALL 14 seats are adjacent to a space where a stroller or wheelchair can be parked.  But it’s inconceivable that 8 wheelchairs would be there simultaneously.  I’ve only ever seen one at a time, and that very seldom.  For a first run popular movie they aren’t going to keep 14 seats vacant.  They expect people to adapt as needed.  The only way your scenario would work is to keep the entire back row reserved for handicapped / disabled folks, and not even allow couples with baby strollers to use the spaces.\n\nAs to the refund, I think they probably would have agreed to let me see the next showing if I had asked (and if I could have made it) but I’m doubtful on the $20 worth of concession stuff.   And I’d have been much more open to just skipping the whole thing and calling it a busted day if all this had happened before the movie started while seats were getting sorted out.", "Because of my height I will always choose seating in the back row, which by design of the theater will be adjacent to a wide area for baby strollers or wheelchairs.  There will always be a space for a wheelchair, but not always for the companions to the person in the chair IF the theater was really packed as in this case.  For instance if the person in the chair came with several people some of them would have to sit in another row.", "Mate if the other couple didn't get there on time or plan accordingly then it's no-ones fault but their own. You can't ask someone to move after you've turned up half an hour late. NTA.", "Yeah, I didn’t clearly understand the seating situation from the other post/s I saw. Does that mean that those seats were less likely to be obstructed by a tall person sitting in the row in front?\n\nLike I said, you’re not TA here - ultimately the lady was a jerk and the usher is being paid to resolve these things, so it’s not on you.", "I went with everyone sucks here because it did seem like they were extra late but it seemed like op was pretty early and deliberately picked that row.   I'm trying to argue that that should only be last resort seating.  I've made that clear abundantly.  I'm only arguing because so many of you think that section should  be treated just the same as any others.  If the nta votes were just because the couple was extremely late but had caveats of to try to avoid that seating,  we'd be in agreement.   I do think after a movie has begun is rude.  But I also think it's rude for people to gravitate to that section early and it seems like he did sit in the middle of it early on.  \nBut I don't ask. I also don't do theaters without assigned seats and if they are taken already, i abandon the purchase.  But I have sometimes seen it when a lot of the companions are taken without the wheelchairs being taken even when there are more options available.  That's probably why I lean more esh and why I have been arguing more. Because maybe this couple was extra egregious but the general public probably should treat those seats as different from the rest.", "Nor can I, not without ruining the movie for some unfortunate person behind me.  I’m very conscious of my physical height, and wasn’t blocking the stroller/wheelchair space.  If she wanted to ensure a space next to her husband in his designated spot, then she should have got there on time, or, in this case since she was late she could sit by herself.  Personally if I miss the first quarter or third of a movie I go to a later showing.", "Yes, I did get there early and specifically chose that NON DESIGNATED HANDICAPPED back row, so that I wouldn’t block others from watching the movie.", "Answer one question about the layout.  Is there a wide enough gap for a wheelchair on either side of the end seats? If not, please just choose those over the middle.  \nMore theaters should just get assigned seats so we all know what to expect when we are purchasing.  I'm glad all the nice ones near me have it.  Maybe even the not as nice one.  Haven't been to that one since 2019.  \nI also don't really understand coming in after a movie has started so we agree there. And now I'm getting  flashbacks from times my dad has turned on a movie midway through on the TV.  Always drove me nuts unless it was one that I had already seen a bunch.", "If the seats were exclusive to handicapped they would be marked that way; they weren’t.  You’re assuming this theater is the same as yours and calling me an asshole.  More couples with strollers sit in the back row than people in wheelchairs.  There was perfect accommodation for the man in the wheelchair.  What there wasn’t accommodation for was her getting to sit by him.  As it was she sat 40 feet away and he was fine.  The theater setup the floor there this way, and I’m not violating any rules by sitting in those seats to avoid ruining the movie for someone else by blocking their view.", "There is room for a stroller or chair on each side of all 7 pairs of seats.  It is statistically incredibly unlikely that all 8 wheelchair spaces would be taken.  If I’m going to sit in the back then I will take the middle center, middle left, or middle right.  I’ll even shift one more pair further left or right, to cover 10 chairs and 6 wide spaces.  I’m not going to go to the extreme left or right and have a terrible view in the statistically incredibly remote chance that 5 wheelchair people will show up, each with two or more caregivers that absolutely must sit by them.  You’re giving an extreme example that frankly isn’t at all likely to occur, especially if people all get to the theater at the start of the movie.", "Then she should bloody turn up on time and plan accordingly.", "Okay. Reddit has spoken. No reason to imagine why other people’s lives might be challenging or give any quarter. There is only AH or NTA, nothing further to be discussed ever.\n\nAt no point did I say that the older couple were in the right, I suggested there might be reasons she was stressed and there may have been a compassionate alternative that slightly elevated the needs of people with disabilities.", "There are NAH and ESH for those.", "NTA.   \nNo one else in that theatre has a problem with YOU!", "You should have complained to the manager for the lady( I’m using this word loosely) disturbing your experience along with the employee harassment of attempting to make you move and demanded free ticket for the next show..You’re a very nice man but I would have got the last word in (cussed her out) I wouldn’t have been able to help myself.. nta", "NTA, but if the wheelchair spaces are really always so empty, maybe sit in a seat in front of one of them. The usher won't move you from that, and a any wheelchair user can choose another empty space that doesn't have a tall person in front.", "NTA. I never understood why my boyfriend (6’8”) likes sitting in the back so much, I never even thought it was because of his height! Suddenly everything makes so much more sense lol.", "i'm very surprised the theater let people buy tickets 35 minutes in the movie", "NTA for the post, but YTA for this comment. Disabled people aren't invalid. If he was bound to the wheelchair, police need to be called. Sounds like he was just using the wheelchair.\n\nEdit to add because apparently I was too subtle: \"Wheelchair user\" is the correct term, not \"wheelchair bound.\" If someone is literally bound to a wheelchair, that's a problem. https://newmobility.com/dont-say-wheelchair-bound/", "Perhaps a little less likely because they do give you more room, and there’s more “gaps” in the back row of course, but with the right person in those double seats, say this older lady, if I sat in front of her she’d be craning her neck and leaning to the side to see past me.  I wear a hat, so the first thing I do at the theater is remove my hat and move to the back row.  There’s another theater a bit further away I go to sometimes that has tiered seats right against the highest back wall that actually recline, and the handicapped / stroller seating is all reserved down front so none of this is an issue. In that theater any seat in the back two rows actually works great to not block anyone’s view.  Very well designed layout.", "Good question, and yes they have spaces on both sides of all the back pairs of double seats.  I talked to the theater manager and he said that they are getting software so you can pick your seat when you buy your ticket, which will be cool.  They’ll have a theater schematic to choose from on an iPad.  I have a favorite seat in mind, and ideally that won’t be an issue with so many other designated wheelchair / stroller spaces available.  I guess you’ll be able to do it online as well, but I always like to get a paper ticket because I keep the stubs.  I threw them out for years, only keeping some, which I regret.  I like going back through my pile and finding stubs for older films.  For instance I was there on opening day 46 years ago this month (in 10 days actually) at the Coronet in San Francisco for the Star Wars premier, which was a blast.  (There’s a pic of me waiting in line somewhere in the SF Chronicle archives, with hair down to my shoulders.  🤓. I ditched High School that day to go, and caught hell for it later, but it was totally worth it.  😉 ). Anyway, I agree with you on starting a movie late; I miss the first few minutes I don’t want to watch it!", "NTA.\n\nWhy do people act so entitled like her?", "NTA entitled much! Who does this lady think she is? Her poor husband I feel bad for him.", "nta also you could have given up your seat and sat infront of her to block her view", "NTA \nWhen you buy a ticket, isn’t it assigned to a certain seat like on a plane?", "NTA\n\n\"Excuse me, I need your seat.\" That was a rude way to ask for a favor. She ruined the movie for you, the kid that did move, probably her husband, and anyone unlucky enough to be sitting near the two of you.", "I sort of think everyone here needs a look in the mirror, starting with the cinema itself. In my part of the world, the seats are also set up like this except that row is blocked and cannot be booked unless in consultation with the cinema in person. What’s more every seat is allocated at purchase, so whether you get there first or last, you should sit in your purchased seat.  The fact that the cinema hasn’t arranged this in the same way has created this issue to start with. I agree that sitting in an area designated for wheelchair support isn’t cool - despite the protests that it’s not exclusively for them. It’s also BS that having apparently legitimately sat there the cinema would give you an option of a front row. And the woman demanding it after turning up late is hugely entitled, but it’s probably worked every other time. You guys need Gold Class.", "NTA - I too am more \"mature\" but have had entitled elderly try to push me round too. I'm starting to think it's a power flex. I have mobility issues due to severe arthritis but my hair isn't completely white yet. I was sitting at the front of a bus when a person with a wheeled shopping trolley gets on, asks me to shift over (i'd tucked my trolley in front of me and there were four other empty seats available at the front) but she sits next to me pushing her trolley into the space I'd shifted. I was fuming as there was EXACTLY the same space in the opposite space but she sat next to me just to make me move. I wish I could have seen her face when I got off as I was having a bad day & struggling even with a stick.\n\nSome old people (as you get in any other age group) are entitled dicks who just enjoy making people move at their wish, even if there is another space easily available they could go to.", "NTA. As for giving up one's seat for a lady, this was no lady!", "YTA\n\nIt’s the handicap row for a reason. \n\nSo a wheelchair can fit in between the sections of seats and those that are their companions have a place to sit. \n\nNeither your height, your age, nor your preferences are handicaps.", "Info - Were there any dedicated companion seats for wheelchair users in the  back row", "NTA - the real A H was the theatre employees for even letting them in 35 minutes late. And the woman of course", "The only person that deserved any special treatment here was the husband, which he did. NTA. She just tried to guilt you out of a nice seat.", "Were the seats in the back meant to accomodate wheelchairs?   If so, people with wheelchairs and one designated companion should take priority.", "Lol. And kind’ve true.", "Thanks, I think!   🤔😳😉", "Savage", "She called her husband an invalid. That's quite mean. The man seemed to have been a wheel chair user who was still independent enough to sit by himself for a while. She wasn't taking how he felt into account at all. I hope their kids visit often so his wife is not his only company.", "Honestly I’d complain to the cinema about the treatment. They were wrong not to intervene.", "You know, your comment is so obvious I don’t know why I didn’t think of it myself, great idea!  A wheelchair user would definitely not be able to see past me, but as you say there are 7 other spaces to choose from so they have options as long as there’s a companion seat.  I appreciate the out of the box thinking.  👍. At the same time, if this woman were involved I’d bet she’d put her husband behind me, sit next to him then demand I move down front out of his way!  🤔😳", "Yes, back rows become a habit, and another thing, many tall guys develop an unconscious stoop, poor posture that you’re always fighting, because you’re wary of banging your head on doorframes!  You mother always told you to stand up straight, but the whole top of my head is covered in dings.  The worst was stitches on my scalp from walking around an open camper shell and hitting the edge of the raised door most people could walk under.", "#Savage^Savage", "She literally thinks of him as an accessory so she get nice seats. That's horrific.", "Lol!  I know what you mean, prices are crazy there, but I always go to one of the first two shows of the day which are matinees and slightly cheaper, and I finally started asking for a senior discount.  I never did before, but finally figured what the hell and swallowed my pride and asked for it.  (They take one look at my gray hair and give it to me, no ID required which is irritating!  😉). I love the movies so go enough that it adds up, so I figure they can afford it.  Anyway, after that it works out to around ten bucks.", "Ammm, what do you think \"invalid\" means in this context?", "His posture is surprisingly pretty good. Door frames aren’t too much of an issue for him but he’s mentioned that he often doesn’t fit in showers because the shower head is too low. It’s so foreign to me because being 5’8” the world is my size and I’m not used to having to worry about fitting places. There are so many little things you guys have to worry about, like fitting in cars, clothes, beds, etc. I’ll definitely keep an eye on his posture, I don’t want him to have to deal with neck/back pain :(", "Yeah, she was the one that called her husband an invalid, as an excuse to get me to move, when you could practically see him shake his head.  He just wanted to watch the film and was glad to do it alone.  And my impression was that it was a well used chair and he was in it all the time.  Yes, he was using it, because it was his chair and he needed to be in it.  I don’t know why that matters or that the cops would have to be called because of it. (?)", "LOL! Yes shower heads, forgot about those.  On the plus side when I wash my hair the shower head is about 2 inches from my lathered hair so I get well blasted.  😉", "[This is wheelchair bound](https://images.squarespace-cdn.com/content/567d3b43841abaa3c9133973/1451068699345-YNUR6OGUZ5RASTIGXWXX/image-asset.jpeg?content-type=image%2Fjpeg). Please call the authorities if someone is bound to a wheelchair. Otherwise I think the term you're looking for that isn't a slur would be \"wheelchair user.\"", "Yeah, totally don’t get it.  I didn’t use a slur.  For the third or fourth time, SHE called him an invalid.  Can you tell me how that’s a slur?  I just put it down to her exaggerating to get someone to move.  The guy has to use a wheelchair to get around.  I’m sure his home has been adapted for its use, and that he has a vehicle that can accommodate the chair as well.  Whether he is “bound” to it or not is irrelevant, I’m not calling the cops because the guy needs to use one.  Even if I could, which I can’t because I don’t know him from Adam.  I think his chair is loaded in the back, he climbs into his seat, and when he gets home he climbs out of the wheelchair and into an armchair, then a bath, then a bed.  I’m not privy to a strangers medical condition otherwise.\n\nIf you think a man permanently forced to use a wheelchair is a matter for the authorities, then I would strongly urge you to call them.  I’m certainly not going to do that for anyone I see using one, even if I happen to know them.  That’s weird frankly…", "So you decided to argue about a hypothetical situation rather than the situation at hand in which people did decide halfway trough to movie that people coming in time had to move for them. Right…", "It's not a slur, it's just outdated terminology which does not reflect the actual experiences and preferences of wheelchair users. What they're getting at is that wheelchair users aren't \"bound\" to their wheelchairs - it's a mobility device which they use most or some of the time.\n\nThe person giving you grief is motivated by the sense of moral superiority they get from telling you off for not being up to date with the euphemism treadmill. They don't want to be helpful; they want to be angry and condescending. I wouldn't pay them much attention, but I would take note of the fact that \"wheelchair user\" is better to say.", ">I didn’t use a slur.\n\n\"Wheelchair bound\" is a slur. Do you not understand the difference between using a tool and being tied up to that tool? Or why being restrained would be problematic?", "Ah, OK, got it!  Makes sense, and that was my impression as well.  There’s always someone who gets grim self-righteous satisfaction from publicly correcting someone on some minor near-ridiculous point of usage.  (Sorry, but an image of Derek Zoolander gasping “It’s Mer-MAN!” to Vince Vaughn and Jon Voight comes to mind, LOL!). But your point is well taken and noted, and I’ll make that change.  Appreciate the guidance, thank you.  👍", "If “wheelchair bound” is a slur, then I’d encourage you not to use it, just as I didn’t use it.  Do you not understand that?  Try reading the goddamned thread, then do us all a favor and piss off.  What a pedantic irritating nit!", ">Yes, and I guess that’s true if he’s **wheelchair bound**.  But he was able to move his chair and seemed on the ball otherwise.", "Which term I used in that context because someone used it first somewhere here, I’ve lost track.  I also wrote that in my opinion whether he was “bound” (in quotes) to it or not was irrelevant.  People today are so desperate to find offense for some reason, and lash out, probably because they have nothing else to hang onto.  Are you still here?  There’s a 9 year old kid with a magnifying glass whose been burning ants in West Texas, so on your way.", "NTA\n\nYour seat wasn’t labelled as a disabled seat. Caretakers do count for needing to sit near their person, but this wasn’t one of those situations. The man knew he was completely fine. \n\nWhen I first read your height I assumed you were blocking someone’s view. Your height would absolutely ruin someone else’s experience if you were right in front. \n\nSo to hear you were in the back row? Yeah no, you are considerate and you were there early enough to ensure you got the seat you needed to not inconvenience others. As a short person - thank you!", "NTA and it sounds like her husband didnt' want to sit next to her anyway", "NTA. She should have come earlier or gone to another showing. She was rude, pushy, and entitled. I would have asked if he enjoyed the peace and quiet. You’re a senior too, and clearly her husband didn’t need her, so the handicapped card doesn’t work either.", "ESH", "NTA\n\nBeing 5'2\", I'd be thrilled if you didn't sit in front of me.\n\nYour antagonist sounds like the sort of person we all hope we won't age into. You were provoked, and I hope you have it in you to feel sorry for the poor husband.", "NTA The husband even said he was fine. She just wanted her way since apparently he actually did not need looking after at all during the movie.", "NTA. i would’ve told her that you’ll be more than happy to watch over her husband for the rest of the movie. it sounds like he needed a break from her too😂", "NTA. This is why I stopped going to movie theaters…", "NTA, Christ I really feel for her husband. Relying on somebody for care already has its challenges, especially when they're an absolute asshole to people in public & drag you into it", "NTA. If she \"needed\" that seat, she should have arrived early. Besides, if you are that tall, no one enjoys you in front of him/her. Luckily, where I live, we don't have that problem. If you buy a theatre tickets, the seat / rows are numbered and there is never a dispute about moving.", "NTA she is entitled. She should have been showed the door. She ruined the film for everyone.\n\n\nIf it makes you feel any better if could have been worse you could have been the husband having to go home with the entitled rude woman.", "I don't quite understand how the space was configured. You were in one of a pair of seats, and there was a wheelchair space on either side of your pair of seats. But all the seats were full, and only the wheelchair spaces were left?", "NTA. As a fellow tall person (6'6, so not *quite* as tall), F-that. You prioritized your needs and not inconveniencing anyone else. These people waltz in 30 mins into the movie and expect everyone else to accommodate them? Sorry, even if I wasn't tall I'd tell them to get bent.", "NTA OP.  I have issues with mobility, and if someone demanded that I move to another seat, I wouldn’t be nearly as polite as you were.", "NTA.", "Some people are only 'senior citizens' because of their dates of birth. OP sounds like such a one. \n\nThe old lady, on the other hand, sounds like the other sort of one. The *'I am old so I can demand things of you! I am old so I can say what I like to people*.' That sort of one.\n\nOP's a good egg and I'm giving him a strong NTA.", "I wouldn't really blame tall people. They just wanna see the movie too. I would blame poor cinema design.", "Fair enough!  So, what could I have done to not suck?  Given up my seat and left the theater?  Because that was my only option.", "I wasn't talking only about cinemas. But I agree with you about poor management... I love theatres and there is only one in my city. There are 2 seats in each loft, from which you cannot see the stage because of the built-in columns. The tickets cost the same there as well, and naturally the columns are not even shown in the drawing of the auditorium on the website.", "I hope he rolls on her foot 😜", "BTSOM, it was his wife’s term, not mine.  But I understand it to be someone so sick they require constant care, and that didn’t apply to this man, so again I’d say she was exaggerating for dramatic affect.", ">No excuses for her behaviour, but maybe they could use a break.\n\nYou literally just excused her behavior by suggesting OP, who came in *early*, to inconvenience hinself by getting out of the theater altogether and coming back a later time. Why don't you tell that to the people who came in 35 minutes into the movie?", "It's not a slur, just inaccurate term.", "Term being incorrect doesn't make it a slur"]}