{"id": 17366, "submission_id": "13iwoqt", "title": "AITA for telling my my mom she's going to turn into a bitter, lonely old woman on Mother's Day?", "selftext": "My mom has me (16f). I'm her only child. But she has been a stepmom to my half siblings for 20 years now. My half siblings mom died and our dad met my mom 3 years after and they got married. My half siblings hate my mom. She always deluded herself into believing she is their mother and that they care about her. I remember her always trying to reach them and being rejected, sometimes harshly and sometimes they just ignored her. Both my half sister and half brother are married with babies now. Neither of them invited mom or me to their weddings. Dad got a solo invite and didn't go. My mom has never actually met their babies. She sent them each a package when their firsts were born and they were promptly sent back with the stuff destroyed.\n\nI asked mom not to make Mother's Day plans so I could plan something and she agreed. Mother's Day came and she was gone before I woke up. I couldn't get through to her on the phone. At like noon my dad said his son had called and she had shown up at my half siblings houses, trying to spend the day with them and trying to show that they still had a mother on Mother's Day. They kicked her out but stayed the whole day. I had spent money on a couple of mom's favorite places to make sure we could go and I lost that. I had both a bought and hand made gift that were left sitting there too. By the time it got to 4pm I tore the wrapping off the gift I bought, found the receipt and decided to return it yesterday after school. I got more and more mad and she finally got home at like 8pm and I asked her where she'd been and she told men she was showing her older kids and grandkids that she loved them and was there.\n\nI asked her how many times she had to be told she was not their mom or their kids' grandmother for her to get it. She told me I couldn't possibly understand at 16. I asked her about the stuff I had planned and she told me it was no big deal and I could give her the gifts. But that she needed to be there for her older babies and it was just a homemade dinner I had planned for her. I told her it wasn't, told her all about the stuff I had planned for her, and she told me to rebook and we'd try to get my siblings involved and make it a real celebration. I told her she had a child who loved and wanted to celebrate her and instead she went chasing after two grown adults who never wanted a thing to do with her. She told me she never planned to spend the day with me and was always going to seek out her other children. I tossed the gift I made into the fire in front of her and she told me I was being so childish and I had to share her rather than being a spoiled selfish \"little madam\". I told her she's going to end up bitter and lonely one day and I won't be there when it finally sinks in that my half siblings will never accept her. I told her I'm not going to be anyone's consolation prize.\n\nMom yelled at me for the disrespect and she and dad told me I was out of line yesterday.\n\nAITA?", "created_utc": 1684217078, "permalink": "/r/AmItheAsshole/comments/13iwoqt/aita_for_telling_my_my_mom_shes_going_to_turn/", "score": 687, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I told my mom she'll turn into a bitter, lonely old woman and I said this on Mother's Day when I was angry and had destroyed one of her gifts and decided to return the other. The whole thing was done while I was so angry and when I said it I meant it and still kind of do. Including the bit where I won't be her consolation prize. But it might be overly mean and assholish of me because I went pretty extreme in my reaction and maybe it wasn't warranted. My parents are pretty pissed about it anyway.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. I feel for your mom but she's completely missed the point, she has a daughter that loves her and she rejected your gifts before you even gave them. And she doesn't see the irony of getting mad your half-siblings ignored her, when she ignored you all day? No. Get your education, get a job, and move the fuck away from her - you're right, she will realise one day that she pushed you away herself.", "NTA - ooooofff this is a tough one.\n\nPeople want what they cannot have.  Your mom seeks their love because she cannot have it.  Your love is in her back pocket.  \n\nYou need to get yourself and your mom into therapy as soon as you can.  Your mom already has issues and she is causing you issues.  \n\nMy heart goes out to you", "nta\n\nmake sure you get into therapy once you turn 18 and cut contact with her.", "NTA you told her not to make plans or do anything. She is absolutely deluded, and is going to lose everyone with her ridiculous behaviour, including you. She threw you to the curb like you were a second thought, all to chase people that want nothing to do with her. Emotionally, I’d cut your losses now, because she’s not going to change.", "NTA\n\n> She told me I couldn't possibly understand at 16.\n\nI am 60. You understand perfectly. She is the one who doesn't get it. This sub is *swamped* with kids (and adult kids) who have suffered from step parents trying to enforce family intimacy.", "NTA. I’m so sorry, your mom can’t see what she has right in front of her.  You were great and I’m glad you stood up for yourself so she knows that is not acceptable to put you in second place. She made a commitment to you and then for some strange reason decided to go off the rails.  That’s unacceptable. \n\nI’m not sure how you were out of line, yes, you threw her gift I’m the fire, but you hadn’t given it to her yet so it was still yours to do with what you wanted. Yes, you could have not confronted her, but that would have only built up resentment. Now she knows how you feel and she can either change or not.", "NTA. I’m so sorry, your mom can’t see what she has right in front of her.  You were great and I’m glad you stood up for yourself so she knows that is not acceptable to put you in second place. She made a commitment to you and then for some strange reason decided to go off the rails.  That’s unacceptable. \n\nI’m not sure how you were out of line, yes, you threw her gift I’m the fire, but you hadn’t given it to her yet so it was still yours to do with what you wanted. Yes, you could have not confronted her, but that would have only built up resentment. Now she knows how you feel and she can either change or not.", "NTA X1000\n\nYour mom is delusional. But you are very mature for your age. You are a very level-headed girl.\n\nWork hard and get away when you can. Build a life for yourself, and seek therapy if you have to. My guess is when you move out your mom will try to pull the same BS that she is doing now- so it is best to cut contact with someone who clearly doesn't want to get better.", "NTA Your mom is the one out of line. Focus on moving out as soon as you can and getting therapy. I'm sorry you have a shitty mom.", "Your mother is not going to change… but you can. Dont do anything that is going to make you mad.. if your mother cannot feel sad by the siblings rejection , you shouldn’t either…", "NTA. I am sorry your mom shows you so little regard and attention. You put in a lot of effort for someone who puts no effort for you.\n\nI know at this point you are dependent on your folks and mother and have to remain under their roof.  When you are a bit older, you can move out and put some distance between you and your Mother.  Perhaps then she will start realising what she was missing all along.", "I actually normally feel a bit bad for the stepmothers who have been rejected by their stepchildren for no reason other than they're not the real parent, but to reject your own daughter to chase stepchildren who aren't interested is thoroughly bizarre. I genuinely can't comprehend your mother's behaviour. NTA.", "NTA being rejected by your own mother for kids that have never wanted anything to do with her is maddening. And nobody would blame you if you went no contact.", "NTA. You went out of your way to plan something nice and get her a nice gift.  \nI think  your mother might have had dreams when she married your father  concerning your elder half siblings and has a hard time letting it go.\n\nStill, she went too far . She has a child at home who loves her and she can't see that love as she's hellbent on getting accepted as a mother of people who want nothing to do with her, maybe because of her behaviour.\n\nYour feelings are valid and you are, as you say, not a consolation prize. It worries me though that your mother can't see that the hurt your half siblings put her through with them ignoring her, she inflicts onto you by doing the same. She's being discarded by them and she passes it down.\n\n  \nShe needs therapy as well as you  with her and  your dad together.\n\n@ mom of OP in case she reads this.  \n I hurt for you. I'm sure that what you want is for them to feel your love. You want acknowledgement, you want/need love. That is valid, that's good.  \nThe way you have handled it may have been out of line in regards to respecting boundaries. I wasn't there.   \nYou showing up at their house last time when you were told not to do so, shows you don't have regards  or respect for those boundaries. Love is not forced. Sometimes loves need to grow and showing respect for boundaries is a part of that.", "wow, your mom really knows how to make sure she has NO ONE to help her when she's old huh.\n\nBOTH of your parents suck. Your dad for siding with your mom over his other kids, and for him siding with your mom over you. He's a wuss and she's an asshole\n\nGet a job and start saving everything you can so you can run like hell at 18.\n\nNTA and i hope you show this to your mom. Let her destroy her own life running after something she can never have. Let your dad go with her, because he obviously doesn't give 2 shits about any of his kids.", "NTA as you said your mother is delusional which I can clearly see and entitled. The irony she’s trying to chase after two grown adults who want nothing to do with her while driving away someone who actually loves them despite their huge flaws. \n\nIf she’s like this towards you there’s clear reasons why your step siblings cut her off same I can see with your father. Let her figure out her flaws if she even can. It’s best you consider doing similar when you eventually move out.", "NTA.\n\nIn trying to force herself into a relationship where she's clearly not wanted, she's basically destroyed the relationship she had with you. I'm sorry you have to deal with this, but I think you're right.", "NTA, she obviously needs help. You don't deserve to be a consolation prize to your own mother. You weren't out of line. Your Mom needs to stop deluding herself and your dad needs to grow a spine.\nI would stop doing things for her.", "[removed]", "This one is difficult to rate, I'm going with ESH. You're 100% NTA for getting angry at her, but YTA big time for saying something so hurtful to a woman who's suffered constant sh!t behavior and bullying from her husband's children for longer than you've been alive.\nThere are details about your mother's relationship with you and your step siblings that we're not privy to (what's dad's role in the way his children treat you mom, for example?), but I think you, mom, and dad need to have a serious talk together, with no adolescent burning shit and yelling.\nEdited a typo.\n\nEdit: I know the consensus seems to be \"off with her head\", but I think some situations are more complex than that. You may downvote me to hell and back, but as much as I can relate to a turbulent relationship with a relatively toxic mother (boy, do I know), I also believe that everyone is hurting here and talking things (in and out of therapy) usually helps people in OP's situation more than hurting each other more and more.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy mom has me (16f). I'm her only child. But she has been a stepmom to my half siblings for 20 years now. My half siblings mom died and our dad met my mom 3 years after and they got married. My half siblings hate my mom. She always deluded herself into believing she is their mother and that they care about her. I remember her always trying to reach them and being rejected, sometimes harshly and sometimes they just ignored her. Both my half sister and half brother are married with babies now. Neither of them invited mom or me to their weddings. Dad got a solo invite and didn't go. My mom has never actually met their babies. She sent them each a package when their firsts were born and they were promptly sent back with the stuff destroyed.\n\nI asked mom not to make Mother's Day plans so I could plan something and she agreed. Mother's Day came and she was gone before I woke up. I couldn't get through to her on the phone. At like noon my dad said his son had called and she had shown up at my half siblings houses, trying to spend the day with them and trying to show that they still had a mother on Mother's Day. They kicked her out but stayed the whole day. I had spent money on a couple of mom's favorite places to make sure we could go and I lost that. I had both a bought and hand made gift that were left sitting there too. By the time it got to 4pm I tore the wrapping off the gift I bought, found the receipt and decided to return it yesterday after school. I got more and more mad and she finally got home at like 8pm and I asked her where she'd been and she told men she was showing her older kids and grandkids that she loved them and was there.\n\nI asked her how many times she had to be told she was not their mom or their kids' grandmother for her to get it. She told me I couldn't possibly understand at 16. I asked her about the stuff I had planned and she told me it was no big deal and I could give her the gifts. But that she needed to be there for her older babies and it was just a homemade dinner I had planned for her. I told her it wasn't, told her all about the stuff I had planned for her, and she told me to rebook and we'd try to get my siblings involved and make it a real celebration. I told her she had a child who loved and wanted to celebrate her and instead she went chasing after two grown adults who never wanted a thing to do with her. She told me she never planned to spend the day with me and was always going to seek out her other children. I tossed the gift I made into the fire in front of her and she told me I was being so childish and I had to share her rather than being a spoiled selfish \"little madam\". I told her she's going to end up bitter and lonely one day and I won't be there when it finally sinks in that my half siblings will never accept her. I told her I'm not going to be anyone's consolation prize.\n\nMom yelled at me for the disrespect and she and dad told me I was out of line yesterday.\n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA!!!!", "Your mom has a compulsion to be liked.  That's why she chases them, and tosses you aside.  She knows you love her, and she needs them to.   Does your mom have anything else going on mentally?  No disrespect meant, but usually there is other stuff that goes along with kind of compulsion.", "nta but sadly you are doing exactly what your mother is doing your seeking love and approval from someone who doesnt want to give it to you ... take your own advice and and focus your time and energy on the people who do love you", "She did. That's the thing. It's not like she's a childless woman without my half siblings. She has me and I have loved her for 16 years and I have tried to be a good daughter to her. But it was never me she wanted.", "I can get therapy in a couple of years but I am not putting more energy into making my mom feel better when I'm not good enough for it. She really showed me that she doesn't give a crap about being my mom or the fact I love her. All she wants is the two kids she cannot have.", "I suspect Mother Dearest is going to discover her back pocket has a hole.", "Yep grass is greener mentality", "Downside of that viewpoint is that she is taking daughter for granted and her love isn't guaranteed. My parents always chased after my sister because she was dramatic and they were scared they'd lose her so got pushed to back burner a lot. All that came to me as that I was taken for granted and she was the valued one. Realistically I was also the one more likely to walk away because all they teach you is to be emotionally distanced and independent of them. If they don't value your love, they dont value you so why keep investing to get hurt? \n\nMother seems both greedy and selfish in this case. She wants what she wants regardless of whatever anyone else wants. And the burden of \"sorting\" her isn't on OP- OP is a minor, she's not responsible for mending adults. But therapy for herself and maybe with her Dad, though he is a AH too for not seeing her pain, so she knows she is loved and valued by at least one parent.", "Really? That’s your take? Nothing about the unhinged mother ditching her actual kid to chase and harass people that want nothing to do with her? You’re a new account as well, so trolls gonna troll I guess.", "It happened. It was one gift. Something I made. The other thing I returned yesterday because I had spent money on it.", "My dad used to tell them they were being rude to their mom (meaning my mom) and would tell them they were wrong for rejecting her when she was trying to be a good second mom to them. They always said they only had one mom and that my mom could go fuck herself.", "This.", "It seems she just entitled and deluded to act like something she’s clearly not. If they cut her off I highly doubt she ever was a mother or rather a good person to them growing up. And overstepping boundaries trying to see kids that she never met are signs of that. My suggestion move out when you can and limit contact.", "I understand your position.  I wish she did also.  \n\nI know there may be more to the relationship, but try to leave the door open.  \n\nI had a lot of issues with my father, he and I left the door open.  Luckily his final years we had a great relationship and he also had a relationship with my children.  \n\nDon't be fooled it wasn't easy.  I did have to put him in place a few times.  Had to remind him he cannot mistreat me as if I still lived at home.  \n\nAgain, I wish you well.", "Let me tell you again that I 100% understand why you were hurt and angry, and I really get it and can relate even. Your question was, however, specific about whether you should have said those words to her, and I still think that you shouldn't have.", "You're NTA, was throwing the gift in the fire harsh? Sure. And frankly what you said *was* hurtful. But you're completely justified in feeling like you're being abandoned because, you are. \n\nYour mum is an ass for neglecting you and trying to force a motherly relationship ship with people who don't want another mum, and your dad is an ass for enabling her and also trying to force it. Also for not attending his own children's weddings.", "She has a type of OCD. She is disparate to be your steps' mother. So desperate in fact, she is insufferable. I can see how they would reject her as she doesn't take no for an answer. Unfortunately, she has tunnel vision and she wouldn't see it, because she has a bigger problem: her not being a mother to your step siblings. I think you start to understand why... I would take a hint from them and just dissociate. Your mom is delusional. Your step siblings would never allow her to have contact with their children and she isn't grandma. You are right about the delusion though. It is probably a real delusion, like a psychiatric illness. Does your mom do/believe other things that are odd? Does she always try to prove something that is not possible? Does she like to prove she is right? \n\n\"and she told me to rebook and we'd try to get my siblings involved and make it a real celebration. \" You have a clear message here...and you have to listen : a celebration with you isn't a real celebration. Don't be your mother and stop. Full stop. She isn't interested to the slightest and if in 20 years she hasn't decided that a dinner with you is real, it is not going to happen. Take a hint from her behaviour and don't follow her steps chasing her with presents and dinners she doesn't need or want. Get ready for college and move out. As you already have seen, your step siblings have a fabulous life without her and so will you.", "A fairly poor attempt at fiction.", "NTA. Your assessment is correct. Your mother is blatantly taking you for granted and instead of appreciating what she has, she had the worst Mother's Day possible.", "NTA\n\nYour mum has had 16 years to wisen uo, and she hasn't. Despite that, you've turned out well. Just focus on your schooling, and then its time to get out of there. You'll be able to make your own family with friends who do value your worth, and don't undermine it with their thoughtlessness. Wishing you well for your future", "NTA, I will never understand stepparents forcing themselves onto the kids, since the relationship always should be on the stepkids terms, your mon is incredibly selfish and ungrateful and if I was you I would also go no-contact after moving out bc she will always disregard you in favor of people that don't even like her", "NTA.\n\nYou only did what needed to be done with that gift in the fire. Sometimes, a dramatic gesture like that will be more effective than words.\n\nI agree with the others here. You seem like a good person. Don't let your mother drag you down with her into the swamp that is her fantasy world. Go live your life. \n\nAlso, your dad is a coward for not standing by you.", "NTA and be sure to tell both of your parents that the Aunties of reddit think they are horrible people. Your mother is delusional and clearly needs some real help. Your father has let this go on for 20 years and has the gall to say anything to you about disrespect when he allows your mom to disrespect ALL of his kids.\n\nWhat she did to you is unconscionable. Calling *you* selfish is quite the feat given that she is selfishly ignoring you to chase after people who don't want her around.\n\nHer continued efforts to force your half siblings to accept her is disrespectful of their boundaries.\n\nAnd your dad has just say back and let this all happen. I'm surprised the other kids still speak to him.\n\nI'm so sorry you have to live through this.", " NTA and I hope you’re able to get away from her one day.", "Your mother seems to be completely insane.\n\nI am very sorry. \n\nYou are not an asshole.\n\nNTA.\n\nYou need to get away from her. She needs help, serious help, because she is behaving like a crazy person.", "NTA and I'd be surprised if your half siblings don't seek restraining orders against her now. They've made their feelings very clear, the destroyed presents sent back is pretty extreme. I'm sorry she doesn't see that she is ruining her relationship with you over something that will never be. She really needs therapy.", "NTA your mom sounds like she needs therapy. Is she a people pleaser?", "NTA. Your mother is obsessed with the ‘children’ who rejected her to a degree that is likely some sort of clinical mental disorder, same as a stalker ex who just can’t accept that he or she has been dumped and ends up committing criminal acts. I’m sorta surprised your half siblings didn’t call the cops on her … they should have if only to start a paper trail for her deranged behavior.  I’m so sorry you don’t have a loving, appreciative mother, I’m sorry your mom is deranged, I’m sorry your father defends and enables her. I’m sorry you have to deal, at such a young age, with having a mentally ill mother. You deserve better and I wish you the strength to deal with how much worse her condition and behavior may get.", "NTA...", "NTA but your mother is a huge AH.  She is not a mother to anyone but you and she discarded you like yesterday’s trash while trying to make her husband’s kids accept her.  She is not their mother or a grandmother to their kids.  She is so blind that she does not see her own child.  She does not appreciate you or anything you did to make her Mother’s Day happy.  You deserve much much better", "She'll never realise.\nNarcissistic people can't. \nShe'll blame OP.", "It's always sad to hear but in all honesty just because their dad married someone else doesn't mean they have to see her as a parental figure/mom and I get that must be upsetting but that's what therapy is for", "You're jumping to a ton of conclusions here with \"bullying\". Stepkids not wanting a new wife to be Mom is clearly very common. There didn't have to be bullying involved. Just because mom is desperate for these people to be her family doesn't mean she is mistreated. In fact, their not wanting her around at all is an indicator that if anyone is doing something wrong here, it's mom.\n\nIn this case, yelling is appropriate. Sure, it's adolescent. Guess what? OP IS 16.\n\nJust because tossing things in the fire isn't the most skillful doesn't mean that OP is wrong for doing it given the provocation. Telling a teen to calm down and talk rationally about being emotionally abandoned is certainly a choice. Not a good one. Jesus.", ">she will realise one day\n\nShe won't. Don't wait for the realisation. It won't come. There is something going on with your mom. She completely ignored the cues that she was given...for 20 years. She is obsessed with getting \"mom\" status  and now \"grandma\" status...Think of this behavior as similar like a stalking behaviour...Don't be mad at her, there is definitely profoundly something bad happening with her brain. She obsessively \"loves\" the people that want nothing to do with her. It is very bizarre behaviour. Don't be sad, although it is profoundly devastating. Read about stalking behaviour and OCD ...you might find some comfort there and explanation. Next mother's day make plans with another trusted female relative to celebrate. I hate mothers day. It emphasises all the misery that came with my infertility journey and such...And being a mother now, I don't celebrate it. Too much hype.", "I’m so sorry. I hate to say this way, but at least you know now at 16 then when you’re 26 or 36. Your mother continues to dig her own grave because as of right now your older half siblings continue to reject her and she continues to neglect you. She’s delusional and she’ll never change. \n\nPlease do what you need to do for yourself and you can and will cut your parents off like your half siblings did. I hope one day they’ll reach out to you. Good luck with everything.\n\nNTA, obviously. You’re a child who wants her mother’s love and isn’t getting it.", "This is very true.   I cut off my Narcissistic mother.   OP you are NTA.   So sorry your mother behaves like this.    It's cruel.", "yeah and it's not your responsibility to get your mom to understand how wrong she is and it's on her that you guys won't have a good relationship bc you already tried for 16 years", "This isn't about you being a good enough daughter for your mom, kiddo. It's about your mom not being a good enough mother for you. She's after the high of the unattainable, and doesn't have anything left for you but scraps.\n\nI'm sorry, this sucks. But one thing my life has taught me is that you can find maternal love in a lot of different places. I hope you find yours soon.\n\n❤️, Internet Aunty Tremynci", "She probably tried too hard and turned them off by her clingy behaviour pretty soon after getting to know them. They as kids have probably little memory of their mom and a person that isn't there is usually easy to idealise. There were probably grandparents with grief and memories that kids had to make feel better, extremely pushy stepmom and you have a household pretty much where you are alone. Watch a movie from the 94 called \"Corrina, Corrina\"... There is a woman there played by Joan Cusack who tries too hard be become stepmother.", "Pay no attention to the commenter above, they are TA, you are not.", "Honestly I think it's a bad mindset, OP doesn't have to \"leave the door open\" for a person that constantly hurts her just because in 30 years she might have a change of heart and remember she has a daughter", "Nah, mom needed to hear those words.", "This right here", "NTA. “I told her she had a child who loved and wanted to to celebrate her and instead she went chasing after two grown adults who never wanted a thing to do with her.” \n\nThat’s exactly what happened OP, and I’m so so happy for you that you said that to her. Your mom let you down in a really upsetting way. Especially her admitting she never planned to spend time with you. You have every right to stick up for yourself, and for you to be so open about exactly how she’s hurting you is really good. \n\nYou have every right to be upset about this, for a long time even. You’re not suggesting you can’t “share her.” She blew you off in favor of two adults that historically don’t give a shit about her. That’s not something a mother should do. \n\nI lost my dad when I was 15. Any attempt by an adult man to be my “father figure” was swiftly met with a hateful stare by me. I don’t understand the mindset of people who think they can just *be* your parental figure because they’re an adult and the same gender as your parent. I’m 27 and I STILL have people trying to essentially replace my dad and fill a role I’m not asking anyone to fill. Your mother is being not only delusional, but incredibly disrespectful. The more she pushes, the more they’re going to push her away. With good reason, because there’s no reason for her to be part of their lives if they don’t want her there. I get that that is upsetting for her, but perhaps if she didn’t insist on letting them know they still have a mother things would be different. \n\nI’m really sorry OP, I hope that your mother comes down to earth and stops trying to be something she isn’t. She doesn’t seem like a very kind and understanding person, so please remember you have every right to be extremely upset with her. She absolutely let you down, in a big way, and seems to be okay with it. Her admitting she never was going to spend the day with you would be enough to make me question my relationship with her.", "NTA I'm sorry", "\nMaybe you should start treating her the way they treat her and she will start begging you for attention to", "You are so intelligent and well spoken. You are definitely NTA. Your mom needs therapy.", "NTA. Your mom and your half siblings are. It takes a lot of disrespect to destroy a gift rather than just donate it. Which is probably why mom wants to be with them. She’s neglecting the one person that wants to spend time with her, and she needs the wake up call. Even if it did not work.", "NTA you are not a consolation prize.", "OP I hurt for you. \nI hope you find peace and love and am so sorry you aren’t getting that now.", "welp 🤷🏾‍♀️", "NTA. op you’re not going to be a priority until there’s a baby on the way. cut her out, she’s not worth it", "Nope. Your mom desperately seeking approval of people who will never respected should be pitied tho. She probably needs therapy", "NTA \n\n>I'm not going to be anyone's consolation prize.\n\nThis is the best comment. You were not out of line. You deserve a better mum, unfortunately your mum is too busy trying to get people who aren’t interested to like her.\n\nforcing ”step” relationships never works.  Your half siblings have made it very clear they are not interested in their dads new family", "NTA. I've said this quote from Family Guy time and time again...\n\n\"Love is like a fart. If you have to force it, then it's probably crap.\"\n\nWhat your mother is doing is crappy. You can't force a relationship, a lesson that she keeps evading for 20 years. \n\nI don't blame you, OP. You deserve better", "NTA. Your mom is delusional. she need a mental health intervention, and it is very sad that she hasn't had this years ago. Please don't take her actions personally (easier said than done, right?) She is incapable of seeing the truth even when it is being told to her. I will say again, this is not on you. Do what you can to protect yourself from the hurt of a mentally ill parent. I'm not saying do what your steps did, because they are also a problem. But maybe lower your expectations a bit?", "NTA. I feel for you. That’s a terrible situation.\n\nYour mom needs therapy. Her behavior cannot be excused, but she’s probably baby crazy and acting on her desire to be a grandmother.", "When I started reading this post I was thinking, “Those stepkids are so mean! Why would they treat their stepmom like that when she just wants to love them?!” And then I read how she treats OP and was like, “Oh…*now* I get it.” Given how delusional she appears to be and how awfully she’s treated OP, it wouldn’t surprise me at all if her “love” for her stepkids has taken some incredibly creepy forms and/or come with some mighty big strings attached.\n\nAll this is to say, OP, that you’re the NTA. And your life will improve immensely once you can just leave all of these AHs in your rearview mirror for good.", "INFO: are you in contact with your half siblings?", "Holy shit, hon, this is so sad and I'm so sorry you don't have the mom you totally deserve. Heck the PARENTS you totally deserve. \n\nNTA.", "NTA. In two years you can go to college and never look back.", "NTA your mom is beyond delusional. Your older half siblings need a restraining order. \n\nAnd no you where not out of line you are no ones consolations prize. In 2 years I suggest going no contact.", "NTA  she has a child and she crushed you.  Walk away when you can and dont look back.", "She is a child and is not responsible for getting her mom into therapy. \n\nI hope she is able to get her own therapy and come to terms with who her mother is someday, because she deserves better.", "I know you meant well, but it is NOT the OP's responsibility to get her mother to go to therapy. Her mother is a grown adult.", "It sounds like this step mom is a stalker so I wonder if they rejected her for no reason or she was just creepy intrusive. One thing is for sure she can’t take no as a answer. If I was the half siblings the only thing for Mother’s Day she be getting is handcuffed and a restraining order.\n\n\nWho in their right mind shows up on a day and demands to spend the day with someone who doesn’t want them there? That’s just creepy as hell!", "That's a bizarre response on her part, sounds like you are part of [EDIT: an image of a life she tried to put together and failed], the husband's kids are part of a fantasy life which she won't accept did not come to pass.  \n\nI'm sorry she has emotionally abandoned you and NTA for either your reaction or your feelings.", "Unfortunately some people like your mother are so focused/obsessed on what they don't have and what they want that they lose perspective. Your mother has had 20 years to develop a relationship with her step children and it hasn't happened. Sadly she has pushed you away and hurt you. I agree that you should not be anyone's consolation prize. NTA", "Good to know.", "My heart is absolutely breaking for you. I know I’m a stranger but I want to just hug you. THIS IS NOT YOUR FAULT. She is ungrateful and awful. You sound like an awesome kid that any mom should be proud to have. You deserve better.", "NTA  I'm sorry you have had to grow up this way. I completely understand that after 16 years of her continuously showing you that you aren't \"enough\" you are just done and this was the last straw. I don't feel as though you told her that to hurt her or to be mean it comes off to me as more of a warning from you that if she continues with her behaviors that she is going to lose you, and consequently any children you may have in the future when you're old enough to leave and \"cut ties\" with her. \n\nI can't imagine the pain you are in. You still being a child and being shown you aren't enough for her and never will be is extremely harmful to you and your mental health that you really need the therapy now but I know that isn't always feasible because you are still a minor child. Is there at least anyone in your life that you could maybe talk to in confidence? Like a close female relative/friend or even maybe a school counselor. That would at the very least help you a bit until you can get into therapy.", "Returning a gift sent to your child torn to pieces is beyond not wanting her to be a mom, it sounds like actual bullying to me.  \nAdolescent is not an insult. OP is a teen and this is what teens do when their emotions overwhelm them, and I did say that I get it and that she has every right to be upset. But I don't understand why nobody thinks that this family needs to sit and have a serious conversation about their relationship. Why does it have to be \"get out of there and never talk to her again\"? We are shown a window into a larger conflict, the answer cannot be that simplistic.", "I... really don't think this is OCD. As someone who has it. OCD doesn't change how you interact with people (other than them thinking you're a bit weird for the repeated behaviours). I think you might have misunderstood something about it - my guess is you've heard about repeated behaviours and think it means things like big complex intentional things like trying to meet with people who don't want you there? - but with OCD that describes things like tapping fingers or idk turning door handles, small things where your brain has given irrational meaning to the movements themselves. Just my guess, sorry if I'm wrong about your thought process there. Either way, nothing the mum's done is relevant to OCD. Agree with everything else you've said though :).", "OP is the youngest, she's the kid mom had with stepchildren's dad.", "OCD isn't just for washing hands, it can be any repeated actions that are performed to relieve anxiety and stress. Hoarding is a type of OCD, stalking celebrities is often described a type of OCD. Always eating the same food is OCD...her mom basically stalking her step children and pretending that she is part of the family  is a type of OCD. OCD is a compulsive behaviour without any common sense that relieves extreme anxiety.", "Hey, there are different ways OCD is exhibited in different people. I get your reasoning, but there are people with OCD whose obsessive thoughts cause them to compulsively stalk or follow their \"obsession\". It isn't common, or at least it wasn't when I did my studies, but things change quickly in the field of psychology. Obviously not every person with OCD is a stalker! But there are ways stalking can manifest through obsessive-compulsive mechanisms. I hope this helps.", "Yeah you're right, will go back and edit... but even more bizarre, I guess maybe just a flag that the life didn't work out?  She thought she'd marry into a family and when the other kids rejected her, the little picture in her mind fell apart?  She sounds... unwell, in any event, and OP is not to blame for her abandonment.", "She sounds really unstable and self absorbed, we see a lot of posts like this but usually through the pov of the stepchild\n\nYou can see how little the dad cares about his children not only for letting this go on for 20 years but to allow his wife to constantly emotionally neglect their younger daughter", "NTA. Your mother (anyone other than me getting Coraline other mother vibes or is it just me?) is being beyond irrational, unreasonable and downright delusional. WTF is that woman’s damage? \nI’m so sorry she doesn’t appreciate the wonderful, thoughtful and caring person you are.", "NTA. It sounds like she's a baby crazy grandma. I'm sure she loves you, but you are young and haven't given her grand babies yet. Her stepkids have their own kids and I feel it's not about her wanting to be with her adult children. \n\nShe wants to be around those small grandchildren. She's just not connecting the dots that her step children don't view her as their mother. Therefore, to them, their children are not her grandchildren. I hope she realizes this soon.", "NTA -- protect your heart. I am sorry your mother fails to be a mom, you deserve better.", "Never treat someone like a priority when they only treat you like an option.", "Your mom is delusional, and one day she’ll see you warned her, but it will be too late. \n\nNTA", "NTA. I want to hug you and give you all the love you deserve. You’re very astute and self aware for 16, it will serve you well. Seek out older women who cherish and respect you and know that’s how a maternal bond should feel.", "On this one I declare you nta. Your mother is chasing after your siblings who clearly dont want anything to do with her. Her behavior is demented at best, staker like at worst. She clearly doesn't respect boundaries. You wanted to be with her, to show there is one child who clearly loves her. She rejected you and dismissed you because you don't fit her fairytale of the perfect family image. I hope you can get far away from her as adult and that you seek therapy when you can.", "NTA, you said what needed to be said.  You should try to convince your dad to get her some therapy because what she is doing is irrational and unhealthy.  And OP - I am so sorry, you poor thing!  If I was there I’d offer you a hug, because it sounds like your mother isn’t there for you.", "NTA", "NTA I'm so sorry you were treated that way. You deserve a mother who shows you respect and love.", "NTA I am so sorry that happened to you.", "NTA. Given how many people on this sub we have seen who justifiably go NC with their mom after similar treatment (favoritism, neglect, pushing themselves on unwilling children step- or half- or even bio), she needs the wake up call.", "NTA, and I'm really sorry you're having to deal with this. Your mother sounds unwell.", "You are a gem and so not the AH in this situation, but your mother certainly is and your father too for not standing up for you.\n\nFrom now on, invest in your mom the same energy that she is investing in you: zero.\n\nIt must be extremely difficult to be emotionally abandoned, especially at your age, at the end of the day, you are still a child, but believe me, it is her loss, not yours.\n\nSending you a virtual hug... She doesn't deserve you...", "You were spot on! NTA. Just live your life, get out when you turn 18 ( wether it is university or something else). Your mother will realize too late what she had.", "NTA, and I'm sorry your mom treated you so badly. \n\n>She sent them each a package when their firsts were born and they were promptly sent back with the stuff destroyed\n\nBut wtf lead this to happen? Cause that feels cartoonishly over the top.", "NTA. And I’m so sorry for how you were treated.", "NTA, you are completely right. And I’m sorry you’re dealing with this. But she has told you flat out and with her actions, that she doesn’t want you and will continue to stalk and pine for your half siblings love. Let her dig her own grave. You should focus on your life ahead of you. And forget the woman who has continually ignored you and told you to your face that she will pick them over you, even though they don’t want her either.", "I don’t feel for this mom at all. She’s a deluded monster", "I agree with you you on this. OP really shouldn’t keep getting their hopes up on this one because nothings ever going to change. OP is just going to continue to get rejected by their own mother and it will continue to suck. \n\nMost parents would be thrilled to have their 16 year old child put in half as much effort as OP did! And it just sucks that OP’s mom is acting like it’s nbd when really Op was being very thoughtful and appreciative.", "Her mother is a grown adult.", "How is this a tough one? OP’s mom has shown, and explicitly said, OP that she does not care about OP as much as her two stepchildren. OP has done nothing but state facts. She deserves a mother that loves her and values her. But he mom just isn’t capable of that.", "Yeah, the part where they destroyed the gifts she sent, then returned them to her speaks volumes. I wouldn't be surprised if after her latest \"Mother's Day\" stunt, they file restraining orders against her.", "> She has a type of OCD\n\nCan I see your psych degree?", "Maybe she should take a hint, and focus on her actual child rather than chasing two adults who don’t want a relationship with her", "No, they never wanted anything to do with me.", "My only guess is they might have thought she'd just send it back to them if returned completely fine. But I can't say for sure.", "I'm so sorry OP. It's so unfair. I hope you can move out soon 💜", "Your mom is trying to win an old game. Your dad is too. He doesn't care whether his other kids love his new wife he just sees them as his property that should obey him.\n\nShe wants to believe that if she scores enough points with your half siblings that she'll win her prize.\n\nShe already knows that your love is guaranteed.  So she's not worried about losing it....yet\n\nWhen she's ready for grandbabies & to be seen as the mother of the bride then...she'll remember you.", "She's off her nut chasing the unattainable. This isn't on you, you could have been \"perfect\" and it still wouldn't be what she wanted. *That's not on you*\n\nYou can't set yourself on fire to keep her warm.", "NTA. And I’m so sorry for how you were treated.", "I understand your viewpoint.\n\nIf she and a therapist can show that the step children don't want her there may be a scrap of a chance for Mom to correct herself.  \n\nThe damage to OP is already done.  You cannot forget the scars that are already left.  Expectations going forward will probably be very low from OP's perspective.", "Easy to say when you are not the person who is affected.  \n\nOP is clearly trying to have a relationship with her mom.   To advise her otherwise is irresponsible.  \n\nIf she takes my advice and fails she knows she tried.  If she takes your advice then she did nothing to correct her mom.  She just 'lived' with it.  Whether there is solo therapy involved or not she is just 'living' with it.\n\n______\n\nThis is coming from watching my spouse and her narcissistic mother's relationship.  Her mom would never admit fault, same as OP.  Put one child on the pedestal while kicking the emotional legs out from beneath the other.  \n\nIf my spouse dragged her mom into therapy she would at least know she put forth the effort.  \n\nInstead she cries on her 47 year old death bed about her and their relationship.  BTW the mother made my wife's stage 4 cancer about herself.  \n\nNot nipping this in the bud will lead to this.", "Her mother won't even acknowledge this is a problem, she is oblivious to the damage.  If OP wants to try to have a relationship, OP will have to put in effort.  Mom is clearly blind to what she is doing here.  \n\nMom's an addict.  Addicted to love she cannot have.  Just as an addict does she isn't aware of the collateral damage.  Who knows the time this woman will hit rock bottom, deathbed.  Maybe?  \n\nJust as in a drug addict mom needs an intervention.", "Sorry, I can see how I miswrote that.  Tough as in hurts the heart to read.", "I agree that the mother won’t actually realise, but please don’t either blame this on OCD or tell a 16 year old girl not to be sad or angry.  If you meant “don’t take it personally because you’ve done nothing wrong” then ok.  This sounds to me more like narcissism on the mother’s behalf, but whatever is causing this behaviour, it’s no excuse for trampling all over unavailable people’s boundaries while neglecting a teenager.\n\nu/Sensitive_Visual9341 you have every right to feel sad, angry, confused; whatever you’re feeling is an appropriate reaction to having an abnormally shit parent.  What’s even worse is that your dad didn’t stick up for you either, and I’m so sorry for you.\n\nThere’s a great book by Dr Karyl McBride called “Will I ever be good enough” which might help.  As the adult daughter of a mother like this, the best advice I can give you is to stop trying to please your mother, especially with thoughtful gifts/outings etc. because you will be wasting your money, and opening yourself up to heartache.  She will undoubtedly find something to complain about and some way to hurt you.  If you can, get away and distance yourself as soon as possible.  Get therapy.  Feel your feelings, don’t stuff them down.  Life can and will get better than this.\n\nI’ve been estranged from my mother for years because she didn’t want a daughter, she wanted a scapegoat, a servant, a dustbin to pour all her self hatred into, and a doll who would look pretty and reflect well on her.  She obsessed over things and other people too, and frankly she is exhausting.  No matter what I did, I was never ever good enough.\n\nLet your mother chase after other people who don’t want her.  You are her child, not her parent.  You are not responsible for her emotions or her mental health.  Do you have friends with supportive parents, or a kind relative/counsellor/teacher you can speak to in confidence?\n\nNTA, and you were right.  She will end up alone.", "You were great and I’m glad you stood up for yourself so she knows that is not acceptable to put you in second place.", "You’re a child who wants her mother’s love and isn’t getting it.", "Again, that's not OP's responsibility. She's a minor, first of all, but also life just doesn't work like that. The person who has the problem has to accept responsibility and do their own work. No one can do it for them.", "Given that these gifts came after years and years of being told that they do not want her in their lives, sending things back torn up is honestly to be expected. You can't just return them, you need to re-send the message. Mom needed to have stopped way before then.\n\nAnd the reason no one thinks the family needs to talk about the relationship is that the mom here is very clearly having mental health issues, and that's not something the stepkids need to be involved in dealing with. Mom needs professional help, OP needs separate therapy to deal with how she's been emotionally abandoned, dad needs to learn from OP's therapist how he can support her better.", "This is why advised joint therapy.  Never mentioned leaving the door open for 30 years.", "Using your logic you would be against drug and alcohol interventions.\n\nThe mom will never accept any responsibility without input of others.  It's going to take a lot for her to see what she is doing.  \n\nYou're essentially just walling off the OP without seeking professional help for the two of them. \n\nWay to not even try.", "My sister has OCD. She used to do this. Luckily, she got that under control. She still has the drive to do it and obsess about people but she recognizes why it is inappropriate and intrusive. She can't control the thoughts. But she can control her actions", "So the thing with OCD repeated actions isn't that they relieve anxiety, it's that your brain fools you into thinking that if you don't do the action (the technical term is 'ritual' so I'm gonna use that from now on) then a bad thing will happen. The action is part of that anxiety cycle. So I feel tap on certain surfaces a certain number of times in a certain way *specifically because* there's this insistent thought that people I love will be endangered if I don't. I don't want to make universal statements about people's mental health, but to the best of my knowledge this is the most common fear that your brain tries to make sense of OCD with - most if not all OCD rituals are done because the sufferer is scared that people will be hurt if they don't do the thing. Doing rituals is not a calming thing. My tapping ritual is so stressful I get dizzy doing it, and more and more scared as I do it. Sometimes in my desperation to do it I cause myself physical pain, but I do it because my brain (I know, irrationally) is convinced that it's the only way to keep people safe. People with OCD are less likely than average to harm other people, because it's a disorder that partly generates out of wanting other people to be safe.\n\nThis is turning into a long and complicated comment, sorry, but people actually understanding what OCD means is important to me. So another aspect of OCD is that it's a troll of a disorder because that perception of danger *isn't* a true delusion. You're aware the whole time that what you're doing is irrational. I know my tapping cannot have any link to people's safety. I don't want to do it. I hate being trapped by this disorder. And in a way that's very hard to describe to people not going through it, I still do it in the moment because there's an urgent sense of 'oh god quick do it anyway'. It's that 'lifting tree trunks off of cars' sort of urgent response to help whilst you are totally aware there are no tree trunks. I have really pretty bad OCD, and even with me if I can find some space to think about it, I will be able to stop myself - and/or that moment of fear/urgency exhausts itself in a matter of minutes and I'm left in a massive state but not doing the ritual anymore. It's true that doing the OCD ritual will mean I feel a little more like I've kept people safe, and that's how those brain patterns get reinforced, but that's both a really short-term cycle and doesn't leave me feeling un-anxious, it just temporarily resolves that false narrative. My point is that I don't see any way that such a multifaceted, premeditated and lengthy process as stalking could possibly be an OCD ritual; OCD rituals are in many ways just the visible trappings of a particular fear spike/cycle, something like stalking isn't the sort of the urgent, panic-spike-and-immediate-response, magical thinking action that OCD rituals axiomatically are. \n\nIt's a really scary, debilitating disorder to live with at its worst, and the focus of it is all inward - as far as I understand the neuroscience it's like your brain has developed an addiction to fear, and keeps cycling this loop of panic - which is why it's really important to me that people understand. People with OCD are not dangerous and they are not a fitting target for the butt of jokes (I know that's not what you were doing, just a side note levelled at all of the 'omg I'm so OCD' nonsense when people like neat desks).\n\nFinal little bit of explanation, because I suspect you're not actually that interested in all this? but it feels important to write anyway. So the washing hands stereotype is that's because a fear of 'contagion' is specifically really common in people with OCD. I'm pretty sure this is an extension of what happens in that gap between knowing something is irrational and doing it anyway: your brain tries to construct any chain of reasoning to explain why you should do the thing anyway. So as a little sci fi geek growing up, my brain offered up 'if you don't go round in this little circle again and again \\[my most common ritual at the time\\] then you won't end up in the right alternative universe and you'll get stuck specifically in an AU where your friends get hurt'. Like I said, I didn't believe that, I was aware of reality, but that was the stupid narrative my brain tried to justify why I felt like I had to do the thing. It's not my thing, but I can totally see the idea of harmful germs serving the same purpose linked to a ritual of washing hands. Hoarding is another mental health problem often comorbid with OCD because anxiety disorders rarely turn up alone. I could see that feeling like you have to eat a particular food might be a ritual, but I've never heard of it (doesn't mean it can't be) and I suspect probably the link is more likely to be that autistic people experience higher incidences of OCD and having safe foods *is* a common aspect of autism. People may often describe stalking celebrities as OCD, again I haven't seen it before now but I can believe they would, but that is stigma, it's wrong, it's not on the symptom list of OCD, it doesn't fit the profile or the emotional 'needs' of a ritual, and I suspect its basically lazy journalism where journalism is involved. Checking the NHS list of symptoms just now and my old psychology course textbooks just to make absolutely certain, it's not even on the list of comorbidities - although you are right that hoarding and eating disorders are. But again, these are different conditions that a person with OCD is often also at risk of having, not the same condition.\n\n**Honestly I think possibly the central tl;dr is that the anxiety/'relief' cycle that your describing is a waaaaaay more short-term situation than I think you're understanding it as. Like seconds to minutes, and one basic action that your brain has magically connected to preventing a scary outcome. And you know what you're doing is irrational, and - anecdotally - you're usually hyper-tuned in to whether what you're doing could be hurting people you love.**\n\nI agree that the mum here probably has some sort of mental health problem - she is definitely exhibiting stalking behaviour - but her underlying anxiety doesn't seem to be terror and sense of doom and danger so much as it's desperation to be loved or have a particular status. She's taking a variety of actions with a central aim - i.e. trying to get and keep in touch with them in a variety of ways - rather than repeating the same basic action again and again; and the action described here isn't a basic one, it's a lengthy, premeditated, composite process. And in many ways her behaviour is rationally connected to her desired outcome: talking to people to develop a relationship with them is a real process with a real cause and effect, the disordered part of her behaviour is that in this context it's socially completely inappropriate and threatening. OCD would be her to be touching a photo again and again to magically ward off fear of being unloved or something: OCD requires that magical thinking element. And like I said, people with OCD know what they're doing is irrational, and the mum seems not to. As far as I can see it just doesn't hit any of the hallmarks, other than there being anxiety the two are completely unrelated. \n\nJesus, long comment, sorry... gonna do something else with my day now. Hope the rest of your day is good despite this disagreement :)."]}