{"id": 17377, "submission_id": "13j2v3g", "title": "AITA for taking up 2 seats on a bus?", "selftext": "I ride the bus because I can't afford a car, insurance, gas, etc. I'm 19F and live in the US. For context. \n\nA couple days ago I was on a bus that wasn't that busy. Not empty, but there were multiple unused seats and no one had to stand. I had just gone shopping and had heavy bags that were hard to carry and hardly fit in front of my legs. \n\nSo I sat in one seat and placed my bags on the seat next to me, essentially taking up 2 seats on my own. Since it wasn't crowded when I got on I didn't see an issue and like I said the bags were super heavy and hurt to carry so I wanted to set them down. \n\nThe bus ride was kind of long and as it went on more and more people got on the bus. It eventually got pretty crowded to the point where some people had to stand up. \n\nI didn't ever move my bag or offer the seat to someone. In my experience most people don't want to sit next to strangers anyway and a lot of the time people will end up standing instead of sitting in an empty seat next to someone they don't know. Also no one said anything to me. \n\nAt the last stop (ended at the bus station where pretty much everyone was getting off) someone passive aggressively told me \"you could have moved your bag and not been inconsiderate and rude. Everyone wants to sit not just you.\" Or something along those lines. I didn't really respond because I didn't know what to say. \n\nThe person who said that never asked me to move my stuff, and if they did I probably would have. So I don't understand how I was being rude? They could have asked during the ride instead of insulting me after it was already done. Busses are also generally first come first serve so I think my behavior was normal. \n\nAITA?", "created_utc": 1684237589, "permalink": "/r/AmItheAsshole/comments/13j2v3g/aita_for_taking_up_2_seats_on_a_bus/", "score": 4989, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Because I took up two seats when other people needed them which is rude.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YTA. You saw the bus was full and didn't move your bags. That's exactly what rude assholes do.", "YTA. Once the bus started getting more crowded to the point where people were standing, you should have moved your bags. You shouldn't need to be asked to do so; it's just common courtesy.", "YTA.  You don't wait for someone to \"ASK\" you to do the right thing.", "YTA if there is no seat more yr fucking bag lol. how can u write it and think u arent?.........", "YTA. I would have asked you to move the bag- but not everyone is comfortable with that situation with a stranger. What if they asked you and you said no? It would create an awkward situation for them. Not everyone wants to risk an awkward situation with a stranger in a confined space like a bus. You shouldn't expect someone to have to ask you. If the bus is crowded, you don't take up more than one seat. Period. You weren't TA when the bus had multiple empty seats. But once more people get on you be mindful and put the bags on your lap or the floor. Or at the very least offer the seat to people standing next to you, then maybe keep your bag there if they say no.", "YTA. It's considerate to move your bags to your lap to give someone the option to sit down. I'm sure that if you were one of those people standing up on a crowded bus, you'd want to sit down and relax.", "YTA.  Once it gets crowded you move the bags of your own volition.  It's a courtesy and used to be normal bus riding etiquette.", "[removed]", "YTA once the bus started filling up you should move your stuff.  Just because nobody asked you to doesn’t mean it’s not the right thing to do.  I take the bus to work and I understand it’s more comfortable to have your bag next to you rather than on you but don’t try to justify it. Move your stuff.", "YTA. As soon as you saw people standing, you had to move your bags. You don't need anyone to say that to you.\n\n> In my experience most people don't want to sit next to strangers anyway\n\nThey take public transportation, it is bound to happen. You had to make the seat available not assume what people would want.", "YTA How can you be 19 and not understand that this is incredibly rude and selfish? You cannot use a seat for your stuff while people are standing. You should have cleared the seat without having to be asked.", "YTA and you know it.\n\nIt's fine to have your stuff on the seat when the bus is empty, but you can use basic courtesy when people are standing without a seat available. You're even worse for your comment that if they asked you \"probably would have\" moved your things. Probably? Get over yourself.", "YTA. They really shouldn’t have to ask you. If the bus was filling up and people are standing, you should’ve moved the bags.", "YTA- seats are for sitting not your bag.", "YTA. You should’ve moved your bags. Entitled folks like you make the world worse for the rest of us. Seats are for asses not your groceries. They could’ve easily gone ln the floor in front of you", "Your behavior is not normal, it is entitled, inconsiderate, and rude. Once you saw people having to stand you should have moved your bags.", "Yta. People will sit next to strangers without a problem if they don’t want to stand in a moving vehicle the whole time, don’t make excuses. Put yourself in their position. If someone was holding up two seats with their bags, and you were carrying bags of your own, don’t you think you’d like to sit where the bags are? You’d think they’d be competent enough to move their stuff when they see people having to stand because all the seats are taken. Do you have to be asked or told to wipe as well? 💀💀", "YTA — as soon as the bus started filling up you should’ve moved your bags to the floor.", "YTA. You know that if the bus is full and your bags are taking a seat that the right thing to do is to move them.", "YTA. You should have moved the bags. Duh. People shouldn’t have to ask you to move your stuff off of a seat on a crowded bus.", "YTA - The people who were standing got onto a bus that was so crowded there wasn’t anywhere to sit, and they saw some woman sitting on this crowded bus with her shopping bags next to her.\n\nSo they correctly assumed that you were being inconsiderate as hell and didn’t bother asking you to move them because, in their minds, you were more likely to start an argument than to move them. And even if you did move them, people aren’t super keen to interact with or sit next to observably rude people.\n\nYou created the perception that you were rude and inconsiderate and people reacted accordingly.", "Yta…when the train got more crowded you should have removed your bag from the seat.  No one needs to ask you.  The seats are for people not your heavy bags.  You should be more considerate of others.", "YTA. Once empty seats become rare you needed to put your bags elsewhere and make that seat available.", "YTA, and as a regular bus rider, you should know that. Bus etiquette says that it's fine to take up two seats so long as the bus isn't full, but the second people have to stand because your bags are keeping them from sitting, you are obligated to at least offer to clear the seat for them. That's the bare minimum expected, and if you're not aware of that, chances are high that you've been an AH before this, as well.", "YTA. You move the bags to the floor in front of you, you move them to your lap, or you put them on your seat and you stand up. But you don’t take up 2 seats. No one should have to ask you to do this. It’s called common courtesy.", "No one is going to ask you to move your stuff.  \nToo many nutters about with weaponry.", "YTA duh!", "YTA.  When the bus filled up, you should have moved your bags.  You should conduct yourself with basic courtesy without outside intervention.", "YTA - “first come first serve” yeah for humans not your bags. You could easily place bags in front of you on the floor, the heaviness had zero context here I don’t know why you repeated it so many times. People shouldn’t have to “ask” you for common decency on a PUBLIC bus. The entitlement is astonishing.", "YTA. You know it.", "YTA. How are you still making excuses? Your post is already full of them, and yet you’re still repeating that nonsense in the comments. You KNEW you were breaking the social rules, otherwise you wouldn’t have felt the need to state a new “reason” for your behavior every other sentence.\n\nRude behavior. Mean behavior. Treat others like they are real people, and learn from your mistakes instead of doubling down on being an asshole about it.", "YTA. Especially on longer trips like this one, you should expect a bus to get crowded and be prepared to take up only your seat. Just because a particular AH behavior may be widespread doesn't negate that it's AH behavior--it can simply mean your area has a high concentration of AHs.", "YTA. Courtesy", "YTA it’s common courtesy. Someone might not have sat down within 5 seconds of moving your bag, but eventually someone would’ve.\n\nYou say that people on a bus would rather stand than sit next to a stranger, so weird that everyone else on the bus sitting seemed to know each other?? That is really, truly rare /s", "YTA. Always move your stuff if you can to accomodate other people when the bus is getting full. I’d rather sit next to a stranger than stand. Stop making lame excuses.", "YTA. It's called \"initiative\".", "YTA. You know this and don’t need us to tell you. Pet peeve when people take up all the spare room in a shared space. It’s so self centered. Also to your argument that sometimes people are standing even when there are seats: Sometimes there aren’t seats when they got on, so they stood As the seats empty out, it might just still be easier for them to stand where they are. \n\nOne time on the bus this very rude and argumentative woman took up the seat next to her for her PURSE. Argued with anyone who asked her to move it. Finally one woman got on and when the lady started to argue, she just took her purse off the seat, put it on the owners lap and sat down. I don’t really agree about touching strangers items in general, but always thought that was a baller move.", "YTA. People had to stand so you could take up seats for your bags. You shouldn’t wait until someone asks you, you should have been considerate. Glad someone called you on it.", "YTA. I believe that - like you said - people often don’t sit in the empty seats. I see it all the time on trains and busses. Sometimes it’s hard to know what others will do, which is why it makes sense to just be courteous and give them the option to sit next to you. Next time, you should move the bags onto your lap and only take up one seat unless the bus is nearly empty.", "YTA. It’s one thing to take up the seat when the bus is empty and people have placed to sit. But the minute more people started getting on you should have moved your things. Your bags don’t need a seat, people do.", "YTA! You should have moved your bags as soon as the bus started filling up. Nobody should need to ask you to do that.\n\n\"In my experience most people don't want to sit next to strangers anyway and a lot of the time people will end up standing instead of sitting in an empty seat next to someone they don't know.\"\n\nThat is a very poor attempt at justifying your behavior. If that were true, almost half the seats on a bus always be empty.", "I catch buses and sometimes put my small bag on the seat but even if its nearing half full I move it just in case, its easy", "YTA", "YTA. Saying “well no one asked me to move them”  is like saying “well no one asked me not to play loud music at 3 am.” We live in a society, we make space and accommodate each other without being directly told.", "YTA You are rude selfish and entitled.  Learn manners.", "YTA \n\nOne person one seat \n\nPut your bags on your lap", "YTA. \n\nFor exactly the reason that person said. \n\nDid you really think that none of the people standing wanted a seat? That absolutely everyone standing on a crowded bus would rather stand than sit next to a stranger?", "When your seat is the last, YTA. When there are other seats next to other nice people, NTA.\n\nThose are the rules.", "YTA. When the bus started to fill up, you should have put the bags on the floor in front of you. It’s common sense.", "Ok maybe you should've moved your bags, but I think a lot of people commenting are blowing this out of proportion", "oh the main character syndrome, YTA and its because people like you riding bus gets a bad rep", "YTA SO MUCH YTA. I take the bus too.", "YTA. Literally people that do this are always huge assholes and I would’ve high-fived the person who called you out on your shitty behavior.", "NAH. I totally see your pov but i also understand the other person. Both is correct.", "I mean, YTA. It’s pretty standard where I come from you don’t put bags or feet on the seat. Even if you’re the only person on it. It’s rude.", "YTA. You should have automatically removed your bags. It’s basic manners. Don’t wait to be asked. Just do it to be considerate to others.", "YTA common courtesy is once the bus fills up you move your bags so others can sit.", "And people think it’s bad when guy manspreads.", "Big time YTA. I don’t know where you live but in NYC, everyone on that bus would have been glaring at you. This is completely basic etiquette. Now you know.", "What’s with all the negativity? OP is 19, likely she doesn’t know the proper bus etiquette y’all are squealing about.  Stop acting like everyone should know specific things like this and maybe start showing them.\n\nNTA if someone wanted to sit, they could’ve used their eyes and searched for an open seat.  They would’ve seen the bags on the seat next to OP and should have asked her to move them so they could sit.", "YTA but a gentle one.\n\n\nYes, it was rude not to move the bags. You should always try to move them when you see people getting on. It’s just courteous. Usually when a seat next to a stranger isn’t taken up, it’s because that stranger has a quality about them that’s “undesirable” to sit next to. I see this a lot with nerdy men, overweight people, bad smell, people on the phone, etc. \n\n\nThat said, depending on where you were seated/layout of the bus/where people were standing, putting the bags in the floor could have been dangerous for those standing.", "YTA", "YTA for not moving your bags when you noticed a need. \n\nI know you keep saying someone could have Asked you to move them, but the chances of confrontation might be too high for someone to try. Especially if you are on a bus route going through a more sketchy area. \n\nHeck, I can't safely stand on the bus, and still won't always ask for a disabled-friendly seat. ESPECIALLY if someone has RBF or is wearing headphones.", "YTA. It is common courtesy and common sense", "YTA, if people are standing up you should be aware enough to move your stuff.", "YTA. You noticed that the bus had gotten busier, that's when you should have moved your bag. It's not for you to decide that people prefer to stand than sit next to strangers.", "YTA. I do, however, agree that this is a somewhat unwinnable situation. If it is indeed as you said that there are often times when the bus is full but there are empty seats, then ideally there needs to be an agreed-upon etiquette change which shifts the burden to the standing passengers to inquire about a seat that's occupied by an object. But in the absence of such an unspoken rule, the non-asshole (even if suboptimal) thing to do is to keep the seat open.", "YTA and you should've learnt the proper public transport etiquette by now.\n\nseats are for sitting, not for putting your bags on them. it's okay to take up more than one seat when there are other empty seats available but you absolutely have to take your stuff away as soon as you see people standing due to the lack of seats.", "YTA. It's common courtesy to move your belongings once you recognise that the bus is busy. No one should have to ask you if they can sit on an empty seat on a packed bus.", "Simple\n\nYta\n\nWhen there is no one, that’s fine, once the seats are almost full you are supposed to move your bags away.", "Yes YTA but it’s so common people do that, I am always an outlier for moving my stuff away when it gets busy", "Yta when there are seat avaliable,  yes it's fine to put your bags there. When people start standing, move  your shit.", "YTA. And that person wasn’t being passive aggressive just because they said something you didn’t want to hear.", "YTA You haven't been paying much attention in the world if you assumed no one would want to sit in the only available remaining seat. No one should have had to explain it to you because it's obvious they would rather sit next to a stranger than not sit (this is a **bus** after all).\n\nYou just didn't want to move your bag.", "YTA - When the bus was filling up the correct and polite thing to do would be to move your bags.    It's really lame to say \"no one asked me\".    You're an adult and should behave like on and not a child that doesn't do something like brush their teeth unless expressly told.", "YTA- I do this too with my bag but only if the bus or train is empty and there are plenty of spaces. If it starts to get full I absolutely put my bag on my lap or on the floor in front of me. No one should have to confront you and ask you to move your bag in order to just take a seat on public transit. It’s common courtesy to make room for people when it gets full", "YTA people shouldn’t need to ask you. It’s a basic part of the social contract that a fellow human should be able to expect a seat over someone’s shopping. It’s called public transport because it’s shared by the public (no one calls it shopping bag transport, do they?) Once you realised the bud was filling you should’ve cleared the seat. Do better next time", "YTA. Next time you take up a second seat on the bus with your bag, look around and you will probably see a bunch of the people standing glaring at you.", "I’m fine with you using 2 seats on a somewhat empty bus. But as the bus was getting more crowded you should have shifted your bags to the floor. People shouldn’t have to ask you to move your things so they could have a seat. YTA", "YTA.\nWhere I live, public transit is normal.\n\nEven the GRANDMA’s & GRANDPA’S place their bag of groceries on the floor near their feet", "Yta. Even when people dont ask, when it gets very crowded, you put your bags away, and you let the sit vacant.", "YTA - You move your bags instinctively, you don't wait to be asked.", "If the bus was full, then people were definitely sitting next to a stranger. YTA for not moving your bag", "YTA\n\nIf you consider it insulting for someone to describe events that you, yourself did, then don’t do it. \nBy your logic, people can never be wrong unless it’s pointed out to them.", "YTA. The fact that you are asking if you should've moved your bag, means you could have. Just because nobody asked you doesn't mean you should have just sat there and waited. It's not the biggest a-hole move I've seen on a bus, by a massive margin, but there shouldn't be that much debate around whether to be courteous or not. You just move the bag first, or get up for a senior or someone with greater needs than oneself. It's easy stuff.", "YTA", "YTA\n\nWhat did you expect from the other people? A written request?\n\nIt is a matter of politeness to remove your bags from your seat as the bus fills up.\n\nBut politeness is not given to everyone.", "YTA & no lady \n\nI fancy myself a gentleman. Guess how many times I’ve been asked to offer my seat to a lady when they get on the bus/train and I’m sitting & there aren’t anymore seats? That’s right, 0.  Guess how many times I’ve volunteered my seat to a lady? Countless! \n\nI was once at an Orthodox Church & after an hour, I  offered my seat to a lady standing IN HEELS. I have bad feet, but I was wearing running shoes.", "YTA it’s an unspoken rule that you should move bags off of seats once the train or bus starts to fill up. You didn’t know, but you’re still the asshole.", "YTA and you should be embarrassed AF.", "You pay for one seat. It's common decency to move your bags so another person can sit down. They should stand just because your bags are heavy? They should pay the fare for no seat while you pay the same fare for two? YTA OP. \n\nEdit: typo", "YTA, you're essentially making your behaviour their problem. They now have to ask to sit down, instead of just moving into an empty seat. Anyone courteous enough would have moved their bags. Also don't assume that people don't want to sit next to others anyway, because that is simply not true. When public transport is crowded people will use all the seats. You don't get to choose whether somebody else would take advantage of the open seat or not, they do.", "YTA.  You are justifying your bad behavior.  Move the bags next time.  It's obviously rude!", "Hey OP do you often struggle with social rules where everyone seems to expect you to do something without asking and you don't understand why they didn't just ask?", "YTA. Unless you paid for an extra seat for your bags? Or you could have stood and let your bags have the seat. No one should have to ask you to move your crap so they can sit.", "YTA. I mean- alone that you wrote that if somebody asked, you have *probably* moved your bags, makes you TA.", "NTA - I don't understand why cities want people to use mass transit but then don't make it possible to function when doing so.\n\nYes, it's a seat. No, it's not reasonable to carry heavy groceries or whatever for 30 or 40 minutes getting to your destination.\n\nUnless there was someone in distress (disabled, pregnant, carrying a small child), keeping your shopping load on a seat is a better solution than even partially obstructing the aisle trying to keep it between your feet.\n\nThe city I'm in limits riders to two bags. That's utterly ridiculous unless you're going to take two hours out of every single day to go shopping (most routes run only hourly). Even on a crowded bus, I'd stand and put my groceries in my seat before I'd leave them in the aisle.", "Logically you're N T A - you're right that people could just ask you to move your stuff. But we live in a non-confrontational society - people don't want to have to ask. You should have moved your bags when it started to get busy, or at least start offering to. YTA", "YTA. It's called common courtesy. And, let me get this straight. You can't afford a car, gas, etc, but you can afford to go shopping to the point that your bags are heavy enough to be hard to carry? Where are your priorities???", "NTA - for context: in my country it is totally normal to ask, if they can have the seat. So from my perspective it would be fine.\n\nBut probably in your country it isn't fine at all? \n\nBut anyway, I can't understand why people can't use their mouth. Not so hard to ask.", "If there are seats free nta, when there aren't any left, time to shuffle that baggage, it's never for that long.", "YTA. Nobody should have to ask you to free the empty seat when the bus became crowded. That’s common sense for anyone who isn’t outrageously entitled.", "YTA. You didn't want to make a space for anyone and you made that very clear by keeping the bags there. If you had, someone would have sat down.", "YTA.  if people are standing and you’re using more than one seat, you should move your stuff so someone can sit down and strangers sit next to strangers on public transit all the time", "YTA\n\nI would have just sat on your bag", "YTA this is basic public-transport etiquette. Someone shouldn’t have to ask you because the bags should already be on your lap or the floor as soon as you see that the bus is filling up and people are standing because there aren’t seats. A stranger getting a little snippy with you over this is justified and par for the course. Take the L and do things differently next time.", "ESH.  You saw it was crowded and didn't think of others, but they could have just asked you to move it instead of being passive aggressive about it.  \nNext time, move the bag.", "Kids these days...", "Um... yes, I'm afraid. If you were a guy taking up two seats society would look down on you for man spreading. And yet when you use your bags to build a little fortress of solitude you're surprised that people get annoyed at you. Just be a little more considerate and stop #MaamSpreading.", "NTA. While it's a nice thing to offer a place to sit for people who are standing by moving your bags of your own accord, if someone doesn't want to stand up they could have asked you. Not sure what the etiquette is in the USA, but that's fairly standard in my country. Unless it's an elderly/disabled/pregnant person - then you ALWAYS offer a place to sit - even if that means you have to stand up.", "NTA. Don't ask don't get. I've asked people move their bags off of a seat before so I could sit on train and bus.", "NTA. In my country there's a saying: \nEven the mother of the mute child can't even understand what he's saying.\nIt means if you want something you should say it.\n\nAs long as you are willing to move your bags if somebody asks you are NTA.  Seeing a similar situation: when I take a bus I do it because I have to take a long road and if there is an empty seat I will take that. I usually read a book on busses and I don't think I am obligated to look up from my book at every bus stop to look for elderly people to whom I can give my seat. If anybody asks for it (elderly people, pregnant woman, a tired high schooler... anybody) I require them to ask for it. And to do it politely. If don't they can fuck off...\n\nYou are also not obligated to move your bags at every bus stop and wait if anybody wishes to sit down. If they want something they should ask for it.", "NTA. If someone wanted to sit, they can say it and you automatically take your stuff or if someone elder/pregnant/injured gets in you must also do the same. I do it all the time and nobody ever told me anything, either they ask either I offer it when I see a person in need, and most times they thank me.", "NTA, they should have asked, I always ask when the bus/train is full and people move their bags, it's not hard to ask.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI ride the bus because I can't afford a car, insurance, gas, etc. I'm 19F and live in the US. For context. \n\nA couple days ago I was on a bus that wasn't that busy. Not empty, but there were multiple unused seats and no one had to stand. I had just gone shopping and had heavy bags that were hard to carry and hardly fit in front of my legs. \n\nSo I sat in one seat and placed my bags on the seat next to me, essentially taking up 2 seats on my own. Since it wasn't crowded when I got on I didn't see an issue and like I said the bags were super heavy and hurt to carry so I wanted to set them down. \n\nThe bus ride was kind of long and as it went on more and more people got on the bus. It eventually got pretty crowded to the point where some people had to stand up. \n\nI didn't ever move my bag or offer the seat to someone. In my experience most people don't want to sit next to strangers anyway and a lot of the time people will end up standing instead of sitting in an empty seat next to someone they don't know. Also no one said anything to me. \n\nAt the last stop (ended at the bus station where pretty much everyone was getting off) someone passive aggressively told me \"you could have moved your bag and not been inconsiderate and rude. Everyone wants to sit not just you.\" Or something along those lines. I didn't really respond because I didn't know what to say. \n\nThe person who said that never asked me to move my stuff, and if they did I probably would have. So I don't understand how I was being rude? They could have asked during the ride instead of insulting me after it was already done. Busses are also generally first come first serve so I think my behavior was normal. \n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "100% YTA. It's common courtesy to move your shit as more people get on. You knew you were taking the bus, it's not everyone else's fault that your bags were heavy", "YTA-You don’t wait for someone to ask to sit near you on public transportation. You act courteously and don’t take up multiple seats in the first place.", "Oh you’re very much the AH. You should have moved your bags or at least attempted to do so. It’s public transportation so one is to observe common courtesy. I sit next to strangers all the time. Most people do.", "YTA you shouldn't wait for people to tell you. Had i been on that bus i wouldn't have been as nice as the person with the passive aggressive comment", "YTA, You are on PUBLIC transportation, they don't have to ask you anything, is just common sense, bus crowded = empty seats your not using, how come you wrote this and didn't realize that?, even me at 12 y/o knew that I have to be aware of my surroundings at the bus so everyone can have a seat if possible, you offer it, if they don't want it they declined, is not that difficult.\n\nEdit: typo", "YTA i ride the bus too and every so often the synthesized voice will remind riders to keep their bags on their lap so others can sit down. it’s an an unspoken bus rule", "YTA,it's basic good manners to move your bag.", "YTA. Next time, move your bags. Absolutely no excuse.", "YTA, when you see the bus is getting fuller, you move your bags. Don't wait to be asked", "YTA busses have places to put your bags, or put them on your lap. your behaviour is normal for assholes", "YTA someone never learned common curtesy. set the bags on your lap or do the best you can to put them in front of you. Keep the seat open and don’t be rude", "YTA - take this stranger's passive aggression and the people in this sub with more experience than you and use this as a lesson going forward. You're nineteen, you're a young adult, but still an *adult*, accept that you goofed and move on. Don't do it again. Be courteous. Don't make people ask when they're just as tired and stressed as you probably are - move your bags. Follow the golden rule - treat others as you would want to be treated.", "YTA. When the train gets busy move your bags. It’s common courtesy.", "YTA. You think you’re the only one tired?  Who worked and/or had to carry heavy shit that day? \n\nWhen I used to commute on public transit I’d put my stuff on the seat all the time until it became obvious the train was getting crowded. Then I just held my stuff.", "YTA. Rude, rude, rude.", "YTA- This can be a learning opportunity for you I guess. It’s rude to do that. It’s okay not recognize the situation at first as rude. Just don’t do it again when it’s busy.", "Yep YTA.  Nobody should have to tell you to move your stuff.  You're supposed to move it voluntarily as you see the other seats filling up.", "Likely everyone on the bus who had a seat was sitting next to someone they didn’t know so def not a thing. \n\nYou should have either moved your bags or left them in the seat and stood next to them. You’re only entitled to one seat.", "YTA.", "YTA. Since when do we have to wait to be asked to be decent?", "YTA\n\nGet some social awareness lessons. People matter more than bags, stop trying to justify yourself.", "YTA\n\nOnce people had to start standing, you should have moved your bag. Sitting next to strangers may be weird, but when there's only seats left next to strangers, it's necessary. Bags do not belong on chairs unless there are other seating options, otherwise, yes, rude and inconsiderate", "YTA. It’s common courtesy? You see people standing so you ask “would you like a seat?” While being in the process of moving your bag. Usually when you say that or do obviously move an item taking up another seat someone will either say “thankyou” or “no that’s ok! Thanks anyway.”You’ve noticed that people don’t like sitting next to strangers anyway isn’t really an excuse. People also don’t like telling some one what to do or asking if they can sit? Lots of people feel uncomfortable or get anxious.", "YTA\n\n> Since it wasn't crowded when I got on I didn't see an issue and like I said the bags were super heavy and hurt to carry so I wanted to set them down.\n\nSure it was fine to put the bag down initially. \n\n> The bus ride was kind of long and as it went on more and more people got on the bus. It eventually got pretty crowded to the point where some people had to stand up.\n\nYou pick the bag up and hold it once the bus gets fuller ***OBVIOUSLY***. \n\nNo one should ask you to move it.  You're an adult now.  You do things when you should without being prompted.\n\n> I didn't really respond because I didn't know what to say.\n\nBecause you ***know*** there's no defense.  You know it's wrong.\n\n> So I don't understand how I was being rude?\n\nYes you do.  Stop pretending.", "YTA\n\nYou were using a public good. There are some baseline behaviors expected of you. \n\nIt’s rude to shave on the bus. It’s ok in your home. Similarly, it’s rude to take up more space than you need on a busy bus.", "Obvious YTA.\n\nBus is a public transport, and a single person cannot claim two seats. It’s a basic protocol to move your belongings from the other seat if passengers are standing and there are no other seats.", ">In my experience most people don't want to sit next to strangers anyway and a lot of the time people will end up standing instead of sitting in an empty seat next to someone they don't know.\n\nSo now you have learnt that this thought-process is wrong and you need to update it.\n\nYou have now learnt from this incident that people do in fact want to SIT in  a bus rather than stand. \n\nYour behaviour was not normal - when it got crowded, you clear the seats.\n\nIt's okay to make a mistake because you didn't know better. But please don't defend it. Admit that you goofed up, and grow from it. \n\nAnd it's a bus, it's full of strangers. There is no choice but to sit next to a stranger. you're clearly in the wrong here. You sound afraid to admit that you were being selfish and thinking of yourself alone, but that is not how you behave in public. \n\nEVERYONE is telling you that you are wrong -- are you going to learn from it?\n\nYou asked for a judgment and you've gotten it. Now what? How will you use this information? Know better. Do Better. Be better.", "You have added so much irrelevant detail to this story to make yourself appear better… but you’re still an asshole because you think your heavy bags were entitled to a seat over a person paying for a ticket.", "YTA\n\nIf people are standing, move your damn bags.  You are an inconsiderate asshole and rude.", "I mean yeah, they’re right. What deserves the comfort of a seat more: an inanimate object, or a human being? YTA", "YTA \n\nPeople don’t want to invite conflict by asking you to move your shit. It rarely goes well.", "don't take up too seats no matter wat and ur no an  a. ur still half at fault for taking up two seats", "YTA - how is this even a question.", "Question\n\nDid you pay for the extra seat????\n\nLet me guess.... nope.\n\nYTA and rude af.", "Oh for heavens sake. It’s a matter of courtesy that you move your bags when you saw the bus was becoming full. How you had the utter nerve not to move them when you saw people were standing is totally beyond me. \n\nOf course YTA, it might behove you to have just a tad more consideration for other people in future.", "YTA - that you need this explaining is beyond belief", "Did you pay for two seats? If so, NTA. Otherwise a massive YTA from me for not moving your bags as soon as the bus started to fill up", "YTA  \nIt was fine to take up two seats when the bus was empty.  The moment it started to get crowded and some people ended up standing, you should've moved the bag.   \n\n\n>The person who said that never asked me to move my stuff, and if they did I probably would have.  \n\n\nThe key word there was \"probably\".  You PROBABLY would have if someone had asked you to?   \nNo one should HAVE to ask you to move your bag, it's a common courtesy.  We aren't animals, we live in a society.  Social contracts exist, if the bus is crowded you take ONE spot.", "YTA it was inconsiderate and rude. Edited to add that people shouldn’t HAVE to ask you to move your bag. I’d you have any consideration at all for other people, you offer the seat.", "Did your bags pay for a seat? I would have sat on your stuff lol", "A bit of YTA. You can move without being ask, you can already see that its already being crowded. And if you don’t want to sit next to stranger maybe pay that seat, so you can tell them that you paid for it.", "YTA  \n\n\nAs soon as the bus gets more crowded I remove the bag. Noone should have to ask.", "YTA. I never ask people to move their bags, move away from subway doors, or move along into the bus/subway car because, in my experience, the people who are this flagrantly rude will also often have a screw loose and will get upset/argue if you ask them to behave reasonably. \n\nAs soon as you noticed it had become standing room only, and you chose to leave your bag there, you were the asshole.", "YTA", "Is this serious? Of course you’re the asshole. JFC", "YTA .. you also knew that and didn't care.   If the bus was empty it isn't an issue.  Once people have to stand it is.  AND YOU KNOW THAT.  You just do not care about your fellow human beings.", "YTA - as soon as the last seat is taken, your stuff goes on the floor.  N T A for originally putting your stuff down, 10x YTA for not being self aware to move them when the bus filled up.", "YTA\n\nYou paid for one seat. Move your fcking bags", "Why did you even bother posting when you're just filling the comments with excuses, sorry,  \"explanations\" to try and justify why you think you weren't wrong in this situation? YTA and you know it, you chose to be ignorant and no \"oh people don't like sitting next to strangers\" crap will change that.", "You created a rationalization for why it was okay to put your bags on the seat in the first place. And the environment was consistent with that decision. Eventually the environment got more crowded and your rationalization disappeared, so you created a new one.\nThis one much less charitable towards your fellow riders. The fact that you are asking online means that you know It was wrong because you feel bad about it on some level. So yes, YTA", "YTA\n\n>I had just gone shopping and had heavy bags that were hard to carry and hardly fit in front of my legs.\n\nPoint 1 - if you _know_ you're using a bus, either don't do so much shopping you'll have trouble bringing it back without taking up loads of space, _or_ pack it so you can put some in the luggage racks etc. Using chairs is sheer laziness most of the time with few excuses. If it \"hardly fit in front of your legs\" that is a you problem.\n\n>The bus ride was kind of long and as it went on more and more people got on the bus. It eventually got pretty crowded to the point where some people had to stand up.\n\nI will pretend this wasn't an expected part of this narrative, alongside the equally expected next part.....\n\n>didn't ever move my bag or offer the seat to someone. In my experience most people don't want to sit next to strangers anyway and a lot of the time people will end up standing instead of sitting in an empty seat next to someone they don't know. Also no one said anything to me.\n\nAnd here we are.\n\nLook, your \"experience\" aside, this doesn't matter. It's an expected, nominal social norm that when on public transport, you _don't take up multiple seats_. Nobody _should_ need to speak to you and make this clear, much less most of them probably caring remotely if you're a stranger or not because you know what?\n\nShockingly, most people on buses _don't know each other_. We are _all_ strangers, so _yes_ someone will want to sit down 99% more than the 1% they care about you knowing who you sit next to.\n\n>At the last stop (ended at the bus station where pretty much everyone was getting off) someone passive aggressively told me \"you could have moved your bag and not been inconsiderate and rude. Everyone wants to sit not just you.\" Or something along those lines. I didn't really respond because I didn't know what to say.\n\nWhich is fair. They're right. You shouldn't need telling, should you? Just like you shouldn't need to tell someone to stop playing loud music on a bus or train.\n\n>They could have asked during the ride instead of insulting me\n\nSounds a lot to me like you're more bothered at being shown up as selfish and inconsiderate than you are at accepting this as a learning experience and taking from it you need to change as a person.\n\n>Busses are also generally first come first serve so I think my behavior was normal.\n\nNo, your behaviour isn't. It's reprehensible and you should learn from this that the internet isn't going to validate your experience in any way other than to agree: what you did is wrong, selfish and you should feel bad and not make this about being called out.", "YTA for not moving your bag when the bus filed up, as everyone said. But also for arguing with all the comments. If you don’t want know if you’re the asshole why did you ask?", "Welcome to adulthood. YTA", "YTA. You shouldn't go around making assumptions whether people wants to sit next to an stranger or not, nor people should have to tell you \"excuse me could you stop being an inconsiderate AH a take your bags of the seat\" the moment the bus start getting crowded you should have picked your bags no matter how heavy they were.\nYour behavior wasn't normal, you were being very rude stop making excuses for yourself, you were in the wrong, period", "YTA and I can't believe you don't know that.", "You know you're an AH, if you didn't you'd be a dumbass. The world's full of AH's like you who bank on polite people being uncomfortable rather than getting into an argument.\n\n\"I would have moved if someone asked there wouldn't have been an argument\"\n\nEven if that's true your actions say \"Don't sit next to me\" to everyone that gets on the bus. No doubt alot of people considered you a rude fuck that day. Unfortunately for you at least one person was comfortable enough to call you out for it as you left.\n\nAlso your \"strangers don't sit next to each other on the bus\" comment is genuinely funny.", "YTA in the context of this sub, but honestly, I would say it was more inconsiderate / oblivious. If the bus was filling up, you should have moved your bag (and now you know for next time!)\n\nSomeone likely would have sat there if the seat was open, but didn't want to ask & start a confrontation. Nowadays you never know how people will respond, and some people freak out & start yelling when you ask a simple question. So they probably would rather stand than accidentally cause a scene. In theory, the guy that made the comment should have asked you to move the bag to sit there rather than just making a snide comment after the fact... but really he shouldn't have HAD to ask. Like I said before though, now you know!", "YTA, you saw that the bus was getting crowded and people had to stand up, the kind thing to do was move your bags and gave them the option to sit or continue to stand.", "You opened your defense by using \"it wasn't crowded\" as a reason for putting your bags on a seat. You used a seat because there were others.\n\n&#x200B;\n\nSo by your own word, you *knew* that using a seat wasn't good if the empty seats became unavailable. \n\nYou also try to use \"no one asked me\" as a defense. You didn't ask, either.\n\n&#x200B;\n\nLiterally by your own definition, YTA.", "If someone had asked “I probably would have” moved my bags. \n\nSo even if you had been asked, you might not have moved your stuff out of the way. YTA", "YTA - i'm from the UK where we are generally far too British-polite to say anything but everyone on that bus would have been tutting at you with narrowed eyes. I have once asked a woman how much her bags paid for their train ticket.\n\nPeople shouldn't have to ask and everyone accepts you will have to sit next to a stranger at some point on public transport. \n\n&#x200B;\n\nYour attitude is selfish and entitled.", "YTA\n\nIf the bus had been empty or with plenty seats available throughout the journey, what you did is fine. But once the bus got crowded you should have moved your bag without even needed to be asked. Not sure why you think what you did is acceptable, you see others doing it doesn’t mean it’s acceptable. Learn from this and do better", "YTA, no ifs or maybes", "YTA- bags don't get seats. They get the floor. You don't wait to be asked to do what's right my friend. You just do it.", "YTA. I think you know this, and are trying a bunch of different excuses why you wouldn't be, but you absolutely are. Can you leave you bags on the seat next to you on an empty bus? Sure. But you know you should have moved them as the bus was filling up. You were hoping that what happened would happen - that no one would explicitly ask, and you could pretend that they just didn't want to sit.", "Everyone on here saying YTA would probably have done the same thing, but yeah depends on how many bags you had. If it was a bag or two, yeah you could have moved them and cleared a seat. Don't beat yourself up, you're 19. Now you know.", "YTA, move the damn bag. Does someone really have to ask you to be considerate? I can't believe you thought you were in the right lol", "YTA", "YTA. You paid 1 bid fare, you're entitled to max 1 seat. Putting your bags next to you when it's half empty is fine, but once you see only a few open seats (or people standing) you should have moved your bags. Busses also typically have an area at the front for bags, so if they were too heavy for your lap you could have put them there. Also your assertion that people would ask you to move your stuff is ignorant, in my experience people avoid confrontation and most would stand before asking somebody to do what should be automatic behavior.", "YTA. And you know it. It's a bus, everyone has paid the same, if there are seats when you get on, you get a seat. Your bags did not pay, you did. Taking seats when no one is standing is fine, but when the bus fills up, you clear the seat for another rider. YTA, very much so. But you didn't need us to tell you that. You know it.", "MAJOR YTA\n\nI was fine with this until the bus got busy.\n\nHow dare you claim two seats when others had to stand.\n\nI too would have told you to smarten up and remind you that you bought one seat which gives you one seat.  And if you had refused a reasonable request to move the stuff so someone could sit, I would move the bags myself.", "YTA and a massive one at that. Learn to be considerate.", "“People don’t want to sit next to a stranger” don’t be obtuse. You knew people wanted to sit", "YTA. Big time", "Easiest YTA. This is basic public transit etiquette. If you want an extra seat you can put your own groceries on that no one else will be able to sit in then buy your own car", "Did the bags pay for a seat! Beyond selfish!", "YTA are you kidding me, being the person who takes up a seat on crowded transit for their precious fucking bags is always TA. You lack self awareness.", "YTA. “AITA for giving my bag a seat and making sure nobody could sit there?”", "I have pretty bad social anxiety so tend to put my bag on the seat but if it gets too busy that people are literally standing I move it off. It’s not difficult. YTA", "YTA people were standing", "YTA", "YTA. I know you didn’t intend to be, but you were. Next time you’re in a similar situation, move your bags once the bus starts getting crowded. It’s just the polite thing to do.", "I personal don’t think yta yes you could’ve moved your stuff but also they could of asked and the rude shit not unnecessary you wanna sit ask", "So there was \"hardly any room\" on the floor in front of you, but if \"someone had asked\" there would have been enough room? Make up your mind OP.", "YTA. The seats are for humans. You use them for other stuff when there are no other humans. Where I am from, you would have heard insults long before the last stop. \n\nIt's a public transport, obviously everyone sits next to a stranger! What logic... Smh", "OP: why didn't anyone ask me to move my stuff?\n\nSomeone: you should have moved your stuff\n\nOP: ugh so passive aggressive\n\nYTA.", "Girl it sounds like you have no social cues. You don’t wait till someone ask you to do something, especially on public transportation like that", "YTA, I hate people like you on the bus, entitled assholes", "YTA last week I was riding a crowded bus to the airport, I put my suitcase and my backpack on my lap so someone could sit next to me\n\nAnd someone who was thankful for the seat did", "Do you ride the bus often? if it's a long bus ride you should have expected that the bus will fill up at some point. It's ok to put your bags in the next seat if it's not crowded, but personally I wouldn't if I'm on for multiple stops and know that the bus will get full well before I'm getting off, because I'd have to move the bags anyway, and it's easier to put my bags in front of me when it's less crowded.\n\nand no, it's never ok to take up a space with your bags in a crowded bus. It doesn't matter if no one wants to sit there, in that case you leave the seat empty anyway and let people decide if they want to sit or not.\n\nAnd it doesn't matter if you \"would have moved the bags if asked\". Most people will not ask a stranger to do things unless it completely stops them from functioning.\n\nIt's also kind of ironic you go ahead and assume \"no one wants to sit with a stranger anyway\", but then expect strangers to make requests to you if they need something. A stranger is FAR more likely to sit next to a stranger on a bus, as compared to making requests at a random stranger when they don't absolutely have to.", "No one should HAVE to ask you to move your bags. It's common sense and common courtesy. YTA. \n\nBe better. The world doesn't revolve around you.", "YTA if there were still empty seats, then no problem, but the second the seats were filled and someone was forced to stand up, then you absolutely should have set your bags on the floor so someone else could take that seat. Yes, YTA", "You are so funny. OBVIOUSLY YTA hahah. It’s true they could have asked, but you being actively aware that you were making people stand when they could have been sitting, is extra shitty.", "YTA: It’s public transportation which means you don’t get to hog seats no matter how empty the bus is. No one should ever have to ask you to move your things because your things don’t belong in a seat at all.", "YTA.", "YTA. I don’t know where you got the idea that people would rather stand than sit next to a stranger. In all my years of busing to and from work I can say this is absolutely not true.", "YTA.", "Solid YTA - bus is full, move your bags.", "YTA \n\nDoesn't matter how empty the bus is, your bag doesn't belong on a seat.", "YTA and I hate people like you in transports.", "Yta once it got.crowded.to need to move.yoyr bags as other people have paid for a ticket.", "Definitly YTA", "YTA.  Letting someone have the seat is the least you should do.  You also could have offered your seat to someone and stood instead.  At age 19 you are younger and in better shape than a lot people.  You are a massive a-hole.", "I think I would’ve moved a bag but I don’t see harm in someone asking, but you should’ve moved it regardless\n\nYTA", "YTA,\n\nThat's basic manners. If the bus isn't full, who cares. There are people standing. move your self.", "YTA", "YTA. Move your luggage, or stand up on the bus.", "I loved in NYC for 8 years and took public transit and this is a big no no. But there people will not put up with that shit and would literally move it to sit down.", "YTA. It’s fine when there were plenty of empty seats, but as soon as you noticed people had to stand, you should have moved your bags. Your excuse if “people don’t like to sit next to strangers anyway” is a weak rationalization. Of course, people who take public transport sit next to strangers like, all the dang time. \n\nTake this opportunity to learn the lesson and be considerate of others next time.", "Imagine having to stand because someone doesn't move their bag. It doesn't matter if no one asks, they shouldn't have to. YTA: The faux pas was on you, but now next time you'll know better.", "I always move my bags once the bus gets crowded  it’s just good social etiquette YTA", "YTA, people shouldn’t have asked you to move your bags, you should have done it once you realised the bus was full and your bags were taking up a seat someone else could be using. I’m glad someone called you out on it, you’re selfish.", "N T A up until you didn’t move them once the bus got crowded. Many people have a hard time asking strangers to do them a favor like move their bags so YTA for not moving them once people were standing.", "YTA, the seats are for people. If it’s not busy, sure. gets busy, stop hogging seats. YTA", "YTA, you seem very entitled to think that nobody else would want to sit down. People shouldn't have to ask you to move your stuff out of a seat where they do t have to stand.", "YTA. Move your stuff.\nI've been there. Long day. All your groceries packed up. But you still move your stuff. Put it at your feet, on your lap. It's not ideal, but try to be considerate. Use your common sense", "YTA", "YTA the etiquette on busses is that if it fills up and you are taking up 2 seats then you move your stuff so that someone can sit down. People sometimes don't like to have to ask to be able to sit down. You should have just put your bags on your lap or by your feet. I know it's not that comfortable but it's tough, that's the polite thing to do.", "I wouldn't have asked. \n\nI would have just sat on them.", "YTA - you saw the bus was getting crowded and didn’t think to move your bag so someone could sit?", "errrr come on now. as soon as you notice the bus filling up you put your bags on the ground. i understand being winded as you sit down and not having the werewithal to place them low right away but like lol of course YTA and why are you arguing back \"no one asked??\" like be serious babe!", "YTA. Guarantee that an old person or someone with a child got on while you were on there. Where I live people get up to give them preferencial seating without being asked and you had a whole empty seat with bags.", "YTA. Obviously the time to move your bags was when more people got on the bus and there were no more seats available so people had to stand. \n\nSomeone shouldn’t have to ask you to be a decent person. If you understand that “not everyone wants to sit next to a stranger” then you should be able to understand that not everyone feels comfortable asking a stranger to move their stuff.", "YTA i have been riding the bus for over twenty years this is basic bus edict, if the bus starts filling up you move your shit off the seat so others can sit", "YTA.\n\nI ride the bus frequently too, and if there's a time where the bus is filling up, I'll move my bag to my lap or on the floor", "Yes, kiddo, YTA.\n\nPutting the bags there when the bus was empty was fine.\nYou should have moved them once the bus started to fill up. \n\nNo one WANTS to sit next to strangers, but they'd rather SIT next to a stranger than STAND next to one. Which is what they wound up doing.\n\nPro tip, if you are going to do your shopping by public transport, either go more frequently for smaller loads, or get one of those rolling carts that fold up when not in use.", "YTA It's the same thing as someone young and fit sitting while children and elderly stand.  It is first come first served, but generally considered polite to at least offer your seat.  You should have at the very least asked the ones standing nearby if they wanted the extra seat.  If they decline then it's on them.", "YTA. You know why no one asked you to move the bags? Because too many people cause trouble when asked to do something to accommodate others. Having used the train for years I've seen too many entitled folks raise a riot when asked to move bags, even when asked by a conductor.", "YTA. Grow up and read the room. If it's crowded make sure you're only taking up one seat. You shouldn't need someone to talk this through to you.", "YTA and as bad as Manspreading \n\nPeople shouldn’t have to confront you to stop being rude and entitled", "YTA. Of course. Why would you think you weren't?", "YTA, the moment people had to stand. You should have just piled your bags on top of you as much as you could.", "YTA. The other person is a bit of coward for waiting that long to say something, but yes, generally it is agreed that people get the priority over inanimate objects. Now you know!", "YTA\n\nI drank some milk when I thought no one was watching. But a little while later, I find out that everybody has been watching the whole time and I still drank the milk even though I knew the milk was meant to be shared with everyone. My case stands because I'm a cat and I was hungry. \n\nAren't you actually a very clever cat OP?", "YTA. Although they probably dodged a bullet by not having to sit next to an asshole like you.", "YTA. This doesn't ever become a problem if you just put your bag on your lap or in front of your seat when you sit down in the first place. Just be considerate, people.", "YTA\n\nOnce you see it is more than three quarters full or so you should move your bag.", "Yta! How inconsiderate if you. People don’t need to ask you to move your stuff. You should have moved it once the bud got full", "YTA", "YTA", "YTA \n\nMove your shit. The world doesn’t revolve around you.", "YTA as a bus rider who can’t drive due to a medical condition, I understand the struggle of lugging lots of stuff on the bus. But seats are for people, not for stuff. As soon as seats start to fill up, I would already be re-organising my stuff to make space. \n\nThe other factor is that there are often people with hidden disabilities or invisible illnesses who are getting the bus, and very much need a seat but may be too anxious to ask.\n\nAs a general rule I always assume that people NEED a seat, as you never know what peoples’ situation is from outside appearances.", "Gentle YTA from here on out bags and things stay off the seats. Let it be awkwardly in front of you. People don’t like asking for things and are super passive aggressive (look up why people are passive aggressive)… next time say “all you had to do was ask”…", "Sadly, courtesy isn't so common anymore", "Exactly, N T A for putting bags on the seat when it's not crowded, but YTA for not moving your stuff when there are no more empty seats.\n\nFrom OP's little preamble about why she's taking the bus (you don't need a reason to take the bus, it's a very normal thing to do) and her age, it seems like a new thing to her and she's coming on here to ask about bus etiquette, so there's hope for her yet. But I've definitely had to try manoeuvre bags in the bus or subway to disturb others as little as possible, it sucks, but it's part of living in a society.", "I have a feeling this post is the first time OP has ever been held accountable for anything in her life", "he didn't ASK me to stop hitting him, so I just carried on.", "Most people don't sit next to strangers though. I've rode busses many times, and it's very common to see an overcrowded bus with people standing but multiple empty seats. The majority of people on busses would rather stand than sit next to a stranger, so unless someone asks for the seat that's what I assume they'd prefer.", "they also don’t actually need to ask for permission to sit down on PUBLIC transportation", "Wow - I really thought it would be another one where some creep made her move her bags when there were empty seats because he wanted to sit next to the young girl.  Nope - as soon as the bus fills up you move your stuff.  YOU might rather stand but many people would way rather sit.", "No one asked for the seat? I would have moved my bag if I knew someone wanted to sit. Most people on busses don't sit next to strangers anyway.", ">but not everyone is comfortable with that situation with a stranger. What if they asked you and you said no? It would create an awkward situation for them.\n\nThis. As someone with an anxiety disorder (clinically diagnosed), this is pretty much textbook me. OP, the people in the bus have absolutely no idea what your response would have been if they asked you. Also, you keep saying you wouldn't have said no. We don't know if you would have moved your bags graciously, or begrudgingly. As someone who is non-confrontational, and an overthinker, if I were a standing passenger on the bus you were on, just laying out all your possible responses would have taken up more energy than just standing on the bus. Now I wouldn't have told you off like that person, but you never know if someone with the same level or worse anxiety than me needed the seat a lot more than you think. And also, you're not entitled to two seats anyway. You paid for one seat, so the extra seat you took should have been open. Your bags in it would have told the standing passengers otherwise.\n\nYTA.", "I wouldn't have said no..", "I would have moved her bags to the floor without asking.", "It's also a safety issue.  Seated passengers are safer than standing ones in the event of a sudden stop or crash.", "Just because you disagree with my actions doesn't mean I'm a \"troll.\"", "Yeah, that remark about strangers not wanting to sit beside other strangers is the farthest reach for trying to justify her selfish, entitled behaviour that I've ever seen. Half the seats on every bus, train and subway would remain empty if that was true. Absolute BS. YTA!\n\nEdited to clarify-- strangers always sit beside you when the bus, etc , is full.", "I just worded the sentence bad. If someone asked I would have moved my bag.", "No not \"easily.\" There is hardly any space between seats and the bags were heavy and bulky. They hardly fit in the floor in front of me, it would have been uncomfortable to try and cram my legs and bags in that same area. Not necessarily saying I wouldn't do that if I was asked to move my bag, but just explaining. It wasn't super easy to have the bags somewhere else.", "Im in Germany and i often get asked", "Sadly common courtesy is not so common anymore.", "Then, as you put it, he should have stood and put his bags on his seat. Once the bus filled up and other people were being forced to stand, he should have moved his bags.", "Probably eating, yeah? Food? You buy it in shops and  it prevents death?", "I bought normal household things?? It was food for my lunch at work the next day and cleaning supplies, if you must know. I wasn't buying luxury items.", "In my country there is a saying: did your bags get tired? (Spoken while they're \"taking a rest\" on a seat designed for people).\n\nWe're talking about taking two seats on a crowded bus, fully consciously. Just like you don't have to tell people not to scream, not to play loud music, not to stick chewing gum on the floor (if someone does those things, they're an asshole) so you shouldn't have to tell someone not to take up two seats on a crowded bus.", "This is where you and OP are different; you offer the seat. OP was too entitled to offer to give up a second seat that she wasn’t given. I don’t see OP having the sense to offer the seat to anyone regardless.", "$10 says if the situation were reversed and OP was one of the standing people, they would have been pissed that the other person didn't move their bags", "I wish I had an award, please take this poor man’s award 🥇 Edit: omg thank you for the awardS!!", "Not sure where you got this idea. I’ve lived in major cities for the past 20 years, and people will gladly sit next to a stranger if they want to sit down. You seem to have somehow made up this rule to make yourself feel better. YTA.", "\"Most people don't sit next to strangers though.\"\n\nIf the bus was so crowded that people were standing, it sure sounds like people were sitting next to strangers. I bet you see people sitting next to strangers all the time if you take the bus.\n\nYTA, easy call.", "That’s the problem, you’re assuming what someone prefers.  Your bus fare entitles you to one seat (if available), not multiple because your bags are too heavy.  Your comments make you seem quite entitled. No one has to ask you…it’s common courtesy.", ">Most people don't sit next to strangers though\n\nWhat's the difference between sitting next to a stranger and standing next to a stranger except the fact that in the second scenario you have to stand.\n\n>The majority of people on busses would rather stand than sit next to a stranger,\n\nDid you ask them?\n\nSeriously, is this even a question? Of course YTA", "Don’t make up excuses and stop arguing. What you did is incredibly rude.", "This is an incredibly naive conclusion to draw and shows your age tbh. Think outside of yourself and consider how you would like someone to behave it were someone you cared about getting on a bus and needing a seat. How would you want them to be treated?", "That is a dumb excuse. Stop using it. YTA!", "That’s just \nNot true, idk what to tell you. My experience is quite the opposite especially on longer bús rides. Many people are just socially awkward and scared to ask for a seat but most people prefer to sir down. What world do you live in?", "YTA. I live in NYC and anyone will sit next to anyone.", "Yea they wouldn't be the \"most\". They would be the exceptions. I've ridden on busses my whole life. Usually multiple per day. \"Most\" are sitting next to strangers. Often multiple ones because you're on for a longer ride. The majority of people want a seat. The exceptions want to stand rather than sitting next to a stranger.", "Do you think every other person on the bus knew each other? Of course not, when the bus is so full that people are standing most people are sitting next to strangers.", "I stand when I'm only a few stops away, so others can have the seat. If my trip was longer I'd want to sit down. The standing thing depends on distance,  not avoiding strangers.", "You keep arguing against your verdict you should read the threads post x", "Seats are for people to sit on, though.", "Seriously? I’ve had weird people sit directly beside me, I’m sure it’s not something limited to my city. \n\nWhere was the mental disconnection regarding simple etiquette? Honestly, just common decency? I’d be willing to put money on the fact that this isn’t the first time you’ve done this. \n\nYou have a lap, you have a floor, many busses have under-seat storage. YTA", "Thats the most ridiculous thing I have ever heard... its inevitable to have to sit next to a stranger on public transport.", "It's not your decision to make about whether someone will sit or not if it's a crowded bus move your stuff. It's basic etiquette.", "> Most people don't sit next to strangers though.\n\nWell not if the strangers don't move and make room for them, of course not. On my commute, it would be weird to just sit next to someone when there were spaces available but people will absolutely sit next to others rather than stand.", "They shouldn't have to ask. You should recognize that the bus is getting fuller and make the seat available. Also, I've sat next to strangers on buses countless times. I don't know where you got the idea that people don't do that.", "A lot of people just have the common curtesy to move their bags though….\n\nSorry YTA", "Get this through your head. **NOBODY SHOULD HAVE TO ASK YOU TO MOVE YOUR BAGS ON A CROWDED BUS!** It is something you should do automatically!", "Most people on busses don’t sit next to strangers anyway \n\nThat is the most ridiculous thing I’ve ever heard. It’s an integral part of PUBLIC TRANSPORTATION. \n\n\nYTA", ">Most people on busses don't sit next to strangers anyway\n\ndo you seriously not know how public transport works", "They shouldn’t have to. You should be decent enough of a person to move your bags", "YTA - It's a bus, unless you have a friend travelling with you and sitting next to you, it's always going to be a stranger sitting next to you.  Is this the first time you've ever caught a bus? \n\nCommon courtesy, would be that if you see people standing, even just one person, you move your bag off the seat.  \n\nI think you're the one who doesn't like sitting next to strangers.", "You probably need to think outside of yourself.", "No one asked me not to punch this little old lady who's minding her own business in a shop. I guess it's OK to do it then.", "That’s their choice to make, I bet they didn’t want to confront someone (these days people get pretty unpredictable when confronted) and would rather not cause a scene. But I also bet if the seat had been open they would have quietly sat down. It’s common courtesy to make room for people when it gets full, how do you not get that. It’s public transit, they shouldn’t have to ask you to move your shit that’s uncalled for", "How would there be no seats available if strangers werent sitting next to eachother? Probably 95% of people riding a bus are doing it alone", "So no one on that bus took a seat next to a stranger. Even when it is getting full?\n\nBS", "If every other seat was taken, surely that’s an indication that people do indeed sit next to strangers don’t you think? Or do you think that each person who got on and took an empty seat next to someone just happened to already know the person that was sitting there?", "YTA, no one wants to have to confront someone else. It's purely poor manners in your behalf. I highly doubt you paid for taking a second seat, therefore you aren't entitled to one. No one should have had to ask, you as part of society should be more considerate of others, end of story.", ">Most people on busses don't sit next to strangers anyway.\n\nThis logic is inherently flawed. Unless there are empty seats between each rider who doesn't have someone with them, there *have* to be people sitting next to strangers.\n\nYTA. Move your bag.", "No one should ask. Its common decency to move your bags automatically when you see people standing.", ">Most people on busses don't sit next to strangers anyway.\n\nABSOLUTE BS!  Practically everyone on the bus is a stranger.  By your logic there would be empty seats all the time.  Do you think everyone who sits next to each other are friends?", "Everyone on buses sits next to strangers. That's how busses work. Once it becomes standing room only, you move your bags. People shouldn't have to ask. And often don't because they are not confrontational and/or afraid of overreaction. \n\nI'm going with ESH because passive aggression doesn't get problems solved, and the woman sounds like she was being rude for the sake of it. But move your bags next time.", ">No one asked for the seat?\n\n>Most people on busses don't sit next to strangers anyway.\n\nYou think they want to talk to strangers?\n\nYTA... Have some awareness", "Sure, they won’t sit next to a stranger if there’s an option for an open seat elsewhere, but if is stranger vs stand, a whole lot of people would like to sit. It’s a bus.", "They shouldn't have to ask for the seat. It's common courtesy and manners not to take up more than one seat. Of course if people are standing they'd  rather sit down. \n\nThey also probably didn't ask because the only thing they knew about you at the time is that you were acting selfishly and rudely. What good would asking a selfish, rude person to be polite on a ver basic level do? They'll just say no or be even more rude.", "Everyone on the bus sits next to a stranger. Everyone. It’s public transportation.", "You think they'd prefer to stand with their face nuzzled up under a stranger's armpit on a crowded bus? Literally everyone they are sitting or standing beside is a stranger on public transit...", "Regular bus passenger here we absolutely will sit next to strangers of no other seats are available you also shouldn't post on here then disagree with the verdict its one of the rules of AITAH", "Did you pay two fares? No? Then your bag sits on your lap or on the ground.\n\nCommon sense and common courtesy, not so common anymore.", "That’s moronic to think that people need to ask you for basic decency. I imagine you’d think the opposite in their position, given how entitled your responses are", "This is absolute bullshit and you know it.", "However it sounds like every other seat had strangers sitting next to each other. \n\nPeople using seats for bags is one of the most ridiculous things. \n\nWhen I first saw the title the thought that the second seat was for bags crossed my mind. But then I thought, no way. Why would anyone need to write in to see if they are the AH for using a seat for bags. That’s too obvious. \n\nYTA", "THEY DON'T HAVE TO ASK FOR A FREAKING SEAT THAT IS MEANT FOR PEOPLE WHEN THE FREAKING BUS IS CROWED FOR GOD SAKE", "they shouldn't have to ask OP, how is this lost on you?  It's a crowded bus, you don't get to help yourself to as many seats as you like.", "It's a social contract that you're all supposed to adhere to. They shouldn't have to ask.", "They probably didn’t want to get into an argument and assumed someone who wouldn’t move their bag as the bus got full would fight back.", "Don’t make people ask.", "I often use the seat next to me for my bags however whenever you do that you have to check at each stop if there's still empty seats available. If there aren't you have to remove your bag. Not doing so is very rude. People don't have to ask you if they can sit down, they payed for a ticket. Sometimes you're lucky but nearly 100% of the time if people are standing and you remove your bag someone will come sit next to you.", "So was every seat empty next to all the solo travellers on the bus?? I'm guessing not, people want to generally sit down while travelling, even if they have to sit next to strangers. Sure its nice when you get the whole seat to yourself but you don't own the bus, so you have to share.\n\nNext time don't be such a selfish ass and move your goddamn bags", "That’s literally all busses and trains are…people sitting next to strangers. Sure they’d sit by themselves if they could but hardly anyone would rather stand than sit next to a stranger", "If I get on the bus and cover every seat with my possessions am I the asshole ? Even though nobody asked to move it . Use your brain please", "they shouldnt have to ask, its common courtesy to move your bag to the floor if other people are having to stand. \n\nif the bus is crowded no one gives a shit if its a stranger or not , Im sure they'd rather have a seat.", "No one exactly wants to but most people don’t mind if they have to take the bus. You don’t get to complain about strangers using public transport that makes no sense", "Yeah sorry, but YTA\nIt sounds like you don’t really understand the unspoken rules of public transportation and if most of your experience using it was during a pandemic that makes sense. (I’m assuming that to be the case based on your age. I apologize if I assumed incorrectly.) I have used public transportation, mostly buses, as my main source of transportation for many many years and in many different cities. There are unspoken rules that you need to be aware of.\n\nNo one asked you to move your stuff because they shouldn’t have to. As the bus filled up you should have used some situational awareness and moved your bags off the seat. It is common courtesy on every bus I have ever ridden. By leaving your bags there you were telling everyone that the seat was taken, even if you didn’t realize it. Nobody asked because your behavior communicated that you didn’t want someone sitting there. Why else would you block a seat on a crowded bus, other than as a sign that it’s taken? That is how it was perceived even if it wasn’t your intention. That is why nobody asked.\n\nI’m also not sure where you got the idea that people on busses don’t sit next to strangers, but it’s not correct. Once again it is very common practice for people to share space on public transportation. This again could be a pandemic thing, but people absolutely sit next to strangers on the bus all the time. Especially when the bus is full!\n\nIt sounds like you really had no idea how ridiculously rude you were actually being/coming across. Hopefully this can be a learning moment for you and in the future you can be more aware of the other people on the bus.", "Do you need everything to be told for you like a child??", "a bus is a vehicle full of strangers. are you saying everyone who was sat down came in as a pair? otherwise by your logic there should have been many other unpopulated seats next to the other solo travellers..", "That's not my point. The point is a stranger doesn't know what your response would be and they might not want to risk an awkward conversation. They shouldn't have to ask.", "If you’re rude enough to leave your bags on a seat on a crowded bus I’m going to assume you’re rude enough to refuse to move them if asked.", ">never asked me to move my stuff, and if they did I probably would have.\n\nno you said you **probably** would have moved,  which implies you may have said no... and as the entire sub keeps pointing out to you , THEY SHOULD NOT HAVE TO ASK.  Are you completely ignorant to the concept of common courtesy?", "I was in this exact situation last week on a crowded train. A lady had her bags on the seat next to her. I am recovering from a leg injury. I'm not limping but it hurts to stand for long. I also have social anxiety. I stood next to her seat basically leaning on the seat for support and she never moved her bags and I was too anxious to ask. YTA", "Actually above you said you “probably” would have said yes. So would you have?", "They shouldnt have to ask. Listen to what people are telling you and learn from it so you can be a decent person in the future.", "Troll means you are lying. It's not that we simply disagree, it's that you sound so incredibly stupid, chances are you are making this up for attention.", "At this point I know you're scrolling so you can find a comment that says \"you're not rude ...\" but guess what, you are, you don't get that those poeple didn't have to ask you anything, they were entitled to the seats your bags were using, I guess your poor bags were more tired than the people that were going on the bus, right?", "You’re right. Some trolls are nice people and you definitely aren’t.", "Troll means there is no way you are this dumb to need to ask this. You HAVE to just be trying to get a ride out of us.", "You keep repeating the same dumb thing tho. No one asked.\n\nAnd everyone has told u they dont need to. I use public transportation and i am very anxious yet still if a bus is full it common sense and common goddamn decency to move your shit. \n\nYou are literally taking up space another tired, ill or mentally drained person could've used to simply have a rest.\n\nYou sound entitled and childish af. My 8yo niece once gave up her seat for an older lady. Wtf cant u think to offer the same for another person. And this nonsense about oh well no one wants to sit next to a stranger is a lame excuse too.\n\nITS PUBLIC TRANSPORTATION LADY EVERYONE IS A STRANGER!!!", "Why do you keep defending yourself? You asked for judgement and it’s been given. We get that you would have moved the bag if asked. But you should have moved your bags and no one should have asked you to. Common curtesy. Yta.", "They shouldn't NEED to ask! You should have moved your bags as soon as the bus started filling up. YTA!", "they shouldn’t have to ask though, it should be obvious that you need to move your bags on a crowded bus\n\nif the bus wasn’t crowded that would be different but i’m this situation YTA.", "Why are you consistently unwilling to see that it’s not someone else’s job to make you act in ethical ways in public. You’re an adult. Act like one. \n\nIf you wanted to continue taking up two seats, buy a ticket for your bags. See how that goes.", "If someone asked, I would have put my pants back on, but they didn’t ask, so I remained pant-less", "So you made an entire bus full of people hella uncomfortable just so you wouldn’t have to experience any? The entitlement is outlandish", "It doesn't matter. Seats are for people, not bags. Nobody should need to ask you to move your bags. Unless your bags paid for a bus ticket, they should not have been taking up a seat!", "There is a thing called “your lap” where you can conveniently store stuff! You should try it sometime.\n\nSeriously though. You came here for judgment. Accept that pretty much 100% of people here confirm that you where the AH, open your eyes, and do fucking better next time.", "So you put them on your lap then. Have a bit of common sense", "Then leave your bags on the seat and you stand!", "Just like common sense....", "If OP lives alone, there shouldn't be enough food in the bags to be hard to carry. One or two grocery bags, tops, are appropriate for someone who lives alone. OP characterized the bags as shopping bags as opposed to grocery bags. In US they're different things.", "I'm sorry, but I don't agree with you and I can't stand people who are too coward to speak up when the situation could be changed, instead they make sarcastic/rude comments when nothing can be done in their interests. If it was really that important for that passenger to sit down, then he would have asked to take her bags. It seems to me that it was more important for him to be able to make a scene.", "But but but, they're special....", "** To be clear I think OP is TA and I'm not defending them ** \n\nBut... \n\nI don't think OP is making up that part. As someone who rode the bus for many years as a teen, I experienced the same thing. There would be a bus with people standing up that was way overcrowded, but a few empty seats just because a person was sitting in the seat next to them. I think in cities people are more comfortable with crowds and strangers. But in my small-er town, there were definitely a lot of people preferring to stand than sit with a stranger.\n\nEdit: Reddit is crazy. You literally get downvoted for explaining reality. Sorry busses aren't the same in every corner of the Earth. Empty seats are common, even in overcrowded busses, I've seen it myself. If you don't think that's true you're just wrong. Never once did I say it excused OP's behavior. I don't understand why people downvote someone explaining a real situation with zero opinion even in the comment? Are you mad at real life?", "I'm literally not making anything up. Different areas might behave differently- but in my town I've seen numerous busses with tons of people standing and multiple empty seats.", "People sit next to strangers all the time on public transportation. That’s pretty much what public transportation is. People spread out when it’s not crowded, but it’s not like there are open seats when it is crowded. Crazy", "Covid made that a thing. It’s dumb.", "I don’t *like* sitting next to strangers on the bus, but if it’s a choice of standing or sitting I’ll sit, provided there’s enough room for my bum (made the mistake of squeezing next to a lady whose bum was not contained in one seat. It was an uncomfortable ride).", "Hey, that lady's passive aggression led to OP questioning her behavior without creating a scene or harming her and now OP is here, being taught manners with gusto.", "Passive aggressive might work in the long term. Hopefully OP learns a lesson here", "Thank you <3 As an introvert myself I'm happy when people don't act like an assholes so I don't have to talk to a strangers to remind them about the basic manners in a public areas.", "- and if someone is anti-social enough to keep blocking a seat when it's obvious people are having to stand, do you want to risk a possible confrontation if you ask them to free up the seat? 🤔", "It's not just an awkward conversation at risk, sometimes it's personal safety if the situation becomes violent.", "Though they may have opened the floodgates to other people calling OP out.  But your point stands, nobody wants to be the first to say something.", "I kind of think she’s actually just incredibly young and dense! It seems like she has no clue how public transportation works.", "\"Not saying I wouldn't have done that if someone asked me to move my bag, but just explaining.\" \n\nThe only reason I didn't move is cause no one asked", "Op is the AH but this is a really stupid take to have. One bag of fruit, potatoes, etc will make your bags pretty heavy.", "So you are now just limiting how much someone can drink or how many fluids they can carry in general? Cat litter? Do you want to tell me about how many times a week a 19 year old female can go to the shops in America?\n\nYou could have made a perfectly sensible judgement on this post without straying into irrelevant weight and measure fantasies.", "But that’s making an assumption. Just because it happened the times you were riding the bus doesn’t mean that was always the case. I’ve seen super crowded trains and buses with the same situation - people decided to stand instead of sit. But just because that happened on the trips I was on doesn’t mean it happens all the time.", "Then you still move your fcking bag and let the people decide for themselves if they want to sit next to you, you don't just take that decision away from them\n\nOp YTA", "Those people aren't the majority, though. There are still more people sitting next to strangers than choosing not to.\n\nEdit:grammar", "I ride the bus to work all the time and the only time I see empty seats on the bus when it’s crowded is when an a-hole doesn’t move back and blocks people from getting through to the empty seats. People don’t like it but they’ll sit next to a stranger.", "And that scenario is not what you described in your post. You were riding on a crowded bus that caused people to have to stand. No matter the situation, what you did was rude and entitled. Seats are for people, not bags.", "If you aren’t going to listen to the countless people here telling you that you’re wrong, why did you even post here? You’re just arguing your original point over and over - while pretty much everyone is telling you your assumptions are wrong and YTA. Why bother if you don’t care?", "I’ve only ever seen that during Covid.", "That’s their CHOICE doesn’t mean it’s not common courtesy to at least give them the option to sit down", "You don't want to accept reality,  so why are you on here?", "Maybe they’re standing because people like you don’t move their shit and give them a seat. YTA", "Oh my god, don’t ask the internet for advice if you’re not even going to take it. You’re very obviously TA in this situation. You can’t just assume “most people don’t want to sit next to strangers”. You can’t read minds.", "op is not learning anything, they have only doubled down since posting.", "True it does seem to be working in this case. I just meant more the woman could have handled it differently. Not everyone checks themselves on reddit AITA forum.\n\nEdit: I take this back. It didn't solve the problem of op's bags being on the seat, but it may have prevented future occurrences of it.", "I’ve literally stood whilst a person had a bag on a seat on the underground. I’m the end someone else asked because I didn’t know how they’d react", "People shouldn’t have to ask OP. You know you’re the asshole in this scenario. Accept it and stop arguing.", "They shouldn’t have to. Any respectful person would see the bus is getting full and empty the seat. A rude entitled person would wait until someone asked and then empty the seat.", "No one should have to ask you.  You're an adult now.  Stop waiting around for instructions like a child.", "THEY SHOULDNT HAVE TO ASK", "I never said it happens all the time. But since I've seen it happen I don't think it's made up. Doesn't excuse OP's behavior, but I just don't think they're lying since this is a common thing on busses.", "When did I ever say OP shouldn't have moved their bag?", "All I'm saying is that I've seen empty seats on overcrowded busses many times. I'm not making any assumptions about anything.", "I'm wondering if, because she's only 19, she has the idea that pandemic bus behaviour is the norm rather than an exception.", "Yeah, people do that in confrontations.  I'd bet my last dollar OP will remember this next time she's got two seats and the bus starts filling up.", "Yep. I will ask on behalf of someone else (visibly pregnant, using crutches etc) but won’t for myself. \n\nEven so I got verbally abused for asking a man taking up two priority seats on a bus to move his bag so a pregnant woman (wearing the badge) could sit down.\n\nHe called me a ‘fat selfish c***’ and yelled at me for several minutes. Nobody else on the bus defended me and I ended up having to get off and wait for the next one because I was starting to cry.", "You didn't say not to do that I just think it's important to mention explicitly that OP/anyone *should* do it", "Yea so have I. But the amount of people sitting next to strangers on the busses is more than the amount of people who choose not to sit next to a stranger. All I'm saying is the majority of people want a seat. Even next to a stranger.", "They shouldn’t have to ask you. The right thing to do would have been to remove your bags and give other people/strangers the choice to sit next to you or not. I’m not going to call you an asshole because I don’t think you are. Hopefully this is a learning lesson, though. In shared spaces, be courteous to others.", "You are the asshole.\n\nYou are an entitled person who is spoilt.\n\nWelcome to adulting where not everyone will comply to your wishes. People will not ignore your wrong behavior and keep quiet. They will point out your mistakes.\n\nI always wondered why \"how to behave in a public transport / common courtesy\" teaching videos were made, may be its for people like you who don't know the basics.", "YTA. \nThis is a sign to start becoming a little bit more self reflective and considerate on other people’s needs and not just your own.", "YTA\n\nI'm disabled and when wearing shorts it is very obvious when my leg brace shows. I was in DC being a tourist and got on a subway to go back to our hotel outside the city. It was packed without any room really to move. As long as I wear my brace I can stand for days without it hurting. I had to jam myself in-between people and hold onto the bar. The person I ended up standing in front of me immediately offered me their seat. I didn't have to ask and wasn't going to. I politely declined since I didn't know how quick I'd have to get off the train and didn't want to miss the stop. But they automatically did it to be respectful. I'd do the same thing if it was me.\n\nWhen someone is on a busy city bus/train it is common sense and polite to give people room to sit. People shouldn't have to ask you to do something like that it should just come natural. You chose to keep your bags there when you knew it was getting crowded. Picture it like this... while my disability is visible not all are. You could have denied a seat to someone who truly needed it, your bags did not. \n\nShame on you.", "YTA.  Nothing passive aggressive about it,she straight up told you that you are not the center of the universe.  Maybe other people have tired legs and heavy bags.  Sadly,no one taught you manners.  You MOVE YOUR SHIT if others don’t have a seat.  They shouldn’t have to ask.  Did you pay for your bags to have a seat?", "YTA /-: A lot of people are afraid to ask for a seat. Once the bus started filling up you should have moved them. If they were too heavy you could have put the bags on your seat and stood! So you wouldn’t carry. Other solutions for sure.", "The entitledness here is just overflowing and cannot be contained. Oh you poor baby, you had to carry heavy groceries and they take up your leg room. What if another passenger just had to walk 10 miles to get to the bus? What if a retail worker just got off a 12 hour shift where they were standing the entire time? They shouldn’t get to sit because your groceries are heavy? Start trying this thing called empathy. It will get you much farther in life than expecting everyone catering to you. YTA.", "Oh for the love of Pete. YTA. Grow up, it’s time. Selfishness is not cute.", "ESH. \n\nNot moving your bags when the bus filled up was an AH move. Be considerate of others. You're not nearly as much of an AH as alot of these comments are making it out to be, though...\n\nThe person who called you out was also an AH. If they'd called you out during the ride, I would have a different opinion. They clearly also didn't have any sort of shyness about calling you out since they *did* call you out. Waiting until after the entire ride is over doesn't help the situation or anyone else on the bus.", "YTA. Were you raised by wild turkeys?", "> In my experience most people don't want to sit next to strangers anyway and a lot of the time people will end up standing instead of sitting in an empty seat next to someone they don't know. \n\nThis is a lie. YTA", "YTA. You know this already though.", "You wrote this whole post out and still felt you might not be TA …… you are kinda dense…..", "Was that your 1st ever bus ride?! Come on!!\n\nYTA", "You're not only TA you're an inconsiderate  asshole.", "No one should have to ask you. If you see there are no empty seats anywhere else, and the bus is crowded, you should take the initiative and offer the seat to someone else. It doesn't matter if \"people don't usually sit next to strangers\" (you do know we just came out of a pandemic, right?), show some assertiveness and kindness and offer the seat.\n\nYTA", "YTA\n\nIf there are no available seats, and you have bags on a seat, move your bags so someone else can sit down. They shouldn’t have to ask you to move your bags.\n\nIt’s fine when there are other seats available, but when there isn’t, move your bags.", "Oh gosh YTA and you need to get past this main character syndrome you seem to be dealing with >.<\n\n&#x200B;\n\nI mean, how incredibly rude to not move your bags when it started to get busy. That takes some audacity.", "\"In my experience most people don't want to sit next to strangers anyway and a lot of the time people will end up standing instead of sitting in an empty seat next to someone they don't know.\"\n\nYeah, that's not how public transport works. Strangers sitting next to strangers all day, all night.  You really think all the other people who sitting next to each other on that bus were buddies?", "You sound not smart.", "YTA - these days many people, especially women, are scared to ask someone to move their bags because they’ll likely get a mouthful of abuse. Incredibly selfish YTA", "At some point of your bus ride, you notice people were standing. By any chance do you think that a high percentage of riders did seat by strangers? I have many years of bus riding and even coordinate long routes to go to concert/amusement parks a few cities away from my house (before online access made things easy) and what you did was not nice. You asked an everyone is telling you YATA, lesson learned and do better next time. Moving your stuff over or having your stuff take your seat while you stand and allow someone else to seat is the equivalent of holding the door open for the person behind you, making eye contact when someone talks to you (even if they say ‘hello’), or saying ‘thank you’ when someone does something nice…such as making room so you can seat on a busy bus.", "Of course YTA. You're right that people could have asked you to move the bag, but they probably feared it would be confrontational, or perhaps they just didn't want to get into that whole faff with a stranger (I've asked before and been shouted at - not everyone takes being asked to move their stuff well) and you should probably just use your eyeballs and realise that if everyone else is standing and you've got your bag on the seat, it's time to move your bag.", "Why should someone have to ask you to move your junk when you clearly see the bus getting full. You are the AH for lacking basic human decency.", "YTA. Bags can be on the floor", "As someone who rode the bus for 4 years I say, yes, you are the asshole.", "YTA. As someone with an invisible disability, this just highlights the daily struggle in today's society.", "Yes, of course YTA. If there are more people than seats you move your bags so someone can sit down. That's bus etiquette 101", "You need a lesson in integrity. \n\nYTA", "YTA\n\"In my experience\"? Your extensive bus riding experience, at 19 years old, thinking people prefer to stand than sit next to you on a crowded bus? Please... 1 seat per person. Nobody cares about your heavy bag and how it doesn't fit well in front of you or on your lap. That's a you problem. Nobody cares that you can't afford a car and so you think you're entitled to use up extra space on public transit.\nAgain, 1 seat per person. No one should have to ask you to move your crap so they can sit.", "Is thus a serious question? Yeah, YTA! Move your shit!", "YTA\n\nAnd a spoiled little brat as well.", "Nobody really wants to sit beside other people? Sure. You know what else nobody really wants to do? Nobody really wants to ask a person to do something that that person should do without needing to be asked, such as moving their bags. And, while buses may \"generally be first come first served\" they generally have seats for people, not bags. So yeah, YTA", "YTA\n\nSeats are for people, not bags.", "YTA, 100%", "You shouldn’t have to be asked to move your things if they are taking up space, you can put your bag by your feet so you don’t have to carry them. \n\nThe whole “not doing it unless I’m asked” is just petty, have some common decency, some people may be too anxious to ask if they have anxiety over confrontation.", "OP was probably taking up 2 of the accessible seats in the front too", "Yta. So oblivious  and inconsiderate.", "Yeah, YTA...YTA hard.", "YTA. I was with you in the first half. But once people are standing how tf did you think that was ok? I used to take the bus and hated the people that did this. So inconsiderate.", "Hi fellow bus rider here AND THERE IS NO QUESTION YTA. There is no if ands or buts. YOU ARE THE ASSHOLE. Its not peoples job to ask you move your bags from the seat next to you. You don't wait until someone asks you move your stuff as soon as the bus starts filling up. The person who made the comment is correct, everyone wants to sit down. MOVE YOUR STUFF.", "Of course you're the asshole. YTA.", "\"In my experience most people don't want to sit next to strangers anyway\"\n\nUhh they do when the alternative is standing up and being squished like sardines on public transit? What a ridiculous thing to believe is true.", "My bags comfort trumps other actual human beings comfort? YTA, was this a short bus you were on?", "Why is your bag more important? If you saw the bus getting crowded clearly you knew you should’ve moved the bag. Entitled. YTA", "The entitlement is strong with this one.\n\nYTA.", "YTA\n\nyour purchases are not as important as any person. It can be embarrassing and overwhelming to have to ask.", "Gargantuan gaper of an AH. \n\nThis kind of behaviour makes my blood boil. \n\nSelf entitled. \n\nAll about me. Learn some social skills for goodness sake. \n\nFor clarity.. YTA.", "Hopefully you weren't in the disability seats, But you weren't TA when you put it down when the bus was empty, but then you actually expected people to ask you to move your stuff when the bus was full they shouldn't have had to ask you anything, you should have just moved it and offered the seat, and if nobody took it put your stuff back. so in the end yes YTA", "YTA. The etiquette in this situation is to notice when the seats are being taken up and to do what you can to offer that seat. Bags on the floor, bags under your seat, bags in your lap - there are ways to clear the seat so that someone could sit down.\n\nMore generally, don't assume that passengers or other people wouldn't want something. For the second seat, the second helping, and the last soda, the courteous answer is often to *offer* and give people the right of refusal, not to assume someone would ask if they did want or need it.\n\nThat person's frustration at you was understandable. You were doing the equivalent of manspreading. Someone shouldn't have to ask you to take up one seat rather than two.", "OP, Perhaps consider getting one of these. It’s a shopping cart. Also YTA. \n\n https://www.amazon.com/Folding-Shopping-Removable-Waterproof-Telescoping/dp/B0BBYNSH94/ref=mp_s_a_1_8?crid=1CD7XBXW0UZGV&keywords=shopping+cart&qid=1684248910&sprefix=shopping+%2Caps%2C210&sr=8-8", "The person that spoke to you was trying to teach you how you should have been behaving, on your own, without being asked.  Had they instead just asked you to move your bag earlier, you might still be under the impression that you can give your bag a seat until someone asks you to move it.\n\nI have been on the receiving end of these comments.  Looking back, I correctly understand that I was TA. I am grateful that someone told me directly, so I can choose to behave better in the future. \n\nYou were TA, and now you know how not to be TA going forward.", "YTA I don't understand why would this even be a question. People do not have to ask of you (like moving your bag in a crowded bus for someone else to sit in) before you do stuff. Jesus.", "> In my experience most people don’t want to sit next to strangers. \n\nWow. YTA 100%. I regularly take up two spots but the moment the bus starts to fill up is where a human takes priority over your bags.", "YTA. It’s an unwritten rule. When the bus gets crowded, you need to move your bag. You don’t wait till someone asks you to move your stuff so they can sit. Read the room!", "YTA. If people are standing it's because they need seats. And often people are reluctant to ask because it can lead to a scene and it's just not worth it. During Covid people wanted to stand rather than sit next to others, but that's not really the case now. \n\nYou didn't pay for two seats. Next time the bus is crowded, move your stuff.", "‘If they did I PROBABLY would have’\n\nYTA", "I want to know where everyone voting y t a lives?  I would only think of moving without being asked if it was a old person or I was in a handicap seat.\n\nI would never expect someone to look at me, read my mind and move their bags so I could sit?\n\nOP you are NTA, I doubt anyone who thinks so has ever ridden a bus more than once.", "YTA. You were fine until the bus started to fill up. Your justifications, heavy bags, and strangers not wanting to sit next to others, are bogus. Your bags can sit on the floor and your lap like everyone else’s. Plenty of strangers were sitting next to each other on that very bus, I’m sure. \n\nYou should be thankful that someone called you out so that you have the opportunity to do the right thing from now on.", "I've been in a similar situation when I was in college but it was a backpack rather than shopping bags and I decided it was better to put my backpack on a seat while I stand precisely to avoid using 2 seats\n\nYTA, there are ways to not be an asshole, just use your brain.", "NAH 🤦🏾‍♀️. If the person who felt the need to make that comment wanted to sit so badly they should have used their words and asked you to simply move your bags instead of just standing there. \n\nYes, you could have moved your bags when you saw the bus was full or filling up but you stated the bags barely fit in front of your legs even if you did put them on the floor both you and whoever sat next to you probably would have been uncomfortable assuming it was a number of bags and not just one or two. \n\nThe vast majority who are saying y t a are blowing it out of proportion and are acting as if you purposefully put your bags there so no one could sit next to you or that the person asked you to move your bags and you just ignored them.", "NTA. If it was an old/disabled person or a pregnant woman then I'd move my bags and make do with having to figure out how to fit them on my lap. But if I have heavy grocery bags and there isn't anyone aching for a seat, I'm keeping that seat. Other people would do the same in my experience when I used to ride a crowded bus every day.", "YTA - you should know that once the bus/train gets crowded, you move your stuff so people can sit down.  No one should have to ask you.", "YTA YTA YTA. Some people are afraid of conflict so they may have not wanted to say something, but surely deserved the seat more than your BAGS. Only acceptable time to place bags on the seat is when there is ample seating available", "YTA\n\nMove your stuff! No one should have to tell you this.", "I’m gonna say NTA. In the uk most people will take up two seats regardless of having a bag or not (if they don’t have a bag they sit on the outer seat to avoid people sitting with them) and you only moved if asked unless someone is elderly disabled or pregnant. So what op did seems like perfectly normal behavior.", "NTA Are people incapable of asking to sit?? I'd usually offer if it's a old person or a parent with a kid but that's it. Even if you got up and put you bags in your seat and let someone else sit, someone still gonna complain about the bags taking a seat. Then you'd have bags all over the floor and people complaining about them being in the way. It's a crowded bus, theres always gonna be a issue.", "NTA - don’t listen to all of these insane people. You are not an asshole for leaving the bags. If someone asked and you didn’t move them you’d be more of an asshole.", "**YTA**. Long-time public transport user here. Sometimes people just want to sit down and not have to ask you to move your shit. Just move your fucking bags to your lap or to the floor. It won't kill you but it might make a tired commuter feel better.", "YTA and bigly at that\n\nI'm sure this is a repeat of pretty much everyone else but here goes.\n\nWhen the seat is uneeded because of lack of people it is just fine to use it as storage, I've done it a billion times.\n\nWhen the bus is full to the point that the seat is needed you put your bag on the floor or on your lap. I've also done this a billion times before.\n\nTo do anything other is to say, \"Your discomfort and inconvenience is unimportant because I am the only one who counts.\"\n\nIt really isn't hard.\n\nDid I mention YTA?", "YTA. Regardless of if no one said anything or you “getting on first,” you should have the social awareness to see people standing and move your bag. Even if you think “people don’t want to sit next to a stranger,” people don’t want to stand on a long bus ride either. You are in public and must act as such. You were insanely rude for not moving your bag. I’m also confused if this was one bag or multiple as you and the person who mentioned it refer to it as “bag” insinuating it was a single bag that could have fit in your lap, making you even more so TA. Sounds like you just didn’t want to sit next to strangers.", "NTA - I see I’m in the minority here, but I’m with you… it sounds like you had a bunch of stuff that wouldn’t fit in your lap. Even if someone had asked, where would you put it? \n\nI believe you would’ve tried, but if you believed there was no where else to put it, it makes sense you wouldn’t have offered.\n\nBut this is me speaking as a person who hasn’t used public transit for years and when I did… it was a very short time. \n\nEither way, don’t be too hard on yourself. The fact that you wrote this shows your intention. Even if it makes yta, you didn’t mean to. Just be mindful in the future.", "Might be a cultural difference on my side, but NTA \n\nSure, you might have offered someone the seat, but the others were more than free to ask for it.\n\n\nIt's classic aita subreddit mentality, but it's actually shocking how many people here are blowing this out of proportion, as if you beat someone to death with those shopping bags.\n\nIt's the passive-aggressive person's fault they didn't ask the seat they obviously wanted. Instead, they decided to be snarky by the very end of the trip, which was totally counterproductive and useless. \n\nWere you a totally nice generous person in this situation? No, but it's not the end of the world.. it happens, we're human, just move on lol", ">someone passive aggressively told me \"you could have moved your bag and not been inconsiderate and rude. Everyone wants to sit not just you.\" Or something along those lines. I didn't really respond because I didn't know what to say. \n\n>The person who said that never asked me to move my stuff, and if they did I probably would have\n\nYou ✌🏽 probably ✌🏽 would have moved your bags?\n\nOh, you are most certainly the AH.\n\nEdit: I forgot to add YTA to make sure the vote is counted. YTA OP!", "NTA as a Norwegian, the bus is generally people sitting alone, and people standing. \nI don't find it rude to have you bag there at all, if people wanted to sit, they can ask you to move the bags, if you then refused and was a b then it would be a different story.\n\nBut this is exactly why I love Scandinavian countries, we sit alone 99% of the time and people rather stand then sit next to strangers.", ">So I sat in one seat and placed my bags on the seat next to me, essentially taking up 2 seats on my own. Since it wasn't crowded when I got on I didn't see an issue and like I said the bags were super heavy and hurt to carry so I wanted to set them down.\n\nThat's OK as long as there aren't people standing over you and your bags on the seat.\n\nBut you\n\n>The bus ride was kind of long and as it went on more and more people got on the bus. It eventually got pretty crowded to the point where some people had to stand up.\r  \n\r  \nI didn't ever move my bag or offer the seat to someone. In my experience most people don't want to sit next to strangers anyway and a lot of the time people will end up standing instead of sitting in an empty seat next to someone they don't know. Also no one said anything to me.\n\nYou aren't obliged to hawk around to vacant your seat if there is anyone in greater need of seating, like elderly person or injured or pregnant or whatever. But it is what making you YTA when you don't vacant the seat you take with your things not your ass when there are people standing over you.\n\nSeats are for asses not things.\n\nYou were incredibly rude and selfish.", "It's a learning experience. You should have instinctively moved your bags when it got crowded but coming from your own experience you didn't think it was necessary. In this situation YTA but you live and learn, don't beat yourself up about it and do better next time :)", "a little ESH.\n\nyeah, it's polite to move your bags voluntarily when a bus gets crowded. sure people would rather sit alone but they'd rather have a seat.\n\nthat said- presumably they're adults, they can say \"can you move your bags?\" or the ever useful 'just point' to the seat with the bags on it. \n\n(The only time I've ever not been expected on a bus to move a bag was when it had a cake in it. Cake is apparently the only acceptable excuse.)", "Babe, were you raised by wolves?", "NTA nobody asked you to move it. you are under no obligation to move stuff without being prompted.", "NTA.  Not your problem that a bunch of folks got on later.  They have no merit or consideration if they weren't there at the start.  Sorry, not how the real world works.  You are not automatically deserved of all whims and considerations because you exist in a spot that others held before.  Improvise, Adapt, Overcome.  Or complain about it, but that still doesn't change you're still gonna be standing and complaining.  :)\n\nMight as well save all that complaining energy for that terrible inconvenience of standing energy.  That's where you end up regardless.", "NAH. Everyone is this thread is getting high and mighty as if they are paragons of public politeness. If no one asks you to move your bags then who cares. No one is gonna die standing up on a bus for a little while. Would it be nice of you to move them without being asked? Sure. Not doing it doesn’t make you an asshole.", "Yta.  The person was trying to help you be a better person, not passive aggressive..", "Idk if its just my town but my busses can either be really empty or super full and no one ever expects anyone to move their bags if theyre next to them on a seat.. is this really a thing? If so, most people on the bus are assholes lol I have no judgment on this one", "INFO: were there other empty seats or did every other seat have someone sitting in it?", "NTA. As someone who doesn't like strangers and would prefer not to potentially get assaulted on a bus I set my bags next to me all the time. All these YTA answers seem way out of proportion. People will still willingly stand sometimes when there's a plethora of open seats. If someone's struggling to stand sure maybe open up the seat but no one said anything and you didn't see anyone who could use a spot more than you i.e. kids, pregnant women, seniors.", "NTA. If you want something, you speak up. People are so fucking entitled, it’s disgusting. Like you said, it’s not like you refused your seat to anyone who asked. But the person was busy judging you without understanding your situation or even asking if you could move your bags so they could sit. I wouldn’t take it too personally or seriously. People expect that you should automatically offer seats to others standing when, in fact, they may prefer to stand. Even a pregnant woman or injured person would’ve asked to sit on the empty seat.", "Looks like I'm going against the grain here but NTA.  \n\n\nWomen are automatically by default expected to take up less space. If we're using public transport and don't put something down to keep strangers from sitting next to us, we end up with creeps next to us. Also I'm sure your bags had nothing on the people coming in with strollers and diaper bags and full on stretching out in a handicapped area of the bus.  \n\n\nThe people saying YTA have never ridden public transportation. If someone is insistent I move my shit so someone can sit down, I will but I won't volunteer it up unless it's like a little old lady. I use public transportation to get from my little town to the city and it's an hour and half ride one way because of all the stops. One of the stops is picking people up from the county jail and the other two major stops before I can get off are the community college and the university. I'm not sharing my space with sweaty college boys getting out of sports or people who just swaggered out of the drunk tank if I don't have to.", "I'm shocked at the responses here. It's a similar situation to one from yesterday, and the reactions were completely opposite. Yesterday, the OP was passive aggressive to someone in a public pool who didn't move out of the way and everyone said OP was the AH because they could've just asked the person to move before getting passive aggressive.\n\nNow, in this situation, everybody is saying the passive aggressive person was in the right, and the person who didn't move is the AH? \n\nI say NTA. I wouldn't have specifically offered to move my things, but if someone had kindly asked me to, I absolutely would have. All that person had to do was ask but instead, they decided to be rude and snarky. OP didn't know they were even bothered by it until the person was rude about it.", "I wanna say NTA.\n\nYou are an adult, was it rude? Yes. Was it inconsiderate? Also, yes. Was it necessarily you being an asshole? Not really.\n\nEveryone lives in their own bubble, whether conscious or not. Well over 90% of situations I've been in my life were easily resolved by just asking or vocalizing my needs or desires. \n\nHowever, that's just my $1.98 on the matter.", "NTA, closed mouths don’t get fed. If you want to sit just ask. Most people don’t mind moving their stuff but like the OP said it was heavy and wouldn’t fit in front of her legs easily. She would have if someone asked and OP is not obligated to accommodate others in public transport.", "NTA-Someone could've asked you to move the bag.", "ESH. \n\nYou’re young, so lll give u the benefit of the doubt and assume ur new to riding the bus … \nonce the bus started to fill up u move ur bags, u don’t sit there and watch everyone else stand. \n\nBut also, I would have “asked” u if I could sit there. And Im surprised no one else close to u did. That person had nerve enough to say something when u got off the bus but stood there the whole bus ride and didn’t say a thing? Way to play themselves lol. If u don’t have nerve enough to say something to me while I’m on the bus then don’t say shit when I’m getting off. That’s how I feel. If I had stood on a long bus ride and didn’t say anything to avail myself of a free seat but then said something to the teenager as soon as they were exiting bus, I’d feel like a different type of asshole. \n\nEveryone’s an asshole!", "Yeah it's first come first serve, but for people, not bags\n\nYTA, sorry", "NTA", "Massively obvious YTA, woman-spreading on a full bus is annoying af", "ESH. Dude should have said something before you were getting off the bus and you should have moved your things when the bus got full.", "Soft YTA.  But honestly, anyone could have asked you to move your bag, and it sounds like you would have had no problem with doing so.\n\n *In my experience most people don't want to sit next to strangers anyway*\n\nThat's a cheap cop-out.  Most people would rather sit next to a stranger than ride standing.", "Lol so many YTA here. I'd say NTA. I agree with you, if people wanna sit next to me, grow up and ask me politely. Problem solved.", "ESA. \n\nSure, you could have instinctively just moved your bag. And sure that would have been the considerate thing to do. But, anyone could have just as easily asked you to if they could sit down. \n\nYou suck for not moving your bag without being asked. the people that make passive aggressive comments, they suck even more. Say something when you get on or say nothing. They don’t need to be a prick about it.", "NTA, shit happens. \n\nYou can't read anyone's mind.", "YTA Your behavior is unfortunately \"normal\" but that doesn't make it right. Of course what you did was rude. When people think about others it really does make the world a better place.", "Until the point it was stopping people from sitting, NTA\n\nAs soon as that point flipped and your bags were preventing people sitting then YTA.\n\nI'm in the UK and commute by train, I'm am absolute fucker for making people move their bags so I can sit. I don't pay money to stand when the bags haven't got a ticket. For reference I always aim for people like you too, those who don't want to move their bags. Makes it even more fun then.", "I’m not going to call you TA for what you did, because I’ve been there, but you should’ve at least tried to move your bags. I’m also in the US and in my experience, people are more likely to be understanding if they SEE what the issue is. To them, you looked like an ahole for not giving the seat up. To you, you were struggling with them and  this was possibly the best you could do. Be more mindful in the future. It’ll be better for you", "If it happens again just say 'next time, just ask, I'd have happily moved them for you🙂'", "Yeah, like, I rode the bus from when I was 18 until I was 35, including buying groceries for two people, so yeah, I'd use an empty seat next to me for my bags, but once the bus is really filling up, you put your shit on your lap.", "Agree. Also she says that if they had asked she “probably” would have moved her bags - selfish!", "But also consider - does this happen a lot OP? Because you definitely were being communicated with non verbally. Do you struggle to notice these cues?", "Agreed, and it's not even courtesy. One ticket, ONE SEAT. You are not entitled to two. \n\nYTA.", "I give it ESH because OP should have moved their stuff to free up the seat, but also that person was being a dick by criticizing them about it only after the whole situation was over.", "Especially here in the South (US). We get offended if someone puts us in the position of \\*having\\* to ask. \n\nI will stand for several minutes in the grocery store, waiting for someone to move out of my way, rather than say, \"excuse me\".  If it goes on long enough and I have to say \"excuse me\", then I am mad because they \"made\" me be \"rude\". No, it is not logical, but this is how we were trained, growing up.\n\nI am trying to unlearn this, but that childhood conditioning goes deep!\n\nOP knows she was wrong or she wouldn't have justified using 2 seats by describing how many seats were available at the beginning.\n\nYou messed up, forgive yourself, plan to do better next time, and move on. Everyone makes mistakes. It's only a big deal if you refuse to learn and change.", "Agreed. When she did it initially it was fine since it wasn’t crowded but when it started to fill up it should’ve been her first instinct to move the bags rather than just wait around for someone to ask", ">You don't wait for someone to \"ASK\" you to do the right thing.\n\nPerfectly stated.  I'd be interested to see how she'd respond if the roles were reversed and she boarded a packed bus, tired with her heavy bags, and a rider didn't move their belongings so that she could sit...\n\nYTA", "This right here. OP is so selfish it’s just gross.", "Hey if someone asked, she PROBABLY would have moved it.", "This should be the motto of the sub, and of life in general.", "Amen!", "Yep and OP actually gives away that she knows this by clearly stating that when she first put the bags on the seat, there were extra seats. \n\nShe switched from “there’s extra seats so this is ok” (which is reasonable) to “people don’t want to sit by a stranger” (which is unreasonable and a rationalization for selfish behavior).", "Yeah, the other passenger was spot on. Once the free seats fill up, you move your stuff. It’s not rocket science.", "I used to bus to and from work, and the bus was often busy in the evening when I finished. I vividly remember one time nearing Xmas, I'd been working outside all day for 12 hours, freezing cold. Got on the bus and at the very front was a guy with bags full of Xmas presents in the seat next to him. I asked him if I could sit and he deliberately turned his face to look out the window and ignored me.\n\nI hate confrontation and honestly I was too exhausted to put up a fight, so I just stood for the 40 minutes it took to get home.", "Yes, the problem with this interaction is that if you see someone like OP who is taking double space despite noticing the bus is full, you already know that you're going to be interacting with an AH, so the chance of an unpleasant experience goes way up.", "This! *You know what’s more comfortable than sitting next to a stranger? Confronting a stranger that is clearly going out of their way to be rude and inconsiderate to others.* YTA, OP.", "It sounds like they also need a good reusable bag/tote, it’s easier to move than a bunch of shopping bags, feels lighter, and, if we’re talking plastic grocery bags, will be more comfortable and secure. \n\nLike, I can kind of get not wanting to put plastic grocery bags down, but OP should have given up one of their 2 seats once it got crowded.", "yeaaaaah that line rubbed me the wrong way too\n\nif you're a snot about sitting next to strangers you prob aren't on the bus", "That really got me 🤣 PROBABLY", "I am so happy that this is the top comment. With my mild-ish social anxiety I will never ask someone to move their bag. And it is very common for me to walk the train corridor looking for a seat and seen 5-10 people with bags next to them to block neighbours", "YTA- once people have to stand it’s just polite to move your bags so people can choose to sit. Put your bags in your lap if you don’t have room in front of your feet. Do you really not understand that that’s the proper way to do things? It’s just being polite and considerate of other people.", "And judging by this post, she seems like she'd be the type to roll her eyes and huff if someone did end up asking  for the seat.", "I take the train to work and will put my bag next to me until it starts filling up. Always give people the option to sit without having to ask you to move your items. \n\nAlso, off topic but huge pet peeve: no matter how empty the bus or train is, keep your feet off the seats. No one wants to sit on a seat your nasty shoes were on.", "Whenever I take the bus or train and there's either the option for an open seat immediately next to someone or asking someone else to move their bag, I always ask them to move their bag.\n\nThey know what their doing and putting their bag there to deter other people from having a seat. It's just rude.\n\nSo now you can move your bag.\n\nOP YTA", "YTA - They shouldn't have to ask you. Common courtesy is amazing when applied in everyday life.", "The phrase 'brought up in a barn' seems to apply here.", "I would have asked her to move her stuff. And if the bus was full, I wouldn't have been nice about it.", "> In my experience most people don't want to sit next to strangers anyway and a lot of the time people will end up standing instead of sitting in an empty seat next to someone they don't know.\n\nWHAT THE ACTUAL F?\n\n> Busses are also generally first come first serve so I think my behavior was normal.\n\nYeah, for your ass, not for your bags.\n\nYTA", "Yeah it was chill until you were like and then the bus was full and I didn’t move my bags lol", "Or on the floor. Wtf. The thing that drove that so far into the asshole territory for me is “most people prefer not to sit with strangers anyway”, ma’am are you out of your mind? Clearly the bus was full and everyone else was sitting next to a stranger just fine", ">move your bags to your lap\n\nBut you don't understand, they were HEAVY!", "Preach! Plus the whole 'I'm on a bus and can't afford a car so it's okay' while ignoring the fact that everyone else on the bus is probably in a similar position!", "I WISH nobody was dense, but I see this all the time, people will put their feet (bleh) on the seat next to them and sit sideways, and if you ask them for the seat they usually say some variation of \"but I was here first\" or \"first come first serve\".  I've stopped bothering to ask when I see that because if someone is going to take up 2 seats on a crowded bus the odds of them letting you sit down \"just by asking nicely!\" is so low.\n\nThe worst time, someone just had one foot propped up on the seat, in the disabled chairs up front, and I was coming from an ophthalmologist with dilated pupils + sunglasses and could barely see or stand, super crowded. I sat down on the rest of the seat where her foot wasn't and she spent the whole ride screaming at me for touching her foot, and that that she was using that seat. Which triggered some guy to start yelling at her for taking up 2 seats and harassing a blind person (lol) and he went way too far, so some other woman started yelling at him for yelling at a teenager girl. I just tried to sit there with the blankest expression possible and say nothing until my stop.  Crowded busses are terrible because some % of people are assholes, so even if most people are fine, there's always gonna be 1 asshole and the trick is to hope you don't run into them that ride.", "100% Troll", "Happy Cake Day manofmatt!", ">You created the perception that you were rude and inconsiderate\n\nThat perception was correct.", "Are there overhead racks on the bus?  Not on ones I’ve been on.  If it’s not reasonably possible to fit the bags on your lap, they’re going to take up a seat.  That’s just reality.", "Yeah some of the comments are just downright nasty. \n\nI’m so used to there being no seating on the bus, and if I’m able to stand, I hold no malice towards those double seating with bulky cargo.", "I was just about to comment a lot of people in the top comments are responding to her like she killed someone😭 Yes she’s TA and should have moved her bags, but it’s a live and learn bus etiquette situation, she’s not the fourth horseman of the apocalypse lmfao", "I agree... The rage in the comments does not seem proportionate to the situation, and some are saying pretty nasty things :(", "Yeah like me personally I’d rather just stand than sit thigh to thigh with a stranger. Depends how long the bus ride was though but I’m assuming it was just inner city transportation and not a long distance bus", "Right?? I don’t understand why people are so vitriolic when it’s obvious she just made a mistake. Yeah she fucked up but as long as she learns from it it’s fine", "I can’t believe I had to scroll this far down to find a reasonable comment! What OP did was inconsiderate, but people are acting like they committed some sort of war crime", "Agreed!", "For real... I take public transportation and while it's annoying when someone blocks a seat, I've never been this aggressive in my annoyance. \n\nI also think passive aggressiveness is an immature way to handle any situation so I don't think that stranger gets a pass either.", "It’s Reddit. People always think they’re better than others and have to express their disgust.   It’s a reason I hate being on here. But yet here I am.", "Yeah I agree. Talk about self entitled.. yeah it's not courteous but it doesn't make you an asshole, it's not like she refused or insulted them for asking for the seat, because nobody did", "I think ESH but with a caveat that the rando who scolded her did a good thing, even if it was shitty. \n\nIf the person was polite about it, she may not have had any self reflection on this or asked people what they think on the matter (I don’t think she’s the atrocious AH people are making her out to be, but what she did was selfish as she couldn’t be bothered to show people the kindness of moving her bags).\n\nBecause the rando was also rude about it, she has asked the internet their thoughts and the majority think she’s the AH. I think she would not repeat the behavior now. So while it’s not a fun encounter and of course that person could have asked her to move her bags when it got busy, this may be the best outcome for the greatest learning and self reflection on her part. She clearly isn’t so much of an AH that she took time to wonder if she even was one. Real AHs don’t give a damn.\n\nSomeone could let that rando know though that they can use their words and ask people to move their bags. That person could still learn things too.", "It’s literally the same thing as being described.", "Same here. Having a bag on the other seat until asked is completely normal and acceptable behavior here. Maybe it's different in other countries. But I was honestly surprised at all the Y-T-A votes. Without knowing more I'd have voted NTA as well", "I go by bus to school, sometimes it gets crowded. I usually have my bag in my knees or by my feet, and even when ut is crowded it almost never happens that anyone sits next to me. I have got asked, I say sure when that happens. So I vote for NTA, if they wanted a seat, OPEN YOU MOUTH and say it.", ">Unless there was someone in distress (disabled, pregnant, carrying a small child), keeping your shopping load on a seat is a better solution than even partially obstructing the aisle trying to keep it between your feet.\n\nYou can't always tell if someone is \"in distress\" it took me about a year to get a major back surgery I needed and I could stand without significant pain for a max of about 3 minutes but you wouldn't have been able to tell looking at me.", "It's common sense, I'm 16 and understand that it's rude to take up two seats in public transport snd force people to stand", "I feel like that is the kind of thing you learn in kindergarten when everyone sits at the table and you color with crayons.", "19? Really? I had two jobs at 16 and at 19 she can’t figure out how to coexist on a bus? She’s an adult. She can figure out how to ride a bus.", "Are you confusing 19 with 9? Because I knew this stuff when I was 9 and so did basically everyone I’ve ever met. I was regularly getting the bus at 18 (and I’m autistic and have adhd, I am awful at etiquette and social cues) and I knew that it would be an asshole move to put my bag on a seat when the bus was full and personally force someone to stand for literally no reason.", "And what country is that?", "I don’t even look at it as “bus etiquette”. I look at it as “human being etiquette”. No one should have to ask someone to move their stuff so they can sit down. OP could obviously see other people needed that seat but didn’t care. Also, if someone is inconsiderate enough to leave their stuff occupying a seat when people were standing, why would someone think that asking them to move it would make a difference? If they wanted to be courteous, they would’ve done it already. This post flys all over me. You’re not the center of the universe - it’s not all about you. YTA 100%", "One of the things I’m a little irrationally proud of is how quickly I can get my daughters stroller folded and stowed while entering the bus. When you know you’re taking public transit, you need to plan what you’re going to bring and how it’s going to fit ahead of time.", "People acting like OP made my transit authority put a cap on how many grocery bags you could carry on the bus. It sucked and it really felt like it was punishing poor people, but you can't take up three or four seats with your shopping!", "Yeah I've been in this exact scenario many times. Bus fills up, bags go on my lap. I've survived every time.", "aw calm down buddy :)", "Oh man, I'm glad to hear that I'm not the only one who was raised to just stand kinda close to the person and \"patiently\" wait for them to move. It took me until my late 20's to get out of it and now people get an \"excuse me\" and I continue to where I'm going.", "Not a “mistake”. A choice", "\"If he had just *asked* me to stop firing my pistol at him, I would have stopped immediately!\"", "“People don’t want to sit by a stranger” really meant “I don’t want a stranger to sit by me”", "Yup, this. I'd glare at OP, but wouldn't likely say anything. I have asked in an innocent-sounding voice \"is that seat taken?\" , though if im right next to the seat. Forcing the person to answer no or truly be an AH.", "Yes. If I see someone taking up 2 seats on a crowded bus, I automatically think that they just don’t care and they feel superior to others. That is not a person I want to communicate with because I’m sure if I asked, I’d get an annoyed dirty look from them… if not worse", "Also she only said “probably” would have! Eeesh.", "Didn't even pay for one seat.  Seats are a privilege, not a right (unless you are elderly, pregnant or disabled), and seats are for butts, not bags. YTA.", "Not to mention, someone standing in the aisle may have had a disability and could have been in pain or felt unsteady.", "Yeah.  I've ridden enough city busses to know it's a lottery to who your riding partner for the day is.  Weird Al even wrote a song about it.", "It's weird to sit next to a stranger *if there are other empty seats*, which is why it's creepy when the bus is empty and someone plops down next to you anyway. But when the bus is full, it's just life.", "Yeah, i agree, fine if there are other open seats, do whatever you want with your bags. But saying “there were no other open seats, but people prefer  not to sit with strangers anyway” is olympic level mental gymnastics", "Yeah this post was a wild ride for me, at first I thought it was gonna be OP experiencing fatphobia from someone, then saw the bags thing, thought some creep might get involved, then a wild turnaround when OP admits the bus got full and she still didn’t move her bags (decrepit behaviour). Like a good ol’ Reddit whiplash", "I had to take public transport for 4 years during high school. Schoolbus isn't a thing here.\n\nIt's simple, you have a big bag in a full bus?\n\nYou either put it on your lap or rest your feet on it.\n\nIt isn't difficult", "Same lol, I can’t fathom not knowing basic bus etiquette and basic human decency of a human taking precedence over your damn shopping. Wth, OP??? YTA, obviously.", "Nah cause imagine going home from an 8 hour shift where you had to stand all day and some dumbass on the bus wouldn’t move their bags .. most people are too shy to tell someone to move their bags .. it’s common sense to move them when you see the bus getting fuller", "Yup. YTA. Sounds like you should get a little folding cart for your shopping trips.", "If you would rather stand, why aren't you standing?    That part made no sense other than as an ad hoc rationalization of her being TA.", "If you'd rather stand, leave your bags on the seat and stand beside them.  Two birds one stone.  Otherwise you're just a dick.", "My thoughts exactly.", "That’s what I thought! Turns out OP is a knob!", "Same here. There's been countless times I've put my bag on the seat next to me and creepy older men got mad that I wouldn't move it for them to sit when there are tons of other seats. Once I started to think I was the problem but then came back to my senses that this wouldn't happen if I was a man.", "Yeah. This.", "It's neat that we finally get the viewpoint of someone who won't move their bags on a full bus. There's always \"What's going through their head?\"\n\nKinda nice to see it's not malice, or someone trying to use a fake/overblown \"fear of strangers\". It's a mix of selfishness, ignorance, and lack of situational awareness. It's not a great thing, but I'd still rather be surrounded by dummies than assholes.", ">YOU might rather stand \n\nshe's taking two fucking seats.  she ain't the standing type.", "No no, if someone had asked her to move her stuff she PROBABLY would have! You’re a real peach, OP.", ">The person who said that never asked me to move my stuff, and if they did I probably would have.\n\n*Probably* would have. If that did happen she would be on Reddit posting, \"AITA for rolling my eyes when someone asked to move my bag?\"\n\nYes OP, YTA in every scenario.", "100%", "This is silly. Obviously can't speak for everyone, but when I have used an empty seat on transit for my stuff it has been to more easily transport my things - not to save  a seat. I move my bags if necessary. \n\nI've been squished enough times on public transport to not expect a lot of personal space.", "barnyard animals have better social skills than OP.", "Yeah, you're on a damn bus!", ">most people prefer not to sit with strangers anyway\n\nBy \"most people\" OP means herself.", "Thanks gangsta_seal, which is an excellent username.", "I’m in the UK and I get asked all the time, and I ask others sometimes. Maybe the US is different?", "This does seem like a cultural difference. Because, yeah, also from Germany and it's the same for me. Depending on how comfortably I can move my stuff (because there often really isn't much space) I move it out of the way without someone asking. But sooo often when I do that people still don't sit next to me (or other strangers doing that) which makes it pointless for me.", "Thought I was going crazy for thinking this lol, glad there are people who agree", "If someone wanted the seat they could have used their words and asked her to move the bags", "And during that whole time you never made *any social mistakes at all*? Pull the other one.", "I really don't like people who think like \"I'm going to be inconvenient and the onus is on everyone else for not asking me to stop being inconvenient\"", "Ours does not but they will just pass you by if the bus is busy and you have a lot of bags. I was on a busy bus yesterday with groceries and an elderly woman offered me her seat so I didn't have to stand with them (it shamed a man sitting next to her into moving) meanwhile OP is taking up 2 seats", "I’ll raise you to $11", "Ha, I keep seeing people saying “I wish I had an award, please take this” and someone takes them quite literally, and gives the wisher an award 😂", "i have no problem doing this with people but unfortunately when it comes to my cats i am a perennial hostage. \n\nunless i am literally on the verge of peeing myself, i'm completely incapable of getting a cat off my lap. i have stood in doorways holding grocery bags waiting for one of my cats to move. ^i ^need ^help", "Right. I’ve had to learn to voice what I need or want before I’m upset about someone else not figuring it out. OP is still AH for not moving her bags", "I’m from NYC, Manhattan specifically. You have 3 seconds before I say excuse me and 4 seconds before I push thru. Anything longer than that you’ve drawn the irate of other New Yorkers and it’s best to keep moving. :)", "Mistake:  an action or judgment that is misguided or wrong. \n\nA choice can be a mistake.", "I *probably* would have", "this. i’m disabled and i don’t look it and as much as i would have needed to sit down, i probably wouldn’t have had the courage to ask op to move their bag. YTA.", "Yep, I've got fibromyalgia & there have been occasions where I'd just have sat on top of someone's shopping.\n\nLuckily here thete's quite a strong etiquette on buses & passengers would \"get them telt\"! 🤣", "Or just been tired after a long day of work.", "yeah, simple as.\n\none person to a “row” until all rows are full unless you’re with a mate, then sit together.\n\nif all rows are full, move your stuff so someone has the option to sit or stand", "Total wild ride! I 100% thought it was going to be some grody old man wanting to sit next to a pretty young woman and asking her to move her stuff when other seats are clearly available. Crazy how fast I switched from totally on her side to ‘omg how do you not know how to live in a society you ketchup sandwich’.", "Same! I rode that same wild ride! Fatphobia, to a creep and then, just a YTA. Lol", "I was thinking fatphobia too.", "Exactly! I rode a bus also for about 4 years through uni, yes having bags on the bus sucks, no you don’t get to make it everyone else’s problem. It goes under your feet, between your legs or on your lap in a seat, end of.", "Don't do that either!!! Seats are for your ASS! as a full time bus rider is you aren't sitting in the seat GTFO and let someone else sit there. That is just as rude a taking two seats to yourself.", "That’s still kind of a dick move if the bus is crowded. Seats are for people first not bags", "Or put the bags on the floor like a normal person. She had 2 bags, not 17.", "You’re still taking up two spots. Don’t do this. Move your bags.", "That’s what I would do.  Stand in front of my bags so that I don’t have to carry the weight on my shoulders.", "No, if there aren’t enough seats for everyone to sit, then bags don’t belong on any seats.", "Hard disagree, this advice is still a dick move. \nIf you’re sitting, your bags go in your lap or on the floor between your feet. If you’re standing, bags go on the floor. Between your feet if you’re worried about them ‘spilling’.", "That part got me", "The probably had me laughing out loud.", "Oh I missed that little ditty. It gets even better.", "Probably yeah", "No, I'm in Boston and would not hesitate to ask someone to move their bag. Or tell them if they are doing the intent stare out the window/wearing headphones combo where they can pretend they don't see/hear you.", "The US is different. Here, people get shot for inadvertently knocking on the wrong door. We’ve had more mass shootings than days in 2023. I didn’t say more shootings. More MASS shootings. It’s literally a war zone here and provoking a stranger, no matter how slightly, has a high chance of ending with you being shot.", "BIG difference between a social mistake and common sense.. don’t be ignorant.", "Didn’t you read it, they were heavy! I agree with you. I guarantee that if she was looking for a seat she’d be upset.", "The award they were given grants them coins with which they can buy awards :)", "The dumbing down of awards. Like high school grades", "I'm am guilty of getting trapped with the cat on the lap and have stood still and waited for her to casually move as well 😅", "Help? What? You don't need help, you are merely following The Law", "Oh I 100% agree that OP is the AH but someone brought up a good point that I hadn't considered as far as her possibly honestly not knowing better. She's only 19 so depending on how long she's been using public transportation, she may have began using it during covid restrictions and took that to be normal bus etiquette only because she's never known of anything else. Just a theory.", "Yep. Sometimes people have prosthetic limbs that are not obvious too. It’s good to be mindful.", "I was raised that if I'm sitting in a crowded bus and see someone disabled, elderly or pregnant I get up.", "Idk how the busses are where you are from.\n\nBut in the middle next to the door we have a small open space for Strollers or people who are wheelchair bound. They are often emty.\n\nAnd have 2 foldout chairs or a small bench.\n\nIf you have a big bag or a suitcase people usually sit there.\n\nIt's like she's never been on a bus", "Right? I ride the bus all the time. If your bag didn't pay for fare, it doesn't get a seat. Move. Your. Shit.", "Not really. Heavy bags are much easier to lift from a seat than from the floor, or than a hold in your hands during a bus ride. It would be fine to take up a seat with bags. Just don't take two", "If they don't use a seat but put thier bags on one I wouldn't mind that. Better then bags being in the walkway. It's thier seat that they can use however they want.", "You realize the alternative is them sitting in the seat right?", "Okay, would you rather the bags be neatly in one seat, or on the floor blocking more space?  If you don't have a spot to put them, those groceries/purchases still need to exist and standing over them is awkward and a tripping hazard", "Technically the seat is either going to be taken with her sitting on it OR taken with the bags so it's pretty much a wash since the seat isn't going to be available for another rider either way.", "Explain to me a way where you aren't taking up two spots.  If you have large cumbersome bags, where do they go?", "Am from US, work with transit across the country. Can confirm. We don't ask for anything on transit.", "Even better!", "I was given a few awards recently and my coins never went up, lol", "are you also a contortionist in your bed to allow the kitties to sleep where they want? at one point, it was my husband & i in a full size bed with SIX cats splayed out in every direction imaginable. and all our cats have always been BIIIIIG cats. i think at that point he & i had access to *MAYBE* 30% of the bed. now i have a king size bed and my husband died a few years ago & i've only got 2 cats at this point but every single night one of them lays across my shoulder/arm/face while the other one lays on my chest with his butt facing me, swatting me with his tail all night long. i've tried keeping them out of the bedroom on nights i really feel i need to sleep ALONE but that only leads to them crying outside the bedroom door all night. i am so outmatched here it's ridiculous.", "you were raised right! the issue for me is that my disability isn’t visible from the outside so that’s the issue. but that’s neither here nor there with this post haha.", "Okay, but the person carrying them did.  If someone gives up the seat so they have an easier time with their luggage, then I have no problem with it.  It's also easy better than it spilling out on the floor in a crowded bus.", "But if they paid for a seat, then they can use the seat. It allows them to set their stuff down and stand so that only one seat is taken… I don’t see a problem with how that one seat is used.", "I usually only take the bus to work and my bus is pretty empty so I’ve never really dealt with this before…\n\nBut if you ask someone to move their bags chances are they will move them without any fuss. It just really doesn’t seem like a big deal to me unless someone is refusing to move their stuff. \n\nRespectful communication goes a long way, most people do not go out of their way to be assholes.  \n\nA big problem we have today is just automatically assuming people are TRYING to inconvenience us.", "But the passenger paid for a seat, surely they can decide what’s on it (within reason).", "And if the person paid for two seats, there ain’t nothing you can do but stand till you get to your bus stop. Or else, you ask politely that they move their stuff. After all, they were there before you.🤨", "The worst is manspreading(women do this too buy it seems to be mostly men) where their butts are taking up one seat but their spread out legs are taking up the whole row. You are giving some lucky person the choice to be squished up in the corner of the seat or be touching your legs with a full view of your crotch. Either way, move you damned legs.", "On a crowded bus, seats aren't for bags. Nothing wrong with putting them in a seat when it's empty. Move your shit when it gets crowded. If the bags are so heavy you can't lift them off the floor, you should be planning for other accommodations for transport (of yourself or the bags) anyways because you will still have to walk home from the bus stop as it is.", "She sat on one seat, using the other seat for the bags, so taking up two seats in total. Which is fine when there are plenty of free seats like in the beginning, but she should have moved the bags when the bus filled up.", "Take a cab or buy less shit. It's a simple solution.", "If people are standing up on the bus then no that's not ok. Don't want to sit? Then move and offer someone else a chance to sit. If nobody wants it knock yourself out but I guarantee you someone will take it.", "That's what the seat is for.....?? What are you on about?", "The alternative is them standing with the bags next to them on the floor, so other people can sit.", "They can sit between your legs or next to your legs, in front of your seat. Nobody walks there.", "She had two bags, one can rest on their feet in front of them, the other on their lap. No tripping hazard.", "But that would mean one more person could sit.", "Most buses I've been on have enough space to fit multiple bags under passengers' legs or in front of them. It's not super comfortable, but between her lap and the floor, she could likely have made room.", "If they don’t fit by your feet or under the seat, they go on your lap.", "Different awards do different things; if you click on the award you can see what it does. Some of them give coins and some don’t ;)", "It's still courteous to offer the seat to people once people starts filling in. Especially since a free seat may help people who needs the sit down like Handicapped, Pregnant or The Elderly.", "You do not pay for a seat on public transit in the US. You pay to board and travel. No seat is associated with your fare, and it's a dick move to take up a seat you aren't sitting in.", "She paid for 1 seat, not 2. It's rude and inconsiderate of her", "Because buses have a maximum number standing capacity too. If the bus looks too full the driver will not pick any new people up. \n\nDo US buses not have any luggage areas to store bags?", "Because butts take priority over bags. If you're not going to sit in the seat, hold your junk and let someone else sit.", "They shouldn't have to ask. The bags should be moved when the bus starts to get crowded.", "I have ridden many crowded buses and there have been many people refusing to move their bags, fold up their strollers, or fold their walkers.", "While this is true, there's also social conventions and manners. \n\nFor example, if someone is talking loudly on their cell phone on the bus and says \"well, no one told me it was bothering them\" they are still TA. You shouldn't need to be told to not talk loudly on the phone on a bus, or take up 2 seats on a crowded bus. These are societal norms that are understood by the vast majority of people, and are assumed to be understood by others using the bus (or any other public space).", "You pay to use the bus, not for a seat. Even as a person that's the case. Seat is no guaranteed with the fare. Seats are for people. Not for bags.", "I don’t believe you’ve ever ridden a bus lol.", "How many people do you really think get on a city bus and say “I’d like to pay two fares so I can keep my bags on the seat”? Be real.", "They’re not saying the person should take two, they’re saying that if the bus gets crowded and you leave your bags on the seat, then you better give up *your* seat - you’re still only taking up one seat, you’ve just chosen to give your seat to your bags while you stand next to them", "Yeah honestly if you’re buying THAT MUCH you need to either be willing to stand up front where the luggage area is (in buses I’ve been on at least) or shell out for a taxi. The bus is a communal space, you can’t hog it like that.", "It's not that they dint want to sit. If they did sit and but the bags on the floor beside them, then people would still have a problem. It's a lose lose situation. Anyway if it's my seat that I git to first as it typically first come first serve I can do what I want with my seat.", "The alternative is you HOLD your shopping bags so nobody trips over them and you stand out of the way of the seat that you don't want to sit in. No bags on the seats or the floor. On the seat is inconsiderate on a full bus and other is a safety issue.", "No. The alternative is them sitting in the seat with their bags on the floor.", "I think that's for cheap public transport everywhere", "This sounds like local public transit - so a city bus. No, I’ve never been in a city bus that had luggage storage. \n\nInter-city transit like GreyHound and GO buses do have luggage storage, but that’s a totally different situation.", "This sounds like local public transit - so a city bus. No, I’ve never been in a city bus that had luggage storage. \n\nInter-city transit like GreyHound and GO buses do have luggage storage, but that’s a totally different situation.", "I get it if it’s crowded and people are standing. I’m referencing the bus not being full and plenty of seats left", "Walker and stroller folding and unfolding could cause someone to miss their stop, or else if the driver waits for them people would be just as upset about the delay as they were with the walker or stroller taking up floor space. When you use one of those items and take public transportation, you will inconvenience people no matter how you behave. Generally, if possible, I would say it’s better to wear your baby instead of using a stroller on a bus. But people have no choice about using walkers.", "Exaclty!  How is everyone saying \"she paid for a seat\" without a hint of irony about EVERYONE else that is standing that ALSO would have \"PAID FOR A SEAT\" 🤦‍♀️🤣🤣🤣🤣", "Fine. I’ll lift my bag and sit in the seat. Either way, I’m using the seat.", "Just… put them on the floor? Why has this long honored tradition been overlooked in this conversation? Bags go on the floor if you don’t want them on your shoulder.", "I know exactly what they're saying. If you are choosing to stand, your bags belong on your person or on the floor next to you - if the bus is crowded. Bus fare is not per seat. If it was, the bus wouldn't take on passengers past the last open seat. Your bus fare is for the transport of your person from A to B. You don't have a *right* to a seat at all, unless you're disabled.", "You don't even need a taxi. Just a little push cart is enough.", "Most buses I've been on actually have a space for you to put your bags down. But also if you know your getting on the bus shop accordingly so you aren't carrying heavy bags or take a cab. There's options. My local bus company actually has signage at one point telling people absolutely no bags on the seat and don't be that jerk either who sits on the aisle seats so nobody can sit with you. It's funny because the ones who do that will always expect you to let the people sit down but when you get up they take the whole thing to themselves it's so rude.", "Loads of city buses have sections for luggage. Not as formal as an intercity coach but outside of the USA it's common.", "It's the opposite in Ireland. City buses have an area to put bags, folded buggies etc in inside the bus with the passengers but Inter City buses only have teeny overhead racks and anything larger has to go in the hold.", "Nobody in this thread is saying she never should have had her bags on the seat. But, once it got full, she definitely should have moved them. She just assumed no one wanted the seat, but she was being rude by leaving her stuff there", "I agree re: wearing the baby.\n\nThe thing about walkers is, when you leave them shoved out in the aisle and refuse to fold them up, \\*no one can get by\\*. No one can get on the bus to get to open seats. No one can get off the bus. No one can use the straps when standing.\n\nPeople don't have a choice about using walkers, that doesn't mean they can eat up the whole bus space with them because they don't want to collapse them. Yeah, it takes time to unfold them. Push the button and start unfolding it before the bus stops.", "OP was using two seats anyway", "That’s true that no one has a right to a seat on a bus - and since OP was there well before most of the riders, whether or not they had bags they would have had one of the seats. If, as the bus filled, they stood up so they didn’t take up two seats and left their bags on one, I don’t see how that’s any different than if they just didn’t have bags and stayed seated (something no one would get mad at you for unless you were sitting in the disabled/elderly area)", "Same over in England", "When the bus isn’t full a seat can be multifunctioning for asses or bags. When the bus fills up seats are for asses only, they revert back to being a single function object. As Hinote said the fare is for the transportation not a seat. Busses are for people, not bags. Yes you can bring bags on them but nobody’s bag should take take a spot intended for a person no matter how heavy it may be.", ">I don’t see how that’s any different than if they just didn’t have bags and stayed seated\n\nIt's different because the seat is not for your bags. It is for sitting. Your choice on a bus is either sit or stand and if you choose to stand, the allocated space you can fairly take up is now standing space, not sitting space. Reserving a seat for your bags and standing is equivalent to taking two seats. On a crowded bus, you should be minimizing your space as much as possible, not taking a seat because \"it's the same as you sitting there.\" It is not. If you were sitting there, your bags could be in your lap or on the floor in front of your seat.", "I wouldn't say you're an asshole but that was a little bit of poor judgement. It's okay though, we all have those moments.", "Depends in my city. Most of the time they won't sit still. Should have moved your bags for the opportunity anyway but too often in my city I've done this and theyll just light up. Probably just me but I've had a guy light a crack pipe next to me while heading to work. I simply asked he not since I didn't want that smell on me. Especially going into work. He responded with I'm a 40yo man I don't have to take that shit from you I'll stab you. I didn't respond but tbh I should have just shot him because he stabbed and killed a 22yo kid 2 days later. I seen it on the camera footage they showed. It hit me i could have potentially saved his life. So yea perspective of your situation. I think NTA. But this is personal.", "YTA\n\nYou're 19 and young. You can learn, so there's still hope. Be better next time. As soon as the bus started filling up and people had to stand, it was time to move your bags as much as possible and not just 'assume' where people would rather prefer sitting/standing. It's called common courtesy.", "esh, it would've been nice to move the bags without being asked, but it wasn't hurting anyone to ask either.", "Ur not the the a-hole cuz, if someone asked you could have just moved happily then problem solved.", "YTA. And if that is what they said, verbatim, no one insulted you. Get over yourself.", "Hard vote here…you’re ok taking 2 seats when the bus is empty…but when it starts getting full moving your bags to the floor is the courteous thing to do…so clearly your manners are a bit lacking although whether that is your parents fault for not teaching ypu or your part for not learning or perhaps not caring about normal civil polite behavior.", "YTA.  It's common courtesy.  Unsaid but understood.  You were rude.", "Read the room!!! YTA", "YTA", "YTA - once you see people having to stand, you should have moved your bags. People who use buses regularly are use to sitting next to strangers. Move bags next time.", "YTA. I can’t stand bus riders like you", "YTA people like you are one of the many reasons I hate public transport", "YTA. It's like entitled drivers who camp in the left lane. Don't be so oblivious. Many people are nonconfrontational and tend to avoid conflict, so they may be uncomfortable speaking up to you directly. But if you have some common courtesy and move your bags on your own, someone might just sit down.", "YTA.\nIf the bus gets crowded, move your things. People shouldn't have to ask you, as not everyone is confident enough to do so nor is it what they have to do.\n\nMove your luggage below the seat or on your lap, don't be inconsiderate.", "YTA bus etiquette is you move your bags when the bus starts filling up.", "Also, you're 19.....guaranteed there were older people on the bus that could have used YOUR seat and your bags seat.  YTA", "YTA. It was okay to use it when it wasn’t full, but as soon as you noticed people having to stand, you should have moved your bag. That was rude and inconsiderate, learn from your mistakes", "How could you not know that Yta? People have to stand, but you just have to have a seat for your bags.", "YTA, I feel like this is so obvious that you have to be baiting here.\n\nYou paid for one seat, put them on your lap and at your feet. Not enough room, stand and have them on the ground next to you.", "Just wanted to say I've never heard that most people don't want to sit next to strangers on public transportation. Pre-pandemic I used to take the subway and/or bus all the time and there was kind of no option. You just have to sit next to strangers if you don't want to stand.", "YTA. Once the bus is filled you should offer the seat.", "YTA", "YTA. \n\nFirst come first serve doesn’t mean be a hog about it.", "YTA! Entitled people like you make the world harder to live in", "YTA. your age is showing here. you’re young and have a lot to learn about mutual respects of living in a society. it’s public transport… “no one wants to sit next to strangers???” you are out of your mind lol. that’s kind of the whole shtick of public transportation… you sit next to strangers.", "YTA, did your bag pay a fare as well? No?…then move it when the bus starts getting crowded. That’s common sense, like damn lol", "YTA. Buses are for people, NOT BAGS!! As soon as the bus started to fill up and people had to stand YOU should have moved your crap off the useable seat so someone could have used the seat for what it was intended for. Plus no one WANTS to sit by strangers but you assume you’ll have to on a public bus. You are definitely an AH.", "Ugh. I ride a crowded train everyday and while it is obnoxious to leave your stuff on a seat when you see others standing, the protocol is to politely ask someone to move their stuff. ETA here. Granted, I understand that at the end of a long day you don't want to have to fuss with all the stuff you're lugging around, but you could have taken the opportunity when the bus was empty to organize your bags better. But also, people are assholes on the bus sometimes, you just gotta deal with it.", "This could be the first unanimous YTA ever. There is no way someone can be this much of an asshole and not realize it, unreal!", "YTA. I know you didn't realize it, but it's just common courtesy to make the seat available if the bus gets crowded.  Your groceries should not get seating priority over actual people.", "Lol. The entitlement. YTA.", "YTA— whether you intended to be or not, it was rude to take up a seat for your bags. Even though nobody asked you to, you should have moved your bags once the bus started filling up.", "Yes you are.", "YTA. And that person wasn't \"passive-aggressive.\" They spoke the truth. You sound like a spoiled child.", "This. OP knows they should have moved the bag, because she's aware the bus filled up to the point where people needed to stand. Does she also need to be told to move out of doorways and walkways when people are trying to pass?", "Props to the person who pointed this out on the bus! Honestly seems like she didn't know. Though it seems like very common knowledge that butts go in seats, not bags.", "Right. I asked a woman on a bus to move her bags once and I thought she'd kick my ass. I don't ask things of strangers anymore on public transportation. People are garbage.", "I don't even ask. I just point at the seat and start going to sit. They always move their bag before my ass hits it.", "I mean, if the bags were that heavy, she seeing that nobody ask she could keep them there, at least from where i come from if you want to sit where things are, you ask, it would be nice if they offer you, but ppl dont do that unless is an elderly person, a pregnant woman, a woman with very young kids, or a disabled person", "As a New Yorker we are labelled rude sometimes but we definitely know the etiquette is move your bags no one needs to ask you to do this.", "It really is part of the social contract of living in a society. I'd bet OP doesn't return shopping carts to the corral either. \n\nEver since I started reading on reddit I learn that I'm some type of outlier who thinks about putting myself in the other person's place. It's like the golden rule, two definitions. Treat others the way you want to be treated, or he who has the gold rules. I certainly don't lie awake in bed wondering if doing something nice for general people around me makes me a jerk. I think about how I tried to do the right thing, and it backfired on me, so now I have an awkward situation going on.\n\nEntitled people like this suck. YTA OP.", "What a ridiculous rationalization to attempt to justify her behavior. Like literally everyone else on the bus is sitting next to a stranger except for her because she reserved it for her bags.", "100%! \nI grew up in Brooklyn and was entirely dependent on public transit until I moved. You get used to being VERY up close and personal with strangers multiple times a day. And I’m surprised that OP didn’t have more people up close to them telling them off for being so selfish! Your bags are not more important than humans. \n\nOP, YTA. Please be more considerate of fellow humans.", "I almost down voted you for the assumption that they could have fit. Then I remembered the time I was able to fit an entire trash bag almost bursting with expired-that-day or would-expire-over-break Starbucks food in my one allotted bus seat space with myself.", "Absolutely. Having the bag on the seat when it’s empty is no problem. But as soon as the bus starts to crowd up, move the bag, preferably without needing to be asked. This is so basic. I’ve sat on a bus with bags of shopping crammed at my feet. Not comfortable but public transport means compromise. YTA", "Also who doesn't want to sit next to a stranger on a bus? That's some weird backwards knowledge", "I’m disabled and the number of times I’ve had to asked people to move their bags so I can sit (sometimes even in the disability seating) is not zero. \n\nMy bestie is also disabled. She never asks anyone to move and will just stand. 😢If I’m w her I get her a seat first cause I know she’s too scared to ask people to sit.  Not everyone has a visible disability and not everyone is able to say anything. Being wrong and not being corrected doesn’t make you wrong it just means no one has corrected you. \n\nYour bag gets no seat. Put your bag on the floor or on your lap period. You were wrong. Your bag doesn’t get seat. \n\nYTA.\n\nEdit to add if your stuff is heavy get a kind of rolling back pack for it. But your bag doesn’t get a seat ever. You refusing to move it when people are stand is unkind at the least.", "[According to SEPTA (Philadelphia-area mass transit)](https://iseptaphilly.com/blog/Etiquette)\n\n>Still on the topic of seats. You have one human body, you get one seat! Your backpack or purse or groceries has no human body, therefore, does not get a seat. Please use your lap. Or the floor. Allowing all seats to be occupied by humans also helps the aisle and doorway congestion.", "OP was projecting. *OP* doesn't want to sit next to a stranger.", "Seriously. For some reason people on this sub love to hate and shame people for some small mistake. It’s pretty gross tbh", "When you’re riding public transit enough in most American cities you deal with enough inconsiderate AHs like OP that yes people get mad. OP isn’t the only one getting on the bus after a long day, possibly also with heavy bags. Being considerate takes very little effort in this scenario.", "I live in NYC and I have seen people not even ask and sit directly on top of whatever is on the seat. Always makes me laugh. Oh and OP is TA.", "Agreed on this. And, *unpopular opinion,* kind of an INFO?:\n\nDid it occur to you to move the bags earlier in the ride, or later, or not at all? Because I can see how...\n\nYou go shopping. You're tired. The bags are heavy, and you've carried them even a small distance. You sit down, set the bags down, distract yourself on your phone... by the time you realize there are a lot of people standing, you've got like a stop or two before you get off. You start feeling bad, but the time it would take to move the bags comfortably for someone else to take the seat seems like by that point you'd be getting off anyway.\n\nEspecially from the perspective of someone with ADHD or something, it happens - lack of mindfulness/consideration. It was a mistake. You learned from it. But does that make you an ASS? Eh, I don't think so. If you had responded to that person as rudely as they were to you, then yes, you'd be T A. If you had posted on here like, \"y'all listen to how this b**** talked to me on the bus,\" then you'd be T A. But you didn't. So. 🤷‍♀️", "Or if your stuff is really awkward to carry, leave it on the seat and stand yourself. Just don't take up two seats on a busy bus.", "Same. I rode the public train when I was in art school as an early adult, and my portfolio bag was a huge rectangle that was awkwardly shaped. So most days, I was standing against a wall with my bag propped behind me because it was the only place on the train I wasn't hitting or blocking people with it.\n\nBut it was MY bag so it was MY problem. I dont get people like OP who have excuses like \"my stuff was so heavy.\" Okay. And? That's your inconvenience. Not everyone else's.", "And she tried to excuse herself that they barely fit between her legs... I have travelled with heavy bags. You can put one between your legs and one on top of your legs. Or even put one bag on top of the other bag. Or, if it really is impossible, you stand yourself when the bus gets crowded.", ">“people don’t want to sit by a stranger”\n\n_How do you think public transport works?!_\n\nEDIT: By 'you' I mean the OP", "I would've sat on the bag of gifts. :P", "EXACTLY. OP keeping her bags on the seat when she could see the bus had filled up was a clear indicator of a self-entitled person. A) there was a good chance you could ask and she could ignore you or tell you to F off since you can already tell she's an Ahole. And B) I shouldn't have to ask people for their courtesy. I don't understand why people like OP think it's perfectly fine to be rude until someone asks them to not be rude anymore lol", "Pick up, move to aisle way, sit down. “Not my problem”", "In my experience, this works 100% of the time!", "But they were “insulted”…🤣", "I particularly like the 'probably would've moved them' line", "Holy shit.  That's a bit dramatic ya know?  Maybe OP is just a bit clueless?  At least they had enough thought to ask if they should have moved the bags.  She's reflecting on it instead of totally ignoring it.  That's better than nothing IMO.", "Most people prefer to be hit anyway", "I haaatee when people do this lol. I don’t have eyes in the back of my head and you have a mouth so use it and tell me to move!!", "I'd rather someone notify me if I'm in their way.  If I'm concentrating on something, I don't always know if someone quiet has moved close trying to get past.  I don't want to inconvenience you, and will happily get everything out of your way so you can get where you're going and I'll even apologize.  Please let me know.", "Sometimes, people are just in their own worlds and not paying attention, so they don’t mean to be rude. Maybe it’s a Midwest thing, but I also wait but I don’t think it’s rude to say “excuse me” and I don’t get mad because I think it’s rude.", "lol come to the North East. The closer to Boston you get the shorter the time between patiently waiting for someone to do something they should have done already to someone shouting \"Fucking Move!\" gets.", "I haaatee when people do this lol. I don’t have eyes in the back of my head and you have a mouth so use it and tell me to move!!", "I mean, I don't LIKE to sit beside strangers on the bus, but if there are no other seats, I prefer to sit and sometimes that means beside a stranger.", "This or they may be disabled and need to sit down. YTA", "That’s exactly where I thought this post was going too!", "UK here. I take the train to work and am the person who, on the commute home, will say \"please move down the train so other people can get on\" and \"Please move your bag so someone else can sit down\". Don't try to argue with me, it's 6.30pm, I'm tired, I'm a middle-aged woman and I have no Fs to give. I am also the person who, when faced with someone who won't move down the train because they can't see anything to hold on to, tells them to take my seat and *holds on to the handle on the seat they've just taken*. Bonus points if this is a young man.", "This. I'm German, only use trains, not busses tho. But j usually travel with a suitcase and backpack, so yeah, I take up some room. \nBut when people ask me to move my stuff, I will. If no one asks, I assume they don't wanna sit near me", "Exactly this! If you have to actually ~ask~ someone not to be an obvious dick, you're probably wasting your time and are likely to get a load of abuse for your trouble.", "I appreciate someone who pays attention to how they affect others in public. Public transportation and farmer’s markets are always flooded with young new moms with strollers and way too much stuff pushing through the crowds with no regard for the people around them.", "You should be quite proud of your stroller-speed-folding skills!", "This is it. This is what OP doesn’t want admit to herself so she makes excuses instead.", "Classic narcissist. Projecting shameful behavior on those around you.", "And I’m guessing OP probably also would have fumed in silence about it rather than asking someone to move their stuff like OP expected others to do. Idk about y’all but if I were the person left without a seat on the bus, I would be wary of asking someone to move their stuff. In my mind, if they’re not courteous enough to automatically move their shit on a full bus, I assume they probably won’t be courteous about me asking them to move it.", "In the Midwest it would be “Ope, I’m just gonna slide right by you, here.”", "Good lord, yes. I also hate when I can feel someone looming by me in my peripherals, but they aren't saying anything, just looking at me like I'm in a zoo. How is saying excuse me rude? Like at all?", "Yeah, I wouldn’t ask someone to move their bag so I could sit down in that seat. People are fucking nuts. OP might be okay with giving up her seat if someone asks but, I’ve been fooled enough times that I’ll just stand, thanks. \n\nOP, what you should have done, at the very, very least is when you noticed there were just a few seats left, you should have made every effort to get your crap off the seat. Put it under the seat, on your lap or stand in front of the bag freeing up your original seat. People aren’t going to ask. YTA for taking too many seats.", "Honestly no. No bag should have a seat while people stand. If she wanted to stand, she should have done it WITH her bag.", "My train has backs that flip so you can have a quad. It drives me bananas how many people will flip them to sit with two people on crowded commuter trains instead of just sitting next to each other. There’s a young couple on my regular train who does this and I’ve just sat down in their quad with them a few times at this point since I’m normally getting on as the doors are closing and it’s full. I’m not standing the whole way home after a long day of work.", "Well, there was 'barely room' for the bags in front of her legs. She would have been mildly uncomfortable whilst sat down as everyone else bounced and swung around her...🙄 OP has main character syndrome. YTA, OP. You shouldn't need to be asked to move your bags so another person could sit down. You shouldn't need to be told to do the obviously right thing and you shouldn't need to ask people if you're in the wrong for something like this.", "Same in Norway", "Agreed!! Like I shouldn't HAVE to ask for respect. I give it to others and I expect it back. I shouldn't have to ask my neighbors to be quiet at midnight. I shouldn't have to ask someone to move their shopping cart out of blocking the aisle. I shouldn't have to ask someone to hold a door open so I can catch it as I'm going through behind them. Just like I shouldn't have to ask not to be punched in the face or stolen from or cut in front of in line. Just don't effing do it if its rude!!\n\nI hate people. Most of them are rude and self-centered and too stupid to even realize it, just like the OP of this post.", "Yes! I would be afraid of retaliation at that point. If you’re enough of a dick to leave me standing while your bags have a seat, I don’t expect you to be kind and accommodating when I ask you to move them.", "That’s called cat paralysis.  There is no known cure other than the cat deciding in its benevolence to move and bless you with freedom of movement again.", "Cats are different, their lives are worth that of 10 humans. I'd let my bladder explode before even thinking about inconveniencing my cat for 1 second", ">you ketchup sandwich’.\n\nAs a person who doesn't like ketchup, this is an awesome insult! I'll add it to my favorites!", "I love doing this is public spaces\nTo people who are obviously trying to take up more room than they need. Glare at me all you want. I wanna sit and annoying your ass is just the cherry on my ice cream sunday", "true. i am a good citizen in the catland kingdom haha", "Valid. I have some empathy because I did NOT grow up using public transit and started using it at 19. AH behavior doesn’t make someone an AH until they double down on it.", "My friend has a prosthetic leg and has been confronted more than once for using a handicapped parking spot (even with the proper tags). He’s young and healthy looking otherwise (lost his leg in Afghanistan) so people think he’s using someone else’s car or something. Pretty infuriating and degrading experience for him.", "And I think everyone in the world has carried big and heavy bags and you just set them down on the floor, wtf. It's not difficult or anything. You even sit by the aisle, and if they don't fit between your legs you can prop them against the seat before you. You'd still be making someone uncomfortable when they are trying to pass through but it's better than using 2 seats.", "Our kitty isn't allowed in our bedroom because we're both allergic and would die if she got on our pillows before we slept all night. We have a king sized bed and an 80lb dog who *usually* sleeps in her bed but will wiggle her way into ours if she's cold or needs to go out. She's lanky enough that she can take up almost half the bed on her own. As a matter of fact, when she stretches out on her side on our couch her back foot touches one armrest and another touches the other one, lol.\n\nAs far as being out matched, have you considered putting in a (large) cat door so they could come and go as they please?", "People who can't grasp the concept of invisible disabilities, *and* feel the need to confront people about them are really God's masterpieces.  Genuine morons.", "I once had abuse shouted at me for asking. I gave up. 30 seconds later someone else walked on, put the bag on the floor and sat down.\n\nOriginal seat hogger went nuts, screamed, swore, stormed off the train and then punched the window from the outside. \n\nBright side - I got their seat. 😎", "I think for me it's kinda bus etiquette, bags on the seat is fine while there's free seats, when it's getting full you move them. Its easy to assume people will just communicate but there's a million reasons someone may not be comfortable asking so the problem is easily solved by not taking an extra seat when people are standing. \nI know from my experience I've had people be really nasty when politely asked to move their bags so I can see why people may be wary!", "If you were standing you wouldn't be offended that someone thought their bags were more worthy of a seat than you are?  \n\n\nBags don't have bad backs or get tired after a long day & don't even know if they are on the floor or a seat.\n\nThe decent & respectful thing to do is just put your bag on your lap or between your feet.", "That's not how public transport works. You cant reserve seats for luggage.", "I agree, if you want to stand and have your bags in the seat, fine, you are still taking only one seat. But if that bus is crowding up, you consolidate best you can to that one seat. They shouldn't have to ask you to make room.", "I agree with you and I'm a regular bus rider.", "I do think this is rational. One person = one seat. How you use that seat is up to you.\n\nBest-case scenario is me seated, with parcels on my lap and on the floor where I can use my feet to keep them confined. But if that's not going to work for some reason, keeping heavy packages a few feet off the floor would be worth standing for me, since I do have one good arm to brace myself with (and a surfer's ability to keep my feet under me in a moving vehicle). My standing, and resting my bags on a seat I would otherwise be sitting in, will enable me to move more quickly  when I get to my stop.\n\nWorst scenario of all, for everyone, would be me standing with heavy parcels in the aisle, at my feet, where I cannot easily shift them or keep them from sliding. If someone gets on a crowded bus and obviously needs the seat, of course, I would yield if nobody else offers. \n\nFortunately many of our local buses now have overhead racks and storage space up front where you can put some bags.", "A handicapped or elderly person needs the seat more than your groceries 100% of the time. There's no LPT for avoiding common decency.", "If people PAID for a seat, then standing wouldn't be necessary when the bus gets full. That's not how public transit works.", "You pay to get from point A to point B, not for a seat.", "haha i love that image of your doggie on the couch. \n\nif i installed a catdoor it would just result in them laying on me all night just like when the bedroom door is open. they wouldn't 'go' anywhere. they follow me EVERYWHERE. right now one is staring at me doing his best to block my view of my screen & the other one is draped across my shoulders. i'm gonna get up to go to pee in a few minutes & i know FOR SURE they will both follow me into the bathroom, where the shoulder loving kitty will get herself back onto my shoulders while the other one will sit inside my pajama bottoms while i'm on the toilet. i can't even go from the living room couch to the front door (all one big room) without them jumping off the couch to accompany me. all my cats have always been like this so i guess they all just learn to act this way from the older cats. at least i know i'm loved LOL", "It brings to mind a phrase I was taught many years ago. \"Some people have no home training.\"", "Exactly. Common courtesy. There was a young boy in New York taking 2 seats on the subway & Elton John sat on his feet!\n\nLook it up, it's great!", ">They shouldn't have to ask\n\nI know right ? The brass fucking bollocks on this one putting the onus on total strangers to start up a conversation to remind them of the basic rules of society .", "This is a bus design problem. Most newer busses have sections with foldable seats so you can put a stroĺler there, or someone in a wheelchair can get out of the way, or other accessible seating options.  Not the same as OPs bag.", "Exactly, no one should even have to ask you to move it. Bus fills up, move your shit.", "The person with the bag may have a bad back and be tired. One person, one seat. I've traveled with my backpacking bag and it's big and bulky and we've put two backpacking bags on one seat to take up less space when a group is taking public transport. Both of us stand and we're not turning and whacking people with our bags on crowded busses or trains.", "Or people that are just tired...", "Light rail often has an area for bikes and suitcases, but buses do not. It would be massively inefficient to have to move to another part of the bus to pick up parcels before getting off. Not to mention the possibility of someone else taking them if they don’t stay in arms length.", "Lol I used to ride a very busy bus. The driver would always stop to pick up people, and then you would have to literally shove people out of the way to stuff yourself inside because it would be thirty minutes before 3 more stuffed full busses came by. Then you tried your best to balance because there was no where to hold on to. Once the driver closed my backpack in the door and just went. Fun times, lol. So glad I don’t ride the bus anymore.", "No, they don't, except for the road trip ones.", "Okay so technically speaking, then people can’t be mad they don’t have a seat because they also didn’t pay for one? I don’t morally agree with that but if that’s the logic, it also applies to the people wanting to sit", "Which is true! For example, my city had very little public transit when I was growing up, and it definitely didn’t come all the way out to where I lived. So did I learn to use it? Did any of my classmates learn to use it? Not really! So I’d rather someone communicate whatever norm I’m breaking than just be passive aggressive about it once it’s too late for me to fix the problem. I can look it up until I pass out but inevitably I will miss *something* and need to be told.", "In sydney, there are specific seating area on busses for wheelchairs users, prams, elderly and others that require \"priority seating\".\n\nThere is enough space for 2 wheelchairs/large prams. I imagine the only difficulty is if there are 2+ that catch same bus, but I have never seen it happen. \n\nMost Sydney busses have a front door for entry, and a second door in the middle of the bus which most able bodied people use to get off the bus.\nThe the priority seats are in the front of the bus, so the less mobile usually exit the front door.\n\nIt means it's faster to get them on and off the bus, and nobody really has to wait for them as they can use the back door to exit.", "> I’ve never been in a city bus that had luggage storage. \n\nSome in Edinburgh do -- the ones that go to the airport. but in general they don't.", "That happens regularly where I am, too. Drivers don’t gaf about how crowded the bus gets.", "Jesus!", "Have you ever required a walker?\n\nI don’t currently, but I have.\n\nI’m not excusing people who use their assistive devices as weapons or as a free pass to behave badly and demand special treatment. But that’s not what every person with a walker does, and generalizing and acting like it’s so easy if you’ve never been in their position is prejudicial.\n\nThe space required to unfold a walker is greater than the volume of the walker because of your arms and also anything that was in your arms needing to be put down so that you can have your hands free. Therefore, if you fold your walker, you require a larger radius of free space around you than if you had left it out - space that you don’t have because people filled in that space with their belongings and bodies.  \n\nThen, you unfold the walker and stand up for your stop, and people in the path between you and the door have to move out of the way. Which half of them won’t do without being asked individually instead of getting a clue when the first three people were asked to move out of the way. \n\nWheelchairs are worse. People complain about you being in their way, take it upon themselves to relocate you without consideration of and often in the opposite direction of where you were going, and will actually run to get ahead of you and then deliberately stop in your path. Apparently their convenience is justified at the expense of yours.\n\nHumans in crowds tend to be inconsiderate. They shed their sense of personal responsibility when they can blame it on others without actually pointing a finger at a specific person. Whether they do the pushing or are pushed and fall into someone, they have no remorse. So I don’t fault people who must be subjected to the chaos and choose to defend themselves from it by using a barrier they are permitted to use precisely because they are more vulnerable to injury in crowds. And I don’t expect those same people to do something for my convenience that will cause their inconvenience while also only delaying mine and therefore not actually making the situation better for either of us.", "I just want to say that not everyone who uses a walker is *capable* of folding/unfolding it.\n\nMy mother isn’t.  \n\nSo if she’s alone, it’s blocking another seat or the walkway.\n\nShe’d be very distressed if someone demanded she stow it and would likely hurt herself attempting to do so.  Fortunately, where she lives, most people are very understanding and compassionate about such things.", "Interesting cultural differences.\n\nIn Canada and the USA, a city bus basically has zero storage areas at all. Some of them might have an exterior bike rack on the front hood.\n\nInter-city buses would have the small overhead storage, but they also have massive storage compartments under the bus (under the floor of the bus) that are accessible from compartment doors on the outside. These compartments run the full width of the bus, side to side, and is where you'd store luggage and even larger things like skis or whatever.", "That very well could be the case. I've never seen a city bus with luggage storage in either Canada or the USA."]}