{"id": 1738, "submission_id": "yox38q", "title": "AITA for not letting my MIL meet my daughter until she apologizes?", "selftext": "I (27f) love my MIL (65f). After my mom died when I was 15, she basically took me in as her own daughter. I later married her son Gerald (27m) and we just had our first child, May (4mo f).\n\nMIL said many hurtful things about me and my daughter, including but not limited to: \"I wanted my first grandchild to be a boy\", \"Isn't she a bit chubby?\", and \"I wish you had waited till you were older.\" Note: this was all from pictures. She hasn't met her in person.\n\nBecause of this, Gerald and I aren't letting MIL meet May until she apologizes and May is a bit older (for health reasons.). \n\nMIL has apologized, but her apology was a bit of a backhanded insult, so we aren't planning to let MIL meet May until she writes us a real remorseful apology letter. (This was Gerald's idea, it was what she used to make him do when he needed to apologize.)\n\nMIL says we are treating her like a child and I am an asshole. Aita?", "created_utc": 1667848464, "permalink": "/r/AmItheAsshole/comments/yox38q/aita_for_not_letting_my_mil_meet_my_daughter/", "score": 452, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I am not letting my MIL meet my daughter until she writes an apology letter. I could be the asshole because I am treating her like a child.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. Kudos to your husband for protecting his family against toxicity!! Such a breath of fresh air after reading some other reddit stories. Protect your daughter at all costs.", "Who the hell insults an innocent baby...Also, there is nothing wrong with having a child at 27 as long as you felt you were ready and capable to take care of a child.  Regardless, you are NTA, especially since this is her son's idea about the letter (and to clarify he is also NTA).  If she wants to act like a child, she should be treated as such.", "NTA, your MIL sounds awful and she does need to apologize, but in person, to you", "NTA. \n\nAlso, if you haven’t already, I recommend joining and posting in r/justnomil Lots of solidarity over there. \n\nYour MIL might need more of a conversation than just the directive to try apologizing again… although the petty part of me does very much appreciate the irony of asking her to use the letter format like she had your husband do as a child 😂 \n\nI would try a facetime convo with the three of you, or just between husband and her, in which it is explained why her statements were hurtful and why her apology did not give you any sense of security that she understands why what she said is hurtful, and that you do not feel confident that the digs won’t continue. \n\nShe’ll probably apologize again, but this time you or husband have to make it clear that there is zero tolerance for those kind of comments and you will distance or remove yourselves entirely from the relationship if she cannot respect that. \n\nAlternatively, you could just tell her it’s the letter or nothing 🤷🏼‍♀️ And still tell her it will be zero tolerance going forward. Good luck, OP!", "NTA - I don't think you are one for wanting a genuine apology. I mean my husband's grandma sent me an email saying that she wanted her great-grandchildren to have red hair like her grandson. As if there were any control in that. But my husband is the same grandson she emotionally and verbally abused his whole childhood. So I flat-out told her that my child's hair color should not be a concern at all, she should be wishing for them to be happy and healthy, not caring about features. I didn't get an apology or an amended statement. She passed without having met either one too.  \n\n\nMaking off-hand, hurtful statements is a good way to have regrets later in life. And while I don't think \"I wish you had waited till you were older\" is a hurtful statement per say, I guess it would depend on the emotional tone behind it. But the other ones are. Wanting her first grandchild to be a boy, could show that she has a gender bias or sexist behavior that will impact how your child develops a relationship with her and what it will impact her emotionally, mentally, and socially. \"Isn't she a bit chubby\", is a very ignorant statement to make about a 4-month-old (really about any child, because of the emotional and mental health impacts that it could have). But children don't shed their baby fat until elementary school. A chubby baby isn't necessarily an unhealthily fat baby unless the pediatrician says so. Chubby for a baby, is healthy.  \n\n\nSo, maybe your MIL needs to be told very directly that her quick blurted thoughts hurt and to maybe think before she speaks. That she needs to know words have consequences, and that while you love her, you won't allow her to hurt your children with her thoughtless words. It's not about you treating her like a child, although this kind of behavior is childish, as in children say things without thinking, and if you haven't learned better or refuse to learn better then you'll be treated like one. This is about making sure you protect your child, and you are actually giving her preferred beneficial treatment, because if this were a friend or acquaintance, you probably would have cut them out of your life without giving them the chance to redeem themselves.", "NTA seems like you are doing all the right things here.", "NTA- I would just tell her that if she doesn't like being treated like a child, then perhaps she should stop acting like one.", "Nta. But you will be waiting a long time if you want a genuine apology. People like her are incapable of sincere introspection therefore adjust your expectations accordingly because she will say some shit again and again… \n\nIf that means going no-contact, go no contact. Low contact is also an option. Expect her to be shitty and keep her at a serious distance.", "NTA\nIt's your kid you decide who you allow to meet her, you are on your rights to not let her.", "NTA - she's right, you're treating her like a child (but she deserves it).  Your kid, your rules.", "It sounds like you are using your kid as a behavior /bargaining chip which is gross. You don't mention in any way that you are trying to protect your child or that you think MIL is harmful. You don't even know how she would behave around her granddaughter. I get that what she said is completely out of line, but you should have clearly stated that, explained why and what would be acceptable going forward. This whole making her dance on a string so-to-speak seems more like a power play than protection for your kid. Esh", "NTA \nSeems like she was just disappointed slightly and maybe she wanted a boy to recreate the illusion of her having Gerald. Id ask her if she’s been feeling like life passed her by and if she’s feeling\nLonely. May help get to the bottom of some of these comments that have been made by her.", "How was her apology insulting?", "INFO. MIL is rude, obviously. I read a comment about her making other comments you cannot post. While you appreciate her taking you in, obviously there is more to your relationship with MIL than we can see here. I think it is difficult to judge without knowing more to the interactions.", "Did she say more thsn those 3 things? That sounds like a good person who said what was on her mind... People call babies chubby and it's not meant insulting. Most her comments are pretty mild\n.. wishing you had a boy. Ok, no sensitive but also not mean... Worried you were too young, also, not mean, just thoughtless. And she has been there for you your entire life. Unless there was more mean stuff, I think you are being very harsh on someone who has been there for you. Unless you are perfect, and never put your foot in your mouth, you are being very hard on her.", "YTA and being petty.  This is a case of you making her jump through hoops to see your daughter.  the MIL is 100% right in that you are treating her like a child.  To say you love your MIL in sentence 1 and then go on to describe being emotionally abusive to her is ridiculous.  You are withholding her grandchild until she fulfills some childish task of writing you a remorseful letter.  Yikes !!!  Narc anyone.", "INFO\n\nWhat precisely do you want her to apologize for?\n\n>\"I wanted my first grandchild to be a boy\"\n\nThat's an expression of what she wants. She's allowed to want things. It was rude of her to SAY it. But she still get to fell how she feels. \n\n>\"Isn't she a bit chubby?\"\n\nIs she per your pediatrician?\n\n> \"I wish you had waited till you were older.\"\n\nAlso not an insult. A little rude or overly direct. But not an insult.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (27f) love my MIL (65f). After my mom died when I was 15, she basically took me in as her own daughter. I later married her son Gerald (27m) and we just had our first child, May (4mo f).\n\nMIL said many hurtful things about me and my daughter, including but not limited to: \"I wanted my first grandchild to be a boy\", \"Isn't she a bit chubby?\", and \"I wish you had waited till you were older.\" Note: this was all from pictures. She hasn't met her in person.\n\nBecause of this, Gerald and I aren't letting MIL meet May until she apologizes and May is a bit older (for health reasons.). \n\nMIL has apologized, but her apology was a bit of a backhanded insult, so we aren't planning to let MIL meet May until she writes us a real remorseful apology letter. (This was Gerald's idea, it was what she used to make him do when he needed to apologize.)\n\nMIL says we are treating her like a child and I am an asshole. Aita?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Nta-she said it", "Behave like a child, get treated thusly.  NTA", "It was basically \"I'm sorry for telling the truth.\"", "I imagine it was something like “I’m sorry your kid is a chubby girl and you’re too young to have kids.” That’s a backhanded insult non apology.", "She said way more than those 3 things, but I can't post or comment about them here.", "Found the MIL", "I want her to apologize for the other things she said, which I cannot post or comment about here.", "Then anything she would write in that apology letter would be lies anyway, right? \n\nMaybe she needs more time to reflect before she’s ready to spend time with your family.", "I think it depends on what she said and has done in the past. Either way, it's not going to impact a 3 month old. They don't understand language yet. But, is she a toxic person you are cutting out of your life? Because, you and your husband are breaking your relationships with her.  I'd think long and hard about what she said and if it's toxic or thoughtless...", "If they're not acceptable to post per the rules, then the whole thing isn't really acceptable for the sub.", "It's toxic. The fact that you think it might not be is concerning. \n\n\nShe expresses her disappointment in the child's gender out loud. That's not going to stop when the baby understands language.", "Is it a pattern? Does she continue to say she is sad it's a girl? Or was it just something she mentioned  Those are different. Sharing a 1 off thought vs bemoaning it. Lots of people have preferences that aren't popular and share it (we aren't supposed to have a preference if it's a boy or girl. But almost all the parents and grandparents I know hoped they would have one or the other first. Or if they had a girl wanted a boy next.  Or had a boy and wanted a girl next.  Doesn't mean they weren't happy when the baby was healthy and moved on once they found out...).  And I love chubby babies, so it depends on how these things are said.", "NTA\n\n\nAn apology isn't \"im sorry you were offended, but I really wanted a boy and I won't apologize for that.  Even though your almost 30, your still too young.\n\n\nThe thing is that when an adult is behaving like a child, they need to be treated like one. Consequences for actions.\n\n\nMaybe she needs to hear that her behavior is that of a child, her apology is that of a child, and so she is on a time out, because you both know even the crappy apology she gave was only to get access to the baby, not because she realizes she was wrong and wanted to make it right.  Tell her you won't reward your kid for bad behavior and you won't reward her either.", "NTA Adding to the kudos to your parents. You're treating her like a child because she's acting like one, simple as that.", "I honestly can't tell if she is saying mean things or if you are overly sensitive. Calling a baby chubby is normal. And the other two comments aren't mean, but her talking with you. Which means you resolve it by conversing back. She is allowed to have different preferences and opinions. This feels like it could have been resolved with a simple \"it was 50/50, but we like what we got, and I'm sure you'll love her, too, once you meet her\" and \"I know, but it felt like the right time and we took such and such measures to reduce impact to careers.\"\n\nThat you describe her as a normally wonderful person makes me think you jumped to offense too quickly, especially since you immediately got the matches out to threaten to burn the bridge down on this 12 year long, loving and supportive relationship.\n\nDemanding a \"real, remorseful apology letter\" will blow up in your faces. You do not treat a 65 year old woman like a child. They are smart and vindictive, and she knows where each and every one of your and her son's weak points are.\n\n She already apologized, accept it and move on. Grinding it in her face will most likely result in her hating you, your baby, and her son, and the lovely, wonderful, grandma relationship you envision dying in the dust.\n\nGive her an out which preserves some pride, and move on.", "NTA your mil would hate me. I had my daughter at 22.", "NTA.  A backhanded apology is not an apology.   If she wants to see the kid so much, she'll make a better one.", ">  MIL says we are treating her like a child and I am an asshole.   \n    \nNTA,  \"MIL, you are acting like a mean child, so we are responding to that.  Act your age and behave, and we won't have to.\"", "NTA.  You are treating her like an adult.  She just doesn't like that their are consequences to her actions.", "NTA she’s acting like a spoiled child so you are treating her like one.", "Typically when people call a baby fat or chubby it's not really an insult to the child. They typically say fat and chubby babies are cute and you just want to hold them and squeeze their cheeks. If she calls the baby fat and tells you to put them on a diet then you have a problem.", "Writing an apology letter is not jumping through hoops.", "For being sexist, ageist, and for fat shaming a baby.", "Lots of people wish the first born would be sons. That's a fact. Doesn't mean they won't love the child any less. calling a baby chubby or fat, that is no big deal. it's a term of endearment. \"fat\" babies are healthy strong babies. unless she told you to put the baby on a diet she did nothing wrong there. and maybe you are too young for children. seems like you went nuclear on your MIL over nothing really if that is all she did. So maybe she was right about you not being mature enough to have children. Seek therapy.", "NTA.  Gerald knows his Mom.  Let him handle this.  If he wants a letter, she better give him a letter.", "Not your mother but took you in... unless the other comments are actually rude... calling a baby chubby and wishing you had waited longer before having kids (maybe for your own good - in her viewpoint) is not a big issue. Do you know how hard it is to raise a child/teen? Let alone one that you have not given birth to? \nYou may have felt hurt (I can understand), but it may be taken out of perspective. Are you really punishing her by taking away your child's only grandma? Is there an underlying issue. Maybe look into it...", "NTA but I don't know why so many people on here are obsessed with getting insincere apologies. Even if it *sounds* sincere, it's not when it's forced.\n\nInstead, I would only accept a genuine understanding and agreement to whatever boundaries I decided to set, and an acknowledgement of hearing the consequences of not meet them. \n\nFor example, I understand that if I ever say a word that you find insulting to your child again, I will never see my grandchild again.", "Yeah I thought babies being fat was kinda their thing. OP’s mil is really weird.", "YTA. The apology letter is ridiculous when she has already apologized. Secondly, you are being over sensitive. Has her personality changed overnight or has y’alls ? None of these things are serious insults, y’all are making a mountain out of a molehill.", "NTA but MIL is", "NTA. Spew random insults like a child, get treated like one. Including having to write real apologies!", "I have to really restrain myself when anyone says “ stop treating me like a child!” I so badly want to say “ then stop acting like one!”", "So you \"love\" your mother in law?  You know, the one who took you in when you were a 15 year old orphan.  And the way you show that love is by using your daughter as a bargaining chip to get a groveling apology letter?  \n\nYTA.  And the whole withholding of the child for many many months for \"health reasons\" is making my eyes roll.", "YTA. And you don’t live your MIL.", "There's a difference between making a statement (\"she's a chubby baby\") and asking a question (\"isn't she a bit chubby?\"). The wording of that question is a veiled insult & sounds like MIL will either give her granddaughter an ED or self-image issues.", "also aren't babies like...supposed to be chubby?? im not being sarcastic I just thought that was kind of understood by everyone, because babies GROW!", "chubby baby is a healthy baby", "She actually fat shamed a baby! NTA", "She’s the AH for naming her child Gerald", "NTA. Sounds like MIL hasn't fully processed that y'all are actually adults yourself now, and perfunctory apologies can't be made to stick simply because mom said so.", "NTA but all of this emphasis on fake apologies is just pointless. You can focus on appropriate boundaries and the actual quality of family relationships. Or you can focus on the theatrics and implicit dishonesty of 'apologies' that mean next to nothing. They mostly allow the person apologizing to be dramatic, put you into emotional debt by asking for your 'forgiveness', use the apology as a reason to absolve themselves of responsibility for their behaviors, and act like you are the ones in the wrong if you ever question their behavior in future. But if that's all you want, then sure...ask for a 'real remorseful' apology letter that will be done resentfully and with lots of empty words. That's not going to give you the relationship you want with this woman. She'll find other ways to let this play out.", "Seriously, on this subreddit you can lose touch with people who have healthy relationships.  OP is def not TA, MIL is rancid.", "Hi, the \"health reasons\" are RSV and the flu. May has had both and was hospitalized. She was also a preemie.", "Yes, you are indeed treating her like a child. A child that needs to learn a lesson in manners.\n\nNTA", "I’m confused.  None of those sound like insults.  She was hoping her first grandchild was a boy.  That’s what she wanted.  Asking about the child’s weight could seriously just be a normal concern.  (No, grandma, the pediatrician says her weight is good.) I wish you waited until you were older is also what she wanted.  I think you need to get a grip.", "NTA\n\nShe is spot on. You are treating he like a child because she acted like one. Glad your husband is on your side with this.", "I was a healthy in my first year of existence... then burned it all in a matter of a few weeks. Is worrisome to imagine how a thin baby would handle the growth spurt, MIL is spitting nonsense."]}