{"id": 17380, "submission_id": "13itpm5", "title": "AITA for saying I wouldn't continue to live with my parents for my sisters emotional sake?", "selftext": "I (F19) am moving out towards the end of the year. My sister (17) wants me to continue to live with our parents until she goes to college because she doesn't think she should put the 'stress' of her emotional rants, thoughts and feeling onto anybody else, including her therapist and long time boyfriend. She feels I'm the only one who she can speak to and that I should stay to support her even though I (1) have expressed a strong desire to move for years (2) have told everybody I do not enjoy living with my parents (3) have told everyone I want independence and to travel and (4) start my own life. All her friends are in this town, her entire life is here and mine is somewhere else. She doesn't seem to care about any of that, she only cares about wanting me to stay. She's a very immature person (mentally). She has insulted me repeatedly as I do things for her. I love her to death, but I refuse to put my life on hold for someone so hurtful and naive. But I cant help but feel bad. When I told her no, she got angry. Am I the asshole?", "created_utc": 1684207719, "permalink": "/r/AmItheAsshole/comments/13itpm5/aita_for_saying_i_wouldnt_continue_to_live_with/", "score": 121, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > (1) Telling my sister I wouldn't move so I can stay to support her (2) The act of saying no made her upset\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA you aren’t your sibling’s emotional support animal! Go live your life.", "NTA\n\n> she doesn't think she should put the 'stress' of her emotional rants, thoughts and feeling onto anybody else, including her therapist and long time boyfriend\n\nWell, she should consider herself free to **stop**.", "NTA\n\nI would even say go no contact. That is not a valid reason at all. You are not an emotional support animal.", "NTA you're not your sister's keeper, and she's acting her age or more immaturely by insisting you should be. If she needs a better support system while at home, she needs to be the one to find it with help from her therapist and boyfriend.", "NTA. You're not an emotional support animal.\n\nYou're entitled to live your life. Your sister can talk to her therapist and work out her own shit.", "Not only leave but u may need go Nc ur sister a narcissistic and gonna destroy u I have feeling", "NTA.  Both you and your sister have to realize that you are not a therapist and have no business trying to give her therapy.  \n\nShe is being selfish and thinking only of herself and not of your own needs and life goals.  Move out asap.", "Your her sister, not her therapist.\n\nNTA.", "NTA. Okay, when I was younger I had a similar situation with my older sibling for different reasons. I begged him to not move out until I did because I didn’t think I could handle our parents abuse without him. But, he had to do what was best for him, so he left. I forgave him.  \n\nIn this situation, you are not TA for moving out and starting your own life. However, to ease this, could you maybe go to a joint therapy session with her to try and aid in her talking to her therapist?", "NTA get out and run", "OP - your sister is doing emotional blackmail with you and the sooner you learn to put your mental health needs first the sooner you'll be able to spot it in other potential relationships as you go out on your own and learn to avoid sooner than later.  People will always do their best to suck you into their drama and leave you spending your energy with them.  According to you, your sister has some challenges emotionally and she has a therapist that she doesn't actually utilize to help herself, but she likes using you as a mental punching bag to put up with her immaturity.  There's no need to be beholden to her because any worthwhile relationship is never one-sided.", "You aren’t her emotional support person she has a therapist for that.. Move ..get a life ..and enjoy it.. \nnta", "NTA - You should try communicate your feelings to her, and say that you’re ready to move on and stop being her emotional punching bag", "NTA\n\nYou are nobody's punching bag or free therapist, leave as soon as you can. If she feels she cannot vent to her therapist then she has the wrong one and needs to change.", "NTA\n\nYou already have your own life to live and figure out, you have no particular responsibility in supporting your sister (emotional) life. At some point, she will need to mature and act her age.", "NTA. Sometimes when you leave a bad situation you realise that you loved the people in your life to keep from hating them.\n\nYour sister will not grow because you are or are not there. It's a choice she needs to make. \n\nLive your life. Don't let others live it for you.", "NTA your sister is abusing you. Good on you getting out of there, but you should start setting boundaries while you're still there.", "Therapists are literally there for the emotional support, that’s what they’re PAID to do. If she can’t put her emotional needs into the hands of her therapist then she needs to rethink if they’re the right one for them. \nI spent years being an emotional punching bag and I can tell you the feeling of being free from all of that is amazing! Look after yourself first and express your boundaries to your sister. She needs to reevaluate her choices if she’s emotionally blackmailing you into staying in a situation that is unhealthy for you.", "NTA. You don’t have an obligation to listen to your sister’s problems, even though that sounds selfish, which it isn’t.", "NTA, you can’t live your life for others. Let your parents be concerned about supporting their daughter. You will always be her sister. Don’t allow yourself to be manipulated by a teenager.", "NTA. So she is trauma dumping on you and is emotionally manipulative. Nope. Leave, OP. You can't live your life putting her first.", "It sounds like she is communicative about feeling and doing so with you. Which is a healthy while it seems like you just want to avoid which is not healthy causing stress. I feel like your calling her mental immature as a projection because you can not/ do not want to talk about feelings. As speaking about your feeling and thoughts show you are actually mature. When you talk about feelings that makes for healthy relationships. While her expressing things it may hurt you but have you expressed you’ve been hurt ? Holding the things you do over/for someone is a form of control and narcissistic tendency.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (F19) am moving out towards the end of the year. My sister (17) wants me to continue to live with our parents until she goes to college because she doesn't think she should put the 'stress' of her emotional rants, thoughts and feeling onto anybody else, including her therapist and long time boyfriend. She feels I'm the only one who she can speak to and that I should stay to support her even though I (1) have expressed a strong desire to move for years (2) have told everybody I do not enjoy living with my parents (3) have told everyone I want independence and to travel and (4) start my own life. All her friends are in this town, her entire life is here and mine is somewhere else. She doesn't seem to care about any of that, she only cares about wanting me to stay. She's a very immature person (mentally). She has insulted me repeatedly as I do things for her. I love her to death, but I refuse to put my life on hold for someone so hurtful and naive. But I cant help but feel bad. When I told her no, she got angry. Am I the asshole?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Need help packing?  I’d move ASAP for your own sanity well-being", "NTA - There is a reason she has a therapist. YOU are not her therapist. If she doesn't feel comfortable venting to her therapist, then she needs a new one.\n\nStop setting your life on fire just to keep her warm. She is using you as an emotional support animal and it is stunting *both* of your emotional growth.", "NTA. You are not her emotional support human. She needs to talk to her therapist.", "C’mon! Live with your sister (if you want to be taking care of her when you are married or have kids or whatever you planned to do when you are 30)! NTA", "NTA. You are not her therapist", "NTA thats what therapists are for. live your life and dont let your sister make you feel guilty for it she has enough support she doesn't need to use you as a security blanket so much that you have to stop your life for her. let her be mad she will get over it and if she doesn't you avoided a lifetime of being at her beck and call with no life of your own", "NTA! You are doing exactly the right thing. Staying sounds like it would be just enabling her. You need to do what you need to do, and she needs gradually to develop more independence and find ways to manage her own emotions.", "The best and healthiest thing you can do for your sister is to let her learn how to control her emotional thoughts, rants, and feelings without you. She will avoid getting more healthy mentally if you are her emotional dumping ground!", "I do not think it is emotional blackmail. As having a sibling who refuses to acknowledged feeling and wrong doings and just wants to leave everything in the past without talking about it is unhealthy. It is called emotional avoidance when one party or both refuse to process issues. Which later let them more or less brew or bottle up leading to further stress and toxic relationships. Later leading to toxic out burst. While therapist help work with you to talk about things when the other parties will not accept or acknowledge what happened. Just remember a problem or wrong doing can not be solved unless it is brought to the other attention. So for instance icing them out or not talking to them is not healthy. Sometimes it the only choice when dealing a narcissist aka the grey rock method. To acknowledge a problem you calmly confront them yet passive aggression is a form of manipulation used my covert narcs. Yet as someone with cptsd I’ve forgotten memories due to stress and trauma. So passive aggression is very unhealthy and very hard when dealing with narcissist who gaslight and lies. Yet it just shows telling a family member to talk to a therapist instead of you is emotional avoidance. If you can not health resolve an issues get a mediator. As I was always trying find way to explain feelings to others to get them to understand more than just their side."]}