{"id": 17451, "submission_id": "13jvu2e", "title": "AITA for telling my SIL that I won't lie to her son for her and she's crazy for naming him something when she hated the intuitive nickname for it?", "selftext": "SIL named her son Skyler. I was already dating my wife when he was born and my name is Skye, just Skye. SIL apparently hates the name Sky(e). She made one comment back when we were dating that it was such a shame my parents didn't think about my future enough to give me something more substantial. My wife, then girlfriend, told her she was being rude and it was not her place to comment on my name and she never did again. Then she had her son and insisted everyone use his full name. He's now 7 and he calls himself Sky and asks other people to call him Sky as well. This started when he was 5 and he has increasingly used Sky over Skyler and now he asks people not to call him Skyler.\n\nSIL hates it. She has tried to tell him that his name is Skyler and not Sky and that nicknames shouldn't be used everywhere. She said it was confusing when he has an Uncle Skye and he asked me if I minded and I said no (I had no idea why he asked lol).\n\nSIL is upset that he won't use Skyler and she has vented to my wife and their mom about this. Both told her it should have been something she considered when she named him.\n\nSIL approached me a few days ago and told me she is sick and tired of Sky using Sky and not Skyler and she needed me to talk to him and say that I wish I had a more substantial name to fall back on and that Sky is a girly name and not something that's fun to live with forever. I told her I would not do that since it would be a lie. She told me I have to. I told her I don't have to do anything. She said it's driving her crazy and I could help with that. She then said yet again that she hates the name Sky so badly and I need to lie or do whatever to convince her son to drop it. This is when I feel I may have gone too far. I told her I won't lie to her son and I told her she was crazy for naming him something when she hates the most intuitive nickname for it as much as she does. She told me it was not crazy, Skyler is an amazing name and does not need shortening and I am an asshole for refusing to help speak to her son and calling her crazy.\n\nAITA?", "created_utc": 1684312523, "permalink": "/r/AmItheAsshole/comments/13jvu2e/aita_for_telling_my_sil_that_i_wont_lie_to_her/", "score": 252, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I told my SIL I will not lie to her son for her and that I think she's crazy for naming hi something when she hates the most intuitive nickname for said name. I might have gone too far calling her crazy. But I also might have been a hard ass too for not offering some kind of help when this is bothering her so much. Feels like this is just a crazy thing to argue over but I also don't ever want to be a dick to someone and maybe I was to her in this instance.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "I’m going to hazard a guess that SIL needs a hobby \n\nNTA", "NTA, she's gotta learn you can't decide what their kid calls themselves", "NTA - your SIL needs help man.\n\nIs like you name your son Bobby and when he wants to people to call him Bob your SIL goes on the spanish inquisition as if it was the coming of the antichrist, in what world does that even make sense?", "NTA, \n\nWhat the actual fuck is your SIL on?", "NTA and yes, your SIL is crazy. Poor Sky.", "NTA.  All of your points are valid.", "NTA, the kid is clearly old enough to know what they want to be known as and you SIL is just gonna have to suck it up. Also asking someone to outright lie to your child is just ick", "NTA of course, and SIL has main character syndrome, her son is his own person and she is gonna do harm if she is not accepting it. He likes Sky, why would she confuse the child with lies and things that makes no sense. Sky is a great name for both boys and girls and I smell some bigotry here from your SIL, but I could be wrong. \n\nThere was a post this week on here about stepmom refusing to call her stepdaughter by her preferred name, seems to be topic of the week.", ">SIL apparently hates the name Sky(e).\n\nWhy on earth would she name her kid *Sky*ler? It's the same name with an added syllable.\n\n>He's now 7 and he calls himself Sky and asks other people to call him Sky as well. This started when he was 5 and he has increasingly used Sky over Skyler and now he asks people not to call him Skyler.\n\nHe's clearly old enough to know what he wants to be called.\n\n>She said it's driving her crazy \n\nMa'am, you're already cuckoo banana cream pies. \n\nNTA", "NTA \n\nIf she's this irksome at this stage wonder how she'll manage to her son's dating choices later on. He might not even hang on to the nickname till mid-teens so not sure why it bothers her s much.\n\nShe has to deal with this.", "Most definitely NTA. \n\nWhat else was he supposed to have as a nickname that isn't too far from his actual name, without removing what makes it unique? Kyle? Kyler? Kylo?", "NTA.\n\nShes the only one with the issue and is trying to get you to help her. Clearly her son is old enough to make his own decisions. He asked you about the name because she used you to make a point, lying sbout it and he was smart enough to clarify with you.", "NTA. Same thing happened in my family but different name and nickname. They named their son James and always called him James. At\n10 he decided he wants to be called Jimmy. That’s fine by everyone except his parents throw a fit. They still refuse to call him Jimmy even though the rest of the family mostly does now. Don’t pick a name if you hate the nickname. Like what do you expect? 🤦🏻‍♀️", "NTA. \n\nStick a mirror in her face and introduce her to her child’s first bully. Her.", "NTA.  SIL needs to realise the name she gives is a placeholder only until the person can choose.\n\nI mean we give dogs and cats names, but only because we can't pronounce their real names, and they find it difficult to teach us.", "Good luck to you, Skye, and especially Skyler \n\nNAH", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSIL named her son Skyler. I was already dating my wife when he was born and my name is Skye, just Skye. SIL apparently hates the name Sky(e). She made one comment back when we were dating that it was such a shame my parents didn't think about my future enough to give me something more substantial. My wife, then girlfriend, told her she was being rude and it was not her place to comment on my name and she never did again. Then she had her son and insisted everyone use his full name. He's now 7 and he calls himself Sky and asks other people to call him Sky as well. This started when he was 5 and he has increasingly used Sky over Skyler and now he asks people not to call him Skyler.\n\nSIL hates it. She has tried to tell him that his name is Skyler and not Sky and that nicknames shouldn't be used everywhere. She said it was confusing when he has an Uncle Skye and he asked me if I minded and I said no (I had no idea why he asked lol).\n\nSIL is upset that he won't use Skyler and she has vented to my wife and their mom about this. Both told her it should have been something she considered when she named him.\n\nSIL approached me a few days ago and told me she is sick and tired of Sky using Sky and not Skyler and she needed me to talk to him and say that I wish I had a more substantial name to fall back on and that Sky is a girly name and not something that's fun to live with forever. I told her I would not do that since it would be a lie. She told me I have to. I told her I don't have to do anything. She said it's driving her crazy and I could help with that. She then said yet again that she hates the name Sky so badly and I need to lie or do whatever to convince her son to drop it. This is when I feel I may have gone too far. I told her I won't lie to her son and I told her she was crazy for naming him something when she hates the most intuitive nickname for it as much as she does. She told me it was not crazy, Skyler is an amazing name and does not need shortening and I am an asshole for refusing to help speak to her son and calling her crazy.\n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA and good on your now wife for telling SIL to cut out the disrespectful comments about your name in the past. \n\nI honestly would start referring to yourself and nephew as the ‘Sky crew’ or similar lmfao.", "NTA. Why do I get the feeling that you have plenty of bonkers SIL stories just waiting for a rainy day?", "Nta. This is universal karma.", "I don't know that she will learn that. She seems pretty hell bent on changing her son's mind and getting him to use Skyler. Will still never understand someone using that name and hating Sky(e). Seems like it's kinda inevitable someone will use it at some point.", "I know! Or like Robert and you hate Bobby, Rob, Bob and Robbie. Or if you hated Tasha but named your kid Natasha. For me it is common sense to make sure you like the potential nicknames the full name brings, or at least you can tolerate them lol.", "She's high on her hatred for the name Sky lol.", "Yeah, I don't understand that. Because surely then he would wonder why I never changed my name or why I don't go by my middle name or something. Kids aren't dumb.", "That's what we're all confused by. The name has Sky in there. It's a very clear part of the whole name. At some point someone was bound to use the name Sky for him and even if it was corrected, it would still make sense why when the name is right in there.", "She hates the name. She thinks it's ridiculous and not a people name. She seems horrified that he might forever try to be Sky.", "He wasn't supposed to need a nickname. Skyler doesn't need a nickname, etc, etc, etc. That's her stance.", "100% agree with you.", "Does it not occur to her she is probably going to damage her relationship with her son over this, she should probably get therapy!", "I really hope he changes his name. Will shut her up real fast.", "The irony is that I myself find Skyler to be more feminine-sounding and Sky to be more masculine-sounding lol", "Parents that think they can control everything about their offspring just erk me. It's almost like they forgot that the things they are raising are just small humans. Kids are not dumb in the slightest, in fact most kids I know have better common sense and respect for other than most adults. Like you said lying to the kid is just going to cause bigger problems and questions nobody is going to be able to answer.", "I think she's ridiculous. I named my kid a name that has many nicknames, and we called her one of those nicknames from the day she was born (to the point when she found out her proper name she thought she was nickname realname lastname, like her real name was her middle name). She's eight now and wants to go exclusively by her real name not her nickname, and as her parents it's an adjustment and more of a mouthful to say, but we're following her choice to identify herself how she wants.\n\nYour sister really should have chosen a different name for her kid if she wasn't going to accept common nicknames of it.", "Unfortunately common sense just isn’t that common. She can live with the consequences of her actions. Her hating it is probably pushing him to use it more lol", "Nope. I think this is one of those \"he will see that I am right!\" things.", "Ofcourse not she probably one of those parents who think she is always right because she is the parent.", "She can't even see how the more she pushes this, the more that kid is going to dig his heels in.", "I've always known both to be more unisex. But just like with other similar names, they can sound more masculine or feminine depending on the people you have met with the name and even sometimes personal style influences how it can sound.\n\nIt's just so strange to me to think it's a huge shock Sky would be used when Sky(ler) is his name. Oh well lol. I'll never understand how her mind works on this.", "It's the same in my experience. A kid will use whatever name and pronouns you tell them you prefer (for yourself). They can make some of the best (meaning random) compliments lol. At a certain age they are also starting to pick up on stuff that makes no sense.", "That's too bad, ywbtah if you lie, I'm glad he has an uncle who is looking out for him and your best move is to let him know you will always be there for him!", "I'm sure you are right unfortunately.", "I was genuinely surprised when someone said Shelby is a rather feminine unisex name. I only knew a guy with that name, and he was an Alaskan fisherman. He was definitely manly lol. As you said, who you've known with a particular name is very influential.", "NTA\nThis is making me laugh so much. Do you think she was \"showing everyone\" how she is \"fixing\" your name and making it better, thus proving her original point about your parents not considering your future; showing that she is a better parent and is considering her son's future by giving a \"substantial\" name? Now she's stuck in a mess of her own making, but I wonder if the original intent was to gloat about it.", "NTA, ironically, my one daughter is named Skyler, i also hate it being shortened to sky. when choosing her name, i was well aware that some people would shorten it and decided to put my big girl pants on at get over it as i love her name. at the end of the day, my daughter is happy to be addressed as either name, and that is what matters.\nyour SIL needs to get over herself.", "NTA\n\nShe wants you to tell him that you hate your own name, so that he will also hate it and stop using it. That is some top shelf liquid absurdity shes trying to serve.\n\nShe hates the nickname this much but named him that... talk about reaping what you sow. Some people...", "Your SIL needs something to do. On the list of stuff that is important this is on page 983 between\n\n\"Are we eating too much garlic as a people?\"\n\n\nAnd \n\n\n\"I wonder where Ben Franklin's kite is now.\"", "Uhm… did she just continuously insult you/your name while trying to demand a favor?\n\nNTA, tell her to kick sand and block her number. Poor kid btw :/", "Sky isn't even a nickname for Skylar. It's the diminutive. \n\nYou never pick a name if you hate its diminutives. That's common sense. \n\nNTA", "Nta but you are so nice I would have been much ruder and harsher with her", "That poor kid. His mother is unreasonable, in that she can’t empathize with other people. She’s treated you badly more than once, like you don’t have your own feelings and perspective, or like your perfectly reasonable perspective isn’t valid because it’s not hers.\n\nThis is not a good attitude for a parent to have.\n\nShe needs some help. For your nephew’s sake, she needs some help.", "[deleted]", "Any name can be shortened if you try hard enough!", "**NTA** \n\nYour SIL is being silly.", "Skyler is an \"amazing name\" to her; to the person she gave that name to, not so much.\n\nNTA", "NTA and even if you agreed why would you help a woman who has been so incredibly rude to you. Also for what it’s worth I think your name is awesome.", "NTA- She shouldn't of named her child Skylar if she hates a common nickname so much", "NTA-Too bad her intellect is more “substantial.”", "NTA", "Growing up my mum made it clear how much she hated the natural nickname for my name; our relationship was rocky, and in my early teens I started going by that name out of pure spite. I still do.\n\nShe's making this much more of a deal than it is, & he's going to take it to heart & act out about it if he hasn't already.\n\nNTA", "NTA. Her behaviour is inconsiderate, rude and controlling.", "Nta.sil needs therapy", "Well I guess you could tell the kid that John Wayne's real name was Marion, so it's ok to have a girls name.\n\nI mean who in the right mind names a boy Skyler, and then thinks it weird when he tries to masculinise it.  So sick of crazy people giving their kids \"beautiful\" names without a thought as to how they will play out.\n\nI worked with a lady who seriously wanted to call her child \"Tuesday\" if it was a girl.  She wasn't impressed when I pointed out that she would grow up to be called \"Cheap-arse\".", "NTA. One thing I think most parents don't realise is that, ultimately, children name themselves.\nSure, Skyler is a beautiful name but Sky feels like a Sky, not a Skyler. \n\nShe needs to get over herself. Her feelings about the name Sky do not, and will not ever, supercede Sky's desire for a name that feels like his.", "I think you know the answer already 😂\n\nNTA. Plus, bonus points for reaching that most delicious moment when you can drive a crazy annoying mentalist *even* crazier with a simple \"I would prefer not to.\" 😁", "NTA people tend to shorten names and she is delusional to think that people will say Skyler when he himself shortens his name to Sky.\n\nYou are right not to lie for her stupid decision.", "NTA. I vetoed a TON of names i liked when naming our boys bc I hated the nicknames associated with that. It doesn't matter what you want to you want to call them, it's what they want to be called.", "I love the karma of it.", "NTA She needed to be told the logic she should have seen before naming her son.  You are a legend uncle 🙌", "NTA, and Sky is a superior name than Skyler in my book.", "NTA. She sounds like one of those slightly unhinged baby name people. In the end, her son is his own person and has the agency to determine if he wants to be called by a nickname... whether she likes it or not.", "NTA\n\nYou're right.\n\nBTW, I have had my real life nickname for 25 years and almost everyone uses it, to the point where I likely won't react to bring called by my actual name.", "NTA\n\nThe audacity. To insult your name and then ask you to lie about hating your own name. You didn't go far enough OP. She's entitled to her own opinion on your name but the rudeness and disrespect to your face is unacceptable. \n\nYou were right that she was an idiot for not thinking her name choice through.", "NTA. Kids will decide for themselves eventually. I had a friend Dave in high school and whenever someone would call and ask for Dave, his mom would say “Oh, you mean David?  Sure, I’ll get him”.   And another friend whose mom called him Michael but only she was allowed. Everyone else had to call him Mike.   And my daughter is only Caitlin to me, everyone else calls her Cait.", "NTA. Some people are just so exhausting and she sounds like one of those people. Not to mention, gendering things like names, clothing, hobbies, etc… are man made constructs meant to uphold patriarchy.", "Wait until she finds out she also can't control other, more important aspects of how her child identifies, thinks, and believes.\n\nMomma's in for a rough time, lol\n\nEdit: the supportive uncle is NTA. The mom is, though.", "NTA - Your SIL sounds insane. Sky a girly name? The dude that played Sabertooth in the first X-Men film was a former pro wrestler named Big Sky in WCW. He was also Sky Walker on the indys, which might be a fun nickname your nephew.", "But she's spent seven years on her current hobby!", "She's high on her hatred for the name Sky lol.", "She needs to learn that her child is a separate human being with his own thoughts and identity, not an extension of herself.", "there needs to be a whole other category of AH for some of these people because AH doesn’t seem to cover it. like i can’t even wrap my brain around naming your kid something almost deliberately so you can set up a scenario in which you have to fake self loathing for her pleasure. this seems like such a creepy long con power grab that took years to unfold", "A power trip", "Skylo Ren?", "I can understand that more. Like if you can live with it and accept it can happen. But to hate the short version AND to be like no, no going by this, no calling her this. To me it makes zero sense. Like you said you were well aware it was likely to be shortened to Sky at some point in time.", "I think you have the wrong post there.", "Ann?", "Seems to be a bot copying a comment from OP\n\n https://www.reddit.com/r/AmItheAsshole/comments/13jvu2e/aita_for_telling_my_sil_that_i_wont_lie_to_her/jkh6a3s/", "Sky is a cool name. There is an Indian cricketer whose name is Suryakumar Yadav. He's adored and called SKY by cricket fans everywhere.", "I have an Uncle Thomas who *hates* the name Tom. Refuses to answer when called Tom..it's bizarre.", "I am this person. I HATED the name Nessie. I called my cat Vanessa. I am the one who calls her Nessie, because that's what springs to mind for any normal person. I have now gotten over my hatred of the name Nessie, because that is what a sane person would do. I really don't understand your SIL.", "I’ll call you Robert, and Bob’s your uncle.", "Ma'am you're already cuckoo banana cream pies is glorious. GLORIOUS. I am already trying to work out how to get it into conversation.", "She’s gonna be mortified on the day Sky finally snaps at her, she’s deluded in her thinking.", "Does she not interact with people much?", "Whaaat the heck happened 😂😂😂 This is not the post I read! 👍 Thank you!", "An, easy", "I don’t think that’s bizarre at all. I have a 3-syllable name with several common familiar variations/nicknames, none of which I like. I exclusively use my unabbreviated first name, and don’t answer to anything else. It’s my name, and I get to choose which version I’ll use. If I’ve told you what to call me and you use something else, that’s just plain disrespectful.", "I can understand why someone would not want to be called “Uncle Tom”", "It's actually quite common for people themselves to hate nicknames of their names (or prefer nicknames and not their actual name). Not at all normal for someone else to have a problem with what someone calls themselves though, that's a weird issue to have.", "Get a job involving customer service\n\n(Jk, don't 🤣 source: Approaching 20 years in customer service)", "😂", "It's okay!", "In 10 years she'll be going \"why doesn't my son talk to meeeeeee?\"", "He’s 7. Good chance he’s using Sky BECAUSE it pisses his mom off. Tell her to lay off and take away the appeal of sky being the rebellious name and then maybe he’ll change his mind in time. Or he won’t, but telling a little boy they CANT do something only ever makes them want to do it more.", "I wonder if she will be still thinking that as she sees the rear of his car vanish from sight when he is old enough.", "Hahahaha I have a small biz and my gods sometimes customers are A LOT. Idk how you have done 20 years and not throttled someone 😂", "Also, TOTALLY NTA for yours", "Or she'll be crying that everyone else convinced her son to go by a name she hated. Or she'll blame me. Either way it will all be someone else's fault."]}