{"id": 17472, "submission_id": "13k0vgi", "title": "AITA for not moving house for the family business?", "selftext": "I (23M) live in a city about 60 miles from my job in my dad's business, which is in my hometown. I drive 90 mins there / 90 mins back everyday. I don't mind it, it can be nice to just drive and be with my thoughts, but the mileage and the fuel make it very expensive.\n\nI'm on a decent salary, worked here for 7 months. I've learned quickly and had chance to have some input into the business (mainly improvements to internal systems etc) but I wouldn't be client facing for another 2 - 4 years.\n\nMy dad has just told me he wants me to move back home in July, which would involve me giving up my life in this city, including my relationship. When I said I'd never get to see my friends, he said \"just make new ones\". My girlfriend and I want to move in together and this demand has put that in jeopardy, which she is upset about. I've said I'm more than willing to commute for another year and then move, even increasing my hours in the interim etc, but I'm not ready to uproot myself and commit all my assets and my life to the family business yet.\n\nHe suggested I buy a house somewhere half way, and he'd loan me money to do it. But I don't want to commit to buying this early on if it isn't where I want to be. It would require all the money I have, plus a financial obligation to my dad.\n\nIn response to me not moving, he's told me I have to leave my job. He's angry at me for it and has brought up all the sacrifices he has made (none of which I was told about til now) to give me this career. \n\nI don't know if this is something I want to commit to for the rest of my life yet. I want control of my own career and my life outside of work - I don't want to be the \"son of\" who is bound by golden handcuffs.\n\nHe gets angry and bombards me with long texts late at night (including work nights) - this time is no different. He texted me last night saying he does not believe my relationship will work out (he believes my girlfriend has manipulated me), I am throwing it all away for no good reason and I won't survive in the challenges of a \"normal\" job. He said I'd be up against people such as him who are \"highly determined and take no prisoners\". He doesn't believe I can nor should do it make my own way.\n\nTo add background, I've been groomed for the family business since I was 14. I did economincs/finance at university and took extra qualifications at the same time so I could get a head start, instead of doing computer science (what I wanted to do) - yet he says I have made zero sacrifices.\n\nI understand my dad's frustration, but I have no wish to fall out with him. I see this as an opportunity that was well intentioned, but due to his impatience and his need/want to retire, it isn't working out. I don't blame him for that.\n\nHowever, I feel I have been forced into committing my whole life to his business only 7 months in. I'm at a crossroads, but I am leaning towards leaving (even if I'm being forced anyway).\n\nAITA?", "created_utc": 1684327885, "permalink": "/r/AmItheAsshole/comments/13k0vgi/aita_for_not_moving_house_for_the_family_business/", "score": 129, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I decided not to move to a different city for my dad's business. I feel I may be the asshole because I would be throwing away my career with him and turning my back on the opportunity he gave me.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nWhy does your commute matter? He's not the one making it. Or is he mad he can't control you? Or if you move closer, will you be expected to drop everything you are doing to rush in to work?\n\n>he's told me I have to leave my job.\n\nWell then, I guess you need to look for a job closer and go back to school for computer science. Ultimatums are a way for someone to control you. He's trying to control your life.", "NTA\n\n\nBut this can't go on. You need a job for a normal employer, one who does not complicate things with  all these emotional manipulations. The sooner you get a job that puts some distance between you and your (somewhat tyrannical) father the better.", "NTA your dad is abusing you, the texting alone is grounds for blocking, you may not wish to fall out with him but I think it would be better for you if you did.\n\nSort your boundaries out, don't let anyone treat you like garbage.", "NTA.  Start looking for a new job in your city.  You sound like you're highly qualified and need to establish your own independence.", "NTA. Go get a job away from him, even if you do eventually run the family business, you should be exposed to other work environments before that happens. It will make you a better leader when/if the time comes.", "Easy solution if you do want to work for him. You are being asked to give up your entire world for an alleged promise to take over the business. Your dad claims to be a \"highly determined and take no prisoners\" guy. So do that. Talk to a lawyer, get him or her to write up a contract. That if you do X, you get Y. As an example, for every year of work, you get 5% of the business. If you are fired, you get cashed out immediately. I'd be a dick and include a clause that if he disputes the contract later, he has to pay your legal costs. Have an minor up front stake as well. Make sure notarized and any other advice the lawyer tells you. Keep multiple copies, including a scanned copy in the cloud.\n\nIf he says no, tell him his decision is accepted and walk. Because that's what a take no prisoner guy would do, right? If/when he complains, tell him you're only being the businessman he taught you to be. Would he want a son that wasn't highly determined?\n\nUnder NO circumstances should you work for the guy without a contract. You could slave away for years, and then your dad could rug pull you at any moment. Look up the AITA about the plumber guy whose dad gave the company away to someone incompetent. With a contract, you don't have any of those worries. If you get a rug pull, you get paid.\n\nDon't mention it to him, but once you own a stake, you're not just an employee. You're an owner. Even minority share owners have rights. A lawyer can explain them to you. He'll be able to get away with a lot less BS in your life.\n\nHonestly, I wouldn't work for the guy period. Your dad sounds like he wants a clone, not a successor. Anything you do that isn't 100% what he would do sounds like it will result in a screaming session. Dude wants you to date who he wants, live where he wants, work where he wants, etc. Screw that. If you want to work with your dad, you need to make it clear he is your employer, not your owner. Do not tell him who you are dating. Don't tell him where you live. Don't tell him how far your commute is. Tell him exactly what you'd tell your boss. That you're there when you are there, and when you're not, it's not his concern. He can whine to the Department of Labor and US Army that slavery was outlawed. Not you. Because that's what a take no prisoners guy would do.\n\nYou'll learn the business working as the owner's son. But you'll have a skewed view. Working for other folks will show you how other companies work and provide frames of reference.\n\nGood luck either way. But this is your life. You are not his property. Act accordingly.", "NTA: Are you doing your job well? Are you using your commute to not finish tasks? Are you late or leave early?\n\nThose are the things he has the right to complain about. He cannot tell any of his employees where they can live or with whom. This includes you. There are tons of posts about family businesses where the owners think their children are indentured servants instead of employees.\n\nIf the commute gets to be too much you could get a crash pad by work for the week and stay with the girlfriend on the weekends. Lots of people have such arrangements. Whatever you do is *your* choice though, not his.", "23 is not too late to go back and study CS. Do that.\n\nStory time: My best friend from school and his dad: his dad, self-made millionaire, insisted son study business to be his successor  - friend was NOT keen (I forget what he did want to study). Dad won, friend studied business, but dad remained a hard-nosed bastard and eventually broke with his son anyway. So there was my friend, never studied what he wanted, had studied and work experinece in a field he did not enjoy, no business to take over, and no dad speaking to him. In his 30s. yay. \n\nTLDR break free now.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (23M) live in a city about 60 miles from my job in my dad's business, which is in my hometown. I drive 90 mins there / 90 mins back everyday. I don't mind it, it can be nice to just drive and be with my thoughts, but the mileage and the fuel make it very expensive.\n\nI'm on a decent salary, worked here for 7 months. I've learned quickly and had chance to have some input into the business (mainly improvements to internal systems etc) but I wouldn't be client facing for another 2 - 4 years.\n\nMy dad has just told me he wants me to move back home in July, which would involve me giving up my life in this city, including my relationship. When I said I'd never get to see my friends, he said \"just make new ones\". My girlfriend and I want to move in together and this demand has put that in jeopardy, which she is upset about. I've said I'm more than willing to commute for another year and then move, even increasing my hours in the interim etc, but I'm not ready to uproot myself and commit all my assets and my life to the family business yet.\n\nHe suggested I buy a house somewhere half way, and he'd loan me money to do it. But I don't want to commit to buying this early on if it isn't where I want to be. It would require all the money I have, plus a financial obligation to my dad.\n\nIn response to me not moving, he's told me I have to leave my job. He's angry at me for it and has brought up all the sacrifices he has made (none of which I was told about til now) to give me this career. \n\nI don't know if this is something I want to commit to for the rest of my life yet. I want control of my own career and my life outside of work - I don't want to be the \"son of\" who is bound by golden handcuffs.\n\nHe gets angry and bombards me with long texts late at night (including work nights) - this time is no different. He texted me last night saying he does not believe my relationship will work out (he believes my girlfriend has manipulated me), I am throwing it all away for no good reason and I won't survive in the challenges of a \"normal\" job. He said I'd be up against people such as him who are \"highly determined and take no prisoners\". He doesn't believe I can nor should do it make my own way.\n\nTo add background, I've been groomed for the family business since I was 14. I did economincs/finance at university and took extra qualifications at the same time so I could get a head start, instead of doing computer science (what I wanted to do) - yet he says I have made zero sacrifices.\n\nI understand my dad's frustration, but I have no wish to fall out with him. I see this as an opportunity that was well intentioned, but due to his impatience and his need/want to retire, it isn't working out. I don't blame him for that.\n\nHowever, I feel I have been forced into committing my whole life to his business only 7 months in. I'm at a crossroads, but I am leaning towards leaving (even if I'm being forced anyway).\n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "No is a complete sentence.  If your willing to undertake the commute and the associated expenses there should be no issue.  Your life, live it. NTA  The family business isn't dependent on where your home is.", "NTA\n\nEvery word you wrote about father feels like he’s emotionally manipulating you into doing what he thinks is best for you. He wants you to give up your life, your relationship and your happiness. He then says that your job is so disposable only seven months in. If that’s true (and I’m betting all he’s saying is pure bull crap) then giving up control of your life to buy a house with his “help” is his logical fallacy. \n\nHe should want you to be happy and support you. He doesn’t want that. He wants a say in your life. He doesn’t respect that you have the ability to make your own decisions, think for yourself and to determine the course of your life.", "Time to find another job and remove your fathers power over you and what “he wants/allows you to do”. This won’t improve and is only going to get worse as he has all of the authority over your work/career.", "I’m sorry but this whole set-up is bonkers. You seem like a practical person with a marketable degree and now with business experience. You do not have to work for your father and if he’s acting like this then I advise you to look elsewhere for work. NTA", "NTA\n\nYour boss shouldnt be able to make your life choices, father or not.\n\nIf he is laying you off, wait for the official paper to come. Idk where you live, but many countries have a \"layoff w/o motive is illegal\" law. I get that it is your family after all, but this should give you a buffer time to look for a better oportunity out there", "NTA. Why does it matter where you live? Are you getting there late to work, or have missed client meetings because of your commute?   Your dad is using emotional manipulation against you.  A regular employer wouldn’t fire an employee just because of where they lived if there were no performance issues otherwise.", "I read this as OP has another job locally, and Dad wants him to give everything up *except* the business. \n\n\nDad wants to retire and is trying to force the son to just replicate his life, take over his commitments and business, but that's not how having kids works.", "Why do you think I didn't move to my hometown in the first place 😉 was never going to put all my eggs in one basket after the upbringing he gave me", "I've been working on setting boundaries the past few years. He has none and respects no ones. I was never taught to have boundaries, I'm having to teach that to myself.", "I'd say I'm well qualified for my age, but sadly the only thing I know about working outside a family business is what my dad has told me. That is, it is extremely difficult to get anywhere and everyone is out to get you. Either way, I think I need to find out for myself.", "After all this it would be naive of me to think otherwise. Sadly once I leave I am not allowed back, as he will just sell it. \n\nIt's a massive shame, but it's somewhat out of my hands now.", "I don't really have the money to get a second place back home and for me drop everything to go live in Carlisle now means leaving my girlfriend on her own, who's about to embark on her career as a doctor.\n\nI have been late about 4 times, but that was confined to the first 3 months and was we're talking like a minute late. I never made excuses, but it was hard adjusting. I've booked my ideas up and always get in early now, sometimes before people who live 10 mins down the road.", "With the way UK Higher Education funding works, though, it's going to be really bloody tricky unless you can get certification for things you've learned independently regarding CS.\n\n\nYou only get support for one degree, they're structured differently in terms of building the classes you take / majors / minors etc. It's not as easy as getting a second Bachelor's here sadly", "It's all the more silly when you consider that he suggested I do still live in my city only 3 weeks ago, and even offered to contact a friend who has a rental property available. (Didn't mention this in the OP because of the 3000 character limit).\n\nFrom reading all the comments here and talking to close friends, I realise that he is the one making this decision, not me.", "Yeah I wondered if it might be something like that.", "Your father is lying to you so you don't look elsewhere.", "NTA - Leave. Do not take the emotional abuse he is putting your through. You have skills that will translate to many other places.", "I probably could find a way to do an MSc, especially if I got alumni discount in my uni city. Really though, it's easier and cheaper to teach myself Python or something. Opens the door into FinTech etc.", "yeah, I know, I went back and started again in England at 29, it was brutal, I studied f/t and worked p/t. But I don't regret it.", "Clearly it wants more for you and it’s tied to the business he owns. The house half-way isn’t a bad option, but drag your feet a little, cutting your commute won’t be bad and you’ll still be able to see friends in the city. See if the house can work for your gf’s commute and if not, see if she can make it work.", "I think it might be healthy for you to leave the family business.\n\nYou weren't allowed to study what you wanted while in college.  You  are already chained by the golden handcuffs.\n\nYou haven't told us of the sacrifices you father has made, but he has also made demands, tried to control you.  Calling / texting after work hours would be a no no for several businesses.  He doesn't respect that boundary.\n\nYour father sounds abusive.  He certainly has no problem remain, or insulting you.\n\nNTA", "NTA and I would tell dad to mind his own business, that if he keeps this up you will quit and find a new job in the city and he wont have to worry about firing you.  You have your own life and you need to live it and not live it according to your dad.", "NTA you need to live your own life.\n\n*\"Dad I appreciate everything you have done for me and the opportunities provided.  I need to prove to myself that I can make in on my own, I want to grow and build the skills that will make my successful enough that I could come back and take over the family business if I wanted to.*\n\n*I think we should start to advertise and bring someone in to take over my duties.  I will stay on and help train them, and transition out to build my own career so the business is not impacted.*\n\n*Love you Dad\"*", "NTA. Since OP's dad fired the first shot by saying he doesn't take prisoners, I'd stick it out and see if I'd actually get fired. If I did, I'd sue for wrongful termination.", ">In response to me not moving, he's told me I have to leave my job\n\nThis is *literally* what you were protecting yourself against.\n\nLeave the job and the company, and strike out on your own.", "NTA- Don't listen to your dad, you can totally find another job. My dad is a mother hen too, I empathize with your situation.", "NTA \n\nYour father showed his true colors. He doesn't treat or respect you as an employee. He has blurred the father-son/employer-employee relationship. Find a new job ASAP.\n\nI worked for my dad a bit, it's a hard line to walk. I quit over the blurred line.", "Don't sacrifice your life for a parent. Parents need to understand that they don't own their adult children and adults get to decide what they go to school for, where they work, who they date/co-habit with because if they don't, resentment stalks along until someone goes nuclear. \nI regret letting a parent talk me into going to school for something I was interested in but couldn't see a future in. I live with that regret every bloody day. I could have been happy and successful by now if I had followed MY plan. Now I have to work a shit paying job to save up for school again, spend a few more years in school while stuck living at home. \n\nAvoid the traps and do what's right for you. If there is no one to take over the family business then that's on your dad for not hiring competent people to do the job. That, or close up shop with blaming you. If you have kids, remember these feelings and don't continue the cycle. Everyone thinks they know best but only you know what's best for you.\n\nEdit: NTA", "I dont think Dad wants to retire.  I think he wants to micro manage the son's life.", "You father doesnt respect you as a human being, as an individual.  He wants to control you.\n\nFor your own mental health, walk away.  Leave the job and go NC.", ">That is, it is extremely difficult to get anywhere and everyone is out to get you.\n\nUm...no. If you know what you are doing and do well at it, you will go places, even if you have to move companies to do it.\n\nEveryone is not out to get you. That's paranoia. More likely something said to keep you working for him.", "As you’ve been “groomed” for this life for so long it might be worth having some therapy to unpick everything. It’s one thing to have a controlling parent and quite another to throw away what might be a lucrative future venture if you can get a handle on your relationship with your father. Try and separate the two things if you can. If it’s all too enmeshed then Pops might have made you do the very opposite of what he intended.", ">That is, it is extremely difficult to get anywhere and everyone is out to get you.\n\nUm...no. If you know what you are doing and do well at it, you will go places, even if you have to move companies to do it.\n\nEveryone is not out to get you. That's paranoia. More likely something said to keep you working for him.", "Your dad is an unreliable source of information. \n\nHe told you that getting a job away from him would be hard and full of backstabbing and drama because he wants to keep you where you are. \n\nIt sounds like you have a degree somewhere in the business/economics/finance sector, and that makes you extremely employable. Start applying for jobs, and go read some off the posts at www.askamanager.org to get a more realistic picture of what a lot of jobs are like. \n\nYou have so much more power than you know. I’m rooting for you.", "It is out of your hands. You didn't make the ultimatum, he did.\n\nAlso, he'd never allow you to take full control, he'd always be over your shoulder micromanaging. I've known parents like him and it's best to get out from under them.", "NTA\n\nHe has no right AS YOUR BOSS to determine WHERE YOU LIVE!  \n\nAs long as you are doing your 8 hours a day he can pound sand and I'd start looking for another job. You can stand up to him and his \"take no prisoners\" attitude now or fold to him forever. Find another job - live your life. He needs you more than you need him.", "Nta", "I'd stick with doctor girlfriend over controlling father. You need to find another job. NTA.", "With a degree in business and finance, you can get plenty of jobs. I would start job hunting on the qt for now and see what you can wrangle before making decisions. If you can swing at least two offers, then you can sit down and make a better choice of future options.\n\nAlso, if you like CS, by all means take some classes - there are tons of cheap classes at night schools at universities, community colleges, and online such as couseusa. They can often open doors for your passion. Where I used to work, many took classes in python, as it was something useful for the business and allowed folks to get better jobs within the company and be more productive - YMMV", "NTA.\n\nI am reminded of the tale of Jamie Dutton, who did everything his father asked of him, to preserve the family legacy, and his father hated him anyway.", "This sounds like the kind of thing that a person would say to keep someone in an abusive relationship, particularly if they had no other experience to compare it to. \"No one will treat you better than I will.\" \"You're not good enough to make it with someone else.\" \"I've done so much for you, why won't you just do what I tell you? Don't you *appreciate* all the things I've sacrificed for you?\"\n\nYeah... No. Hello. Adult professional in my mid-thirties here, weighing in. I had no family business to join, but I've found work with four different companies over the years and no one was ever out to get me. Yes, some bosses sucked and some jobs didn't pay me what I was worth, but overall both my managers and co-workers have been awesome, supportive people who helped me find opportunities to advance and contribute. Longest I've ever been unemployed since college was two years during the pandemic and honestly, I wouldn't even consider myself a 'well-qualified' worker. Just a normal qualified one.\n\nThere's a whole world of adults out here who will treat you with dignity and respect in the work place. Don't let your dad scare you away from joining us.", "You can probably disregard most, if not all, of what your father has told you. There are bad employers... but it kinda sounds like you have one now. There are also good employers, and it will be hard to do worse than what you have now. NTA", "OP your dad sounds controlling- I doubt he will ever fully give you the reins to run the business. I can almost guarantee he will come up with excuses to not let you be boss. If he does “retire” I bet he will then continue to go in and tell you all the things you do wrong (even if they are the right moves) bc he wouldn’t do it that way.  NTA - go back to school and get the degree you want instead of what you felt obligated to do", "Op get a job somewhere else and cut the strings. This won't stop with you just moving. seems your dad feels entitled to decide for you despite you being an adult. NTA"]}