{"id": 17509, "submission_id": "13kerr1", "title": "AITA for yelling at my wife for always making me help her?", "selftext": "Throwaway for obvious reasons. My (35) wife (35) always volunteers to do everything. Yet she always manages to drag me into helping her. A friend of hers paid her to make a weeks worth of dinners for their family. She asked me as soon as she got paid (three weeks ago) if I could help her roll burritos, as she can’t do it anymore because she has arthritis. I stupidly said yes, thinking she would handle it and I was a last resort. She asked Monday morning if I would still be able to help her and I said yes, thinking she’d be finished before I got home from work. I get home from work and she immediately asks if I can help roll the burritos now. I yell and ask her why she doesn’t have this stuff done already, since HER friend was coming soon, and why she always expects me to do everything for her. SHE signed up for this, NOT me. If she can’t do it on her own, she shouldn’t sign up for it in the first place. Besides the fact that she’s not even making any money on this, since every penny she got went towards the groceries to make the food.", "created_utc": 1684359114, "permalink": "/r/AmItheAsshole/comments/13kerr1/aita_for_yelling_at_my_wife_for_always_making_me/", "score": 115, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Am I the asshole for yelling at her because initially told her I’d help her, even though she waited until last minute?\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YTA for agreeing then going back on it. Communicate better.", "YTA. If you didn’t want to do it, you should’ve said this at the first place, so she could rearrange something, but you keep saying Yes to her and then dropped the bombshell.", ">She asked me as soon as she got paid (three weeks ago) if I could help her roll burritos, as she can’t do it anymore because she has arthritis. I stupidly said yes, thinking she would handle it and I was a last resort. She asked Monday morning if I would still be able to help her and I said yes, thinking she’d be finished before I got home from work. I get home from work and she immediately asks if I can help roll the burritos now. I yell and ask her why she doesn’t have this stuff done already, since HER friend was coming soon, and why she always expects me to do everything for her. SHE signed up for this, NOT me. If she can’t do it on her own, she shouldn’t sign up for it in the first place.\n\nMassive enough of a YTA that I question whether or not this is real. She didn't 'make' you do anything. She asked you for help, you lied and said you would when you wouldn't and then verbally abused her when she tried to hold you to your word.", "YTA. If you didn't want to help don't say yes I'll help then yell at her for her expectation that you'd help. I don't get how you could think what you did was okay.", "YTA.  \n\nIf you feel like your wife is unreasonably involving you in projects that you have no interest in, then you have a conversation with her to the effect of “hey, it would be good if you checked in with me before agreeing to anything that’s going to require me helping out, because I might not always have the time or want to be involved”.  You don’t yell at her like a big dumb baby.", "YTA. She asked for your help. If you didn't want to do it, you should have said no rather than continuing to tell her yes, as you secretly hoped she'd have it done without you.", "YTA. You agreed to help and then tried to worm out of it. Just say you don’t want to help.", "YTA.\n\nYour wife didn’t drag you into helping her. You said you would help her, not wanting to do it and thinking it would already be done by the time you had a chance to help her. Then when she asked for help, you flipped out.\n\nHave a calm and clear conversation telling her you won’t help her for anything she volunteers for.", "YTA\n\n\"If she can’t do it on her own, she shouldn’t sign up for it in the first place.\"\n\nRead that 3×. Do you hear yourself? Read it again.\n\nMy brother in Chris. If you never had any intention to help in the first place, you shouldn't have agreed to help her either.", "YTA Why didn't you say no? She isn't making you do anything, she asked and you said yes.", "Sounds like YTA here. If you don't want to help or be involved, then you shouldn't have gotten married. If you love someone, then you should be a decent human being and be proactive and take initiative to help her, especially since she has arthritis.", "YTA. She asked you and you agreed. She was merely holding you to the word you gave her. It's sad that your imagination did not manifest into reality. So may be next time intead of hoping for a divine intervention, open your mouth and let the words out? It might help immensely. \n\nAlso, please let your wife know in a decent manner that her pursuits are her's  and you will not help in the future.", "YTA\n\nWhy did you say you would help her when you didn't mean it? Why didn't you COMMUNICATE with your wife that you weren't going to help her with this project or that you did not want to be involved with so many volunteer projects?", "YTA\n\nBeing someone who has arthritis and mobility issues, I can testify that life starts to get very small in what you can do all by yourself.\n\nI’m sure that she asks for your help because she wants to feel useful and fulfilled in life.  Without your help, she can’t cook for people.  It must give her great pleasure to plan, shop, and prepare food for someone who will appreciate the food she made and gush about how great it was.  She will feel good about herself. (Do you say thank you when you eat the meals she prepares?  Do you give her yummy noises?)\n\nI know it’s easier for you if she doesn’t volunteer to do things. But realize it’s giving her a bit of freedom to still accomplish stuff.  Don’t make her feel like she is a burden.  Enjoy the time you get to spend with her while she is doing something that she likes to do.", "> I stupidly said yes\n\nWell, at the very least, you are able to admit that you are stupid.\n\nYou said you'd help her TWICE with zero intention of actually helping her and then threw a tantrum when your shit ass weaponized incompetence plan didn't work. YTA", "Yta for agreeing multiple times and then blowing up. Have a conversation. I fully expected to vote in the opposite way based on the title and first couple sentences.", ">My (35) wife (35) always volunteers to do everything. Yet she always manages to drag me into helping her.\n\nFirstly, have you heard of the whole \"love languages\" thing? Maybe for your wife, doing things for others is how she shows she cares?\n\nShe is not the one who \"drags\" you into helping. She asks you to help, and you said **yes**. That's on you. Instead of setting a clear boundary and telling her you do not want to help, you said yes.\n\nThen you dragged your feet and dicked around hoping she would do the task without you and you wouldn't have to follow through on your yes. But she made it clear that she needed your help.\n\nWhen your promise was called in, you yelled at her. That's not kind or loving. You made the promise in bad faith and then yelled at her when you were asked to follow through.\n\nSet better boundaries. Apologize for yelling at her and explain that while she enjoys these acts of service, you do not and you will setting clearer boundaries regarding your contributions to her goodwill gestures.\n\nYTA", "Yta. She asked for your help and you said yes now you’re surprised that she expects your help? If you don’t want to help say no it’s not fkn rocket science.", "YTA.\nYou agreed multiple times and expected to never have to ACTUALLY DO WHAT YOU AGREED TO", "You're TA. This isn't about her volunteering (ok maybe a little too much) but you're unwillingness to support your partner and general lack of communication which is infuriating. You saw this coming and saw it not being done, but watched and waited until the last minute so you could be angry. YTA.", "YTA for sure. What made you think your help wouldn’t actually be needed? You claim she does this all the time so seems like a very poor calculation on your part, maybe the way your wife makes miscalculations on how she can help someone;  only difference is it seems your wife had a modicum of good intentions.", "You really like yelling at your wife, huh? YTA", "You sound very emotional. It’s probably difficult for her to understand you when you’re so hysterical. You should calm down and smile more. YTA", "Yta for telling and not just seeing a normal boundary like a normal person.", "What you have here is a failure to communicate with one another and to set boundaries that goes deeper than this situation.  When you are calm you guys need to sit down and have a talk about this dynamic.  \n\nBut agreeing to do something, and then getting upset about it is a AH thing to do.  If she knows that you do not want to be involved in these things, and she still assumes you well well that is not great either.", "Are you serious? She asked you several times and you committed each time. Then when it came time to actually follow through with your commitment you throw a hissy fit? A real man would jump to help his wife. YTA", "\\>  I stupidly said yes, thinking she would handle it and I was a last resort.\n\nand\n\n\\>   She asked Monday morning if I would still be able to help her and I said yes, thinking she’d be finished before I got home from work.\n\nYTA cause you can't or won't properly communicate what's on your mind.  Stop assuming she's a mind reader and work on your communication skills.", "ESH, she shouldnt commit to jobs like this if she can't handle it and its not profitable enough to be worth the hassle. \n\nBut you're the asshole too because you repeatedly told her you would help when you had zero intention to do so.", "ESH.\n\nSeveral other people have correctly pointed out why you're TA.\n\nYour wife though I believe is TA for repeatedly signing herself up to do things she knows she can't do and expecting you to help.  And picking things she can't do to begin with.  If she can't roll burritos, then burritos weren't the right choice to make.  I highly doubt she would just be fine if you said no from the start.", "ESH. She shouldn’t be taking on tasks she can’t do herself. You shouldn’t be agreeing to help when you don’t intend to.", "ESH\n\nYou shouldn't commit to something you really don't want to do and your wife shouldn't commit to something she knows she's going to need help with.", "NTA for being annoyed by this behaviour but please don't yell", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nThrowaway for obvious reasons. My (35) wife (35) always volunteers to do everything. Yet she always manages to drag me into helping her. A friend of hers paid her to make a weeks worth of dinners for their family. She asked me as soon as she got paid (three weeks ago) if I could help her roll burritos, as she can’t do it anymore because she has arthritis. I stupidly said yes, thinking she would handle it and I was a last resort. She asked Monday morning if I would still be able to help her and I said yes, thinking she’d be finished before I got home from work. I get home from work and she immediately asks if I can help roll the burritos now. I yell and ask her why she doesn’t have this stuff done already, since HER friend was coming soon, and why she always expects me to do everything for her. SHE signed up for this, NOT me. If she can’t do it on her own, she shouldn’t sign up for it in the first place. Besides the fact that she’s not even making any money on this, since every penny she got went towards the groceries to make the food.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Info: what activities Is She into? And how often you help her?", "YTA. You agreed to help with something she can’t do herself anymore, and then yelled at her for it? I couldn’t imagine my partner doing that, and I’m disabled as fuck. \n\nYou will need to deal with the fact that you’re both getting older and need to help each other. If you’re not willing to do that then what are you even with her for?", "YTA - she asked if you would help roll the burritos and you said yes. You assumed she would have them done by the time you got home, knowing she asked for your help due to arthritis, and that's on you. You sound like a little kid with communications issues.", "You're a 35-year-old that cannot say NO? You're a 35-year-old that that said YES to helping her, and then you yelled at her about it? Grow the hell up. If you don't want to help her, when she asks for help, say no. It's not that hard to do.", "you keep saying yes, and then getting mad when your wife expects you to live up to your commitments.  there is literally nothing wrong with that.  learn to say no if you don't want to do it.  she doesn't \"manage\" to \"drag you\" into anything.  she asks, you agree.  that's on you, bud.  YTA.\n\nETA: there is nothing wrong with expecting someone to live up to their commitments, not with getting mad at someone for expecting that.", "YTA - Communication is key, if you don’t like it then speak to your wife instead of yelling at her. She’s probably terrified of you given the way you act, so she’s not going to be the one to start the conversation. Grow up.", "YTA then why did you say yes?", "YTA\n\nQuestion for married folk on the sub, do married couples just yell at each other more often over time? Seems like in a lot of these posts one partner is yelling at the other, or they're screaming at each other. It just seems so unnecessary and makes my heart hurt :(", "If you didn’t want to do it, then you should have simply said “no” in the beginning.  Instead, you played a stupid manipulative game of evasion.  When that didn’t work, you bullied her with anger and yelling.\n\nYou’re a huge AH.", "YTA. You said you would help, didn't, and yelled at your wife about it.", "YTA If you are not going to help graciously say no. And this is your wife who has arthritis and needs a hand and you don't want to help her roll a few burritos?  SMH", "Just say, “no thank you, I don’t want to participate but thanks for asking.”\n\nDon’t agree to help and not follow through. YTA.\n\nAre you annoyed? Probably. \nShould you communicate that? Absolutely!", "YTA And genuinely, you seem kind of slow if you think saying yes and then screaming at her when she asked you to do it makes sense. \n\nIs your IQ -4? Come the fuck on dude.", "YTA. You agreed to do it so you shouldn’t yell when it’s time to get it done. That said, you need to sit your wife down and tell her you no longer want to be involved in any more of her volunteer projects. Tell her if she cannot do it herself in a timely manner then she should not volunteer.", "YTA. Fact that you’re 35 and still expect someone to “just know” after you told them the opposite of what you feel is a bit mind boggling. \nHave you even had a conversation where you clearly state how you feel about these projects she picks up? Somewhere along the lines of “I know you like to do that and I admire it but I personally do not want to be involved in them. So please do not ask me“ if you completely don’t want to do it ever. And even if she does ask you, you tell her right away “I’m sorry, I made it very clear last time I do not want to be involved, so I assume you can respect that and plan your time accordingly”. \n\nIt is 100% on you to first agree to help hoping you won’t have to and then actually having to do it. You agreed- you keep your word. \nShe must have been mad confused and upset that you yelled out of no where when she asked you nicely and you agreed. \n\nThis doesn’t only go for your wife but for any interactions with humans. You say yes or no based on whether you actually are okay with doing it.", "Yta she didn't volunteer you though????? She asked. You said yes.  Why didn't you say no???????", "YTA. You can scream and cry about how she signed up for this, not you, but you did sign up for this by agreeing to help her. Learn to say no or shut up and roll the damn burritos", "YTA. You told her \"Yes\" at least 3 times, then yelled when she expected you to help.\n\nAlso, STOP YELLING AT YOUR WIFE!!!!", "You A for yelling at your wife.", "YTA. Your wife's not a freaking mind reader.  She asked if you'd help. You said yes. and you said in an earlier comment you didn't say no because you didn't want to seem like a jerk, but then you yelled at your wife for expecting you to help when you said you would and somehow, that doesn't make you a jerk?", "YTA. You actually did sign up for it. three times.", "Wife: “will you do this thing?”\nOP: yes I’ll do the thing\n\nWife: are you still good to do the thing?\nOP: yes I’m still good to do the thing \n\nWife: okay it’s time to do the thing \nOP: HOW DARE YOU ASK ME TO DO THE THING?!?!", "Agreed. OP needs to learn to say no. They basically lied to the wife hoping it would just be done before they had time to help, then took it out on the wife when she still needed assistance. \n\nOP, if you don't want to help with things, just say so. She is the one who volunteered, she can figure it out. And if she can't do it alone, she can find someone else to help her or maybe she needs to reconsider how much she volunteers. But you need to communicate with her.", "Couldn't summarize it better. Was going for E S H, but I agree with you more. OP backpedaling at the last moment awards the YTA. Wife less so, but dude, talk more...", "This I can agree with, I should’ve probably just told her no to begin with.", "She should’ve known that I didn’t want to help her with this, especially after working all day. And I don’t even like this friend. She said she would’ve done it herself if I didn’t want to and why didn’t I just tell her I didn’t want to, but I didn’t want to seem like a jerk.", "I told her that Monday morning and she said she understood, but I’m not sure if she really did, because she just looked sad and like she wasn’t listening.", "Do you really believe his story that she gets his help with everything? Couldn’t imagine a least trustworthy person than op", "she doesn't volunteer him, she asks for his help.", "She said she doesn’t do it for the money, she does it knowing they can’t afford much and she wanted to be assured that they were eating good for at least a week. She said she made sure she broke even and wasn’t paying for anything herself, because we don’t have a ton of money, either.", "She has arthritis and it sounded like her joints got worse between saying yes and having to do it", "She’s into reading and sewing, when her hands don’t hurt. I mostly drive her around because she can’t drive due to her arthritis. And she always asks me to roll burritos or tamales for her when she makes them because her hands hurt.", "Some awful twist on third time's the charm?\n\nMaybe the wife should have done that with their wedding?\n\n\"Yes I'll marry you.\"\n\n\"Of course I want to get married let's plan it.\"\n\n\"What do you mean do I take him? Of course not!\"", "An expectation of mind reading in a relationship is never reasonable. Wife can't reach middle ground or plan for things with bad information coming from OP.", "Yeah, I'm not getting into the relationship issue of the wife taking on things she can't handle and then dragging OP in. That's more a relationship sub issue. But OP agreeing multiple times then backing out isn't cool. Just say no and deal with the fall out.", "Exactly. You basically did the same thing you're angry at her for doing. Saying yes in the moment to something you know you either can't or won't be able to do.", "Why should she have known that you didn’t want to help her when you didn’t say that? Is she supposed to read your mind?", "YTA. You have to communicate. \"She should have known\"? No. When she initially asked, you should have said you wouldn't be able to help instead of agreeing multiple times and then yelling at her.", "So you yelled at her to not seem like a jerk?", "Why should she have known? Can she read minds even though you told her yes?", ">  She should’ve known that I didn’t want to help her with this\n\nHow is she going to know this? She can't read your mind", "Then say no. AH", "Why do you keep resorting to yelling instead of you know... talking to her like the adult you're supposed to be? YTA. You can't be mad that she expected you yo help her do something you agreed to help her with. Grow up", "Why? Did you have a sign on your head that said I DON'T want to help, ESPECIALLY if I've been working all day? I don't like your friend? \n\nAnd yes, you came off as a jerk. \n\nThis isn't a case of \"I can't read your mind\". It's a case of YOU said yes, took the chance that you would NOT have to do it, and got upset when you LOST that gamble.\n\nYTA", "You said in the post that you said \"yes\" to her request on Monday morning.\n\n In any case, you seem to have agreed to have help her on multiple occasions. Next time, let her know the first time around itself that you will not do it. Giving false promises is not exactly the best foundation for a relationship. Making yourself clear intially itself can help you not feel guilty.\n\n .", "[removed]", "hmm, you make a good point.", "I updated my comment", "True.  I will update my comment.  Thanks for pointing that out.", "Do you hear yourself? Your wife is being so kind and generous for her friends in need. She asked you kindly for help and then double checked with you and you consistently told her it was ok. When it came time to actually help her, your immediate reaction was to yell at her. YTA massively. \n\nIf you don’t want to help, say no the first time and suggest foods that won’t be impacted by her arthritis. But dude, the better course of action here is to nurture this kindness of your wife’s and help her because she sounds lovely and you sound like an asshole and eventually she’ll see that.", "omg, this getting worse the more i read.  she's offering to help those in need?  she probably knows what that feels like, and has a big enough heart to help others out.  and she isn't in it for the money, she's literally doing it out of the kindness of her heart.  why are you so angry with her?  literally why.", "She should’ve have known because I yelled at her a few months ago when she asked me to help toll tamales for the holidays. She knows I hate it and have other stuff to do. I do agree that I should’ve just said no to begin with.", "Sorry, I meant Monday evening was when I got home from work and she asked again if I could roll them because she had all the stuff reading and made and awaiting me. That’s when I yelled. I did initially tell her yes a few weeks ago and Monday morning before work. I’m finishing up at work, and got distracted.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). If we’ve removed a few of your recent comments, your participation will be reviewed and may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "this 100%.", "If only we could upvote on the basis of sound, humane humanity. A bajillion arrows pointing north", "you keep saying \"she knows\".  the holidays were months ago, that was a completely different incident that has nothing to do with this one.  and you keep saying \"yes\" when you mean to say \"no\".  that means \"yes\".  so no, she doesn't know.   try talking to her like a normal person, rather than expecting her to read your mind and know everything, and then yelling at her when she doesn't.  she's her own person and has things on her mind too.", "Why are you always yelling at your wife for her asking you to do things? You sound like a really nasty person to be married to.", "Don't yell at your wife. You seem to have normalized that.", "Quit yelling at your wife", "First, stop yelling & actually *talk* with your wife about things that bother you. Yelling doesn't help anything. \n\nSecond, she didn't volunteer you to do anything. She asked you multiple times & you agreed each time which means you signed yourself up to assist her. \n\nThird, if you don't want to help her then *tell* her no when she asks you if you will help instead of agreeing & then yelling at her when she's expecting you to honor your word & help. \n\nShe didn't cause this problem. You did by constantly agreeing while hoping she would be done before you had to honor your agreement. Communicate with her if you have a problem, but stop yelling at her & being an AH when she asks you to help with things you've agreed to help her with.\n\nEdit to add judgment: YTA", "So you don’t want to seem like a jerk but you keep yelling at your wife instead of communicating?", "So you make a habit of yelling at your wife?", "This is your fault. Not your wife’s. You agreed then backed out and yelled at her for it.", "YTA for agreeing and then holding it against her for asking her to do what you agreed to. Word of advice. Say no next time.", "I really should stay out of this sub when I’m drinking. I have SO MUCH TO SAY.\n\nI said Yes, thinking she would handle it. \n\nWhat the hell is wrong with you? She has arthritis. She thought you were going to help her. YTA\n\nOMG. You signed up for it too when you said you would help!!\n\nWhere’z my husband? It’s time for my weekly post-Reddit “I sure appreciate you for not being a TOOL.”", "YTA", "Another post another man who just hates his wife\n\nYTA you are verbally abusive", "ESH. Her for volunteering for things then dragging you into it. You for agreeing to help then throwing a fit when asked to do so. Don't agree if you're not going to follow through.", "Esh. \nYou more than her. \nYou need to set clear boundarie.", "YTA She isn't a mind reader", "YTA. Lol just roll the burritos dude. Why did you snap when it was time to actually do them? So you know she has arthritis and agreed to help her thinking you wouldn’t actually have to help her?? So you just expected her to roll through the pain? AH.", "Did you not hear the words coming out of your mouth? You said YES to helping her, multiple times. She can’t hear the part inside your brain where you think “wow I really shouldn’t need to help and I hope she will have this done so I don’t need to”. Plus, yelling at your partner is a horrible way to communicate. YTA", "You're the asshole...why yell...to prove your power over her...your poor wife...I'd be filing divorce...you yelled at her because you didn't want to help her...think about the emotional toll on her..she's in enough pain with her arthritis...asshole", "YTA YOU AGREED. Communicate better or suck it up", "YTA. \n\nYou’re a bad husband. She didn’t volunteer you. She asked if you could, you said yes. She double-checked, you doubled down on being willing to help. She says “okay, time to help” and you explode at her? What is wrong with you?! Don’t yell at your poor wife because you have communication issues. Probably don’t yell at your wife at all. You sound borderline abusive. \n\nAnd so what she asked you to help during the holidays? You should be helping your wife prep food for the holidays and she’s not even asking much?!?", "YTA. You did sign on to this when you told your wife you would help.", "Dude. Stop yelling at your wife. Stop saying yes when you mean no then punishing her for it. \n\nYTA", "YTA. If you didn't want to do it you just had to say it. If you never addressed the topic with her, and just came here to ask for our opinion, please know that you are doing terrible with your communication skills.\n\nOr do you also have trouble saying no to things? That would be an additional problem. You can perfectly decline in a calmed manner. It is just so much easier. So you have just created this problem now.", "ESH Your wife for being a doormat to her friends, since she didn’t make any money. And you for going back on your word. You’re both exactly the same. You both agree to things you shouldn’t do.", "YTA \n\nWhy did you keep saying you would help her if you didn't want to help her. Why would you yell at her for asking you to help her do something that you already agreed to help her with.", "YTA. \n\n>My (35) wife (35) always volunteers to do everything. Yet she always manages to drag me into helping her.\n\nWhat a LIAR. She ASKED if you could help. YOU SAID YES. You AGREED. You were just angry that she really asked you for the thing you agreed to do and decided that screaming to shift blame and abuse her would be a good way to get out of the commitment you took on.", "YTA why even say yes?", "Sounds like she was waiting for you to have time so that you could roll burritos together since you agreed to help her, and you were waiting for her to eventually give up on waiting for you, push through her arthritis and just do it herself. This could have been avoided if you had just been honest and said you didn't want to help her but you strung her along until you were so tired of her asking that you yelled at her. YTA", "[removed]", "YTA! You AGREED to help her....repeatedly!!! You don't say yes and then get to be upset about doing it", "YTA. She's not making you help. She's not volunteering *you* to do anything. She asked if you could help. You agreed. She confirmed that you could still help. You said yes. You're a giant AH for yelling at her and making shit up about how she's always making you help.", "YTA. You are upset at your wife for signing up to help people. You then proceed to sign up to help your wife. Are we the A H for calling you out in your hypocrisy?", "You could have told her how you feel to begin with, and you wouldn't have had to yell. YTA.", "YTA, in more than one way. Telling your wife you'd help, then getting mad at her for expecting you to help is definitely AH territory. \n\nYelling at your wife for any reason is not okay. It's AH territory. It sounds like you stewed about this all week, building up a head of steam, and then blew your top.\n\nExpecting her to profit off her friendship. You don't say why the friend wanted your wife to cook dinners. So your level of AH-ness here is dependent on the answer. If she's incapacitated in some way, that would level up the AH-ness.  \n\nBut the biggest thing that screams AH to me is how cavalier and dismissive you are about your wife's arthritis. It must be so painful for her, physically and emotionally. You act like she chose it, just to justify asking you to help her.  Guess what? I bet a million internet dollars your wife would very much prefer to not have arthritis, and be able to roll burritos.  She didn't leave it for you because she's lazy. She left it for you because she needed help with doing that. Help you told her you'd give her. You should think long and hard about what \"for better or for worse, in sickness and in health\" means as part of marriage vows.", "Grow up and say no when you don’t want to do things. Whether or not your wife should get into these situations is irrelevant—she absolutely should not have to figure out when you mean you’ll actually help and when you just feel too guilty to say no. YTA", "??  YTA! You agreed to helping her. 3 different times. And then you yelled at her for expecting the help you agreed to! The irony of this is completely lost on you haha you’re doing the same thing you’re complaining she is doing.", "YTA you told her you would help despite having no intention of helping. You’re a huge asshole.", "YTA. Why would you agree to help and yell at her when she asks you to help?", "If you didn't want to do it,  you should have said no.\n\nYTA because you agreed while thinking you'd get out of it. Don't be a dick in the future,  just use your words. You yelled at your wife for asking you to do something you told her TWICE you would do. That's not even a question.  Of course that makes YTA", "YTA, stop yelling at your wife. It sounds like you  resent her for her medical condition, which also makes you an A.", "You signed up for it the moment you said yes to helping her. YTA.", "YTA, you literally asked for this. Do you hate your wife or do you enjoy saying yes to help then being a prick about it?", "YTA. How are you a 35 year old adult, and yelling at your wife is a default whenever she asks you to do something you don't want to do? You could've just said you didn't want to without yelling. Be an adult and communicate with her instead of blowing up at her when she can't read your mind. It's perfectly reasonable for her to ask you for help when you had already agreed to help her earlier.", "This is on the border of e s h and y t a, but I think ultimately, YTA, simply because you agreed to help, confirmed that you were going to help, and then yelled at her when she actually expected your help. I agree with you that she shouldn't be signing up for things she can't manage and then  voluntelling you to help her do it. But, you aren't communicating in a reasonable way. You can't agree to help and then lash out when it comes time to roll up your sleeves. You need to sit her down and have a calm conversation about her overextending herself to the point that you have to begrudgingly step in.", "YTA. Say no the first time if that’s your real answer. Screaming at your spouse for expecting you to do what you said you’d do - twice - is fucked up.", "ESH. OP for agreeing more than once and then at the last minute blowing about it. Wife for agreeing to do something she could not do without asking hubby BEFORE she agreed. She basically volunteered him without his OK and only asked him afterwards.", "Dude... if you didn't wanna help roll the burritos, you should have just said no. If this is an ongoing issue that you've been frustrated about, you should have calmly approached your wife and had a civil discussion about it. Saying you'll do something and then yelling when you're expected to do the thing is gross and mean. YTA\n\n(Not to mention she has arthritis, obviously she's going to need more help doing things than she used to! Why are you holding that against her?)", "100% YTA . If you didn’t plan on helping why would you say yes not once but twice? You’re not justified in yelling at your wife when you broke the promise to her", "To quote you to you, \"If you can't do it on your own, don't sign up for it.\" You signed up for rolling burritos by saying you'd roll burritos. When it came time to roll, said burritos, you screamed at your wife...... for asking you to roll the burritos....... that you agreed to roll...... YTA", "You know she has arthritis.  So you should know she wasn't capable of doing the task herself.  Why you thought it would magically get done, I cannot fathom. By your own admission, you knew about this 3 weeks ago, yet did nothing to prevent the last minute pressure. \n\nI am pretty sure you already know the answer to the question.", "he must have thought that he is just a last resort, not someone who will make all the job instead of her...", "And maybe have the words not be in the form of yelling …", "No, if my husband yelled at me I’d be showing him the door. It’s disrespectful and mean.  My first husband who yelled at me is no longer my husband.", "Also, YTA, a big one.", "This is exactly how the story unfolded in my head and couldn’t wait to get to the comments section. 😂 I have to admit I chucked at his response when it was time to do the thing he agreed to do.", "This", "After she asked him if he would do the job because she had arthitis.....", "Wait, but then you wouldn't have an excuse to verbally abuse your wife! Sounds like you got exactly what you wanted out of this situation.", ">I didn’t want to seem like a jerk\n\nAnd yet you keep yelling at her……", "That makes no sense, I dislike a lot of stuff and still help people I care about doing them, because I care about them. If a friend asks if I help them moving for example, they don't assume I like it, they ask if I am willing to do it anyway. \n\nShe probably knew you didn't WANT to help her, but you agreed to anyway despite of it, so how should she know, that you never planned on helping in the first place?! It's not like something changed.", "Sounds like you don't like your wife either. YTA", "So… What you are telling us is that you are of the opinion your wife should know you are a liar who can’t be trusted to tell the truth or follow through on his word? Cause that seems to be what you are telling us. \n\nWeird… that’s not a thing I’d want my partner to “know” about me. YTA. \n\nThe whole reason she asked the second time was so you could let her know you would really prefer not to help…", "You didn't want to seem like a jerk so instead you ... screamed at your wife for asking for your help?", "You kept saying yes.  She was supposed to magically divine that she can't trust anything that comes out of your mouth because you're a LIAR whose words mean nothing and that you actually meant no?  Cause that's what you're saying here - that's what you're admitting to being.\n\nWords have meaning.  Learn to communicate like a mature adult.  You're way more of an AH for lying and having horsesh\\*\\* communication skills than she is for accepting projects and then asking for help from the person who took vows to be her partner in life.", "Lol well the jerkstore called and they’re looking for ya! 😂", "[removed]", "People aren’t mind readers yo. Say what you do and don’t want. Don’t expect people to just know.", ">but I didn’t want to seem like a jerk\n\nThat ship has sailed.", "Then, use your big boy words to tell her, “No”.", "Then, use your big boy words to tell her, “No”.", "Well, you certainly seem like a huge jerk to most of us now. Congrats.\n\nYour wife is trying to do a good thing. And she's trying to involve you in something that matters to her. Ever heard of bonding? She's asking for what is, realistically, an extremely minor amount of effort on your part. And you're yelling at her. \n\nI am thankful you're not part of my life and I am truly hopeful that you learn to be a better, more loving person to your wife.", "Good thing you avoided seeming like a jerk 🤣", "Good job not seemingly like a jerk. /s", "So just so we're clear, instead of being honest with your wife because you didn't want to seem like a jerk, you lied to her and then screamed at her for believing you? And then you come here wondering if you did something wrong?\n\nAudacity, thy name is Dramatic-Professor64", "No, she isn't a mind reader.\n\nShe asked you if you would help, you said yes.\n\nThen you decided to yell at her for asking to do the thing you said you would", "So, she really doesn’t force you to help her with her activities does she? In fact, she didn’t force you here either; she asked. TWICE. And you agreed. TWICE. \n\nYTA and you should really treat your wife better. It’s okay that you don’t want to help her roll the burritos. It’s not okay to just say yes and hope she doesn’t then actually expect/rely on you. It’s not okay to scream at her for something you agreed to do.\n\nPlease take a look into why you’re so angry. This really doesn’t feel like a yelling scenario.", "Wooooooow you are a terrible husband.", "YTA but mostly just like a bad human? I do stuff I don’t want to or like to do literally all the time for the people I love.  It is exhausting but it’s not so exhausting that it is debilitating and if it is I just tell them that truthfully and they reassure me it’s not a big deal and ask someone else.", "I also imagine she does this because it makes her feel useful when she’s literally disabled at 35. It’s beyond horrible to feel like you’re not contributing to anything. If she can cook *most* of the meals independently help a friend eat well *and* have something to do it sounds like a good thing for her. She asked for help with one thing and you said yes to helping her. Don’t agree *multiple times* if you’re not actually willing to help", "Julienne! Do the thing!", "Lol right 😆 \"I didn't want to seem like a jerk\" how's that working out for ya??", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Are you often verbally abusive to her?", "Stop yelling at your wife a$$hole", "Or she thought you only yelled at her like an asshole because you were stressed in the moment and didn't think you were just in fact an asshole.\n\nEspecially since I'm not seeing anything here about talking to her like she's an actual person or something, just you yelling.\n\nYour wife basically didn't think you were an asshole and took you at your word, how terrible! Jesus wept.", "Firstly stop yelling at your wife and show some fucking respect to her as a person let alone as your wife.\n\nYTA also for being a massive hypocrite.", "It's causing her physical pain because of her arthritis and you don't want to help? That's not cool.", "I hope she leaves you lmao she deserves a good partner", "Why are constantly yelling at your wife instead of just letting her know you don't enjoy doing that?", "Dude you’re an asshole. Yelling is not the way to communicate. You also are so lucky to not be in debilitating pain and having to rely on others for things you feel like you should be able to do. I also don’t understand how you telling her yes *twice* equates to you not wanting to something. YTA", "YTA you are very mean to your wife. If you don’t want to help her with the things that are important to her, go be single and let her be happy.", "Stop yelling! You sound toxic", "Then you can say something like 'I'm probably going to be very tired but I'm willing to do so if you absolutely are not able to, try not to need me though' or idk, just let her know things. I don't even know how you got married if it's so hard for you to communicate something like this. Maybe also tell her to ask for more money so this effort makes sense.", "Are you more interested in getting to yell, or do you want the behavior to stop? Because if you want your wife to stop the behavior you should tell her no. As it is, it sounds like you want an excuse to yell at her.", "Stop fucking yelling at your wife", "Sounds like you have anger issues. Maybe you shouldn’t be an AH and yell at your wife so much. Maybe sit down and have an actual conversation. “I know you like to sign up to help people but I really don’t want to help. Can you only make plans to make what you can make yourself?”  That was super hard wasn’t it?"]}