{"id": 17520, "submission_id": "13ki29e", "title": "AITA for letting my roommate's food burn in the oven", "selftext": "One of my(23m) biggest pet peeves is people invading in on what I am doing. For example, if I am in the kitchen doing something and step out for a few moments. I hate if I came back and someone has \"cleaned up\" after me. Unless obviously something was in the way or they needed to use something. But I hate when people don't just mind their business and leave stuff how it was. I hated when I lived at home and my mom would tidy up my room when I wasn't around. Nothing crazy but say I left a shirt hanging on my bed frame. I know exactly where that shirt is. Now I am coming back looking for it and it's in a new spot. I ask my mom, she doesn't remember where she put it etc etc. I just am a big believer in minding my own business. I strongly dislike if I am making something in the oven and have a timer set and it goes off and someone takes it out right away and turns the oven off. Usually I want to leave it in a bit longer or maybe that was just the first step and it needed to be checked on. Even if that was the time for it to be taken out. I would much rather people just mind their own things. \n\n&#x200B;\n\n&#x200B;\n\nSo I extend this courtesy to others and its very much in my nature to mind my own business. Usually what other people are doing isn't on my radar and people point out how I am usually in my \"own world\" a lot. My roommate(22f) on the other hand is the complete opposite. She has to be part of everything. If I'm watching something, she asks what I'm watching. If I look at my phone and laugh she asks why I'm laughing etc. It's not a problem. A lot of my friends are like this and I don't find it annoying, it can be endearing. She's like this with everyone. But she grew up in a big household whereas I was an only child so she has some different tendencies. She can be absent minded and easily distracted. She'll almost expect people around her to be watching out for her. She'll have water boiling on the stove and wander to another room. Also she has the annoying(to me) tendency to \"clean up\" after me or other people that are in the apartment\n\n&#x200B;\n\n&#x200B;\n\nShe was baking cookies in the oven and I was in the kitchen eating a bowl of cereal. I was also wearing airpods. She left the kitchen for a while and eventually I heard the oven going off faintly through the airpods but it wasn't my business. Eventually she came rushing into the room and took the cookies out. They weren't burnt to the point where they smelled but her chewy cookies were solid. She told me I should have heard the oven and took them out. I told her if that's what she wanted she should have told me to listen for the oven and I would take them out and that you can't just assume someone will. She said it was rude.", "created_utc": 1684366820, "permalink": "/r/AmItheAsshole/comments/13ki29e/aita_for_letting_my_roommates_food_burn_in_the/", "score": 680, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > What I find annoying others see as common courtesy. Letting her food burn makes me look like an inconsiderate asshole\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "You're NTA in this particular circumstance, but you sound like an asshole in general.", "NTA but we didn't need the long preamble.  In fact, the long preamble makes me wonder if there's a bit of an ESH ruling in order here.  Have you told her in concise and direct terms, without blame, that you live on different terms from her and could use some space and clear communication?", "YTA\n\ncmon mannnnn, you heard the alarm. it takes absolutely no effort to say \"yo, the thing is doing a thing\"\n\ni mean, i guess you dont really HAVE to do ANYTHING for ANYONE, EVER and just \"mind your business\" but thats highly anti-social behavior but I guess if everyone thinks your an aloof jerk you won't have to worry about people being in your business or vice versa", "INFO \n\nHave you ever spoken with her about this? \n\nIt sounds like just different styles, but you would be TA if you just expect her to read your mind.", "You could, at the very least, take the cookies out or inform her the timer went off. Yes, she was careless and thoughtless, but it would’ve required no effort on your part. It's the polite thing to do. \n\nHowever, if you didn't hear the timer because the noise was faint through your AirPods, then you're not at fault. She's entirely to blame.", "I have a question for OP... say you had your bathroom in your room and you accidentally left the water running and went on the road, and your room began flooding. Your roommates walks in and sees this and decides to \"mind their business\"\n\nYou come home, and your stuff are pretty much destroyed and you know your roommate was right there, how would you feel?", "YTA for not just shouting “cookies are done” like a regular human being. You don’t have to take them out and interrupt what you’re doing, but jeez dude, you could at least holler", "Eh I think you could have at least let her know the oven was going off because she obviously didn't hear it. I'm leaning towards YTA.", "YTA, u couldn’t just let them know? do everyone a favor: live alone. some people can’t handle having roommates, and u sound like one of them 😬", "You need to communicate your boundaries and encourage communication from her.", "YTA, and I strongly suggest you dedicate your life to earning more money so you can live on your own, angrily. You send like a selfish brat and I wish your mom's attempts to help you were more impactful on your life philosophy.", "YTA imo. your style is to mind your business, but you told us that you know your roommate is the opposite - so you know she’s ok with people helping her out and not “minding their business” as you’d say. You know she doesn’t find it disrespectful to get involved with her stuff, so your opinion about people getting involved with *your* stuff doesn’t really matter here. Knowing she wouldn’t find it disrespectful if you said something or took them out of the oven, you still chose not to help - and it’s not like you’d have to actually take them out, just saying “oven is beeping” would’ve been considerate and helpful. Sure you aren’t obligated to do that and it’s not your job, but it’s the courteous thing to do, so that’s why I think YTA. \n\nIf you hadn’t heard the alarm, I’d say NTA, but you did. I don’t think it’s smart or safe for her to leave the room with water boiling or stuff in the oven, and maybe you should talk to her about that, but if that ever happens in my house, we just inform the other person to remind them out of courtesy and consideration. In the future, you should probably tell her you don’t ever plan to help her out with these kinds of things, so she’ll know what to expect from you and plan accordingly.", "You just sound exhausting in general, so I'm surprised to find myself typing NTA ...this time.\n\nI have a feeling there's (many) other times where you're not so lucky.", "NAH\n\nBoth you and she have ways of interacting with alarms and ovens that work, but they're not compatible. She was in the middle of cleaning the bathroom, or whatever she was doing, and thought \"I hear the alarm. No problem - OP was in the kitchen, he'll take my cookies out, so I can take a couple of minutes to finish this thing up\". And she's upset that OP ignored her alarm.\n\nWhen OP is baking, he thinks \"there's the alarm I set to tell me that it was about time to pay attention to the oven. I'll go check on it in a couple of minutes, when I've finished reading this chapter in my book\". And OP is upset that flatmate has auto-removed his uncooked cake from the oven.\n\nYou need to talk to each other. You have different assumptions, and are each just assuming that the other one shares your assumptions.", "I'm going NAH \n\nWhen OP heard the oven go off they definitely could have given a headsup to roommate but like why did it take the roommate so long to hear it/what were they doing. Also they weren't burnt soooooooo", "I want to lean towards YTA. How difficult s would it have been for you to run and tell your roommate that the oven went off? You sound like an insufferable roommate who purposely ignored this to “get back” at her", "NTA.", "YTA", "Nta.  You're not her mommy.  She needs to take responsibility not place blame.", "NAH but you sound like you would prefer to live alone. I get it, I’m a fellow only child!", "NTA\n\nShe should have asked for your assistance instead of assuming you'd pull the cookies out.", "YTA -", "NTA, if she wanted you to keep tabs on her cooking, she should have asked you. Walking away from something she's cooking and forgetting about it is dangerous. Extra crispy cookies are the best-case scenario.", "YTA\n\nYou seem to be unpleasant to be around in general.", "YTA all that stuff at the beginning isnt necessary, you should have let her know the timer went off its not that hard.", "Sooooo if the kitchen caught on fire…would you still be minding your own business?", "Did she not hear the alarm? Wtf did she think she was doing walking away?\n\nNTA", "NTA.  There are alarms on phones.  If you really have to walk away from cookies in the oven, you set the alarm on your phone and take it with you so you'll hear it.  If you think you won't be able to be back in time, you ask for help or you wait until you can take care of it.", "NTA…I totally get it and also I get irritated when someone tells me the timers went off…especially when I’m in the same room/house. I can hear it, just like you did. \n\nI bet $10 she heard it too, was doing something else and just thought you would get them 🤷‍♀️", "ESH\n\nThere's a middle ground", "Ima say NTA in this instance because if you’re cooking you need to pay attention to what you’re cooking. So to me it really is on her to that the cookies came out the way they did. That being said, if you haven’t had an explicit conversation about how you operate as far as “minding your own business” you’re reaching into AH territory. You can’t expect people to read your mind especially when they’ve clearly shown that they have a different way of doing things.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nOne of my(23m) biggest pet peeves is people invading in on what I am doing. For example, if I am in the kitchen doing something and step out for a few moments. I hate if I came back and someone has \"cleaned up\" after me. Unless obviously something was in the way or they needed to use something. But I hate when people don't just mind their business and leave stuff how it was. I hated when I lived at home and my mom would tidy up my room when I wasn't around. Nothing crazy but say I left a shirt hanging on my bed frame. I know exactly where that shirt is. Now I am coming back looking for it and it's in a new spot. I ask my mom, she doesn't remember where she put it etc etc. I just am a big believer in minding my own business. I strongly dislike if I am making something in the oven and have a timer set and it goes off and someone takes it out right away and turns the oven off. Usually I want to leave it in a bit longer or maybe that was just the first step and it needed to be checked on. Even if that was the time for it to be taken out. I would much rather people just mind their own things. \n\n&#x200B;\n\n&#x200B;\n\nSo I extend this courtesy to others and its very much in my nature to mind my own business. Usually what other people are doing isn't on my radar and people point out how I am usually in my \"own world\" a lot. My roommate(22f) on the other hand is the complete opposite. She has to be part of everything. If I'm watching something, she asks what I'm watching. If I look at my phone and laugh she asks why I'm laughing etc. It's not a problem. A lot of my friends are like this and I don't find it annoying, it can be endearing. She's like this with everyone. But she grew up in a big household whereas I was an only child so she has some different tendencies. She can be absent minded and easily distracted. She'll almost expect people around her to be watching out for her. She'll have water boiling on the stove and wander to another room. Also she has the annoying(to me) tendency to \"clean up\" after me or other people that are in the apartment\n\n&#x200B;\n\n&#x200B;\n\nShe was baking cookies in the oven and I was in the kitchen eating a bowl of cereal. I was also wearing airpods. She left the kitchen for a while and eventually I heard the oven going off faintly through the airpods but it wasn't my business. Eventually she came rushing into the room and took the cookies out. They weren't burnt to the point where they smelled but her chewy cookies were solid. She told me I should have heard the oven and took them out. I told her if that's what she wanted she should have told me to listen for the oven and I would take them out and that you can't just assume someone will. She said it was rude.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "You just sound like an insufferable AH in general.", "So I don’t mean this to be offensive in any way, but are you autistic OP?  It’s not an insult—but your post seems to indicate a few things that may be symptoms, such as having a specific way you like things to be, being inflexible in people disturbing your patterns, space, or routine, applying your own thoughts about the way things “should be” to other people even though you say you recognize they are different (you cognitively seem to understand that she thinks differently but you can’t seem to think or understand from her perspective), and not picking up on certain social cues.\n\nBecause I am reading deeply into what you are saying, I’m going to say NTA because I feel like calling you an asshole is too far for just ignoring a timer that maybe you shouldn’t have.  To be clear, I don’t think it was the “correct choice” to ignore it but I think there is something else going on here that is preventing you from understanding why this wasn’t the correct choice and I’m not going to call you an asshole for that.", "Exactly! How hard would it have been to yell out “timer went off”", "Because the \"long preamble\"(two paragraphs so long) is important. I see not messing with other people's things as respect. But hey, I could be the asshole. That's why I'm here", "I just assume other people got whatever they are working on. I see not getting involved(unless asked) as showing respect.", "As an only child that grew up with parents that worked a lot and late. I faced most of these things alone. I've been in situations similar to what you mentioned. Left the water running or left something on. So if my roommate didn't turn it off I wouldn't feel any kind of way. It was my fault. Now if I left water running, remembered, called my roommate  who was home and asked her to turn it off. Then I would feel a way if she didn't turn it off.", "Explain why? Because it's not their business if no one asked.", "Cookies take like 10 mins, idk where this girl went with cookies in the oven", "When we were kids, if we heard a timer go off, one of us would run to the center of the house and yell \"beep\" very loudly. It was the quickest way to alert anyone home.", "See?  You said it all in one sentence. \"I see not messing with other people's things as respect.\"  That's what you need to tell her and all your flatmates, along with the tolerance you showed for her background helping to explain her behavior in your mind but not spoken. Maybe just saying something to them all at the same time like, \"we're all coming from different expectations of the best way to live with other people, I like you guys, and I'd like to just lay it out why I let the cookies cook past the timer.  If you want me to do something, ask me directly.\"  Sounds like she might also be a bit of a shite-stirrer so you want to say it to all of them.  And to be clear -- you have a right to that attitude of not messing with people's things as respect.  I have the exact same attitude and would have been really happy if you'd been my roommate or flatmate.  The question, to me, is do you want to be friends with your flatmates or just live with them while you have to and then move on?  If good relationships or even friendships are the goal/s, then being clear and kind is your best strategy.  Your generation is going through hell with tons of mixed signals and too much data pouring into their brains all the time.  Concise and clear in front of many witnesses is sometimes the only way really to be heard in truth.", "No it's not. An issue like this necessitating a reddit post is the real issue.", "but you know thats out of the ordinary right? you know 99.99% of people would appreciate it if you let them know the alarm went off when its obvious they didnt hear it\n\nyou just seem to be a jerk in general. i wouldnt want to spend time with someone who would watch toast burn and say \"ohhh, i thought you WANTED it like that\". How annoying.", "You're NTA.", "Towards you it is.  Towards your roommate it's not. YTA.", "Dude. This isn’t really respectful though. Just so we’re clear. What you see as respectful is not what most people see as respectful. Most people would recognize that water left running when the person isn’t home is out of the ordinary and something that should be turned off so as no it to ruin things/cost extra money etc. Most people would view turning off the water as helpful and generally appreciated not as disrespectful.", "Okay, I get you. Just wanted to make sure you were consistent right through. Going to say NTA.\n\nTbh, it's weird, probably because I grew up differently. But, if that's how you are, that's how you are.", "Because maybe they do. I just generally assume other adults have their things under control", "given you had to explain sooo much how the way you behave is actually respectful because your mum used to pick up for you and it was annoying . I think you know you’re most of the time an AH when you decide to let things go wrong for others under the disguise of “I am actually respecting what mother nature intended would happen”. of course you don’t need to pick up for others but if someone’s stuff was about to be ruined it is not a matter of respect but consideration . Respect: cookies were not in the oven. she forgot to put them in, you leave them there as you don’t know why she left them out. AH: you see the things are going to burn and think “what do I know, maybe she wants them burned and put the timer on to know not to touch them yet but let them overcook”", "everyone makes mistakes homie. everyone gets caught up from time to time.\n\nsounds like you're just generally irritated by your room mate but you're too timid to say anything about it so you saw this as a chance to \"teach them a lesson\" as some weird, passive aggressive revenge for being a ditz\n\nI mean, were you gonna sit there 5, 10, 15 and 20 minutes after you know the alarm went off until you smelled burning? thats just shitty and a terrible waste of bakeware", "Definitely don't hate my roommate. We're pretty chill. Just have different personality types", "Yeah your personality type seems to be selfish AH", "You take a long time to talk about how your roommate is spacey and annoying and about all of your own personal preferences. It was a lot of “this is how I need to do things and this is how my weird roommate does thing wrong”. \n\nYou could have told her the timer was going off, it’s not that big of a deal. \n\nHave you considered that you not telling her about the oven is as upsetting to her as it would be if she had taken your shit out of the oven and turned it off? \n\nHow about treating people the way they want to be treated rather than treating them the way you want to be treated?", "YTA, and lack common sense.\nIf you saved the cookies she'd probably let you have a few.", "YTA. I would hate to live with you", "Team NAH here. \n\nI’m the same way when it comes to not wanting people to interfere with what I’m doing. It messes with my brain and drives me up a wall. If I’m doing a thing it’s because I want it done my way. TBH if I don’t care how a thing is done, I’m likely to ask someone else to do it. \n\nI also think she’s NTA either. She’s just different from you. You and I would probably be compatible roommates.  I think you’re doing pretty well to put up with her. She seems totally fine but would be difficult for me to live with. \n\nThat said, as my husband loses his hearing I’m learning more and more to not mind my own business. If I hear a timer going off I tap him on the shoulder and call his attention to it. I come behind him and turn faucets off and only rarely do I annoy him because he left it running on purpose; usually it’s because he can’t hear it so he forgets about it. So I’d say it’s possible for you to learn to work with each other’s differences. Maybe you can come to an agreement that she will alert you to a timer instead of taking your stuff out of the oven, and will let you know if she wants you to keep an ear out for her timer. Try y", "OP, is there any chance that you are neurodivergent?  Either way I think your perspective mostly makes sense when you explain it but doesn't when you don't.  I don't think she should have assumed you would take the cookies out without asking, but I think the majority of people would expect that you would take them out or alert them when the timer beeped.", "Wow. If you don’t want other people answering your alarms, you should not leave your food unattended.\nSame goes for her", "NTA. She put cookies in the oven which are at most 15 minutes, some as little as 5 depending on size. Why was she wondering so far from the oven when she out something in?? \n\nI would make sure to communicate with her, though that you will not remove something from the oven unless specifically asked to. Communication is usually a good thing.", "If someone is cooking it's 100% on the person cooking to not walk away from the stove/oven. They are solely responsible for managing timers and making sure things don't burn. She didn't even ask you to keep an eye on it. Roommate honestly sounds like an irresponsible fire-hazard, and everyone criticizing you shouldn't be allowed to use a stove. NTA.", "Problem: you have mild autism (true) and she is a female (also true).\n\nThe truth is in the pudding. \n\nAs for the food, I’m neutral. let’s forget about it \n\nIf you’re looking to Reddit for a therapeutic gain, best of luck to you, Buddy.", "Nta", "NTA if she does this a lot.    She sounds irresponsible.   She needs people to stop enabling her", "NTA - I've had many roommates who do stuff like this. Not your problem.", "Nta, if you knew the cookies were gonna burn you would've taken them out. You partially gave the long preamble to point out that you simply were not paying attention to her baking and had no idea what she was doing. You heard the beep and dismissed it, assuming she'd be back in time anyway.  Then just forgot about it and put it out of your mind because it wasn't your business \n\nI wouldn't dare yell at a roommate for not taking my cookies out of the oven. That's 100% her own fuckup lol. But it seems like you guys are on pretty good terms and even though you're really different you can still handle or even appreciate her asking about your funny videos and trying to chat all the time. Being friends with roommates was one of the best experiences of my 20s, really even in my life.  I would apologize to her and explain that you are just different from her and don't pay attention to other people's stuff, and thought she had the cookies covered. Of course if you knew they were burning you would have taken them out. \n\nOn the point of the preamble, you might reconsider adjusting your attitude around people cleaning up after you too. If people are tidying rooms when you leave, it's because they don't want to sit or work in clutter.  In a shared space especially, one item begets more items. I'm sure that was your mother's impulse when she sees a shirt or shoes out.  Annoying as it was for her to go through your room as an adult, most of what she knows about you is having to attend to your every need and you being totally helpless as a child. It was easier for her to pick up one item at a time rather than wait for the entire room to explode with your shit, and therefore this is her habit.  For your roommate, she likely feels the same.  As soon as one person throws a coat down, 5 people do. Putting small items away or folding stuff up is a compromise.  They get a nice clean space, you don't get nagging or resentment directed your way, theoretically everyone can win", "YTA. It takes very little effort to call out to her that the timer went off. Doesn't even require you to leave your chair.", "YTA, because it’s so unnecessary to antagonize the people you live with in situations where it would be so easy not to just by using a little common sense.", "YTA for the simple reason that you would rather make a point than be momentarily inconvenienced on principle. I very much dislike people like you and avoid them at all costs at work. \n\nWhen you have a roommate you do things for each other. You don’t have to take the food out but if you hear a timer and she didn’t you say something. This feels like it’s punitive because she cleaned up in the kitchen and you didn’t want her to. Most people clean as they go. You should try it. Quit keeping score or you’re gonna have a bad time.", "You don’t want your apartment to start on fire, do you? If she wasn’t coming to get it and you heard it, even if she was being irresponsible, your apartment not catching fire is definitely your business. \n\nI don’t know if I have have a judgment based on that fact. Cause I am tempted to say YTA.", "YTA. You knew she was baking. You knew that the oven was going off. There was no reason for you not to take the cookies out of the oven.", "YTA. You shouldn't have roommates. You don't share space well and don't seem to have the interpersonal skills to be able to live peacefully with one.", "Technically, NTA. And I understand why you see this mentality as a sign of respect, but I do think this sort of thing is context-dependent. I do agree that not moving another person' things is good, but sometimes people do appreciate someone stepping in. For example, if I'm walking around with toilet paper stuck on my shoe, I appreciate it when people politely point this out to me. People are flawed and oftentimes make mistakes. Sometimes, what you might see as butting in makes another person's life a little easier.", "YTA - So the cookies weren’t burned to a crisp but overdone. The difference between done and overdone with cookies is perhaps 3 minutes in the oven. So she spaced out for 2-3 minutes and you decided to punish her for that. You didn’t even have to pull them out of the oven - you could have just yelled “Timer!”. She might have even shared some perfectly baked homemade cookies with you if you weren’t such an insufferable roommate.", "NTA. nothing was burned. The cookies are her responsibility to look out for and she should have said something to you. But you sound like someone who should live alone or at least communicate your expectations with those who share living space with you.", "YTA. I'm antisocial, I don't like people getting into my business either and even I find you too much. A bit of kindness goes a long way. Makes me wonder how long are you actually \"stepping away\", maybe other people are tired of cleaning up after you, how about that perspective? It's a shared space.\n\nAnd I would be more than ready to go on a warpath with anyone who touches my oven.", "OP i don't think you're an AH but you, like me, should not have a roommate.  I think things that, as a one off may he mildly annoying are amplified x100 if you're always around someone.", "NTA but I'm not gonna lie all the info you shared makes you sound pretty insufferable. It's not that hard to just be helpful OP.", "Considering your replies to certain comments I'm gonna go NTA because it seems like you weren't doing it to be malicious or anything, you were following your own definition of respect. Perhaps a clear conversation with your roommate about things like this should be had to both reduce possible tension between the two of you and to prevent future scenarios like this from happening.", "The whole time I was reading this I thought, \"Be whoever you want, OP, but it would be hard to be around you.\" Every inch of this post feels... unlikable, I'm not sure why. Maybe because the concept that nothing matters outside of yourself is not an endearing personality trait.", "That was my thought too. Like, how long would she just let them stay in the oven? I hope the roommate has renter’s insurance.", "This is a NAH comment, you may want to correct", "In my family as a kid, whoever was closest to the oven would take whatever was in there out when the timer went off. Then go tell whoever was cooking to check on it. No one turned the oven off in case it needed more time. That’s how I do it now unless someone asks me not too. It literally takes bare minimum effort.", "Yeah that you see the world differently doesn’t make it better. See some see now wrong in using force to get what they want and draw the line in the sand on a different place when it comes to what is okay to them. \n\nJust compare your average drug lord to a Amish person to your highschool teacher to your parents. Everyone has a different stance on violence, who is right? \n\nIMO I do think YTA because what respect is it , to see someone fail? You could have helped, but you have taught yourself that since you find it not necessary it is okay to do so.", "Would you have kept sitting there in the kitchen as the oven started smoking? As the cookies burned? As a fire started? At what point is some basic decency and common sense \"not your business\"? You didn't necessarily have to be responsible to take her cookies out of the oven, but you absolutely could have just yelled out when she didn't show up within a minute of the timer.", "I mostly get where you are coming from. But there is minding your own business and then being ignorant. If she had fallen asleep and the cookies burst into flame behind you, would you have done anything?\n\nYeah it’s bad she ignored the timer or went to where she couldn’t hear it- but would it kill you to call out “timer” when you heard it and she didn’t come back?", "That's a very weird, antisocial attitude. People are meant to be interconnected and to help each other.", "That's adorable.", "Our family always yelled, \"Timer, check the freezer.\"  Origin story...my mom once put some soda in the freezer for a quick cool down and set the timer but didn't tell anyone and left the house. We all heard the timer, but the oven wasn't on, so we had no idea what it was for. 6 hours later, when she got home, it was a heck of a mess.", "I'm glad my sister and I weren't the only ones that did that", "It’s kind of funny that this massive paragraph you wrote is to promote the benefits of brevity.", "Agreed. Made me think of the videos where you see a bird adorably mimicking some sound.", "It really is adorable.", "Here is where I lean toward you being an AH. You criticize your roommate for assuming you would know she wants you to pull the cookies out, but you assume everyone else \"heard the beep,\" so to speak. It takes nothing to say, \"Hey, a timer went off.\" \n\nYou also keep talking about respect, but your words drip with condescension.", "Wait, you’re saying you assumed your roommate was just letting a timer go off without responding on purpose?", "YTA don’t be obtuse.", "NTA OP, you are my people. Probably get downvoted but, whatever, I wish I could live with you lol\n\nIf someone went on about a timer I'd say 'thanks' but inwardly be a bit annoyed. I am not an idiot, I know I'm cooking. If someone actually touched my food and took it out of the oven like some of these comments are suggesting I'd be bloody livid! Do not mess with my stuff! \n\nLike, yeah, obviously if it catches fire or something then I'd expect you to turn it off or yell out because that's then an emergency that effects everyone. But cookies being slightly overcooked? NOT an emergency. And some people like them that way anyway!", "ESH she shouldn't be leaving her food in the oven unattended as you could have not heard the timer but you did hear it and intentionally left it, when you know that she cooks things to the timer so it was going to burn, all you had to do was call out, you didn't even have to get up, feels like you were trying to teach her a lesson but the fact is that could have started a fire which would affect both of you, petty technicalities isn't worth ignoring safety risks", "Wow, I wouldn't like to be your roommate", "NTA", "YTA", "NTA", "YTA and I have to wonder why so many people feel the need to clean up after you. You didn’t take them out because?  Common courtesy isn’t so common.", "Reasing your comments, YTA for living with other people despite your trenchant antisocial attitude. You want to be like that you should live alone.", "Reasing your comments, YTA for living with other people despite your trenchant antisocial attitude. You want to be like that you should live alone.", "YTA \nWhen you step out of the kitchen for \"moments\" how long are those moments? Maybe you're gone longer than you think? \nMaybe she doesn't like a dirty kitchen. Maybe she thinks she's helping, or maybe you make more of a mess than you think. \n\nCleaning up after people that come to visit is a hostess thing to do. So she's trying to be kind and keep the place tidy. It makes me wonder of you're kind of a slob? \n\nShe was likely going to share/offer you cookies, I don't understand why it was such a chore for you to take them out or let her know. \n\nYou just sound self absorbed,  it doesn't sound like you appreciate her at all and you're extremely judgemental. \n\nShe cannot read your mind, how is she supposed to know she's offending you if you don't tell her? I don't understand people that think this way. \n\nDo better!", "YTA. If she was in the other room, out of earshot and the alarm went off, why wouldn’t you at least holler and say something? also cookies usually just go in for like 10-12 minutes and then out immediately. they’re not over complicated so it’s obvious the timer is to signal that they’re done. this whole post seems like you’re jumping through hoops to defend yourself for just generally being unhelpful and not very kind. you seem like the kind of person that would start pushing the close doors button when you see someone walking towards your elevator.", "ESH because she should tell you but like at what point do you get the cookies out? If this were me, id yell \"hey the timer went off, should i take them out for you?\" But if the precedent is set, she will also have to learn not to assume you just will do the thing that needs to be done. Especially baking something.", "I'm inclining to ESH. She could have asked you to either call for her or get them out when the timer was done and you could have told her it was done and if she'd like for you to take them out. \n\nI get you, you hate when people \"clean up\" after you when you didn't ask, especially if you're cleaning up after yourself anyway when you're done. I hate that too, but there's a difference between minding your own business and common courtesy.", "Not a people person, eh?\n\nI’m going with ESH.", "NTA. Devil's advocate here, but if she put the cookies in the oven, then she should have had the sense to know that although she set a timer, not to go too far out of earshot (think literally going into the next room, as opposed to upstairs or something). Sure you were close by, but you had your own thing going on (you had headphones in for Christ's sake) and she shouldn't have just assumed that you would man the cookies. They only take 10-15 minutes to bake, if that, and can burn/overcook super fast. This is like her pouring whisked eggs in a skillet, walking away for (what seems like) a second and being upset at you who's say, sitting in the kitchen listening to low music and reading a good book, when she comes back and the eggs are a bit scorched on the bottom. Or if someone's child wandered off somewhere when you were behind them in line at Walmart and after a frantic panic, they find you and scream at you because you didn't look out for the child. It's about being accountable for your actions (or lack thereof) and having situational awareness, which your roommate apparently didn't have.\r  \n\r  \nNow, if you could clearly smell the cookies burning, and you still left them inside the oven, you'd definitely be the AH.\r  \n\r  \nAlso, the people judging him for being the person he is and having his quirks/pet peeves (like we all do) is kind of messed up", "YTA. For not telling her it went off.\n\nBut I, too, hate people messing with my stuff", "YTA I'd hate to live with someone like you. Decent people help each other out, selfish ones DGAF", "YTA\n\nYou could have just told her the alarm was going off. You didn’t have to turn the oven off or take the cookies out.\n\nIt also shows your roommate how you want to be treated in the kitchen too, next time you are cooking she would probably come and tell you your timer had gone off.", "NTA and you sound like a good roommate. Minding your own business is a virtue in shared housing.", "YTA. Only child here. I am also sensitive about my stuff generally and my private space.\nMinding your own business is not a problem. But you are taking it to the extreme. \nIt seems like your roomate is completly normal friendly person but you are full of \"I am a loner\".\nMaybe it is not completely your fault, but I recommend to consult this at the therapy. It looks like your parents seriously neglected you emotionally.", "After reading your comments, yta on this situation. Also stop defending your weird view of “respect” by saying you were an only child. In the adult world most of us try to help eachother, so maybe it’s time to broaden your comfort zone a little huh?  \n\n“Your timer’s done!” Is a super easy place to start.", "nta, she didnt ask you to take them out.  at most i would have turned the timer off, yelled, and went back to my cereal.", "NTA, buuuut….would you still have not done something if they started to burn, cause smoke, and then catch fire? What’s your threshold for stepping in? Only when it directly causes you a problem? You sound like you just want to justify never helping or doing anything for anyone ever", "You've got a very add only child personality which ends in some amount of unawareness and selfishness. I say this as an add only child. You're nta  by technicality, but do try to be aware of how you treat other people and be aware that you have to tell other people how you feel. When you didn't really have to consider anyone else previously (including how to effectively communicate with them in a way that won't hurt them), it can be especially tough to navigate people that come from large households.", "You're an ahh in general, it's common courtesy to at least let someone know their timer went off when it comes to cooking instead of just ignoring it. What if she had a bathroom emergency? You don't mind if your stuff burns, fine, other people don't want burned food. People get distracted sometimes. You're taking the whole \"mind your own business\" thing too far. Yes, people should stay out of your private life and out of your room but, not wanting the house to burn down or wanting to keep it clean IS your roommates business so she is literally minding her business. It's her home too. Clean up after yourself and maybe she wouldn't feel she needed to do it. You said she should have told you if she wanted you to turn off the oven/take the cookies out (if you leave them in a hot oven they'll still overbake from the heat even if the oven is off)/let her know the timer went off right? Maybe you should do the same. If you want it to just be checked or it has more steps let her know \"hey this won't be done when the timer goes off so don't turn it off please\". When you live in a house with others, expect them to do things like clean or turn the stove/oven off when a timer goes off because it's a common courtesy.", "Ok, so I am going to refrain from calling anyone an AH on this post because there just isn’t enough info to make a real judgment call.  I can actually relate to OP in terms of being possessive of one’s belongings.  I don’t like it when things get moved around and sometimes interpret that as interfering with something I didn’t want touched.  That being said, certain things in an apartment are communal: the kitchen area and the living room area.  There are expectations for cleanliness and organization in these areas and it is up to the roommates to communicate with one another about what is ok and what isn’t.  If you leave your shit everywhere, don’t be surprised if your roommate gets mad.  On the other hand, if someone does something innocuous like leaves their jacket on the back of a chair or something, that is probably an example of something that doesn’t need to be “cleaned up”.  Talk to your roommate about these expectations.  If you can’t meet in the middle on basic apartment stuff like this, you shouldn’t be living together.  \n\nI’d also say, in regards to your post specifically, that you not wanting to interfere with your roommate baking something is OK.  Hell, if your roommate is doing this frequently, you DEFINITELY need to tell her that it’s not your responsibility to participate in such events.  However, it doesn’t really make sense to be a “mind-your-own-business” absolutist if your roommate makes a mistake that also could affect you should you choose to ignore it completely.  It’s seen as common courtesy because you live in apartment.  I’m sure you can think of less extreme examples that, should you have been the one to make a mistake, you would have felt appreciative that your roommate helped out.", "NTA in this case since she didn't ask you to check and it's not like things were actively burning, but you need to communicate about this cause you do sound a bit like an AH in general. \n\nFor the average person, it would be normal to at least say something when a timer goes off, even if they wouldn't take stuff out themselves. So it's not exactly weird that your roommate found it rude that you ignored it. So, talk to her, explain your point of view calmly and without blame, and come to an agreement. How about you don't touch each other's stuff, but if she doesn't have the same view as you on how this is respectful, you agree to at least call out to her if a timer goes off or something else comes up? I don't think it would be reasonable if she expects you to tidy up after her or take over what she's doing, she is indeed an adult, but at least letting her know shouldn't be that big of a deal. That's not even the behaviour that bothers you, so. It really seems like you're digging your heels in despite being against social custom, while there can easily be some middle ground here.", "Imagine your Mother taking her time to make sure you weren’t living in filth and you actually have the audacity to decide it is your biggest pet peeve. This whole post is screaming me, me, me. YTA for taking on roommates when you couldn’t even see the good in your own Mother’s time and efforts. It takes 2 seconds to let someone know their timer is going off. Even if you don’t physically do it, whip out your phone and shoot a text or call “Hey your timer is going off.” Who would rather listen to loud beeping than have some common courtesy?", "Just had the same thought.\n\n“Hey OP, I heard your apartment burned down last weekend.  What happened?”\n\n“My roommate was baking cookies and fell into a coma.”\n\n“OK…did you notice a smell or anything like that?”\n\n“Oh definitely.  But my philosophy is we are all grown adults and should always mind other people’s business.”\n\n“…”", "But so would the roommate if she expected the OP to watch her baking project without asking.", "The thing is, its not his problem. He isnt responsible for that and people will start relying on that. You could give them chances however. But still if you fuck up, im not your mother, most people wont lift a finger for you anyways. So why would i?", "Yeah, stop acting like it’s out of respect and just acknowledge you don’t like people needing you. If that’s your prerogative then so be it, but don’t act like you’re doing this for their sake.", "I disagree. I think it’s very honest and it’s good that the poster knows who they are. Nothing wrong with knowing who you are.", "I get where you’re coming from, I feel similarly and tend to follow a strict “leave things as I found them” policy.\n\nBUT consider that maybe the way you are applying this is a bit extreme and/or just a cover for not being arsed to extend a simple kindness.\n\nLetting someone know that their timer is going off is like telling someone that their shoelaces are untied or that they’ve left their phone on top of their car before driving off — a helpful gesture to prevent possible misadventure. This in no way involves “messing with someone’s things;” there is no disrespect.\n\nDid you technically do anything wrong? Where you obligated to alert your roommate? Obviously no, but at the same time not doing so is essentially callous to the point of being asshole behavior.", "It sounds like \"not messing with other people's things out of respect\" is a cover-all for being an ass.  Basically, you want to live alone but can't, so you're just going to ignore your roommate and pretend you're living alone. Like, they'll just go away eventually, right?\n\nAre you the AH? I'm going to buck the trend and say yes. If you have any kind of awareness of the people you are living with, you will have noticed she was baking; you've lived in a place with kitchen appliances so you might make the connection between a beeping oven and baking. Would it kill you to yell, \"Do you want me to turn it off?\" It's what you do when you live with someone else and THAT is the kind of respect that you aim for: instead of pretending they're not there, keep an eye out for them out of your peripheral vision. Likewise they should do the same for you. They shouldn't arbitrarily move your stuff, take your things or interfere unbidden, but basic watch-your-back courtesy is not veing an AH.", "Wait. You think it's more respectful of the other people in the house to let their water run and potentially flood something than it is to remember that *you* left *your* water running and then need to ask *them* to turn it off? What??   \n\nYou know their sink is going to flood their bathroom - not your problem and it's best if you don't step in because that's disrespectful and inconsiderate.   \n\nYou know that your sink is going to flood your bathroom due to your own error - better call them and have them turn it off for! Sooo respectful and considerate.", "Bruh. Seriously, no offense intended, but you might want to consider therapy.", "That’s not even the same thing and you guys know it", "Exactly!", "Eh, I honestly feel like that’s less so, even though I don’t find OP’s personal philosophy necessarily wrong at all. If someone else is cooking and the thing beeps and they’re not in the room, it’s frankly normal to shout or let them know that the thing beeped. \n\nYou all live together, you don’t want to set off the smoke alarm; it doesn’t verge into “being responsible for the baking project” to just let them know if you hear it go off. (They were wearing AirPods, so if they hadn’t even heard it, that’d be one thing. But they did hear it go off.)", "Not getting involved is how you prefer others to show respect to you. That’s okay and understandable. But a lot of people feel respected when you show them courtesy like double checking that they heard the kitchen alarm. This very social roommate can probably be assumed to be one of those people. \n\nSo the question is - is it more important to you to treat everyone how you would like to be treated, or would you like the people around you to feel respected and supported by you? If it’s the latter, your actions should take into consideration how they are perceived by others. This isn’t compromising your values, it’s learning how to effectively navigate building healthy relationships.", "so you’ll just never help anyone out ever? dude who hurt you?", "You literally said in your post that you know your roommate can be forgetful, so that statement of assuming people have their own stuff figured out is kinda BS here.", "I'm 30 and I still do this", "I still do that sometimes since a timer going off doesn't always mean the food needs to come out in my family", "I very aggressively yell \"BEEEEEEEEEEEEEEEEEEEEEEEEP,\"\n\nAs a mature 30-something does.", "I was thinking that OP probably grew up with a mother like my grandmother, with everything micromanaged and moved to a point where you just can't stand other people touching anything.\n\nMy grandmother hated mess and sometimes one couldn't even set the table a little early without her removing everything. \n\nMy \"favorite\" memory is when I was going to eat breakfast and placed a bowl and a spoon on the table. Turns to the refrigerator and takes out the milk. When I turn back the bowl and the spoon are gone because my grandmother cleaned them away.\n\nJust don't touch my stuff.", "Some people need to fail to learn that others aren't always going to cover their mistakes. The next time the timer goes off there might not be anyone else there. The roommate should learn to help herself. \n\nI think it would have been especially kind of OP to say something when the timer went off, but failing to do so doesn't make him an AH.", "I asked OP specifically if it would take 5, 10, 15 and 20 minutes or until they smelled burning to respond and their reply was \"people have different personality types\"\n\nI don't even think these people are exaggerating", "I cited an extreme example because looking at things in absolutes is problematic, especially when you live with other human beings who don’t think that way.  If your roommate screws up but you stick to your guns on principle, that is definitely counterintuitive, even if you’re “right”.", "This is an adorable story 😂", "[deleted]", "That’s adorable and I love it!", "We yell \"Buzzzzzzzzzzzzz\" and we are past 50.", "Arrggh, my husband does this. I'm standing at thd stove cooking something and he'll bustle round clearing up and washing the actual utensils I'm actually using when I put them down for a few seconds. Grrr.\n\nIt's a small irritation mind you - having a husband who actually seems to like washing up is a huge boon 99% of the time.", "I get your point. \nAnd I do get it’s a great lesson.\nBut it also a lesson that makes people harsh… that is what happened with OP he relied only on himself because he could not rely on the help of others. (The example of things lost) \nThis would work well if he lived on his own. But the thing is he isn’t, and what he is doing is harsh. The world around us has curveballs enough with us making it harder on ourselves. \n\nYou know those “funny” movies where the kid can’t swim anymore and is holding on for dear life to something that floats… and some comes along and puts his feet on the ground to figure out they could stand all along with out trouble…  we should aspire to be the person who puts those feet on the ground. Not the one filming it…", "Have you met other humans???", "You really need to communicate more explicitly with your roommate then. The way you operate personally makes sense to me, but I wouldn’t fathom operating that way without communicating it to anyone— especially when you know it’s common that others feel differently/“intrude”, like your mom or your flat mate. Oh not to mention you already knew this about your flat mate? With all that in mind why do you think she could read your mind unless you’ve made it pretty clear to your flat mates that this is your philosophy. Because if she had that information she probably would have known “Oh, I should specifically ask them to tell me if they hear the timer.”", "liquids expand while freezing, the can most likely burst and soda froze all over the freezer", "It explodes after a while because it turns to ice and expands in the can.", "If it's in an aluminum can there's a good chance the water in it will expand to the point that the pressure will make the can burst.", "I do think the world would be a much better place if everyone looked out for each other. But that is unfortunately not the world we live in. That's why we teach kids to swim in the first place. \n\nI agree that OP was cold here. But being cold doesn't make him an AH.", "[deleted]", "And that’s where we disagree I think being cold and agreeing it is what is makes you an asshole for not attempting to be better. \n\nLike saying all those YouTubers are helping the unfortunate to get richer for themselves, true but they did help… can’t say I did when I was just watching the clips of them doing it", "It sounds like you just need to live alone.", "Any fizzy drink in a can really. Including beer.", "[deleted]", "And I have incorrectly refrigerated soda a hundred times", "They were talking about the freezer, not a regular refrigerator.", "You talking about refrigeration or freezing? Refrigerators in the US typically have both a refrigerator that keeps food cold and fresh and a freezer that dips below the freezing point. \n\na soda/beer/fizzy whatever will def explode in a proper freezer every single time in less than 8 hours (a proper freezer being one that can freeze meats solid for long term storage and turn water into ice)\n\nI know it's less than 8 hours because I have worked in multiple buildings and for each and every break room fridge, that is the explosion point for someone who put a soda in the freezer as soon as their shift started and forgot about it", "YTA, but hear me out.\n\nI too am an only child who had an overbearing mother that was obsessively clean. \n\nI couldn’t set a cup down and go to the bathroom without it being dumped out. She would go through all of my things and re-clean my room because I didn’t do it right daily. I was often not allowed to clean up or do any chores because it was never good enough for her and I was always in trouble, usually berated for little things I didn’t know was wrong. \n\nDue to this I got extreme anxiety when my roommates would try to clean up after me once I moved out. Feeling that they were very angry like my mom was or saw me as incompetent. That it was a “statement” from them. It really stressed me out, embarrassed me and upset me. I also was very unaware and not used to considering others, never taught cleaning habits, compiled with an extreme need for privacy.\n\nYou’re an adult. These people are not your parents. They don’t want to clean up after you, and if they are it’s because you’re messy and you left shit out for a WHILE. Even if you don’t see it that way, even if you see it as an insult, it’s not. They’re doing you a favor but you grew up to view it as an attack on your space. \n\nYou probably aren’t used to cleaning up after yourself, or were taught these skills to care for others by helping out. Simply because there were no siblings around and no one let you help. It’s not your fault. I don’t think you’re terrible, but this mindset is deeply offensive to others. \n\nYou might think you’re fine, but I promise roommate resentment will only grow from things like this. You might think you’re clean enough and your roommate is too clean or too clingy. She will give up eventually and you’ll be left roommate less and with a broken friendship. \n\nYou might think it’s “respectful” that you let someone do something on their own because you never got to, or when people do these things without permission for you it’s upsetting. But you’re actually being selfish, apathetic and a huge bummer to be around. You are hurting peoples feelings whether you’re aware of it and how you help around the house shows people how much you care and respect them. Not the other way around by doing nothing. \n\nYou have to realize that most people feel what your doing is actively disrespectful and sort through that being an only child does not support having the best empathy skills. \n\nI know this because I was once like you. I burned many bridges and I hurt a lot of people with being an inconsiderate nightmare roommate. It took me a lot of time to actively relearn how community, chores and households function for basically everyone else. People often said I was fun and nice, but a terrible roommate. I never had a repeat roommate once the year was up from 18-24. \n\nThey won’t keep forgiving you forever.", "YTA and sound miserable tbh. There’s minding your business and there’s common courtesy. Especially with a roommate or friend.", "Nta", "Ayn Rand is strong in this one.", "NTA.\nIf you have something cooking or baking, have the courtesy to ask someone if they would mind checking it, taking it out of the oven, stirring it for 10 seconds when the timer goes off, etc.\n\nThe person receiving the request has the right to say no.\nBut it is not remotely fair to expect someone to automatically hear a timer and know what to do, or not do, or even expect them to hear the timer go off.\n\nI'm from a big family, too. Lots of chaos. If I need my fiance to help me \"keep an ear out\" for something on a timer, I clue him in and ask him, \"Timer on the oven is set for 45 minutes. I need to check the cheesecake then. Please, listen for it in case I don't hear it.\"", "No offense to the only children out there, but when you said you were an only child I instantly knew the type. World revolves around you, type. YTA", "So, if you're walking down the street and see someone being assaulted by several people, are you going to mind your business unless the victim manages to yell out, \"Help me!\" ?\n\nYTA.", "ESH\nWhile I agree that it can be annoying when people move my things without asking, it's different when it comes to  shared spaces and potentially hazardous situations.\n\nYour roommate should give you space and shouldn't automatically assume that you'll do thing for her. When it comes to ovens, cooking , washing machines etc. it's easy to cause a serious incident. That would affect everyone living there, so you should keep an eye on those situations.\n\nYou have to think of your roommates and can't just keep your things wherever you want. If they need to use something then they have to move your things.\n\nMy roommate was absentminded and she put my electric kettle on a stove and forgot it's on, twice. If I didn't notice our dorm room would burn down. If the forgotten cookies caused an accident you all would be affected.", "YTA. If the alarm goes off and it's clear the person hasn't heard it, shouting \"Timers gone off\" or similar is the normal thing to do. You knew full well that they didn't hear it and what was in the oven would be spoiled and chose to keep silent. \n\nFor what it's worth, your outlook an everything in life as described in your OP is broken to the point that this will severely impact all your friendships and relationships. How you perceive space and interactions is not healthy or neurotypical. I suspect you may be on the spectrum and should be assessed if you haven't already.", "You might have a touch of the ‘tism my brother", "ESH you and your roommate need to communicate", "You sound very unempathetic to me. People who ignore everyone else's business completely can be just as bad as those who are in everyone's business all the time, imo. But I'm gonna say NTA in this scenario! You were right that she should have said something if she wasn't sure she'd be able to take them out right when the timer went off. You couldn't have known that she wouldn't be there to pull them out when the timer was up.", "YTA. I have many friends who are only children, or had absent parents, and that's no excuse to not be a decent person. If you didn't hear the alarm that's a different story, but you did, and couldn't have even shouted her name or something?", "I’m just going with NAH for this one since it is so mild, but you are pretty rude, honestly.", "NTA in this situation, but only on the technicalities. \n\nHOWEVER, I do have to ask: have you even been tested for autism? First the long “context” about how you don’t want people to mess with what you are doing and how you stress out about people rearranging your stuff. How you are independent and are often in your own world. \n\nA lot of these points for me were diagnosed as symptoms of ASD. also just the general feel of how you talk and see the world. Might be worth checking out.", "NTA for this instance in particular, but overall you sound exhausting. There is a difference between minding your business and being a tool.", "YTA. \n\nYou seem to severely misunderstand what \"mind your own business\" means. Someone gets into an argument with a significant other or is having family problems and they don't want to talk about it? Yeah, mind your own business, it's not about you. \n\nSomeone is doing an everyday task and it would be polite to call out and give them a heads up or a reminder? That's not being intrusive, that's being a decent human. You seem kind of self-absorbed OP. Not everything is about you, and I think you'll enjoy your life more if you learn to interact with other people.", "YTA. Your attitude is not conductive to good interpersonal relationships", "YTA. It would take such little effort to shout out for example \"The oven is beeping, want me to turn it off?\"\n\nI’m kinda like you to where I like to remain in my own world and don’t like people cleaning up for me or whatever, even to my own detriment at times, and I would that 100% of the time.", "YTA. A lot of what you wrote actually resonated with me. I too am someone who minds my own business and don’t like other people to encroach on my personal space. But my roommate is almost like yours. She loves being social with me. And as a general courtesy I try to be helpful and be aware of her needs as well. You should probably try to do the same because tbh you sound insufferable.", "NTA or NAH\n\nI think there’s miscommunication and different expectations in what you and your roommate expect from each other, but I dont think either of you is especially in the wrong. I think she should/could have told you if she wanted you to keep an ear out for her cookies or you could have told her you heard the alarm\n\nI get your annoyance at people touching your stuff too I hate it. I try to ask first but I think most people care less it seems", "House burns down due to unattended cookies, extends to neighbouring houses\n\nOP in intensive care, covered in burns, \n\n‘Yes, I heard the timer, but it wasn’t MY business’", "I live alone because I know I'm an asshole like that 😂 I'm selfish about how and where I want things, and I want to be left alone. I moved out basically because it got too \"suffocating\" to live at home. No way I'll be able to live with a roommate.", "Also OP doesn't like people cleaning up after him, but if it's a public area like the kitchen, he should have cleaned up after himself right away so people don't have to clean up after him.", "I also pinged that. Hating being interrupted, things lying around but she knows exactly where they are, difficulty finding things that have been moved, \"in her own world\" are all pretty classic ADHD or Autism symptoms. As a girl and an only child, it's entirely possible that she missed a diagnosis as a kid as her symptoms may not have risen to the point of dysfunction. It may not even be dysfunction now, but it does seem like a clear pattern of behavior.\n\nI say ESH. Don't ignore oven timers because of fire safety, but the roommate should have been clear in her expectations if she was counting on OP to assist.", "Im autistic too and had the same suspicion especially upon seeing everyone respond to them with YTA when I didnt see that big an issue 😅😬\n\nThe look out for others things when its not life or death is an unwritten rule I didn’t get was so big a deal until now either, but I could also see this being an issue with them being extra respectful in a way they’d like(their stuff left completely alone) coming from disrespectful housemates", "Yeah, from some of OP's other comments, they are either neuro divergent or just really messed up.\n\nShort term solution is OP and their roommate both need to communicate better. Long term, it sounds like OP needs to see a psychologist or someone to work out what's going on and how they can learn to understand themselves and others.", "I would argue that they are great at sharing spaces because they just leave their roommates' stuff alone.\n\nThe worst things I could imagine roommates do is fuck with my stuff or steal my food, which I have read a lot of stories about. So a roommate who just minds their own business? Heaven.", "I’m glad I’m not the only one with this line of thought, the responses are also reflective of what undiagnosed ND people hear from NT people who haven’t considered that possibility - I really think looking into it would at least be of benefit", "I absolutely get it. Don't know if it's because I'm an only child too, but I hate when people interfere with what I'm doing, even if they are just trying to be nice.\n\nAnd it's especially bad with anything in the kitchen.", "you need therapy because you have a very skewed concept of respect. Many of your words and actions are generally disrespectful, but because you were raised to look out for yourself an nobody else, you think it’s normal.", "You were parentified and now you are going around passive aggressively parentifying the whole world. You’re treating people like they should never be interconnected. Get some therapy!!!!!", "It’s amazing that you’ve managed to conflate passive aggression with respect, lmao. YTA", "Sounds like it’s your world and everyone else just lives in it", "But don't you outright acknowledge she's different though? Like this event wasn't a revelation was it?", "But clearly, from your post, you're aware of the fact that not *everyone* sees it as respectful, including your roommate. You are aware of that. So how about you stop using that as an excuse - because clearly, it has nothing to do with respect.\n\nI honestly wouldn't want to live with a roommate who acted like you. Either live on your own, so you can be as antisocial as you want - or suck it up and realise that living with other people *does* mean you have to adjust your behaviour, and that you can't always have everything exactly how you want it.", "Hearing the oven ding and yelling for your room mate in another part of the house who couldn't't hear it (a task that takes absolutely zero effort) is _very_ different from \"being expected to watch the baking\"", "Honestly if OP gave me a heads up about this I'd be fine living with them.", "You can know who you are and still be an AH. Or at the very least unpleasant to be around.", "Knowing you are an AH in general and not changing makes you a larger AH. It shouldn't end with \"that's just who I am\".", "Strongly seconding this. OP got pretty messed up by their parents - like it happened to a lot of people - but changing this one attitude might help them just be happier.", "Didn't know I was such a rare breed of person, but I absolutely agree with OP.\n\nIf I make something in the kitchen and someone sitting in there calls out for me to let me know the alarm is going off (which is probably way louder and more noticeable that their voice), I just assume they want to passively let me know the alarm is annoying to them. Because of course I can hear the damn thing, and what exactly do they assume I plan to do, aside from going to the kitchen, turning it  off and finishing the dish?!\n\nI think it's really annoying for people to state the obvious and even worse to meddle with the things I am making.\n\n(I guess as a fellow only child who spent most of their week home alone, you get used to doing things on your own and in your own way. You just don't rely on other people doing something or notifying you, so when they do, it feels like intruding.)", "Yeah I normally set the timer because it's easier to remember when to turn/check whatever I have cooking there.\n\nDepending on how long OP and her roommate have been living together because this sounds like an ESH situation and they both need to communicate more and respect eachother more.", "I had a female friend who grew up with four brothers who used to steal food of her plate. Any hand came towards her plate she would automatically go to cover it.\n\nTook her years of freaking out waiters to untrain that habit.", "Great, maybe you should live with OP then. And leave other people alone. Because I guarantee, most people don't want to live like this, constantly having to walk on eggshells around someone who always assumes the worst of them.", "But you also say that your roommate has the tendency to wander off if a pot is boiling. So, you already know he or she isn’t someone who has everything under control, and it sounds like you have judgement around this.\n\n So, when you say you assume other adults have things under control, you already know this assumption is incorrect in this case. \n\nI think you think that’s how everyone else SHOULD be, so you like to punish your roommate a bit for this by not bothering to yell out, ‘Buzzer is going off!’ \n\nYou’ve got some very rigid life-rules going on that may need to be softened a bit if you want to have a lot of human company in your life.", "So if you see someone choking you move on because its not your business?", "You don't have things under control. Your mommy needs to pick up after you, because you can't clean up after yourself.", "IMO it's hard to yell BUZZ, but it's uniquely weird and I like it.", "I like to clean while I cook, so I have less to tidy up after eating. So many times I've already cleaned some utensil I later realize I still needed 🙈 At least I can't get angry at anyone else but myself.", "Good trick I have: get a bowl or jug, fill it 2/3rds with warm water and a tiny, tiny dash of washing up liquid. Then put all the utensils you’re using in there as you go. No mess on the counter sides from dirty utensils, nothing dries/cakes on to the utensils so they are easy to wash at the end, and they are all in one place so you aren’t hunting around for the whisk you swear was in your hand moments earlier. If you’re anything like me this is a great way to go.", "It doesn't matter how you feel if you treat them like shit. Abusers claim to love their victims, after all.", "Go stick a soda can in your freezer for 6 hours and then come back and tell us what happened", "I honestly think OP might be on the autism spectrum. The whole story, the stress when someone does something against their assumptions and how they are mostly focused on their own stuff. \n\nMight be worth checking out, for them and their (future) roommate.", "Chill, dude. OP isn't an abuser just cause they didn't tell their roommate the timer went off."]}