{"id": 17580, "submission_id": "13l8nvk", "title": "AITA for telling my son I'm dissappointed that he invited his girlfriend to his graduation instead of me?", "selftext": "My son is graduating next month, and for some reason his school hasn't changed the rules back to how they were before a couple years ago. This means you get to invite two people, no exceptions, I called to confirm that. My son and his girlfriend have been together for three years, she's a year older so she already graduated.\n\nMy son had a talk with me last week. He explained that since he's only able to have two people, and he'd like his girlfriend to attend, that he just wants her and my husband to be there. He claims that he picked randomly which of us would have to stay home, but I'm not sure about that.\n\nI told him that while I'll respect his decision and obviously I can't force him to change it, I'm dissappointed. I explained that while this was his moment, it's something I want to be there for. I told him I felt it was a little silly to have his high school girlfriend come over one of his parents.\n\nHe got angry at that, and said I wasn't taking his relationship seriously, he ended the conversation after that. My husband understands my frustration and even offered to switch with me, but I don't want him to miss it either. He thinks I should've just let it go and not argued it.", "created_utc": 1684438813, "permalink": "/r/AmItheAsshole/comments/13l8nvk/aita_for_telling_my_son_im_dissappointed_that_he/", "score": 1503, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) Telling my son I'm dissappointed in him\n2) I might be taking it too personally.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Alright, maybe unpopular, but NTA. That’s insane. I just had my graduation for my masters & also only got two tickets. It was *assumed* my two parents would come, not my partner of almost 4 years who I live with. \n\nThat’s because at the end of the day, my parents raised me, they made me who I am today, and deserve to celebrate with me the most. \n\nThat being said, unless you & your son have some relationship issues you didn’t disclose, you are NTA for being disappointed.", "Info is he graduating highschool or Post secondary?", "INFO: how is your relationship with your son? Also how is your relationship with his girlfriend? It definitely sounds like you don’t take their relationship seriously and haven’t hidden that fact either.\n\nEdit: Having gathered more info. My insight says NAH. Both parties have their reasons and this needs to be discussed in DEPTH!", "While I understand your son's choice, I can also say that both his parents, in this instance, should be at this specific event. However, he's just acting his age.", "NAH but I'm curious...\n\n\"He claims that he picked randomly which of us would have to stay home, but I'm not sure about that.\" What do you mean by this? Is there a reason he would have picked you in specific not to go? Is there some bad blood there?", "Nope NTA\n\nYou expressed your honest opinion\n\nHe doesn't have to agree or change his choices, but he's quite immature to not even expect that you would feel that way. That was the opportunity for him to double down on the apology and consider other ways to include you in this moment.\n\nBecause it is ridiculous for him to have his girlfriend there over his two parents who, presumably, have supported his entire LIFE (let alone his education) up to that point. \n\nHis response makes me think he has more reasons to have chosen Dad. Perhaps the same attitude your husband has towards this altercation (don't make it a big deal, don't communicate your feelings and be honest about things make you feel to keep the peace, etc) are why he chose Dad over You. Sounds like you've raised another stereotypical dude", "NTA. He’s a kid and he’s blinded by teenage love. That’s ridiculous", "If you've been a high schooler, you'll know how astoundingly important that high school romance can be. Doesn't matter that with hindsight you know it's highly unlikely to be The One - right now, she IS the light of his life and he wants her there.\n\nAnd if the school's rules are daft enough to limit to two people... it's a no-win situation.\n\nNAH - he's not an asshole for being in love, you're not an asshole for being upset at not getting to attend. The school's rules really could use a bit of flexibility. (No chance any of his friends only want to invite one person, and would have guest space, I guess?)", "NAH the school is the asshole, what type of rule is that ? Of course you want to go and of course he wants the person he is in love with to be here. There is no good solution and he had to make a difficult choice. It must be hard on him too.", "NTA….Honestly your son AND his girlfriend are both are assess", "NTA. I wished I would’ve listened to my parents about my high school relationship, but the heart wants what it wants…", "OP you’re too vague about why you may think your son didn’t actually choose randomly between you and your husband. Too vague for me to give an accurate decision, because if you have a feeling that you DO know why, and you’re not sharing it, then I’m mildly suspicious.", "NTA this is really sad. I don’t want to go too hard on your son because I remember being an idiot when I was that age too but there’s a 95% chance he’s gonna break up with his girlfriend at some point and feel really bad that his mom wasn’t at his freaking graduation but I also know you can’t tell 18 year olds a damn thing 🤷🏻‍♀️", "NTA, your son should take the people who supported him during all of his school years.  The people that bought his school clothes, helped with homework, went to performances & sporting events, and who have a right to be proud of their child and want to watch him graduate.", "NTA. I’m sure he’s still expecting you to plan his grad party, and that he’d be pissed (and ppl here would call you petty) if you declined to plan it. Young people fail to think things through and then are mad when that failure upsets others. \n\nIt’s a good life lesson — being an adult and making adult choices comes with adult consequences. If he wants to snub his mother he can, but she’s not required to be ok with it.", ">He claims that he picked randomly which of us would have to stay home, but I'm not sure about that.\n\nInfo: Why are you not sure? What is your relationship with your son normally like?", "NTA. I think he’ll regret this down the line if his girlfriend goes instead of you. Hugs ❤️", "NAH if that's truly all you said. Personally, I would've left the comment about \"his high school girlfriend\" out because it was obviously going to trigger a defensive response about their relationship, just like it did. But I don't think you intend to attack his girlfriend or their relationship, so I don't think you're an asshole. Expressing your feelings about this doesn't make you an asshole, either. As long as you respect his decision, you're fine. \n\nI don't think he's an asshole either, at least not from the info available. It's his graduation, and he gets to choose who he wants there to support him. I would've never chosen a boyfriend over either of my parents to be part of my graduation, so I do think he's wrong in his decision (unless there are ulterior reasons for him not wanting you there other than the lack of invitations allowed), but he's entitled to make it. \n\nI'd say the only assholes are the school that for some reason are maintaining a protocol that is no longer necessary.", "[deleted]", "NTA. Unpopular or not you’re his mom and I would hope the person who helped get him through school all his life and supported him. Not the girlfriend.\n\nUnless you’re truly the problem and he has good reason to not want you there I would be equally upset.", "NTA\n\nWow.", "NTA - I really feel for you. I mean, you gave birth to him and it’s a major milestone in his life. Are you guys doing anything after like dinner or a party?", "NTA.  K-12 education requires a lot of work, input and care on the part of the parents.  Presumably, he's living with you?  You've been with him through this whole journey and want to watch him complete it.\n\nI was on the fence because I thought it was a college graduation and his gf might have been a huge part of his life while he's away from home; they might even be headed towards marriage soon.  That would be different. Getting a kid through k-12 school is a family affair.\n\nI'm so sorry.  This would devastate me.  I hope somebody talks some sense into him.", "NTA. You have every right to express your feelings when something hurts you. The main thing is that you accepted his decision. While your son should get to choose who comes to his graduation, he shouldn’t be angry at you for sharing that you’re hurt. Honestly, if he was really a mature person, he should have let you and your husband decide who was going to go instead of choosing for you.", "I feel bad for you OP. The likelihood that a high school relationship pans out long-term is slim to none, and he made this decision as if he was asking his wife to attend. You know this as you are a person who has lived a longer life and acquired the wisdom to know this.\n\nI imagine one day he looks back on this and thinks it was dumb that he didn't have his mom at his graduation. There is unfortunately nothing you can do or say to change his mind either. It sucks OP. NTA.", "NTA. all the comments saying NAH are absolutely ridiculous. unless you have a specific reason for not inviting a parent (which he obviously does not since he said he chose randomly) this is so incredibly disrespectful to do to the people who raised and supported you your whole life. I have no idea what he’s thinking- and yes he is old enough to know better. My entire family would have lit me on fire if I tried to do something like this to my parents when I graduated", "NTA. For being upset. I would be devastated if I was in your place. You didn’t handle it well though", "INFO how is your relationship with your son and what makes you think he actively chose not to invite you rather than him just picking randomly as he said? Also, three years is a LONG time in high school and this girl could be your future daughter in law. I'd suggest recognizing that sometimes your son is going to prioritize her over you.", "NTA, you have been there his whole life supporting him, looking after him, paying for everything and he picked someone who could be gone in the morning... I'd be devastated too!", "NTA but the girlfriend is if she actually takes that invite and doesn’t tell him he’s being an idiot for not giving it to you", "NTA I have a 3 month old son, I see how much mothers go through with pregnancy, childbirth and raising them. You were probably the one who spent time and effort with his school, helping out with homework, buying supplies. Coming to dumb school shows. You deserve to be invited. But that doesn’t matter to him. He is too young to understand. I would just let it go honestly. The worst part is they will probably break up lmao. Id be hurt too.", "The comments here saying op is damaging the relationship ignoring that the son has already caused irreparable damage to his relationship with op.", "*I'm going to base all of my response under the preference that you and your son have a good relationship, if that's not the case then my answer would change.* \n\nNTA at all and honestly I'd be pissed if I was you. You acted calmly telling him that you're disappointed and have accepted his decision. Your son is acting like a moron and hopefully he'll realize how big of a moment this is for both you and his father, where as his girlfriend probably won't be his girlfriend in 2 years. \n\nI am curious, did he go to her graduation or did she give the tickets to her parents? I assume she only got 2 tickets and assuming she has both parents in her life she would probably of had them go. \n\nI really hope he changes his mind and gives you the ticket. If anything your husband should pull him aside to make him realize how big of a moment this is for a parent.", "NAH, you are completely reasonable to be upset over this. But it's his girlfriend of 3 years, of course he wants her there and I don't think he's being an asshole about it. It's obviously a really hurtful spot to be in for both parties and probably wasn't an easy decision on his part.", "I'd figure out a way to get an extra ticket, regardless of the rules. This rule is insane. What happens with kids who grew up with step-parents? They just have to pick and choose?", "NTA", "Nta. I am so sorry this happened. I am sure you are very frustrated. You were there every step of the way.  From kindergarten to his next step in life so it is probably crushing to not be apart of every moment you can. I don't want to discredit his relationship, but hopefully, he doesn't come to regret this!", "Wow NTA. I'm sorry but your son is ungrateful. I could never imagine not inciting my parents to my graduation.", "NTA", "NTA. This would hurt my feelings. Does he have any friends with an extra ticket? If it were me, I would probably just show up anyway.", "NAH - I can understand you being disappointed, but it isn't his fault that the school only allows two people, which is ridiculous.  At this point in his life, his partner is a primary relationship given they have been together for three years and if he gets married, he will have to spend the rest of his life explaining why she wasn't invited to his graduation.\n\nHave him talk to other people in his class to see if he can get a third ticket from someone.", "NTA but once your kids become adults many things are best left unsaid if you want to continue to have them in your life because they are living thier own life and will leave you out of it if they don't like what you say even if you are 100% correct.  That being said I'm sorry that you don't get to be there as one of the 2 people that have supported him most to get where he is today.  He's still immature and is taking you for granted.", "NTAH. Oh my Lort I would be beyond livid to have ANYONE suggest his mother AND father are not there. Period! Of all the nerve. Livid I tell you.  Livid! The girl friend, if she has a brain would absolutely refuse to “take your seat”.  Beyond heated to EVEN suggest.", "NTA. Your son is ungrateful for the education that YOU made possible. His girlfriend wasn't there for 12 years helping him with his homework. His girlfriend didn't have to endure all of those tedious PTA meetings, Parent Teacher conferences, orientations and soccer games. His girlfriend didn't chaperone field trips or bake cookies for the bake sale.His girlfriend didn't insist on getting pictures of the first day of school every year. She didn't get up early in the morning to make sure he didn't miss the bus, nor did she have to run to school to deliver some homework or project that he forgot at home.His girlfriend didn't sell shitty raffle chances at work, (or cookies or peanut brittle or whatever else kinds of crap they have to sell for whatever fundraisers). She didn't have to pay those activity and equipment fees every year.His girlfriend didn't give him pep talks for 12 years when he was stressing out over homework, close to tears over hard math, or ready to give up. His girlfriend didn't have to deal with bullying at school.This is your day almost as much as it is his day. You should be there.", "NTA! But it’s hilarious that your son has no common sense. Did he attend his girlfriends graduation? Lmao", "NAH the school is the asshole, what type of rule is that ? Of course you want to go and of course he wants the person he is in love with to be here. There is no good solution and he had to make a difficult choice. It must be hard on him too.", "NTA\n\nHis mom/dad were there during his entire life so he can be where he is today. They should be there. They girlfriend can join the dinner later. To me his actions show how unconsidered he is.\n\nHe will regret badly if he breaks up with the gf in the future and made his mom not going for her.", "NTA if this was his college graduation I’d maybe understand but since when does a high schooler get to make this call", "This is a high school student, living at home? If so, he doesn't get to decide who attends.   \n\n\nOP is NTA. Son sounds like he is.", "I honestly can't give a verdict as I don't know what your relationship with your son is like.", "Info: who was at her graduation last year?  Did she choose her bf and only one parent?", "Where's all the people blindly saying it's HIS graduation, he gets to choose who to invite? Especially where there a strict two ticket limit? They're all downvoted. \n\nSuch double standards on this subreddit.", "Either way I would be hurt. Are you and your husband paying for his education?", "NTA. \n\nI would be devastated.", "NTA - So you and your husband supported him thru his 12 years of school and you aren’t invited to the big moment?  My kids would not have been given the option of someone else receiving a ticket.  Of course we got 6 tickets.  So how does it work after the graduation?  Is he allowing you to go to dinner or throw a party?  Are is the gf paying?", "NTA. \n\nMannnn, no. You're his mom. You take priority, hands down. \n\nI'd be more than a little disappointed. I'd be crushed.", "NTA. I'm sorry it came to this.", "NTA your son is not being very kind. Unless there are other issues not mentioned, at a graduation parents should always be first choice.  I wouldn't go if not wanted, but you can be certain the relationship would be very different. \n\nI also wouldn't help with anything, pay for anything, or let him move home when he gets introduced to the current economy. His girlfriend should be expected to pick up all the mothering you have done for at least the next 10 years.", "All I see is someone saying they will respect boundaries but have voiced that they are hurt by these actions. As long as you brought these concerns in a not angry tone and didn't use accusatory language I'd say MTA. I'd be sad too.\n\n Part of growing up is realizing your parents are people with actual emotions and are very much human. Treating your child as an adult and independent from you is an entirely new learning opportunity for the both of you. Good luck on this new phase of life.", "NTA.  I can't imagine the hurt you are feeling.  Could he have maybe invited both of his parents to the ceremony and have her meet yall for a celebratory dinner before or after?  Or dump yall directly after the ceremony to spend time with her to celebrate alone with her?  There's a lot of options besides having your mom miss one of the biggest days of your life.  You are entitled to your hurt feelings.  It is ok to let someone know they have hurt you.  It doesn't make you a bad person,  an asshole or someone who doesn't take his relationship serious because you have feelings about something.", "NTA. OP is the mother, and apparently not a bad one or the kid and his dad would have been united and said why.\nThe kid apparently feels that all his decisions should be 100% fully supported and if a parent doesn't agree then the kid should be allowed to snap at the parent.\nThat's not how being an adult works.", "NTA I would also take this as a big slap in the face. High school graduation is the transition from childhood to adulthood in a lot of ways; it is a time for parents to feel pride in their children, and children to express gratitude to their parents. I'm really sorry that you're going through this. I hope he'll come to his senses. If not, he's probably going to feel really bad about this when he looks back on it in the future.", "NTA and this is really weird. I get a limit of some sort  but 2 people seems very unrealistic. Think of the number of people whose parents divorced and remarried. Seems like this is just ripe for causing conflict and hurt feelings like OP is dealing with. \nThe only suggestions I would have is to call the school and see if there is anything that could be done or ask around and see if anyone has a ticket they are not using.", "NTA is this his high school graduation or his college/university graduation? If it’s his high school graduation, are you planning on helping him pay for his college? Because if so I would not be happy not getting to go to his graduation yet still be expected to pay for his college. I would gently remind him that you are the one who helped him with his first words, his first attempts at writing, with his homework, running him around to his extra curricular activities which I’m sure you helped pay for. Going to his graduation is your reward for all the support that you have offered him over the years.", "NTA. Your son is an ungrateful little shit.", "NTA.  Your son has some serious life lessons to learn.  How self centered can you be-given your husbands reaction it’s clear where he got it from.  Dad should be raising all hell about this disrespectful totally d move.  It doesn’t sound like either of them respect you.  I’m so sorry po.", "NTA. I would be disappointed, too.", "Was he also invited to her graduation? \n\nEither way, NTA.", "NTA and no good moves for you here, at this point you’ve made your feelings known all you can do is accept it.", "I’m really sorry. NTA.", "NTA.   I really hope he changes his mind.   I’d be heartbroken as a parent if I didn’t get to witness this milestone.   Also, I’m surprised his girlfriend agreed to go knowing her boyfriend’s mother would miss out!    I’m so sorry, my heart is breaking for you!", "NTA. You have a right to be disappointed. If you have a good relationship with him then this is callous behavior on his part. \n\nTalking to him further about it will only drive a wedge between you. He doesn’t appear to care if he hurts your feelings so you now know where you stand. \n\nDo something special for yourself on that day. Take care of you.", "I'm a mom too and I would be so hurt and sad. Sure 3 years is a very long time in a teen relationship, but you are his MOM. You have been there every step along the way. You knew him before anyone else in this world, and probably advocated him when there were issues in school.  He's probably leaving to go to college and you don't get to witness this milestone. It hurts.\n\nHow is your relationship with the girlfriend? I can't imagine what kind of partner would take the graduation ticket away from the parent. \n\nNTA. This one really stings. So sorry.", "NTA.", "NTA", "NTA. He told you his way of picking who is important. And you told him, that's silly. \n\n(EDIT: JOKE Start)\nOn the bright side. You have ammo to Lord over his head till the end of time.\n\nMaybe tell his kids when he goes to their first annual day in the future.\n(EDIT: JOKE End)\n\nParents do and have the right to take high school graduation very personally.", "NTA. He's not lc or nc, he obviously still has a relationship. But just randomly chose? He did this because she wanted to go and he is putting her above you. Now MIL can be crazy and she looks at u as one probably. But this already shows how they both will treat u. Cut it off asap and say u won't put up with that. Because that was messed up.", "NTA. \n\nI wish my dad had had some kind of reaction when I asked him to come, but he just told me he couldn't because of work.", "NTA we understand your dissapointment..not a nice move of the kid....throwing mom to the side...unless of course you guys do not have a great relationship...if so; the verdict is different", "NTA. You raised him, fed him, gave him a wet rag when he was puking, took him to doctors' appointments and most importantly, carried him in your stomach for 9 months. I'm sorry, but your son is the AH here. Unless, you're the reason he's an AH.", "You’re NTA for communicating how you felt disappointed. It’s not like you demanded to go after finding out, and you were considerate of not creating more drama by replacing your husband, and considerate of his feelings as well when he offered his own seat. \n\nHowever- you are TA for not taking a 3 year relationship seriously, even if it is a high school relationship. 3 years is a long time and shows commitment so it certainly isn’t something to scoff at.", "You’re NTA for being disappointed, although you absolutely had to know calling her his “high school girlfriend” was gonna push the teenager’s buttons so that was unnecessary. (If you didn’t know that, I can only assume you’ve never actually interacted with your teenager before, and have completely blocked out your own teen years.)\n\nBut I’d like to remind the comments section in general that plenty of people had absolute shit parents and you absolutely cannot responsibly assume kids who don’t put their parents first don’t have good reasons for doing so. Not saying this applies to this exact situation because I wouldn’t know, but there are a ton of damn valid reasons a person might invite their gf over their parent.", "Honestly, NTA  \n\n\nIf it was college/uni then maybe ... but high school, it should be the parents and friends and significant others after that... can she not meet him outside after the ceremony and come out and celebrate with you all? I think your son is being a bit immature, which is to be slightly expected from someone graduating high school.", "NTA. And I’m sorry this has happened to you. I felt bad when my stepson invited his Gf with his 4 tickets (mom, dad, sis, and gf went) and I couldn’t go. He and his gf broke up 1 month later and she’s no longer in his life…. But I am. I’m the one who bent over backwards to throw his grad party etc. It sucked. I really feel for you OP. I hope he understands his choice and how it hurts you as he matures", "NTA \n\nI would be upset if my kids did that to me as well.\nI might even get petty with some life lessons on future support they expect from me.", "Damn... sounds like the kid is paying for his own Tuxedo and tickets too.\n\nNTA", "Ill say NTA just because when i graduated they told me \"this ceremony isnt for you, its for your parents. They raised you and got you here, this is for them\"", "NAH.\n\nI can understand why you would feel upset, but I can also understand why your son might want his long-term girlfriend there. \n\nI would’ve chosen to have my partner with me at something like that opposed to my parents, personally. \n\nI don’t think it’s appropriate to say it’s “silly to have his high school girlfriend come over one of his parents” though. They’ve been together for three years and it’s not about her coming over you, it’s about him wanting her there. I would probably take a line like that quite disrespectfully if it came from one of my parents, especially if it was about a partner I had been with for several years.\n\nWe don’t know, from your post, about your relationship with your son, about how close you all are, etc.", "YTA, but not for what you think. You're NTA for being disappointed and saying so, you have a right to be disappointed. Your disappointment should be aimed squarely at the school, however, as it's their policy.\n\nBut YTA for keeping this going instead of moving on. You're also TA for disparaging how important your son's relationship is to him. Your husband even offered to switch with you, but you only get to be the real suffering saint if you stay home and sacrifice your joy for everyone else.\n\nYou are allowed to be hurt, but unless you're going to switch with your husband, just drop it.", "I feel like there is a lot of information missing here… and it feels a little odd to cal the gf a “high school” relationship if this is a college graduation (meaning they have been dating at least four years).  If this is high school, major NTA.  If it is college and you had a close relationship with your son, and paid for his education and supported him, also NTA. \n\nIf there is other missing information though, it could be a y t a (or n a h if it was just a tough decision and she didn’t do anything bad)", "NAH- you’re allowed to be disappointed and he’s allowed to invite whoever he wants. For all you know this woman might be his wife someday. Either way she’s clearly important to him. I married my HS boyfriend, he might marry his HS girlfriend. You just never know.", "I would without a doubt pick my partner over my parents. But I don’t think OP is an AH for being upset or hurt. As a parent of kids in college, I can understand. I was the one who got up at the crack of dawn to take them to clubs and sports. Funded school trips. Did the PTA. Did the class parties. Did the parent teacher conferences. Helped do everything I could to get them into college. And then once there, paid for their education and living expenses. I’d obviously want to be there.", "NTA \nKid has some nerve. You 100% should be there! You put 18 years of blood, sweat, tears and cold hard cash into getting him to this point. It’s clear she doesn’t value you as a mother (yet) but that doesn’t mean you have to bend to his selfish will.", "No you're not an asshole you raised that little asshat, tell him you're coming and he can see his future ex-gf later on.", "Both are NTA. If the school allows it then the son would definitely invite both parents- and it’s not surprising to prioritise romantic partners. I feel like the asshole is the school for not changing the policy.", "The only AH in this story is the high school. He’s not in the wrong for wanting his girlfriend there and OP isn’t in the wrong for wanting to go. It’s just a shitty situation.", "Info: what happened with you and your son to make it so you can’t believe him when he said he picked randomly?", "INFO: have you contacted the school and asked for an exception? Because most schools will give out more than the two tickets if you ask.", "NTA - and him treating you like you are is gaslighting you. You and your husband should be the guests and she should see him right after. So she will sit with your husband (not even with your son?) it's just bizarre. I am sorry this is sad for you.\n\n&#x200B;\n\nThough just a life tip. Calling her \"his highschool girlfriend\" was kind of a dick move and makes me think maybe you have other issues in your relationship.\n\n&#x200B;\n\nIt's his girlfriend and at 3 years that is quite the relationship. A little jab like that was unwarranted and not only gave him something to latch onto but makes me question if you make other comments you don't realize. Only you would know.", "NTA.  Barring an abusive relationship, A mother is entitled to watch her child graduate. Son is immature and gf should have known better than to accept the invitation.", "NTA.. I would totally be hurt as well… I’m sorry for you.. yes it’s his choice but you are his mother..", "NAH. Your feelings are valid but so is your sons decision. This situation sucks but they are his tickets and it’s his graduation so ultimately he gets to decide who gets to go. You also don’t seem to respect your sons girlfriend because they’re still young. I know lots of highschool sweethearts who are still together today. It’s not silly he wants her there.", "NTA, but you raised one.", "Can he buy a ticket off of another student who doesn’t need it? \n\nThis sucks. It’s definitely tradition for parents to attend high school graduation", "Your son is an a******", "NTA", "Nta I'm sorry.", "Nta \n\nGood god no", "Nta\n\nI’d have said the same thing.", "Did it occur to anyone to contact the school to see about lifting the Covid restrictions?", "The way she called her son's choice to bring his girlfriend \"silly\" makes me choose  YTA", "NTA, but I personally don't see the appeal in sitting for three hours just to watch your kid walk across a stage along with all his other classmates.  I think your son is doing you a favor. If I were your husband, you'd be doing me a huge favor by switching.", "NAH", "Soft YTA. I know how it hurts to be excluded but you effed up when berating and criticizing him. Find your grace. Tell him you’ll be there with streamers and champagne in the parking lot.", "YTA.\n\nMost of what you said was fine. \"I'll respect your decision. I'm disappointed.\"\n\nYour \"I\" statements were reasonable. I think. I feel. I will. I would have liked...\n\nWhere you messed up is when you switched to \"you\" statements. \"It's silly for ***you*** to ...\"\n\nIn addition to throwing shade at his girlfriend, you simultaneously disrespected him and questioned his judgment. That was never going to end well for you.\n\nYou need to work on having an adult relationship with your son. Belittling him and his relationship is not the way to go about it.", "nta and yta. reason for nta is, it is understandable to feel disappointed, you are his mother and want to be with him on his special day and you can voice that you are upset. But, yta because you dismissed his gf like she was nothing, your son probably loves this girl and you tried dismissing her by saying it was silly for her to be there. if you want your relationship with your son to continue you have to respect his decisions, he made an adult desision and you should be proud.", "NAH if you don’t keep pushing this. It is HIS graduation and while you can be hurt and it is unfortunate he got so few tickets, he has every right to choose to give them to whoever he wants to be the very first people he sees after he gets that diploma. And you should take him at face value about the coin flip unless you have relationship issues or he has a much closer bond to his father.", "NAH your son has made his decision and you’ve told him how you feel so that’s the end of that. You don’t know anything about their relationship so he deserves an apology for you dismissing this out of hand", "I'll get downvoted but, YTA. His tickets and three years is a pretty long time. I also have a feeling he has reasons for not inviting you.", "YTA for the way you handled it. Maybe if you were more supportive and took his life and relationship more seriously, you would be his favorite parent. Your husband offered you his place, but you doesn't want to go instead of him", "YTA. You called the school to confirm? He's in a 3 year relationship, so of course he's going to want his girlfriend there. Saying it's \"silly\" didn't score you any points either.", "Take your husband up on that offer. I’m not sure he’s very pleased with his son right now. \n\nI get he loves his gf,  but she doesn’t see an issue here?", "Your husband is offering you a spot after you complained and you are upset over it? This may be unpopular, but YTA. Also, He can choose. It's his life, dude.", "NTA. Your son is a big AH though.", "NTA. Your his mother. He wouldn't be here to have a GF if it wasn't for you. Tell him to get his priorities straight.", "You get to tell someone your feelings of disappointment when they are genuine and true. And you are disappointed at his decision, there's nothing disingenuous about that.  So no, you are NTA for saying it. I don't agree that his choice was right, but if it's his choice to make, then it's his choice to make.  For the record, I'd be disappointed too.", "NTA. Is this college or high school? If I paid for college and wasn’t invited, I’d ask for my money back.", "nta if you have a decent relationship with your son you should be going ... if i as your husband i would boycott going but thats just me .... if he ever asks you for anything tell him to ask his girlfriend instead", "INFO: Is your husband his father?", "NTA. I would be hurt too. Family first. Who knows if he and the girlfriend will last the test of time.", "NTA at all. I am so sorry 😞", "These events are ridiculously boring 💤  Be grateful!", "NTA and I hope you bring it up again when they split up. His gf is an asshole for being not turning down the invitation.", "Damn, I'd pay good money to not have to go to my kids' graduations. Any of them!\n\n(Also, not enough info to form a judgement.)", "NTA", "YTA", "NAH. \n\nYes, it’s expected to have both your parents at your graduation.\n\nHowever. Not everyone has “parents” that deserve to take that spot.\n\nThere are no assholes here. Your son is an adult who made a choice to have the two people *he* feels have been most supportive to him there. You are unhappy with his choice and you’ve let him know.", "YTA— it *is* his moment and I can see why he wouldn’t want to share it with you.", "Make sure his girlfriend provides for him from here on out since you don't take their relationship seriously.\nHe is extremely disrespectful to the two people who raised him. I bet she would not dare prevent both her parents from attending. He is young and he will regret this. Male sure he never forgets it either. He would rather hurt a parent than a girlfriend? She should understand. Immature beyond belief", "YTA Not for saying you were disappointed, which is your right and expected, but for saying to his face that his high school romance isn’t serious. He might doubt himself and his feelings from this moment on. A comment like yours would have stirred me up a lot at that age.", "Yes you are, go out for a meal with them both after, she could be your future dil", "YTA just for this alone\n\n \n\n> I told him I felt it was a little silly to have his high school girlfriend come over one of his parents.\n\nEverything was good until you insulted his relationship. Respecting someone's decision doesn't include insulting them. They've been together 3 years already and, like adults, want to celebrate milestones with their partners. He came to you with a good head on his shoulders and you insulted him. Trust me, I can't imagine the hurt. But just because you're hurt doesn't mean you get to hurt others.", "YTA way to make whats probably the most significant thing to happen in his young life, way to make it about your hurt and your disappointment. Let me tell you, i have this same fear about my daughters graduation. Im afraid whatever we are allowed will be given to her dad. & Her graduation is still a year away. Shes told me she doesnt want me to attend other school events, so ive already missed out on stuff. But i would never tell her. I dont want her to feel guilty for expressing her wants. She has every right to ask for what she wants, i want her confident in doing it.", "NAH. Your disappointment if totally understandable but so is his desire to have his partner there. The husband part is a little odd.", "I find it interesting that dad didn't argue on Mother's behalf, just offered to switch places.\n\nI think there is something being left out of this story.", "Honestly you dodged a bullet. No one wants to sit at those ceremonies all day. My guess is they are probably broadcasting it also, so watch it from the comfort of your couch, and then plan to meet up with them right after for a nice dinner. \n\nYou don't have to like it but it is his choice and you have a choice to accept it and make the best or be annoyed and cause a bigger issue.\n\nPlus the graduates are so busy running around you barely see them anyway. For me this is a non issue", "If your son chose your husband over you there must be something you’ve left out", "Belittling him for having his girlfriend there is why YTA. \n\nI don’t mind that you’re disappointed, and that you shared it, but when you say it’s “silly” that he wants his girlfriend there, it’s kind of like you’re trying to embarrass him into changing his mind, and that’s manipulative. If it’s so important for you to be there, take your husband’s ticket. He clearly doesn’t care if he goes or not. Your reasoning against that option (that you’re so concerned that husband go too) doesn’t really hold water. \n\nWhat it comes down to is that you want to control who gets the tickets and you don’t. So stop teasing and belittling to try to get your way. HE is the teenager. You’re the adult.", "YTA why because she's his parent is op entitled to a ticket as all the comments are pointing out, 'because she raised him' but yet you wouldn't have the same mindset for college graduations, her son's had a girlfriend for 3 years, if he was in his late 20s and had a girlfriend for 3 years you wouldn't be going on about how he should prioritise his mother, relationships don't last no matter how old you are, the tickets are given to the son not the parents, he's the one that completed his education not op", "I don’t think you’re an AH, but as much as you want to be there for your son’s moment, it is HIS moment. Be as graceful as you can and take pics before and after. Hell, I’d even sit in the car or right outside the location lol\nBut be supportive and he’ll see that. Be pouty and he’ll see that too.\nYour reaction to this may have an effect on your relationship forever.", "YTA", "YTA\n\nOf course he was going to want his gf there.", "I would sneak in anyway. F them rules.", "YTA. Look they've been together for 3 years. That's not nothing and she has a right to be there. You are his father and also have a right to be there, and you're definitely allowed to be disappointed. Please just redirect your frustration at the school for only allowing two tickets. That small amount is ridiculous and they should have prepared a larger venue for the graduation. Imagine how hard it must've been for you son to decide between the three people he loves with only two tickets to give out and you jealously responded by belittling him and his relationship. He's trying to make grown up decisions and you're treating him like a child. Go talk to the school if you want to go to the graduation.", "NAH\n\nYou are totally allowed to be upset and voice it.\n\nBut, unfortunately, he's allowed to invite whomever he wants there and since it's limited, can't please everyone.", "I’m gonna say NTA (maybe NAH). You told him you are respecting his decision while still expressing your disappointment. You’re allowed to feel disappointment with his choice and you’re allowed to express that. \n\nMaybe he’ll always stand by this decision. Maybe he and his gf will get married and live happily ever after. Probably not, as most high school relationships don’t end up that way. Chances are one day he’ll regret choosing her instead of you. Who knows. But like you said, it’s his choice to make. \n\nI’m sorry you’re going through this. I’m sure you were dreaming of watching him graduate one day and it must feel really awful for you that you won’t be there. You’re not an AH for being disappointed. I hope you’re able to celebrate with him in another way.", "If it were me, I'd be dancing for joy! Let's be 100% honest--graduations are incredibly boring! Unless your child is the valedictorian or getting some special honors of some sort, it's very dull and anticlimactic. I'd focus on the celebration of the graduation that is more intimate. That is the fun part! So, don't feel bad--be GLAD! During the graduation, book yourself a mani/pedi and a facial! A massage! Then celebrate however your family chooses separately.", "How’s the relationship between you and your son? Unless you’re unpredictable (addiction, unstable, volatile) there’s no justification for the gf to go over YOU. Who gave him life! And for your husband to not support you on this further is outrageous. \n Weird of the gf to accept aswell….", "I’d have to say NAH. You’re both justified in your feelings.", "NTA, OPs son is a dweeb. I am sure this is something that you can both work out though and I can see why he would feel offended if his relationship appeared to not be taken seriously. That's so common, especially when young, despite the fact that people can, at that age, have serious feelings.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy son is graduating next month, and for some reason his school hasn't changed the rules back to how they were before a couple years ago. This means you get to invite two people, no exceptions, I called to confirm that. My son and his girlfriend have been together for three years, she's a year older so she already graduated.\n\nMy son had a talk with me last week. He explained that since he's only able to have two people, and he'd like his girlfriend to attend, that he just wants her and my husband to be there. He claims that he picked randomly which of us would have to stay home, but I'm not sure about that.\n\nI told him that while I'll respect his decision and obviously I can't force him to change it, I'm dissappointed. I explained that while this was his moment, it's something I want to be there for. I told him I felt it was a little silly to have his high school girlfriend come over one of his parents.\n\nHe got angry at that, and said I wasn't taking his relationship seriously, he ended the conversation after that. My husband understands my frustration and even offered to switch with me, but I don't want him to miss it either. He thinks I should've just let it go and not argued it.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Tbh NTA your son is tho. I’d be FLOORED if my kid chose their SO over me who probably helped pay for their college and everything.", "NTA, you are disappointed & that’s understandable. I would be too.", "NTA as long as you're telling us the whole truth here. I get that his romantic relationship is important, but no girlfriend is going to care as much about this as a parent would. When you have a child, you look forward to these proud moments and big achievements and you'll look back on them with pride. If he didn't want you there for almost any other reason, I'd probably be on his side, but to exclude a parent who put in the work to get you to that graduation just so your girlfriend could be there? I couldn't even imagine that mindset.", "NAH. He can bring who he wants but you are absolutely allowed to be upset about it", "Considering there’s ~1% chance high school sweethearts make it, NTA. You raised him, got him to school, and got him where he is today. He is TA in my eyes, puppy love or not.", "Well it depends on who paid for his college education. OP, who paid for it?", "Nah. Both sides are valid.", "NAH you're allowed to be upset, he's allowed to invite whoever he likes.", "NAH, that rule is stupid", "Honestly I’d be calling the school and raising hell that it’s so limited. But I would have done that in the fall or at the first mention of graduation. I’d be livid.", "Sharing your feelings never makes you an Ahole. \nIt got a bit personal to call the relationship silly, but odds are that you will be right that they likely won’t be together forever. So while it’s tough to take and he might even regret it one day, you accepted it and expressed yourself fairly. NTA", "How could you be considered  TAH? You expressed your disappointment.  To expect you to push aside your feelings in order to spare his is unreasonable. You are 100%NTA", "Your son has made his choice respect it\n\nMaybe because you can’t respect it and have asked this question on social media explains why your son chose his GF and your husband ( you don’t even confirm if your husband is his father or not, even worse if he’s not for you). A clue your attitude", "Not sure if anyone could see this, but I think the reason this rule exists is because of limited seating. I went to two outdoor graduations that had no limit.", "NTA.\n\nI am only taking you at face value and I am assuming you have a normal relation with your son. If that is the case your son is being an ass.", "NTA. \nWhile we obviously don’t know the full details of your relationship with your son, it’s understandable to be upset he chose his girlfriend over you, his mother, to watch him compete such a huge milestone. \nEvery situation is different, but for me, I can’t imagine having anyone other than my parents there. My father and I have a bit of a strained relationship and have lived in separate countries since I was a child, but he still helped me get to where I am today and I would want him to see that. \nIt’s not like you demanded he change his mind or said you did something petty like not talk to him until he changed his mind. All you did was express your feelings, which are valid.\nThe only thing that may have been a little unnecessary was the comment about respecting his decision and in the same conversation calling it “silly”. But that’s just my opinion.", "NTA this is high school graduation? Does he still live at home? Sorry but no, he doesn't get to choose who comes, the two spots are assumed to be for two parents/guardians of the student. \n\nI get it that he really wants his GF there and I'm going to say he's NTA for choosing her because he's a teenager, but your husband is kind of an AH for not shutting this down. If this was college/uni/further ed, then sure, GF might take precedence as presumably they'd be at the point of a super serious long term commitment. But it's not. You are the parent, the tickets go to the parents, not the student. If he had several step parents or wanted another important relative to be there then there would be a discussion about it. In this case though, his 19yo (presumably) girlfriend shouldn't take precedence over his parents.", "NTA. Unless you’re a terrible parent you have earned the right to see your child graduate from high school. \nThis is a major moment in his life and you have earned the right to need there. \nYou’re the one who more than likely helped with his homework and school projects, took him to functions. Went on school field trips and pta meetings. \nIf any of my children had ever told mom me that they V were asking someone else to their graduation so therefore I couldn’t go it would not have been pretty. \nTell your son as mother you have earned the right to be there so he needs to get another ticket or tell his gf she can’t come.", "NTA, the School is.  I would take this up with the school and tell them they need to update their policy because this is ridiculous at this point.", "Yea. this is ridiculous NTA but you can't tell a HS kid like hey your HS gf in all liklihood is not someone you will be interacting with in even 2 years", "Ah teenage temper tantrums gotta love em", "NTA. I wish my mom would have wanted to come to my graduation. I begged, crying. Your son will regret this. I'm sorry you're in this situation.", "NTA. Your son is the one who isn’t taking his relationship with his mother seriously. It’s not likely that statistically this relationship will last. Whereas you’ve been there for him all his life. You have every right to be disappointed and I think your husband should also refuse to go.", "NTA.  He should have had both his parents there who have supported him for his entire life.  I’m sorry that you were dismissed and that your feelings on this are also being dismissed.  This situation would break my heart as a Mom.  Sending you a virtual hug.", "NTA, I think this is just typical HS immaturity showing.  How serious the relationship is shouldn't be a factor here considering you have a good relationship.  As the saying goes, he's young, dumb, and full of cum.", "NTA and I wouldn’t do one thing for his grad. No party dinner money. In fact I’d probably be out the house all day", "NTA- you are respecting his decission but expressing your dissapointment in not being able to celebrate this big day with him. You are letting him make a decision as an adult even if it is one he very well might regret later- that is a parent respecting their child.", "INFO: what aren’t you telling us? You essentially say that you suspect him of deliberately choosing your husband over you, and that he accused you of not taking his relationship seriously. Neither of these are things that just randomly happen out of nowhere, so what’s going on beneath the surface? How do you feel about his relationship with his girlfriend, and how has that impacted your actions around them?\n\nThere’s more going on here than you’ve given us.", "NTA. All you did was share your feelings. Maybe could have left out calling it \"silly\" to bring his gf over you. But it's understandable that you felt hurt.", "NTA As a mother, I would be devastated and incredibly hurt. He is acting immature and selfish.", "NTA, but your son sure is and so is his girlfriend if she thinks it’s okay for her to go to his graduation over you his mother, I would loose all respect for her if she accepted the ticket that should rightfully go to you. You might not want to hear this, but your son is an ungrateful brat who does not respect you. If you raised your son from birth it should be a cold day in hell before you miss his graduation. And your husband thinks you should just drop it and let it go…bullshit.", "NTA your son and his gf are", "I think there needs some more info. Like you said you don't believe it was random and I'm curious why you would think that way. Other than that, it's hard to say that the person your child is dating won't be their future wife. Sure it's rare to have that happen but I come from a family that my parents are closing in on 50 years of marriage and that is after only 3 months of dating. I would suggest maybe having your son ask around the seniors and see if they can't buy someone's ticket for you. Maybe you'll get lucky and a kid will only need the one ticket and can sell your son their extra.", "Can you phone and ask if they can have more tickets?", "NTA. Also OP, did you foot the bill for your son’s school over the past 4 years?", "NTA I think he’s immature and prioritizing the wrong relationship here, but that does seem to be rather common at that age. I’m very sorry for the gut punch though. Sometimes I feel like nobody can really make you feel as unimportant and unloved as your own teenagers ;)\n\nHang in there. Hopefully he will grow out of it as he matures.", "NTA - you are his parents. I'll be disappointed as well. Also, this might give you some insight into the kind of girl your son is dating. Who will want to attend such an important event in someone's life over one of the parents? That is a huge disrespect towards you. It might even stained the relationship now and thats gonna be hanging over them, or her. If i was the gf  I'll feel so awkward from now on knowing i took one of the parent's place.", "NTA. The son is the enormous AH though. He could have anticipated you would be hurt, and he could have at least discussed the situation with you and your husband. But he instead decided to verbally attack you when you (understandably) expressed your disappointment.\n\nYou are his parents and probably helped him immensely to reach this graduation. \n\nWhere is the gf in that? If I was her, I would be horrified if I knew my bf did this to his mom.\n\nOh, and I must not forget the AHs of organizers who do not allow more than 2 people to such an important ceremony", "NTA as parents we are with our child from the beginning and as a mother who gave birth to child wants to be there for the milestones, like graduation 😢", "NTA! I don’t think there’s a good parent alive that’d not say what you said. You obviously just love him", "NTA.  Even if you have a difficult relationship with your son, I understand you being hurt.", "I’m wondering if there is some underlying relationship issue here given the mother felt the need to confirm that the son was only given two tickets and given her disbelief that the dad was chosen randomly?", "INFO - in your post, you refer to \"my husband\".  Is that your son's father, or step-father?", "NAH\n\nYou are definitely entitled to your feelings on the subject. And I think that telling him that you're disappointed was the right thing to do. He needs to learn that his choices even though he might be in the right can hurt. And he needs to learn to deal with that. \n\nBut, sadly these kids have a right to make their own decisions. And we just have to let them. As a fellow mom I would be disappointed and hurt as well, so I'm not trying to minimize what you're feeling. But you've said what you can and you did the right thing.\n\nAnd that school sucks with their rules.", "NTA.", "He’s TA for inviting his gf over you. Wow. These kids today. SMH", "NTA. You have every right to be disappointed and tell him so when he tells you you’re not invited.", "I'm gonna make an assumption that you're a normal mom who has a normal, good relationship with your son. I'm also gonna assume that you, like the vast majority of women who have children, ended up doing the lion's share of the emotional and actual labour of raising this child and made all of the serious sacrifices that comes along with it. I don't know if that's indeed the case but I'm gonna just ASSUME that's the case unless ANYONE can prove to me otherwise.\n\nThis hurts. A lot. I'd be questioning my entire life as a mother if my son did this to me. Like, why did I even bother? I dunno if I could come back from this, I'd be so hurt. NTA this makes me really sad for you OP.\n\nObviously his entire life isn't gonna revolve around you, but graduation is SO important for parents. You're watching not only the culmination of the child's efforts throughout school, but so much of it was possible because of the efforts of the parents ESPECIALLY when they were young.\n\nImagine playing a supporting character in your own life to a guy who doesn't even end up inviting you to his graduation. \n\nUgh. I'm sorry OP.", "NTA.\nBut is the high school or college?", "INFO: Tough one, my mom is terrible and a huge narcissist but has this fluffy kind best mom ever outer shell she shows to everyone outside our family and everyone believes it…. Including her. I’m not saying you’re like this but I’d look at reasons he might have not wanted you there. Cause I when I got my bachelors I invited my dad and gf and gave her a similar excuse.", "He’s gonna feel real dumb if they end up breaking up soon, which could be likely if they both go off to college", "A difficult situation, not AH here I guess. The son is a bit because he could have stated before that he had this random system to decide who got invitations. If so, maybe it would not have been such an unpleasant surprise.\n\nI understand both sides, so more than a judgement I have a question: what the gf says about it?\n\nMaybe she wants to be there, but would \"switch\" places for a bit. There isnt the possibilty that she goes with you all to rhe ceremony and stays outside for a bit, while watching the event. \nObviously you would enter the auditorium as late as you can and leave as soon you can, so the time she stays on her own is as little as can be. I feel that younger generations are more adept to live this kind of events through a phone.\nIt wouldnt be fair to her if she dont wanna change places or your son is dead set on being her on the ceremony. But I think is something you and your husband can negotiate with them, maybe offer them some gift for their next anniversary, to celebrate her being part of the family and being considerate with you.\n\npd: what I suggested here is what I did for an ex gf. She wanna her mom to go  but her parents said they didnt want to. At last minute they said they could but without any confirmation. \n\nSo my gf passed the invitations to me and the dad of a mutual friend, who helped us a lot during our time on university.\n\nI stayed outside the building as long as I could, waiting for her parents to arrive (ready with a book in hand if I had to wait the whole thing). As I talked to the guards, they were really nice and undertanding, so they offered to keep an eye for me (if the parents got lost and the cameras showed them in other entry) and offered me a chair to be comfortable.\n \nHer parents didnt arrive. The guard at the main door of the auditorium called me when they started giving the diplomas (yes, I got everyone on the mission xD) so he let me enter to cheer my girl. Wasnt the best outcome but at least she got to be cheered for people she cared about.", "assuming there are no glaring issues in the relationship, I can understand why you would be hurt by this and how your son is being unfair to you. however, I hesitate to make that assumption and this is based only on your flippant comment about his relationship. *you* understand that nearly all high school relationships fizzle out and how rare it is that high school sweethearts get married. *I* understand that. a lot of people in this thread understand that. but I need you to think back to when you were his age. when every relationship in your mind was your 'greatest love' and how deeply emotional and passionate a time that was for you and so many other teens. in his mind, this is his *soulmate* and we all chuckle a little about that, considering their ages, and because we know what we know now as adults. but it is important to treat these things with the same amount of gravitas that your son does because that's just how adolescent brains work. he does not yet have his fully developed adult brain which, I must emphasize, is not an insinuation that he is somehow dumber or less capable than a grown adult. what is actually means is that the majority of all of his decisions will be made by the amygdala, which is a structure in the brain that is driven by pure emotion. the prefrontal cortex will be fully developed later at around twenty five years of age, give or take. this will aid him in thinking more critically and reacting less rashly. have you ever made comments in the past about his relationship that may have downplayed it? this could be in response to how you treat his decisions and choices. he might not feel supported by you. you might make him feel silly and stupid for believing the things he does. I know that that likely isn't your intention but it could be what's happening. just something to consider. with so little information about your relationship dynamic, I do not feel comfortable making any judgment calls on whether or not you are the asshole. approach him with an open mind and heart. remember that you were there once too. best wishes", "I don't think you're TA for feeling disappointed. However, if your son also really wants you there, is it possible for him to *request* an extra ticket? My university did this when I graduated last year, offered 2 tickets but also the chance to request extra.", "NTA based on the information provided.\n\nI don’t know if you take his relationship with his girlfriend seriously or not. I don’t know if your son feels that his girlfriend is what kept him from dropping out or killing himself or if he just doesn’t care about you that much. His anger suggests maybe there are deeper feelings and this wasn’t really random choice. Maybe you have things to reflect on and address.\n\n I do know that most parents I know would not be happy at all if their child chose their girlfriend or boyfriend and excluded them from their high school graduation. High school graduation is kind of the end of the parenting journey in a way. Your child is no longer a child. They may leave the family home to go off to college or just move away. If it were me maybe I would have not said anything about the girlfriend but I would’ve been hurt by that choice for life if it were as casual for my kid as just drawing names with them knowing I wanted to go. Letting it go would need time.", "NTA\n\nI honestly would have refused his request. If I am financially, emotionally, legally and intellectually supporting you through high school or college, I absolutely will be present to see you walk across the stage. His girlfriend can sit this one out.", "INFO: Did he attend his gf's graduation last year? When she, too, only got 2 tickets I presume?", "I was gonna go with N-A-H because there's nothing wrong with him inviting his gf over you, especially a long-term serious one, and there's nothing wrong with you being upset, especially since your husband is invited.\n\nYou were, however, TA for calling it \"silly\" and for referring to her as his \"highschool girlfriend\" even though she's still his girlfriend now. Highschool girlfriend implies she was his gf only in highschool, and it sounds like they're still together and staying together.  So I'm gonna have to go with YTA", "Nta", "NTA, that sucks. Like you say, it's his decision, but \"You don't take my relationship seriously!\" is immature teenager talk.", "I think it's the schools fault. The two invites should exclude parents and parents attendance must be necessary. After all, you're the ones paying for his education.", "NTA. Parents should be there over a girlfriend. Son is being an asshole.", "NTA - I feel like you handled it well tbh", "NTA, but about what I would expect from a teenager who has been in a three year long relationship. Cry it out. See if husband can video call you, and try not to put your emotions in the middle of your son's big day. He might realize he was a huge asshole for this.. maybe not. Teenagers can be little shits sometimes. So can adults. Ultimately you treated your son as an adult by letting him know he upset you by picking his girlfriend over you. He acted like a child with his response. He'll figure it out or he won't.", "Info: did your son go to his girlfriend's graduation last year?", "NTA\nWishing I was in your shoes\nI am expected at my child's graduation, not looking forward to it. My own was tedious enough.", "INFO: is there anybody at your son’s school who has an extra ticket you could use?", "NTA your son is the A H", "I think that just shows how much your parents did for you that you can't even imagine not inviting them. \n\n\nNow I'm someone with not so great parents.  So I know there can be plenty of reasons why the son feels his gf earned that spot over his mother.", "In addition to all of this, saying you're disappointed isn't insisting that he disinvites his gf so she can go instead. It's expressing a genuine feeling about something she was likely looking forward to.", "Yeah I was in your place I would have so choose my partner over my parents. \n\nNot everyone has that relationship with thier parents.", "I feel like the undisclosed issues might be the case.\n\nPer the post: \"He claims that he picked randomly which of us would have to stay home, but I'm not sure about that.\"\n\nI also don't feel like necessarily everyone has to make their parents priority number one. Many parents out there warrant not doing so.", "NTA. I agree Mom should have been asked. Mom and Dad worked for 12 years getting to this point, his graduation. He could have asked Mom to come and his GF to attend the  graduation party. \n\nIf he goes to college and his girlfriend becomes his wife she could've graduation of college.", "💯 this. It's a gesture out of gratitude and respect. I'd be hurt deeply if one of my sons did this.", "I’m in the same camp. I have worked my ass off for my kids and I’d be devastated. NTA", "I’m a NTA for now, too. My parents split when I was 13 and it was ROUGH for me. My father was and is a total jackass, was largely absent when I was a kid, and isn’t really much in my life as a middle-aged adult; my mom and I are super tight. BUT, for high school graduation? If I only got two tickets, he still would’ve gotten one. Unless there’s something very serious being hidden, those tickets belong to the parents.", "I agree with this. It’s the support of the parents throughout childhood and his whole school career that got him where he is.", "I feel weird about OP saying “disappointed”. And the dismissive language about the GF? Idk about the dynamics at play here, but… It would make *so* much more sense to me if OP said “hurt” instead of “disappointed”. I would feel really *hurt* if my son did this, I wouldn’t be *disappointed in him*. Idk, that language is really really weird to me.", "I disagree with this. It’s personal choice. If I had only two tickets for my Master’s graduation, I’d have had my partner and my mom there, and my dad and in-laws would have understood. It is up the honoree.", "When I graduated my Masters, I made it INCREDIBLY clear that if I were only able to get 2 tickets, I would be inviting my sister and my boyfriend. Those were the people I wanted there most, my degree was my achievement, my graduations was a celebration of me... \n\nI don't think that parents should feel entitled to be involved in events, they should feel privileged when they are wanted there, and feel proud that they did a good job of raising the kind of child that wants their parents around.", "Fuck that, I wouldn't invite either of my parents. Can I invite my boyfriend twice? 😂", "I definitely agree. I would invite MY folks, but there may be missing reasons. Oh, maybe her son is a little ah. I need more info.", "Well no everyone has great parents and OP sound incredibly guilt trippy.", "If I had 2 tickets, Sorry, one of the rents isn't coming because my husband would be there. That was the case for my second bachelor's. My parents didn't support me through that (or my first degree - I went back as an older student) and he did - even before we were married.", "> unless you & your son have some relationship issues you didn’t disclose\n\n*glances up*\n\n>He claims that he picked randomly which of us would have to stay home, **but I'm not sure about that**.\n\nYes, there are relationship issues she isn't disclosing.", "It's her parting shot that has me doubting her reliability as a narrator. That whole comment about the high school girlfriend - she doesn't respect her son's relationship, and he called her on it.  His response seems to indicate that op says that all the time,  even when it's irrelevant.  \n\nBut given the words on the screen and no reddit armchair MD, I think you've got a good view of the situation.", "High school.", "I think our relationship is pretty good. And I have nothing against his girlfriend, she's a very sweet girl.", "I'd note he invited her husband over her and she has reason to believe it wasn't by chance. Not his dad. Her husband.\n\nThere's a lot of questions from that alone.", "I don't read it that way at all. She just doubts that it was a totally random pick, which makes sense. Are we really meant to believe that he flipped a coin on it? If that was the intention, he'd have told them about it first.\n\nSounds like he just picked the parent he liked more -- and liking his dad more doesn't mean it's anything the mom did wrong.", "This is the part that stood out to me as well. It makes no sense. Why not just tell both parents they have one seat between them and let them pick? Seems deliberate.", "I think there is an unflattering side of the story we're not hearing\n\nBut that's none of my business", "Tbf the only thing OP did that leaned into AH territory was refer to his gf as a silly high school gf… like yeah be disappointed because it IS disappointing but no need to slate the woman her son loves at the same time.", "Making your children feel like they OWE you a seat because you've supported them through childhood is a really toxic way of thinking, and if OP continues with that mindset, it will continue the wedge between them.", "Honestly, if I was his GF I would have pushed for his other parent to go instead of me but that's just me.", "I was very in love in high school too, but I wasn't enough of an ass to exclude my parents from my graduation ceremony in favor of my boyfriend. I knew how important that moment was to them, and I would never even have considered excluding them in favor of him.", "And? His mother has been raising him for 18 years. A high school romance is more important than his mother? \n\nYes, there could be extenuating circumstances. I’d know — I literally received a scholarship for overcoming obstacles (my parents). They were still at my high school graduation.", "Very well said. People chalk high school love to \"puppy love\" which I adamantly disagree with.", "I didn't even think high school graduation, I assumed college. Whoops.", "When I graduated university everyone was guaranteed 2 tickets but you could go into a lottery for additional ones or you could use ones from friends who weren't using both. I wonder if there is something like this here too?", "I agree. NAH. Of course you are disappointed. And he’ll probably wish he made a different choice if he thinks about it years down the line. But developmentally, this is pretty normal for his age. Sounds like a first love, which is so intense (whether they stay together or not). This is also part of the age where kids push back and rebel against parents", "TBF I just had my master’s graduation a few weeks ago & ours also only gave each person 2 tickets. It took place at Royal Albert Hall in South Kensington, so as you can imagine, limited seating. I’m assuming this is a similar situation!", "We had this rule too. It's often a venue capacity issue and outside the school's control.\n\nIf they make an exception for even one student,  everyone will think they deserve an exception too.", "They limit ticket sales at my daughter's school because they had issues with some parents buying 20-30 tickets for the entire extended family.", "My high school gave us all 6 tickets cause we would have been too much for the space otherwise", "Most people only have two guardians. Why is the high school too strict? Maybe it's a humongous NYC-like high school. What expectation of extended family are you presuming? What did you have at your graduation? I only had my parents, and my grandma came to dinner...", "I'm not sure why the gf would be an ass. What'd she do?", "I agree with you. I wouldn’t have felt comfortable as his gf accepting a ticket when I know that his mom (who is still very present in his life) would have to miss it.", "Exactly. Sorry but HS girlfriends frequently become exes once adulthood hits. There’s a very, very real chance they won’t last as a couple. Meanwhile parents are forever. NTA OP. In fact, I would probably pull rank and say hell no. The gf stays home.", "NTA and I agree with you 100%", "Totally agree!", "My guess is that the Dad wouldn’t care enough to argue about it and the Mom would (basically Dad is the fun parent).", "Because when your own child states “oh I chose at random” and it wasn’t you they chose, you’re going to think they like the other parent more. It’s similar to parents having favorite kids lol not anything to be sus over imo", "Very much agreed\n\nINFO: why do you think it’s not random OP?", "You are assuming that OP is that type of parent.  Not all parents are like that.", "I'd be petty & wouldn't care what others say. If she's a traditional mother, perhaps it is time he gets to be an adult about his own laundry, meals,  running errands for him, making appointments, paying bills, etc.  This is a bone-head & disrespectful move on his part.", "Agree with this. Let the gf plan the party and do all the stuff. I’d hang back or maybe go do something I really wanted to do instead. You don’t want me there? Fine by me.", "It’s just like a parent doing something and sibling #1 can come but #2 can’t because they “chose at random”. Mom is having the thought that her son likes her dad more, I wouldn’t think too deep about it tbh", "I think her comments about the high school gf is the reason op isn’t getting the extra ticket dad is. \n\nI think op is dismissing the gf. I married my high school bf. That was 30 years ago. It’s rare but it does happen. Given the fact that they have been together 3 years give their relationship meaning.\n\nI also say this I never dismiss my sons gf. Because one day they may be a random gf later on they could be a future daughter in law. Comments like op made hurts any future relationship. One day of this gf marries op son she will remember this comment. And if they do get married have kids op is going to wonder why her mom gets to have more access during pregnancy, delivery and the first few weeks. I can answer that it will be because op never excepted the relationship gf and son had. No wonder she doesn’t feel comfortable with you now. Because why would she be comfortable when you labeled their relation as her as the random high school gf.\n\nNo wonder so many daughter in laws hate their mil. Because the mil treated them like this from the beginning but when they realized they where marring their son they suddenly cared about them.\nIf you want to start off right with a future daughter in law. Treat every girl your son brings home with respect. Because after he asks her to marry him it’s to late to change the relationship.", "But that was a nephew, if that were your own child graduating high school I think there would be a different take.\n\nI’d be incredibly hurt, especially if I did absolutely nothing to warrant it.  It literally shows how little he thinks of his mom.", "Right? You’re comment is common sense. If I had a child that did this, I would be crushed. I would nope out of the whole situation and let him plan any celebration on his own. Maybe that’s dysfunctional, but I know that I would rather not be around for fear of what I might say to someone, and I’d definitely need some cool off time to forgive. One of my kids did not participate in graduation and that was sad, but at least I wasn’t specifically excluded.", "Lol you don’t know any of that", "Yep! Her son is gonna feel like shit that he did this eventually but that’s cold comfort for his mother.", "And asking her to grovel and apologise for nothing lol.\n\nIt's on him to grow up and apologise. I'm not saying she should hold a grudge, but she did nothing wrong and apologising just because he had a temper tantrum will teach him all the wrong lessons.", "Spend the rest of his life explaining? That's a bit dramatic, don't you think? Any reasonable person would understand why someone would give their parents priority for a graduation.", "She’s racist and beats him. Now what do you think? You have no info at all that she’s a good mom", "The good solution is to have both parents there, which   basically everyone else does unless there are some serious issues within the relationship", "Because it’s HIS tickets. When I graduated I only got a certain amount of tickets and I got to choose who got to be there to see it. Is Op graduating? Are they her tickets? No? Okay cool. Op feelings are absolutely valid but so is her sons decision.", "That’s how I think too! What is up with all of these people and their made up nefarious back stories??? It’s pretty simple. Child is still a dependent on the home, doesn’t get to make the final decision. No indication that his mother is Cruella Devil. Geez.", "Ungrateful how may I ask?", "Ew what?  Ammo to hold over his head forever?!  I feel sorry for your loved ones…", "I disagree with one aspect of what you said. If my child said he wanted my husband to come to an event over me, I wouldn’t trade places with my husband either. I think OP is putting what her child wants first….which is actually a good thing.", "I think it’s fair to be disappointed at the son though. It’s a crappy policy, but he still made the choice. \n\nI had the same situation girlfriend-wise and we did end up getting married. But I wouldn’t have considered inviting her over my parents. Seeing your kids graduate is a big deal, the kind of thing old people try to stay alive for. I just couldn’t imagine telling my mom I’d picked a girlfriend to go instead. And I wouldn’t want my now wife to have picked me over her parents. It’s pretty insulting.\n\nShe was maybe a little rude, but I don’t think unreasonable. And she needs to be mature and all that, but it was shitty and hurtful and I wouldn’t blame her at all for telling him that. He’s not a little kid.\n\nOf course, if they have a more strained relationship than she’s saying that could change things.", "Yeah I don’t like how OP talks about the girlfriend, it’s a bit disrespectful. Her son might marry her one day you never know", "Nicely said!", "It's high school graduation.", "While yes, a lot of high school relationships don't last, 3 years is quite a bit of time, especially for a teenager. I agree that his parents should be the ones there, but you're an AH for assuming \"future ex gf\" when you don't know these people personally or the full relationship dynamics between them. We only get what is typed here by a one sided source.", "i'd love to see how that goes down considering there his tickets not op's", "Tell him you don't care about his \"future ex\" but then don't complain why he doesn't want to share his life with you.", "Doesn’t work when the high school gives the tickets to the graduate as they should not the parents. Your way guarantees this kid goes no contact.", "Lol.", "You really don’t think it’s silly (or at least short-sighted) to choose your *girlfriend* over your *mom* to attend your *high school* graduation? What are the odds that they’ll still be together in 4 years? Compare that to the odds that his mom will still be his mom in 4 years. It is silly. But, what’s important is that OP said that she’ll respect his decision. She’s allowed to tell him her opinion that it’s a silly choice.", "I wonder what would happen if OP did take the dad's place. She said that she was uncertain that he chose at random. If she were to attend in lieu of the dad, would that change anything?   \n\n\nAlso, why didn't the son tell both his parents that he was giving a ticket to the girlfriend and let them decide between the two of them who would get to use the remaining ticket?", "But this isn't a college graduation.  It is High School.  The circumstances matter and are different.", "It's more NTA here. They raised him, yes, and they also made sure he stayed alive to see this point in time. The kid doesn't have a specific reasoning for wanting his partner there over his mother. If she was overbearing or abusive, then I'd understand. But from what op has said, the kid is just being stubborn. If they break up later, he will have nothing but regret", "oh yes of course the strangers who presumably raised him, paid for his school, supported him throughout his academic journey, and made him the person who he is today is less of a priority, right? The argument that it is his own graduation can be made all day but it still doesn't change the fact that he chose a gf over his parent.", "Very fair! If we are taking OP at face value, she doesn’t mention any relationship conflicts with her son though. But as we know, not all parents are perfect at owning up to suffering relationships. \n\nBut yes, if their relationship is in anyway strained I would change my verdict.", ">So I know there can be plenty of reasons why the son feels his gf earned that spot over his mother.\n\nBefore jumping to conclusions, we should look at his age. Maybe the son is just being an immature kid who thinks being in love means he has to always put his grilfriend first. Not everyone at this age understands nuance and they tend to hurt their parents for a while. \n\nOP did react in a good way. She told him it hurts but she didn't try to change his mind, which indicates that she is a good parent. A lot of good parents are being overlooked by their children in their teenage years because it's easy to do so.", "I'm in the same boat as you. I tried to put myself in the commenter's shoes. If I was graduated with an advanced degree & living on my own, who would my 2 people be? \"Obviously my parents\" was *not* the answer I came up with. I would certainly not be leaving my fiancé at home.", "This is kinda where I am\n\nThe OP is NTA but if my kid doesn’t invite me I’m more disappointed in myself and wondering where I messed up raising him that I am not getting an invitation", "I’m with you right there. I had not great parents and I didn’t even do graduation for grad school because I didn’t want them there (paid for grad school myself, they made fun of me for becoming a therapist. It’s been almost 20 years and I love being a therapist)", "My parents didn't know I graduated high school. They didn't even know I went to college.", "Ot he's a pubescent 17 year old who isn't thinking about his mom's feelings, or even thinking.", "Haha tbf my partner would probably prefer to *not* sit in a boring ceremony for 3 hours straight & just celebrate after :)\n\nBut it’s definitely on a case to case! Seeing as this is a HS graduation though, I am more inclined to side with OP as unless she & her son had a major falling out/relationship issues, it’s kind of insulting to pick a young relationship over a parent.", "I'd also argue that the reasoning doesn't have to be malicious. For example, if I had to choose, I know I would've invited my mom no question. Doesn't mean I don't like my dad! I was just closer to her prior to her passing", "I don't know. If this was a divorce situation I could see it, but it seems that OP is still married to her son's father. Also, this is a high school graduation not college - the son is still a teenager (presumably). Teenagers can also be somewhat short-sighted and selfish as well - it could be that the son is only taking his own feelings into consideration and isn't concerned about how his parents might be affected by his choice.", "It might be just because he's closer to his dad but tried to spare his mom's feelings by saying it was random and then got upset when she was still disappointed", "Yeah, very good point. I did have an icky feeling reading that sentence. If OP confirms there are issues between her & her son, then I would change my verdict.", "That sentence was what tilted my head, too. Is there a reason OP thinks her son might lie about it? Kinda weird, as was diminishing the relationship as “a high school relationship”. I mean, that might be true, but I don’t dismiss my kids’ feelings like that- I particularly wouldn’t if the relationship had a couple years in it. \n\nPersonally I wouldn’t invite *any* of my relatives to any accomplishments but they were crap. As a parent, I would hope that I’ve done things in such a way that merits being there: but there are tons of things we aren’t getting here, I think.", "It could be that the son is very close with the dad. So OP assumed that b/c the son felt he had to pick a parent he wld easily chose dad over mom. Doesn't mean he has a bad relationship with OP but in terms of popularity he's closer with dad.", "Mom and dad worked? And the kid did what?\n\n\nThe degree to which people see children and possessions belonging to their parents and not autonomous individuals is both horrifying and entirely unsurprising given what the current culture is like.\n\n\nAlso not everyone goes to college and then what? Guess only woman in a man6life that counts is mommy. Wonderful mindset.", "OP saying she’s disappointed not to be invited isn’t the same as saying she’s *disappointed in him*.  She’s disappointed in the decision because she wanted to go, it’s a perfectly normal way to express that.", "I read it was she was disappointed that she wouldn't be there, rather than be disappointed in him? Because she hadn't said \"disappointed in him\" verbatim unless I'm reading her post wrong.", "Good point. Maybe if parent constantly tells their child how much they see the child as a disappointment, kids feel like their graduation doesn't matter that much to the parent, because no matter what they do, parent is disappointed.", "That’s what’s bugging me, too. Like, I don’t know if I’d say either way because outright: I’m just on the fence here due to the language used.", "Insights like this are why I love all of the input in the comments. I think this is a great point.", "Yeah, but this is a highschool graduation. The parents are the ones who have put in the work getting the kid from 0 to \\~18 alive and somewhat successful. I would be hurt if I was not invited for my kid's high school graduation.\n\nOP's comment on \"high school girlfriend\" wasn't very sensitive, but her implication is that the relationship won't last, and statistically it won't (cue 100 reddit comments about how they've been with their partner since 8 yrs old, regardless).\n\nIf it's a post highschool graduation and you're living on your own (especially if the honoree paid the tuition) sure, invite who you want. For highschool...no, seems like a deliberate slight.", "Sooooo this is a high school graduation not a masters. They’re really not the same especially in terms of the parents level of involvement in the years leading up to graduation.", "Did you feel the same in high school as when receiving your Masters? Just curious because there is usually a mountain of maturity between the two, as well as different levels of support required to graduate.", "Maybe i'm just confused but is his gf graduating the same year too or is there a year difference? Wait i just read there's a year difference.\n\nDid she invite him to her graduation when she graduated last year??", "Then I’d say he has no real right to expect you not to attend in favor of his girlfriend. You’re the one who got him through school. Not her.", "Uhhhhh OP you need to tell him you’re going and his gf can see him after. You don’t miss your kids graduation, they only have one. You birthed that boy, he can be mad all he wants.", "NTA and my heart hurts for you. I can remember taking my kids to their first day of kindergarten and imagining how it would feel to see them graduate someday. I would have been crushed to hear one of my kids didn't want me there.", "If you think your relationship is pretty good, what's the reason you think it wasn't random he picked your husband over you to attend?", "a little advice here, my mum would also say our relationship is great while ignoring problems of the past that, while for her were insignificant, they hurted me a lot (comments about my weight or actitude) so maybe you should question how good your relationship actually is, parents overlook a lot of stuff.\n\nyou should have a honest conversation with him of how he views your relationship with him", "I would definitely consider apologizing for saying it was silly to have his “high school girlfriend” go to his graduation over you. And frankly, I don’t think your relationship with him is all that great if he prefers her over you.\n\nAny other situation would be an invitation of both parents and the GF would have understood that immediately. If he insists it’s random, sure, maybe. However I doubt that.\n\nI would say have an honest heart-to-heart with him about it don’t don’t shut down his feelings on the matter either. Hear him out, don’t interrupt, and don’t guilt him or shame him for how he feels.", "NTA But this relationship is not salvageable, I can't believe he doesn't want his own mother there. That's just crazy to me. Unless there's something else going on, it seems you and your husband raised an unappreciative jerk.", "It seems like you do have something against her by  saying it’s silly to have her at graduation", "Just because she worded it as \"my husband\" doesn't mean he's not his dad. Sometimes people just use the first word that comes to mind, and she surely usually refers to him as her husband.\n\nIf she had said \"his dad\" would the assumption be that they're divorced since she's not saying her husband?", "I'm pretty sure her husband is also the kid's dad. It's not unusual to refer to your child's other parent by their relationship to you rather than their relationship to the child.", "Where does she state that her husband isn't his dad?", "I getcha, and yeah, totally possible. That's why I wanted to say NAH but still was curious. It just felt a little open-ended to me.", "💀☠️ exactly, the missing info is WHY is mom suspicious about being liked less? Something fishy 🐟", "I'm not trynna be mean, but the second OP hit \"post\" and it hit the sub, that did become our business. She can't expect us to make a descion with all the context. If this was r/truthoffmychest then I would agree with you tho.", "They didn’t refer to the gf as silly. They said it was a little silly to pick the gf over the parent coming.", "how is it toxic? parents support you through your childhood and your academic journey, paid for your school, raised you, and made you the person who you are today, it is only expected that the least that could be done is to make sure they are present for a major milestone of their child.", "I know right! Get this, my loving parents who financially supported me, paid for my education, raised me well, supported me through all my ups and downs including my asshole teenage years, and gave me everything I needed to be a healthy and successful adult actually told me they’re hurt I never call them or include them in my life. It’s like, I didn’t ASK to be born or supported or loved or cared for or be advocated for when I was bullied at school or have my super expensive extra curriculars paid for or loved unconditionally. Why do they think they’re OWED any respect or acknowledgement from me? They’re so toxic.", "Are you a parent?", "Yeah, unless there's a whole lot not said here. I wouldnt dare pick my partner over both parents, especially my mom", "If I wanted my partner to be there, then I have every right to choose who should be there.  \n\nNAH.  The school should have changed the rules after covid let up.", "That's understandable. But I'd disagree with your take based on my own personal experience.", "Im married to my middle school sweetheart lol. Everyone always said it was just a phase and wed never end up together again but we did. Years of marriage and 2 kiddos later, we are happier now than ever.", "I married my high school love and we are still going strong 23 years later.  It's not always \"puppy love\".  Sometimes it truly is the real deal.", "For high school?", "My graduation was at the Royal Festival Hall in London, so less seating, but I had no issue getting 4 tickets. They used a system where the first two were guaranteed and the left overs were first come first serve. If they don’t have enough seating, they can always divide the group of graduates into two and do multiple ceremonies. That’s up to the school to figure that out.", "And this was almost 20 years ago", "Accepting a seat knowing it will take away from one of his parents is a asshole move. She should have turned it down and told him that they can celebrate later.", "Is she very present in his life in a *positive* way?", "I’m also wondering why he doesn’t find someone who isn’t using both tickets. I’m sure there are a few, and that one should be gf’s ticket.", "Pulling rank on things like that is a good way to ensure that you _aren’t_ forever as a parent. The son is old enough to choose who he wants at graduation, and while of course it’s fine for the mum to be hurt, insisting on getting her own way will just make the son upset and will sour the event all around.\n\nI’d say NAH. The son can choose who he wants to be at graduation, and clearly his gf means a lot to him. The mum can be sad it’s not her going and isn’t unreasonable expressing that.", "Idk, that doesn’t make too much sense to me. I’m willing to admit IF given enough context that she’s just being hurt by her sons supposedly random decision, but this is Reddit lol. I wanna know if there’s something OP is leaving out just in case. Truthfully, I just graduated myself and I wanted everyone but my mother to be there because she was foul to me the entire time. I was honestly paranoid at the idea of someone who treated me like that to be cheering me on at grad. \n\nShe ended up not being able to show anyways due to an injury, but had she actually asked to go I would’ve denied her a ticket. 💀💀", "We're supposed to take OPs story at face value. If you don't, then there isn't much point to the sub.", "Stated so very well.", "This! Being a good mother means to pretend you try to learn all the names of Pokémons when the kid is in the Pokémon phase. If you call \"silly\" anything that's \"important\" to your child, they will stop sharing their \"important\" (like graduation) with you, because it hurts to hear it's \"silly\" to the most important person in their life.", "if that happens I support her 100% if she brings it up in the future.", "Fr, and it’s a high school graduation. I don’t think many people expect or feel like they were supposed to be at their spouses high school graduation over the parents.", "She’s also probably a serial killer who forces children to work in coal mines. Obviously she’s a monster, there’s no other reasonable conclusion that can be drawn from a teenager making a silly decision.", "Lmao his decision is not valid and *is* silly. You’re going to seriously say that him bringing his high school girlfriend, who he very likely has known for 4 years or less, over his literal *mother* makes sense and is a cool choice to make? Please get real. As we have no other narrative to go off of, his mom says their relationship is normal and she likes his girlfriend. He isn’t not inviting his mom for a valid reason, he’s doing it because he is in teenage love. A relationship that will likely end in college, as most do. Children, teenagers included, make stupid shortsighted and hurtful choice regularly. This is one of them. It’s asinine to pretend it is anything but.", "You can ask but you and I both know that’s a bullshit question so this is the only answer I’m giving you.", "It's a joke. Thought calling it ammo and saying on the bright side would be enough.\n\n\nEdit: rethinking your comment\nAlso, i have done plenty of stupid things as a teen and young adult, some of whom have hurt them emotionally. For which my parents still privately make fun of.\nThey aren't angry, just reminiscing, and never held it over my head. So I don't know why my loved ones should feel sorry. And yes, in the grand scheme of things, high-school graduation isn't that important compared to other life milestones.", "Oh then DEFINITELY NTA.  He’s barely an adult, still living with her, she should get to go to the graduation", "no i dont think so because we dont know the relationship between the mother and their son. its not silly at all its his choice nobody else's", "We have no idea if she’s overbearing. This is only said from the OPs viewpoint and I’ve met very few parents who are self aware enough to call themselves overbearing. He might have valid reasons for wanting his gf over his mom", "He's a teenager, literally the part of his brain that is responsible for long term thinking and decision making won't be fully formed until he's in his mid 20s. I'm not saying he's right, per se, but it's very understandable that this is what he would want if he's been with someone for 3 years, which is a lifetime in the minds of teens. I don't know how old or how educated you are, but those are the facts, regardless of subjective truth. And the only thing we know is what OP has presented to us, we don't know the full history or dynamics of the relationship between him and his mother/parents. I'm just sayin, try to have a little more understanding before hammering down judgement on people you don't know so harshly.", "Oh u mean parenting? Missed the part where OP’s son asked to be born", ">Very fair! If we are taking OP at face value, she doesn’t mention any relationship conflicts with her son though.\n\nShe's hurt by the request, which is understandable. but she she's reporting as her response is pretty fair and respectful. I know that's not the full measure of a parent, but as someone whose got some drama llamas in her family, it's sure not the response I'd get in similar circumstances.", ">all parents are perfect at owning up to suffering relationships.\n\nThinking back to my own hs days, I know my mom would have described (and maybe even believed in her head) that our relationship was much different than how I felt about it. The fact OP refers to his girlfriend when as his \"high school girlfriend\" as an obvious dig to try and minimize the relationship when talking to him sets off my radar though and it 100% not the way to win him over.", "In which case the verdict is INFO not NTA. Guess it wouldn't really change your verdict because you think parents are the consistently most important people in a child's life, even when that child has become an adult", "But he is also choosing his father over her, so maybe it's not so much immaturity as their relationship not being that great. Ee just can't know. Also, \"I told him I felt it was a little silly to have his high school girlfriend come over one of his parents\" might be true, but it is neither fair or respectful and she very much WAS trying to change his mind.", "You're also leaving out her saying I'm disappointed in you and your decision is silly. Without jumping to conclusions this could be a sign shes a manipulative parent who attempting to guilt her child", "My parents are the very last people I would invite to a celebration of any accomplishment I have achieved.", "Mine wouldn’t either! Lol! He would happily skipped any graduation!\n\n\nBut my parents stressed me out. I literally threw my mom out of the delivery room because she was annoyed the hell out of me!", "I put an INFO comment asking for elaboration, but she's yet to say anything. I'm thinking we won't know for sure lol. Enjoy your day though!", "There absolutely can be issues between your child and yourself without you being a bad parent.", "Maybe it’s mom and the girlfriend who have beef. If they don’t get along with each other then that would make sense too.", "It might just be me/the way OP’s phrasing strikes me, but it’s just weird because it doesn’t feel emotional. It’s almost like judgmental instead? “I’m disappointed, I found it silly that he’d invite his gf” rather than “this feels hugely personal and hurtful”, type of thing. It’s hard for me to put my finger on it, but like, in her shoes I feel like this is something that would make me cry.", "Yeah. The “disappointed” comment and the son getting *angry* at that and saying she doesn’t take the relationship seriously tells me something here. Idk. Rather than her feelings being seriously hurt by this (which is 100000% justified), it’s like, she’s disappointed in his choices? Just really confusing to me to go *there* instead of feeling like/saying you’ve been snubbed, left out, that it *hurts* personally as his parent.", "Of course, i guess I just wanted to show that it's not always the norm for parents to be at these types of events!\n\nMy sister graduated her undergrad and didn't want our parents there, so much so that she didn't actually go to her graduation. But these types of feelings aren't built on nothing, yknow? There are reasons why a parent/s may not be included in these kinds of things, and it's usually built on history and childhood and whatnot.\n\nSo yeah, high school isn't the same as a masters, but it's not too different, I guess?", "Great question.", "That’s what I want to know too", "I thought the same thing. There’s definitely something there that maybe isn’t even realized so let this be an opportunity to clear the air and deal with past hurts.", "Similar experience here. It's better now, but I don't think my mom is aware of how bad our relationship was when I was a teenager. I did recently confess to her that I frequently felt dismissed and belittled by her when I was younger, and she did seem genuinely apologetic, but even now I don't think she realizes that she was verbally and emotionally abusive. And to be fair, I have never put her behavior in those terms to her. Because even now I'm fucking terrified at the thought of how badly she might blow up at the suggestion that she was anything but a loving, supportive mother who did her best.\n\nOP, I would say NAH right now, but definitely sit down and have a frank conversation with your son about why he made his choice. Do not try to change his mind. Just let him know that you want to make sure it isn't based on feelings you aren't aware of, and tell him he can talk to you about anything. Then, genuinely listen to him without judgment or interruption.\n\nYou may be surprised with a difficult conversation, or it might be that he really was so caught between three people that he loves completely that he had to resort to a random name draw. If he has reasons for not wanting you there, do not try to invalidate his feelings; promise to work on the relationship with him. Either way, tell him you love him and can't wait to celebrate him after the ceremony.", ">I would definitely consider apologizing for saying it was silly to have his “high school girlfriend” go to his graduation over you.\n\nIt just is though lol.\n\nA high school graduation isn't even a big moment for a couple who aren't even graduating together, so inviting her over his mother is just ridiculous.", "I'd think that's because it's EXPECTED for parents to join their children for their graduation ceremony. It's almost unheard of to bring girlfriends/boyfriends instead if it means your parents can't attend.", "It is silly. High school graduation is the culmination of 18 years of sacrifice. I didn’t lose two teeth, gain 20 pounds, and not sleep for five years to be excluded.", "In a conversation about said kid? That's very odd to me and not something anyone I know would do.", "If I or anyone I know was talking about this scenario it would be \"his dad\" rather than \"my husband\", but maybe there are people who would phrase it this way even if it was his dad as well.", ">WHY is mom suspicious about being liked less?\n\nBecause she was the one who didn't get invited, obviously.", "I was quoting an old \"Kermit sipping tea\" meme I saw back in the day", "Ah I misread that part but still, calling her a high school gf specifically when the relationship does seem long term… is mean", "Yeah and this is why everyday I lean even more on never having kids. You’re supposed to sacrifice and support them for 18 years (and usually beyond) but you can’t even expect a ticket to the graduation? That’s considered “toxic.”", "People saying this is the bare minimum and shouldn’t expect anything in return are so weird, like yes it’s the bare minimum but why wouldn’t you want to be appreciative for that? Like as a child I don’t technically owe my mum anything, but I’d still want to “repay” her for everything. It’s certainly not toxic to expect your high school kid to invite you to their graduation unless your relationship is strained for whatever reason. I don’t think the son is an AH necessarily, just not very thoughtful.", "This is literally the bare minimum of parenting. If you're not willing to do this all for your children without being \"recognized\" for it, don't have children.", "Probably because children didn’t ask to be born, and parents are supposed to do all of those things without any expectation in return. Like oh my goodness you did the minimal requirement for any decent parent? Wow", "He didn't ask to be born. He didn't ask for his parents to financially support him. Thats a parents job and the responsibility they accept when they decide to have children. Parenthood isn't something anyone should be holding over their children's head. Parents aren't owed a spot at the table, they need to earn it. That's through mutual respect, emotional support, and how they conduct themselves. True emotional connection, NOT payback. Thinking this is an entitlement as a parent is super problematic.", "I'm super happy your loving parents were so supportive. Thats an experience not everyone has the privelege of.\n🙋‍♀️", "Or, or: you could have parents like mine who hated everything I did at school, refused to learn anything about college admissions while pressuring me to go, made me fund everything I did myself, and made fun of me at every opportunity. \n\nYour parents aren't even close to everyone's parents.", "Super happy for you and not here to rain on your parade but... you realize you're the exception and not the rule, right?", "For every story like yours there are 99 where they don't end up together", "Yeah, and my brother insisted he was going to elope with his high school girlfriend only for them to break up 4 months into college. I’m happy it worked out for you, but guess which story is more typical. \n\nI’m hesitant to render judgement here because I don’t know how his relationship is with his parents, but if it’s a normal, healthy one, then I completely agree with his mom and understand why she’d be offended that a girl that’s *very unlikely* to be in his life for much longer got invited over her. I’d be upset too. So I’m *tentatively* saying NTA. \n\nBut I also get that if there’s strain in their relationship he might not want her there, and this could be a missing missing reasons type post. Imo the real AH here is the school administration keeping a pandemic invitation rule in mid 2023.", "Married my high school sweetheart. Still together twenty-five years later. Still, most don't get that lucky.", "same! we met in 8th grade, 15 years and 4 kids later we've stayed married longer than most of the family that told us we would never last lol", "We don't do secondary/high school graduation ceremonies in the UK.", "They said masters meaning they graduated from. university.", "Yep! That’s what we did too, 2 guaranteed and first come first served for the leftovers. And they did divide us up! Faculty of engineering, faculty of medicine, & school of business", "We can't properly fill in the blanks for how the invitation played out. That's two \"other parties\" of the story, that we can't hear the perspective of. He may have issues with his mom that the gf knows about. She very well could have tried to turn it down, but the son could have been super adamant.\n\nI get what you're thinking, I guess I personally wouldn't label her an asshole without knowing her (or at least the son's) perspective.", "We don't know what his relationship with his parents is like or why.", "She can’t force him to give it up so you want her to not support him and ruin her relationship with her bf to have op like her? She clearly doesn’t like the gf . Be realistic. Why would she do that?", "Especially since, honestly, it's just going to be boring for a nineteen year old to watch a graduation ceremony while it would mean so much to his mother.", "I respectfully disagree. My oldest son and I fought like cats and dogs all through high school because he felt that getting his diploma was optional; today at 21 we are very close. He has often thanked me for pushing back on questionable choices that he was certain were spot on at the time, because a couple years of living independently has taught him that some of those choices weren’t good ones. Parenting often means being unpopular and setting boundaries even when it feels shitty to do so. That’s a parent’s responsibility along with loving and protecting their kids. HS graduation is a once in a lifetime thing. If mom backs down now just to avoid a conflict both she and he will regret it. It doesn’t have to be nasty. But he needs to know that choosing mom over the gf for graduation is a no go.", "No you aren’t. This thread is seriously lacking INFO posts. The whole thing is super vague", "I try to treat everyone my son or daughter brought home as a possible in-laws. I never wanted to start off with a bad relationship.  I am happy to say to this day o try and treat the in laws like I do my children. \n\nBut if so many mother in laws would take this approach instead of will it’s just a gf or bf they don’t count. When they do count the relationship is doomed before it starts. \n\nIn my option the gf have this problem more the bf do.", "This!\n\n if you want to be involved you learn to grow and relearn your place in their life! instead of clinging to the fact I am your mother I am more important than any thing!\n\nLike you said you learn and grow with them. You support them. Even when you know it will crash and burn you still show up and be their biggest cheerleader. You don’t say I told you so. You say that sucks what do you need me to do to help you!", "Nope, just because you popped a kid out doesn’t mean you automatically get a spot at every big life event your child has. Parents earn their place too. If he doesn’t want his mom there than so be it as much as that sucks", "True. We don’t know for sure. I’m just going off of OP saying in the comments that their relationship is really good. Of course, it’s always possible that this is not true…but I can totally see an immature 18 year old taking his parent for granted and prioritizing his gf over his mom for something in which  his mom should have preference. If OP is a good mom, I think she’s going to get an apology once he matures.", "I love the word drama llama. I am sorry they do that they act like that though.", "Imho it’s not an “obvious dig”, it’s just a fact.", "Why? She IS HIS HS GF. It’s pretty uncommon to marry a HS sweetheart now days. My dad was a pretty chill guy, but he was absent a lot of my life. My mom pretty much sucks the life out of me. But they brought me up and did make sure I was educated. There’s not a chance I wouldn’t have invited them to my HS, college, or law school graduation.", "Because it’s a HS graduation, I’m inclined to be on OP’s side of this! Unless & ofc for some reason she has a bad relationship with her son she didn’t disclose.", ">might be true, but it is neither fair or respectful and she very much WAS trying to change his mind.\n\nHow sensitive are redditors that talking openly is seen as manipulative and \"not fair\"? He is old enough to hear the truth. She didn't **make** him change his mind, she didn't get mad or tried to punish him. Of course she will tell him it would be better if he changed his mind, that's not a bad thing.", "Telling people how their actions and choices made you feel is not manipulating them. What a weird take.", ">this could be a sign shes a manipulative parent who attempting to guilt her child\n\nI don't think you know what manipulation is. She was disappointed and is allowed to say so. \n\nManipulation is whe you do things to get your way in a way that is not obvious. For example if she had told him, his girlfriend told OP that she actually doesn't want to go, in order to make the son feel insecure and invite his mother instead...or something like that.\n\nShowing your feeling is *not* manipulation. She told him clearly how she felt about it but didn't make him change his mind. If he feels guilty because of how he made her feel, it's still not manipulation.", "Maybe. Or maybe her son is just a teenager making a silly and inconsiderate decision. Teenagers do that. A lot.", "It’s unheard of for a high school graduation to only give 2 tickets. Idk anyone who didn’t invite their boyfriend/girlfriend to their graduation", "It’s not silly at all. Parents choose to be parents.", "You're reading too much into it. By the same token, if she had referred to him as the son's dad instead of as her husband, I would think they might be divorced and that some drama around that could be behind her not being invited.", "Why would you say “my sons dad” instead of “my husband”? Why do you automatically assume her husband is not the kids father? That doesn’t make much sense. It’s a possibility, just not the likely one", "It’s true that she didn’t get invited, but would dad feel the same sleighted way if he wasn’t invited? As someone who feels like OP would be very good friends with my own mother, I can say I’m definitely getting a sense of “I’m your mother and I’m entitled to all sorts of things like positions in your life because of that” vibe here, which is exactly the reason I don’t include my mom in my life as much as she ironically wishes she was. Because she acts needy, and that’s extremely uncomfortable.\n\nNot saying OP should hate his mom or anything. But if that sort of dynamic existed, this entire story makes sense on why he became defensive over his mother telling him what his life values are supposed to be. I get that entirely.", "I mean if he’s just now graduating high school then she is a high school gf. And his mom is his mom.  For a lifetime.", "I have to ask, do you have kids?  That's A LOT.  She's not asking to be recognized at the ceremony or presented with a present, she wants to be there for her kid and celebrate with him.", "I'm sorry but whenever someone says \"I didn't ask to be born\" I always think I'm talking to a hormonal preteen, and that's coming from someone with dysfunctional parents.", "It's a quite common saying but it isn't practical in anyway or form. Might as well treat parents as complete strangers then. Familial relationships are supposed to be built on mutual respect and trust but here you are asking everything to be provided for you and at the same time using the \"I didn't ask to be born\" card whenever it is convenient for you.", "Like you have already said, familial relationships are a two way street, you cannot simply demand the requirements be met and at the same time expect to be devoid of any expectations. The \"I didn't ask to be born\" card is quite a thing to use whenever it is convenient. Parents can't be 100% selfless, they are humans too. It's a graduation party where pictures will definitely be taken... where one parent is simply not there?", "Yes, and not everyone has toxic or abusive parents, which is why it’s completely inappropriate to make a blanket statement that any parent who thinks they deserve to be a part of major milestones for children they’ve supported is “toxic.”", "But you’d agree my parents aren’t toxic for expecting to be included in major milestones? Which is what the comment I replied to said?", "Does it matter? Every relationship is important and every relationship has the potential to fall apart. The son is a HS kid - his relationship with his gf is extremely valuable and important to him right now. Maybe it'll last, maybe it won't. Dismissing it as \"unlikely to survive\" is just a way of dismissing the kid's feelings. Hell, statistics say that around 50% of marriages end in divorce - should we then dismiss someone's engagement or wedding because it might not last?", "You could say that at literally any age.", "More like 999", "That doesn't mean that young love should be treated as 'not important'. That's just a good way to make sure your kid hates you. I'm not longer with my ex, but the way my parents treated her still affects how I feel about them.", "And almost everyone I’ve met that stayed with their first partner has no clue how much they’ve settled because they have no perspective", "Ending up together isn't the only standard for the importance of a relationship. First lives can be intense and formative experiences that have a larger impact than an adult relationship later in life. And, frankly, that doesn't matter; a parent should not be minimizing their child's feelings like that.", "Who pissed on your chips?", "Ok", "I mean as a former graduate and current mother I found every graduation I've ever been to,  to be boring except for the one single moment my kid's name was called. The 19yo probably still has a bunch of friends graduating.", "I'm not close to my parents. I invited them to my graduation anyway, because everyone was bringing their parents. It made it painfully obvious why I'm not close to them and my biggest regret is inviting them. When I graduate with my Master's, the only person I'm inviting is my boyfriend.\n\nNot everyone has great parents. OP not believing her son chose at random whether it will be her husband or her to go shows that there are issues in the relationship.\n\nI say NAH - OP's son can choose who comes and OP can feel slighted, neither makes them wrong", "Uh. Yeah. You are. I don't know how else to phrase that for you lol", "No one said he's legally required to invite her, but he's still a total asshole for the ingratitude.", "What about telling his decision is silly. \n\nIs it really \"good parenting\" to basically say. Well, I'll respect your decision, but just know it's stupid. \n\nSo yes when someone says your choice is \"silly\" their trying to nudge or manipulate you into doing what you consider the \"smart\" choice.", "Here's why I consider it manipulation. \n\nShe's saying him taking his girlfriend is a silly decision, and the smart and right decision is to invite her. \n\nShe is essentially saying you can do what you want but just understand your current decision is stupid.\n\nYou're focusing only on the disappointment statement skipping over her insulting his decision.", "This is the probable answer. Teens make seriously flawed decisions for better or worse. This is a situation where mom should push the issue. I can almost guarantee that son will look back on this situation 15 or 20 years later and be like, “what the hell was I thinking?”", "I don't know anyone who did invite a boyfriend/girlfriend to a high school graduation.", ">but would dad feel the same sleighted way if he wasn’t invited?\n\nAlmost certainly not, because in the story he basically shrugged at the whole situation and offered to swap.\n\n>which is exactly the reason I don’t include my mom in my life as much as she ironically wishes she was. Because she acts needy, and that’s extremely uncomfortable.\n\nYou're just proving her point -- that she wasn't invited for a reason, and that it wasn't just a random coin-toss or whatever.", "No kids, but was the child of the type of parent who wants to be recognized all the time for my achievements. \n\nYour kid doesn't owe you recognition for the things you were required by law to do (getting them to school).", "I do. I have 2. one of which graduated from high school not long ago and if for some reason they asked me to not attend the ceremony I would have accepted it because I know there would be people taking pictures and videos and I'd get to spend the rest of the day with them. Or even a different day. It's ok to be upset a little bit but there will be far more important events that happen after high school. OPs kiddo won't even be with the people watching the ceremony so it isn't something you celebrate with your kid. The celebrations and really fun stuff is the party or dinner after so you can actually see your child and talk to them.\nIt's not a lot. It is literally the bare minimum. Food, clothes, education is what people should be doing without praise.", "I think you're just struggling to see any POV other than parents that have always been loving and supportive, and thats just not the reality for everyone and it also can't be assumed of the OPs family dynamic.\nIt doesn't change the fact that if OP continues to make her son feel like he isn't delivering her what is owed, it will continue to push him away.", "OP isn't referencing a graduation party. You should read it through again.", "Can't the same be said that you can't assume all families are \"normal.\" Frankly, I think it makes little difference. Even adequate and good parents shouldn't hold parenthood over their child's heads. Thats going to inevitably build resentment.", "By the sounds of it, 99 different people in highschool did", "How is he the asshole? I didn’t invite EITHER of my parents to my graduation OR my baptism and I have a good relationship with both of them. I simply just didn’t want them there and chose others over them instead. They were perfectly fine with it. Again just because you’re a parent doesn’t mean you’ll always trump over others. If he wants his high school girlfriend to go then he wants highschool girlfriend to go. it doesn’t matter if they “last” he still wants her there. NAH", "It's not manipulative it's quite upfront. It's very clearly saying that you think the choice they made is wrong.", "Of course a parent should tell you when your decision is silly? That’s their job, to teach you how to make good choices in your life. It’s literally their job to nudge you into what they consider a smart choice, what do you think they’re meant to do?", ">She's saying him taking his girlfriend is a silly decision, and the smart and right decision is to invite her. \n\nBecause it is. For everyone, not just OP. As a parent you have to sometimes say \"I love you, I respect your decision but just know it's a dumb decision\".\n\nWhat kind of a parent are you if you always act as if everything the child does is the right thing?", "She made a mistake downplaying his relationship and calling his decision silly (not the same as stupid), but it's still not manipulation. She's stating her opinion outright.", "Well the reason she wasn’t invited for likely wasn’t listed in the post, good day sir.", "Judging by your responses up and down this thread, you also have difficulty understanding anyone else’s point of view. It’s awful that your parents weren’t what you needed them to be. But refusing to acknowledge the valid perspective of others because of your own trauma is not productive.", "It isn't \"owed\" but is rather expected. Parents can't be selfless 100% of the time, they would definitely want to be a part of their child's major milestone.", "The ceremony is usually followed by a party within the school premise itself. Don't know if it might be different for others.", "I would not assume all families are normal. But then I didn’t make a blanket statement, you did. And while I agree good parents shouldn’t hold parenthood over their children’s heads, I do think it’s perfectly reasonable for good parents to expect to be included in major milestones.  It would be selfish for children to exclude loving, nontoxic parents from important events like graduation or weddings just because they felt like inviting other people. You don’t get another high school graduation. Making your mother miss out on that without a better reason than “I wanted to invite my gf” is selfish and incredibly hurtful to your mother.\n\nAnd who knows, maybe OP is a toxic parent and there are some missing reasons here, that could be true. I don’t take issue with any individual person not inviting parents for personal reasons. I took issue with your proposition that it’s toxic for parents to expect anything at all ever from their children.\n\nAlso, I’m sorry for my tone. I’m having a rough day. I shouldn’t have been sarcastic.", "And there are plenty of things that the parents *wanted* that they went without to support their child. Gratitude doesn't just mean paying legally binding debts and then saying \"i don't wanna!!!\" any time it comes to showing appreciation for anything you aren't forced to at gun-point.\n\nIf he had any gratitude towards his mother for putting him through high school and raising him from diapers, he wouldn't have said \"lol soz flipped a coin so you're gonna have to sit out one of the biggest pay-offs a parent gets so my gf who isn't even graduating can... uh... be proud I graduated a year after her\". Actually, by all accounts there wasn't even a \"lol soz\". He doesn't even have that level of basic empathy.", "That depends doesn't it? \n\nIf OP was this amazing mom always there for her son than yes it's being upfront. \n\nBut what if she's wasn't so great of a mom. Maybe abusive maybe emotionally unavailable.  If that's the case it's her trying to manipulate and not be upfront. \n\nThat's my point. It depends on who says it.  It could be good parenting it could also be manipulative.", "But how do you know inviting her was the \"right thing\"  \n\nMy comment was based off you saying, the mom showed she's a good mom by what she said. \n\nI'm saying that line proved nothing. Because she could be saying your decision is dumb and for all we know she's abusive to him.  \n\nRemember this started with me saying not all parents are deserving of a seat at graduation. We don't know how this person was raised so it is possible she's being manipulative also possible she's a good mom. \n\nBut we weren't there he was. I'm just saying not all parents are good parents. Just because she said I respect your decision doesn't really prove she's a good mom", "telling someone their decision is stupid is an incredible way to get them to not change their mind and do what you want. just because you feel something is a true statement doesn’t mean it needs to be said, and it obviously didn’t help or she wouldn’t be asking reddit. as for “what kind of parent”, i’d say the kind of parent who doesn’t get invited to their kid’s graduation.", "That's fair. My intention was to add a perspective that I didn't find much through reading other comments. And I do believe that this is going to be a recurring issue as OPs son continues into adulthood. My experience is that many friends and family members share an experience while moving into young adulthood and becoming adult children, where the parents feel that they are owed services because of what they gave their children growing up. And in my experience, the only path that will lead to is resentment. That experience isn't something that can be blanketed across all young adults and adult children, but it also isn't exclusive to me.", "Oh really? My father didn't even bother to show up to mine and I had to practically beg my mother to show up. Not everyone has good or even decent parents dude.", "But dismissing his relationship with his girlfriend because he should owe this to his mom is the issue. I think its completely reasonable for her to say, 'I'm hurt and I would've like to be included, but I understand this is your decision and a hard one to make. Let's figure out how to compromise over this tough situation and figure out how we can all celebrate as a family (or something).' That's reasonable. But to throw shade at his girlfriend and act like this is something she's entitled to is an issue.\n\nI think it boils down to tone and intention. They should have a sit down and really talk through their feelings together.", "I’m curious what this has to do with this post? Like OP clearly does want to be included and we are talking about whether she’s entitled to feel that way. I’m sorry you had crappy parents who didn’t care to be included in your life, that really sucks. But also that doesn’t really have anything to do with this post or the discussion here.", "My parents didn't show up either, they didn't give a shit. But OP clearly does care, and wants to attend. Different situation.", "There are exceptions to everything and of course what I said is based on assumptions. It will be a never ending cycle if we try to consider every possbility bro.", "I wasnt replying to the op tho was I? I was replying to someone else's comment.", "I wasnt replying to op. I was replying to a very specific comment rhat said \"parents would definitely want to be there for their child's major milestones\". I was pointing out that that isn't always the case.", "That is not what you said, though. You said they would definitely want to be there, which isn't true."]}