{"id": 17623, "submission_id": "13lnc7y", "title": "AITA for telling a friend that she’s not more important than my education?", "selftext": "I am starting a fairly prestigious grad program in a few months.  It’s something I have worked hard for, and something that is very important to me.  \n\nI was talking to a good friend, whom I’ve known about half my life.  My friend does not put the same value on education that I do, and that’s fine.  Different strokes for different folks.  However, she makes comments about the privilege of school and questions the validity of this path in terms of financial solvency.  \n\nLast week, she and I were talking, and she raised concerns when I stated that I didn’t feel comfortable with making plans that extend into the time when grad school has started, as I wasn’t sure about how much time I would have.  Her response was that we make time for what is important, which I agree with in theory.  However, I will be working, going to school, and maintaining my home.  In addition, I have a pet who will need caring for and I have chronic health issues that require doctor appointments.  I said that she’s important, but not more important than school, paying my bills, and managing my responsibilities (pet, health, home).  \n\nShe hung up, leaving me feeling like I had misstepped.  Am I the asshole for telling her that she is not more important than my education or my pet?", "created_utc": 1684478429, "permalink": "/r/AmItheAsshole/comments/13lnc7y/aita_for_telling_a_friend_that_shes_not_more/", "score": 1512, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I told my friend that my education is more important to me than she is in response to her demands of my time.  \n\nI might be the asshole because I’m putting myself before a friend.  (If she needed something urgently, I would do my best to help, but if she just wants to “hang out”, that’s a different story.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", ">She hung up, leaving me feeling like I had misstepped.\n\nNAH. Technically I agree with you, but I think mild gracelessness in the face of major differences like this don't fall into AH territory.", "NTA. She's pushy, and it's simply true. You wouldn't drop a doctor's appointment to hang out with her--and that doesn't mean she doesn't matter at all, it's just reasonable to have priorities.\n\nShe's unsupportive of your choices. You can tell her you want to spend time with her, but *temporarily,* you have to focus on this program. You will graduate! If she were supportive, you could spend time together while doing things you need to do (walking a dog, grocery shopping, even a nice meal because we all gotta eat). But it's draining to try to do these things with someone who fundamentally undermines your choices.", "NAH. You are not AH for choosing your education and responsibilities. But she is feeling a bit abandoned and wants to feel like she is still important to you. It's just that you are in different stages of life and prioritise different things so starting to drift away.", "NAH- you're not wrong, but she's probably already pretty insecure about losing you as a friend and it probably hurt to hear it so bluntly.", "NTA\n\nYou told her you didn’t want to commit time you don’t know that you will have. You can try to let her know that once you’ve gotten into a groove with your new schedule and settled into school that you’ll be happy to talk about making plans. School and your future are important to you, and your friend should be supportive but can also be disappointed that she won’t be able to spend as much time with you.", "NTA you have a lot on your plate and a real friend would support you instead of telling you to ignore what’s important to you. You could have been a bit more tactful in how you said it but I don’t think you are in the wrong for prioritizing your education health and home.", "NTA\n\n This is your future. Going to school, working full time and having health issues is a lot on your plate. Your friend should grow up, ofc there would be things that are more important than her in your life", "NTA you could have had a lot more tact but the message would have been the same.  She's probably hurt, which is understandable, but her hurt doesn't trump your education, health and responsibilities. Good luck in your studies.", "NTA.\nIt's always good to know where you stand.", "NTA but you still might wanna apologize to your friend, they could be feeling undervalued in their life for some reason", "You’re correct if that’s what you mean but YTA still", "NTA she feels entitled to your time. You cannot commit to anything at the moment and an adult should understand that.", "NTA\n\nNo one other than your own children is more important than moving your life forward in the direction you want. Not even your spouse. Spouses are a joint decision to move your lives together that you make every day. \n\n\nShe wants you to potentially damage your grades, lesson what you learn, and/or damage your eventual earning potential/job ability because she's insecure. That's a hard pass. \n\n\nPeople are friends because they get along, have things in common, respect their differences, and have a shared idea of what the relationship is. It sounds like you two no longer do. Unless she apologizes and understands your priorities (not makes them her own, just understands and respects them) there's not really anywhere for the friendship to go.", "Slight YTA. I absolutely get your side, you don’t wanna pack an already busy schedule. But this is your friend, she probably took what you said as you ditching her completely. You could’ve said it nicer, said something like “I’ll try my best but I don’t know how busy I’m going to be then, let’s wait to make plans until closer to the date”", "NTA education is so important she was frankly childish to push when you're so busy.", "I sympathise with you both. My best friend moved away for studies and it was tough but we did manage to make time twice a year. Mild YTA because I think you could have said you’ll wait a bit to settle in and then make plans", "YTA for *telling* your friend that she’s less important, which was your question, after all. You are not wrong in how you are ordering your priorities, but you need to work on your diplomacy skills when actually talking to someone you presumably value.", "I mean, I get your point but YTA - you basically told your friend she's bottom of your priorities and I know I'd be upset hearing that. You told her that you're dropping her because everything else in your life is more important. SMH.", "YTA, not for valuing education but for essentially telling her that everything (including chores) is more important than your friend.", "YTA,\n\nWhy are you even friends with this person? You lost a friend and yess you are big AH", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI am starting a fairly prestigious grad program in a few months.  It’s something I have worked hard for, and something that is very important to me.  \n\nI was talking to a good friend, whom I’ve known about half my life.  My friend does not put the same value on education that I do, and that’s fine.  Different strokes for different folks.  However, she makes comments about the privilege of school and questions the validity of this path in terms of financial solvency.  \n\nLast week, she and I were talking, and she raised concerns when I stated that I didn’t feel comfortable with making plans that extend into the time when grad school has started, as I wasn’t sure about how much time I would have.  Her response was that we make time for what is important, which I agree with in theory.  However, I will be working, going to school, and maintaining my home.  In addition, I have a pet who will need caring for and I have chronic health issues that require doctor appointments.  I said that she’s important, but not more important than school, paying my bills, and managing my responsibilities (pet, health, home).  \n\nShe hung up, leaving me feeling like I had misstepped.  Am I the asshole for telling her that she is not more important than my education or my pet?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA.  I view education the same as I do a job. You wouldn't go hang with a friend instead of going to work, right?? Your education will get you hopefully a job that pays your bills. It's necessary. You've got a busy personal life, you can still have a social life, but not at the expense of your education commitments which are non negotiable. at the end of the day, she's not paying your bills, and she was trying to guilt you by saying you make time for things that are important, and you replied directly to what she said, to the point she raised. Her making out that she's important, you pointing out yes she is, but what is more important/comes first is not being an AH, it's just the truth. Especially not wanting to make commitments when you're unsure of what your load is going to be before then. Anyway, anyone who would rather you jeopardise your job or education over catching up, isn't much of a friend", "Your friend was just acting like a normal person, looking to make plans with a friend, but got shut down pretty hard. I suspect you were feeling a bit stressed about this new chapter and were seeking to manage expectations. Well. Now you won’t have to worry about hanging out with her. Instead you’ll make new friends in grad school to procrastinate with, but you’ll feel better about it since they’re in the same program. The fact is that even in the most demanding of programs everyone will still make time for what they really care about - people always do. \n\nYour delivery was not great, so YTA for that.", "Agreed. OP is not technically wrong but there are tactful ways of saying this without making a good friend feel like sh*t. You don't literally say \"you're not important right now\". NAH indeed.", "Nah, fuck that. OP clearly stated the much more tactful \"I'm not comfortable making plans that extend to when Grad School starts.\" and was met with their friend saying \"We make time for the things that are important to us.\" They had to be blunter.", ">telling your friend that she’s less important,\n\nHe didn't. \nHe said 'not more important than'.", "Assuming OP is reporting accurately, they didn't say the friend was not important, only that they have responsibilities that are more important.", "So the next reply is “Yeah and I’m not gonna make time for you” ? Because that’s pretty much what OP said. They listed all the stuff that comes ahead of their friend when she could’ve said “I’ll try my best, but I can’t promise anything.”", "NTA, you have your own life and responsibilities, also it's your future in game here, If she's a good friend she's going understand that it's an important thing for you and support you\n\nI don't think you was rude by being honest, but maybe talk with her and ask why she did get angry at you, explain your pov as well and that she need understand that while your friendship is important, you and her need know the boundaries, because a friendship is based in respect just like any other relationship\n\nShe need understand that sometimes you'll prioritize other things that not your time with her", "NTA.\n\nI do think you are being reasonable about trying to ensure you can honor commitments you have and not wanting to over extend yourself. Grad school can be really demanding and it is wise to at least give yourself some time to adjust before committing to other things.\n\nBut, consider, depending on how close this friend is to you and how important their relationship is, that if they are feeling insecure about losing you, that perhaps some reassurance from you that they are still important to you would be a nice thing to offer.\n\nLook, their mental health isn’t on you BUT they are a friend so just a thought.\n\nYes we make time for the things that are important. However, our resources and time are finite. Meaning sometimes we have more things we care about in our lives than we can manage at the same time and so… we make trade offs. We do what we can for what is important at the time it is important and then, hopefully, we make room to enjoy and honor those things we didn’t have time for eventually.", "NTA. You were upfront about your concerns with your upcoming schedule and workload. Her saying that you make time for what's important was really not a nice or direct way of saying that OP's education and other life stuff are not. I have friends I don't see in six months. It's chill.", "NTA. \n\n>>…we make time for what is important. \n\nAre we talking scheduling a dinner date, an all day trip back to the home town to visit the friend, an entire weekend away with friend? \n\nI think OP is taking the responsible approach to their program. They need to know the syllabus schedule of the grad program classes for the semester before committing to anything.  Committing and cancelling later is worse than not committing at all.  \n\nIf OP and friend are both local, then getting together will be much easier. Everyone has to eat. Grab a meal together. It doesn’t have to be an all evening event. Let it be just dinner and a quick chat. If it’s done often enough, it feels like normal catching up. Meeting up for lunch near campus works or grab some takeout and have a lunch picnic. It doesn’t have to be drawn out to interfere with OP’s schedule. \n\nOP probably needed to take a softer approach to the phrasing. The content was accurate, though.", "NTA.... you have yourself together... working school health your pet is more important", "You are NTA. I've been placed in this same situation and honestly you are 100% valid for creating boundaries that you are comfortable with especially since you have no idea what to expect initially. Your friend is in the wrong for trying to pin you right of the bat of a major and difficult life event.", "You acknowledged to her that you were going to be busy and she does not have the same respect for your priorities. \nI’m graduating with my Masters right now, I completely understand. I always tried to make time for the people important to me but my family was always more important than my friends and other relationships, which caused some relationships to suffer in this time. Other people understood. Some just truly did not grasp how busy I was, even with trying my best. It was never ever enough. For some people, your best will never be enough. \n\nNTA.", "NTA, leaning towards NAH. I can understand that she is frustrated as well.\n\nI am in your situation kinda. Very busy with school and unexpected extra days, or people messaging me on my free days, plus health problems (extremely tired for no known reason). It sucks, but you can't make time if you don't have it, or do activities if you don't have the energy to do it. Education is extremely important, and your social life can hit an all-time low because of that. But this is a temporary situation that is extremely important for you future", "NTA. However I don't agree with \"we make time for what is important\" even the slightest. This comes from a privileged point of view. Your 24 hours and her 24 hours are different, because you both have different things to do and have differently abled body. If she can't accept it, that's on her. Not on you.", "#NTA\n\nThere will situations in your friend's existence where you can't be prioritized, so why does she take offense to the notion that she won't be prioritized all the time?", "NTA \n\nAs adults we have priorities. Which often, do have to come before friendships. You need a new friend.", "NTA. Your wording isn't great, but the message you were trying to send is true. Right now you have other responsibilities that are limiting your free time, and as a result it is hard to commit to spending time with her. You don't suddenly hate her,  and a good friend would understand that having less free time for friends is simply a part of a lot of people's adult lives, particularly if they know about your health issues. If you want to make amends you could still apologise for what you said, or at least how you said it, but I think it is possibly your friend is upset not just because of this conversation. Logically they might understand why you aren't always available to hang out, but it is possible she was already upset about something else when you told her you weren't free. Either way I'd say give her a while to hopefully cool down and then talk with her about it.", "NTA", "NTA. You want to keep the first little while you're in school open so you can adjust to it and see what your time commitments are. She should respect that.", "Interesting. Personally I have never had a friendship where, if my friend said something like this, I would have been offended. I have some really good friends that I care about, but I don't expect to be as important to them as their health or education or career or their adult responsibilities - so I think you're NTA.", "NTA. You were clear with her. Her inability to accept this is her own fault", "INFO - was there some event that your friend wanted you to commit to?", "NTA. Stupid people require stupid responses.", "I don’t think you did anything wrong. It sounds like your friend is not supporting your choice to go to grad school and is using your friendship to guilt trip you. \nI don’t know what some people read, but I didn’t see your response to her as anything but honest. You are expressing anxiety about how your life is about to change and trying to prepare for it. I don’t have a friend who would choose to question my choice of education and career path. Aren’t our loved ones supposed to be cheering for us? \nIt sounds like she is worried that you will move on with new friends and a the kind of career that she has no access to. Whether it’s jealousy or fear of abandonment, something is going on with her, and that is what you both need to address. Maybe she needs a little reassurance that once you feel comfortable with the new schedule, you can find little opportunities to hang out and start to plan things.  Wouldn’t it be great if she learned to be supportive and not focused on the negative things that may or may not happen?\nHang in there, OP. NTA", "NTA. I’ve been in both friend’s position and OPs position. Friend has blatantly stated she doesn’t care about OPs path in the past. I think OP either needs to re-evaluate the friendship or work on more creative ways to stay in contact, but the older we get the less time we have for friends unless there are special circumstances and that’s a natural way of growing up. We do make time for what’s important, and sometimes even our best friends have to take second or third place. Seen it with besties growing up and having kids, seen it with besties having mental health crisis, but we’re all still besties at the end of the day because we understand there are only so many hours in the day.", "NTA.\n\nTo all the people here saying NAH and lecturing OP about grace... come on, they are setting boundaries and have to repeatedly defend themselves from their friends pushiness and basically insults in regards to OPs life choices.", "Nta. You were a bit blunt. Perhaps you can apologize for how you said it, but not what you said. \nI hope you can remain friends, but this might mean the friendship has ran its course.", "NTA. Grad school is time consuming and expensive. Grad school can land you better jobs. I assume your friend isn’t willing to pay your way in life if you fail grad school. It’s called being a responsible adult and sometimes that means making sacrifices.", "I'm guessing you just finished college... Your friend sounds like someone who hasn't lived adult life because everything you said is 100% true. \n\nI understand your friend wants to spend time with you but tbh your friend is being selfish by not realizing you clearly are under some stress and only worrying about how you're going to make time for her when she should be supportive of you pursuing your dreams. \n\nIf she's a real one she'll realize this at some point. NTA", ">In addition, I have a pet who will need caring for and I have chronic health issues that require doctor appointments.\n\nAnd here's where you cross over from reasonable to clearly just coming up with excuses. Just be honest and tell this woman you don't value her friendship because you're too prestigious, or whatever.", "Well you just told your friend that she is unimportant. However your friend should not have pressed you in the first place. So I guess NTA? Maybe work on your delivery.", "NTA Your future can be dramatically improved by your plan being a success. It's a shame she doesn't see it that way, and therefore it's understandable that she's annoyed you might have less time to spend with her. It's a bit silly, as she ought to be supportive, but that's a small thing really. It probably stings to be told that she's less important than your plan in actual words, as it's already obvious. I think beint so blunt about it is your only mistake, and it's a social faux pas rather than anything serious. Most of the bad behaviour seems to be on her part, some people are a bit self-centred and others can be a bit sceptical of higher education for all sorts of reasons, but ultimately she should be supportive of your desire to do this course. Once she realises you've not ditched her, she'll come around even if she won't necessarily support you. That is, if you actually want  to keep her as a friend.", "You're NTA, but there are also ways to better communicate. I agree that your personal life, education and responsibilities should always take priority. However, maybe expressing those levels of importance to your friend, when she's reaching out because she cares about you and wants to spend time with you might sound hurtful. \n\nMaybe you should talk to her and express your concerns at a time when you are both open to hear each other out.", "NTA. I can only wish I was able to put down firm boundaries like you. I'm a doormat and I got stepped all over when I was trying to make time for my school. You seem to have no problem thinking of yourself first and making others respect you so that's really useful for you.", "Nta. You didn't say anything wrong. She's the one who has the issue with the fact that you have responsibilities. Not your fault 💜", "NTA, this is delusional", "NTA, though you could have been more tactful. Regardless, you’re going to want and need a good support system when you’re in grad school. Prepping for grad school should include strengthening bonds with your friends and family, not burning bridges.", "Sometimes it’s not what you say, it’s how you say it.", "INFO: what was the context in which you declined plans? Was friend inviting you on a week-long vacation? Was she trying to make a plan for a dinner in June?\n\nI feel like, if the latter, you just might be the asshole, guilty of a thing I like to call \"time hoarding,\" which is when people are nebulously anxious about something impending and cope by arbitrarily walling themselves off and building a fortress around their calendar. \n\nIt sounds like you operated from an assumption that she would poo poo your new grad school because of things she said in the past and were preemptively defensive beyond what the situation called for, and as such, you hurt her feelings. Your friend was asking to see you and connect with you. You basically told her she's like, 23rd on your list, and tough nuggies, when you could have said, \"Yes, lets definitely get together in June! I need to see how my school stuff shakes out because I'm feeling pretty anxious about juggling it all. Can we check in once about this once school starts?\"", "You are technically right about your schooling being important but now she knows where she ranks in your list of priorities - which is very low.\n\nAlso, ngl, this sounds a bit like a cop-out. You could've just said \"hey, let me give you a tentative 'yes' but please be aware I'm going to have to settle into my program first and if it gets to hectic, I might have to cancel\".\n\nYou could've shown her you still want to hang out, you appreciate her and her time. But the way ou handled it, it may just have cost you a friendship.\n\nBTW, this has nothing to do with her \"valuind education less\". She just wants to spend time with a friend and as you are clearly important to her, she thought she was just as important to you. She was proven wrong.\n\nYTA.", "NAH. Some people can handle the truth, some can’t. That said, just acknowledging what she said, without committing to anything, would have been the tactful way to go.", "NTA\n\nYou're putting yourself first and you weren't rude about it. Her comment about \"we make time for what is important\" was kind of inconsiderate. Yes friendships are important, and we have to respect our friends if we want to keep them... but they're not a priority, EVER. If you gotta drop plans in order to better yourself then do it. If they're real friends they will understand where you're coming from, if not... well, you're better off without them. This doesn't mean you love your friends any less or are mean to them or are being malignantly selfish, either; life just changes and sometimes goals don't align anymore and plans are put on hold. I'm sure that if it was the other way around she would do the same as you and not bat and eyelash.\n\nPutting yourself first and foremost is one of the healthiest things you can do, specially if you're chronically ill. Abled and healthy people don't get it till they have to fight off an illness or disease.", "NTA but it sounds like there maybe was a better way you could have handled things. Straight honesty doesn't always go down well.\n\nPerhaps you can make plans that are closer to home and don't require days of absence?\n\nWhat you may also find happening is a sway towards the extreme of work, studying, responsibilities etc, then a shift back towards balance. But it's very much about finding that balance. That being said, work I feel is definitely easier to manage than the pressures of studying. \n\nI guess, last of all: as someone who struggles to have relationships, don't take the relationships you have for granted. Maybe you make friends easier than I but at the very least it's important to see, and respect the friends you have.", "NTA. Your friend is jealous.", "YTA\n\nIt's completely fine and fair to prioritize education and health before other things, there were however many ways to say that that didn't involve telling your friend they are not as important. You can say you'll be busy without sounding like an asshole, which in my opinion you were.", "Ummmm\n\nI’d be hurt by the pet remark. My dogs saved my life but I’d still spend time with a friend over keeping them company. \n\nOk as I wrote that out I realized I would pick my dogs. \n\nNta", "NTA but rude af", "YTA.  That was just terribly worded.  There was no reason to mention her importance, especially saying she isn't as important as whatever.  Regardless of whether it is true.\n\nYou should have just said \"sorry, I just can't schedule anything far out due to work and school\".", "'Technically' you are correct and you are not the AH for prioritising those things but YTA because your response was tactless - you need to learn that you never, ever compare the importance of a relationship to anything. These things are unwritten rules. You should have said something like 'When I start my new course I'll need to take some time to focus on settling in before I can work out my new routine, but as soon as I know what's going on let's make plans!'. Instead you basically told her to know her place. You don't say that to friends!", "Uh. Are you dating her or engaged? Are you friendzoned? Why does she think she has such control of this?\n\nMaybe you could have been more tactful, but NTA", "This is probably one of those it's not what you say it's how you say it things. Your education should be the number one thing it sounds like for the next year or two. That being said if worded properly might not have caused any feelings of misstep. NTA", "NAH\n\nI was in a similar situation years ago with my friend who was doing her postgrad, working full time, had health issues and a sick pet. She’d been complaining about not getting exercise and eating well etc… and she’d nearly had a nervous breakdown during her degree. I suggested that maybe on Sundays she came round my house and I would make brunch and we could go for a walk (thinking it would clear off some of her struggles as I could also give her a few reheat meals on Sunday for the week). She (through stress) went on on me about how I was trying to put myself above her responsibilities and her Uni course etc… was more important. \nI also stepped away so that we didn’t argue and when I was calm I just explained I was concerned about her and had offered to help. If she needed help in a different way, then I would support her. We are still friends now years later. \nI would speak to your friend and communicate your frustrations. If she is genuinely your friend, she will understand. \n\nGood luck with your studies.", "On the one hand, I can agree that you could’ve worded that differently, but on the other hand you did let her know where she stands which I don’t believe is an asshole thing to do with anyone.", "NTA But you’re not entirely correct. Education is important. But friends and family can’t ever be replaced. I can say with confidence that there are very few lifelong friends in my life, but those friends have seen me through the best, and worst parts of my life. My education, my job, all the money in the world. None of those would have saved me from almost taking my life. My friends did that, in the worst of the pandemic, they stepped up, they were there. The degree on the wall, it didn’t do shit! Life May look long to you now, and the future full of possibility, and that’s all true. The future is in your hands. But all that education, and the six figure job still doesn’t make people happy. Friends and family, at the pub on a rainy Wednesday night in the middle of a shitty week when nothing seems to be going right. The Friends that make you laugh, or cry with you, or show up with pizza when you’re on your 36 of your shift at the hospital and the food sucks there. Yeah they matter. Make time for friends, you never know when you’ll need them more than anything else.", "INFO: how extensive were these plans that she was wanting to make with you?\n\nBecause there’s “I’m not going to have time to go away for the weekend/out for the whole day,” and there’s “IDK if I’ll have time for a weekly lunch any more,” and if you’re talking the latter then it does seem problematic that you would be writing it off without trying. But if it’s a big time commitment then sure, she’s AHish for even pushing when you said no.\n\nIn your response to the automod you said that you’d be there for her in emergencies but wouldn’t want to “hang out”. That’s pretty bad TBH, unless she only wants long hangouts. It’s important to be careful with your time, but what you’re telling her is that you don’t see her friendship and company as part of your work-life balance. Don’t let grad school eat your life; it doesn’t have to.", "NTA *mostly*. Education is important. Speaking to your friend in a more diplomatic fashion would have been better, something like, \"It wouldn't be fair to you if I have to cancel plans because an important paper/project is due for a grad school class.\" I do think your friend should be more important than your pet though. I believe people are more important than animals.", "Some of these people on Reddit lack social awareness and the skills to properly communicate with others. It is OKAY to be vague with answers to comfort your friends. It is fine to say \"We'll see, I can't promise yet but you're very important!\" or \"sure! just doesn't want to make plans for now so I know what my schedule is like\". So many ways to answer this other than \"uhm other stuff in my life is more important\" yeah sure the friend is aware that your health comes first but doesn't need to hear it. I am still going for NAH because you thought honesty is the best but it really isn't if you want to keep your friends.", "YTA and you are wrong. Friends are AS important as education. The feeling you \"can just make more\" will be tested in graduate school, and you should not be an asshole that will help you keep balance in your life. \n\nYWBTA if your response to knowing frad school is hard on friendships is to lean into it. The worst part of all of this is, YTA a little, right now, to your friend. YWBTA way more, to yourself, in the future if you don't dig your head out of wherever you put it. \n\nPS. Sounds like she'd be a good workout buddy because you'll have less time for that (also good for you) thing as well. \n\nAlso. I can't help but wonder if she has any points. You wouldn't be her friend if she didn't have some brains or know some things. I can't help but wonder if you have chronic health problems and are trying to solve an unfortunate bachelors with an unfortunate masters, which I see way way more than I wish I did. This person is trying to care about you. At least it sounds like you'll be working during your degree, which is better than the unpaid bullshit that comes with so many masters.", "NAH, you have important stuff to do which will be more important then her. But she can feel hurt about this.\nBecause who wouldnt be hurt if your friend tells you that you are not as important as the other things in your life? Give her a few days to calm down and everything will be resolved.", "INFO. I’m getting vibes that the real issue here might be that friend has grown weary of OP constantly talking about her grad program, perhaps a bit braggadociously. Friend may feel a bit of snobbery directed her way. The op choosing to describe  program as “prestigious”, for instance. Sounds braggy, and if the OP really is worried about balancíng her program demands with friend’s quality time expectations, you’d think an adjective like “intensive” would have come more readily to mind. There’s also the friend’s comments about privilege and questioning the ROI of the program, maybe she’s tired of it being rubbed in her face that the OP got into this “prestigious” program, and also she could suspect it’s a degree OP is going for to feed her ego that won’t necessarily translate into more opportunities or money in the job market. There are a lot of expensive vanity masters programs out there now. It’s also very possible the friend threw out a comment like “hey, wouldn’t it be fun to spend Labor Day at the beach this year?” and OP used that as an opportunity to say “oh, I don’t know, you know that’s right about the time I’ll be starting my masters program, and I’ll just be so busy” for the umpteenth time and it’s grating on friend’s nerves. And the reminder that you have a pet to take care of, like it makes you equivalent to a working mother or something. \n\nOP, everyone gets it, you’re proud you got into this program and are excited about starting it. You probably don’t need to bring it up every time you talk to your friend. And you will have time for a social life. I managed to get an engineering masters in two years, nights, while working full time, often having to travel to do field work, often pulling 60 hour work weeks, and I still went out with my friends most weekend nights, and had an intense romantic relationship with heartbreak and everything during the program.", "NAH - She can feel that the two of you are currently drifting apart and is trying to force you both to stay close. Except she doesn't want the life you're living and so it is hard for her to put the same importance on your life choices compared to her own. There is no \"correct\" choice. You need to live your life and she needs to live her life. Don't drop her, but don't back down on your life choices either. It is up to her on whether she is fine still being friends in a more low contact relationship.", "NAH. You both said honest things without any tact and both hurt each other. But don't be surprised if she takes a big step back from the friendship. I had a close friend who got busy and point blank period told me she didn't have room for friends in her life. I said okay. Then a few months later she messaged me upset that I didn't reach out and check up on her, like a friend would. You can't say in one breath you're too busy to have friends and in the next complain that these friends you don't have time for no longer go out of their way to be there for you.\n\nThere were a thousand different ways this conversation could've been handled by both sides but I feel like the friendship is probably on its last legs if there's any legs left. I think this is just the case of adults drifting apart. But I will say that if you wanted to keep her in your life you shouldn't have said literally everything else in your life is more important than her. But if you both decide to stop talking, once grad school is over, it'll be very hard to reignite a friendship that was dropped. So I'd just say to let this friendship go and live your life with your other responsibilities just as your friend will be too.", "Friend or girlfriend?", "YTA because you said falsehoods. \"that's fine. Different strokes for different folks.\" But your words about your friend make me think you're irritated by her. Maybe you feel like she needs taking down a peg?\n\nNTA because you **are** making time for what is important. And that is how you should express it to her. \"These things are important to me.\" You don't need to say she's not as important. You can say \"You are a functioning adult and can take care of yourself. You don't need me. I need to do these things because they are important for my future.\"", "Yeah, you sound like the asshole to me.", "NTA for being responsible.  \nYTA for being insensitive cause your friend feels they're losing you", "NTA. Regardless of your reasons why people will eventually get busy and neglect other people. It happens. However she gets a slight TA because she's not seeing it from your perspective.\n\nPlus both of you are walking different paths anyway. You are going to be very busy and it's easier to just expect you will be too busy before making plans. That is something that your friend needs to understand.\n\nIt has nothing to do with making time for what's important. And frankly I hate it when people say stuff like that especially in your case. If anything your friend should recognize you are very busy and try and work with that. Not just assume you will devote whatever free time you have to what she wants.\n\nFree time does not equal available time. Just because I say I'm not doing anything after work doesn't mean I want to do anything after work. Perhaps I just want to stay home with my girlfriend and watch something. Or maybe I want to play my video games. Perhaps I literally want to do nothing and just sit and relax.", "Unfortunately these tensions emerge as our paths diverge from those we were once close to. NTA", "NTA you did try to say it the tactful way initially and you got hit back with emotional manipulation and boundary pushing, its completely reasonable you said it a little less tactfully after that and no it was not brutally honest or mean etc it sas clear and direct\n\nLots of people dont understand the difference between being rude/mean and direct/straight forward", "Sounds like she's getting pissy about hypothetical plans MONTHS away. Of course you're not going to buy tickets when you don't know what your schedule will be like. I was sympathetic to her side until I realized you have time *now* presumably to hang out and she's being guilt trippy about future hypotheticals. You weren't even saying plans couldn't happen, you just don't want to make them now. Nta.", ">but not more important than school, paying my bills, and managing my responsibilities (pet, health, home).\n\nAll of that is *your life*. No, she is not more important than the aggregate of your life is to you. NTA That she thinks she should be for what ever reason (different view on education, not having a worthwhile life herself), and that she is blaming you for pointing out the obvious I do think makes her an AH", "ESH\n\nBoth of you need to work on communicating like adults. It is possible to communicate honestly without being judgmental (her) or dismissive (you).", "NTA. However, you should be clarifying to her what exactly this means. There’s a difference between “you’re not as important as my education,” and “spending as much time together as we have isn’t as important to me right now as my education.”", "She's eight tou mskw time for what is important to you and right now your education and future is important and rightly so. Your friend should be supportive. She's being selfish. Good luck and remember to rest and nourish your body while studying ❤️ NTA", "Actually op was truthful. Doesn't know now how the schedule will look and prefers to wait until the schedule is known before making plans instead of making plans now and cancel later.\n\nIt's reasonable the friend isn't by not accepting the answer. NTA", "NTA. I straight up told my partner damn near the same thing before my intensive, three year grad program started. I also have chronic health problems. I told partner, I would be making no large plans for the foreseeable future, and that my school, health, and family were my first priorities (we were not in a long term relationship, otherwise maybe I’d have placed more importance on my relationship). \n\nI knew how much time I would be spending at school (40 hours outside class per week for year one students is expected and jumps to 60 year two). \n\nBeing truthful isn’t always being the A H. \n\nOP let their friend know they couldn’t make plans that far ahead. Because it’s the truth. Many grad programs are exhausting and time consuming. I had no social life for three years. I don’t even remember seeing my best friend. And those were the last three years they were here before going into the military (thankfully they’re back now). \n\nOP isn’t the A H because they were upfront about changing life circumstances. OP’s friend is acting like a child by not accepting that people go through major life changes and that adults can’t always make plans 6 months in advance. Especially in the midst of a a grad program.", "Not having time is legitimate . But hurting someone's feelings that way just because they want to spend some time with you, or worry about losing you, is never a good thing. Not having time is one thing, telling someone they are not important is not something you do to a \"friend.\" Saying \"I hope I will be able to make it\" is much more thoughtful. \n\nThe friend was probably worried she will lose OP. OP was probably pissed the friend wasn't appreciating the things they value, and they retaliated for the friends' comments on education without realising. I don't believe OP doesn't understand the line they chose to use came off as incredibly harsh.", "Yes. Nobody is properly at fault, but the communication could have been better on both sides.", "Instead the friend run over op s decision/boundaries to get a commitment she wanted", "An apology for her wording is in order, but not for OP’s life choices. Her friend needs to come to grips with this.", "I actually think the friend is TA here.\n\nOP was honest and straightforward.  It would have been wrong to lie in this situation since the friend might try to make plans that OP might need to reject over and over again.  Being honest now (even brutally honest) about time commitments is best for everyone.  Full stop.\n\nThe friend did not accept OP's decision.  I believe a true friend should be supportive in this situation even if it means spending less time together.  The friend placing her own issues over OP's education is the definition of selfishness.", "OP says that friend simply doesn’t rate education as highly as they do. While I agree that secondary education is a “stage of life”, I hesitate to group it that way in this particular situation. \n\nThey could be in equal/equivalent stages of taking their futures seriously, except that friend’s job/career path is more focused on upwards movement after gaining employment and experience rather than education itself.\n\nIn the way that I feel you used the term, OP is the only one taking their future seriously and friend just wants to chill/party/travel/whatever. I just don’t see that detail being supported *or* denied so I dismissed it because that’s just guesswork.", "I agree. I think those voting NAH and YTA don't understand what it's like to have chronic health problems. They're not always predictable, and they can take over your life on their own. Add grad school to the mix and forget it.\n\nThis started when OP's friend refused to take no for an answer in regards to making plans. That is selfish and pushy. An understanding friend would be willing to wait and let OP set her schedule once she starts grad school. \n\nI know this first hand. I went through law school with a chronic issue. My friends wished me luck and made no demands. It's been 20 years and they're still close friends. \n\nOP, congratulations on getting into a prestigious program. I hope you have other friends who are supportive of you and I wish you luck. I hope it's the start of an amazing journey.", "That’s what I was thinking - if OP’s noticed their difference in approaches in education, so her’s friend. OP may have unintentionally struck a nerve with her", "But the friend’s remark about ‘we make time for what’s important’ was completely unnecessary and a means to guilt trip OP into feeling bad. This was also *after* OP very graciously said she’s not comfortable making plans before starting the program. \nSure, OP could have phrased it differently, but to me it seems like the friend feels somewhat entitled by unreasonably expecting to be put above OP’s well-being and education.", "The alternative would have been to lie to the friend.\n\nOP is NTA for being honest (even brutally honest) with a friend.  What if the friend tried to make plans and OP had to reject over and over?  Being honest and blunt is the best decision for everyone.\n\nThe friend is TA for not supporting OP.  Putting her own needs over OP's education is selfish.", "I mean if you’re lonely we can talk about how to fix that, but telling me “you make time for what’s important” is a bit tone deaf when I just don’t have time. I have time for you now before I go into my grad program. Im going to tell you upfront that I’m not ignoring you, just busy. \nIf you absolutely can’t handle a break from me, then maybe we’re going different places in life. Also the ppl that make a stink about my schedule are least likely to get a call on my free time since I have to start the call with apologizing for how busy I am. That’s just me tho.", "Insanity that the friend isn’t in the wrong in anyway. She’s behaving like a child lmao", "Absolutely not.\n\nOP was honest.  That was the correct approach here.  Otherwise, the friend might try to make plans that OP would need to reject over and over again.\n\nBeing honest (even brutally honest) with a friend about time commitments is always the best policy.\n\nThe friend is TA for not being supportive of OP's education.  The friend is being selfish.", "No, there wasn’t a specific event.  She wants my help in something that, while she states there is no minimum time, it seems like it would be at least a 2-3 hour weekly commitment.", "(I’m speaking from experience. I earned my PhD from an R1 institution in 2021.)", "Wow, you found a brand new way to trash disabled people.", "She was asking for a recurring commitment to help with a project.  She didn’t have specific parameters regarding time commitments, but my sense was that she would be expecting 2-3 hours on a weekly basis.  Of note, this commitment would likely be a social endeavor, and I am an introvert.", ">INFO: what was the context in which you declined plans? Was the friend inviting you on a week-long vacation? Was she trying to make a plan for a dinner in June?\n\nI feel like this is important info. It's one thing if the friend was trying to make plans for a big activity that would take up a significant amount of time or require OP to take time off, and another if she was trying to make plans to, say, see a play that is coming to theatres later this year and will be running for months.", "I agree I think the context of what plans they were trying to make is important!", "You absolutely do when they're pushy and entlited, not establishing boundaries can absolutely make your friendship turn out toxic, the friend was passive agressive and trying guilt trap OP, so OP was blunt and honest 😒 education IS and ALWAYS should be the top priority, friendship is not as important as your future and shouldn't be because friendship will not put food in your table or pay your bills", "Definitely not dating, lol.  Zero interest romantically and she’s in a committed relationship", "That’s a whole lot of assumptions you put out there.\n\nThe friend was also not just acting like a ‘normal person’, she was guilt tripping OP. \nAfter initially saying she wasn’t comfortable making plans before her program starts, the friend says “we make time for what’s important”; a wholly unnecessary and unsupportive comment meant make OP feel bad.", "Bottom? Do you think OP only has 4 things going on in their life?", "It's not a matter of importance, but of responsibility. No matter how you feel or what you believe, keeping an animal that's fully dependent on you -because you chose to- alive and in good condition is a responsibility you can't just ditch just because a human that's not dependent on you needs attention. If the human is dependent on you it's another matter of course.", "In no reality friends are as important as education, Just in books, in real life your education IS YOUR FUTURE\n\nSorry but only kids think this way, OP should phrase better her reason to not spare her time, but in no fuckin way she was wrong for prioritize her education over her friendship, also being a friend is supporting your friend's choices, a thing OP's friend obviously don't seem to do, also being considerate of your friend's time, another thing OP's friend don't do because they believe they're entlited to it", "Solidly friend.  She’s in a committed relationship.", "Dude sounds friendzoned to me.", "That’s what I was thinking - if OP’s noticed their difference in approaches in education, so her’s friend. OP may have unintentionally struck a nerve with her", "OP led with that, then she said\n\n> I said that she’s important, but not more important than school, paying my bills, and managing my responsibilities (pet, health, home).\n\nThat's tone deaf at best, and a straight up insult at worst.  Something like \"it's a lot to balance, but we'll figure something out.\" would have been far more tactful.", "Let's take another scenario where OP says \"There's a lot to handle right now so let me get started with school and I'll see when i can make plans\" \n\nYou see saying that my work, job and bills are more important so therefore i can't make it work sounds more like the friend is not important to even try and consider taking a little hardship just to meet and maintain a friendship. \n\nBut the saying that i can't commit right now but let me check and see once grad school starts so i can meet you sounds like the OP considers the friendship important and even though bills are more important, they will try to make it work. \n\nSo yeah. I'm almost leaning towards a YTA judgement here but NAH probably is the better verdict.", "Truth without kindness is brutality, and kindness without truthfulness is manipulation. There are many ways OP could have said the same thing without their friend feeling like shit. OP really put their foot in their mouth. A little tact goes a long way.", "While yes, OP might be truthful, you do also have to realize that you do need to pay attention to your friendships and personal relationships so that they don't fall. You do have to still cultivate and tend to those relationships similar to like a plant. If you leave a friendship alone long enough without working on it or even acknowledging it, then it is going to shrivel up and die.\nFriends can understand that you're busy, but what friends don't like is hearing that they're not important in your life. There was much definitely a better way that OP could have got about saying this, and they didn't. Well they're not wrong for feeling this way or proceeding through life this way, they were definitely wrong in how they went about saying it, and probably just cost themselves a friendship along the way.", "Being truthful doesn't preclude you from being an asshole. \n\nYou can tell the truth whilst being mindful of someones feelings.", "Sometimes it's not what you say but how you say it. Saying something along the lines of my schedule is going to be really busy lately, I will definitely keep in mind that we should get together sometime if it's possible, is a lot better than saying you're not as important as my other priorities right now, deal with it. OP said the second one, and that's the one that hurts. Saying it the first way allows your friends to realize that yes you do have other things going on in your life right now but you're not forgetting about them. You still recognize that they exist in your life, you recognize that they are still a person of importance in your life, and they see that as well. Straight up telling them that they're not important, or as important as other things, can hurt. Words do hurt people. Were you are allowed to have hurt feelings about something somebody says.", "I disagree.\n\nOP was honest with a friend.\n\nThat friend could not accept the truth.\n\nNTA.", "Completely agree. She doesn’t owe her friend her time. That isn’t the basis of healthy friendship. Friends accept that the relationship will ebb and flow and be supportive and happy for each other. To expect a minimum level of commitment is not friendship.", "I understand chronic health problems. My knees dislocate whenever the hell they want to, and I've had chronic back problems for the last decade, sometimes they get so bad I literally cannot get out of bed, and people can see the swelling in my lower back.\n\nAnd even I still think that OP could have found a better way to say this. Sometimes it's not what you say but how you say it.", "The votes were because OP's final statement was straight up rude.  There isn't a chronic health problem in the world that gives you a free pass to be tactless.", "I mean, I can see where the friend is coming from. I’m someone that needs to put things on my calendar or I literally don’t see people. \n\nIt IS true that we make time for what’s important. It was kind of an AH thing to say but so was OPs response.", "Sure but that's not looking at it holistically.  Her friend said that, albeit as a guilt trip, but as a way of asking for validation that she was still important too. You can't expect most humans to react well to be what could be a friendship ending conversation.  Her feelings were hurt too, and for a legitimate reason imo. Especially when she's told she's less important than an animal.", "eh, the alternative wouldve been wording it more kindly. \n\nwhat OP said was objectively true, but there were kinder ways to phrase it since its clear they just view priorities differently. \n\nOP couldve said “you are important to me, and i absolutely will make time for you, i just genuinely dont know what my schedule will look like so its very hard to plan right now. as soon as i know though we can start planning”\n\nnow, i still dont think OP is TA for their wording. it wasnt the kindest, but she wasnt outright rude or anything, but the best alternative wouldve been a gentler approach.", "I can see that and the friend was a bit tone deaf, I can definitely see that. Friend should’ve said something like “But we’ll still try to talk right?” Or something but clearly they’re upset at the idea of not seeing OP anymore and OP is stressed about the coming months. The only reason I went y t a and not n a h is because while the friend was pushy, OP straight up said “this is where you sit on my priority list” and I think that would hurt a lot more than the friend’s comment", "So she had to lay out specifically where her friend sat in the pecking order here?  There's blunt and then there's just straight up insulting.  OP's comment was way over the line, intentional or not.", "Still NTA. \n\nShe pushed you and tried to manipulate you after you gave a very tactful answer. You set your boundaries in a firmer way afterwards. I suggest you find a new friend that actually respects your boundaries and priorities. And good luck with grad school!", "You are being a bit too harsh on this friend I feel. Obviously she cares about seeing her friend, like friends do. You are using words like toxic and passive aggressive but without enough evidence to justify their usage IMHO. \n\nI get the impression see things in a very black and white way. Like the OP, you are technically correct but as you get older you'll see that actually, it's not the things you do that you'll rememeber most but WHO you spend time with that matters in life. I'm not saying education isn't extremely important, but balance in life and tact in communications go a long way to a smooth and happy life.", "One of those 4 things was actually 3 things, so I think that technically makes her 7th after Fido, cleaning her apartment, and doctor's appointments that apparently happen on the weekend now.\n\nI get that OP doesn't know her school schedule yet, but she can't pencil in a lunch, dinner, or happy hour at some future date?  Come on.", "Hanging out with a friend for a couple hours isn't going to endanger the pet.", "Not a dude :)", "^^^^^ THIS!!! OP was honest about it, not mean. In fact, OP was as honest about it as she could have been, without being mean. Not OP's fault that the friend - like far too many people these days can't tell the difference.", "There's no denying that, you just have to have some tact about these things. OP isn't an AH for what they said but they could have said it a nicer way.", "Depending on context, that might be the same. INFO What were the plans they were discussing about? If the friend wanted OP to commit to a 3-times-a week pottery class or a 10-day trip in the autumn, then yes, the OP is right to wait to see how her schedule looks after she starts grad-school and the friend is being unreasonable. But if the OP is refusing to agree to even buying tickets for a local show or promising to come to the friend's birthday party, then she is essentially saying the friend isn't important to her. No one is expected to sacrifice their education, their future and their financial safety for their friends, but you are expected to make and effort and inconvenience yourself once in a while.", "Agree that OP needed to let friend know they don’t have the same priorities. \n\nIMO opinion OP handled it correctly as the other way would be they accept every invite from friend and then cancels on majority of plans when close to the date. \n\nAnother possible option is friend is told likely not but they agree to touch base closer to date to see if still no or they can verify can do whatever.  Won’t work on all things requiring scheduling weeks or months in advance but for other more flexible plans could be an option.", "I’d say the same about the friend’s guilt-tripping “we make time for what’s important”-comment after OP said - very reasonably- that she wasn’t comfortable making plans before she’s started the program. Instead of making OP feel like a lousy friend by slightly backing her into a corner, she should’ve been supportive of OP in her endeavours and be happy for her. \nI’d go as far as to say the friend is being a bit of a selfish A H by expecting priority over OP’s own health, home and investment in her own future.\n\nNTA.", "Agree with it would be more tactful but being caught by surprise you can't always be on your feet and react tactfully. \n\nThe friend pushed this when op made it clear she is open to meet just doesn't want to commit now and have to cancel later which is respectful of both the friend s feelings and time . Instead the friend run over op s decision/boundaries to get a commitment she wanted", "But OP tried to gift a soft answer, and then even you said the friend \"bulldozed reasonable boundaries.\"  If the friend is so pushy, maybe they needed a blunt answer.", "Right, OP is fine to prioritise whatever she wants, but personally I wouldn’t be friends with someone who was like this. Firstly being so blunt as to say ‘you’re not as important as my responsibilities’, but also because they seem like someone who doesn’t make time for fun in life. Sure a Masters degree will be tough, I’ve done one and it was very stressful. But I always made sure to fit in time to have a laugh with my friends. I can’t imagine being friends with someone who is just like ‘I am going to work and maintain my house and my other adult stuff and that’s all I can foresee for me.’ OP is within their right to do that, but the friend is also within their right to take offence at that and no longer entertain that person", "Sorry, but actually anything relationed with OP's future IS more important than their friendship and people need understand this fact when they reach adulthood, it's not as if we can be forever kids where we don't Care about anything else than friends and Summer crushes, while maybe the phrasing was too cold, the fact is that the friend was inconsiderate as well and thought she's more important than OP's LITERAL education, in no reality it's true\n\nBills, education, work, etc is actually more important, no one survive in this world with the Power of Friendship 😮‍💨 we need an equilibrium in relationships, and said equilibrium is establishing boundaries when people believe they're entlited to monopolize our time", "Why is kindness without truthfulness manipulation? What if you feel like it’s not your place to be brutally honest, for example?", "Also I didn’t see what kind of plans OP’s friend was suggesting. I’m chronically ill and honestly yes, it’s really fucking hard balancing that with day to day ‘adulting’ for lack of a better word. \n\nI often had to cancel ‘fun stuff’ and some friends noticed and asked if anything would help like coming to mine, getting me an Uber and I said ‘annoyingly no because I am just not well enough after doing the stuff you have to do like laundry and cleaning to be out in the world.’ So my friend would come over an hour early while I got ready and clean. That way I could do both.\n\nEducation is important. Pets are important to some people. But neither are going to rock up to the ER at 3am in a medical crisis or bring groceries or meds when you are sick as shit all the time. Good friendship often helps you if you are chronically ill to balance up the other stuff.\n\nYou know how people are at sea when they have a baby and feel like their friends disappear or don’t get it? Some of it is that when people know they are ill or pregnant or TTC, they step back a bit on friendships like getting cheaper insurance when broke. Then the big thing happens you and realise why sometimes small investments are worth their weight in gold.\n\nChronic illness will isolate you anyway. In my experience unless the person is actively problematic, do not burn friendship bridges when you are chronically ill. Buy them a small gift like a card and say ‘sorry I can’t make plans right now but I miss you and looking forward to thing when my calendar is clear.’ I had a friend write a bunch of cards like this when her brother was dying and she was absent for all the big friendship things. She meant it too. It was as much her goal as a calculation.\n\nAnd you know what? She was incredibly supported when he passed and then when shortly after she had a baby. Because she triaged and showed effort. Banking it til later is how healthy adult friendships work. So it is probably NAH but short sighted AF because the only thing more time consuming than old friendships is making new ones….", "Agree with caring for friendships 100%. But the second part only if op would have said this completely unprompted. \n\nIf you are this insecure about the friendship you need to force someone to say what you want to hear after they asked you to wait so they can get a grasp on their schedule then YOU are the one with the problem. \n\nI have the feeling most people here ignore the years of friendship that have been ok and the fact op didn't just say this cause they were in the mood -im that case yeah it would be both hurtful and insulting and would deserve cutting the friendship but op was pushed to this by the friend. \n\nNot ok to ignore someone else's (even not friends) boundaries Just because you want to.", "OP was, tho. The friend was inconsiderate and pushed OP with her \"we make time for what’s important\".", "Yes exactly! And I was in a similar boat where one of my friends went to grad school and I never saw her. I knew she was busy, I missed her but I didn’t press the issue. But if she had said “seeing you isn’t a priority to me.”? I would have phased out of that friendship so fast.", "Man, if we are completely honest with our friends we won't have any! \n\n\"Want to grab a coffee?\" \"No, lounging in my pajamas and scrolling sounds better than seeing you, thanks.\" I am never calling that friend again. \n\n\"Want to grab a coffee?\" \"I would love it but work is hectic right now, let's arrange it for next week\" - nobody's hurt, nobody does something they don't want to do either.\n\nI will never get the \"i was incredibly rude to X and they went NC, AITA?\" We invented politeness for a reason.", "\"you're just not high enough on my pecking order to make you a priority\".  Real good friend stuff right there.", "No they accepted the truth. But just because you accept the truth doesn't mean that you're happy about it. That doesn't mean that you agree with it.\nThere was definitely a better way that Opie could have gone about addressing this, by saying something along the lines of \"hey with school coming up and everything else in my life I'm going to be a bit busy but I will definitely try and make sure that we have time to fit something in\", or something like that. Straight up saying you're not as important to me as this other stuff in my life, is a tactless and heartless way to say this. Sometimes it's not what you say, but how you say it. And if you say something wrong, and someone takes it the wrong way, then you are partially at fault. Because you do have to watch how you talk to people as well as what you say to them.", "(before people read this, I'll just say I think OP is NTA here, I'll explain why in a second but I'm first just addressing the commenter above me. This doesn't apply to Op) \n\nI very much disagree on that final point. Relationships are effort, if you want to keep them you have to put in that effort. That effort can be a small amount, but if neither put in any effort ever to see each other or chat then your not friends. You don't \"owe\" your friend anything, but if your not committed to maintain a relationship in some form their not a friend anymore. \n\nHowever in Op's case a good friend would be committed to wait it out. It's clear Op's life is really busy and it's the honest truth that that friend is not the priority. I do think Op was harsh in how it was said, but sometimes that needs to be said. But on the same hand, I get why Op's friend might be upset. It's rough to hear. As long as they don't respond aggressively later on or anything I'd say NAH. \n\nThis subs whole attitude of \"you owe no one anything and anyone who asks anything of you ever is abusive\" is so toxic. Like, bro, you live in a society. If you want friends and family you actually gotta participate in being a friend or family member. It's the most online thing ever. Yes, if you like your friends normal people do actually expect you to spend time with them to keep them as a friend. That's not unhealthy to ask.", "Sure he could have negotiated it better. But OP was put in a position a friend should never put you in. \n\nI had a friend in a near identical situation to OP and I was on the other side. He had priorities that had to take charge for the time being. So I just made sure when the opportunity came, however few they were, that we got to hang out. He lives on the other side of the country now because of how much work he put in back then gave him great opportunities he was able to pursue. And I stil consider him one of my best friends and am immensely proud of what he accomplished.", "She did say it nicely and the friend pushed. It's weird of the friend not to get that you may not know your schedule in advance when starting a new program and may need some time to figure out how to juggle everything.", "You think people here on reddit know how to communicate properly in real life...", "I get the feelings, but just feeling lonely doesn’t justify sidestepping boundaries. “I know you’re busy but you’re not too busy for me right?” is what I’m reading and that’s also not the response to learning someone’s new schedule. You care more about my availability to you than you care about my success. Red flag.", "They’re an asshole for holding their education, career and health above meeting up with a friend? Lmao what?", "OP also states that said friend has been  passive aggressively dissing their choice to even pursue higher education.\n\nHanging out with someone who constantly questions your life choices is exhausting, the friend is also pushing herself down the priority list by making themselves insufferable.", "Because if someone told me “these things are more important than you” when I’m trying to make sure we don’t lose touch, I’d be fucking heartbroken. The friend is obviously trying to make sure they don’t lose touch and wants to spend time with them and OP legit said “you come fourth place in my priority list” when it would’ve been just as easy and way nicer to say she’ll try her best", "No, because she can't try her best. Because she made it clear what she's comfortable with and her friend tried to guilt trip her. \"We make time for the things that are important to us.\" is an INSANE thing to say to a friend who has real, life altering shit on the horizon and can't spend as much time with you.", "It just shows that if she's going to make any plans it isn't going to be before she knows if she can participate.  It is normal to schedule time with friends around school rather than scheduling school around friends, but for her to do that she has to assess what her actual workload will look like.", "Demanding transient socialization be prioritized over someone's education and future is insulting.  You shouldn't drag others down to fulfill your own social needs.\n\nIgnorance over how the student life works is no excuse for feeling entitled to that student's time, nor does it make it less offensive.", "Sorry, but that's ridiculous. Telling your friend a planned activity is less important than paying your bills, your education, and your health is not a giant insult. It's a very reasonable priority list.", "Sorry but her friend is not a 5 years old child, I'm 27 and since when I was a kid I did believe that way of thinking, people need know their places in other's routines and being a friend don't make you more important than someone's education, while OP would have phrased better, the message still valid and true, their friendship is in no fuckin way top priority in OP's life and it's a thing her friend need understand\n\nAlso acting entlited to your friend's time and believing you can say shit as \"you should know your priorities\" is a big no in my book, I respect my friends and don't go demanding their attention, specially when I know they're busy, my friendship is not based if my friend is always, 24/7 with me, but in our mutual interests and good moments together, I have not seen my bff in person for 2 years now, neither do talk or text every day and we still bff\n\nAnd balance in life is important, so is boundaries, OP's should talk with her friend and try understand any feeling that had made she act this way, but in no way should she make her friend believe she's as important as anything else in her life, it's blatantly a lie and her friend need grow up", "The friend hanging without your Company will not end the world either", "> OP was as honest about it as he could have been, without being mean.\n\nWhat made you think OP was male? A quick scan of her profile and comments shows she's female.", "I think OP had tact when it was first mentioned and they said they weren't sure they'd have time. It was the friend who brought up \"we make time for what's important\" and pushed the issue. They shouldn't have pushed for an answer and then got mad at the response.", "Don't completely disagree. But the friend also could have not implied that OP's education was less important than whatever plans the friend was wanting to make.", "None of what you listed matters not just because of her schedule, but also because she's chronically ill.\n\nChronically ill people don't get the luxury to plan too far ahead, cancelling plans is very common because of flare ups and crisis. It's more than an inconvenience, you know?", "Sure, which makes this an ESH to me.  Friend is bulldozing reasonable boundaries here and OP doesn't know her workload/schedule until she knows it, but telling the friend exactly where she sits in the pecking order like that is a huge slap in the face.", "\"You're the lowest thing on my priority list\" isn't a blunt answer, it's a friendship ending one.  If that was OP's intent more power to her, but I don't think that was the case given that she's posting on here.", "When you're chronically ill \"time for fun in life\" is something hard to come buy and it's out of our hands, we can't control it. Add to that a hectic schedule and a desire to better one's self because one has responsibilities to take care of... \n\nMost of the time it's not about not wanting, it's about not being able and putting that against OP is cruel.", "I think that's what everyone is saying, OP can be technically correct, and still be an AH. Same argument when people have a leagal right but are true AH in the application/use of the law. Delivery is pretty key in something like this. You don't want any sort of friendships in your future? Speak to people the way OP spoke to her friend. I'm actually leaning towards ESH because the friend has not handles themselves with grace in this whole situation either.", "Absolutely not.\n\nOP is being honest with a friend about a long-term time commitment that is happening soon.  Honesty absolutely is the best policy here because it stops the friend from trying to make plans that OP might need to reject over and over.\n\nIn your hypothetical case above, you lied to invent a high priority situation (i.e. work) as an excuse for not seeing a friend.  In OP's case, there is no hypothetical.  The high-priority situation is OP's education and OP is NTA for informing their friend that this major time commitment is happening soon.\n\nThe friend is TA for not being supportive of OP's education.", ">Man, if we are completely honest with our friends we won't have any!\n\nIf you can't be completely honest with your friends then they're not true friends. \n\nBeing rude and being blunt are two different things. If you need to sugar coat everything so your friends aren't \"hurt\" then you're better off without them because you're supposed to be able to be yourself with your friends without any fear.   \n\n\nOP never said anything in the tone of your  \"No, lounging in my pajamas and scrolling sounds better than seeing you, thanks.\" She said her friend is important, but not as important as her personal goals and responsibilities. She wants to see her, but she doesn't want to commit to something and then do the rudeness of cancelling because her health or schedule didn't match in the end.\n\nThe friend just didn't like the bluntness, but there was no rudeness.", "It's weird how so many people equate telling the truth with being morally good with zero nuance. \n\nObviously being truthful is a good thing, but you can have at least some tact.", "\"If you don't drop everything for me, including your education that you worked really hard to get, then we're no longer friends.\" -hangs up-\n\nThe friend is absolutely TA.", "OP DID say that though. That was the first thing OP said. Then the friend pushed and tried to guilt OP into doing what she wanted.", "Being honest (even brutally honest) in these kind of situations is always best.\n\nOtherwise, the friend might try to keep making plans that OP might continually need to reject.\n\nBeing honest upfront about a long-term time commitment is almost always best.\n\nThe friend is TA for not being supportive of OP's education.", "I don’t see it like that, I see it more as “I care about our friendship and see it as important, I don’t want to see it fall apart because we don’t talk” sorta thing. Making time doesn’t have to be going out every weekend, it could be a simple text every once in a while to say “hey just checking on ya”", "She can try her best. Trying her best doesn’t mean arranging things around x amounts of meet ups, it means doing her best, which could be something as simple as a text.", "Oh, FFS.Tell me you've never had a typo without actually saying you've never had a typo.\n\nSorry, not everyone stalks users before commenting. But since you're clearly that type, a quick scan of my comments on this post shows I've been pretty intentionally gender neutral in my comments.\n\nBut sure, focus on that.\n\n • <----- The Point\n O\n\\|/\n  |\n /\\\n  ^ You\n\nbtw, I fixed it. Ya happy now?", "Yes 100% to this. \n\nIMO the friend was a bit inconsiderate by assuming OP's priorities were the same as hers... Like, why not ask what's important instead of saying \"we make time for what is important\"? Like, not everyone has the same goals in life... and that's okay!", "This was about prioritising school, regardless of her chronic illness, but I still won’t change my answer. \n\nEven if she had nothing else on her plate, if someone tells you they’re busy, don’t ask passive aggressive, entitlement-laced questions and suggest you are a victim for not being more of a priority to someone. \n\nHer friend chose to ask a loaded question. At best, she was trying to convince her friend that there was more to life than school because she didn’t want her to miss out. At worst, she was trying to emotionally manipulate OP into compliance. Either way, she was guilting OP instead of being honest. OP just answered her honestly. \n\nSo yea I don’t think it matters that she has a single other priority or challenge at all. Her buddy is an AH.", "If she's chronically ill with something that flares up and necessitates calling an audible and cancelling something day-of, I'd think the friend would be aware that's a possibility given the length of their relationship.  OP didn't say that though, just that it required medical appointments to manage - I'm not aware of a doctor that generally schedules appointments in the evening.", "And OP will be the first to complain if her Friend doesn’t immediately help her during a flare up of the chronic illness.", "Not really, actually all that OP listed IS more important than the friend and people need understand that the world will not stop because you feel entlited to other people's time, OP was blunt and honest and I can see why her response did hurts her friend's feelings, but it's only the real world saying \"hi, it's time to fuckin grow up\"", "Your opinion . Mine is know your place : your friends are not puppets ,you don't support them=pay their bills nor take care of their responsibility and even for you entertainment comes in the exact same place as op spelled. \n\nAs such i consider the friend an AH so my judgement stays NTA.\n\nIdeally yes I would love to put my friends first. \n\nIf it's an emergency I change priorities accordingly of course and they get top spot before anything else depending on gravity of the circumstances .\n\n But this is no emergency, there wasn't even a specific event that needed an immediate decision like buying concert tickets it was only the friend flexing and demanding to be put first hence friend=ah.", "They didn't say that.\n\nDo you hold everyone and everything on the same priority level? If your mum and your friend were in the hospital at the same time and they both needed you there for moral support, who do you go to first? With whom do you stay the longest?\n\nIf you were made to choose between bettering your education and doing anything you need to look out for your health and some party on the weekend or a concert in another state, what would you choose?\n\nRecently people have started to treat their friendships like corporate treats their employees and that's just wrong. People are allowed to have priorities and if you're gonna be a pushy friend who tries to manipulate others by saying \"we make time for what’s important\", then maybe you do need a blunt answer after an \"I can't make plans too far ahead because of these very valid reasons, sorry\".", ">\"You're the lowest thing on my priority list\" isn't a blunt answer\n\nIt also wasn't what OP said. OP said the friend wasn't \"more important than school, paying bills, and other responsibilities.\" Someone who expects you to neglect the necessities just for them isn't that great of a friend.", "Friendships that are one sided are absolutely unnecessary in life. OPs friend probably already feels that they give too much and OP gives too little (not judging OP for that. She has a lot going on) but no one is obligated to stick around a friendship that's not positive for them. OP can't say in one breath \"too busy due to numerous factors that absolutely make sense\" and then later say \"where are all of my friends? I'm ready for friendship now\" relationships aren't things you can put onto a shelf and pull out when you're ready/able to. They're either there or they're not, especially when it isn't a familial relationship. Again, I'm not saying OP is wrong at all. She absolutely has so much going on that's more important to her and that's how life is sometimes. But you can't just put friendships/relationships on pause and pick them up when you're able to. That's not how real life works", "That's a weird way to read 'let's put something on the calendar.'", "But that's not what the friend asked. They asked them to make plans in the future OP couldn't have possibly agreed to and got shitty about it.", "Okay but adulthood is understanding that some things are more important than you in other people's life, and that is a thing her friend need get on her head, yeah actually OP's education IS more important than their friendship because that's her future\n\nSorry but I just can't see it with a rainbow glasses, the friend was pushy and trying guilt trap the OP, so being blunt and honest was the better way to deal with it, after she can try explain her own points and listen her friend's reason, but at the moment? She being clear that her friend is NOT more important than her education was needed", "What a massive overreaction, thanks for the giggle at your expense.", "Exactly. Unless she was planning a wedding or some other major life event (and I'll even be generous here & say a major milestone birthday gets extra consideration), then the answer is \"sorry friend, but this is very important to me, and I don't appreciate you being so minimizing and dismissive of my goals.\"", "From OP: \n\n>In addition, I have a pet who will need caring for and I have chronic health issues that require doctor appointments.\n\nI don't know one chronic health problem that doesn't flare up. And tons of doctors schedule appointments in the evening, at least where I live they do.\n\nAnd regardless, OP isn't FORCED to make plans ahead if she doesn't feel comfortable with it in her current state in life with her current responsibilities and priorities. She has a right to have different levels of priorities and her friend has the obligation of respecting that boundary. If she can't, there's the door.\n\nDo you have the same level of priority for everyone and everything in your life?", "I don't think so. \n\nMost of us don't complain about others not helping because we've been shamed into thinking we don't deserve help and that our chronic health problems and/or disabilities are our own fault. So... most of us don't ask for help. And since OP didn't mention asking for help from her friend but did mention her friend wanting her to commit to a long term project that results in social endevours... I dare assume OP wouldn't ask said friend for help to begin with.", "Isn't the whole point of this sub to share our opinions?  I guess I just have a problem with telling a friend something along the lines of \"you're not that terribly important to me\".  I'd honestly reconsider the whole friendship after an exchange like that.\n\nTo be clear - I still think the friend was over the line in her demands, but being pushy is not the same as being flat-out insulting.", "Frankly a competent independent adult is lower on the priority list than coping with a chronic illness while starting a new tertiary education programme and coping with sick pets. My father is high on my priority list but now got a pet who may need euthanasia. So do I speed up death of a pet to accommodate visiting a parent? Which is more pressing - preparing for an exam or going to a club?\n\nOP was sensibly saying she can't plan ahead because she has too many balls in the air. Friend is wanting to be a fixed point with everything else adjusting around her and that can't work. Illness, college, sick pets impose their own structures and are less flexible.\n\nSo OP's choices were to be clear now and hurt her friend by pointing out she is one of many responsibilities, hurt her later by declining invites closer to time or burn herself out and likely fail everything by trying to do everything.", "Same as your comment was a weird way to read \"I have other priorities right now and I can't make plans too far ahead because I'm not sure I'll be able to go through with them and might have to cancel in the end.\"\n\nAnd oh, guess what? OP DID SAY THAT FIRST. Her friend just didn't like it and tried to push boundaries.", "Less weird that your reading of OP’s “I have other things to tend to before I can commit to a night out with you.”", ">But that's not what the friend asked. They asked them to make plans in the future OP couldn't have possibly agreed to and got shitty about it.\n\nAh yes, because nebulous doctors appointments and vet appointments can't be scheduled around or anything. It's embarrassing how many of you eat up these obvious excuses. OP lied to her friend and should have simply said \"I don't have the capacity to help,\" not blame it on random shit like her pet. OP is a coward and a liar.", "\"That's her future\" - lmao OP is 50, it's a vanity program.", "Yes! Exactly. \n\nLike, everyone in the comments is basically saying OP is rude for minimizing her friend's importance... but what about the friend? Specially when OP is chronically ill, like, that shit doesn't announce flare ups nor crisis, they just come. Imagine if OP planned ahead like her friend wants and she suddenly needed to cancel... if the friend pushed after the initial softer response and got offended at the more blunt one, she's gonna throw a hissy fit at this...", "> Do you have the same level of priority for everyone and everything in your life?\n\nOf course not, but I'm also able to say something like \"I don't know what my schedule is going to look like when school gets into full swing, so I'm not able to commit to scheduling something that far out.  Let's look at the calendar once I have a better idea about my obligations.\"\n\nI agree OP is not forced to make plans, and the friend should have accepted the answer the first time rather than laying on the guilt trip.  That still doesn't absolve OP of her straight-up rude final comment.  Laying out the pecking order?  Really?  ESH.", "i honestly think it depends on how you interpret what OP said. \n\nto me, it read as “you are important but i have other responsibilities that take precedent” which is completely valid and is just kind of a fact of adult life. \n\nif OP was completely blowing the friend off, id be more sympathetic, but saying “i dont know what my schedule will be like and i have other responsibilities that are more pressing” is not really an AH thing to say, even if it isnt exactly fun to hear\n\nwe also need to take into account *when* OP said this, because she originally just said she wasn’t comfortable making plans far out since her future schedule is unknown right now, which im sure we can probably agree is completely valid and not at all AH’ish. the friend saying “we make time for what’s important” completely disregards OPs valid concern and is mildly guilt trippy imo. instead of saying “yeah i get that, but it still sucks” or something, she immediately made it out that OP does not value her because she didnt put her above everything else. now, again, im not entirely sure this makes her an AH, since its clear they just prioritise different things in life, but it’s important context for *why* OP said what they said. \n\ncould OP have worded it better? 100%, but im still not sure their wording makes them an AH in this situation. if it was said completely out of nowhere then yeah, they’d be an AH, but in the context i think its NAH", "He didn’t say you aren’t terribly important.\n\nJust that you’re not as important as their career, health, schooling and livelihood. If that upsets you YOURE the bad friend", "Indeed it is. I prefer to be brutally honest with myself and like op I throughly dislike making plans to cancel them( on my side) when there is an alternative open.\n\n I extend the same to my friends: we make plans with the caveat that if something happens they just need to let me know as soon as they do, that  it won't happen .\n\nInvited some friends for a visit in July the said they would like to come but don't yet know the work schedule (it comes later for every couple of months) I depended on the visit date to know when I should come back from vacation in another country (if they came I had to come back earlier than planned) .\n\nAfter 2.5 months they said they can't due to work related stuff - not a problem I am disappointed to not spend time with them but their work/family/responsibilities come first (we live on different continents, me in Europe they in America so we can't spend time in person often btw)  and I bought my ticket to return a couple of days later and more expensive than it would have been when I first asked.\n\nFor me this is being a reasonable adult and a good friend.\n\n\n  I personally think this shows mutual respect.", "She told her friend the truth. And if you’re going to reconsider a friendship because someone told you the truth about the priorities after you pushed them into that corner, then like your friends mayyy be better off. \n\nShe didn’t tell her friend she wasn’t important. It was like “yea you’re important but currently this is what requires the most attention in my life”. Her friend was trying to guilt her into compliance or feel guilty about not matching to her friend’s tune.", "Allow me to butt in, please.\n\nReading OP's post, I see two points that I haven't seen other people address yet:\n\n>I didn’t feel comfortable with *making plans that extend into the time when grad school has started*, as I wasn’t sure about how much time I would have\n\n\"Plans that extend into the time when grad school has started\" - what I get from this is that OP's friend wanted to plan for something that wasn't just a concert, a museum visit or a birthday dinner. Whatever it was, it appears that the plans required more time, and extend into school starting time. A two-week vacation? A pottery class? A plan to prepare for the New Year's Marathon?\n\nThen\n\n>Her response was that *we make time for what is important*, which I agree with in theory. However, I will be working, going to school, and maintaining my home. In addition, I have a pet who will need caring for and I have chronic health issues that require doctor appointments.\n\nI would feel flat out insulted with the friend's reply. If she is indeed a friend, she knows about the health issues and that OP has a pet that needs caring for. But the friend considers *these are not important*. I would take offense if a supposed friend said that *whatever plans she has* were important and my doctor's appointments weren't.\n\nStill, I agree that one wrong word can convey a really different meaning to something we are trying to express.\n\nI would not say that my issues are more important than *the friend*. But I would certainly tell the friend that my life priorities take precedence over whatever *leisure plans* she has, and therefore I was unable to commit to anything so far ahead.\n\nETA: NAH", "I agree with your completely and I think you explained what I said in a less emotional way than I did.", ">like, that shit doesn't announce flare ups nor crisis\n\nStill amazed at how many people completely overlook this fact, telling OP they should have \"bEeN nIcEr\". OP was nice. Friend wasn't hearing the nice message.\n\n>she's gonna throw a hissy fit at this\n\nDING, DING, DING!!! We have a winner.\n\nYou get the feeling that in the future this will be the same friend that can never do anything cuz money's tight, and ends up never actually retiring, just working til she can't?", ">Of course not, but I'm also able to say something like \"I don't know what my schedule is going to look like when school gets into full swing, so I'm not able to commit to scheduling something that far out.  Let's look at the calendar once I have a better idea about my obligations.\"\n\nAh, see? So you understand that some people are less important that other responsibilities in a priority scale.\n\nAlso, OP said that at first, friend pushed, OP went the blunt route. Even you admit friend tried to guilt trip her. So OP shouldn't have been firmer after that?", "Or worse, expecting others to drop everything to help her financially/morally. \n\nMy ex had a friend like OP and my ex and their group was OP's friend. I witnessed this same thing happen except the chronically ill part, the friend was pushed and shoved to the edge and had to resort to be exceptionally blunt and kick everyone except me and another guy out of his house to be able to work in peace. So I understand OP completely. \n\nA lot of people don't seem to understand priorities and boundaries... treating friendships like corporate treats employees.", "There's firmer, and then there's how OP responded.  That's my whole point."]}