{"id": 17632, "submission_id": "13lqoss", "title": "AITA for not wanted to look after my autistic uncle?", "selftext": "I am a student in highschool and my autistic uncle (who's 2 years older than me) is going to transfer to my class because he got bullied in his previous school. My grandparents (his parents) told me to take care of him, help him with homework and online work, bring him to school, and back home. He causes a lot of trouble in other schools (He pushed a girl he liked down a flight of stairs, and I got part of the blame because I wasn't there to \"stop\" him). I have to take him everywhere I go once school starts again, and I'll have no way to hang out with my friends. I love my uncle very much but I don't think it's my responsibility to take care of him everyday? I've been his babysitter since elementary and I never really had friends to hang out with since I'm always with him (making sure he doesn't do anything troublesome). I couldn't tell my family that I don't want to be his babysitter because I feel bad for thinking of it this way, but I just want to enjoy my last year in highschool with my friends without having to be the nanny for my uncle.\r  \n\r  \nAm I the asshole?", "created_utc": 1684489386, "permalink": "/r/AmItheAsshole/comments/13lqoss/aita_for_not_wanted_to_look_after_my_autistic/", "score": 608, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n >  I told my parents I didn't want to take care of him, as I have my own life and my own friends. They got upset because they think it's such a basic thing to do, and that it's a way to show basic respect for my grandparents. I'm still quite young so I believe this is entirely not my responsibility.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nYou’re his family but doesn’t mean you must take care of him and especially so when you’re still a child yourself. That’s ridiculous of your grandparents and parents. You need to get this across to the adults and have qualified person do the caring rather than you, if the school doesn’t have such a person then your family need to find him a place where there’s such provision of care", "NTA if you're getting blamed for him pushing someone down the stairs because you were supposed to be responsible it makes sense to refuse to watch him from here on out. Now if something goes down they can't blame you. Also, they are parentifying you which isn't fair. You should not have to take care of an autistic teen as a teen.", "NTA\n\nI think that it's not your fault that he pushed the girl off. You are not his parents and you should not be included in this. If the family wants him to graduate and go to work, they should hire him professional teacher, who is educated and can deal with this. Also, why do the parents think it's a good idea to transfer him to YOUR school? You can't be there ALL THE TIME!!! Nonsense. Tell your parentd that you DO NOT want to babysit him, because school is there to learn something and make friends...etc. NOT to babysit someone. And you said you didn't have any friends growing up right? This is your chance to make friends. Idk if people want to be friends with you & your autistic uncle.. \n\nHope this helps, my English is not that good,but I hope you know what I mean.", "NTA your uncle needs to be in a school which can cater to his needs tell your school you don’t feel comfortable or equipped to support your uncle", "NTA. It’s your grandparents responsibility for his well-being.", "NTA\n\n He needs to be in a school that can look after him and his needs properly. You are not responsible for his actions, you are not his parent, you are not his legal guadrian. I can understand looking out for him, but this is extreme. Your grandparents need to step up and put him in a school that better suits him. They are being irresponsible. The girl who he pushed down the stairs may still be alive, but if he does it again....there is no guarantee. It should be worse.....", "NTA. Reach out to a guidance counselor or teacher about your concerns. It’s the school’s ob to manage him. And I would find a way to do college and early career out of my hometown.", "NTA - This is a huge responsibility to take on, so definitely NTA for feeling significant trepidation, and frustration, at being asked to do this.\n\nYes, your uncle experiences barriers to learning and socialising that are greater than yours, but it shouldn't be forgotten that you are also in your final year of High School - an important and fun, but also, often, trying and confusing time for everyone. To be asked to manage your uncle's school routine as well as your own is no small thing.\n\nYou haven't said whether your own parents are in the picture and what they think? Do you have their support? Maybe try to sit down with your grandparents and explain that you're very happy to look out for your uncle when in school, and to support in some ways (only you know what your boundaries are), but that, as it's also your final year and you have things you want to accomplish, you don't feel you can support in all of the ways that are being asked of you.", "Absolutely NTA, and you need to shut this down.  Go to your guidance counselor or school office and request that he be removed from your classes. It is not your responsibility to look after him and make him behave and it's unfair that your family is expecting you to.", "NTA. The adults in your family are putting too much pressure on you to control uncontrollable forces. You're a really sweet person to work so hard to help your family, but you aren't qualified for the job (helping people like your uncle is a job that adults are paid to do).  \n\n\nEdit: Literally too much literally.", "NTA. Do you have a trusted teacher or counsellor who you can talk to about this?", "NTA. Honestly it sounds like he shouldn’t be in a mainstream school anyway.", "NTA forcing you a minor, to do this job is o\nparentification, which is a crime. It's a parents job to attend to him, or failing that, finding another adult teacher or minder to help him.\n\nYou deserve a life. The time for you to sacrifice your happiness is if and when you have your own children.\n\nNTA", "NTA - I’m really sorry about your predicament but this is not fair to you. You seem pretty young yourself so this is a huge thing to ask. Taking care of another human is *not* a basic thing to do. Your uncle needs to be in an environment that can better care for him and assist in his development and you deserve the full educational experience of being in school, making friends, learning, finding your interests etc. This is not your job.", "NTA how old are you and where are your parentsß", "How could you have been his babysitter since elementary when you talk about his previous schooling?", "NTA.\n\nHow would it be your fault that your uncle pushed another girl down a flight of stairs? If this behavior is as normal as I'm getting from this story, then he needs to be institutionalized or something before he kills someone.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI am a student in highschool and my autistic uncle (who's 2 years older than me) is going to transfer to my class because he got bullied in his previous school. My grandparents (his parents) told me to take care of him, help him with homework and online work, bring him to school, and back home. He causes a lot of trouble in other schools (He pushed a girl he liked down a flight of stairs, and I got part of the blame because I wasn't there to \"stop\" him). I have to take him everywhere I go once school starts again, and I'll have no way to hang out with my friends. I love my uncle very much but I don't think it's my responsibility to take care of him everyday? I've been his babysitter since elementary and I never really had friends to hang out with since I'm always with him (making sure he doesn't do anything troublesome). I couldn't tell my family that I don't want to be his babysitter because I feel bad for thinking of it this way, but I just want to enjoy my last year in highschool with my friends without having to be the nanny for my uncle.\r  \n\r  \nAm I the asshole?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "INFO: are you in the US? Because if you are he needs an IEP/504 plan. The SCHOOL should be accommodating and supervising him. \n\nNTA though.", "NTA\n\nThe responsibility for looking after your uncle at school, home or anywhere else for that matter should not be placed on you. If his behaviours mean that he needs someone to be with him all day, then your grandparents should be applying for that support themselves via the school instead of relying on you.\n\nSince you haven’t told your family how you’re feeling yet, I would as gently as possible inform them that you don’t want to be your uncle’s caretaker. Not only do you want to enjoy your final year of high school with your friends, you will also be working hard for your exams and having to look after him is going to distract you from that.", "NTA. You are not his parent and shouldn’t have to handle all of this at your age. Also you definitely should not be blamed for anything he does. By them putting this all on you they are teaching him not to take responsibility for his actions. One of the worst things you can do for people who are neurodiverse is teach them it’s ok to act however they like and use “I’m autistic” as an excuse. I’m so sorry you are in this situation. Is there someone in the family who you can go to that will stick up for you?", "NTA. You’re still a kid and another adult is not your responsibility. I’m sorry your family is trying to put this on you.", "I hate it when adults put their responsibility on children. He needs a trained professional work him.", "HE pushed a girl down the stairs and you got some of the blame? He need to be in specialized classes for kids with learning disabilities, if that’s social or academic. I was in one due to my adhd and missing a lot of school due to surgery the first years. I knew a kid that chased me with a metal bat to hit me. \nTalk with the school about what your family is pressuring you to do and tell them about that accident so it will be taken more seriously.\nNTA", "Absolutely NTA. And absolutely NOT your responsibility.\n\nSend an email to your parents, your grandparents, and the principal of the school. TELL them that he is not your responsibility and that you will NOT be taking care of him. \n\nYou shouldn't feel bad at all! You should never have been made to take care of him. Ever. You have a right to enjoy school. Plus, he needs care and supervision that you cannot provide.", "NTA. You are still a teen yourself. You should not have the responsibility to look after someone else. That is your uncle's parents role. Stick to your boundaries. Talk to a trusted teacher. He is not your responsibility, he is the responsibility of his parents and the school.", "NTA.  This is called parentification.  It’s on his guardians to watch out for him, not you.", "NTA. Try not to feel bad. Hes not your child, hes not your responsibility. If there is anything youd be willing to do, maybe a couple hrs of scheduled study time a wk, or transportation to & from school, i think that would be generous of you, and a kindness to your uncle. But its unreasonable to put any pressure or responsibility on you. Maybe also talk to your school and explain your predicament. When my daughter and i moved to the town my nieces lived in i asked her school if she could be put in a class with one of them, and they said no, they keep family members separate for this reason.", "Nta. Please go talk to the school.  It's not appropriate to have you assigned as his caregiver.  He needs someone certified.", "Why can’t his parents take him to school and back and help him with homework ?", "NTA\n\nIt sounds like he shouldn't be in a mainstream school if he needs that much help. \n\nYou need to speak to someone at your school that you trust about the situation.", "Hello! My parents also want me to look after him, since they feel bad that he got bullied in his previous school, and also because they’re trying to respect my grandparents. I tried telling them that I simply can’t just be his caregiver but they don’t seem to care about my personal life. As for my grandparents, I don’t know if I can tell them this. They were so used to me being my uncle’s support in school that they never really thought of my own opinion about it and it sucks knowing that I’ll be missing out on a lot (especially when it comes to hanging out with friends)", "Right? OP needs an adult on their side to advocate for them. The parents/grandparents are doing a poor job of taking care of OP's needs.", "Hi! yes, I’m actually 15 and 9th grade was the only time I actually had a circle of friends that I could hang out with after school. They expect me to teach him about commuting or helping him adjust to our school activities (We have a lot of school work and online work which might overwhelm him). It’s super hard trying to explain my situation to my parents because they were so used to the idea of me babysitting him when we were in elementary school. I keep telling them I can’t be there for him every time but they don’t seem to care about my own personal life (sorry for the bad english!)", "Hi! from 2nd grade to 6th grade, I was in the same school as him, looking after him. For the first years of highschool, we went to separate schools (I have a few friends now, and my main worry is that I won’t get to hang out with them once my uncle transfers). Now that I’m in my last year of hs, that’s when he’s transferring to my class this year (sorry if my english is bad or if i explained it badly! It’s not my first language.)", "Hi! No, I don’t live in the US, I live in a country where there’s no such thing as Individualized Education. We have Special Education where kids with disabilities all learn together, but my grandparents enroll him to my schools because they say he’s smart enough for it", "Ah I see, that makes complete sense. If you don't feel that you can talk to your grandparents directly, maybe try speaking to your parents again and see if they can understand your perspective, and then maybe they can calmly put your feelings forward to your grandparents?\n\nSay exactly what you said in your post: that you love your uncle, that you want him to thrive and do well, and that you've been happy to support him over the years, however, as you go into your final year, the responsibility of managing both his and your own time, routine and workload, as well as being expected to semi-manage his behaviour (prevent him from being physical again), is making you feel stressed. I'm sure they'll want to support you if/when they understand that this is preying on your mind.", "Yeah, these expectations are really unfair. You have a right to enjoy your childhood with your friends without the constant stress of having to watch out for and prevent your uncle from behaving badly. \n\nYour grandparents really need to be looking into getting proper support for him at school instead of relying on you all the time. Can you talk to someone at school about how you’re feeling?", "Refuse to watch him and speak to the school. During school hours it's the school's responsibility to watch him. And after school it's his parents' responsibility.", "Where are they?? They are his parents. Let them accompany him or hire a professional. What happens when he pushes someone and they get hurt? Or he pushes you? They are setting you up as a scapegoat to shirk responsibility and accountability. They should be ashamed of themselves.", "Smart isn't the issue, it's his wildly inappropriate behavior. I'm autistic and there is *nothing* about autism that excuses **pushing someone down the stairs**?? That's so incredibly violent, he could have killed her! You are not you uncle's keeper and he needs serious intervention.", "NTA-He is your parents' family too. Why don't THEY take on the responsibility? They, at least are adults. When you finish high school, consider further education AWAY from home. Like in another state. Be aware that your family may expect you to care for this person for his entire life. If you are largely absent, perhaps they'll come up with a different plan.\n\n\\*He pushed a girl he liked down a flight of stairs-what might he possibly do to YOU someday?", "NTA….are you in the US?  If your uncle needs a babysitter, then he should have an aide if he cannot handle school alone.  Do not feel bad.  Tell your family sorry, nope, this is not your responsibility.  You are willing to help when you have time, but you are not giving up your life for his.  Where are your parents in this equation?", "NTA. \n\nNo one is at school watching you. They have no way to prove that you aren’t with him all the time. \n\nJust tell everyone you couldn’t stop him when he gets in trouble.  You apparently get in trouble anyway when you are with him… so you might as well not be and leave it to the adults.  \n\nGo live your life with your friends.", "NTA.\n\nI deal with severe autistic with Global Developmental Delay.  \n\nWhat the parents are doing is unacceptable.  This is abuse towards you.\n\nHe needs real support such as an EA or therapy if his behaviour is aggressive - pushing a person down the stairs.\n\nThis is NOT your responsibility.  The responsibility lies on the parents, period to get him adequate support", "NTA\n\nI think you need to establish boundaries. It might be beneficial to complain to your school counselor or psychologist and establish with the school that you refuse to have anything to do with him.\n\nFind reasons to stay after school for clubs, volunteer for doing theater sets, stay for homework help yourself, etc. Not only will it keep you too busy to help, but dang will it look good on college applications.", "NTA.  \n\nCan you talk to a counselor at school and see if they can help you.  Tell them your family is pressuring you to do this and you can’t.  The school should be helping him and supervising him.", "No. I don't care if I sound like the materialistic so and so but what are you getting out of this? Are you even going to get a thank you? Does your grandparents realise that they're putting a strain on you at what is probably the most critical time in your life?  \nNTA.  \nI've had this happened to me when some idiot extended family messed up my final year, which I chewed them out for now.  \nLook after yourself first because your uncle shouldn't be your responsibility. They should be your grandparent's responsibility.", "This is like the third post I've seen today, where the parents of disabled people are trying to force their care on CHILDREN. No. You are not responsible for your uncle. You are a child. You should be enjoying your life, playing sports, and getting good grades, not being stuck taking care of someone else. Tell your grandparents that he's not your damn responsibility, and tell them to find someone else to take care of him. You are absolutely NTA.", "NTA. It’s his parents job to help him with school work. If he had behavioral problems then he needs different schooling. Source: am psych nurse and have 2 cousins who went to these schools. One is in college, he’s doing amazing. The older one had different experiences, she’s in her 50’s. But she’s still living at home and her mother is her care taker. \nYou deserve to be a teenager and enjoy school.", "The school district should be providing your uncle with a special ed aide.  \n\nPlease talk to a school counselor about this!  This is not right!  NTA.", "Nta. Please, please talk to your parents. This is such an unfair burden to put on your shoulders. You shouldn't have to sacrifice so much or stop living your life in order for him to live his. It doesnt matter how convenient this is for your grandparents, its not ok.", "NTA.  The school can hire a full-time person to attend to your Uncle.  You should not have to sacrifice your life, your social life and your study time to ensure your Uncle does okay.  \n\nGeez, just getting myself through the last year of high school was a full-time job for me.  Caring for another person would have been absolutely too much.  Plus, your social life?  That would not exist if all you devote your time towards is your Uncle.  You deserve better. \n\nI deeply agree with the earlier comment that you need to talk to a school counselor.", "YTA", "I would just tell your parents and grandparents that I refuse to look after him. You're not his parent, or is he your responsibility. Your family just expects you to pick up the slack they leave. They can't force you to be responsible for a autistic teen. Frankly, the school should be doing more in terms of monitoring him than you.", "He should have an IEP and a behavior plan in place. If he is pushing people down the stairs he should have an aide that walks with him to classes. This is not a you problem, its a school problem and a grandparent problem. NTA", "NTA. You’re just a kid who should be enjoying their last year of school, which brings up the question, what do your grandparents expect to happen after you graduate?", "Nta\n\nNo is a full sentence and you need to learn it or else it won't just be highschool it will be the rest of your life. University, you can't move away because who will look after your uncle, you can't go out with friends you need to take your uncle. Etc etc  you need to stand up for yourself and hold that boundary. If he's physically violent you cannot be expected to police his actions and they should have a support person with him all the time.", "NTA.\n\nYou should not be responsible for another person's behaviour and actions.\n\nIt's unfair for them to expect you to take care of another person in addition to your own life and schooling etc.", "NTA- not your responsibility period.  You are a child.  And even if an adult.\n\nTalk to the school. Tell them your uncle should not be in your class,  nor your responsibility in any way.  Unless they are going to pay you to be his caregiver at school, you are there to learn.\n\nI don't know where you are but im the US\nThe school is responsible for your uncle during school hours. They should be providing staff supports or an environment that he can acess safely.  Often schools get more money for children who are disabled.\n\nYou can tell your grandparents that you of course will advocate for your uncle.  So he has access the the resources he needs to succeed in school.  You absolutely will speak out if you witness bullying or discrimination.", "Young OP, you are NTA for not wanting to look after your uncle and remember you are not a bad relative. It is unfair on you that your grandparents expect you to do that and it is not your job as I believe you are a minor who is not capable of doing something this large and responsible\n\nHave you tried talking to a teacher or school counsellor on this? If I am the school staff, I would have a serious word with your grandparents and suggest they get a qualified person to supervise him. Your uncle is not your responsibility", "You need to talk to a school counselor about all these things and have them talk to your parents. Your having to be a caregiver is not something you have picked and is actively harming your school life. You are missing out on a lot of social learning and memories that only come from being friends with your peers. \n\n NTA.", "This isn’t your responsibility. If your uncle can’t stop from being aggressive to other students then he needs to be separated. Helping with homework and transportation to/from school is a parent responsibility. Guiding him through classes shouldn’t be necessary if he is capable of being in the main population; he either needs an aide or he needs to be placed elsewhere. \n\n\nNTA", "They should hire a professional to shadow him during the day. My brother in law, as an adult and professional, did this for a family friend who has Down’s syndrome. Went to 4 years of Highschool with him. You are supposed to be a kid right now", "Absolutely NTA. \n\nIt is great that you care about your uncle and of course you should say hello if you see him on campus, have lunch with him sometimes or schedule a check in at a mutually appropriate time during a passing period, or even to give him a ride home or to school when you can. You would be the asshole if you pretended you didn’t know him, but if you are 100% focused on him, you can’t focus on you, and you need to focus on things like your schoolwork, any teams or organizations you are part of at school, preparing for college/university or a career/trade, etc. \n\nIt is the job of the school to give your uncle constant support while he is in the building if that is what he needs. There are trained specialists who have made it their career to support people who need that level of support. Let them do their jobs, and you do the job of being a student.", "NTA It's the school's responsibility to watch out for him not you. Talk to your counselor and make sure that you aren't responsible for him during the school day. You need to focus on you and your schooling.", "NTA. If he needs this much care, why does he not have an SLSO  to accompany him outside of classes? He's a danger to others,  that girl could have died", "NTA Are your parents ok with this?  Can you speak with a counselor about your \n concerns?  There should be an EIP for your uncle THAT DOESNT INCLUDE YOU.\n\nNTA", "NTA. He needs an assistant at the school, it’s an adult that helps them all day.", "NTA it's one thing for you to step up on occasion but they want you to be a full time minder.  Talk to the school/councilor and tell them what's going on.", "NTA The school should be providing an aide for your uncle.  I've been in this line of work before.  Assisting a disabled student is a full time job that adults do.  It should not be the responsibility of an unpaid high school student.  This isn't fair to either of you.  \n\nI think it's important to talk with your family about this.  They are expecting you to take on adult responsibilities.  It sounds like this has been the case for a while.  Hopefully you can come to some kind of arrangement where you are able to have a personal life that doesn't revolve around your uncle.", "NTA. If your uncle needs this much help to behave in school his parents should be appealing to the school and welfare to get an aide who accompanies him through the day. I'm not sure what the correct terms are where you live. In the UK he'd be assessed an given an IEP which lays out accommodations that are made for him and funding allocated for a \"one on one\" assistant who helps him focus on tasks and helps him. This is a paid professional. As a child yourself your only responsibility should be focussing on your own education. You have neither the responsibility nor the training to be put in that position.", "NTA\n\nYour uncle needs an aide.", "NTA you are his Niece and while it would be very wholesome of you to have his back in situation where you are close by and could help him with small tasks he has trouble with you are not his parent. the bulk of the responsibility should be on his parents and teachers not a teenager who is also trying to navigate through adolescence into adulthood.", "ΝAH, a fair solution has to be found.", "Oh my god NTA if anyone at school blames you for HIS behavior they are F-ed up and you need to push it with the administration. Do not agree to watch him ever.", "Because you are similar in age and are known to have a relationship with him, when his parents become too old to care for him, or die, then you will be most likely be asked to be his Guardian. If this is not what you plan to do when you retire, make yourself absent as soon as possible. I would be VERY surprised if his immediate family has specific plans and funds for his future that DON'T include you.\n\nHe may become increasingly violent as he ages-Consider this as well.", "NTA \n\nTell your family to hire a caretaker. You are a kid yourself and deserve to enjoy your last year. Make it clear that you will be doing nothing for your uncle.", "He is not your responsibility.", "Nta. Your education is important. If he needs a para or someone to be with him all the time, they need to take care of that.", "NTA he needs to have an IED and possibly an aid with him at all times so he can function properly. Just because he is autistic does not give him the right to be a complete jackass by pushing people down the stairs and causing chaos for other students and teachers. \n\nIf you can't talk to your parents/grandparents about it reach out to a teacher you trust or the school's counselor.", "I know you’ll feel bad, and it makes sense because it sounds like that you really care about your uncle.\n\nThat’s said, NTA. You are a minor and he is not your kid. His parents should look after. I think it would be great if you could look out for him, like stand up for him if he’s bullied, but you don’t need to look after him.\n\nDoes the school offer any accommodations? ASD is considered a disability and there should be accommodations. It could be a good idea to see if the school has any accommodations for your uncle and hopefully that could make both your uncle’s and your HS life better.", "NTA, this guy clearly needs a professional carer, not another kid to follow him around.", "NTA. Why doesn't your school have paras for special needs kids?", "NTA. \n\nIf he needs that level of care during the day at school, he needs a one-on-one paraprofessional assigned to him. It's not a kid's job to manage another kid. It's the adults' jobs to manage him.", "NTA.  Oh sweetie,  you should have never had that burden placed on you.  Are his parents getting him help.  An IEP through the school and a diagnosis from a Dr could help getting him an aide at school.", "Make your case that some days (for example, Tuesdays and Fridays) you need to be free to live Your Own life. If they make no compromise, hit them with “Ok. How about Zero days. I’m out.”\n\nNTA \n\nPro Tip: Guilt only works if you let it.", "NTA\n\nI work at a hospital and last week we had a patient who was beaten up by his autistic son, causing brain bleeding and broken fingers/arm/leg. He is still in intensive care now.\n\nI am not saying all autistic people are potentially violent, but you are also a child yourself. What can you do when he tries to push another person down the stairs and/or any other physical altercations happen? What if he pushes you down the stairs? You will also be in harm's way. Your uncle needs professional care, beyond what you or even your parents/grandparents are able to provide, as he has already exhibited behaviour that is physically harmful to others. \n\nAlso it is 100% your grandparents (his parent's) responsibility to care for him, and it is abuse for them to force you into a caretaker role. I'm not sure if there's any method for you to stand up for yourself or if there's any adults who can advocate for you, is there a counselor at your school you can talk to? Being forced into his caretaker is harmful to you both physically and mentally, and it is isolating you from having a social life. Social development is important for you at school, since it teaches the soft skills you'll need to navigate relationships with other people in your adulthood. \n\nUnfortunately, the more you do the more your parents/grandparents will want to make you do, because it is convenient for them to foist their responsibilities onto you. They won't stop when you finish school, they'll be asking you to help care for him for the rest of your life unless you put a hard stop to it ASAP.", "he’s not your child he’s not your responsibility \nNTA", "The fact alone that your uncle pushed a girl down the stairs should tell them that he needs more help that you are able to provide.\n\nNTA. This is far too much responsibility for you to be given.", "NTA\n\nIt’s one thing to maybe walk him to and from school but everything else is frankly parentification. \n\nYou are in no way responsible for him at all.", "NTA autism is not an excuse to allow volatile behavior, and I always am disgusted to hear about people who have grown to get away with any behavior they wanted because their parents were too scared of meltdowns to learn how to enforce appropriate behavior.\n\nYou would be in the right to put your foot down and say no.  He isn't your responsibility.  If your grandparents want someone at his side every minute, either they can do it or they can pay someone.", "NTA. It is never your responsibility to take care of anyone under force. What they are doing is ruining your childhood by demanding you care for him. \n\nIt’s the parents fault for not securing proper care for their son, and gaslighting you making you believe it’s your responsibility somehow- it’s not, it never was, and it never should be.", "NTA. Explain to your guidance counselor what is being asked of you and that you fully intend to have a normal last year without accepting responsibility for your uncle. Then do exactly that. The school will not hold you responsible for his behavior and hopefully will simply give him appropriate consequences. That is what is in his best interest. If he is that bad, his parents should try to get the school to hire a behavioral health professional to monitor him. I wouldn’t even discuss this with your family. If he screws up, tell them that you were in the library or the bathroom or so focused on your own class work that you didn’t notice what he was doing. Apply to colleges far away, apply for scholarships and make a life for yourself. You deserve it.", "NTA. \n\nTaking care of your uncle isn’t your responsibility. \n\nWhat has your parents said about this?", "You need to talk about this with a guidance counselor. Your parents should not be making you responsible for your autistic uncle. Might be considered parentalization, which is abuse. How are you supposed to get your own work done if you are supposed to be watching him all the time. No. He needs a personal aid.", "Nta. It’s not fair to you - a child yourself - to have that much responsibility for another child. Especially when the obligation is impacting you socially and interfering with your ability to have autonomy and freedom to focus on yourself and your own friendships and relationships. I’m sorry that you’re dealing with this. The adults in your life are failing you. That’s a lot of pressure to be held accountable for another persons actions all the time, also.", "He needs professional help. The kindest thing that you can do is let him fail, so that the *professionals* will notice and step in. \n\nYour family is not doing him any favors by making a *child* take care of him. And WTF are the teaching him when they make you responsibile for not preventing his violent outburst? Or when the claim that his violence is because he \"likes\" somebody?\n\nYour family is both neglecting your uncle, and enabling/encouraging whatever antisocial stuff he has started to develop in addition to his autism. Your only a child, you can't fix this. Stop covering up their neglect and let the dominos fall where they may.", "NTA. you have every bit of rights to enjoy your school life. if he is so much trouble, why dont they move him to a school that could cater to his needs?", "NTA.\n\nIf you are in the states, I would very much like to know why he doesn’t have a personal aide with him. The schools I went to either had kids like your uncle in special-ed or had a personal aide to sit with them and keep them on task. It is 100% NOT your responsibility to keep someone else in line. In fact, I would speak to the school admins to make sure they have your back. Watching your uncle is not only not your responsibility, it will also impede your studies, which the school would hopefully be against.", "nta, doesn't your school have faculty to help the disabled? You shouldn't be the one in charge of that", "Nta. Your only responsible for yourself. Is there any way you can talk to a teacher or counselor and explain to them the situation so they can make it so your schedules don’t match at all. Or it’s way to far to go help him?  And I hope it’s not your fault it’s just easier to blame you than for them to blame themselves for being a crappy parent. I mean I don’t know what their plan is. Do they not want you to go to college? Do they expect your going to take him with you? I would talk to a counselor and start plotting your escape to go to college. Don’t even tell them where you are applying or tell them different schools. And you deserve to have your own life and your own friends. Your parents are ah for allowing this.", "NTA. And it sounds like your uncle shouldn’t be in a mainstream school. Talk to your school, not family first of all. Explain the situation and see if they can support you in this one. \n\nIf not, try to find someone in your family who will support and advocate for you. Then say you don’t want to do it. Because it won’t end with school, it will go to college or University too. You will be expected to adjust your plans to go to the same location as him, and will be cast as the bad guy for wanting to live your life - which you are fully entitled to do", "NTA", "Nta", "NTA\n\nYour uncle may need a 504 or IEP set up with the school that gives him an aide to accompany him all day. It is NOT your responsibility to be nearly a full time caretaker for an older relatives especially one who has shown violent tendencies like pushing a girl down a flight of stairs. By the way, it is NOT your fault that he pushed her. You should not be expected to put yourself in dangerous situations just to pacify your family members.\n\nAfter you graduate, you might want to consider moving farther away from home and living at college full time if college is the path you intend to take. You deserve to have your own life.", "NTA  \n\n\nThis isn't your responsibility and the adults around you should know better.", "NTA.\n\nI have two autistic boys and one neurotypical boy, oldest.  While I hope my oldest looks out for his brother's in school buy I don't expect him to be their keeper/babysitter...that is until I die and then I hope he steps but and not just puts them in a home or something. \n\nI'm a bit lucky because I live in Canada and out town has a good program for autistic and other handicapped students.", "I'm so sorry this unfair unhealthy is happening\n\nAll the schools involved earning the most severe hard: YTA for their lazy selfish unfair illogical bullying, Falsely Accuse Unjustly Punish , etc, \n\n\nWhy is C P S refusing to help?!?\n\nJob-Corps admits people age 16 to 21 year olds for residency job-training/placement, which You should go to ASAP ( if you can,, I should have and I would have if I could have,, )\n\nOr get into residential-college-prep-community-services\n\n\nYOU are the only NTA\n\n\nThe rest of your family gets between mild and moderate ESH\n\n\n   Wishing I could be more helpful\n\n\n     Peace", "NTA.\n\nYet another child whose needs have been ignored so the parents can abdicate responsibility for a disabled kid. He's not your responsibility, but unfortunately it's likely to be hard for you to avoid him. If I were you, I'd start planning now for how you're gonna get out and stay out when you turn 18, so you don't get trapped being his fulltime caretaker who doesn't get to have a life.\n\nThe good news is, if he's severely disabled enough to push a girl down the stairs without going to jail, there's basically no way the school can make you be with him. He should be with a special education aide fulltime. If he's not, you should go to your school administration and explain that he's been violent in the past and your family expects him to be your responsibility, but you're neither interested nor equipped to do so. They should be able to make it so he's not in your orbit.", "It’s one thing to “stand up” for someone being bullied but another to be their caretaker. OP should look out for his uncle (or anyone) being bullied. OP is being equally bullied…but by his family. Perhaps a school counselor can help him discuss the issue with his parents. OP is getting ganged up on and the counselor could help balance.", "NTA You're just a kid enjoying your last year of school, which brings up the question, what do your grandparents expect to happen after you graduate?", "NTA. If your parents and grandparents are failing you, you might want to express your concerns to a teacher or school counselor.", "INFO: who blamed you for not stopping your uncle's actions, OP? Was it the school or your family?\n\nIf it was the family, it's wrong for all the reasons other redditors have wisely presented. What's next, telling you you're forbidden to go use the restroom without dragging your uncle along? \n\nBut if it was the school... this is much more serious. It means they have accepted that an underaged student is responsible for an older student which has disabilities. \n\nI get it that it didn't happen in your current school, but from your words, it's something that could happen again, and it's unacceptable that the school puts that kind of responsibility on you, even if your parents say it's appropriate.\n\nWhichever was, you're NTA.", "This OP - you need some relief from this situation", "Yeah someone at the school, not a relative. I don’t even think this is allowed honestly. He can do his own homework or he can fail. They can get a tutor.", "OP is not in the US.  See link below \n\nhttps://www.reddit.com/r/AmItheAsshole/comments/13lqoss/aita_for_not_wanted_to_look_after_my_autistic/jkra5j2/?utm_source=share&utm_medium=ios_app&utm_name=ioscss&utm_content=1&utm_term=1&context=3", "I really want to hang out with my friends and do teen stuff together, I don’t want to be a babysitter all the time but I love my uncle so much that it’s hard to bring up to my parents to tell them that I don’t want to look after him. Just thinking about not wanting to take care of him makes me super guilty but I have to enjoy my last year with my friends :(", "OP stated in a comment that they do not live in the US.", "It’s not accessible in our country unfortunately, as our community rarely addresses cases like these :(", "He’s already been diagnosed (he doesn’t actually know he’s autistic, no one brings it up) but unfortunately here where I live, there’s limited support for neurodiverse people", "We all felt quite bad so they didn’t really say anything about it, but now it’s kind of bothering me because I don’t want to look after anyone anymore especially now that this year is the only time I get to hang out with my friends before we graduate", "Hi, I don’t live in the US. I live in a third world country and neurodiversity is a taboo topic for most people here, hence why there’s no personal aides or special help for them", "Yeah this, go find someone you can talk to about this, preferably at school so they can help find a reasonable solution. OP may not be bullied by their peers, but not having any friends because you're parentified for an unruly kid you happen to be family of is also devastating at a time when you're learning to become more independent from your caretakers.", "I doubt he got bullied. He assaulted a girl and his family's reaction was \"He must have liked her?\" Somehow I don't really trust their narrative.", "This! If OP is in the US, the uncle should have an IEP or 504 that provides support for him. It should never fall on another student to keep him “safe”", "It is never your responsibility to look after someone under pressure.", "I also have to wonder if OP's cousin is being actively bullied, or is facing the natural social consequences of his actions.\n\nI'm autistic myself, and have met some peers whose social difficulties are a direct result of their treatment of others. They and their parents conceptualize this as bullying. This seems to be particularly common with autistic boys, who don't usually face the same  level of social pressure to conform that autistic girls (and their parents) do. \n\nThe kid shoved a girl he had a crush on down a flight of stairs. I doubt that was the first incident of the kind. It is perfectly natural for his schoolmates to avoid and exclude someone who physically attacked a person they were attracted to.", "Maybe OP can fail a few classes so they don't have to worry about that!", "You should not be responsible for a family member who has a history of violent behavior- ask your parents what will they do when he finally gets physical with you for telling him no.", "I'm not sure where you live but isn't it an option for your grandparents to talk to the school about giving him an aide? Does he qualify for services? You need to start talking to your parents. This is WAY too much for them to put on you. If nobody listens in your family, talk to the school and let them know everything. This is not your responsibility and I'm sorry they put it on you.", "This isn't just an issue of your personal life, it's an issue of safety. He pushed a girl down a flight of stairs. Just tell them that you don't feel safe around him because you're afraid that he will also push you down a fly to fucking stairs. if they try to make you take care of him, just refuse. Call the bluff.", "Can you talk to your parents again, and lean on the education angle, since that might work better for them than your social life?  That this is your final year, and you need to have the time and space to make sure you get the grades you need to set you up for the rest of your life - and that you can’t do that if you’re splitting your time between your educational needs (which includes time with your friends - gosh you’ve got a lot of group work this year!) and being his carer. That you were happy to help when you were younger, but with the increased pressure of final year, you‘re worried about not being able to give him the support he needs without hamstringing yourself. That you need their support to find a solution that isn’t just ‘suck it up’", "What about your other grandparents? Are they around and can you talk to them about this?", "OP, I have given you my opinion and you are NTA on this", "What they're doing is NOT right, you're not his caretaker. Refuse to do it you aren't his parent, you're a child yourself.", "You need to say some thing. \n\nI would phrase it in a way that suggests it’s effecting your studies and your ability to focus. \n\nAdditionally, your parents need to be the one to manage this. I would have a conversation with them immediately and have them have a conversation with your grandparents.", "Ah, okay. Makes much more sense, then.\n\nI would still suggest speaking with your school admins, though, to have someone on your side if your uncle misbehaves.", "Only my grandma is here since my grandpa is currently handling some issues. I don’t think I can since atleast here where I live, talking about your opinion to someone older means you’re disrespecting them or some weird nonsense🫠", "could you bring it to a school counselor as \"my family is starting here in the next term, he may need support when he starts to handle X, Y, and Z. is there someone my family should be in contact with about that?\" and than tell your grandmother that you were talking to someone at the school and they said she should reach out to Person to help make sure Uncle has help he needs when school starts.\n\n(cuz let's be fair your grandparents are making a lot of assumptions, including that two of you will be in the same classes all day. and unless it's a small school, that seems unlikely. so it's setting both of you up for failure.)", "Yep, we’re in a small school, which means there’s only one section for my class. My classmates are bullies as well especially with neurodiverse students. We also don’t have a school counselor (We live in a third world country where stuff like this isn’t widely talked about, even in private and good schools)"]}