{"id": 17652, "submission_id": "13lwg4r", "title": "AITA for telling my stepdad to stop policing my food?", "selftext": "I (22f) currently live with my mom (51f) and stepdad (56m). My stepdad and I typically get along pretty well and I’ve grown to see him as a father figure since my actual father is pretty toxic. The only issue I’ve had with my stepdad is that he likes to make jokes about my food. I’ve struggled with ED in the past and don’t find those jokes funny and I’ve told him i don’t appreciate them several times previously. Last night we were all sitting on the couch eating dinner. Upon sitting down he said “all the meat on that plate had better be finished” and I simply said “it will be” and ignored him. When I was cleaning up I still had a bit of potatoes left. Not much but more than I had room for. He starts joking about how important it is to eat the whole potato and I reached a point where I was just tired of the food jokes and said “please stop policing my food”. In the past his jokes have been similar or aimed at me not having enough on my plate. He yelled that he’s not policing my food and stormed out of the room. He was slamming cabinets on the kitchen afterward. I don’t think it was wrong of me to say something and stand up for myself but I’ve never seen him react this way. AITA?", "created_utc": 1684505218, "permalink": "/r/AmItheAsshole/comments/13lwg4r/aita_for_telling_my_stepdad_to_stop_policing_my/", "score": 23, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1- telling my stepdad not to police my food\n2- I know he was joking even if the joke makes me uncomfortable\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA and his angry reaction is concerning.", "NTA But those don't sound like jokes? Those are statements I've heard parents make to their young children 1000 times. Though those are typically kids under 10, not 22. You're an adult, and tpo old to be policed like that.\n\nHis anger is confusing, I do wonder if it is a stress response? Like out of concern over your ED, or fear of something happening, he is super tense about it and pushing things to try and prevent something from happening. I am NOT saying that's appropriate or correct, just trying to see things from his side.", "NTA. He is.\n\nAnd if your mother doesn't shut him down and tell him to grow the hell up.... she is too.", "NTA - those aren't even jokes, he's just being a smart ass. It's time to have a sit down conversation about this. What he's doing isn't funny at all.", "NTA", "NTA - He is an EXTREME asshole for doing this and for his reaction. Please continue to stand up for yourself and create a strong boundary of him commenting on your food. A shit ton of folks here have your back.", "Sounds like he can dish it out, but can't take the reprimand. You're not in the wrong, he's being a jerk.", "NTA completely ignore him. Grey rock", "NTA\n\nNext time when he pulls one of these \"jokes\" ask him \"what is the punchline\"", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (22f) currently live with my mom (51f) and stepdad (56m). My stepdad and I typically get along pretty well and I’ve grown to see him as a father figure since my actual father is pretty toxic. The only issue I’ve had with my stepdad is that he likes to make jokes about my food. I’ve struggled with ED in the past and don’t find those jokes funny and I’ve told him i don’t appreciate them several times previously. Last night we were all sitting on the couch eating dinner. Upon sitting down he said “all the meat on that plate had better be finished” and I simply said “it will be” and ignored him. When I was cleaning up I still had a bit of potatoes left. Not much but more than I had room for. He starts joking about how important it is to eat the whole potato and I reached a point where I was just tired of the food jokes and said “please stop policing my food”. In the past his jokes have been similar or aimed at me not having enough on my plate. He yelled that he’s not policing my food and stormed out of the room. He was slamming cabinets on the kitchen afterward. I don’t think it was wrong of me to say something and stand up for myself but I’ve never seen him react this way. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA AT ALL. Your stepdad is also toxic", "NTA - these are not jokes, they're triggers. People say this stuff to me, my throat closes and I just can't eat, even if I want to.", "This guy sounds like my dad. He probably doesn't believe how bad mental health issues are and he uses \"jokes\" to \"lighten the mood\" about stressful shit, and it just turns into him being a complete asshole.", "And he started slamming cabinets too, he sounds like he could be dangerous.", "Oh man, I'm sorry, that sounds like a super unsupportive environment."]}