{"id": 17662, "submission_id": "13lzsxx", "title": "AITA for taking a needle off a girls insulin pen", "selftext": "I was on my lunch break at school today. I was literally just outside the school gate when I saw what looked like an insulin pen (I am a diabetic) I thought perhaps it was empty, it had just under 100 units left and there was a needle on, it was slightly twisted which indicated it had been used before, which is unhygienic to use again, so I screwed it off. I was about to hand it into the school when a girl (lets call her molly) walked in the school very upset and appeared anxious, I then realised that molly too is a diabetic. I asked her if she insulin pen was hers she said it was. She came up to me ten minutes or so later FILLED with rage because I screwed off the needle, I mentioned how it was unhygienic to reuse a needle and how it puts her at risk for infection, still she was angry because she “had none left on her” so I gave her a few of mine, she was still very angry. AITA for keeping myself safe and her for screwing off the needle?", "created_utc": 1684512293, "permalink": "/r/AmItheAsshole/comments/13lzsxx/aita_for_taking_a_needle_off_a_girls_insulin_pen/", "score": 48, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Because I screwed the needle off the injection pen even though it was hygienic\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA you found a used needle on the ground. There's not any argument for *not* disposing of it. \n\nMolly needs to redirect her anger at herself for being so careless with her medical supplies.", "NTA but next time you should just not touch it and alert a teacher or school staff instead. You don't want to be liable for any potential issues or accidents.", "NTA! You could have saved her and others’ lives", "After reading the headline I was very ready for an easy YTA, however, used needle outside a school. You did the right thing.\n\nNTA, that girl needs an education (as do her parents/guardians)", "NTA.. you turned it into the school. If she was supposed to keep it she can just ask for it back. You even gave her some of your own to be nice. I don’t think you could’ve done more here. As long as you don’t throw things away or keep them for yourself you’re really not ever doing anything wrong since you let the school decide what was right.", "NAH - I was raised by a diabetic and taught that if I ever saw insulin pens or hypodermic needles I should dispose of them safely, especially if they seemed used. You never know what could happen if someone else came by and hurt themselves with it. But you probably should’ve just turned it in to the school instead of taking the needle off. That way the school could’ve handled it and Molly wouldn’t have any reason to be upset with you.", "Nta. And call the parents about how they can send their kid to school with dirty needles and to teach their kids to not leave an open needle laying out in the school yard.", "Info: outside the gate where? Was it just sitting around or was it sitting in her belongings?", "You found an insulin pen and screwed of the clearly used (and unhygienic) needle.\n\nThe owner was angry because she had no needles left (which is poor planning on her part).\n\nShe also did not say thank you for finding her pen and returning it.\n\nYou gave her a few needles of yours. That's the moment where she's supposed to say \"Thank you\" instead of remaining angry.\n\nNTA", "YTA! You should have turned it into the school nurse. It is very common for people to reuse their needles because they cannot afford to use a new one for each injection.", "NTA. If she needed her insulin and wasn’t feeling well, she probably couldn’t totally help her reaction but it also wasn’t right or okay. You did a nice thing", "Yta!! T2D strictly on  insulin due to pancreas damage and surgical removal of 32%.  I use Novalog pens and I DO use my needle for the whole day and switch out to a new one each night. AND! This is by my endos own suggestion. First thing you did wrong was to even open it. You should have gone right to the school nurse.", "YTA - not all people can afford diabetic supplies. Type 1 and 2 runs in my family and unfortunately these supplies are unaffordable and are reused and few times before we switch to new needles and lancets. It’s kinda choosing between going hungry which impact’s glucose levels or not having the supplies to test or administer insulin. And we live in the USA. Next time take over to the nurses office to handle.", "YTA, I’m a T1D and if someone did that to my insulin pen, I’d be pissed too. If you found a test kit, would you check to see if the lancet was used or not?", "How were you to know whose pen it was when no one was in sight? You were about to bring it into the school when Molly appeared and confirmed the pen was hers. Why she was angry with you for taking the needle off is puzzling. You offered to give her a few of your needles (are they all uniform in size?), and that was very generous. NTA.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI was on my lunch break at school today. I was literally just outside the school gate when I saw what looked like an insulin pen (I am a diabetic) I thought perhaps it was empty, it had just under 100 units left and there was a needle on, it was slightly twisted which indicated it had been used before, which is unhygienic to use again, so I screwed it off. I was about to hand it into the school when a girl (lets call her molly) walked in the school very upset and appeared anxious, I then realised that molly too is a diabetic. I asked her if she insulin pen was hers she said it was. She came up to me ten minutes or so later FILLED with rage because I screwed off the needle, I mentioned how it was unhygienic to reuse a needle and how it puts her at risk for infection, still she was angry because she “had none left on her” so I gave her a few of mine, she was still very angry. AITA for keeping myself safe and her for screwing off the needle?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Please put spaces between Y T A because the bot will count it as a vote.", "It was right outside the school gate on the ground no belongings aka a bag or a jacket in sight almost as if it fell out!", ">I was about to hand it into the school when a girl (lets call her molly) walked in the school\n\nReusing needles to save money happens, yes, but it's most certainly not recommended, and considering OP found it unattended outside, the needle was definitely unsafe for her to reuse at that point.", "From what the post sounds like, OP found it on the ground or something. Maybe if she had kept it sanitary, yes, but if you lose a needle in a random place you probably shouldn't reuse it.", "We have free healthcare in uk so we don’t need to buy supplies plus the fact that it was found on the ground so the needle was clearly dirty even after being used multiple times", "In the uk we have free healthcare so we don’t need to buy supplies etc", "We have free healthcare in the uk so it’s not a matter of cost, plus the fact is that it was already on the ground uncapped so it was most likely unsterile and I could tell it had already been used multiple times, as an apology I gave her a few needles of my own", "EXACTLY!", "It was a used needle at a school. There’s NOTHING to be done with that other than be thrown away. The girl should have kept her own shit on her and shouldn’t be reusing needles even on herself.", "If you think reusing needles is safe then you seriously need to chat with your doctor about why that’s extremely unsanitary and dangerous.", "Well it was a used needle UNCAPPED ON THE GROUND if you are willing to reuse it that’s a huge issues and since OP lives in the UK money to get new needles isn’t an issue the issue is the parents not getting her new needles", "Depends on if the needle was capped or not.", "Needles can be sterilized. Sometimes, people have limited options. It sounds like this was the girl's only needle. That means she doesn't get insulin today.", "What if you weren’t diabetic/didn’t have additional needles to give the student? You could have put her in a really shitty situation having no way to administer insulin.", "Nothing indicated this post is from the UK.", "If you think skipping insulin shots is safe because you cannot afford a new needle for every injection, you need to have a chat with your doctor as that is dangerous and can lead to your death. People do this every day in the US.", "Or….she’s a child who happened to not have any extra needles and could have been put in a pretty compromising position having no way to administer insulin.", "That does not matter. She lost track of it. Anything could have happened with it since she lost it.", "OP gave her replacement needles, though, and there's still no reason to be angry at a random person for throwing away a used needle. Do what you gotta do, but if it goes against common sense you can't be mad at someone who was basically trying to look out for you.\n\nEdit: assumed gender", "There’s ways to get free needles/healthcare. like OP who gave the girl a handful of them. It’s work to get free stuff but it’s possible. Especially for diabetes supplies. Also, I’d love an explanation of how that justifies her leaving a used needle at a school for someone else to get poked with.", "Hence why I said HER PARENTS in my comment about needing to get new ones. Also obviously they don’t check to make sure she has the clean needles she needs which is a huge failure on them but the child was given brand new needles from OP.", "These insulin pens aren’t just uncapped, they come with a cap. And what if someone else who found the pen and decided to throw it away didn’t have compatible insulin pen needles (extremely likely)? The girl, whose insulin pen OP decided to throw the needle from, would then have no way of administering insulin while at school that day, which is a serious issue. \n\nBottom line is OP should have just minded her own business.", "Did you miss the part about it being a school? With kids ? Kids like to play with things they shouldn’t. Teens included. Not everybody knows needle safety, a cap is not 100% guaranteed. And is STILL not a good enough excuse to just leave it. Try harder if you’re going to change my mind.", "If you read the OPs comments it was UNCAPPED on the ground and they are in the UK so they don’t have to pay for the needles. So that girl’s parents need to get her an appointment or something to get new needles.", "Lol you try living with the disease and having to remember to have backups of everything you need to survive is easier said than done.", "I do have a disease that I have to take medication for guess what I have one at work, one in my car, one on my nightstand, and one in my bathroom and a backup for trips.", "Lol taking a pill is much different than being a T1D, you’re really showing your ignorance here", "Never said I took pills but good thing for assuming"]}