{"id": 17687, "submission_id": "13m97tn", "title": "AITA for calling a coworker trying to set me up a bitch", "selftext": "I 24M have a best friend 25F, she's the closest thing I have to a sister and I've known her since I was 4. We ended up going into the same field and work at the same business. We do editing stuff for movies. One of coworkers (33F) made plans with us and some of our other coworkers to hang out at a bar. I'm an introvert but I try to socialize so I went, me and my friend both get there only to learn that everyone else has canceled leaving us at the bar. Neither of us drink (I have a hatred for alcohol and refuse to drink it, she just doesn't like it) so we both just kinda left. \n\nIn the morning my coworker sends me a bunch of texts and is pissed, apparently, she had tried to set me and my friend up and had prepaid for drinks for us. Idk why she would set us up because my friend is lesbian, and very vocal and proud about it, like wearing pride pins to work and a scarf that's the colors of the leasbian flag to work if it's cold. She's the most lesbian lesbian that's ever lesbianed. I have been a wing man, more than once for her. So I'm not sure how my coworker thought she could get her together. So I asked her and she said that if she got some alcohol in her that she'd sing a different tune \"considering how close we are\". I asked her what she was trying to say, she laughed, called me dense and said any girl gets loose with some beer in her. I told her to shut her \"homophobic bitch ass up\" and that if she ever pulled something like this again I'll report her to HR. And hung up. Since then I've been getting texts from our coworkers calling me an ass and an idiot for not taking the chance she bought me. They're all dumbasses but I'm wondering if I was too harsh with my coworker", "created_utc": 1684533880, "permalink": "/r/AmItheAsshole/comments/13m97tn/aita_for_calling_a_coworker_trying_to_set_me_up_a/", "score": 514, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I called my coworker a bitch over texts and now our coworkers all hate me\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA - The only thing you did wrong was not taking this to HR immediately. I think you and your friend need to discuss this together with HR, because it mainly seems targeted at her and trying to “fix” her sexuality.", "NTA - only thing I'd suggest is report them to HR, that's highly unprofessional behaviour and I'd be willing to call it homophobic. To any extent what they did was honestly way out of order and HR need to sort it out, regardless as to whether the homophobia was addressed", "NTA.\n\nThat's disgusting of them. I thought they had misread the situation and it would've just been pretty uncomfortable but it's worse than that.\n\nYou were being encouraged to take advantage of her while she drank.\n\nThis already should be an HR problem. Hopefully the exchange was over text so it can be easily proven. This is horrifying.", "NTA\n\nThis woman basically tried to get your friend SA'd by setting up a situation where she wouldn't be able to consent and might have sex with someone she didn't want to have sex with.  I would absolutely let HR know.  Don't necessarily file a complaint, since this occurred outside of work, but get the incident on record that she disrespected your friend's sexual orientation and encouraged you to take advantage of her in order to turn her straight.  I wouldn't be surprised if this isn't the last time something like this happens.", "NTA\n\nI would go to HR as soon as possible. You're very right, it seems homophobic as hell.", "NTA. Wow, how can anyone be that ignorant. Please contact HR. You didn’t start this, you are not in the wrong and sounds like they need to sort out that workplace once and for all.", "''She's the most lesbian lesbian that's ever lesbianed''\n\nmade me chuckle\n\nNTA in this situation...why people just don't mind their own business?", "NTA she deserved it 100% and she and the other coworkers texting you are assholes", "**NTA** You sound like the type of ally I try to be and which we all should be. You absolutely were not too harsh, but you should probably consider mentioning this to HR to bring it to their attention. What this coworker did to you was completely wrong, homophobic (as you know), and has now resulted in harassment by your other coworkers. I would not let this slide.", "NTA.  OP was generous to let this go initially, but the repeated harassment has made this an issue for HR.  Document and save everything and schedule yourself a meeting.  I know the saying \"HR isn't your friend\" exists.for good reason, but considee the facts:\n\n1. Coworkers tried to encourage a drunken hookup between colleagues;\n\n2. They made insensitive comments about friends sexuality:\n\n3. They are repeatedly harassing OP, possibly on company time using company devices \n\nThat is a near perfect poop storm of potential risk, liability, and bad PR for the company should it get out and any one of those things is an actionable offense at any good conpany.", "NTA- please let HR know that your coworker basically told you to get your friend drunk and take advantage of her .", "They are your coworkers, they can kick rocks and fuck off about your personal life. Seems like she has done that before if she said it like that, makes me wonder how many times she has done that before", "You were NTA to the coworkers who were masterminding a date-rape? What was this plan?", "NTA. \nFirstly, she took a gamble pre-paying for drinks after her shitty set up plan fell apart. She can't be angry at you for this.  \nSecondly, she either doesn't know you two, or consciously chooses to ignore what she does know - otherwise she would know that you both don't drink and are not sexually compatible. \nThird, trying to suggest that getting someone drunk enough.. ugh.. I can't even finish that. \n\nThe whole situation is just gross, and she is a pretty disgusting person in so many ways. \n\nAlso the other colleagues are filth too. I would not want to be drunk around them either, not a safe situation.", "NTA. But you need to go to HR NOW. This is really bad. They may do it again with someone else. And the way some people are speaking about \"missing the chance she bought you\" sounds like your friend is in danger.", "NTA- report this to HR now so it stops.", "Definitely NTA for being pissed off, but escalating like that is typically a good way to lose a job. If a coworker runs you up the ladder for that they could definitely paint you as T A and get you into a hearsay battle.\n\n100% agreed that coworker is a homophobic bi**h though!!", "NTA, but it's kind of funny to call a coworker a b\\*tch in the same breath as threatening to report them to HR :)\n\nIt's also weird that so many people really thought that this setup was an opportunity for you. I mean, if you've known each other forever, then you've had all the opportunities you ever needed.", "**NTA**\n\nI would simply reply to each text with \"Let's find out HRs opinion.  I'll show them these texts.  Be right back.\"\n\nSee what their reaction is.  I bet they STFU with a quickness.", "NTA but you should report it to HR anyways especially since she escalated it by telling everyone", "I was one of the good HR people and I dealt with some stuff (got burnt out). In the perfect world, you would feel you could go to that person in HR and let them know, all in a calm voice, no screaming. When anybody is dealing with a situation, from the beginning, write everything down. Who, where, when, and what it was about. Was there witnesses? Do you have proof, like texts, VM, email? Do it as soon as possible, so won't forget anything along the way, like a date. \n\nNo brainer, this is against the law. Your friend is protected under the law regarding her sexuality here in the USA. You/she/both should talk to your manager. If you do not feel comfortable talking to them, talk to HR. Retaliation is not allowed. If the company does not address it, that is legal grounds for a lawsuit. What has happened at work is very crucial to document.  There are lawyers out there who can help, even if low income.", "You need to go to HR now. Not if it happens again. NOW. What she did was way beyond common sense. In fact, her doing this could be considered workplace hostility towards your friend (protected class).  \n\nNTA. \n\nSave all those texts. Talk with your friend, and go to HR together. Your coworker’s behavior was disgusting.", "NTA - good for you for saying what needed to be said and standing your ground", "NTA but report this to HR NOW. They were basically setting it up for you to date rape your friend and they might do it to her again with someone who ISN'T safe like you are. Report it to HR and tell your friend about what your coworker said so she knows to be on guard!!!!", "NTA!\n\nAnd what the...? Why would they try force a lesbian to hook up with man? And a man to hook up with a lesbian? \n\nDon't even wait for the next time, OP. Go to HR and show all the messages you've been getting.", "WTAF with that effed up workplace. Get yourself and your friend to HR as soon as you can. That is all the flavors of the rainbow messed up. \n\nAnd by the by, NTA.", "Somewhere between everybody and nobody is TA.\n\nEveryone is taking this way too seriously. The co-worker tried to set you and your friend up, based on some silly presumption about the way sexuality works. And was way way too upset when you left early. You were way too upset that she tried to set you up with a lesbian. \n\nThat was an awful lot of anger on both sides behind a convoluted \"you two would be good together\".\n\nI guess I'll have to go with an ESH, but even a AITA \"asshole\" is too much for a hook-up that didn't happen.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI 24M have a best friend 25F, she's the closest thing I have to a sister and I've known her since I was 4. We ended up going into the same field and work at the same business. We do editing stuff for movies. One of coworkers (33F) made plans with us and some of our other coworkers to hang out at a bar. I'm an introvert but I try to socialize so I went, me and my friend both get there only to learn that everyone else has canceled leaving us at the bar. Neither of us drink (I have a hatred for alcohol and refuse to drink it, she just doesn't like it) so we both just kinda left. \n\nIn the morning my coworker sends me a bunch of texts and is pissed, apparently, she had tried to set me and my friend up and had prepaid for drinks for us. Idk why she would set us up because my friend is lesbian, and very vocal and proud about it, like wearing pride pins to work and a scarf that's the colors of the leasbian flag to work if it's cold. She's the most lesbian lesbian that's ever lesbianed. I have been a wing man, more than once for her. So I'm not sure how my coworker thought she could get her together. So I asked her and she said that if she got some alcohol in her that she'd sing a different tune \"considering how close we are\". I asked her what she was trying to say, she laughed, called me dense and said any girl gets loose with some beer in her. I told her to shut her \"homophobic bitch ass up\" and that if she ever pulled something like this again I'll report her to HR. And hung up. Since then I've been getting texts from our coworkers calling me an ass and an idiot for not taking the chance she bought me. They're all dumbasses but I'm wondering if I was too harsh with my coworker\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "I guess I'm confused how any of her plan was supposed to work but ...Unless you're leaving out some details, I think your co-worker means that your best friend would like to lesbian with you and she tried to facilitate that.\n\nI mean, NTA. She was out of line but I'm not sure that she's being homophobic. I think she wants you to date your BFF. Or at least sleep with her.\n\nETA: I was going to comment about how this read funny to me like \"my coworker tried to set me up (implied: with) a bitch (girl)\" but that's exactly how this read. To me.", "Did I comprehend this correctly? They tried to set you up with a lesbian you have known since you where four? So they tried to get you to hook up with your sister? Is that correct? They are that stupid?", ">She's the most lesbian lesbian that's ever lesbianed.\n\nFor this, I say thank you :)\n\nBut really, NTA.  They took it upon themselves to assume a relationship that wasn't there and that's fucked up.  \n\nLet's look at it from another angle too.  Say you weren't friends and that it was an older male coworker they tried to hook you up with -- and they tried to create a romantic situation by paying the tab?  Would she still say, \"Any girl gets loose with some beer in her?\"\n\nThis is sexual harassment.  Yes, it falls under that category because I just took a course about it as a new hire.", "NTA\n\nAnd it seems you work with a group of idiots. She was out of line for getting involved AT ALL with your personal life.", "NTA..\n\nThe only thing you've done wrong so far is not reported to HR.", "NTA\n\nDon’t go to HR if she does something like this again. Go to HR NOW.", "NTA and i would save all the evidence of The coworker and the other coworkers homophobic statements. You need to contact HR immediately. Like others have said, you are also being abused and can take it to HR yourself. You are seriously asking if you are the AH??? You said the right thing. Homophobes should be fired. Your friend will have legal grounds to sue.", "Some posts make your jaw drop and this is one.\n\nI'm frankly disgusted. She sent you up with a lesbian friend hoping that if your friend got drunk she would sleep with you? WTF? \n\nGo to HR. This crosses a line and then some. And instead of self-reflection she is involving your dense co-workers. Wow, NTA", "I'm waiting until later to contact my friend because it's her day off and she's one of the people to sleep until 2pm on her day off so she'll be asleep for like 4 more hours lmao", "Also, promoting r*pe culture by trying to get coworker drunk so he'd have a chance.", "Right? Let's go over the (quite frankly horrifying) assumptions these people made about both of them here:\n\n-That OP's friendship with this woman isn't genuine, and he was just waiting for a chance to get in her pants and \"prove her wrong\" about her orientation, consent be damned.\n\n-That this woman is either lying about being a lesbian, or at least could be browbeaten into not pursuing sexual assault charges if she was drunk.\n\nThis needs to be an HR problem like, yesterday.", "Because they obviously don't believe the friend is a lesbian. Maybe they think she just needs to \"find the right dick\". Disgusting attitude.", "I didn't read it as OP being angry at being set up with a lesbian. They're angry that the coworker doesn't respect their friend", "No, you are reading it wrong. Someone decided that they should take matters onto their own hands and get a lesbian woman drunk enough so she can fuck her male friend. Because every woman turns straight after a few drinks. \n\nOP is not angry because they tried to set him up with \"a lesbian\" but because his colleague expected him to fuck a drunk woman who trusted him.\n\nAnd then many other colleagues started berating him for not taking the chance to fuck a lesbian, I guess.\n\nHis friend is in danger.", "I’m also trying to figure out why they all have this kind of relationships with their coworkers? Like a bit glaring red flag here is the drinking amongst coworkers. Clearly it happens often enough that they all feel entitled to each others personal lives. That’s the big thing that needs to be addressed, imo.", "It's a little hard for her to lesbian with me when I'm a man", "Here’s the thing OP.  You were victimized by the coworker’s homophobia.  You can complain to HR on your own account and it should be handled.  I would suggest going this route and encouraging your friend to do the same thing.\n\nNTA", "Yeah of course that needs to be sorted too, I don't know why I just threw that with the 'way out of order' comment, that's my bad. Definitely needs addressing and potentially suspension or straight up being fired", "Or that homosexuality can be cured if they find the right man or woman... tied into the fiction that being gay is a lifestyle choice.", "It was sold to us as \"a chance for you huys to hang out and get to know us all\" both of us started working here around 3-4 months ago", "My bad. I have a short attention span. No wonder that didn't make sense.  \nI mean...it still doesn't make sense but she's way further out of line than I thought.", "Oh, I agree with what you said. I was just adding. There are so many things wrong with this situation.", "Exactly. This friend is in huge danger.", "NTA \nSo they tried to give you an opportunity to sexually assault your friend?????\nThat's messed up, you should let your friend know not to trust these people since they're so willing to put her in danger.", "NTA.  Report it to HR NOW before your coworker gets a chance to report it and spin it so she looks like the victim.  Don't wait for your BFF to wakeup do it now!  Report the other coworkers that sent you those texts as well.  None of their behavior is okay.\n\nHere's the other appalling thing about what your coworker did with prepaying for drinks: She didn't know if either one of you is a recovering alcoholic or if one of you was on medication that could make drinking alcohol *extremely* dangerous if not deadly.", "Nta. Report her to hr now, not later.", "NTA.   If a man did and said all those things your co-worker did, they would be called a bigoted chauvanist  and worse. \n\n Even though you are like siblings, your friend is lesbian, and you don't drink, this co-worker thought is was OK to set you up at a bar?  Then she says the complete opposite of all the women fighting for accountability in the me-too era and suggests that getting your friend drunk and having sex with her would be acceptable? \n\nIck on so many levels.", "Holy shit what the fuck. Your coworker was literally planning for you to SA your friend. That's so unbelievably fucked.", "NTA - as a lesbian, those comments from your coworker are horrifying and I'm very glad you shut them down immediately.", "NTA I would've said worse. They don't like the fact that you and your friend are just best friends and except you to be together despite her being a LESBIAN! It was stupid, weird and just overall gross. I would tell all of them to fuck off.", "NTA but you should contact HR anyway.\n\nNot only does she appear to be trying to \"fix\" your friend's sexuality, but she also openly indicated she intended for your friend to get drunk so you could take advantage of her. If someone needs alcohol to show interest, they aren't interested. That was an extremely fucked up thing to do.", "Just remember, the role of HR is to protect the company from the employees.", "NTA but don't wait to get HR involved.  Do it now.  They're harassing you AND your coworker, and all but straight up admitted to trying to get you to take advantage of your friend.  This is so far out of line it NEEDS to be addressed now.", "NTA and at this point report them all because I would quit. No way I could still work with her or the other people texting me. I would give everything to HR along with my notice and request not to work.", "NTA but you should go to hr regardless.  That woman is vile and dangerous.", "NTA\n\nAh yes my friend welcome to women, in the workplace.\n\nFemale customers would make comments such as \"Oh hes so handsome can I get a serving\" when I was 3 metres away and the only male on shift. Serving of what... you've already ordered... 2 minutes ago.\n\nFemale co-workers would think it was funny and I was being an asshole for not wanting them in my section.\n\nThat i should he grateful some 5/10 was commenting on my appearance, *Thank you Sendai, you're word of wisdom truly brighten my day* gtfo.\n\nOh sorry I didn't realise it was my job to fuck the customers. Reverse the roles and the attitude is *Omg what a pig* and then ask me to address the sexual harassment. \n\nThe duality of man. Lol.", "NTA\n\nBut your coworkers are. That's like that tired old, \"She just needs the right man,\" bs. Good for you respecting your friend's sexuality and standing up for her. Damn. I'd report them all to HR.", "Yes, boundaries need to be set, now.\n\nReport her.", "Even worse is that coworker didn't know if OP or their friend is a recovering alcoholic or if they are on medication that makes consuming alcohol extremely dangerous or deadly.", "I feel like this should become a lesbian ballad some how.", "Screenshot those texts your coworkers might delete them and gaslight you/HR that they ever said such things", "Definitely call HR ASAP.  A former co-worker of mine was fired for calling me a bitch in front of witnesses. (No, I wasn't a bitch--OK, I can be, but in that instance, he was angry that I was promoted over him.) The funny part was that the guy who was the witness, a friend of mine from office services, would come by my office for years afterward and whisper *\"Bitch!\"* and we'd laugh and laugh. The guy fired was terrible in many ways. Anyway, don't let this person turn it back on you. She was very, very out of line for what she did, and for what she said.", "do your coworkers know that she basically told you to rape her? \"any girl gets loose with some beer in her\" so get her drunk enough she can't say no? she's disgusting, not just homophobic. and I'd report her to HR, neither of you even drink.", "Yeaaaah. Let's say someone other than OP was set up with OP's friend (or any other woman) and those things actually happened because person C wasn't as decent of a person... This definitely needs to go to HR ASAP.", "I mean new world you could change that up?", "This is exactly how that statement about the beer reads to me. I am disgusted, and many other things about this post.", "Jesus Christ! Are your co-workers actually upset because you didn’t appreciate their attempts to get you to date rape your friend?!!!   Document this with HR just to have a record in case you need it and let your friend know that they tried to do this to her.  They’re dangerous ah’s!", "As a fellow most lesbian lesbian that has ever lesbianed NTA", "Oh my god, she basically alluded to you that she tried to set up your best friend to be taken advantage of, and by YOU. NTA. Personally I think you’re under-reacting. She’s homophobic at best and a would be accomplice to sexual assault at worst. (I am not saying you would have done that, but that’s clearly what she was hoping for. You sound like a stand up guy/ friend).", "NTA and report her to HR right now!  That stunt was harassment on another level altogether.", "REPORT TO HR IMMEDIATELY\n\nNTA", "NTA.", "NTA. You were not harsh enough if she has others chiming in with that crap too.", "NTA Yeah, you snapped and used unprofessional language, but it was understandable under such unprofessional (and creepy and really homophobic and bordering on criminal!) behavior by this coworker.  I agree with informing HR (if nothing else to get ahead of her doing it!), informing your friend about it, and offering to support her going to HR as well.  What gross behavior from this coworker!  The entire story kinda turns my stomach.", "NTA\n\nAlso getting someone so drunk they consent to something they wouldn't if they were in their right mind is legal rape.\n\nSomeone is legally incompetent to consent if they are that heavily intoxicated or the consent is dubious at best, and the fact she tried to set up your friend to be raped while compromised is beyond fucked up.\n\nYou should absolutely report her to HR because the 'all girls change their tune' thing sounds like she's done this before.\n\nAlso report her for getting other coworkers to harass you afterwards, show them the texts.", "NTA. They wanted to get her drunk so that she would sleep with you? Did I read that right? Go to HR. This is disgusting behavior. And they all provided you with text proof. Everyone involved needs to be fired!! I want to fight someone for both of you right now. Please report this. For your friend's sake, if nothing else, because they will try it again with a different guy. Good luck.", "NTA - TAKE HER TEXTS AND REPORT HER TO HR NOW. What she said is out of line, and in no way should you be working with that kind of mindset. \n\nYou made me and my bestie laugh our asses off over \"most lesbian lesbian whose ever lesbianed\". Love it!", "[removed]", "Don't wait; report her to HR now.", "NTA, it's pretty disgusting that they all somehow think it's ok to try and pair a lesbian with her guy friend just because in their mind her lesbianism isn't concrete.", " NTA", "NTA so your coworker attempted to get your friend drunk so she would sleep with you, she attempted to date rape your friend, and you haven't already brought that to HR?", "Setting up co-workers is a no.\nSetting up close friends is a no.\nSetting up a man with a lesbian is a giant no.\nAll of the above by attempting to get them drunk is a giant hell no what is wrong with you for even thinking this???\n\nNTA, OP.  As others have suggested, contact HR ASAP", "Wow! You're definitely NTA but that coworker sounds like one toward your bestie! Trying to put her in a position to possibly have her consent violated by a lifelong friend?! I would go to HR anyway, and suggest company policies on this topic be publically addressed, so everyone had a reminder to not be innapprpriate As. 🤷‍♀️", "That is so so gross 🤢 I don't want to come off as slut shaming but that coworker needs revaluate her choices if she says all women get loose with some beer", "YWBTA if you don't report the coworker for this. This is disgusting. She told you to r@pe her.", ">So I asked her and she said that if she got some alcohol in her that she'd sing a different tune \"considering how close we are\". I asked her what she was trying to say, she laughed, called me dense and said any girl gets loose with some beer in her.\n\nDisgusting. Absolutely NTA, you should report her NOW.", "NTA\n\nShe is lucky you didn’t call HR right then & there. Your co-worker’s behavior is not just homophobic but insulting to you as well.", "NTA- Go to HR right away. Show them all the messages you got from all those homophobes. They are bullies", "She tried to set up two co-workers. She tried to manipulate someone based on her disapproval of being gay. She tried to push two people who don't like alcohol to drink. She stated in a text you should take advantage of someone impaired by alcohol. And now has damaged your reputation by telling the other co-workers who knows what.\n\nGo to HR. Now.\n\nNTA.", "NTA. I mean your coworker needed to stay in her lane in the first place. Even if your friend was straight/bi and potentially into you, it's not her place to play match maker. But lo ad behold, your friend is NOT into you - guaranteed. It sounds like your coworker knew that and still thought that \"maybe the right d\\*\\*k would fix that.\"   \n\n\nThat's extremely homophobic. I would've reacted the same way as you did to be honest, and I probably would've said the same thing. Pretty much right on point \"I don't care if you paid for drinks, I didn't ask you to and I didn't tell you I wanted to be set up either. Stay in your lane and mind your life.\"  \n\n\nHer and the co-workers defending her need to step off. I would report them.", "Nta but uhm.. was she insinuating you could *rape her* after getting her drunk?? Cos that’s what it fuckin sounded like. “Girls loosen up after a few drinks” sounds a lot like getting girls drunk so they’ll fuck you.. fucking yikes you need to report her ass to HR anyway", "Wow. The homphobia is deep. NTA. Though, workwise maybe not the best call.", "NTA. \nIt's scary that she and your other colleagues wanted you to and are pissed at you for not taking advantage of your best friend by getting her drunk and basically raping her. Firstly, I would have been so offended that they believed you were capable of something that heinous. Your coworker is homophobic and evil, and you just learned that many of your colleagues are okay with daterape. it's not a safe environment for your BFF. I hope you guys take this to HR.\nLuckily, some of the morons admitted to their plan while harassing you on texts.", "And saying it was fine for him to get her drunk and take advantage of her. Nice date rape planning there by the coworkers.", "It's not too late to take this to HR. This is low as low can go.", "This", "And not only is she trying to “fix” her sexuality, she’s also trying to pimp her out! This is disgusting. Report her and anyone else harassing you about it!\n\nNTA", "Her comments are incredibly homophobic and she implied raping his friend, get a fucking grip.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "It’s also just so rape-y tbh. She wanted you to get your friend so inebriated she slept with you-something your coworker herself admits your friend wouldn’t do sober.", "I don’t think that’s what they were implying, the first comment being that “she’d sing a different tune” after some alcohol implies that they meant she’d be attracted to him. It’s extremely homophobic and needs to be addressed, I don’t think trying to stretch it into something more is beneficial to OP’s case.", "If it’s a one time thing then okay, but I’d be really wary of getting used to doing things like this with coworkers (or making friends coworkers) overall. Having lines between work and personal is what helps limit the chance that you might say something like “bitch-ass” to a coworker.\n\nNot rendering judgment on this, just overall making commentary that y’all are way too comfortable with each other to be making comments on dating lives as coworkers."]}