{"id": 17752, "submission_id": "13mrsed", "title": "AITA for throwing away my mom’s sandwich", "selftext": "My mom always packs a snack whenever she travels- usually a ham and cheese sandwich. I was driving her to the airport this morning and on the ride down it came up that she hadn’t had time to go to the deli and had packed herself a tuna salad sandwich instead. I asked if it was to eat in the airport- nope. She’s saving it in case she gets peckish midair. I tried to tell her that tuna isn’t something you should really be eating in close quarters with recycled air, that the smell would probably bother other people. She was adamant that there was nothing wrong with it. I told her that if I was on that plane it would bother me. She didn’t budge. So while she was unloading her luggage from the trunk I snuck the sandwich out of her carry on and tossed it in the garbage. She didn’t notice until she got through security and then I got a pissed off text. I told her to get something in the airport and I’ll pay her back but tuna really isn’t a plane friendly snack. am I the asshole?", "created_utc": 1684588594, "permalink": "/r/AmItheAsshole/comments/13mrsed/aita_for_throwing_away_my_moms_sandwich/", "score": 72, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I threw away my mom’s sandwich without her knowing, depriving her of her snack and wasting food\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YTA. There was no need for you to do that and it wasn't your decision to make. Your mother is a grown woman and can eat whatever she wants without your permission.", "Not your place to touch someone else's food.\n\nYTA", "You threw your mother’s food away because you were more concerned about strangers feelings & comfort? No happiness for you today Mom... I have to protect all these people who I do not know & will never see!\n\nShe’s an adult, she can make her own decisions. She wouldn’t be the first & wont be the last to eat something smelly on a plane. They don’t throw people off of planes for eating. You did nothing but needlessly upset your mother. You’re not the hero in this story. \n\nI would have bought another tuna sandwich at the airport, with your money & sent you a picture of me eating it on the plane. You cannot control other people. It’s not kind. \n\nYTA", "YTA for throwing out something that's not yours.", "YTA.\n\nYour mom is capable of making her own decisions and you aren’t the food police.", "Yes, YTA. You're right that tuna isn't the most flight-friendly sandwich, but you don't just throw someone else's food out!", "Why tossing perfectly good food? Also based on how it is prepared, it will barely smell. Also, did you know that plane companies often offer fish sandwiches as well as warm meals that smell way worse than those?! YTA.", "YTA, I see your point but ultimately it's not your sandwich, not your life, not your plane, not your problem.\n\nGoing behind your mom's back wasn't cool.", "YTA Never play with ppl food.", "YTA of course. You can't throw away other people's stuff cause you think it's best.", "yta", "YTA. It's not on you to police what your mom eats.", "It was her food to eat you shouldn’t have thrown it away. \n\nTuna wouldnt be my first choice of a snack for the same reasons but it wasnt your choice to make. If anyone on the plane were to complain   thats her situation to deal with. \n\nYou probably know deep down it wasn’t right to have thrown out her sandwhich. I hope you’ve apologised to her .", "YTA\n\nYou are also a control freak, my god, your poor mother having family like you controlling what she eats and where.", "YTA. You voiced your opinion (and to be fair, you had a point). But you treated your mom like a child and you behaved in a sneaky and deceptive manner.", "YTA. I understand your intentions, but you won't be on that plane. It isn't your business. And you threw away perfectly good food. Your mom is an adult and can make her own choices.", "YTA \n\nNot your food, not your thing to throw away. \n\nDid you miss learning that in school?", "YTA \n\nYes tuna can smell, but guess what? Airlines serve it  themselves!!  \n\nDon't throw out people's food and reimburse her for the cost of the sandwich plus whatever she had to buy in tge airport at their price gouging prices.", "YTA-way out of bounds!!! \n\nI agree with you that tuna on a plane isn’t a good idea. But maybe she would have heard you and reconsidered. Based on the conversation, she could still choose to be extremely careful with it (wrapping it up between bites or not eaten it mid-flight at all). \n\nYTA-for preemptively assuming she was going to be an AH. The ESH comments bother me for the same reason. Mom doesn’t become an AH until she unwraps an actually smelly sandwich while on the plane.", "All I can think is... Damn OP would you like hate Asia. All sorts of smells here.", "YTA \n\nWhat gives you the right to do that? I’m not trying to be rude, but my God.. who gave you the right to be food  police and decide what is offensive? Granted, tuna does smell, but for you to clutch the pearls and decide what is “offensive “ to others, is a big stretch. You’re acting like she was hoisting a bottle of fart spray. You should have told her you threw it out and gave her money so she can buy something else, what you did was pretty mean. I hope she’s not diabetic", "YTA and basically told your mother pay $30 on plane or at airport for same size tuna sandwich she made basically for like $3-$5 at home. Your mother is not wrong to cuss you out for messing with her food & wasting her money like that because airport/airline food is not fulfilling & its super expensive.", "YTA it wasn't your business and not your place. Who cares if she slightly inconveniences the other passengers. I get the feeling you're the type of person who worries too much about what other people think.", "YTA. That wasn't yours.", "YTA. Just insane behavior.", "info: Why are you treating your mother like an incompetent fool?", "sounds like OP is salty she didn't get to go on the flight herself and yeeted the sandwich instead lol", "you just dont touch or throw away other people's propierty without being an AH. You disrespected her, no matter hoow much money you throw her way.", "So I assume this entire post is a group attempt at trolling. I refuse to believe there are so many stupid people concentrated in one place.\n\nEasy YTA, I've been eating tuna salad sandwiches (yes, boxed to go at a deli) for years and had ***zero*** people complain ever, because - surprise surprise - they don't smell.\n\nDid people learn about the world from cartoons? You know those **visibly** green smells they show in Tom&Jerry? That doesn't happen in real life, people.", "YTA", "YTA. Don't fuck with other people's food", "YTA. You do not have the right to throw away someone else's food. I'm immature enough that I would never ask you to do anything for me again. Ever. And I'm rethinking the will.", "Um ya YTA. It was none of your business.", "You chose some strangers over your mom. Lame.\n\nI’ve had to smell weird food and baby poop on planes; I don’t judge. If people want, they’re free to judge your mom, who can make her own decision.\n\nBeing embarrassed over your mom is lame.", "This is controlling behavior.\n\nYTA", "YTA. You wasted food for no good reason.", "I thought you can't carry outside food onto a plane", "YTA. You assume other passengers would have a problem with tuna fish on the plane. Now if it was fish then yeah but it was tuna fish. \n\nYour mom packed something to full her up on the plane and because of your action she was left without.", "YTA! Your opinion on what is appropriate food for a plane trip does not matter. You should have NEVER gone into your mom's luggage without her permission, and you should not have thrown out her sandwich! \n\nFYI: I have been on several plane trips where fish was one of the offered meals.", "YTA.  You were an asshole for taking her food (not yours) and tossing it for something you weren’t involved in.", "Don't ask me. I like tuna and don't think a sandwich packed in mayo is all that smelly. We offer them late in the evening at all our ballroom dances. Also egg and salmon sandwiches which are equally smelly but extremely popular.", "YTA", "YTA\n\nJust because something would bother you doesn't mean it would bother everyone or even most people, and it certainly doesn't give you the right to steal your mum's food and leave her without a snack. And I say that as someone who literally has strong sensory aversions, particularly to scent. While tuna isn't everyone's favourite, it's not like cooking fish in a microwave, or sardines or something. \n\nA tuna sandwich isn't a POWERFUL smell, and most importantly it isn't a smell that lingers in the air, like perfume or something. I've literally ended up vomiting on airplanes from people using heavily scented hand creams or those sterilizing gels near me, because the fragrances linger in the air. A tuna sandwich might smell a bit fishy, but then it's gone. It's barely going to bother anyone. In fact, on more than one overseas flight of 10+ hours that I've been on, they offered tuna or egg salad sandwiches as \"help yourself\" snacks in the galley throughout the flight because they're considered fairly innocuous and widely-enjoyed by most people. Obviously I wasn't privy to all the hundreds of passengers on each Boeing 787, but as I wandered about to stretch my legs, I certainly didn't hear any comments or complaints, and most people seemed to happily reach for one or the other when they were offered.\n\nYou need to stop assuming that everyone experiences the world like you do. Even people who don't like strong smells don't necessarily mind the same smells you mind. YTA.", "YTA.", "NTA\n\nThank you for thinking of others.", "NTA i would’ve probably thrown up from the smell if i was on the plane", "ESH- Mom for bringing a smelly tuna sandwich on a plane ride. You for tossing her snack. I would have told her I was tossing her smelly sandwich and would zelle her some money for a less smelly snack so she could plan to get something. Might as well get the wrath in person instead of her fuming for the whole plane ride.", "NTA - You're a cot darn Superhero is what you are!", "I'm calling you **NTA** because you're a justified AH. To your mother, you're the AH; to the passengers on the plane, although they won't know it, you're a hero.", "If tuna sandwich is OP's idea of food that could bother people, I'm wondering what they think \"normal\" food is...a piece of plain white bread with a glass of water on the side for dipping?", "NTA you may have done everyone on a plane a big big favor", "NTA, you’re correct, you saved everyone on that flight", "ESH, her for being okay with stinking up a plane. You for making decisions for another adult.", "NTA you glorious utilitarian bastard. You spared a planeful of people from that reek. They serve snacks on planes anyway.", "YTA.   I would have no problem with the person sitting next to me eating tuna.  Not your call.", "YTA. I would resent someone eating smelly food on a plane too, but it wasnt your sandwich. You weren't even going to be the one affected by it for crying out loud!", "Surely you know YTA?", "Surely you know YTA?", "As someone who might have been on the plane with her, I salute and thank you. But technically you are both assholes. Her for inflicting that stench on an entire plane of unlucky passengers and you for throwing out her food. You should’ve let her get cursed out by her fellow passengers unfortunately. ESH", "NTA. Come on people, all you sluts saying y t a can go sit on a fishy flight for hours on end.", "Tampering with your mom's luggage without her knowledge while she was walking into an airport was ILLEGAL! You are very lucky TSA didn't see you do this on the security cameras, or you would have been in a world of hurt.\n\nYTA!!!", "YTA. This is an insane thing to do. Do you hate your mother or just the world's biggest tuna hater?", "NTA\n\nI cannot stand the smell of tuna", "INFO: How did she plan to get the sandwich through security?", "One of my friends is deathly allergic to seafood. He can’t smell it at all. He can’t walk by a fish market it. It all risks a reaction for him.  I concur that bringing seafood on the plain is risky at best and potentially dangerous. ESH - because you shouldn’t have just trashed your mom’s stuff, even though your intentions were right.", "ESH but now I'm waiting for an \"AITA for eating tuna on the plane bc ppl are making angry faces at me\" post. I'd honestly be more concerned about an unrefrigerated tuna salad with mayonnaise sandwich that has been sitting out...🤮", "You may be the ah for throwing away your mother's sandwich, but the people on her plane thank you 😀", "ESH, you for thinking it was okay to throw out her food and her for wanting to eat such a pungent food on a plane. Strong smells, especially those related to food, can give me headaches, so I understand and respect your concern for the strangers. However it doesn’t give you the right to throw out her sandwich, she’s an adult and needs to deal with consequences via angry strangers.\n\nUnfortunately the fact is that planes are a public space and thus it isn’t guaranteed that planes will be comfortable. Besides whats to say your mother didn’t buy a tuna sandwich again in the airport? You don’t have the right to tell her what she can and can’t bring, that is upto the staff at the airport. And even if they say no at the gate, they can’t force her to throw it out. She can choose to keep the sandwich and miss the flight", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy mom always packs a snack whenever she travels- usually a ham and cheese sandwich. I was driving her to the airport this morning and on the ride down it came up that she hadn’t had time to go to the deli and had packed herself a tuna salad sandwich instead. I asked if it was to eat in the airport- nope. She’s saving it in case she gets peckish midair. I tried to tell her that tuna isn’t something you should really be eating in close quarters with recycled air, that the smell would probably bother other people. She was adamant that there was nothing wrong with it. I told her that if I was on that plane it would bother me. She didn’t budge. So while she was unloading her luggage from the trunk I snuck the sandwich out of her carry on and tossed it in the garbage. She didn’t notice until she got through security and then I got a pissed off text. I told her to get something in the airport and I’ll pay her back but tuna really isn’t a plane friendly snack. am I the asshole?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA. \n\nIt’s tuna salad, not reheating some whole steamed red snapper with chili ginger sauce. No one’s gonna get steamed over a tuna salad sandwich.", "Apart from anything else, people are starving. NEVER throw food away, especially if it belongs to someone else. \n\nYTA", "Yta. Who throws away their mom lunch?? What a jerk", "YTA.  How is this even a question in your mind?", "YTA", "YTA. Your mom is an adult who is perfectly capable of making het own decisions and dealing with the consequences of them. Your judgement is not better than hers just because it’s yours.", "YTA, full stop. Tuna salad is literally sold on flights.", "Tuna salad was actually served on the last plane i flew with...", "She had no intention of being careful about eating it, she even agreed with me that the smell was strong but didn’t feel like that was her problem. I’m on the other end of the spectrum where flying already makes me nauseous so the sandwich smell plus flying was just my nightmare scenario.", "No, the only way to not be the asshole here is to **not touch other people's food**. Ever.\n\nNo \"throw it away and replace with something else\". No \"throw it away and pay them back\". Just don't touch their food, it's not so hard, assholes.", "That’s literally what I did and she’s not diabetic", "Sure do, I even return the shopping trolley to it’s right spot", "Because she is.", "They do smell. Have I ever complained to someone because of their smelly sandwich? No.", "I’m judging the mom, TA, making OP NTA", "You can", "> *\"I would have told her I was tossing her smelly sandwich and would zelle her some money for a less smelly snack so she could plan to get something.\"*\n\nThe thing is, adults don't need other adults to make those kinds of decisions for them, even if you give them money to buy something else. Telling a grown woman what she can and cannot eat (regardless of the reason) is just absurdly controlling and out of line.", "That is not YOUR decision to make for a grown adult! Espeically When you are not even on that plane! And the last plane i flew with actually served tuna salad so i dont know if bringing a tuna sandwich is such a horrible thing to do. If people can deal with smelly diapers etc they can deal with tuna..", "You do know they serve tuna salad on planes, don't you???", "Dude did nothing but steal his Mother’s food & hoped she wouldn’t notice. Not kind nor caring. \n\nYou realize she could have just bought another tuna sandwich in the airport, right? No crisis was adverted here. Just a pissed off Mom", "What law did OP break?", "Security allows food, just not liquids more than 4 oz in a 4 oz bottle.", "Then I suggest you don't fly because the food served on planes can smell! They even serve tuna fish salads and sushi on planes.", "I've had both tuna salad and sushi served on planes!", "Yeah cold fish isn’t super smelly and the smell doesn’t stick around long anyway. \n\nHeated fish is another story, but I remember getting bumped up to 1st class years ago and was served cooked salmon. So if the airline is serving it, I guess it’s fine. lol", "> *\"I’m on the other end of the spectrum where flying already makes me nauseous so the sandwich smell plus flying was just my nightmare scenario.\"*\n\nWere you going to be sitting next to your mom on the plane? If not, then her choice of sandwich isn't your concern at all. People eat all sorts of things on planes, even fish. If someone is *that* sensitive to different smells, then utilizing a form of transportation that requires you to be with large groups of people probably isn't the best idea.\n\nTelling a grown woman what she can and cannot eat is totally out of line.", "Okay, but I have SPD, and I'd rather sit next to someone eating tuna and sardines and a million kinds of smelly fish than someone wearing perfume or chewing gum or using floral hand cream, all of which are likely to make me full-on vomit.\n\nJust because a smell bothers YOU doesn't mean that the same smell bothers other people. I have full on sensory processing issues and massive aversions, but the smells that make me nauseated are sickly sweet ones and perfumes. Someone eating tuna salad next to me wouldn't bother me in the least. You don't get to decide for other people, just like I often have to live with MY nightmare scenario because it's not for me to choose other people's hand creams for them.", "You were not on the plane with her. Why are you so concerned about a plane full of strangers?\n\nFor all you know she bought another tuna sandwich at the airport. You can’t control other people.", "I agree that we know she had no intention, but could also be saying that to save face in front of her daughter. There’s a lot of time to think about this if you’re her. Plus, the fact that she noticed once she was through security makes it at least POSSIBLE she planned to eat it while in the airport. \n\nSaying something doesn’t make it fact. It’s not a sure thing until it happens.", "One of my friends is deathly allergic to seafood. That smell on the plane would have made it unsafe for him. He actually a seafood ban for his entire flore at work to stay safe. It is a legitimate worry. Tuna sandwiches have a strong smell in my experience. Even more so than smoked salmon.", "Who the hell do you think you are?", "Ok. Well, this is a tough situation.. I totally agree that tuna isn’t the best choice, but your original post said she didn’t realize you threw it out until she was through security… so .. I guess I’m misunderstanding? But what’s worth thinking about is, if she’d taken you up on the offer to buy something else in the airport, she may have bought tuna and your efforts would have been thwarted", "So do I because that's what you're supposed to do. There is no rule that says you can't take a tuna sandwich on a plane. If your mom is fine with the looks she may have gotten that's on her and you overstepped by throwing away her sandwich.", "Returning a shopping trolley doesn't involve stealing and discarding someone else's food. Give your mom at least the consideration you do hypothetical strangers ffs.", "That is standard behavior.", "And that makes up for being an actual thief?", "Shocked your mom doesn’t just throw you away", "Are you the OP under a different account?", "Definitely the OP which makes you really really lame and if course, YTA", "Oh, I'm thinking of foreign food items that are banned from carry-on and luggage travel.", "Opened up the luggage of someone heading into an airport without the knowledge and consent of the owner. That has not been allowed for 2 decades!", "I didn’t know that, thanks", "Yes they do, and it's a terrible experience. Luckily, it hasn't been a frequent one for me. People can also have terrible gas on a plane. Or douse themselves in perfume. So why compound the problem by choosing to add to the smellfest if you don't have to? OP is technically the AH, but my olfactory senses are absolutely on board with ESH.", "I hope to nonexistent gods she did. I would have gotten two tuna salad sandwiches and I would have sent a photo to make sure to rub it in.", "So he needs to be hospitalized if at McDonald's and some person orders filet-of-fish?", "Then why is tuna salad and sushi served on planes?", "She texted me when she was in the terminal and I admitted that I tossed it and sent her $25 on Zelle to get something in the airport. She was 3 hours early for her flight so I knew she would have time to get something before boarding.", "If he starts to smell seafood he has to leave the room.  Filet fish isn’t very smelly. But yeah he pretty much avoids any place that serves seafood in any sort of volume. He generally avoids restaurants with seafood on the menu. \n\nNo filet-o-fish allowed at his office floor.  \n\nHe had super severe tree nut and seafood allergies. Like he can’t even walk near a fish market, he avoids the block. His allergies are extreme and he is well aware and takes precautions. \n\nI have known him for 20 years at this point, he picks the place if we go out to eat and we avoid places with seafood on the menu.", "BuT ThE SmElL… /s. You’re not wrong. I was only trying to be diplomatic. I don’t agree with what OP did at all.", "So why does being 3 hours early matter? Your mom made something that cost less than what food cost at the airport (food is NOT cheap at the airport) a small bag of chips is like $6. I don't think your mom was willing to spend $30+ on food when she had something already made up that she was happy with. You don't get to choose what she eats", "What a dumb situation you created, wasted food, you spent $25 to “protect” others noses. I hate tuna and I wouldn’t be phased by someone eating it.", "[deleted]", "It is nice of her to give her mum money to buy food..after she literally threw away her food? That is not nice, that is the least she had to do!"]}