{"id": 17800, "submission_id": "13nfg2s", "title": "AITA for not wanting my daughter to wear boots in summer?", "selftext": "My daughter, 13 years old teenager, wears rainboots when she goes to school, when the weather is 75 degrees, and of course without rain. She normally wears sandals when going out, but her school does not allow them.\n\nI tell her boots are not an appropriate choice for the weather and she claims that she is the most comfortable wearing boots and that she does not like other shoes. I also think that the students at school will judge her for it, so she should wear the appropriate shoes. I offer to buy shoes for her but she refused. So AITA?\n\nedited- I am YTA. I will let her wear boots even though she will be judged.", "created_utc": 1684633539, "permalink": "/r/AmItheAsshole/comments/13nfg2s/aita_for_not_wanting_my_daughter_to_wear_boots_in/", "score": 185, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I think I might be the asshole because she has worn them many times and liked them.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Question: is it literally hurting her or anyone else in any way?", "YTA. \n\nWho cares? She has her own sense of style and that is fine. I see kids wearing slippers, Crocs, slides, etc at the middle school all the time.", "Rain boots will not do her any harm. She's 13 and can make this decision for herself. YTA. \n\nWhy not try to teach her to have confidence in her choices about her body, instead of trying to control them.\n\nIf you dig in this hard about something trivial. I can’t imagine how you will navigate actual difficult choices in her life.", "YTA, they are boots. Who cares. If they are comfy, so be it. If it's her sense of style, good for her. It's not like she's asking to get her belly button or nose pierced.", "You should be encouraging your child not to care what other people think. It’s an important lesson that you seem to have not learned yet. You can get yourself in a lot of trouble by worrying what others will think.\n\nYTA\n\nBoots are fine whenever your daughter wants to wear them. When you say rain boots, do you keen galoshes? Shiny yellow (or other colored) boots?\n\nEither way, I think YOU should let it go and not make it a big deal. \n\nAre you worried about what people will think about you?", "YTA You say that you are doing this because you don't want people judging your kid. The only judgement I see here is yours. She's 13, let her wear boots in warm weather if she wants to wear boots. No one in he school is going to give a crap about her footwear. \n\nSincerely a 29 year old woman who wears boots in 90 degree weather.", "YTA, let her express herself!", "YTA. She is old enough to decide what she wants to wear and having her parent control her clothing choice because \"other kids might make fun of her\" will cause lasting damage. You are supposed to support her and her decisions.", "YTA. Pick your battles. She’s not breaking rules and says she’s comfy.", "YTA, who cares what everyone else thinks? If she’s happy and comfortable in her boots let her be. It could even be a sensory/comfort thing. I think you care too much about what other people think. It’s not that serious. It’s footwear", "YTA. Why are you pressing so hard for something that doesn't matter? At 13, give her some autonomy about what she chooses to wear.", "YTA.   \nYou're complaining  because she's wearing  rainboots???  \n\n\nWhat a joke.   I bet no one at school cares at all.  Just you  YTA", "YTA. Just let her wear what shen wants.  This is really not worth making a big deal of.  Save that for something that actually matters.", "Yta for teaching her others' opinions of her matter more than her comfort and happiness. \nAs long as the boots don't hurt her feet or cause physical issues..... let her. If we're talking rubber boits though, I'd be worried about her feet sweating and not being able to air out all day and causing rashes etc", "YTA. \nYOU'RE the only one judging her. **YOU'RE THE ONE ACTIVELY BULLYING HER BECAUSE YOU'RE A BULLY.**", "YTA. This is not the hill to die on. Save the fight for something that really matters. She can pick her own footwear.", "YTA I believe your 12 year old  daughter should be able to wear her boots and Express herself as a child.", "YTA. I work with teenagers. They like to explore different clothing styles, hairstyles, etc., at that age. Boots are common: Cowboy boots, motorcycle boots, platform boots, etc., so I doubt that any kids will judge her. Be happy that it's just a clothing item and she's not trying piercings, tattoos, drugs, vapes, etc.", "YTA. You’re exhausting.", ">I also think that the students at school will judge her for it\n\nIsn't that the point of fashion?\n\nYTA I think your daughter has a right to be eccentric. A warning is fine.", "YTA. Is this really a fight you want to have? Seriously?", "YTA. If she's comfortable in them, let her wear them. You should be encouraging your child to be herself and confident in herself, not being the first judgmental Mean Girl she encounters every morning.\n\nThat being said: I myself wear heavy dull black rain boots to places, due to a lot of work outdoors in my garden and the fact I think it looks just fine, and trust me when I tell you that they can get mighty hot, sweaty and uncomfortable pretty fast in the heat to the point I can't wait to take them off. Once they stop being comfortable, she'll likely choose something else if comfort is her main goal. Until that comes to pass let her wear them. \n\nIf people make fun of her for her footwear, then that is THEIR problem, not HERS.", "|INFO\n\nIs there more info we should know for this to make more sense?\n\nIs it that that to you, rainboots should only be worn if there is rain?\n\nLike is it a cognitive thing for you, that you cannot understand WHY she would want to be so non-conforming and draw attention to herself for sticking out?\n\nIs it sort of like a \"rule\" in your mind? rainboots for rain, otherwise you're being weird?\n\nBecause it sounds like you genuinely don't understand WHY she'd put herself in that situation, to risk being made fun of, just over some boots. \n\nDid you also used to struggle with trying to blend in, to look like other people, even if you didn't really understand it?", "YTA- my 9 year old daughter pretty much wears sneakers only on Mondays for gym and the rest of the times she’s rocking her cowboy boots, her work boots or her riding boots. (All three in black!) and once in awhile she will add a pair of tiny heels in. \n\nShe’s a kid. Let her be a kid and wear what she likes. If she’s not worried what others say why are you?", "YTA. Your daughter is 13 and your biggest problem is the kind of shoes she wants to wear to school. I know plenty of parents who would be thrilled to have that as the biggest point of contention. The bigger deal you make of this, the longer she is going to wear them. That's probably the whole point. She's a teenager. She is learning to express herself and figure out her boundaries. This is extremely normal. \n\nThe fact that you care so much makes you come across as an insecure people pleaser. Quit trying to force your daughter to join you.", "YTA. If the boots don't violate dress code and she's happy wearing them, let it be.\n\nYou're trying to teach her to worry about the superficial judgements of other people, and I'm not sure why. If she is happy, and does not care what other people think about it, why do you want to take that away from her? It is so rare for teens, especially teen girls, to develop such a strong sense of self that they are able to be happy with themselves independent of others.\n\nMy partner had parents like this. They were always incredibly concerned with what other people/kids would think... MIL would constantly say \"You don't want to be made fun of, do you???\" and both parents put a lot of pressure to fit in and not be \"weird\"... they said it was for the kids' benefit.\n\nTurns out, it was the parents projecting their insecurities onto their kid. MIL is a life-long people pleaser and is incredibly worried about what people think of her, so she transfers that anxiety everywhere. FIL is very self-image focused and was concerned what people would think of HIM if they saw his kid acting weird. \n\nOnce my partner was able to get out of that house they flourished finally able to be themselves. To this day their parents still make passive jabs about appearance whenever we see them.\n\nDon't project your insecurities onto your daughter. They seem pretty strong and don't need them.", "Yes YTA.  She is 13.  Take her to buy a pair of school-appropriate shoes, but then let her choose what she will wear.  If she continues to choose the rainboots, that is her choice.  Many kids her age are seeking their own self-expression.  If the worst way she does this is by wearing rainboots, consider yourself lucky.  This is not the hill to die on.", "I always love when parents say they’re worried about their kids getting bullied for something at school, and then decide the best course of action is to bully that behavior out of their kid themselves before the school bully gets a chance to.", "I say let her wear them and who cares what those other students think, only thing that matters is she's comfortable and likes them. If the other students judging her starts to bother her I'm sure she will want different shoes", "YTA.  You’re the only one judging her and she knows it.  You pretty much suck as a parent for trying to change her because of your own insecurities.", "YTA. There is no physical danger, nor legal danger to her.\n\nThe argument it will hurt her because of how others will perceive her is a red herring for the fact that you’re worried about your image via hers\n\nGet over yourself. She is 13, an age that it is appropriate to be developing her own sense of identity and style.\n\nLet her determine her own fashion style. Be there, if and only if she ask, but otherwise give her the space to figure it out.", "Let her wear them. Natural consequence may be that someone teases her about them. That’s on her. She’ll either stop wearing them because if it, or she simply won’t care what others think and keeping wearing them. YTA", "YTA. As a parent you need to learn to pick your battles, and honey, this is not a hill to take or die on.", "Literally why would you give a crap? YTA kind of? Only if you’re stopping her from wearing them?", "Sorry OP, but YTA.\n\nRain boots are her style.  She has the right to choose her style, so long as she’s not doing anything wrong.  Wearing rain boots all the time is not wrong.", "YTA\n\nDon’t teach her to rely on others to approve of her fashion choices. You may think you are protecting her but you’re actually raising the next crop of bullies. If you convince her the boots aren’t appropriate, what will she say to another girl that wears boots? Don’t perpetuate the negativity.", "My son wears ridiculously bright orange and black sneakers to school that look like Halloween shoes, he loves them and calls them his spooky shoes. I’m glad he feels comfortable with what he wears and is happy. You’re the jerk Op, your daughter isn’t  hurting anyone with elevating the rain boots, let her be herself. They make rain boots in cute colors and styles. Start being supportive and ask her if she’d like to shop for other colors or designs of rain boots if that’s what she wants to wear.", "YTA let her wear what makes her comfortable and happy. If the other kids judge her, you tell her their opinions don't matter and encourage her to be herself.", "YTA. Instead of worrying about her being judged, teach her how to be a strong confident person who doesn't care what people think about her. If she's happy with herself and her choices you should encourage her to be herself and not care if someone else judges her. Also, you're literally the one judging her here.", "I teach art and had a fourth grader last week tell me all about how his mom said his shoes were for old men and kept making fun of him. I told them they looked professional and the other kids didn’t say a word. His mom was probably worried he’d be made fun of too - but the only person making fun of his shoes was her.\n\nJust let her wear what she is comfortable in. It doesn’t make a difference. I wear old snow boots all summer around my yard while gardening, taking out trash, getting mail… I just like how they feel and they’re convenient. Who cares?", "YTA. My 13 yo wears hoodies in 100 degree weather (and so do her friends). Do I think that’s bonkers? Yes. And I would probably drop dead from heat exhaustion if I tried that. But she is comfy so that’s all that matters.", "NTA\n\nbut she is 13, just let her be\n\noffer some other cool boots to buy, take her to a store to see some options, but don't make it a hill to die on\n\nmy entire friend group at the time wore combat boots come hell or high water, I'm sure it caused some fungus here and there, but otherwise everybody turned out fine", "NAH\n\nEver hear the saying \"Pick your battles\"??? This is one of those times. It's not effecting you and it makes her happy.... Just let her wear the boots.", "NTA but not a hill to die on. My daughter could NOT find shoes she liked to go with her prom dress. She doesn't like her feet - so nothing open. No heels, no this, no that. I finally gave up, and she picked glitter covered converse style high tops. They actually looked totally cute with her dress, which was just above her knees ... so not like the dress hid the shoes. Let your daughter wear the boots 🙂", "NTA, But I would just let her wear the boots so she can learn the hard way.", "NTA, but if she wants to do it, let her, you can lay out the reasons why you think it's a bad idea, but if she wants to do it, there's not really any harm. Eventually, she'll almost certainly stop on her own.", "NTA - My teen refuses to wear anything but crocs rn. Does she have other boots that are not rain boots? I wear combat boots with jeans during the summer.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n My daughter, 13 years old teenager, wants to wear rainboots when she goes to school, when the weather is 75 degrees, and of course without rain. She normally wears sandals when going out, but her school does not allow them. \n\nI tell her boots are not an appropriate choice for the weather and she claims that she is comfortable wearing boots. I also think that the students at school will judge her for it, so she should wear the appropriate shoes. I offer to buy shoes for her but she refused. So AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Soft YTA here.\n\nI understand caring for her and wanting to protect her from presumed judgement or possible bullying, but this is only gonna end in disaster if it's a trend for you.\n\nI went through similar things with my parents telling me to change things about my wardrobe, hair, and general appearance because they were worried I'd be bullied, but I realized when I got into that rebellious phase and started ignoring them that literally no one cared that much.\n\nYour reasoning makes some sense from a protective view, but you're really just teaching her to value other people's opinions of her over her own self-expression, and in these formative years that can lead to a lot of troubling things for both of you. If she's not hurting herself or anyone else, let her be.", "YTA. She’s wear safe footwear, so who cares if it’s not what YOU would choose? Let the kid wear what she wants!", "YTA. Pick your battles! As long as she’s appropriately dressed if she has a PE class who cares?", "Rubber boots are in now.", "YTA Your style is not your daughter's style. Let her wear the boots. What difference does it make? What can it hurt?", "If her school mates want to judge her they will find something to judge. Let her be herself. YTA. You are teaching her that other people's frivolous opinions of her are more important than her expressing herslef and being comfortable. Leave her alone.", "INFO\n\nAre these rubber light rain boots or the long/heavy duty maybe snow boot like rain boots??", "i wore my rainboots all the time when i was 14. i met lots of other ‘quirky’ kids that ended up being great friends to my 20s! the only time i regretted it was when we walked for over 3 miles and i didn’t wear great socks. yta!", "YTA\n\nWe are in 2023.\n\nIf her peers tease her, so be it. Support her so she knows she is safe at home, regardless of the decisions she makes.\n\nNo-one really cares anymore about this sort of stuff. \n\nGood luck.", "YTA.  I grew up wearing gumboots/rainboots and flip-flops whenever I could. I still do. Very few people teased me about it and my feet/ankles are rock solid because I never shoved them into \"supportive\" shoes aka foot coffins. \n\nLet your daughter wear what she wants unless it's having a serious physical impact on her.", "My mum has been trying to force me to wear open toed shoes/heels in summer my whole life. I'm 32. I dont own any \"summer\" shoes. I wear doc martens and vans with almost every outfit. YTA. Let her do what she wants.... they're shoes. Who tf cares", "YTA. The only one judging her is YOU.", "YTA and seemingly not a great parent. Most parents of teenagers wish their biggest concern was their child wanting to wear rainboots. What a ridiculous \"problem\" to make for yourself and a creative way to push away your daughter.", "YTA if she is comfortable wearing them and that’s what she wants to do, what’s the harm? You keep saying she will be judged, but you are doing that, and as far as you know no other kids have said anything to her. \nIt’s kind of a great quality in a kid too, to wear what they like and are comfortable in, rather than worrying about conforming to everyone else’s trends.", "YTA. She's 13 and old enough to decide what she wants to wear. Her body, her image, her choice", "Personally, I think that 13 is a good age to let her express herself more though her fashion choices. Unless rubber boots are prohibited at school, I'd leave her be. It sounds like a cute ensemble to me. YWBTA if you force your fears on her.", "YTA for basing a fashion decision on what people think. That’s terrible. \n\nBut rain boots don’t breath well, concerns about the foot health of wearing non breathable footwear  daily for hours is valid and should be looked into.", "I like how You already know that YTA but you had to make this post anyway LOL", "Maybe see if she'd like some cowboy boots? Those are appropriate in all weather.", "YTA. If the shoes are safe to wear and comply with the dress code, there is nothing to actually be concerned about.\n\nMaybe take her shopping for shoes that she find equally comfortable, instead of bullying your kid about boots.", "YTA, she’s made it clear that she is more comfortable wearing boots so what’s the problem? Also, the students won’t give a rats ass about it.", "YTA. And your daughter is totally going for Malicious Compliance - school won’t let her wear sandals but does permit rain boots so she is within the dress code. Admire and support your little legend’s confidence and don’t worry about other kids - I think your daughter has the nerve to stand up for herself.", "As long as she’s in dress code I’m not sure why you would ever get a vote in what she wears. 13 year olds can make their own fashion choices.", "This is not the fight you want to have. 13 year old girls are just starting to assert their independence, and they will exhaust you if you make an issue of every little spat you have.\n\nYou want to carefully pick your battles, save your strength for the important ones.\n\nRemember you’re not raising her to be your child who obeys you forever. You’re raising her to one day make good decisions on her own. It starts gradually, much younger than 13 and she needs to slowly make more and more of her own decisions while she’s still a child, with your guidance.", "YTA and moreso with your edit. Are you actually concerned about people judging your daughter or are you concerned about them judging you for \"allowing\" her to wear them? I'm betting the latter.", "Why does it matter in this case? Also, her not caring If she's judged AT THIS AGE is going to help her go really far in life. I didn't learn to not give a shit what people thought or said well into my 30s. Oh what my life could have been like if I had that power when I was young.", "NTA. Rain boots are a recipe for disaster in the heat. They also don’t have good support. Have you introduced her to hybrid hiking boots? Or if it’s the loose fit that appeals, cowboy boots or clogs?", "Not only are you your daughters biggest bully, yta. Get some help with those inside issues you have with her. She's a child. I wear rubber boots year round if I want. If people judge me it's a them problem. I feel great in my boots.", "You realize you're the only one judging her right? You could learn something from you daughter regarding not caring what others think.", "This is one of those moments when you have to decide if you really need something else to fight about. Logical consequences are the best teachers. If she's mocked for her footwear choice she decides if she cares. You can raise the concern, that's fine, just once. But let her do her thing and live with the outcome.", "Mom's the only one who cares by the sounds of it.", "No and it sounds so cute.", "Yes. Bad foot support leads to stressed stance from which joint and back issues will arise.", "It is hurting her because others will judge her for it.", "Exactly. OP should be happy that the daughter is not going to school in PJs and bunny slippers. (I've seen it.)", "They are black and not very shiny. But her classmates will see it and think she is weird for wearing them in summer.", "I'm betting when OP was in school, she ridiculed and bullied kids for wearing things she thought were uncool.  That's why she's so certain the same will happen to her daughter.", "> you’re worried about your image\n\nThat's exactly what's going on.  OP is afraid of being judged as a parent if her child wears what she wants to wear.", "My daughter wears Docs damn near every day.", "I did take her to stores but she did not like any of the shoes. She says she is comfortable in her rainboots.", "She did wear the boots and keeps wearing them. But I think she should stop.", "She has been doing it for years now and has not stopped. But I think that she needs to stop so that she will not be judged.", "She does not, but she also does not want them. I offered to buy it for her but she refused and kept wearing her rainboots because she says she likes them most.", "The only one in this story judging her is YOU.", "Nope. It’s hurting you because you think she will be judged for it. \nYTA.\nLet her wear whatever she wants and learn from her own mistakes. If she’s judged than she will be the one who will take responsibility for that.", "Who? Why does that matter? She’s a child..,, I think you’re worried about people judging YOU. Let your kid express themself.", "Does she normally get picked on for her clothing choices? I remember my mom being convinced I'd be judged or picked on for some of my weirder , but \"cooler\", fashion choices at that age, when those were the few fashion choices I made that actually went over well at school. Kids wear all sorts of weird crap, and what is the cool sort of weird changes by the minute, I wouldn't assume you've got a better grasp over the reaction her clothing will get from her peers than she does.", "*you* are the one judging her right now. You are the one bullying her over the boots. You told her your worries now let it be. She’s not hurting anyone by wearing them", "You are worried that someone \"will\" judge her for it. They haven't yet. I've seen cowboy boots with shorts during the summer as well as Uggs.\n\nAre YOU afraid that other parents will be judging you for letting her wear boots to school?\n\nLet it go or else you will continue to be YTA", "Lol “other people will judge her and make her feel bad so I’m preemptively judging her and making her feel bad.”", "Maybe your daughter is strong enough to not give a damn when others are “judging” her for SHOES. Be more like your daughter. Relax. Enjoy life more.", "hey if anyone judges her kick their asses", "Why are you even worried what other people will think. Thats cringey asf you arent 5 years old anymkre grow the f up", "That is your view.\n\nWith the appropriate support from parents etc children can get through it.", "Ah mom stop being such a nerd. That's what she's thinking.\n\nFor real, rain boots aren't gonna get her ostracized.", "Jokes we're all judging you", "YIKES I see you already edited to accept judgment but just wow, way to put something like the perceived judgement (aka bullshit) of your peers on a child. No wonder so many adults I know are so paralyzed by what others think of them. This is so tragic.", "You're judging her for it, so you're hurting her.", "Me too. \n\nAs well as short shorts and a literal bra with an open jacket over it. Slippers or heels to complete the look.", "I'm sorry but why are PJ's and bunny slippers a problem?!\n\nIs the kid in school? Is their clothing preventing them from learning?\n\nThis week one of the women who works under me got drenched in a rainstorm (Florida weather) and switched into pajama pants and bunny slippers. We all praised her for being resourceful enough to have back up clothes/shoes. \n\nI couldn't imagine being judgy of kids getting up at the ass crack of dawn and critiquing their clothing choice.", "Let's be honest, You think she is being weird. You are the one judging her.", "Have you seen what teens are wearing? Many in my area wear boots year round. It's a style choice.", "You are assuming what other 13 year olds think based on what you think. Maybe most of them won’t be judgmental because they have other things to worry about. \n\nI would drop it since she already told you she won’t wear anything else. Let your daughter live her best life in the comfy shoes she wants to wear. 🤞🏼", "That is you projecting your issues", "Sounds like me at that age. I wore bulky black combat boots from about 12 to 30. Still love black combat boots but now I have to look \"professional.\"", "It's so fucking wierd that you're obsessed with what children think about clothes. Did you peak in middle school and never evolve evolve past the all important tween clique or what?", "So what?\n\nINFO: Were you the popular girl/head cheerleader/Queen Bee/mean girl in school? Do you think conventional social status markers are a measure of a person’s worth? Do you think it reflects badly on you if your daughter is considered weird by the cool kids?", "Yta. That’s what you think they’ll think. Over here they will think that girl did a lot of musical festivals this year, maybe Coachella, and she definitely got the look. \n\n(Yes, big boots, shorts and oversized jackets- the to go look this summer when your doing a outdoor music show). \n\nBut even if she was to go to a school where they didn’t get that fashion, let her go. 13 is a perfect age to discover what you like and what not. Some switch to oversized trousers and crop tops, followed by long black dresses. Then they might visit college actually living in their Pink legging, but still ending up sharp dressed at their graduation. \n\nAnd you know what; that’s just all fine. Part of finding their own identity, instead of beings mam copy cat. Major lesson for her to learn; people that judge you by your boots are shallow and not worth to worry about.", "God damn ugh all your comments make me cringe. I’m a grown ass adult with a job, a masters degree, a partner, and friends and I wear matte black water resistant boots all the time. Like Jesus fucking Christ.", "You're concerned about what people will think of YOU for letting her wear what she wants.  Be honest.", "that's it then, her psychological comfort is more important at this particular junction", "Get her some cute Hunters if you're so concerned with your image. Because, let's be honest here, this is really all about you, OP. You and your insecurities, the ones you're taking out on your daughter. The daughter who you can't stand to see happy in her own skin.", "No no Don't do anything, Just let her wear the boots. It makes her happy.", "Buy why?", "You are literally the only one judging her. Believe me, if her peers said anything, you'd know. Most likely, nobody but you cares.", "Sounds like you're the only one judging her.", "If she's done it for years, her classmates are all used to it! The only one bullying your kid about footwear is you.", "Seems like you’re the only one judging her.  If her peers bullied her for wearing the boots she most certainly would stop wearing them.  This might be a way she can explore and express her individuality.   Let her.", "Judged by who? If she's been doing it for years and still likes to wear them, clearly she's not getting the negative judgment at school that you're so afraid of. She seems to be very comfortable with her own style, which is awesome for a 13-year-old girl, so why are you so intent on changing that?", "Seems you're the only one judging her.\n\nYTA", "You just brought back a memory. I found a piece of ribbon somewhere and wanted to keep it so I put the ends through two holes in the leg of my jeans and tied it. That night I went to a teen hang out club thing and a girl complimented me on it and said she wanted to do it to her pants. I always wonder when I remember that if there were some parents out there somewhere super pissed off cause their kid put holes in their jeans to put ribbon in them.", "What OP is really concerned about is that people will jusge OP for daughter's choice in clothing.", "In middle school??", "Belly buttons with piercings galore.", "Not a problem at all, but if OP is going off about boots, she'd have a complete meltdown over PJs or bunny slippers.", "Yep. My 14 yr old has been buying boots at garage sales for the past few years because black boots (the bigger and chunkier the heel the better) are all they want to wear.\n\nOP: If it's required, just remind your daughter to bring sneakers when they have PE (or keep sneakers in their locker).", "Bet anything OP bullied other kids for wearing \"uncool\" clothes.", "Because others will judge her if she wears boots in summer. She says she does not care if they judge her but I think she should.", "I really don't think this is necessarily true. I dressed like [Punky Brewster](https://i.pinimg.com/170x/a0/88/f7/a088f7757df3270974609f2363944de8.jpg) when I was in late elementary school, and I got made fun of for it. Sometimes I'd come home upset about the bullying, and my mom would say, \"Would you like to dress differently to stop the bullying?\" I'd say no and that I liked my clothes. By middle school, I was completely comfortable being myself, and when people made fun of me it was water off a duck's back (except for one thing: I was really thin naturally, ate a TON, and got extremely upset when people called me anorexic; I think being made fun of for something you can't change about yourself is different than for choices you've made).\n\nIf OP's daughter is like I was and doesn't care what the kids say, it's a REALLY good sign about her self-esteem and independence.\n\nETA: additional context and image of Punky for the younger set.", "Or she's getting the negative judgment and doesn't care, which means she has amazing confidence and self-esteem.", "Yes unfortunately. \n\nOur district went to a \"as long as the bits are covered\" dress code, so basically anything goes. Even the staff and teachers are sporting crop tops and jeans with huge holes (the no legs jeans).", "If it's not a wedding/funeral, let kids be. \n\nClothing is secondary to them being there and learning (outside of an abuse situation). \n\nThere's a reason you will walk around college campuses and see kids in sweats all the time. It's a priority thing. Sleeping in and making it to class will trump getting up early to get ready and making it to class. \n\nI'm in a professional environment now and dress like it, but oof do I miss the days when wearing sweats was the norm. \n\nThe only issue with rain boots is that bc they don't breathe , they could smell, but OP didn't mention that (and would have made a better point), so who cares.", "You think she should care if people judge her for something as unimportant as wearing rain boots? YTA for trying to push insecurities onto her.", "Like others have said, it sounds like you're the one judging her. Trust me, 13-year-olds are very sensitive to the impressions of their peers. If her peers thought it was weird, she'd stop.", "Why are you judging her then?", "People are gonna judge regardless if she wears the boots or not. People will always find something to judge others about.", "Her peers obviously haven't and aren't judging her if she still wants to wear the boots. You have been the only negative interference she has experienced because of the boots.", "Who cares if they judge her. People judge each other every day and that fact that your daughter has enough confidence to not care shows that she's comfortable with who she is.", ">but I think she should\n\nWhy? What kind of values are you trying to teach her?", "If she's already been wearing the boots, then it doesn't really sound like anyone is judging her for wearing them. The only one judging her is YOU.", "You said she's been doing it for years, though. Why do you think people are suddenly going to start being judgy about it now?", "The fact that you think your daughter _should_ care about being judged is absolutely appalling. You need therapy. YTA.", "My random two cents, I think that dress code is preferable to the strict ones.", "EXACTLY. This is a terrible message. Sure, she needs to learn about wearing what's appropriate for certain contexts like weddings or future jobs, but this really doesn't matter. You're only going to damage her self-esteem by pushing the idea that she should worry about what people think of what she wears in informal settings. If you're so concerned about it, you should probably seek therapy to figure out why you're so worried about what people think because that's really unhealthy.", "I am not judging her I just think her peers will judge her.", "“Just think her peers would judge her” *is* a judgement, you’re judging her more than her peers would. YTA.", "YTA. As her parent, why are you concerned about other people judging her? \n\nIt sounds like your daughter feels confident in her shoe choice. She’s not going to AND SHOULDN’T spend her life caring about what other people think. You should be teaching her this. \n\nAnybody that judges someone for wearing something that makes them feel comfortable and confident is an AH. AH opinions don’t matter to anyone except the AH.", "“I will let her wear boots even though she will be judged”. The only person judging her IS YOU. YTA.", "YTA. And your edit just sort of reinforces it", "Lol at your edit. Why do you think she’ll be made fun of? Are you usually cruel to other people about what they wear? YTA", "Can we talk about what hell hole this school mud be if they do not allow sandals in summer?", "YTA\n\nThe only one judging is yourself, I’ve worn my boots all year round in educational settings because it’s safe and appropriate footwear \n\nWould I prefer to wear my birkenstocks? Yes, but they are not practical at all \n\nHave I ever been given odd stares throughout middle school, senior school and university for wearing boots in summer? No, even if I have - I don’t care, those are the type of shoes I’m comfortable wearing and it’s not hurting anyone else", "YTA. You’re projecting your own insecurity on your daughter, who doesn’t seem insecure (yet, unless you keep going). \n\nWhen I was in school I couldn’t give a F if my classmates wore boots, crocs or paper bags on their feet. The only one who cares about this, is you OP.", ">I also think that the students at school will judge her for it, so she should wear the appropriate shoes.\n\nYeah, they really won't. Half of them are wearing boots, bunny slippers, filthy sneakers with visibly peeling shoes that are *comfortable* dammit! Or nothing at all because they have sensory issues and you need to nail the shoes to their feet to get them to keep them on. \n\nAsk me how I know. 🙄", "YTa. (Small \"A\" because I get it. I have a 13yo who wears a fur hat much longer than the weather necessitates.)\n\nShe is at an age where establishing an identity is heavily dependent on wardrobe choices. Wearing what she wants to wear is very important to her. \n\nRain boots might seem a poor choice to you, but if that's what she prefers, you have to let her run with it. As long as no one is getting hurt, you really need to let her make these choices.\n\nWhich is more important? Her footwear or maintaining a good relationship with your daughter? You have to pick your battles.", "YTA. It's not hurting anything. Unless your daughter has some kind of underlying insecurity, fear, issue causing her to feel like she has to wear rainboots for some reason. But if she just likes them, who cares?", "Yta and should stop being the one judging her and start being the safe place she can go to when other people do.", "13 year olds judge 13 year olds for everything.  At least this way she will be happy with her shoes.", "Absolutely not one single person will “judge” your daughter for wearing boots in the summer because absolutely no one gives a shit what other people are wearing on their feet and nor should they.  Calm the fuck down.", "Lady, nobody is judging her more than you.", "Like you’re doing.", "YTA. \n\nYou are taking away her agency. \n\nIf she’s judged and she decides she doesn’t like it, she’ll change her shoes. \n\nRight now, all she’s hearing is that YOU value *other people’s opinions* over your daughter’s wants, needs and opinions. \n\nNot a great way to start parenting the  teenager years.", "What does it matter what they wear?", "Hell I do go to school in pajama pants and no one gives a damn", "You/ the school (don’t know whose rule is it)are/is weird for not allowing the kids to wear sandals in summer", "Easily 75% of the teens in my town wear pj pants to school regularly", "And?", "And the school desks they sit in wept by the indiscretion 😂\n\nAlso, I hate to break it to y'all, but women's pockets suck so hard, but they're decent in sweats, typically. You wanna sneak a pad or tampon to go to the bathroom in jeans? Dream on. In sweats? Oh, hell yeah. \n\nComfy and functional, students know what's up.", "She obviously doesn't mind that.  Having *you* judging her hasn't changed her mind, has it?", "Then yta for that, too.", "We know she's getting negative judgment from OP.", "Oh I don’t blame them for it, I work from home in the most expansive comfy clothes I can find - like muumuu Homer", "It is preferable to a strict dress code. And the idea was the have as gender neutral of a policy as possible. But as kids will do, they take it as far as possible. I am waiting for the day someone shows up in a bikini. The dress code before this wasn't strict so this change was really unnecessary. \n\nI do take issues with teachers wearing extremely short skirts and shorts as well as crop tops. And I am a school employee. It may be old fashioned but a smidge of professional dress seems like a good idea.", "I think you're more afraid that other people will judge *you* for letting her wear them.", " Personally I am far too burned out with the \"professional dress and appearance\" culture. I'm more concerned if they can do the job than the clothing being worn.", ">edited- I am YTA. I will let her wear boots even though she will be judged.\n\nOmg 🤦‍♀️ even in your edit you're an asshole. Why the need to add \"even though she will be judged\" like you're still trying to justify yourself when YOU are the one judging her. Jesus christ project much? \n\nChange your inner narrative. Why should anyone care more about what others think than their own comfort? \n\nWhy do YOU care more about what others think than your daughters comfort?", "I live in a beach town in a Mid-Atlantic state that experiences four season weather. Teen and tween girls wear shorts and Ugg boots to school starting in March! As a woman of a certain age and attitude,  I can't comprehend such fashion choices, but as long as your daughter's boobs, butt cheeks and vajayjay are covered, I don't think this is a hill to die on. YTA", "Get over yourself!!!!", "Everyone is judged no matter what they do. Give her autonomy over her clothing. Yta", "F the other students. \nI mean bro...come on now.", "When I was 13, I insisted on wearing hiking boots. It was warm, but more comfortable than other shoes. I still mainly wear hiking shoes.\n\nShe's at an age where she's figuring out herself. Just let her. Unless it's actually inappropriate or dangerous, she'll either learn that she loves or hates it, on her own.", "The edit makes you more of TA as well. Controlling and power hungry situation. Btw- she probably won’t be picked on at school at all and you are projecting harmful insecurities- to you(she very clearly has no issues in how she dresses and just wants to be comfortable in the place she goes every single day all day)- that she shouldn’t have to think about. Why are you commenting on her clothes or how other people will pick on her? You sound like her first bully.", "YTA. My Mom use to judge my clothes as a kid. I don’t talk to her anymore.", "Ew your edit makes you even more TA. You’re one of those god-awful parents that always has to have the last word and it always has to be fcking “right.” Right?", "YTA, and your edit proves that. Get off your high horse and let her wear what she wants.", ">edited- I am YTA. I will let her wear boots even though she will be judged. \n\nCongratulations on being your child's first bully!! I'll bet you'll wonder why she never calls when she moves out too.", "YTA let her wear what is comfortable. If you think something might be up with her feetsies see a.foot doctor. Kids will be kids and will wear what they want. You probably wore things your parents hated", "Agreed, except it depends why they're more comfortable than normal shoes. My rain boots put a lot less pressure on the top of my feet than other shoes, and I wonder if OP's kid has (I can't think of any other way to describe this but it sounds wrong) tall feet. Pressure from shoes on the top of your feet can be really unpleasant, and there's no way to make them looser. The fact she likes sandals (topless) and rainboots (looser than most shoes) suggests it's not a casual preference to me and even heat discomfort may be preferable to that crushing pressure. \n\nOP, yta", "So you are teaching your kid that her value is determined by the opinions of strangers. Not even on things that matter to her character but over BOOTS.\n\nYTA", "What's it like being your daughter's first bully? YTA", "So? I'm in my 40s, married over 10 years, and husband jokes I'm not a girl lol. I mean he's right, I suck at it. No makeup, no girly anything for the most part. When we got married his only requests were a dress and no cowboy boots.", "I definitely do not think YOU have a better grasp of what teenagers think is appropriate than your teenage daughter.\n\nThe fact that you think, even for a second, that teens consider \"weather appropriate\" to be a consideration for wardrobe choices shows you are wildly out of touch here.\n\nYTA", "Lol My last high school year PJs and slippers were the fashion due to the continued construction of the school and no one wanting to ruin nice clothes. No one looked weird just more comfortable and colorful.", "There was an insanely cute post once where somebody had the genious idea to put the kids in her wedding party in matching onesie pajamas. I think one had sensory issues and the other just wanted to match. All the other kids at the wedding could wear pajamas.\n\nI agree, professional attire can really suck. \n\nI figure with kids, some of it is what they slept in. Part of it is... They are in the glory days of looking absurd. They actually can pull off those outfits. We should just let them. Let whoever was not cringe as a teenager throw that first stone.", "Oh, I didn't think you were!\n\nThese kids lives are so regimented they can't even go to the bathroom without permission. Let them be comfy.", "YTA. Why did you decide to take this opportunity to be your child's first bully instead of teaching your child to be themselves and not care what others think. Instead you planted a seed of doubt in their mind.", "Your edit is aggravating me so much \"I will let her even though she will be judged\". The only one judging is you.", "Yta, what’s the harm, if she cared what people thought of her I’m sure she wouldn’t be wearing them", "YTA because it’s clear you’re more worried about what people will think of you not her, she seems OK with possible mockery, GOOD FOR HER, you’re just projecting your own insecurities. Not cool mum.", "I live in boots and sandals, either or", "That passive aggressive edit, Jesus, must be fun in your house.", "Hygiene issue. Fungus. Teach your kid to not have gross feet. It’s too hot for rubber boots. She doesn’t know bc she’s a kid. It’s your job to tell her about foot hygiene and instead of getting her way she gets to learn something new and be more prepared for life. She will know about foot hygiene. She will thank you later OR if she wears rubber boots in hot weather and gets athletes foot, she will learn that it was a dumb decision on your part to allow it. Being judged isn’t even the risk here. It’s being gross that is the risk. If she has nasty feet, then she will really get judged!", "Don’t go there. Seriously. My advice (as a parent of a 14 and 16 year old) is to smile and say “that’s nice dear”. Your mission is to survive these years, choose your battles wisely. Basically, the only time I tackle them is over safety issues and then (and only then) I rule with an iron fist.", "LOL. Judged? For footwear? For wearing what she likes, which doesn't hurt or endanger anyone in any way whatsoever? She won't be judged. And if she is, those kids truly suck.\n\nImagine stooping so low to make fun of a kid who's just wearing some a little more comfortable for the weather.", "YTA. Kind of a battle not worth fighting, don’t you think? I went through a boots phase around that age. Honestly, I still love boots above all else. Some of my friends wore flip flops year round, or shorts. It’s a petty thing to go on about.", "Your edit shows that you didn't learn a single thing.\n\nYou are her bully, you are the only one who judge her. You are the asshole through and through.\n\nWho need school bullies when you live with a parent like this.\n\nYTA", "YTA!!! You’re the one judging her!!! Christ you have a 13 year old who Is comfortable in her own skin and you’re actively trying to ruin it. Damn!", "The only one judging your daughter is you.\n\nYTA", "Sounds like she’s being judged at home, why not let her find out if she’ll be judged at school too? YTA", "YTA.\n\n\"You have to suppress your individuality in order for people will like you\" is a HORRIBLE value to instill on a teenager.", "I wear boots year round. Not rain boots but they are waterproof. YTA. Quit judging your kid.", "OP has presumably been going through life a while but hasn’t figured out that fashion preferences change over time and across generations.", "Also truly fascinated by OP’s thought process here, like aside from obviously being overly controlling about their daughter’s fashion choices, it’s baffling to me that they’re convinced this will get her made fun of. Yes kids make fun of other kids’ clothes but I cannot even imagine a bunch of middle schoolers being like “LMAOOOO SHE WORE BOOTS AND IT’S NOT EVEN COLD 😂🤣💀”??? Like you think 12 year olds give a shit about weather-appropriate footwear????\n\nBesides, bullies tend to not stick to targets that are self-assured & don’t give them a reaction. They pick on kids who are awkward and/or lacking in self-confidence. Like, you know… kids who maybe have low self esteem and second guess themselves bc of parents constantly critiquing them and their choices/tastes/etc. Just a totally random example 🤷‍♀️", "So? Teach her to not care of others opinions. When we care too much, we get anxiety, start people pleasing and miss opportunities. Teach your child to be free and have have open mind instead.", "It could be that she has sensory problems and other types of shoes are the ones “hurting” her. Rain boots may be her safe shoes. Let her wear them. I suffer from sensory problems and they are torture.", "Like what you're doing? Seriously YTA, leave the kids boots alone.", "I was at a mall once when I was about 12\nand a woman walked by with three teenagers. This was circa 2002. All of them wearing a thong over their ultra low rise jeans and a bra for a top. I swear they were giving Christina \"Dirty\" vibes. My eyes got huge and I was absolutely floored, never seen that kind of thing in public.\n\nThe mom got unhinged and started screaming at us, a pair of preteen girls, for staring at her girls like perverts. I am very much the look away type so no I wasn't outside of the first shocked look. Byt honestly,  that outfit is designed to stir attention!", "Sounds like a you problem. You don’t get to assign intent or purpose to other people’s clothing.", "Crop tops!!!!! Oh the horror", "I think the dress code should be something like covered from the armpits or shoulders to mid thigh", "Midriffs are not sexual or distracting."]}