{"id": 17866, "submission_id": "13o2op8", "title": "AITA for telling my mother in law we will not reschedule our gender reveal to accommodate her?", "selftext": "Me (24F) and my partner (30M) are hosting a gender reveal get together for our family and friends this coming Memorial Day weekend. This is our first baby, so my mom and sister were nice enough to plan everything near the beach by our house. Invites were sent over 2 weeks ago, which she deleted because she “didn’t recognize the phone number” it was sent from. She then assured me that she would be there, but mentioned the awkward timing of 6 pm, as it “cuts the weekend down the middle.” My partners mother has now, a week before the event, called my mother and texted both me and my partner asking if we are able to change the time of the gender reveal party as “it’s right in the middle of the holiday weekend” and her and my partners step father want to go to their cabin. For context - this was planned in the evening of the 27th as my sister is flying in from out of town specifically for the event, and this is what worked best for everyone (my partner also has a work event in the afternoon that day). AITA for telling her we will not be changing the time of the reveal to accommodate her weekend plans? I’m obviously upset she even asked, but not entirely surprised as she doesn’t have the best relationship with my partner due to her overall behavior.", "created_utc": 1684694368, "permalink": "/r/AmItheAsshole/comments/13o2op8/aita_for_telling_my_mother_in_law_we_will_not/", "score": 88, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > The action I took was texting my MIL that we would not be changing our planned event to accommodate others schedules. This could make me the asshole as “it’s family” and from the outside, she may not understand why it would be a big deal to change the time.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nHowever, please don't set California on fire again.\n\nGender reveal responsibly.", "NTA. You can’t change everything because she fancies a trip to her cabin. As you’ve said, the time was set to accommodate more than one person, most importantly, the father of your child. Your MIL needs to stop acting selfish and check her priorities. Have a wonderful gender reveal party!", "NTA. It's your decision, not hers. She can come or not - that is what she has control over.", "NTA but I’m not sure why you would want to give her the power to start requesting you change anything in your life.She will continue to do so if you allow this behavior.", "NTA Nope, don't reschedule. Would anyone be offended if she wasn't there? I'd want to go to the cabin personally, text me the results!!", "NTA and if she has higher priorities, she might as well not be there. Don't think either of you would be missing much and the evening might turn up to be something much better. You do not change plans for one person when it was planned in advance and they want to go to a cabin.", "Gender reveal parties are completely ridiculous.", "NTA \n\nDon‘t give it in to her schedule preferences. Offer to FaceTime her for the reveal part and be done with it.   \n\n\nThe less time and energy you give to this, the better off you’ll be.", "NTA. Don't be angry that MIL asked. She can ask, you can say no. Sorry can't do it. Don't go into a mountain of details. Bring up old issues. It's not worth it. People love to argue with you as you more info you provide. If she pushes, say the same thing over and over.... Sorry. Can't do it.", "Your response..\".sorry, no.  \"\n\nThey can go to the cottage the next weekend.", "NTA... sorry you can't make it, we will send you a video", "NTA. Tell MiL that your sorry if she can't make it but look forward to seeing her and fil if she can. Then go do whatever you want and don't give it a second thought.", "NTA this is the party you have planned, if she can come great, if not oh well. You could always offer to FaceTime her at the moment of the reveal if they want to go to their cabin.", "Just tell her that won't be possible but we will take tons of pics you can see when you get back! NTA  Congrats on your baby!!!!", "NTA.  While you're not required to change your plans just because a guest finds it inconvenient, it's certainly ridiculous for her to even ask this late.  Especially considering she ignored the first invitation.", "\"Sorry you can't make it.  Your son can text you a photo of us doing the reveal.\". NTA", "Girl, it's YOUR partyyyyyy NTA", "NTA.\n\nYour MIL cares more about a weekend trip than you, your partner, and your future child…. Remember that in what you trust them with in the future.\n\nCongrats on the new addition to your family!", "[deleted]", "NTA, keep the party the day and time it’s planned for. She can come or not. It’s not like she can’t go to the cabin any other weekend.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMe (24F) and my partner (30M) are hosting a gender reveal get together for our family and friends this coming Memorial Day weekend. This is our first baby, so my mom and sister were nice enough to plan everything near the beach by our house. Invites were sent over 2 weeks ago, which she deleted because she “didn’t recognize the phone number” it was sent from. She then assured me that she would be there, but mentioned the awkward timing of 6 pm, as it “cuts the weekend down the middle.” My partners mother has now, a week before the event, called my mother and texted both me and my partner asking if we are able to change the time of the gender reveal party as “it’s right in the middle of the holiday weekend” and her and my partners step father want to go to their cabin. For context - this was planned in the evening of the 27th as my sister is flying in from out of town specifically for the event, and this is what worked best for everyone (my partner also has a work event in the afternoon that day). AITA for telling her we will not be changing the time of the reveal to accommodate her weekend plans? I’m obviously upset she even asked, but not entirely surprised as she doesn’t have the best relationship with my partner due to her overall behavior.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Hahaha of course, we actually live in Minnesota and are just dipping some champagne classes into a cake 😉", "“Sorry you can’t make it! Have fun at the cabin.”", "Totally agree - that’s one of the main reasons we shut it down right away!", "Maybe so but sometimes its nice just to have a reason to get together, The ones that are reasonable and actually thought through at any rate.", "Sometimes people want to have a party and celebrate the baby. Wild.", "geez, you must be fun at parties. no one is holding mil at gunpoint, she has the choice to not attend if her other priorities are more important. and that is fine but she doesn’t get to dictate they change it to suit her. also, you clearly have issues because it is not normal to be this angry at strangers for having a gender reveal.", "Oh I LOVE that one! Especially after COVID, means everyone gets a slice and self-contained! Absolutely love that x", "Oh I LOVE that one! Especially after COVID, means everyone gets a slice and self-contained! Absolutely love that x", "I am so proud of you for taking a stand to protect yourself and your family. Great job! Have a lovely life you deserve it.", "Yeah, it’s just like any other party, but with a theme. I’m not down for gifts or causing one of the biggest fires in California history though.", "Celebrating the baby is great. Celebrating the gender…not so much.", "Totally understand this take. And I don’t know if this is what you mean, but the distinction between sex assigned at birth and gender is important, and I fully recognize this. Think of it less as a celebration and more of an informational gathering in which we provide food for the people who are nice enough to come. No gifts or present exchange, just purely finding out the sex for planning purposes!", "My view on this has nothing to do with gender and trans political issues. It is simply that how are you supposed to react when you learn that it’s one gender or another?  It’s fundamentally wrong to be either relatively happy or disappointed.  You shouldn’t care one way or the other.", "It’s not something that we are expecting a huge reaction to, and I truly will be happy either way. I would like to find out for my own personal reasons, but certainly will not be “disappointed” by either result! We asked family to come because they expressed an interest in being there (MIL aside of course).", "Touch grass", "NTA.\n\n\"We have my sister flying into town for the party, so we won't be changing the timing. You two have fun at the cabin, and we're happy to text you the sex after the reveal if you're interested. Have a great night!\"\n\nJust show her you give no fucks, srsly.", "NTA, verging on NAH.  It's not wrong for MIL to ask if party can be rescheduled, and it's not wrong for you to say it can't.  Reason I'm on the fence of NTA vs NAH is that MIL waited until pretty late in the game to make the request.", "I don’t think you are necessarily TA, but two weeks notice before Memorial Day weekend is not enough notice. A lot of people already have plans.", "YTA for planning a dumb party in the middle of a long weekend to begin with.  No other weekend you could do this stupid party?   It isn't like gender reveal parties are fun parties anyways for anyone else but the parents.", "NTA! She’ll find out the next day… everyone has priorities…", "NTA. Maybe she can FaceTime in during the reveal if she can’t bother to be there.", "NTA tell her it’s unfortunate if she cannot make it as she will be missed and then say no. You don’t have to have her agree", "NTA", "Cringe. So edgy.", "Understand this! We sent them out the first week of may as I was still early in pregnancy prior to that and not quite announcing yet.", "Reveals like this are cute and harmless. It's the lot that give us pollution and forest fires that give gender reveals a bad name.", "Have a great party! Gender reveal parties are all up to the two parents. You want one you enjoy it. NTA. It sucks it’s the holiday weekend but you planned in advance and your sister already has a flight booked."]}