{"id": 17860, "submission_id": "13o5t7b", "title": "AITA for commenting on my coworker's outfit?", "selftext": "Hi Reddit,\n\nThrowaway for obvious reasons. I work at a tech company and we had a new employee join us a month ago. She's part of my project team. I was immediately attracted to her. She has this distinct style, often wears colorful clothes and chokers, which are uncommon in our otherwise pretty professional and subdued dress code. I've got to be honest, I think she's really hot.\n\nWe've been working on a project together for a couple of weeks now and I'd been thinking about asking her out. I was never quite sure if the timing was right but I also didn't want to miss the opportunity if she might be interested. I'm not the best at reading signals, I admit, but she seemed friendly and open. We would often joke around and she didn't seem uncomfortable with me.\n\nThe situation came to a head yesterday when we were working on some code together. I leaned over her to get a better look at her screen (we share one large screen at our workstation). I noticed her choker was different, a new design, so I mentioned it saying it was \"super cute\" and then, in the same breath, I asked her if she'd like to go out for drinks sometime.\n\nShe didn't really respond, just kind of nodded and we continued with our work. The rest of the day was a bit awkward, but I chalked that up to it being a potentially uncomfortable situation.\n\nThis morning, however, I was called into HR. She had reported the incident, saying that my advances were unwelcome and that she felt uncomfortable with how I leaned over her and made comments about her appearance. I was totally blindsided. I thought I was just expressing interest in a respectful way, but I realize now that the situation could be perceived differently.\n\nI want to stress here that I had no intentions of making her feel uncomfortable or pressured. It was not my intention to invade her personal space or to objectify her. I simply thought we had a connection and wanted to explore that outside of work. Now, though, I'm facing disciplinary action at work, potentially even losing my job. My colleagues are aware of the situation and the general vibe is negative towards me. I'm really struggling here, both with the potential professional repercussions and feeling like a massive jerk.", "created_utc": 1684701923, "permalink": "/r/AmItheAsshole/comments/13o5t7b/aita_for_commenting_on_my_coworkers_outfit/", "score": 162, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1. I complimented my coworker's outfit and asked her for drinks\n\n2. It might have been an inappropriate moment to ask that\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "1. \"Friendly\" is not at all the same as \"I have an interest in dating you\". If you learn one thing about women, please learn that someone being friendly towards you doesn't mean that they have an interest in you.\n2. Really try not to lean over someone. It's just never comfortable. Sure, sometimes it's unavoidable, but \"next to\" is a much better position than \"leaning over\".\n3. If the necessities of work mean that you have to get in someone's personal space like that, that's really not the time to start hitting on them. This comes over as creepy for a reason: it's straight out of the office lech's playbook. This was anything but respectful.\n4. This woman is a new employee, and is part of your project team? As in, she is your direct subordinate? How many red flags do you want? Don't hit on people who work for you. You can, respectfully, ask out a colleague. You didn't come close to achieving this, but it's possible. But a subordinate? Just don't.\n\nYTA", "INFO: Did you just wake up from a 25-year coma?", "YTA \n\n\nMan, just let people work. Nobody wants to be hit on or asked out while they are at their job.\n\n\nDon't shit where you eat.", "As a woman who has worked in tech for 16 years, you are one million percent the AH. Just because a woman is attractive in your office and “has a distinct style” did you ever stop to think she has a distinct style because she’s one of few women? And most women in tech subdue their natural style to fit in and not get the attention that she did. Work is not a dating app.\n\nYTA on so many levels, and edited to add good for her going to HR and not letting this behavior continue so many don’t as we fear retaliation", "You leaned over to watch the screen, but your eyes fell on her choker....\n\nwhich was on the screen? or was it in 180degrees opposite direction?\n\n \"super cute\" followed by asking her out.. I just imagined this in a a breathless, very wet sounding tone... while the poor woman just wants to do her job.", ">I work at a tech company and we had a new employee join us a month ago. She's part of my project team. I was immediately attracted to her. She has this distinct style, often wears colorful clothes and chokers, which are uncommon in our otherwise pretty professional and subdued dress code. I've got to be honest, I think she's really hot\n\nI guarantee she's picked up on your creepy behavior. You work together and she's part of your team. Ever hear of the phrase, don't shit where you eat.\n\nYTA", "YTA if this was HR’s reaction, your code of conduct outlined that this isn’t acceptable behaviour where you worked upon hiring. Leaning over into a colleagues space, looking into her cleavage (my assumption) and asking her out is indeed unexpected in an ethical workplace. People actually care about their careers and go to work for employment.", "YTA. of course your \"intent\" wasn't to make her uncomfortable, your \"intent\" was to score with your hot new coworker. i'm not even against workplace romances, i think people can develop really strong relationships-- friendships or otherwise --with coworkers, and i think even breakups/falling-outs can be managed respectfully if people are mature enough.\n\nbut you didn't bother to get to know her as a person first. sounds like you didn't try to get to know her at all before springing your attraction on her. and doing so while she's on the clock and you're working on something together was absolutely the wrong move. she's the new hire and you put her in an objectively uncomfortable position where she couldn't rebuff you directly if she wanted to (and obviously she did).\n\ni think you let your desire get the better of you with this one. let it be a lesson learned.", "Oh my god you’re the reason we have HR trainings. In what world did you think this was ok? At least, idk, get to know her outside work first?? Have some office HH and whatnot? Start out being friends so you don’t come across as a complete creep!! Ugh YTA", "YTA\n\n> I was immediately attracted to her.", "Let me make this message loud and clear for you.\n\n\n👏 NEVER. 👏 HIT. 👏 ON. 👏 CO-WORKERS! 👏\n\nYTA YTA YTA YTA", "Ewwww you sound creepy.", "YTA. Being friendly at work does not equal being interested in you romantically. You seem like a smart guy; learn from this and correct your behavior moving forward.", "YTA. She has to be civil and nice to you because you work together. Leaning over her to look at her screen is creep behavior.", "YTA, 100%\n\nIt's beyond me how you wouldn't know you risked reprimand by asking out a co-worker, especially at work. That's just completely inappropriate and wrong. For all you know she could be in a relationship, could be gay, might be in recovery. Just so many reasons why asking her out, especially when you barely know her, was a horribly naive mistake and she was 100% in the right to report you.", "> *\"so I mentioned it saying it was \"super cute\" and then, in the same breath, I asked her if she'd like to go out for drinks sometime.\"*\n\nDUDE.  NO.\n\nI don't think you're an asshole.  But I do think you were ridiculously naive.\n\nYou don't shit where you eat, bruh.\n\nIf you were going to ask her out (TERRIBLE IDEA), you don't DO IT AT THE OFFICE.  You wait until you're at a social event, when you're both present.  But, DON'T DO THIS AT WORK.  And, probably don't do it at all.  There's like a 1% of it ending well.  Even if you asked her out outside of work, and you went out, it could still go wrong.  Then, bad things will happen at work.  If you asked her outside of work, and it didn't go well, you STILL HAVE A PROBLEM AT WORK.  If you did what your naive ass did, you CREATED A WORK PROBLEM.\n\nBruh.", "Dude you don't have a connection she's just a woman doing her job", "Don't shit  where you eat dude..don't try to date coworkers...ever", "Easiest YTA ever, even more so when you mentioned that you work in a tech company.\n\nThe longest running joke in tech is (or was) that women slept their way into positions and kept them by dressing attractive and \"letting their mouth do the talking\". It's taken a lot of time and effort for women in the industry to become respected, and you boiled your coworker down to \"looking good\" in no time at all.\n\nThe only, and I mean only, time where it's remotely OK to comment on an outfit being worn by anyone is if you get asked, and even then comments should be restricted to \"yeah, the cut/color/whatever on that blouse/suit/dress/whatever flatters you\". That's it.\n\nYes, I was also the token \"straight\" (wasn't out as bi) somewhat effeminate guy at the company. I got questions like that a lot, but I NEVER gave unsolicited opinions.", "This again? Find something better to do.", "YTA but this is a learning moment for you (which I hope you do take seriously). \n\nThere is a time and a place to ask someone out. Doing so in the middle of working with her while in her physical space is not it. \n\nYou need to consider WHY she felt uncomfortable to report you to HR. You created a situation when asking her out where she was physically trapped. You asked her out in a situation where she was taken off guard, where the moment did NOT call for that. \n\nYou also need to realize why she went to HR and why it was an appropriate reaction for her. There are many situations where men will ask their female employees and, if these women reject the men, it often doesn't work out to well for the women, especially in male-dominated industries. You put her in a position where she had very little control over the situation. She does not know you that well, so she has no idea how you would react to a rejection. You may know your response, but she doesn't. If she rejected you, she has to consider the possibility that you can react negatively. From taking it out on her through her work to spreading lies around the office about her to turning violent, these are all possibilities she has to face, even if you were never going to escalate it to any of those situations. Why? Because those situations happen ALL the time, especially in the tech industry. \n\nSo be mindful of this before you throw judgment on her for her reaction. She was thinking about her personal safety. \n\nAlso, just something to note: just because a woman is friendly toward you, it doesn't mean she's interested. Yes, there's obviously a time and place to try asking her out, but if you think she's interested only because she laughed at your jokes, you need to rethink that. \n\nI hope you take all of this and apply it to future situations and really consider when it's appropriate to ask any woman out (and it's not in the middle of work when you've physically cornered her).", "YTA. You are working together on a project, so your advances while working on said project were not appropriate and put her in an awkward position since she still has to work with you.  I hope a lesson is learned here on your part.", "Was her choker somehow positioned between your eyes and the screen? I’m having a hard time envisioning how you noticed that without being an absolutely creepy predatory asshole. Just saying…", "YTA but I understand where you're coming from. Like a lot of people have said, don't shit where you eat. Don't start romantic relationships where you work, especially if you're serious about continuing a career in that field. You aren't working at a fast food joint, you are working in the tech industry where people are serious about their careers.\n\nI know you didn't want to come off as creepy but that is in fact how it came off whether you like it or not. She's nice and friendly to you because you two work together. If you feel like you're unsure that you're getting any signs of a girl flirting with you, chances are that she isn't. Don't be surprised if you stop working with this girl. You didn't do anything outright horrendous at the very least. You shoulda kept things professional and friendly.", "YTA. Being nice does not equal interest. If she were mean to you or anyone, she would be reprimanded. She has to be nice to everyone; that is what's expected in the work place.", "YTA. The workplace is not a singles bar and it’s 2023, get a clue.", "YTA\n\nShe is a coworker. DO. NOT. EVER. DO. THIS. Coworkers are generally expected to be friendly/cordial with one another at the office, this fosters a good team environment. A woman being friendly towards you is NOT flirting.\n\n(Just in case it's not obvious, that barista at the coffee shop that smiles at you when taking your order is also NOT FLIRTING WITH YOU)\n\nNever ever make comments about a coworkers appearance. Just don't. In general do not even acknowledge that they have physical bodies. Just keep that alllll to yourself.\n\nThis kind of junk happens to women in tech fields all the time (well, everywhere, but it seems extra common in tech) and they have to constantly fend off unwanted advances... and no matter how nice you INTENDED to be, yours was unwanted. She wants to do a job and advance her career. She is not there looking for a date. Your connection was that of one coworker to another. I don't know why men always seem to expect any differently IN THE OFFICE.\n\nYour best course of action is to throw yourself at the feet of HR and beg for their mercy. Do whatever training they require of you. Then never ever ever bother that poor woman again.", "Absolutely YTA for everything others have articulated here.", "You're at work, not a bar, sorry! yta", "Looks like someone wasn’t paying attention during the mandatory sexual harassment videos. You’re literally describing text book DONT DO IT behavior. \n\nY are most assuredly TA.", "YTA. You say \"I'm not the best at reading signals, I admit, but she seemed friendly and open. We would often joke around and she didn't seem uncomfortable with me.\" That's civility from a co-worker; that's not ask-someone-out level of anything. Avoid using your workplace as a place to test out your pickup lines, to flirt, the compliment on appearance. The best part of WFH (aside from no subway ride) is knowing that the person with whom I have a professional relationship won't be leaning over me and asking me out.", "YTA. Leave women alone, FFS.", "YTA and a creep. Stop bothering this woman. Leave her the fuck alone.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nHi Reddit,\n\nThrowaway for obvious reasons. I work at a tech company and we had a new employee join us a month ago. She's part of my project team. I was immediately attracted to her. She has this distinct style, often wears colorful clothes and chokers, which are uncommon in our otherwise pretty professional and subdued dress code. I've got to be honest, I think she's really hot.\n\nWe've been working on a project together for a couple of weeks now and I'd been thinking about asking her out. I was never quite sure if the timing was right but I also didn't want to miss the opportunity if she might be interested. I'm not the best at reading signals, I admit, but she seemed friendly and open. We would often joke around and she didn't seem uncomfortable with me.\n\nThe situation came to a head yesterday when we were working on some code together. I leaned over her to get a better look at her screen (we share one large screen at our workstation). I noticed her choker was different, a new design, so I mentioned it saying it was \"super cute\" and then, in the same breath, I asked her if she'd like to go out for drinks sometime.\n\nShe didn't really respond, just kind of nodded and we continued with our work. The rest of the day was a bit awkward, but I chalked that up to it being a potentially uncomfortable situation.\n\nThis morning, however, I was called into HR. She had reported the incident, saying that my advances were unwelcome and that she felt uncomfortable with how I leaned over her and made comments about her appearance. I was totally blindsided. I thought I was just expressing interest in a respectful way, but I realize now that the situation could be perceived differently.\n\nI want to stress here that I had no intentions of making her feel uncomfortable or pressured. It was not my intention to invade her personal space or to objectify her. I simply thought we had a connection and wanted to explore that outside of work. Now, though, I'm facing disciplinary action at work, potentially even losing my job. My colleagues are aware of the situation and the general vibe is negative towards me. I'm really struggling here, both with the potential professional repercussions and feeling like a massive jerk.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA. You don't get to decide if you made somebody uncomfortable, the other party gets to decide that. You overstepped. \n\nShe's a woman in a mostly male dominated field, she's got to work twice as hard for half the respect. Please leave her alone.", "YTA for your timing (doing it while leaning over her was probably rather creepy) and making the work environment awkward, but you shouldn’t be losing your job over it.  If roles were reversed what would people be saying?  Calling the woman “empowered” for going after what she wants, right?\n(I’m a woman.  Met my SO of 12 years at work.  Good thing I didn’t report him to HR for asking me out.)", "YTA - You could've asked her out in a respectful manner. Instead you chose to invade her personal space and make her uncomfortable. You don't mention a single thing about her personality during the entire post... so yeah... YTA big time", "I'm sorry because I can tell you're struggling with this situation and probs didn't mean harm but... \n\nYTA even if asking someone out at work rather than a social function was ok (it's not) there was no reason to ask WHILE being in her personal space, that's not just creepy it's intimidating!", "YTA you could have controlled yourself but you chose not to. You assumed she would go out with you, why I don’t know, but you did because you were willing, at every point along the way, to completely destroy this work relationship.", "YTA for your behavior and now for this clueless description of the situation.", "YTA\n\nFirst, I'll say this, you can give a coworker a compliment, so long as it's done appropriately. If you don't sure what appropriately is, then don't.\n\nWith that said, complimenting someone *after* getting into their personal space uninvited is just creeper behavior. Don't do this at work, don't do this at the park, don't do it in the locker room (say \"nice cock\" from across the room like a normal horny person).\n\nYou went into her personal space, \"complimented\" her, then doubled down amd made an advance on her.\n\nNext time, run your approach by a responsible adult before you do something dumb", "YTA. Don’t hit on your coworkers at work. If you’re all out for drinks or something in a social setting then fine, but work is absolutely not the place to do it. There’s been enough harassment training and stories by now, you’d think it would sink in.\n\nEdit: don’t look down women’s shirts or be creepy; I feel like that goes without saying….", "I have two close friends who met at work. Blanket assumptions that this can't work is ridiculous, but this guy did fail to ask in a smart / appropriate way for sure. \n\nI do think the extreme reaction here is weird.", "ESH. You shouldn't make romantic advances in the workplace—a lesson I doubt you'll ever forget now. Your comments, while not egregious, were inappropriate for the time and place. \n\nThat being said, she's also an AH for completely overreacting and going to HR for something relatively benign. Her response was ridiculous and I have a feeling she's not particularly suited to working in a professional environment.", "NTA you didn't ask her on a date but for drinks, this is totally allowed in my opinion. This could have been platonic, nothing was said that was harrasing or sexual. The lean was a work lean and its not unusual to go out for drinks will those you work with.\n\nYes you like the her in that way and likely there is a company policy in regards to this not being OK. If it had been a date you offered and not drinks I'd say it was pushing a professional boundary.", "Info: would you lean over a male colleague?", "NTA", "YTA. \nYou're a man at a tech company - did you not pay any attention at all to the mandatory sexual harassment class they put you through?", "Just reading this made me uncomfortable YTA", "YTA. Creep.", "YTA.   I’ve been a woman in software dev for 30 years.   \n\nYou didn’t have to invade her space and hit on her literally at the same time.   Now, you’ve made the new girl feel singled out at a time where she is just trying to get her mind around a new job.  \n\nIf you get to keep you job, do better.  \n\nIf you don’t get to keep your job, do better when you’re the new guy trying to concentrate on learning your new job.", "Whoa dude. You didn’t say “Hey, you have really cute style!” \n\nYou leaned over her shoulder and breathily whispered into her ear and asked her out. Ew.\n\nDude. No. Personal space. YTA. WTF.", "Yikes", "So if you wanted to ask her out, waiting until you are leaning over her then asking is very creepy. Yta", "But wait…didnt you see the part where “she didnt seem uncomfortable with me”? So clearly she was in-love and was waiting for him to make the first move. \n\n*heavy sarcasm disclaimer*", "While true that he is the AH. Your statement is contradicted by statistics.  Forbes puts at 43% of people they surveyed met their SO at work. And it's a landslide for cheaters as most are acquaintances from work, followed distantly by exes. \n\nCNBC has it that 3 of 4 have been in a romantic relationship at work. So, while you don't want to be bothered at work, and the poor lady that he made a move on didn't want to be bothered, it's obvious that a lot of people welcome work place romances.", "> *\"Leaning over into a colleagues space\"*\n\nis 100% the norm in tech circles where you have to review each other's code.  Having already said this to someone else, I wasn't about to type it all again, so here's my own pasta:\n\nDo you work in tech? Have you ever looked at someone's code? Everyone has to lean over, men, women, all the various other gendered folks. EVERYONE. Women have leaned over my desk with breasts in my face, men have leaned over my desk with their junk in my face. It's just what happens.\n\nWhat shouldn't have happened, obviously is OP then making a comment about her clothes (bruh, what) and then asking her out (oh no bruh, what is you doin).\n\nBut, don't make this more than it is. OP was naive for doing this--and that's on him. But leaning over to look at code is about as common as drinking water with your mouth open.\n\nDon't be disingenuous.\n\n> *\"looking into her cleavage (my assumption)\"*\n\nApparently you can't help being disingenuous.  OP is a naive bumbling coworker.  And, he should be reprimanded.  But you have ZERO fucking evidence that he was looking at her breasts.\n\nAnd let's dispense with the ***ETHICAL*** talk.  It's not UNETHICAL; it's just the new social norm that people--especially men--cannot shit where they eat.  But let's not pretend like the guy did anything unethical.  It's not unethical to be attracted to someone at work.  It's just no longer socially acceptable to ask someone out there.  Those are different things.\n\nAnd if you want people to take your issues seriously, don't be so disingenuous.", ">Oh my god you’re the reason we have HR trainings.In what world did you think this was ok? At least, idk, get to know her outside work first?? \n\nRight? He should have totally just asked her out for a drink or something to get to know her outside of work... Oww wait.", "What was creepy about his behaviour?", "No it's not.  Do you work in tech?  Have you ever looked at someone's code?  Everyone has to lean over, men, women, all the various other gendered folks.  EVERYONE.  Women have leaned over my desk with breasts in my face, men have leaned over my desk with their junk in my face.  It's just what happens.\n\nWhat shouldn't have happened, ***obviously*** is OP then making a comment about her clothes (bruh, what) and then asking her out (oh no bruh, what is you doin).\n\nBut, don't make this more than it is.  OP was naive for doing this--and that's on him.  But leaning over to look at code is about as common as drinking water with your mouth open.\n\nDon't be disingenuous.", "is this a repeat story from them?", "No, but her choker is in line of sight of her cleavage…", "You had me until the last sentence.\n\n> You shoulda kept things professional ***~~and friendly~~***.\n\nPSA to other young, male, tech workers:\n\nIt's a sad state of affairs, but you can't be friendly to female coworkers now.  Judge everyone the same, make sure you have ample documentation before you call anyone out--especially a woman--and be just as harsh or as generous--as you would be with any other colleague.\n\nMake sure any criticism is justified--and ensure it's backed by evidence.  Don't go out with female coworkers.  Do not engage them in social settings unless you're in public.  And absolutely DO NOT get caught in any situation where you're alone with them without photographic evidence.  Don't drive female coworkers home.\n\nAnd, unless you're an 8-or-better and making 300k, (or whatever the equivalent is in Ohio or wherever else tech happens), just assume that you are already \"creepy\", and act accordingly.\n\nI was at a FAANG once where I said to the group: \"I had my wife look this over, so there shouldn't be any problem!\"  A female colleague came up to me, and said:\n\n> *\"I don't appreciate the insinuation that your wife looked it over and just because she's a woman, means that this assignment will be easy.\"*\n\nAt which point I said:\n\n> *\"This is my wife [worked at same FAANG, so was in the company directory].  She's a double EE/CS major from Berkeley.  I suspect she could code circles around you.  And, frankly, I don't appreciate your assumption that women aren't coders or aren't smart enough to look over this assignment to make sure there aren't bugs.  But, let's go to HR right now.  Come on; it's just one floor down.  Get your badge; let's go.  Let me page my wife; we can go together.\"*\n\nSHE COULDN'T HAVE BACK-PEDALED HARDER THAN IF A FUCKING AMPHIBIOUS LASER-WEARING-SHARK JUMPED OUT AT HER FROM HER KEYBOARD.\n\nSuddenly it was all:\n\n> *\"Oh, no, you misunderstood me!  We don't have to go to HR.  Let's not make this a big deal.\"*\n\nThey'll look for any excuse to give you shit.  Now, what OP did was naive and he's lucky he isn't getting shit-canned.  But, gents--if your father hasn't already taught you--don't shit where you eat, and protect yourselves.  You have a multi-million dollar career to protect.", ">  If you’re all out for drinks or something in a social setting then fine\n\nNope, even then that behaviour is still inappropriate. Full Stop.", "What professional environment do you work in where it’s acceptable to ask out a coworker and get in their personal space?", "Glad I don’t work with you, “she’s not used to working in a professional environment” ffs you’re an idiot, women deal with this everywhere, especially in tech which is male dominated. An environment where someone hits on someone me and invades my personal space while being a superior/senior employee is gross on so many levels.", "What? \n\n>Your comments, while not egregious, were inappropriate for the time and place.\n\n&#x200B;\n\n>she's also an AH for completely overreacting and going to HR\n\nLOL. This is what you do when someone behaves inappropriately at work. In one breath you tell him what he did was inappropriate, then call her the AH as well because she reported what you admit was inappropriate? JFC.", "It's not overreacting being uncomfortable and going to HR over this.", "If his behaviour isn’t permitted as outlined in their code of conduct (I’m assuming that is the case due to the speedy intervention) she absolutely did the right thing. Once an employer establishes the boundaries, infractions are meant to be written up and procedures are meant to be followed. This is all by the book and anyone feeling slighted by the outcome of OP’s misadventure needs to reconsider how they manage interpersonal relationships in the work place. All of the rules are real, all infractions count!", "> *\"That being said, she's also an AH for completely overreacting and going to HR for something relatively benign. Her response was ridiculous and I have a feeling she's not particularly suited to working in a professional environment.\"*\n\nI can't really agree with this.\n\nI had a young intern once, very attractive.  I was a director at the company, and her supervisor, so I suspect no one came within 1000 ft of her without exercising extreme discretion.  When I left--family leave--for a few months, she reported to someone else.  When I came back, and discovered that some guy had gone totally bonkers and kept asking her out and exhibiting all kinds of odd behavior.  She went to HR, and that was totally the right move.\n\nIt's a bad state of affairs, for everyone.\n\nIn my intern's situation, it's hard for someone--especially someone more junior--to avoid advances.  She's protecting her career, too.\n\nOTOH, for the hundreds, if not thousands of people, who would possibly make perfectly good couples, the dangers around what used to be a environment of rampant sexism combined with the new dangers around what is now an environment of rampant victimhood make it so that people of opposite sexes cannot really have social interactions at work.  Turns out, shitty people--on both sides--have ruined it for everyone.\n\nI don't think she overreacted.  That's just...par for the course.  I think the general state of the industry is a wreck--regarding these issues--but what she did isn't out of line for someone trying to protect their career.  Dude should be trying to protect his, though, and should NOT have made advances.", ">NTA you didn't ask her on a date but for drinks\n\nWow aren't you pedantic. Complimenting her on her appearance and being in her personal space and asking her for drinks.....can't imagine what the connotation of drinks could be /s\n\nHe was asking her out. He admits he's attractive to her. He never mentioned anyone else going. \n\nWomen are allowed to call out this BS now.", "If you’re going to cross that line you should probably wait until you have a clear confirmation that the interest is mutual and approach them about it outside work. His only sign here was that she wasn’t visibly uncomfortable in his presence.", ">I leaned over her to get a better look at her screen (we share one large screen at our workstation). I noticed her choker was different, a new design, so I mentioned it saying it was \"super cute\" and then, in the same breath, I asked her if she'd like to go out for drinks sometime.\n\n&#x200B;\n\nAlthough I agree that sometimes office romances are welcome. You should still keep it kind of professional in the workplace.\n\nAt the very least don't make it so obvious that you checking them out,  and then ask them out.\n\nOP might as well said, \"nice boobs, wanna hang out?\"", "And? What’s the stats on how many people are assholes?", "Worked in tech for years, and any time I've ever needed to look closely at someone's screen, I've asked if they mind and let them shift out of the way... and I do the same for others so we're not cheek-to-cheek. Not hard to do.", "I suggest posting this directly to OP so he may see your reply. I’m not reading your long as rebuttal to my tiny Reddit opinion. Happy Sunday! 😉", "Because THAT'S the only option. Couldn't, IDK, get a group of people together and invite her along. Talk to her at work and get to know her a little without being creepy. Nope, none of those options available I guess 🙄", "I don't know, maybe leaning into her personal space, and telling her that her choker was cute, then asking her out all in one motion. ¯\\\\\\_(ツ)\\_/¯", "Every fucking thing. This isn’t mad men it’s 2023, don’t be gross, the bar is so low and y’all  can’t seem to make it", "Fixating on a coworker and thinking she's hot and thinking it's appropriate to ask them out is a no no. \n\nOr have you been living under a rock for the past 5-6 years with women coming forward with being harassed in the workplace.", "She’s new to the job/team making it a position where it’s awkward to say no. Also he was all up in her personal space when he asked, which yikes. I would feel super uncomfortable working with someone who asked me out like that.", "'Creepy' is subjective, so I would suggest that it might be a good idea to keep in mind that if you're asking why other people find it creepy, arguing with them about it probably isn't going to do you much good. \n\nDoing all of this at work is a big misstep from OP, it's an environment where she's constrained in how she can respond to it, which is likely why she went to HR.", "It's totally my thought on the situation, drinks, a compliment and a work related lean. What do these people see that we don't?", "Do you work in tech? Are you aware of the issue with women working in tech? Just because you want to normalize it doesn't mean it's okay. Just because you don't have boundaries, doesn't mean others can't. \n\nIt's not being naive. This is a thing that men just need to stop acting like it's normal. Why is it ever okay to think you should ask out coworkers.", "Your mistake was assuming OP was naive, and you yourself are excusing the grossness that is tech. Weaponized incompetence anyone? Methinks you are benefiting from the dichotomy in tech so therefore me thinks you doth protest too much. Be better if you want to survive the next decade bro", "So did you take her to HR?  I hope so!", "If the people in this thread thought like you do, I suspect everyone's workplace would be a lot better.", "I Definitely don’t approve of looking down her shirt, that’s creepy to begin with, but asking a coworker out (respectfully) in a social setting would be fine; at least imo.", "\"That comment isn't appropriate for the workplace and I'd appreciate it if we could focus on the project.\" \n\nNot a particularly difficult sentence to say, it's professional, and it gives OP the opportunity to rectify his mistake without the threat of being fired. If he continued to make advances afterwards, then I'd understand escalating to HR. If he made some egregious sexual comment, then I'd also understand going to HR. He didn't; he complimented her and asked her out for drinks. When did adults using their words become such a difficult notion to grasp?", "Hence, why I said he was the AH. I was just contradicting an erroneous statement.", "Did I not say he was an AH?  Or didn't you read the whole post.", "\"Years.\"  Yeah, I'm not a zoomer or a millennial.  And before everyone was either being harrassed or committing microaggressions, this wasn't an issue.\n\nI've never once asked a coworker in the 90s whether I could look at their screen.  JFC\n\nWe ***have to***, now, because we have to protect our careers.  Now, I won't even be in an office or cube with a woman 1-on-1 unless I know there are operational cameras--especially if she's a direct.  I'll just ask her for a PR or a screenshare (not that I'm often that involved with coding anymore).\n\nI can't jeopardize mine; I've considered either CCTVs or body-cams, because this is HOW FUCKING RIDICULOUS our entire industry has become.\n\nIt's not that \"asking\" is hard to do.  But it's about as stupid as college campuses where kids have to ask each other to kiss.  If you don't see this as a HUGE SOCIAL PROBLEM, then our society has, indeed, gone to shit.", "Bro really said ‘I ain’t reading all that’ to a reply that completely destroyed their comment 💀", "Seems super awkward, yes. But not inherently creepy. The lean was work related also.", "You really berating me for asking a question? I haven’t hit on anyone ever, besides my wife. You’re not really explaining anything either.", "I get that fixating on a coworker is super inappropriate. Is that what he did though? Getting to know her outside of work first would be a better approach. Repeatedly bothering someone with stuff like this would also be bad. But like, he asked her out once and then left it. Now he’s embarrassed about it too.", "How constrained is she actually? Can she not set her own boundaries with her colleagues?", "We live in 2023 where it's not okay to be inappropriate with female coworkers on the clock. And where women have the power to admit they are uncomfortable and take it to the higher ups for documentation.", "Nobody here is supporting his actions, but it seems like some people think that what he did was an offense worthy of potentially being fired. He specifically mentions leaning over to look at code and asking her out for drinks, but some people are acting like he motorboated her and made an appalling sexual advance on her.", "I do.  Almost 30 years, in fact.  FAANGs, world class research facilities, startups.\n\nDownthread, I discuss why I think it's fine that OP's coworker went to HR.  I had a young (very attractive) intern as my direct, and she had issues when I wasn't around.  She absolutely did the right thing going to HR.\n\n\"Leaning over\" is not the problem, and claiming that is the problem is why your position doesn't hold water.  It's ridiculous.\n\n> *\"Why is it ever okay to think you should ask out coworkers.\"*\n\nBecause in most other industries, in most other jurisdictions, it's fine--and hasn't created the legal quagmires that we have now, especially in the valley.  For every Ellen Pao, there are a thousand people worldwide who date their coworkers.  And, ironically, in very progressive societies (like the Nordics) this isn't a huge problem.  The United States is one of the few places where we have the convergence of:\n\n1. Yes, sometimes men are assholes and creeps (Trump on down) and create utterly batshit hostile working environments\n2. Rampant third-wave feminist victimhood seems to be running an entire industry because even the women not subjected to the problem--even ever--seem to want to have something to fight about.\n\nMy ex (who you'll see down-thread) is an elite FAANG'er, won't attend the \"women in tech\" meetings and symposia they have.  Of the times she's gone, she feels most of the women are irrational, have no actual substantive argument, and there were maybe 1:20 or 1:100 who face these kinds of issues--and were not \"willing participants\"--and the rest couldn't debate their way out of a wet paper bag to defend their views.\n\nSo, yeah, I've seen it all.", "[removed]", "Whether or not there are problems in the industry is one thing.  I'm just going by OP's message.  Suppose he isn't naive.  The same thing applies.\n\n\"Leaning over\" is not the massive problem that some people in here are claiming it is.  I have literally had (tall) dudes' junk in my face, and breasts in my face.  That's not the issue.  None of that is harassment.\n\nThe issue is him commenting on her clothes and asking her out--both of which are unacceptable, and I support her going to HR about it.\n\nWhat I don't support is you folks making \"leaning over\" into something it isn't, when it's a norm.\n\nLearn to separate issues.", "I'm just rolling with the times.\n\nThe 50's weren't good.  I mean, ass-slapping?  *JFC*\n\nBut, the last 15 years weren't good.  \"Oh, they were talking about an actress in a movie, in the parking garage, after business hours?  ***HOSTILE WORK ENVIRONMENT!***.\"  *JFC*\n\nThe pendulum swings way too hard.\n\nIt's not enough, now, in the US, just to be a decent person.  You have to navigate this political and sexually-charged (just in a completely different way to the 50's) minefield that is the professional arena.", "> but asking a coworker out (respectfully) in a social setting would be fine; at least imo.\n\nYou are entitled to your opinion, but that does not mean you are correct.", "And if he continued to make advances, HR would have probably asked her why she didn't make a complaint the first time. It's better to get it documented now a days. \n\nWomen literally can't do anything right by you can they? \n\nIt's literally common sense not to ask out coworkers you work closely with.", "It's not her place nor her responsibility to have to reprimand inappropriate behavior in the workplace. When you ask someone out, the implication is you are physically attracted to them. You want to be in a relationship with them. This is 100% inappropriate behavior, and no one should have to put up with this in the workplace. \n\nThere are other ways to go about fostering workplace romance. Asking out the new girl just because you think she's hot, has dope fashion sense, and isn't repulsed by you is not that way.", "The issue is that she doesn't know him. If she said no to him, if she rejected him, how does she know he wouldn't retaliate by blaming her and making her job a lot harder, as a result? There's this fear that women in male-dominated industries have, and that's rejection of a co-worker/senior employee that could make your life hell if you do or say the wrong thing.\n\nAs nice as it would be to say what you did, women in male-dominated industries HAVE to be careful in how they respond. Because she doesn't know him, she had no idea if his response to her rejection would be kind or if he'd use it against her in her work, or worse. \n\nShe did the right thing in going straight to HR. What he did was damn weird; he leaned over her, complimented her in the middle of working, and then asked her out at a weird time. That was certainly not the time or place to ask someone out, and especially not leaning over them, essentially trapping them in a situation where they can't move or get out (she was sitting, he was standing, she could not get away if she rejected him and if he lashed out).\n\nThat's why she did the right thing in avoiding a potential escalation.", "She did use words in the way her employee handbook advised her to do! She didn’t stab him, she exercised her employee rights and reported him using words. I see a lot of comments suggesting employability is becoming a scarce resource. Obeying your code of conduct and anticipating the outlined reprimand be imposed for infractions is standard professional behaviour. Since the 80’s!!!!!! These aren’t high expectations to attain. They tell you what not to do, don’t do it if you don’t wish to be reported. Coworkers aren’t required to sweep ANYTHING under the rug. HR is there to sweep NOTHING under the rug and it’s unprofessional and stupid to expect they will.", "Are you really arguing that other people suggesting that you politely ask someone to move over is a 'huge social problem'?", "Oh please, it's always been an issue you're just made because people are actually calling others out for it now.", "Yeah, near 20 years. Congrats, you got me, I'm a millennial, though I'm not sure what that has to do with anything.\n\nI guarantee you this was a problem for women in the office for decades, they just couldn't say anything about it without fear of reprisal. I've heard stories from older friends and family that worked in STEM fields in the 70s and 80s. It was always gross, but they had no choice but to grin and bear it if they wanted to keep their job.\n\nYou're getting very worked up about acts of common courtesy and.... \\*checks notes\\*... the fact that people should ask before kissing someone? This is the sign of the fall of western civilization? \n\nAnd I've worked closely with women on my teams for years. Had them report to me. Done countless 1:1s and I've never once had a problem. You know how? I do things like ask to look at a screen (\"Hey, can I take a look?\"), give people a moment to shift out of the way, give people physical distance and follow their lead on how they want to interact. I've had people who wanted to always be arms-length away because they didn't like being crowded. I've had people who when they were excited wanted high-five.  And I never act inappropriately. It's really not hard.", "But it's not about looking at the screen. He didn't keep his gaze where it belongs and that's what made the \"lean\" inappropriate. It changed the entire context of the pose.\n\n>I leaned over her to get a better look at her screen (we share one large screen at our workstation). I noticed her choker was different, a new design, so I mentioned it saying it was \"super cute\" and then, in the same breath, I asked her if she'd like to go out for drinks sometime.\n\nWhy did he see her necklace from that position?? If he was looking at the screen he wouldn't be \"noticing\" it because the necklace and the screen are not even remotely in the same direction-- one is ahead of you, one is below you. By leaning over her and somehow inexplicably deciding THAT moment is a good time to look down at her neck/chest to see what she's wearing, he was basically looking down her shirt. There's no logical reason you'd \"incidentally\" be admiring someone's necklace sitting below you if you're focused on a screen ahead of you. That's what makes the pose inappropriate--- because he ***wasn't*** looking at the screen, not because he was. \n\nLeaning over someone isn't necessarily leering, but it becomes that the second you use that proximity to look down at their body and hit on them.", "Seems like you're the only who thinks so. You're in the minority.", "That’s not going to make me read it? Nothing can destroy my “comment” it’s an opinion. I have an understanding of how codes of conduct function because I’m literate an comprehend every one that I’ve ever signed. IT requires reading at a college level, so you should as well. 💋", "You don’t decide what other people find inappropriate", "If you’re going to lean into someone’s personal space, you need to ask. Work related or not, it’s something that should be maintained/considered in every situation.  I’ve had and witnessed people do it for both legitimate reasons and some for “unsavoury” reasons. I can sometimes tell by context but not all the time, and I’ve been wrong in more than one occasion. The fact that he asked her out after kind of trumps the business context. It’s about how they feel about it, not the intention. \n\nContext is important but different people feel differently about personal space. I’ve known people who absolutely hate it no matter the reason, people like me are a little more lax although I’ve ended up in situations where I’ve been taken advantage of because of that. I think it’s dependent on a lot of  factors like cultural norms, who it is, etc.  Bottom line is always be mindful and do not cross it unless the person tells you it’s ok. Even then, I would default to avoiding it. Better to be safe than sorry.", "You really think it's okay for someone to admit they think their coworker is hot and then compliment them, invade their personal space without asking, and then ask them on a date? \n\nYou really need someone to explain to you why this isn't appropirate work behavior?", "Okay so since it’s a woman’s job to teach you about social cues and apparently your mother didn’t let’s examine the situation-\n\nNew employee, an attractive woman in a male dominated industry….her senior coworker invaded her personal space then asked her out, she felt sh had to agree if she wants to keep her temp job and move up she is being nice to him to be polite. He’s being creepy and overstepping.\n\nWhen you want to make comments like this I encourage you to think of the very true quote that “men are afraid women will laugh at them, women are afraid men will unalive them” our reactions are in direct correlation with this fear, we are polite when we don’t have to be to keep the peace. Good for her she reported him to HR", "The problem was he asked her while they were working together on a project. Which means the time they’ve spent together has been mandatory and strictly professional. So definitely not the time to ask. Now she gets to rethink all the time they’ve been paired and wonder if he was being a coworker or trying to get closer to hit on her. And that’s not professional or comfortable in the work environment. \n\nAs others pointed out, this might have worked if he took the time to get to know her OUTSIDE of work but really he shouldn’t be shopping for girlfriends at work. It just isn’t worth it", "A lot of times, people don't just live it. Women have to be more vigilant with their safety and she did the right thing by reporting it and feeling uncomfortable. Any decent man with a brain knows this type of behavior isn't okay now a days. \n\nAlso most people know dating coworkers you closely work with is the worst idea on the planet.", "She's constrained in that it's a work environment where there are professional boundaries and relationships to navigate. Hence going to HR, who are very helpful when it comes to making it clear that someone has mis-stepped. \n\nAlso, it's work. She shouldn't have to 'set boundaries' about not wanting to be hit on or asked out by a colleague.\n\nIf you're just going to argue with everyone then I'm not sure why you commented here. You're obviously not engaging in good faith so I'll just end our conversation here.", "Would it still have been inappropriate if she was attracted to him and said yes?", "I, personally, have had men lean over to \"look at your screen\" and then had them stare right down my shirt. \n\nIt's a problem. It happens. You have no business speaking over women when it comes to sexual harassment in the workplace.", "Female appearing? How do you know I’m not female? \n\nMaybe you shouldn’t be switching accounts acting like you’re the only one who knows what they are talking about.", "I never mentioned the leaning over but here’s free advice for an unspoken thing…as women we have a good sense, or gut, whatever you want to call it. So if a more tenured coworker leaned and invaded my space nbd (I’ve been a bartender as well as tech so nbd on personal space) what guys don’t understand when they say “oh if he was handsome you wouldn’t be mad” NOPE it’s that her spider sense pricked up the instant she met this guy, he made her uncomfortable and was likely inappropriate much before this…(he was attracted to her and planking this from the time they met and she picked up on it) y’all don’t get it we know your intentions , you think your subtle but you’re not. As women we see what you’re doing and try to let you down gently so as to jot bruise your ego and get hurt, and are polite to coworkers we know we have no interest in hit we have to for work….so even tho we politely distance ourselves dudes that have zero social awareness ( which is very common i tech ) end up i these situations which are bad for everyone", "Just trying to understand here; are you saying that respectfully asking your coworker out, while you’re in a social setting, should never be done? If so why? Again, trying to understand, because I’ve seen that done a couple times before and it wasn’t an issue.", "If HR refused to help someone because they politely asked for the inappropriate behavior to stop before escalating, that's not a place anybody should be working at.\n\nI specifically said it was inappropriate behavior; nobody here is greenlighting what OP did. I'm not sure why this is so difficult for you to grasp. The only thing I'm saying is that the response to his actions was blown out of proportion; it's ridiculous that firing OP for this is even in the question.", "Out of curiosity, what do you perceive as an appropriate way to \"foster workplace romance?\"", "I'm saying that reaching the point in society where an otherwise-completely-benign interaction has to be avoided because I have no idea which way the prevailing (and often ridiculous) social winds are blowing is a huge social problem.\n\nDon't be disingenuous and repackage what I said into some ridiculous strawman.\n\nAnd, for those who have trouble understanding these ideas (a category which you seem to fall into), I even added an analogy--that we have an equally absurd situation in trying to regulate/legislate how teenagers and young people kiss each other, because of this same \"huge social problem\" which you seem to mock, which is the literal cause of having to adjust all our behaviors because of a few bad actors.\n\nSo, yeah, there is absolutely a huge social problem behind it.\n\nWhich, ironically, is what another commenters is on-about--that this issue is a ***RESULT*** of huge social problems.\n\nSo, maybe you folks could convene a meeting, get your stories straight, and then point your outrage in the same (general?) direction.  LOL", "I'm not mad.  I just think about my daughter's future, and the absolutely ridiculous interactions she'll have to have with people, if our society doesn't change the path it's on.\n\nSexuality is normal.  It doesn't stop at the front-door of the office.  I'm fine that we--as a society--say: \"Look, we have to address these issues, so everyone has to act like everyone else is a creep or a victim.\"  Fine; it's the price I pay for a society.\n\nBut that doesn't make it ridiculous.  It's like airport security.  It doesn't make us any safer, I can't go with my wife and daughter to the gate, it's all social \"security theater\".  And we endure it--but not because it makes sense.\n\nI've never needed to \"lean over\" a woman at work to look down her shirt.  That's pathetic.  I'm not mad about this issue, *per se*.  I'm just floored that someone needed to make this rule, because whichever clown (man, woman, or whatever everyone else is these days) was doing this.  Plus, like most men (but, unfortunately not OP) my father taught me how not to shit where I eat.  If I'm mad at anything, it's because you're making it harder for me to do my job.\n\nAnd, if it bothers you, you ***should*** call people out for it.  That's fine.  I don't begrudge you that prerogative.  But I do hate it that a few bad people ruin it for everyone.  I can't even imagine doing a mixed-gender startup in the environment that exists today.\n\nAnd, at u/Careless-Ad-6328 (because who has time to write all these things multiple times):\n\nI spent like 60-80 hours a week with those people.  I spent more time with them than I did my partners at the time.  If we had to do all this asking shit all the time, we'd never get anything done.  If some guy had his junk in my face, I'd just push him over and say: \"Dude, get your shit outta here!\" and we'd laugh and no one would care.  But, when a woman leans over me (yes, I've had some brilliant woman, even in hardcore dev positions) with breasts hanging out of her top, not only can I not push her, but I can't even say anything.  I just have to tolerate it.  I'm sure as shit not calling HR, because, well, 1) I have a career to protect, and 2) which kind of child gets upset by stuff like this?  You just change your behavior a bit.\n\nBut, frankly, the easiest women to work with are those who are willing to be treated like everyone else.  They'll push you back if you're too close and not assume you were making some advance.  They'll fart in your face during a code review because it's funny.  They don't mind being told that their code sucks--and they can dish it out as well as everyone else.\n\nWhat we all hated--without any gender preference--were women ***AND MEN*** who couldn't push back, who were sensitive about criticism, who saw every action as some infringement upon their sovereign identity, and every joke as some microaggression.  A successful startup is an elite space.  What we don't have time for is nonsense--whatever your gender.\n\nAnd, speaking of elite spaces, this is precisely the same kind of terrible argument that make people hesitate to put women in combat roles in the military.  It's absolutely not about their capabilities.  Imagine being in combat, and having to ask someone: \"Hey, is it okay if I jump in this foxhole with you?  Perhaps you could turn to the right a little, and I could to the left a little, so we don't have to touch boots.\"\n\nLook at these two badass women:\n\nhttps://www.npr.org/2015/08/18/432762408/two-women-become-the-first-to-complete-u-s-army-ranger-course\n\nShould they be allowed to be Rangers?  Hell, they finished the Ranger course, and even helped their male colleagues who were less able.  On the face of it, of course.\n\nBut, to take your view, we should, I guess, add a bunch of sexual politics to combat, because: \"It's not hard.\"\n\nBut, I've spent too much time on this already.  Feel free to have the last word (however bad the ideas behind them may be).  I have to get back to the wonderful women in my life!", "You being a millennial has to do with how little of life you've seen.  I've been in a decade longer than you.  And, my dad was in the field.  So I've had like a 50-60 year look at the field.\n\nYes, it absolutely ***CAN BE*** bad for women.  And we should make sure that those women have recourse.\n\nBut I also know when the pendulum swings way too far the wrong way.  Because that's just how society is now.  Just look at other political spaces.  We had bad behavior.  Then we had \"woke\".  And we're approaching \"post-woke\" now.\n\nThe fact that we have to make all these allowances--by default--makes it harder to do work, because I have to spend time thinking about people being comfortable.  Every workplace suddenly became less efficient.\n\nAnd you are (wrongly) conflating two issues.  All people (not just women) have the right to seek help--and be supported--if they have real issues.  But, not everyone has real issues, and changing our ***DEFAULTS*** to reflect the minority issues--as opposed to simply creating systems where we can address those issues and correct them--is hugely problematic.\n\nBack in the early 2000's, we had a coworker who has some tough OCD.  We noticed it during the interviews, but their skills were great.  We thought we could deal with it.  People were happy to accommodate, up to a point.  But, when it started affecting how everyone worked, we realized it wasn't going to be scalable to treat all issues by union'ing them together, and taking the lowest fucking denominator.  And this was long before WFH was any kind of social normal.  But we offered it to this guy.  Guess what?  Phenomenal success.  He was fine and comfortable, we could go back to being normal and not having to wash our hands in his view before having meetings (we literally tried this for a while, and patted ourselves on the back for being so \"progressive\" (-ly stupid)).\n\nSo, hypothetically, if someone has an issue with being close, they need to say so.  If her issues is needing so much space that we can't work in her cube comfortably, she doesn't get an office and we don't ask everyone to change their DEFAULT behaviors to accommodate her.  We simply give her an option to work in a different setting, so ***SHE*** doesn't ***DISRUPT*** everyone else.\n\nWhat we are doing now, as a society, is trying to change EVERYONE ELSE'S DEFAULTS.  What an insane, unscalable, untenable situation.\n\nYou just don't know it, because this is your \"normal\".  That's why your age has something to do with this.  But, I said below I had to run.  Feel free to have the last word, however misguided.", "Yes because I work in tech unlike most people here, of course I’d be in the minority.", "What was destroyed was your poor argument.  That you are trying to use a \"permanence of thought\" deflection just shows us you've taken a semester of philosophy.  Good for you--hit us back after 30 years in the real world.\n\nYou understand nothing; your \"codes of conduct\" are themselves a social neologism constructed in the past 15-20 years; I have a car older than these ideas.  The fact that you had to sign a \"code of conduct\" shows how ridiculous this situation is, but your comments aren't exactly proof of your \"literacy\".\n\nAll you've managed to do was attract a few upvotes by having a populist opinion (trust me, anyone can emulate Trump or Putin's tactics by being a populist) while having no original thoughts--or any worth having.\n\n@cattgravelyn - Still with you in spirit.  LOL--we're on the right side of history; just gotta let these folks go and create their silly dystopias.  They'll learn in time.", "Not asking you to read it, I’m just laughing at you", "In what way did I do that?", "I think you're absolutely correct. Having to ask whether you can lean in to be able to properly perceive what's on a screen seems excessive. I think that the people that have a problem with it are a rather small minority and should therefore be ones to adapt. In other words: If you don't like people leaning in, just say so. It shouldn't cause any problems.\n\nI've explained my stance on the guys actions in a lot of other comments.", "Well first of all, she’s not a temp. None of them had a higher rank than the other. Second of all, he leaned in to watch her screen. That’s completely normal.\n\nOther than that, nothing new there but thanks for the splaining.\n\nI’d like to investigate that quote though. How many women actually do feel like men are that much of a threat? Is there a way to actually know this? Evidently the first part isn’t all true either since a lot of men seem to have no issues embarrassing themselves while hitting on women.", "As OTHERS have pointed out? I pointed it out in the comment you replied to.\n\nThe things you're saying should put a strain in their relationship but it doesn't really make him a creep or an AH. Just socially inept, which is bad in it's own way.", "I asked in good faith but I just haven't been convinced of anything just yet. Still keeping my hopes up that these discussions can bare fruit though.\n\nA lot of couples meet through work and many of them start dating before spending time together outside the workplace.\n\nSimply being asked out shouldn't be strain on anyone. If it is then there's an underlying problem but the actual act of asking someone out should not be prohibited in my opinion.", "Literally not what happened, but nice trying to grasp for straws.", "Yes, because work hours should be kept work related.", "I didn't say it doesn't happen.  I don't have a problem with OP going to HR.  And if it happens to you, by all means, get to HR--get that guy shit-canned.\n\nBut if you think I'm speaking over you, then you're just on the noise side of the SNR.\n\nIt's that precise: \"It happened to me, so it must happen to everyone, and everyone must have the same reaction I do!\" that makes your position untenable.\n\nThere *is* a problem with OP here.  His comment and him asking her out.  What's ***NOT*** a problem--as the non-tech people in here keep suggesting--is the leaning over.  That's utterly typical in our industry.  Are you in it?  Do you know what you're talking about?\n\nIf OP were doing code reviews in order to get opportunities to look down her shirt, then, yeah, it's a huge problem--and that dude should be shit-canned.  But, OP doesn't say he's doing that.  And we don't throw people under the bus just because some bad thing happened to us that's somewhat adjacent to what's happening to someone else.\n\nI will speak whenever I damn well please.  Just as you will.  Some women being wronged is not the same as \"All men are wrongdoers.\"  Some actions being wrong is not the same as \"All men are wrongdoers.\"\n\nLearn to separate issues.", "I’m flattered you think I’m the other persons account I’m not lmao, I’m genuinely a different person who has a similar opinion 💀 \n\nConsidering the OP of this thread literally said ‘IT’ when referring to this job shows I might be the only person here who knows what they’re talking about", "It does happen.  And I don't have an issue with OP's coworker going to HR.\n\nI have an issue with the people who've never written a line of code in their lives talking about \"leaning over\" like it's some kind of problem.\n\nI don't need the free advice, because I had the fortune to have a father who taught me to not to shit where I eat and to have a family and environment that helped make sure I wasn't socially inept.  Plus, I'm married, and I stay well clear of the \"victim types\".\n\nI also steer clear of those who can't punctuate, capitalize, or use the \"enter\" key or button.", "It's 2023, if he wants to find a date he can go on a dating app. To hit on co-workers, even in a social setting is extremely inappropriate. When you are in a work environment, it is better keep things professional. Keep your work life separate from your personal life.", "I'll remind you what you said. \n\n>Her response was ridiculous and I have a feeling she's not particularly suited to working in a professional environment.\n\nBy saying that you are green lighting what OP by downplaying it did and victim blaming her. She's allowed to go to HR anytime for what she sees fit. It's freaking obvious you don't pull this kind of behavior at work. It is literally nothing new. It's on OP if he loses his job. He should have known better. \n\nA lot of places have a no tolerance policy. If OP is at risk of losing his job, he went directly against a direct work policy. HR isn't there to just fire someone because they have nothing else better to do.", "You are! You’re part of the problem. People like you make offices a worse place to be!", "I've never had a work romance because I think they're a terrible idea... But, I've seen plenty. Good and bad. The good ones happen organically. Which takes a long feckin time...\n\nYour job is not a pub where you can just shoot your shot and shrug your shoulders if the guy/girl says no and move on to the next one. It's bad enough to have to go to a job every fucking day and grind, but even worse when someone wants to get romantic with you outside of work because you've been nice for two weeks, you're a snappy dresser and laugh at my jokes.", "Don’t", "We're not gonna reach these people.  I had a Stanford swimmer on my team once.  He must have been about 6'4\"/6'5\".  I'd have integer overflow counting the number of times I had his junk in my face while he was leaning over.\n\nPeople here are just wild, and looking for any excuse to crucify a guy.  What he did was wrong (comment/asking-out).  But \"leaning over\"?  People are ridiculous.", "My fiancé’s a programmer and when I showed him this post, his reaction was “and this is why women don’t want to work in tech” so maybe you should do some self reflection?", "Post something interesting if you need attention. We’re done here.", "You’re a sea lion and you know exactly what you’re up to in this thread.", "lol. The way you did that was by saying the lean was work-related. \n\nHad he leaned in, said, \"Hey, this code is looking good. We're going to crush the timeline\"... then later complimented her choker and asked her out... still inappropriate and worthy of an HR report, but not as creepy as the lean in accompanied by the rest. He was using that as a way to get close to her and be skeevy. \n\nAnd OP claiming he didn't notice her choker until he leaned in is absolute bullshit. I mean, come on. You don't have to get in someone's personal space to notice a choker.", "Women are constantly explaining dangers and threats. Then the chorus of “not all men” pipes up. It’s exhausting.", "Omg dude simply google a twitter or Facebook or insta post of that meme “what would you do if you were a man for 24 hours” WE ALL KNOW YOU’RE A THREAT AT ANY GIVEN TIME AND WE ADJUST OUR DAY TO DAY ACCORDINGLY” for example we live by a beautiful river and I love to exercise by running / walking there, but I would never do so after dusk or before 6 am when the other people are out. Bet you never had to even think about that as a man? Added that my daughter developed at 12 and she’s been aggressively hit on by grown men to a scary point. \n\nNo man should chime in on this because you have no idea what it feels like to be in that position. Listen to women for once. Believe our experience simply existing and trying to live our lives for once. Shut the f up and listen, you’ll learn something which I’m sure is new for you", "\"She's part of my project team\" implies that it is OP's team - ie. OP is the team lead, and therefore in a superior position to the woman, who was a new hire.\n\n\"Leaning in\" to see someone's screen isn't actually normal. \"Next to\" is normal. Leaning over someone is an invasion of personal space. Yes, sometimes it's unavoidable, but that doesn't make it less of an invasion of personal space. \n\nAnd talking about someone's physical appearance while you're in their personal space, and asking them out in the process? Come on!", "Most of us…", "You did, my apologies. \n\nUnfortunately that kind of social ineptitude is creepy, whether or not he had bad intentions.", "It’s a hypothetical and I’m interested to read your response. I’m not trying to make a case or prove a point. Just having a discussion is all.", "I don't think you'd say the same about two people having a random non-work-related conversation at work.", "Your argument boils down to it happens all the time in tech so it’s not a problem in tech. That’s circular logic.\n\nYou are clearly speaking over me, a woman who works in tech, who has been sexually harassed in tech under the guise of “code review”. \n\nI’m not the only woman this has ever happened to, sexual harassment is rampant in the tech industry, and you are stepping in to trivialize my experience in order to further normalize this conduct.", "So you know the careers of every single commenter here?", "Oof. You’re the worst kind. Performative empathy while still pointing out I had some typos. Idc and likely she didn’t about the leaning over, it’s everything else. \n\nHowever you have filled the classic role of incel by focusing on the tiny details instead of acknowledging the greater social issue. I’m sorry for your pain. I have no problem with coworkers who lean over me on the regular because they’re not making creepy comments or asking me out while leaning so, yeah, being pedantic is a super awesome way to win in the interwebs when I was just trying to offer constructive criticism and another perspective…I’ve worked with a ton of these dudes that genuinely don’t understand how they’re being creepy and have tried to expand their world view to help them with the ladies 🤷🏼‍♀️", "Interesting. Thanks for clarifying :)", "It's 2023. I have several colleagues who are dating co-workers. It's perfectly possible. I'll be attending the wedding of two colleagues later this summer.\n\nMy employer does not prohibit relationships between colleagues, but does insist that nobody in a relationship should have line management authority over the other, plus all the usual prohibitions about harassment.\n\nIn OP's case, the problems are:\n\n1. The woman he's asking out is in a subordinate position to him.\n2. He asked her out whilst inside her personal space. Perhaps it was necessary for him to be there as part of their job, but if you're forced to be in close quarters with someone for work, that's very much not an appropriate time to ask them out.\n3. Admiring her choker whilst leaning over her from behind? Perhaps you weren't staring down her top, but if you lean over someone's shoulder, and compliment the jewelry around their neck, everyone, including the person you are complimenting will think you're looking down at their chest.", "I said she's not particularly suited to working in a professional environment because she immediately escalated to HR when a simple sentence would have sufficed. Was OP's behavior inappropriate? Yes, undoubtedly. If I were in the room I would have pulled him to the side and explained this to him. Is the response he's getting proportional to the crime? No. After reading the post, OP comes across more ignorant and naïve than malicious and predatory.", "Just know you have some support, as disappointingly sparse as it is.", "Agreed. Asking out was inappropriate but the leaning in is something they won’t understand. That’s okay though, not our fault", "wtf does that actually mean? I truly don't know what I'm \"up to\". Just trying to have a discussion. You know, the stuff that drives civilization forward...", "You're making a lot of assumptions that you simply can't know are true or not.", "I agree “not all men” because I know and love some amazing male humans.\n\nBut it’s always a man in the  end, isn’t it?", "Did I say that though?", "No, not all women hide in their homes from dusk till dawn.\n\nMany women have to face a lot of bullshit. Specially teenagers like your daughter is soon to become. I have a daughter myself and I get anxious about her getting older for this reason alone. \n\nThis doesn't mean women can't differentiate between men who are potential threats and those who aren't. The way you're talking about it sounds like women should be afraid of their own fathers.\n\nWhere are you getting your information about this? Social fucking media? No wonder I feel like I've read the stuff you're typing a thousand times before. Maybe take a proper gender studies class before berating people online, yeah?\n\nI get the part about women having more authority because of experience but that shouldn't exclude men from the conversation. You see no progress otherwise.", "If you're in a basketball team, you'd say \"She's on my team\" which doesn't imply that it, in fact, your team but a team that you're also a part of, so that part is wrong.\n\nWe actually don't know whether he leaned in from the side or over her.\n\nI kinda agree with you on the last part. It's inappropriate and could even be deemed creepy but I think we're missing too much information to determine that.", "What do you base that off of?", "Well that depends on if you're aware of the person's social ineptitude or not. If you are then you should be able to read them correctly, which she evidently did not. Working that long with each other I feel like she should've been aware of his ineptitude, unless she's just as inept as him.", "I'm not interested in hypotheticals based on the information presented. \n\nYou are trying to prove a point. Maybe go ask your wife about any harassment she's faced over the years. Or your mother. Your grandmother. Any woman in your life. There's my point.", "A certain amount of small talk or social etiquette is to be expected. That doesn't equal hitting on someone and asking them out and I'm pretty sure you're well aware that they're not equivalent in the slightest.", "I can tell who’s bullshitting and who’s not, yeah. The OP of this thread 100% isn’t in tech, they might be in help desk IT but that’s a STRETCH. You are not in tech because you would have pulled the card already if you are and now you’re trying to bluff out of it; the other guy who is agree with made his points which display his experience.", "Buh-bye, now!", "First of all, I'm married, and I have a daughter.\n\nSo, no, my concern for them is not performative, nor is my general empathy for women's issues or people's issues.\n\nI appreciate your use of a slur, though.  Enjoy your warning/ban/suspension.\n\nI have no pain.  Ironically, I've done women's advocacy during my professional career, about women with significant problems.  DV and victims of familial abuse.\n\nAnd, in that work--as well as the public sector and NGO work I do now, I see two kinds of women's leaders.  There are those who understand what the real issues are, and think that poor arguments hurt their position, and the kind who will take any supporters, with good ideas or bad--hoping that they'll shout louder than the rest.\n\nYou're the latter kind of supporter.\n\n> *\"and have tried to expand their world view to help them with the ladies\"*\n\nTo \"have tried to expand their world view to help with the ladies\"...If there's anyone who's utterly misguided here, it's the one of us with terrible ideas.\n\nYou seemed to miss the larger point by, ironically, focusing on the snark.", "Thank you for listening. I hope you have yourself a nice day! ;)", "What about the countless other women who took that approach and it only made things worse. Or the ones who would be questions as to why they didn’t report immediately? \n\nI took that approach with a coworker of mine and i had to tell him no multiple times before he gave up. Then another major incident happened with him and my boss had to interview us all and asked about our experiences and guess what I got asked? Why didn’t you come tell me about this immediately? Women can’t win and do anything right can we?\n\nYou’re lucky to have never been put in a situation like this before.", "It's Reddit.  I knew it was coming the instant I decided to put fingers to keys.\n\nThanks, though!  Appreciate it.  Glad there are still sane people who can separate bad acts (commenting \"super cute\" and asking someone out--come on, buddy) from \"OMG HES PRACTICALLY RAPING HER BY LEANING OVER IN A CODE REVIEW\".", "Lmao k", "Sure, but so are you.\n\nThe one assumption I'm not making is leaning in, giving a compliment and asking for a date is 100% inappropriate and there's really nothing you can say to defend that. I mean, you can say it, but you'll just be a fish out of water, slowly dying in the sun.", "Kindly, sir, shut the fuck up and don't tell women what they should think and feel or how seriously they should take their safety", "I carried mace open in my hand from age 17-26 while commuting between nighttime activities. I was chased at least 6 times", "We don’t hide in our houses and your mansplaining point about how women can differentiate potential threats? Yes! The woman in OPs story likely pegged him as unsafe and a creep from their first interaction. We have a spidey sense about these things which were to often ignore because politeness.\n\nAnd to your point about social media, I get it, I work in tech. But that quote is not wrong. Ask your wife and daughters that question, give them the space to answer honestly you’ll learn something.\n\nAlternatively there’s a bit Wanda Sykes does about how women’s lives would change if we had a detachable p*ssy- Ike allll the things we could do and go to it we didn’t have to be worried about our safety. As a father of daughters I strongly encourage you to educate yourself.", ">\tWhere are you getting your information about this? Social fucking media? No wonder I feel like I’ve read the stuff you’re typing a thousand times before. Maybe take a proper gender studies class before berating people online, yeah?\n\nHave you taken a gender studies class in the last 20 years? Because the quote you’re so butthurt about is paraphrased from something Margaret Atwood wrote in 1989 and is regularly taught in gender studies courses in the United States. \n\nSource: the critical feminist theory classes I took at a top 20 law school plus every undergrad course I took involving gender for my human rights degree\n\nIt’s also pretty ignorant and dismissive to act as if women aren’t or shouldn’t be cautious of men when [half of all female murder victims are killed by their intimate partners](https://www.npr.org/sections/thetwo-way/2017/07/21/538518569/cdc-half-of-all-female-murder-victims-are-killed-by-intimate-partners), the vast majority of which are men, AND [the leading cause of death in pregnant women is homicide](https://www.hsph.harvard.edu/news/hsph-in-the-news/homicide-leading-cause-of-death-for-pregnant-women-in-u-s/). Maybe take a proper gender studies class before berating people online, yeah?\n\nEDIT: I saw in another comment you said you were from Sweden so it’s understandable that you wouldn’t know anything about gender dynamics in the United States. However—and this is a MASSIVE “however”—multiple people in this thread told you about their lived experiences as women in North America and you not only dismissed them but *argued with them about it.* Did it not cross your mind that you might be wrong at all???", "Being a woman and knowing lots of other women. Why are falling on this weird sword here?", "I have. My wife has faced a lot of harassment and has even been the victim of rape. We've had many long conversations about the topic. Something you seem incapable of. If you're truly not interested, why are you still replying?", "Yeah but you said yourself that work hours should be work-related. Did you actually mean that or was it poorly worded?", "Some of us don’t blast what we do for a living on social media for various reasons. I think you just think you’re high and mighty.", "I'm sorry that happened to you and I hope the guy in question faced the appropriate consequences for his behavior. \n\nAs for your last sentence, I certainly have been on the receiving end of inappropriate comments at work before—and they were several magnitudes worse than the comments OP made.", "Sorry, but I'm keeping my mind open to a lot of hypotheticals since we don't know all the facts. That is not the same as making assumptions. You, however, did make several assumptions and there's really nothing you can say to defend that. I mean, you can say it, but you'll just be a fish out of water, slowly dying in the sun (or whatever that's supposed to mean)", "I'm not doing that. Maybe actually read the words I wrote?", "Yeah, like I said. A lot of women have to face a lot of bullshit. I'm sorry you had to go through that though.", "You shouldn't have to be a father to know these things and I actually sort of am educated in the topic. I've aced  several classes related to gender studies.\n\nIdk why you're making so many assumptions about me when you actually don't know me. Why wouldn't I give my wife the space to answer my questions? I'm the one asking them. Why would ask questions of which I'm not interested in hearing the answers to?\n\n>Yes! The woman in OPs story likely pegged him as unsafe and a creep from their first interaction. \n\nYou simply don't know whether that's likely or not. For all we know, the story could be completely made up.\n\n>We have a spidey sense about these things which were to often ignore because politeness.\n\nA spidey sense? Like a gaydar? Come on, be serious.\n\nAlso, it's not mansplaining if you don't actually know the things I'm talking about beforehand, which you seemingly don't.", "I am not a woman but I know a lot of women too, so our data samples should be fairly similar. Still too small a size to be able to determine anything concrete.", "Projection. This post coincidentally described this pervert too, and he took it personally. But if nothing's wrong with op, nothing is wrong with him either! Perfect logic, as expected from a creep.", "Then I find it hard to believe someone has to explain to you why this behavior isn’t okay.", "I’m not blasting people but we are in a post about the tech industry. If someone made a thread about farming potatoes and an investment banker started commenting nonsense advice I would call that shit out too.", "YTA.\n\nYou leaned over her, so you were very close to her and had a good view of her chest, commented on her appearance, then asked her out.  I can guarantee she felt very awkward and quite possibly cornered/unable to escape.\n\n1)  Don't ask a coworker out after just a few weeks.  Take time to get to know them, don't just go, \"Wow, me so horny and you so hot.\"\n\n2)  If you must ask a coworker out, do it in an open area where the coworker can say, \"No\" and leave without needing to walk past you, so they feel physically safe turning you down.\n\nOn top of that, all you've commented on are her looks, which implies that you only value her looks not her personality or her intelligence.  It's really difficult to work with someone who doesn't value you as a person, just as a Barbie doll to play with.  Putting up with tech bros like you is really discouraging.  I wouldn't be surprised if she's left other jobs because she got tired of being a pretty object instead of a valued coworker.\n\nYou deserve at least a written PIP for pulling that stunt.", "You didn’t just compliment her choker you. In the same breath, as you were physically close to her, you asked her out for drinks, which really isn’t the same as asking someone out on a date, or coffee, or something casual. You weren’t respectful, and that’s why you came off as a skeez, whether you intended to or not. You are 100% the asshole here.", "Generally when a man is leaning over us to look at a screen and then complements us on a necklace/scarf/blouse…he’s actually complementing our tits (while staring right down at them). Think back, can you recall what her boobs looked like at the time? You don’t have to answer me, but if you can remember…you were looking hun. Even if you weren’t, that’s likely what she thought you were doing. It feels so gross and violating, especially if she thought you were a “safe” guy to be around. You owe her an apology. \n\nYTA", "I mean YTA, but some of the comments on this post are like...quintessential redditor clueless nonsense. It doesn't even sound like you know anything deep about her beyond finding her physically appealing. Making an effort to treat other people at work as idk full complex human beings will help you in your future. Pairing a \"compliment\" with a question I imagine for her was overwhelming. And you didn't even do it giving her physical space. Like during work hours and during code review?? Can you imagine how disappointing that is? One second you're a colleague and the next you're some object.", "YTA\n\nApproaching people at work is touchy anyways, so you need to be aware that:\n\n1. Do not mix work interactions and personal interactions. If you're interested in someone, approach them at the end of the day, like trying to line up leaving the building together, and then just give them your contact info and say, \"I'd be interested in getting to know you better outside of work, here's my number if you feel the same, no hard feelings if you don't\" then head off to your car/bus stop/whatever\n\n\n2. Never compliment coworkers on their appearance. Just don't. At most, something neutral and positive, such as, \"hi, good to see you!\" is acceptable\n\n\n3. Read the room. Look over your work's rules regarding workplace relationships, and take a beat when assessing whether the object of your affections would be interested in your potential affections or not. Small cues like wearing headphones in the break room, leaving the vicinity for lunch, limiting social interactions  etc all point to an individual who would like to keep their work and personal lives separate", "NTA unless she is your subordinate.", "YTA hugely. You're being paid to work, not treat the office as an in-person Tinder account. If you want to have a girlfriend, get Tinder on your phone or head to a bar at the weekend. You've created a hostile work environment because you are too busy thinking about satisfying your own sexual desires, rather than be professional.", "YTA. And my mother wonders why I'm single with men like OP around...", "YTA this post made my skin crawl. How could you possibly not know how inappropriate your behavior is?", "YTA. What kind of pretzel position were you in that you could be standing over her from behind, looking at the computer screen, and just \"notice\" the choker she was wearing?", "YTA. This is like something out of a cheesy HR video.\n\nEdit: I feel like this needs to be plastered over the internet as much as possible… someone being polite and kind to you doesn’t mean they have romantic interest in you. Touch grass. Big r/niceguys vibes from this post.", "Don't root where you get your loot. Always causes problems", "Yta\n Don’t try to date coworkers. It is not appropriate in this century", "YTA. \n\nYou were in her personal space, made an observation about her appearance, and then asked her out. Yikes. \n\nIt’s true that many people meet their partners at work…and many people don’t. For example — one of my coworkers asked me out while we were both standing at a counter making tea. “Hey,” he said. “Congratulations on your award! Can I take you out to dinner to celebrate?” \n\n“That’s really nice, but no, thank you.” \n\n“Alright……did you see that article about [human capital topic we work on.]” \n\nHe wasn’t in my personal space and we were in a relatively public place. He wasn’t my boss. I felt totally safe saying no, and he accepted my “no” graciously and changed the subject. Nothing about our interaction made me feel like I should report him to HR. The situation you describe, though, has none of the respect for space (physical or intellectual) he showed me.", "YTA.\n\nDon't ever hit on or ask out a coworker. It contributes to a hostile work environment.\n\nWhat you did went beyond a friendly compliment.", "So I actually had exactly the same situation. Except I wasn’t an immediate creep and focused on common interests and successfully married her\n\nGive that a try, but too late for this one\n\nYTA and RIP", "yta for being a walking talking liability", "YTA. Work is work, not a dating site. Don’t shit where you eat.", "I only had to read up to “I was immediately attracted to her. She has this…”. YTA", "YTA. Stop harassing her for fucksake", "YTA most ppl go to work to make money not to make friends or try to find romantic relationships. My favorite quote is don’t shit where you eat. \n\nIf you want a hookup/ date there are plenty of apps for that. Don’t make anyone feel uncomfortable in the workplace", "If you want to ask someone out that you work with, do not do it when you’re leaning into their personal space and commenting on their appearance. \n\nIn the future, wait until you are not in close physical proximity (as in not leaning over her) and then say something such as “I am going to x coffee shop/bar/restaurant/etc if you’d like to join. It’d be fun to get to know you outside of work, but no pressure.” \n\nA lot of people say not to ask people out if you work with them. Idk. I feel like people do meet SOs at work. But the way you did it was not appropriate. \n\nAlso you talked about her physical appearance but didn’t mention her personality beyond that she didn’t seem to feel uncomfortable around you. Sigh. \n\nYTA. Learn from this. Do better.", ">. I was immediately attracted to her. She has this distinct style, often wears colorful clothes and chokers, which are uncommon in our otherwise pretty professional and subdued dress code. I've got to be honest, I think she's really hot.\n\n\n>It was not my intention to invade her personal space or to objectify her.\n\nThese two are incongruous -- pick one.\n\nLeave this girl alone, man. YTA", "YTA. Don't act creepy. I was going to write don't act creepy to coworkers, but just don't be creepy at all.", "YTA.\n100% always assume any woman you are *working* with is there to work and not be an object of your affection. \nBeing nice? Getting along? Always assume it’s because…she’s a professional.\nThat you’ve probably had to read employee handbooks and sit through sexual hrasssment training at some point and still hit on your coworker *while in the actual office* is exactly why those laws exist.", "YTA. Think with your brain. No one wants to deal with advances at work. The office is not a night club. Just because someone is nice to you doesn't mean they are interested.", "Even if there was an appropriate way to ask out a coworker, (which many will argue there is not) doing so while you are physically leaning over them while already talking about work related subjects and commenting on their appearance is definitely not it.\n\nHonestly, in the future please never ask someone out or hit on them while physically encroaching on their personal space in any situation, not just at the workplace. It can be incredibly intimidating and uncomfortable, and make them feel unsafe.", "“Not my intention to invade her personal space or to objectify her”\n\nBUT YOU DID IT ANYWAY\n\nYTA", "You’re not in trouble for complimenting her outfit, it’s for asking her on a date. \n\nYTA for deliberately misframing  the question. Don’t assume everyone is as dumb as you want them to be.", "I hate the leaning over.  Not only does it feel degrading like a teacher standing over you checking your work, but it also can feel like they are in a position of control over you and can be intimidating.  It’s no wonder she didn’t say anything then.  He intentionally put her in a position of intimidation.", "Slapped her ass and called her toots.", "I hear the wetness and I’m flashing back to 100 different creepy incidents so thanks for that", "Also, let's make this super clear, OP. This isn't about commenting on a coworker's outfit and you know it. My colleagues regularly tell me they like me xy or z item of clothing. They don't do it while breathing down my neck and asking me on a date.", "well then he's fine because she's his subordinate /s", "I disagree slightly.  I've had coworkers comment on something I wore, but it was done in a friendly manner:  \"Hey, nice shirt\" or \"That's a good color for you\" and then the day proceeded as usual.   Compliments on skill (like having good taste in clothing) are usually fine.  Compliments about body parts (\"Hey, that blouse really shows off your curves\") are bad.  Of course, none of my coworkers were leaning over me nor propositioning me at the time.", "Blanket assumptions and witch-hunting of men are AITA specialties.  My SO and I met at work as well, 12 years ago.  I’m glad he took a chance on asking me out and I certainly didn’t tattle to HR.  Just because this particular guy made it awkward doesn’t mean his life needs to be ruined.", "Damn shame you got so downvoted when all you did was lay out straight facts. You didn't even defend OP at all, quite the opposite in fact. Those facts are backed up by raw anecdotes everyone has of someone in their life meeting their partner via their work. I will do my part to upvote the truth.", "Is it possible that it varies by job? Like I dated coworkers when I had retail jobs that I didn't take seriously. I think a lot of people are likely to date at work but more so if they don't see their job as permanent.", "Leaning over - not an issue.\n\nCommenting on her looks while he has her pinned in place - bad.\n\nAsking her out while she's pinned in place - very bad.\n\nWhile we can't guarantee he was looking at her cleavage, I can guarantee that's what he gave the impression of while leaning over her and commenting on her looks.", "What a steaming pile of nonsense.", "But he was leaning in creepily and leering...when is an opportunity like that gonna just fall in your lap?", "Well, reading comprehension isn't the strong suite of a lot of Reddit commentators . Plus, they hate when facts get in the way of their perceptions. But thank you, kind person, from across the internet.", "“He has her pinned in place”. \n\nDid he tie her to her chair? Was the chair bolted down, unless other office chairs that freely roll?\n\nNext: “Cuffed and shackled her in the dungeon of his creepy aura.”\n\nYes, he was wrong to comment, let alone ask her out. But let’s not start concocting nonsense. This kind of utterly disingenuous crap is why it’s dangerous to take ideas like the ones you—and others in this thread—are generating seriously. \n\nShe was new, and what he did was 1) not good, and 2) potentially coercive b/c she was new. Not coercive physically. \n\nSo, suddenly, leaning over to review some code is “pinning someone down”? Someone call the boys in Guantanamo, b/c someone here on Reddit has some amazing new interrogation techniques. Good lord. We have already stipulated to: “OP is wrong.”\n\nWhy are you doing mental-triple-axles to exaggerate it to some absurd, ridiculous, personal invention? Is it so that it will fit some equally ridiculous personal narrative? Sure seems that way.", "Getting in someone's personal space and asking them out at work is creepy. There's no ambiguity or mystery here. The guy also needed to tell us she's hot before he told us about almost getting fired for creeping on her.", "No, it is because you are misrepresenting the information.\n\nThe CNBC article says that most of the relationships dont work and their is a good chance that a significant number of them are affairs.\n\nAnd the Forbes article says that while 43% of people found partners, 40% of those were affairs.", "Nobody tied you down when Steve, the hot swimmer from Stanford paintbrushed you with his cock and balls, but you sure love telling that story.", "Depending on the positioning, he may have been partially or completely behind her while leaning over so she couldn't roll her chair back to get out, thus pinning her where she was.  I've had people do that to me on occasion.  Thankfully, I haven't had an AH coworkers that hit on me while doing so.", "Not misrepresenting anything. You can try to nit pick all you want, but whether they are new relationships or affairs, they are still work place romances or hooking up. And maybe a little news for you, most relationships don't work out.", "But casually getting consent is \\*hard\\* and \\*not how it used to be\\*.", "To answer this, in case you are being genuine in your questions: yes. The method used is what makes it inappropriate. Her willingness to go out with him makes it awkward.  \n\n\nHad he casually, at day end, said \"hey, want to grab a drink sometime?\" in a method that was completely non-intimidating (body language wise).... that's arguably still unethical but also a lot different. That's an ok situation to get an acceptance or refusal, in my books.", "regardless of statistics & facts at the end of the day if you're at work you should be WORKING not tryna find your next romantic fling.", "If people asking you to fuck off/stop being a creep is a \"huge problem,\" I have fantastic news for you.", "when i was being SA, all i could think was how he was gonna unalive me, and where he’d put my body. i think it any time i go for a walk and a car drives by slow. i have since i was a young girl, i was taught it was a consequence of being a woman - men will want to hurt me. that is the reality of womanhood.", "Yeah, you're right, \"simply being asked out shouldn't be a strain on anyone\", except it too often is. We have no way of knowing how the person asking will take rejection, which puts us in an extremely awkward position as others have already described. Harassment on and off the job after gently rejecting a colleague's advances is not uncommon. So yeah, there's definitely an underlying problem, and it's often men's sense of entitlement to their female co-workers'attention, as OP clearly demonstrated.", "Please read the comments before wasting you're time. This conclusion was made several hours ago.", "When you learn not to distort an argument into some twisted strawman to fit some crappy populist narrative (*a la* Trump), feel free to check back.  I know how tough it is to have middle school homework and try to formulate thoughts on Reddit.\n\nApparently you and the other guy have a problem with being disingenuous.  I'm old, bunny rabbit.  I can see through your social agenda.  Trust me, kid, whoever your \"she\" is, she isn't gonna care that you can parrot the party line.  Think better; she'll thank you for it.", "\"But IT guys rub their unwelcome cocks on people all of the time!\"\n\nFantastic defense, what was anyone thinking? Nobody gives a shit how much you like Paul from Jersey rubbing his balls onto you, and the fact that you're all for it doesn't mean everyone is, Jesus Christ.", "I think you're right about everything but your interpretation of OP. I'm reading in a lot of things like social ineptitude and reckless spontaneity but not entitlement. A lot of people are way too entitled when it comes to how they regard others though.", "Ah, ok, so you're not genuinely asking. Noted.", "I think  we'll have to agree to disagree on the team thing: in that circumstance, I always say \"we are on the same team\". \"My team\" is a formula I reserve for the team of kids that I coach.\n\nOP says \"I leaned over her\", which to me reads like he was standing behind her, and leaned over her shoulder - quite possibly with one hand on her chair.\n\nIf he sat / crouched next to her, and leaned in from the side, he wouldn't say \"over\".\n\nI have a guest chair I pull over in such circumstances, so someone looking at my screen can sit down next to me and be comfortable.", "Here's the information you're missing:  \nShe agreed rather than rocking the boat, then reported it to HR.  \nConclusion: it was probably creepy.", "So she is to blame for not recognizing his creepy actions as being social inept? She just started working there, many people learn to mask their neurodiverse tendencies very well. Some people can hide it for years so how is she to blame? Even if she could have recognized, your statement that “she should have been aware of his ineptitude” is rife with victim blaming mentality and is quite disgusting. How could she have kept him from being inappropriate?", "I did do that. You're just late to the party.", "I'm not from America. My country is far more developed when it comes to equality and we have our own rich history of feminism. That would explain why the quote wasn't a part of our literature. We didn't need it. Even so, I'm still at liberty to criticize I'm the quote. \n\nI've taken two classes that were primarily focused on gender studies and it was also a large part of other sociological courses. All of them in Sweden between 2016-2022. Please don't act like your perspective is the only legitimate one.\n\n>It’s also pretty ignorant and dismissive to act as if women aren’t or shouldn’t be cautious of men when half of all female murder victims are killed by their intimate partners, the vast majority of which are men, AND the leading cause of death in pregnant women is homicide.\n\nYou don't have to have studied feminism academically to be familiar with these kinds of statistics. They've been around a long time. Think about what the implications here are though. This is about domestic violence. It has very little to do with hostile work environments.\n\nPS: If you want to be taken seriously, I wouldn't be using words like butthurt. It's kinda silly.", "It does say \"leaned over her\", so I was wrong about that part. Seems worse now.\n\nI don't think I'm ready to agree to disagree about the team thing though. A team could be leaderless and you could still say something like \"You're on my team\" or \"My team scored last minute\". You could even say \"My team\" about a team that you're rooting for but not a part of.", "She agreed to what exactly?", "I don't feel like it's that hard to identify social ineptitude of that scale. I'm not victim blaming. I think her reaction was pretty normal. I don't really see her as a victim either. This is just a really bad situation because people suck at communicating properly.", "Welcome to reddit, where life is not a real time chat."]}