{"id": 17924, "submission_id": "13ouv5x", "title": "AITA for not spending the weekend with my family because there's going to be a child present?", "selftext": "I (26F) have been raised by my grandma since I was one and we lived next to my aunt and uncle who had a farm. By the time I was around 8, my aunt had two kids. I started to get shipped off to her house a lot and was expected to babysit all day while they worked on the farm. I made my cousins food, fed them, played all day with them, bathed them, changed their dirty diapers, put them to bed and I was also cleaning the whole house. Sometimes if my aunt and uncle came home and I didn't clean, they would make me feel guilty for it. They would sometimes bring me along to activities with their family and buy me clothes (grandma was poor) and would use that to make me feel bad about not doing chores. My cousins were the worst sometimes. Their parents were always fighting and also yelling at them, just overall being toxic and not meeting their basic emotional needs, so they were difficult to deal with. They also came a lot to my house and they were always up my ass. I couldn't sleep alone, they were fighting to sleep in my bed or sit next to me at the diner table or they would have a tantrum if I wouldn't take a bath with them. If I complained or said no, my grandmother and my aunt would jut berate me until I said yes. I felt like I had no power over myself. Anywhere we were going like restaurants or family functions, I was expected to take care of them or any kids present. I was basically a built in nanny and maid. Anyways, I moved out at 17 to a city a couple of hours away from my hometown. I don't talk a lot to my family and they don't talk to me as well. I started to have a relationship again with my grandmother, and for the most part it's going well. It all leads us to this weekend. I was expecting to spend my time off with her and my great aunt, but then she told me that a 7 year old girl (my great aunt's granddaughter) was going to be there, and that she was so excited to spend time with me. I asked why and my grandma said \" well because me and your great aunt are old ladies, it's going to be nice for little girl to have someone closer to her age\". Y'all. What can I possibly have in common with a 7 year old? The PTSD kicked in and I had a panic attack, I felt like I was expected to entertain a child yet again because I was always automatically expected to before. I told my grandmother I wasn't coming anymore because I was too anxious and she tried to get me to come anyways but it was too late, the whole thing was spoiled for me. My grandma sounded sad and and we haven't talked since. I'm waiting for the other shoe to drop. I feel bad because she's getting old and I should be spending more time with her, but my mental health is precarious and I'm just always on my guard with her and the rest of my family. So AITA?", "created_utc": 1684771071, "permalink": "/r/AmItheAsshole/comments/13ouv5x/aita_for_not_spending_the_weekend_with_my_family/", "score": 465, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I believe I might my TA because I canceled plans with my grandmother over something that might be all in my head . She’s getting old and I feel like I should have just sucked it up and went anyways, even if my suspension turned out to be true. I want to know if I’m overreacting or I’m actually right in doing what I did.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nYou were guilted into parentification for years and are done with it.  It sounds like grandma wants more of the same.  Even if she doesn't, she's trying to put you in a situation where that could happen again pretty easy.   \"Oh, just watch her while we go play cards with \\[insert 3rd person\\] for 6 hours.\"\n\nJust stay home.", "NTA\n\nWhile it wasn’t children, I rarely visited my family for a similar reason. \n\nMy middle school and high school years I lived with my father. He was a mid-level manager in civil service, his wife (my stepmother) was only one grade level behind him. They made great money. But she raised dogs and he had a farm. \n\nAll of my free time was spent working, either taking care of the dogs or farm work. He took off a week for my spring break every year, and I’d be working with him on his farm. I had massive lists of chores every day in the summer. My weeknights were farm work until the sun went down. Weekends were farm work. \n\nI HATED that farm and those dogs. Since leaving home I have visited, but always got a hotel room. I have dreams to this day of my visits being turned into farm work trips, or cleaning up after dogs.\n\nI’ve visited home maybe a dozen times since I joined the Navy in 1991. \n\nI don’t blame you a bit.", "NTA. What your grandmother, aunt, and uncle did to you and your cousins is abusive. It is not okay to force parental responsibilities on any child let alone an EIGHT year old. You and your cousins all deserved caring parents/family who met your emotional and physical needs and you were all denied that. It is 100% okay to have boundaries around similar situations no matter who is trying to push the issue, and it is especially valid since your grandmother enabled the abuse to begin with. I hope you are able to access therapy/other support to work through this.", "NTA- offer to take your grandma out for lunch or coffee if she wants to spend time with you.\n\nBut you need to be more stern with them and say that you will not be baby sitting anyone’s kids. \n\nAnd if that’s the only reason they want you around , then you know what to do and keep your distance.", "NTA. Your granny is still trying to pimp you out as a nanny.  Protect your mental health and don’t let granny lie to herself that you *enjoyed* having the responsibility that was dumped on you as a child.", "NTA", "NTA!\n\nYou were abused as a child. I hope are able to get therapy for your PTSD.", "NTA they are expecting you to care for this child. I would just call an apologize tell them something came ups Md you are no longer able to vidist", "So sorry you went through all of that. \n\nNTA,  and your grandmother wants to visit with her sister this time. Go another time when it's a visit with just the two of you.", "NTA It sounds like you were volunteered for babysitting yet again without your consent. It's time your family hire a babysitter or do it themselves. Tell your grandmother you'd love to spend time with her but on your terms (meaning for coffee or lunch at a restaurant).", "NTA, good for you for putting yourself first. You've paid all of your babysitting/nanny dues. Live your life, don't feel guilty for doing so either. If your G-ma can't have 1:1 time with you then so be it. That's what facetime, Zoom and Teams is for. You are allowed to say No and not feel bad about it. They're clearly taking advantage of you and your kindness. No more! Be happy and keep moving forward! NTA!", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (26F) have been raised by my grandma since I was one and we lived next to my aunt and uncle who had a farm. By the time I was around 8, my aunt had two kids. I started to get shipped off to her house a lot and was expected to babysit all day while they worked on the farm. I made my cousins food, fed them, played all day with them, bathed them, changed their dirty diapers, put them to bed and I was also cleaning the whole house. Sometimes if my aunt and uncle came home and I didn't clean, they would make me feel guilty for it. They would sometimes bring me along to activities with their family and buy me clothes (grandma was poor) and would use that to make me feel bad about not doing chores. My cousins were the worst sometimes. Their parents were always fighting and also yelling at them, just overall being toxic and not meeting their basic emotional needs, so they were difficult to deal with. They also came a lot to my house and they were always up my ass. I couldn't sleep alone, they were fighting to sleep in my bed or sit next to me at the diner table or they would have a tantrum if I wouldn't take a bath with them. If I complained or said no, my grandmother and my aunt would jut berate me until I said yes. I felt like I had no power over myself. Anywhere we were going like restaurants or family functions, I was expected to take care of them or any kids present. I was basically a built in nanny and maid. Anyways, I moved out at 17 to a city a couple of hours away from my hometown. I don't talk a lot to my family and they don't talk to me as well. I started to have a relationship again with my grandmother, and for the most part it's going well. It all leads us to this weekend. I was expecting to spend my time off with her and my great aunt, but then she told me that a 7 year old girl (my great aunt's granddaughter) was going to be there, and that she was so excited to spend time with me. I asked why and my grandma said \" well because me and your great aunt are old ladies, it's going to be nice for little girl to have someone closer to her age\". Y'all. What can I possibly have in common with a 7 year old? The PTSD kicked in and I had a panic attack, I felt like I was expected to entertain a child yet again because I was always automatically expected to before. I told my grandmother I wasn't coming anymore because I was too anxious and she tried to get me to come anyways but it was too late, the whole thing was spoiled for me. My grandma sounded sad and and we haven't talked since. I'm waiting for the other shoe to drop. I feel bad because she's getting old and I should be spending more time with her, but my mental health is precarious and I'm just always on my guard with her and the rest of my family. So AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA", "Your mental health comes first. Tell her that you're sorry if she's disappointed, but you cannot and will not be around children. If she doesn't know, explain why so she doesn't put you in that situation again. Also, if you can, get some therapy because having a panic attack like that is not good for you. I'm so sorry this happened to you. I'm glad you were able to say no. Please don't feel guilty. NTA", "NTA. Now your g'ma knows that if she wants to spend time with you, she can't bring little kids to the situation. You have every right to make that a condition.", "NTA", "NTA gram needs to get a clue. just cut them all off, you only have bad memories of them.", "There could be an AITA - only childcare topics 😳 it is the biggest pain of humanity or what? 😭🤣\n\nMore than job related, love, and neigbors fight topics combined… (I guess not)", "NTA. Poor OP…\n\nThanks for sharing, your writing was very moving and well written, and your story interesting to hear. 🙏", "NTA. I don't know if you've told your family how awful it was for you to be forced to care for children all the time. They were expected to do those things as children, and they may have no idea that what they did is now considered abusive parentification. If you want to, maybe have the conversation. An apology might help you heal.", "Thank you for your words. It is true that I have been denied a lot when I was younger, I still feel the effects today. I want to go to therapy but when I talk about it I start to shake and feel sick. There’s a lot more than just being a nanny and maid and it’s hard to accept that I was neglected as a child because I was always taught to just get over any hurt I had, physical and emotional. Like one time I literally broke my leg and my grandmother wouldn’t bring me to the hospital. I couldn’t walk on my leg for about 4 months, but when my cousin and my brother broke their leg, they were immediately taken care of. Every body was verbally abusive to my grandmother except for me, I always tried to help her and comfort her when she was crying because of my family members, but for some reason, she always gave everything to the people abusive towards her and asked nothing of them, but everything of me. I gave so much, I can’t give anything anymore.", "This.\nNTA", "I’m a psychologist and I work with a lot of trauma - many of my clients had similarly abusive/neglectful childhoods (as did I), so I understand how hard this is to talk about.\n\nIf you do want to try therapy, don’t start with the trauma. Tell your therapist that you want help setting boundaries and developing coping skills for anxiety - you can slowly work your way up to the trauma and start getting into it when you feel ready. With a lot of my clients, we spend *months* developing coping skills before we go into the past. Sometimes we’ll start on the trauma, only to realize they aren’t ready - so we put a pin in it until they are.\n\nA good therapist will be able to help you assess your readiness for trauma therapy, and they won’t push too far - they’ll meet you wherever you’re at", "It might be better for you to remove her from your life. I know that sounds harsh but I think she took enough from you.", "I'm so sorry. Your childhood sounds traumatic. It's probably difficult to see when you're in the wrong (as an adult), because you spent your entire childhood being \"in the wrong\".\n\nI can tell you without hesitation that you are NTA here. I also think you need to put some strict boundaries in place with your gran, if you do want to continue the relationship.\n\nThe first one would be: do not change our plans without consulting me. If you do, I will not visit and we'll have see each other some other time.\n\nThe second one might be: if I'm visiting you, I do not want to spend with other people.\n\nThe 3rd one might be: I have no interest in children so don't expect more than the bare minimum of courtesy from me if you've invited children. I will not chat, play, supervise, entertain, or anything else. Don't even ask.\n\nOf course, you need to think about what your personal boundaries are. I just made some up based on the story you shared.\n\nThe trick is explain in a very natural way, and without getting visibly emotional, what is and is not acceptable to you. And then stand your ground. Don't be swayed by guilt, bribes, or threats of blackmail.", "NTA and I'm so so sorry you had to go through all that! Please protect your mental health and peace of mind over everything else. Have you been able to go to therapy?", "NTA. You weren’t babysitting by the way, you were experiencing parentification. Obviously there was a reason the kids fought to sit next yo you and wanted you to sleep with them and such because you were the one raising them. To them you were just a very young mommy/daddy combo to them. It’s too bad it created the PTSD for you. I hope you can find a way to work through all of this but the only way you would be the AH is if you ignored your mental health and went any way.", "NTA- make this a clear boundary because it sounds like the aunt would still happily abuse your time.  \n\nIt’s ok to say no.", "NTA, they need to acknowledge the trauma they’ve caused you.", "I told my grandmother a couple of weeks ago. She’s not really good with this type of conversation tho. I try to let her know about stuff and how it affected me as gently as I can so she doesn’t take offence and start yelling because at that point conversation is impossible. And that’s what I’m trying to tell her, that I’m not mad at her, and I’m not trying to put blame on her, but I just want her to know and I want to have a conversation about it. Sometimes she understands and sometimes she refuses to believe me. For instance, I told her about some male family members that have touched me inappropriately when I was younger and she outright told me she didn’t believe me. Or she said I was to much of a prude, or too sensitive. Another time I told her that one of my earliest memory was of her getting beat up by my granpa, and she denied he ever touched her, even tho everybody else remember him being violent. And when I told her about my feelings towards my aunt, she said if she knew, she wouldn’t have made me go as much. But the thing is, she did it too, even in our home. She has selective memory and anything that paints her as being a bad person she forgets. I try to put my limits as much as possible without it ending into a fight, but yeah it’s complicated.", "NTA", "Think about it. All  you are to them is a sitter. If your grandmother really cared about you, if your great aunt really cared about you, the visit would be about getting to reconnect...but no, it's about you sitting for the old girls to catch up. I'm sorry, but you need to move on. NTA..", "NTA! Stand your ground. I cant believe these  witches are haunting you with the next generations..", "Simply tell her you will visit ONLY if it’s you two alone. NTA", "And she woudl not spend the time with her GM.  She would be caretaking for the 7 yr old.  Don't spend time with GM on her terms- spend them on YOURS. Or spend no time at all- which is what I had to do to finally end the parentification.  I was 25 before I went on a visit to my aunt that pulled this shit for a visit with my mom, and was demanded to clean up a meal I did not eat after I had driven 6 hr the prior day.  I declined- fits were throw, guilt trips were tried...and I never went back.", "Your childhood sounds awful, I feel sad for you reading this.  To be honest, I don’t think you should be trying to reconnect with any of these people, including grandmother.", "I am so so sorry. I understand feeling like you want to protect your caregiver who loved you. I have felt that hopeful feeling that, if you explained your feelings right, they might finally understand. But the fact is that your grandmother was also one of your abusers. You can love her and have empathy for her, but her treatment of you was not appropriate. If you are not ready for therapy, then at least give yourself permission to take some time and space away from family, including grandma. \n\nIf you are willing to try therapy after a bit, start only by talking about the immediate past and future. What happened last week? What is coming up next week, and do you need a plan for it? Your therapist can help you be more sure of yourself. \n\nSorry you are going through this, but I know you will. You are already following your gut and keeping yourself away from harmful situations that others are trying to push you into. Keep listening to that feeling!", "Are you able the admit to yourself that your grandmother is abusive? It wasn't just your aunt and uncle.", "That is so incredibly helpful, gearing up before diving in! I only wish I had dad therapists this competent when I was a young parent. They kind of did the opposite.", "NTA.\n\nHave you ever spoken to your grandma about what she did to you? Does she actually know this is a problem for you?\n\nIf you're going to have a relationship, she probably needs to know. At that point...well, if she doesn't care, that tells you what you need to know about your relationship with her.", "NTA. It's not your job to look after other peoples children! And having a child take care of a child is just ridiculous. I guarantee if you go they will expect you to watch the kid the entire time.", "The OP needs to never see her grandmother again. That woman is an abusive AH and the best thing would be for the OP to forget she exists.", "I'm so sorry. Selective memory is such a cruel and toxic  manipulation tactic. And you're right, my mom and grandma were the same way. Makes relationships hard to maintain, cause they're never real with you. You did what you could and now you do what you have to. I'm glad you're standing up for yourself.", "NTA.\n\nYou were abused. By everyone, grandma included. Physically (what the duck, they didn't take you to get your broken leg looked at???????), emotionally, and I guess sexually, if I'm understanding one of your comments correctly. You have PTSD. You were treated the way no child should be treated, EVER. They're *still* trying to abuse you, your grandmother included. You mentioned your grandmother has no \"memory\" of anything you've told her about. That's another form of abuse (I have a family member who does that, too).\n\nYou deserve so much better. You deserve to have boundaries and to have those boundaries respected, by EVERYONE. If that means going low contact/no contact with them is the best thing to do for your physical (PTSD is physical, too) and mental health, do it, and keep working with a therapist. \n\nYour grandmother is an abuser, and old age and her \"raising\" you doesn't mean she's worth your physical and mental energy...because the abuse is still happening. It hasn't stopped, and I'm so sorry.\n\nI wish you the best of luck and healing, OP. You deserve so much better than you received from them.", "You know home isn't great if the military is an improvement.  Been there myself.", "OP your grandma was never your caregiver she was just an adult that you had no choice but to live with. Your grandma does not have selective memory. She's pretending it didn't happen because she doesn't want to look bad. She knew that she could've & should've protected you but she was only concerned about herself and whoever she chose to place on a pedestal. Yes, she was in an abusive relationship that she might've not been able to escape from...but she didn't have to hurt you by denying that it happened. She still cares more about her own image than loving you. She chose perverts over you that had no hold over her life. She was and is toxic. Even if she went thru the same things as a child or as a woman...she still knew it was wrong. Just because someone's gone thru hell doesn't mean that they have to make someone else suffer it too. And I do mean make, because if the abuse happened under her care and she chose to turn a blind eye to it, then she basically handed you to your abusers on a silver platter.", "NTA... put it out there that there will be no more childcare EVER. Not to ask and dont expect you to befriend any young relatives.  \nBeing used and manipulated into full time child care growing  up has left you triggered by it.", "NTA - your grandmother may be old but that doesn’t mean she’ll go next.       \nI’ve said this before - age has nothing to do with death.       \nBoth my sisters died at 40 all of my grandparents lived well into their nineties.      \nDon’t feel guilty because she’s getting old.   \nIf you’re worried about your time with her is running out.         \nShe should also be thinking that her time with you is running out.", "Maybe I’m reading too much into this, but it kinda sounds like your grandma thinks you enjoy spending time with younger kids. As though that’s why you took care of your cousins all those years.\n\nShe either somehow managed to never notice what your life was really like, or she’s rewritten it all inside her own head so she doesn’t have to feel guilty for the part she played in robbing you of your childhood.\n\n…or maybe I’m wrong. Either way, NTA.", "NTA. Grandma and Great Aunt were thinking to have a nice quiet chat while you took care of the kid.", "Denial of abuse is continued abuse.\n\nI'm not sure if a relationship with your grandma is healthy for you"]}