{"id": 1794, "submission_id": "yplelg", "title": "AITA for refusing to gift my wig to my cousin who is a cancer patient?", "selftext": "I (f17) love collecting wigs. I have had some lower quality wigs (synthetic) and growing older i wanted to upgrade my collection. I got a job at 15 and saved up until this year since they are so expensive where i live.My parents are divorced  my dad almost never does anything for me and i never get any pocket money so i buy all of these by my own money, it’s like a form of therapy to me (ik weird). \n\nNow my little cousin (f9) got disgnosed with cancer a few months ago and has been on therapy which led to hairloss. We dont live in the same country but its a 3-4 hours drive and we do visit each other from time to time. I have a very great relationship with my cousin, we're pretty close and i even allow her to play with my wigs which i don't allow anyone to. Now there's this specific wig that my cousin likes the most and she never mentioned anything about it but her mother (my aunt) came to me and told me to give her that wig as a gift before they leave, she wasn't even asking. I asked her why would i? And she said i just have to because i can buy another one. I usually gift my cousin random things i think she likes or she talked about to me but I bought that one for 500 in USD and asked her if she's willing to buy it, she stormed off and went to the living room and started telling everyone how i asked her to buy my wig instead of giving it to her like im supposed to. My cousin heard that and she've been ignoring me which im pretty sure its because she told her extra stuff behind my back.\n\nI hate how she's trying to ruin my relationship with my cousin and this is not the first time but i personally don't want to give my wigs because i worked really hard to earn that amount of money which is almost impossible to earn for a highschooler where i live, AITA?", "created_utc": 1667912195, "permalink": "/r/AmItheAsshole/comments/yplelg/aita_for_refusing_to_gift_my_wig_to_my_cousin_who/", "score": 1597, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > For refusing to gift my wig to my cousin who is a cancer patient because they're expensive\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. \n\nI understand that your aunt is hurting, but what kind of person demands a $500 gift from a 17-year-old? It would have been different if she offered to pay for it.\n\nI would be nice of you to gift your cousin a wig that she likes, but it doesn't have to be that expensive.", "**NTA**  for not giving in to your Aunt’s demands to give up an item you spent $500 on.", "NTA. Are they aware it costs $500 and do you think your family could all chip in or could they start a GoFundMe or similar to buy a wig her size? You shouldn’t have to give anything of yours unless you wish to do so, regardless of cost.", "NTA,  but your aunt is greedy and enabling behavior to your cousin that it's ok to demand things without working hard for them. Your aunt was trying to take advantage of you. Good for you for standing your ground.", "If I'm being generous, I'd say your aunt has lost her mind to fear and grief, and she's flailing around for anything that would make her idea of her child's life right now seem better. I am sure the young patient isn't focused on getting a share of your collection, it's just her mom who fixed on the idea.\n\nShe's way out of line, even if she can't see it at this moment. It's also way out of line to enlist flying monkeys to extort a teenager.\n\nIf the relationship can be held together and if your cousin gets to where it is her desire to wear a wig, you can be her expert advisor when she shops for one. Maybe. If your aunt doesn't destroy everything in her anger, fear and pain. I'm sorry you are in this dumb position. You're NTA.", "NTA. Your aunt has no right to make that demand of you. Shame on her.", "NTA. The wigs belong to you, you have no obligation to give them to anyone. Do you have a less expensive one you can offer her?", "NTA\n\nBut can you ask your mom or dad to reimburse you for this? I am sure your aunt is just crazed with a child who has cancer, and isn't thinking straight.", "NTA. You don’t have to just give your cousin an expensive wig because your aunt told you to. She went about that all wrong. Your cousin has cancer, that’s a terrible thing. But there’s other options aside from trying to browbeat you into giving her something.", "NTA\n\nDemanding that you gift someone something is just messed up.", "NTA $500 is a lot at anytime, let alone what you've been able to earn at 17.\n\nYou were fair in asking for payment for it.", "NTA\n\n&#x200B;\n\nYour aunt is an AH. Sadly, your cousin is being poisoned by her.\n\n&#x200B;\n\nDo not let them guilt you in paying for her.", "NGL, had us in the first half.  I was going to say of course Y, but $500 as a 17 year old?   NTA.  Even for the cousin with cancer.", "NTA at all, your aunt seriously could've asked to buy it from you or talked to you about her getting a wig in a much more respectful way. the entitlement is crazy", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (f17) love collecting wigs. I have had some lower quality wigs (synthetic) and growing older i wanted to upgrade my collection. I got a job at 15 and saved up until this year since they are so expensive where i live.My parents are divorced  my dad almost never does anything for me and i never get any pocket money so i buy all of these by my own money, it’s like a form of therapy to me (ik weird). \n\nNow my little cousin (f9) got disgnosed with cancer a few months ago and has been on therapy which led to hairloss. We dont live in the same country but its a 3-4 hours drive and we do visit each other from time to time. I have a very great relationship with my cousin, we're pretty close and i even allow her to play with my wigs which i don't allow anyone to. Now there's this specific wig that my cousin likes the most and she never mentioned anything about it but her mother (my aunt) came to me and told me to give her that wig as a gift before they leave, she wasn't even asking. I asked her why would i? And she said i just have to because i can buy another one. I usually gift my cousin random things i think she likes or she talked about to me but I bought that one for 500 in USD and asked her if she's willing to buy it, she stormed off and went to the living room and started telling everyone how i asked her to buy my wig instead of giving it to her like im supposed to. My cousin heard that and she've been ignoring me which im pretty sure its because she told her extra stuff behind my back.\n\nI hate how she's trying to ruin my relationship with my cousin and this is not the first time but i personally don't want to give my wigs because i worked really hard to earn that amount of money which is almost impossible to earn for a highschooler where i live, AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA\n\nI'm 100% sure the adults in the room were able to pay you a portion of your wig, instead demanding you, a 17 year old child who worked hard to earn the money to buy the wig, didn't have to work double as hard to buy another one. Like $100 each between 5 adults.", "it would be different if she at least ASKED not demanded", "I have 2 human hair wigs the other being a little more expensive and apparently I have to give the one I mentioned because it fits her and looks more natural other than that I have synthetic or ones that don't look very realistic.", "Don't give her the human hair ones. You shouldn't have to give up something you worked hard for.\n\n If the other's are unacceptable, maybe you can suggest her mom look into charities that give kids with hair loss wigs. I know there are a few of them.", "NTA. No one has the right to demand anything from anyone. She’s probably upset and fearful, but that doesn’t mean you demand other people’s property. She also probably has no idea it was $500. Most people do not know how much wigs cost.", "NTA. I had cancer as a teenage girl back when the only wigs available were hard fronts. I got the nicest one I could, wore it about five times and hated how it felt. I can’t imagine a child having any patience with it. Your wig is very expensive and you worked hard for it. Many charities help with nice, free wigs nowadays; they can easily get one from there.", "I had 2 or 3 beautiful wigs in high school too. My favorite was one that was half pink and half black and cost me almost $600. A friend from high school asked for it and then stole it when I said no. I tracked her down and got it back but it was seriously a challenge that involved law enforcement and grandparents. Lol/smh. \nCase in point, don't come between a woman and her wigs. NTA.", "NTA- but would a wig that fits an adult size head even for a child?", "NTA. Emotions are high, yes but that doesn't mean she can just start demanding to be given things.", "NTA", "NTA. It’s rude and selfish to demand a gift. It’s beyond rude to demand a very expensive gift.", "Nta. Dont give it to them. \n\nThey can buy one themselves or check into charities that help kids with cancer. I believe there are some that will give wigs to kids for free or very cheap. \nYou shouldnt have to give up your property you paid for, just because she likes it.", "NTA she is making a demand of your belongings. She has a lot of nerve. NO if she wants her daughter to have a wig then she needs to get off her butt and buy one. And not make demands on a 17 year old.", "NTA\n\nthat's expensive asf and to expect your teenage niece to just hand it over? That's rude!", "Nta", "NTA she should have asked for the info to purchase one for your cousin, not demanded you give her yours.", "NTA\n\nThey are being really unfair.\n\nBut they have had a really scary diagnosis for their much loved child. They aren't thinking rationally.\n\nCan you email your Mum/ Mom, the cousin's Dad plus the aunt on one email or WhatsApp group?\n\nApologise that it's all got heated ( not for not giving that wig) and offer a link to the wig you bought? Then a link to a less expensive version of the same style? They will see how expensive it is.\n\nGoogle charities like Locks of Love or the Little Princess Trust ( I'm UK based) in your country. There will be some help with wigs for kids with cancer. Get hospital will know someone on the area. Then your little cousin will have one which fits a child size head not an adult size?\n\nTheir reactions will tell you a lot but please don't give that wig to your cousin when you are being bullied into it. State that it doesn't fit, it won't stay on etc on your email. A hard wearing synthetic is better for a kid as wigs need maintenance. \n\nI send you good wishes and luck to your cousin.", "NTA and no one can demand you give anyone anything! That is yours and you paid a lot of money you earned yourself for it.", "She shouldn’t demand things from the OP, but I am pretty positive the aunt didn’t know it was $500. People do not understand how expensive wigs can be.", "This answer is 10/10.\n\nNTA.", "My first thought when I read this was would the wig even properly fit the child? She's nine. She is not at her full height and development. Where I am, wigs and hats are in child and adult sizes. I am guessing that a 17 year old would buy an adult wig while a 9 year old would need a child size. So, will it even fit properly?\n\nDid the girl want the wig? She plays with it and likes it but that's a whole other ball game from wanting to wear a wig. Many children and adults do not want to wear wigs. Instead they wear hats or bandanas if they need to. \n\nWhy did the girl's mother think you would give the girl a wig from your collection? Why did she think it was  appropriate to demand that you do so? You are 17, she is an adult. If her child wants a wig, she needs to take the girl to be fitted and get her an appropriate wig.\n\nNTA. You are not required to give your wig away and there many reasons not to do so. Your aunt, however, is a big A for demanding it.", "NTA, maybe bring up starting a fundraiser, like bake sales or lemonade stand?", "NTA. And as a precaution, I'd make sure your good wigs are under lock and key until your family leaves--I wouldn't put it past your aunt to try and steal it.", "NTA - and I would hide/secure your wig collection. I wouldn't put it past your aunt to steal it, and/or ruin it and the others.", "NTA your aunt is trying to take advantage and get a free wig", "NTA you bought them and five hundred is a LOT for a gift (at any age, but especially yours’). It sucks that this is happening for everyone.", "NTA. It would have been more well received if she asked respectfully and offered to pay. We were so grateful for any help we received during cancer, but we never expected special treatment.\n\nAlso, I recently found my old synthetic wig collection buried under my costume stuff! I have about 20. So just know you aren't the only one hahahaha", "NTA. I would’ve told auntie “I’ll send you a link to the wig” but expecting a 17 year old to fund or give her the wig is ridiculous.\n\nEither she doesn’t understand the price range (sounds like you told her though), doesn’t believe good wigs cost that much (unfortunately shell soon learn), or she can’t really afford it, or would just prefer not to take on the cost and would instead prefer to vilify a 17 year old to so instead.\n\nI can imagine her bills are likely in jeopardy because cancer is expensive but that doesn’t give her the right to shift her sights on a freakin 17 year old.\n\nHonestly the best path here, if you feel like acting more mature than an adult (don’t blame you if you don’t) is to ask if she would like to set up a go fund me for the wig and maybe you could contribute a little bit of money towards it, if you would LIKE to.\n\nBut honestly, my heart goes out to a mom with a child with cancer, but asking a 17 year old to fork over a 500$ wig, just because she has it, is disrespectful.", "NTA. Your aunt is TA. Contact just the cousin and offer to help her find a wig that will fit her small head and be easy to care for. There is no need to give her a $500 wig, but she needs something and you are the logical person to look to for help. You don't have to help, but they may change your relationship with her.", "NTA $500 isn't chump change", "NTA - You should not be forced to give an expensive possession to your cousin because she has cancer. The parent should be looking to purchase one for her IF she wants one.", "NTA- but you should help her pick out a wig for herself! You have a unique expertise here! Something relatively inexpensive but would be well loved. You're 17, a $500 USD gift is completely uncalled for. A 9 year old should really never be given such an expensive good gift. But a $20-$50 USD gift would be very kind of you. \n\nMaybe don't interact with this particular aunt tho. This was very rude and uncalled for on her part, and I wouldn't be surprised if she said something along the lines of \"you can't have a wig because your big cousin won't let you\" and that that's the cause of the rift between the two of you.", "ESH... \nYour cousin is fighting for her life and all you can think about is a wig? \n Family is supposed to be there for eachother. Your Aunt is wrong for trying to force you... but it's really telling of your heart that you didn't want to give it to her.", "NTA. But, you've just let your cousin know you care more about money than her. Going forward, what kind of relationship do you want with her while she's potentially dying?", "No one is obligated to give something they don't wanna. This is a 17 years old, going through her own issues but your 'heart' is she parts with something so vital to her and go about feeling bad about gifting? \n\nNo. She offered other less expensive ones but they want to dictate what she must give? Nope.", "Are you the aunt in question? Or one of the OP's relatives?", "So OP should just let her aunt and family take advantage of her?\n\nThe young child may not be dying and who says that the wig would even fit her?", "Presentation counts. \n\nAsk vs demand. Body language. All of this makes a difference. \n\nA gift should be given out of the goodness of one's heart. Not because someone else wants it. I feel for the cousin with cancer, but still there is a right way and a wrong way to request the wig. The aunt did the wrong way.", "Even then, you're an adult dealing with a kid - even if you're asking, you offer to pay.", "Human hair wigs, as well as being expensive, take an *awful* lot of looking after. They're not so much a possession as a responsibility!", "You’re NTA at all OP. Honestly, if I were you, I would tell your aunt (or better yet tell someone else within ear shot of your aunt) how embarrassing it is for an adult to ask a 17 year old for a 500 dollar wig they worked their butt off for when it’s aunts job to provide for her child, not a literal teenagers. What will people think of her when that gets out? That she had to beg a child for something because she is too lazy to work for it herself for her own kid? Maybe they will think she can’t provide for her child in other ways. Tsk tsk.", "Wow. People have really become sanctimonious in their own selfishness. No, she's not obligated. That is the point of charity and good will. \nEsh", "Honestly in this case there's no right way to ask for a present. You offer to buy it, that's the right way here.", "NTA. I have a wig collection myself. I’d ONLY consider giving away a synthetic one, but the human hair ones are $1500 and there is zero chance I’d give than to ANYONE. Someone could borrow, but not keep.", "You do not owe your cousin a $500 wig. Your aunt is being rude, entitled, disrespectful and presumptuous. Your family is welcome to fundraise for hour niece to get a nice expensive wig. NTA", "NAH it makes sense to ask and you can decline but is it really worth sacrificing your relationship with your cousin over", "NTA, though I'm a little sad you didn't incorporate \"Moira Rose\" into your username.", "NTA. The aunt would have been better off asking you for advice on wig shopping than demanding an extremely expensive wig from you surely? I mean, maybe I'm making a lot of assumptions, but a 500 dollar wig sounds like it might require maintenance that would be a lot to expect of a 9 year old going through intensive medical treatments, and most likely there are charities that could help the mom choose and pay for a wig more suited to her daughter. Having a cousin that collects and wears wigs could have been a really valuable 'resource' for the mom and the kid, the mom could get advice and the kid might feel better and more comfortable with wigs knowing that their cousin wears them, but instead the mom decided to demand you give up something you worked hard to pay for that the daughter may not even be able to get the best use out of.", "NTA tell everyone she is asking you to gift her 9 year old $500 it took you a long time to save up for that and it is too expensive for you to be able to replace.  You asked if she would buy it off you because ut cost you 500!!!", "NTA\n\nyour aunt is hurting but that was not an appropriate thing for her to demand from you", "NTA. I think your aunt should try contacting her insurance. They covered my moms wig when she had cancer.", "Nta, however if she was nice about it I would've offered her a cheaper one or offer to get her one for the holidays (not sure what country you're in but where I'm at holidays are right around the corner) regardless though that is fully 100% your choice not someone else's to make, I'd sit down and talk to your cousin about the situation maybe next time they come over you and her go look at some wigs at a mall or wherever you get them get an idea on what kind she likes that you could maybe get her if YOU choose to do so\n*edited due to autocorrect changing if to I'd at the beginning*", "Would there be a question in you mind abt who the AH was if your aunt had just walked up to you (at 17 yoa no less) and demanded $500.00 cash? Not in my mind! NTA!", "NTA.  Your aunt is TA.  You are not obligated to give HER kid something YOU bought just because she likes it, regardless of the circumstances.  If your cousin’s mom wants her to have a $500 wig, it’s MOMS job to pay for it, not yours.  Parents need to stop raising their kids to think that just because they want something someone else owns, they can have it.", "The problem is that your Aunt doesn't seem to realize that it's rude to \"tell\" someone what to do with possessions they have worked to possess and cherish.  This is basic entitlement.  She also doesn't seem to realize how bad it is for her daughter's immune system to create a hostile environment between her child with cancer and a cousin the child admires.  She clearly cares more about getting you to concede to her demands, than about what her daughter actually *needs*. I'm not even sure that your Aunt really cares about anything but creating unnecessary drama in the family, which leads me to wonder if she doesn't suffer from narcissistic personality disorder.  Either way, you are NTA", "Nta. Solution is simple and you said it, they can buy it.", "nta", "NTA. There are pretty decent and passable synthetic wigs on Amazon.", "NTA tell her to look into Wigs for Kids\nThey're exactly what they need and as far as I'm aware they don't charge like Locks of Love does", "Definitely nta\nI would suggest you have a safe hiding place to put the wig because I can see your aunt dropping around unexpectedly and helping herself to it.", ">what kind of person demands a $500 gift from a 17-year-old?\n\nWelcome to Reddit!", "Not to mention....\n\n\nWho tf is out here trusting a NINE YEAR OLD in the proper care and keeping of a FIVE HUNDRED DOLLARS wig?!?!?!?\n\n\n\nI am a grown lady, and I can't take care of that!!!! Hellls naw. Absolutely not. \n\n\nDo not put that absolute beauty of a wig into the hands of a CHILD.\n\n\nNTA.", "This is a good plan. NTA.", "Even if she didn’t know the cost of human hair wigs, aunt still demanded a gift from OP without even offering to pay OP for it. You don’t do that.", "I mean, having a daughter with cancer would cause me to research where to get wigs. Especially if i had a niece that's interested in them.", "Yeah, as a mom i wouldn't want my kid to have that expensive possession to wear on her all the time. She's not four anymore, but nine year olds are very lively and playful.", "NTA.  Your aunt is an AH for expecting you to gift a $500 wig to her daughter.", "NTA cancers peak but 500 is 500.  Keep grafting. Maybe the free loader will learn from u and do some work on the ward", "NTA", "NTA she demanded not asked. If she'd asked I probably would have handed it over because hair loss can be very hard on a person's self-esteem.", "NTA\n\nIt is very entitled to demand that anyone - let alone a 17 year old - give them $500 which is essentially what is being demanded. \n\nAlso I don't know that much about wigs but I thought that more expensive wigs are more delicate and aren't that suitable for a nine year old. Don't they also have different size wig caps to fit smaller head of a child?\n\nThere are nice relatively inexpensive wigs and they should have just asked to to help them source one of those since you have expertise.\n\nI don't pretend to understand \"tween\" taste but I would think that a girl of that age would be thrilled to get one of the fanciful colored wigs like some of the tween singers wear as opposed to an adult style wig", "NTA, maybe you can gift her a cheaper wig.  Tell the aunt it's your special wig and $500 is a lot of money for a child, but as an adult it is not that much so she should happily be about to buy it for her daughter. Give her the store or website so she can purchase it. If that's not acceptable then ask her for a barter. They wig for her car, sounds unreasonable. Well so is asking for $500 from a teenager who has almost no money.", "NTA\n\nshe's very entitled to demand 500$ gift, especially from a teenager\n\ni'd offer to give your cousin a wig you're willing to part with, though. something she looks nice and easy to care for. i don't think it's a good idea to make a 9 y/o wear something very expensive anyways. it'll take time for her and her mom to learn how to care for wigs properly and imho, it's best to learn on something you won't mind damaging in the process.\n\nif it's not possible, tell your aunt you can buy your cousin a wig together and split the bill. make it your cousin's own possession. i think your cousin would be excited to go shopping with you and get something she likes.", "NTA. This sounds more like a r/choosingbeggers issue as well", "NTA - aunt was out of line.", "NTA. Why can't aunt pay $500 for a wig for her child instead of expecting you, a minor who bought it with your own money, to foot the cost? I mean, I get that your cousin has cancer, and that really sucks. Maybe you could give her one of the less expensive ones? I'm not sure what country you're in, but in the USA, there are organizations that give free wigs to kids. Maybe there's a similar charity in your area?\n\n[Wigs for Kids](https://www.wigsforkids.org/)\n\n[Children with Hair Loss](https://www.childrenwithhairloss.us/)\n\n[Locks of Love](https://locksoflove.org/)", "Damn ppl are so cold. If my cousin had cancer I wouldn’t care about money. You like that wig it’s yours. But it’s your property so your NTA.", "[removed]", "I try to donate to Locks of Love as much as I can.  I usually only get my hair cut once a year and it's just the right length to donate.", "I mean it's a woman and a daughter going though one of the worst things that can happen we can understand they are out of line without acting like they are monsters", "This reminded me of my cousin putting his Mom's wig on at Christmas.  She looked great in it he did not. It made for a good laugh.", "You realize this a 9 year old who literally has fucking cancer? Why doesn't she deserve a good gift?", "Is it really worth the Aunt sacrificing her relationship with OP over?  She is the one that is demanding OPs property because she feels entitled to it.", "It's not at all unusual for a nice, human-hair wig to run hundreds of dollars.  If the child does get one, whether donated or subsidized by a charity, it could easily be valued that much.", "[removed]", "shes basically telling you to hand over $500 cash, plus the labour youve put into taking care of that wig. thats an absurd thing to ask of a 17 year old, your aunt can go fuck herself", "Small children in wigs are always so funny", "Do you also value your belongings over your relatives?", "[removed]", "She did her research. It led her to op. \n\n\nMost especially bc she saw the cost to quality prices for wigs.", "Also, I've worked in two different cancer clinics in different parts of the US. Both had dedicated personel to help patients and their families find resources. One main thing being charities that provide wigs for patients. Pretty sure if the mom asked she would be connected with someone to help.", "This was a 40 year old grown man.", "I think if the aunt had asked if the niece could borrow it until her treatments were over, of course OP could still say no, but it might have had a better chance of being taken into consideration. \n\nI definitely don't blame OP for not wanting to hand over a $500 wig.", "\"Gee OP, cousin has cancer and we are hurting for money. Do you possibly have any wigs that weren't too pricey that you might possibly consider gifting to cousin? I totally understand if you don't want to, I know you worked hard for them! It really would mean a lot to the both of us though.\" \n\n- still not the classiest way of going about things but far less AH ish.", "Comment stolen from https://www.reddit.com/r/AmItheAsshole/comments/yplelg/aita_for_refusing_to_gift_my_wig_to_my_cousin_who/ivlpssm/", "Still funny", "Oh it was and we all got a picture of it.  My aunt thought it was hilarious.  She has been battling cancer for over a year but she is almost through with chemo.  Her son putting on her wig I’m sure lifted her spirits that night.", "There are organizations that provide free wigs or low cost wigs for kids.  I googled and here is a just one I found:\n\nhttps://www.freewigsforkids.org/\n\nDon’t think you did anything wrong NTA but maybe you could contact one of these places to see if your cousin could get a custom wig, just for her.  \n\nJust think it might ease the tension.", "NTA", "Uh... Your wig wouldn't even correctly fit, would it? NTA\n\nETA, used to work with someone who wore wigs daily and had lots of them. The expensive ones are not easily or cheaply maintained if I remember right.", "My exact thought. Until I got to the “demanding and price” I was like……🤔", "I agree. This thread is so heartless, I almost can't bear it. But it makes sense why everything exists as it does. All people think of is themselves and then they wonder why they're so unhappy, why wars happen, why there is so much murder, abuse, and disparity. I'm just sad the entire family seems to value their own posessions and feelings more than that poor baby.", "Soon as I saw 9 all I could think was: “That wig wouldn’t even fit a 9 year old.”\nThe aunt is drama 🎭 .", "/u/Professionalileert is a comment-stealing bot. Original comment here: https://www.reddit.com/r/AmItheAsshole/comments/yplelg/aita_for_refusing_to_gift_my_wig_to_my_cousin_who/ivk13qg/", "Of course she deserves nice gifts, but it's not another child's job to do that, it's the aunt's job. The parents job.", "Yeah exactly, I'm saying a small child isn't responsible enough to care for such a possession. \n\n\nThere is a lot of care and skill not to mention time that goes into the creation of a human hair wig. And that's all IF the hair is 100% donated, which is not a guarantee. Usually it takes 3+ persons donations to make up one wigs worth of hair. Depending on length, color, and quality of hair, some hair can actually be quite valuable.\n\n\n\nI am currently growing my hair out so that it is long enough to cut the required 10 inches off to sell. I have curly red virgin hair, the most valuable of hair, so I can get a couple hundred dollars for it, if I find the right place to sell through. \n\n\nI desperately need the money to replace the brakes on my husband's car, so I am lucky that my hair grows somewhat fast.", "Well depending in the relative yes I do.", "This...doesn't surprise me. \nI'm sure that's what's right with the world.", "Yeah cause the aunt who wants to steal from her niece is a hell of a relative. She seems someone you wouldn't lose (eyeroll)", "Nice deflection. It's a gift you have at completely ignoring the fact I said she is wrong for her actions. You're a beautiful human being. ❤️", "Cause she is not wrong at all. You should buy the cousin a wig since you are so touched.", "I hope OP will open a gofundme for her cousin so that we all can donate. The heart is what counts. Charity is good for everyone. Caring about the pain of another is something that would make this life better for everyone.", "NTA, the only person who would be ruining your relationship with your cousin is the aunt, who came to your home and demanded something of you and is bitter that she didn't get it.\n\nYou need to look at this and understand that her mother is just trying to when points with her kid for free. This isn't about the kid wanting to wig, this is about the kid wanting a wig, and the mom not wanting to pay for it.", "Nta. Human hair wigs are extremely expensive and take a lot of care. Maybe start a gofundme to get her a wig?", "NTA.. what about as a gift you start her a GoFundMe to get her a wig?", "Moira Rose?? Is that you??", "That does suck that she put you in that situation but I hope the cousin doesn’t get mistreated because of how her mom behaved.", "NTA, don't give it to them but make sure to lock them up where they can't get them. otherwise they might try to steal it for themselves, seeing as how entitled they feel towards the wig in the first place.", "NTA. A 9 yo does not need the responsibility of a $500 wig.  \n\nI don't know why your aunt picked this hill to die on, but it's not fair to you, and it's not fair to your cousin.  \n\nIf you know how to, or know someone who knows how to crochet, there are a lot of patterns out there that would get your cousin wearable that could also be washed.  \n\nBest wishes to her getting through her treatments.", "It’s well documented the people who comment on this sub tend to hate their families and the idea of obligation or duty, and think money/possessions come way before relationships.  \n\nJust read any story where a possession is damaged or someone owes OP money, most commenters here would kick their sick mother out of their house over $5", "[removed]", "Yeah if you were to gift the child a wig, you should not give them a human hair one since they require so much care. For a kid something that is less maintenance and because you are buying this with your own money, cheaper is better", "I knew the type of people that comment on this sub tend to value possessions and money far above relationships but this is something else… obviously she isn’t obligated to give up the wig but any person with a shred of morality knows it’s the right thing to do", "Current chemo patient. I'm lucky to have health insurance that pays me back for my wig ($600). (I don't like to think what treatment would be like if I didn't have insurance.)", "NTA. You’re a minor/child. They’re asking a pricey gift from a child. It would be nice if you give one to the kid. But the kid’s parents should just buy one for their kid. Asking the 9 year old to buy it isn’t appropriate. Give her a $20 one or let her parents buy one.", "NTA. What a grabby aunt. I am certain she is worried sick but she deprived Op of a chance to be generous. I hope her cousin will be okay.", "If they try and guilt don't feel bad, it's not your job to be the adult as you aren't an adult.\n\nIt's there job to be the adult and make the money needed to get a wuf", "NTA. Your cousin is 9. She needs a child’s wig, suitable for her child sized head, not a wig for an adult sized head. Even if your were willing to give her the wig, the fit would be wrong. Your aunt is thinking with her heart and not with her brain.", "NTA...$500 is too much to ask . Offering to sell was kind. You can offer to help her to shop for one too.", "I’m sorry you’re dealing with such entitled ppl. But wigs are very expensive and they don’t even last forever for the high cost. Do not give in. It would have been rude enough for your aunt to even ask that you give her the wig but to demand it is absolutely ridiculous! The kid is only 9 so we can’t expect her to fully understand. She’s got a lot going on too so try not to let it get to you. NTA.", "NTA. I’m sorry to hear about her cancer. That’s quite sad for a child to have to go through. It doesn’t make you an AH for keeping your own belongings. Why don’t her parents buy her the same or similar instead of expecting you give yours to her?", "Hi former cancer patient here, NTA. \n\nWhere exactly is a 9 year old planning on wearing a $500 wig? Also you’re just a kid too? You aren’t responsible for expensive wig purchases for your cousin. If your aunt wants her to have it so badly, she can ask you where you bought it and pay for it herself! Ridiculous!", "NTA", "If your in the US, you can apply for a wig at wigs 4 kids. I think they only really do Michigan but you can try. \n\nLocks of love is another place you can try. \n\nOr ask the nurses at the hospital your cousin goes to for other reputable resources.", "NTA. Not only is that an expensive thing to ask for, but a 9yo head is probably smaller than a 17yo head. The wig might not fit the same. Is it something that could even be resized? I'm betting NO. She needs to have one fitted for her. That probably means buying one just for her. Don't feel bad about not giving it. She'd feel even worse if it fell off easily/often.", "NTA- cousin is 9 and probably would destroy the wig. wigs are expensive. I do not blame you. Parents can buy her a wig if they want.", "OP NTA...also, perhaps help select one to gift her? Something that is more fitting for her age, size, etc?", "thank you this is insightful", "She has childhood cancer !!  Of course she deserves a good wig. Not from the cousin.  But hell YES I would give her a $500 wig. Take a walk through a pediatric cancer unit if you can’t understand the value of hair , to some kids that’s  therapy and priceless.", "I can understand a more affordable cosplay wig for a child that age in that particular situation. And they come in every color imaginable!! There are some pretty nice synthetic wigs out there that run like 60 to 80 USD. But a 500$ *human hair* wig? For a little kid? Hell no, it would get damaged beyond repair by the end of the week in the hands of a 9-year-old. \n\n100% NTA.", "So how many wigs have you donated to kids with cancer?", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "[removed]", "She has childhood cancer .", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "I know. Didn't want to bring up that she won't be that  lively while dying.", "NTA! I cannot imagine being EXPECTED to give someone something personal of mine, ever. And if that something cost $500, even less than ever. Period. What greed.", "NTA\n\nYour wigs won't fit your cousin anyway.  She has a child-sized head.", "NTA and your Aunt is probably acting nuts right now as she is probably afraid and just wants her daughter to have everything .  It’s not rational but understandable and common for parents of childhood cancer to behave unusually (no excuse for the demanding).It was still not right and I do not agree with you giving the wig unless you choose to .You’ve worked hard , you are important and I understand it is therapeutic for you also to have them. You sound like a bright young lady. ❤️🎗👏🏼", "Curious Did the aunt know it cost $500?  (she still shouldn’t demand) but Did she think it was some cheap replaceable wig?", "NTA.\n\nOP, please do not feel bad. Your cousin is 9 years old, she will eventually come around.\n\nAlso, Let your Aunt know how much this wig costs and how hard it was for you to collect it. \n\nRemember, you are under no obligation to give away this wig.", "NTA. She demanded not asked and she was rude. You earned those and are not required to part with them. She’s the one in the wrong not you.", "NTA and hon....THEY ruined the relationship. Your decision is your decision and they are bullying into giving away the wig.", "I doubt the aunt realized it was a $500 wig. She knows the 17 yr old bought it along with several others like it, so she probably figures it cost some normal amount that a teenager might normally spend on clothing-type items, like $50 bucks.", "You don't HAVE to give her anything. If you know a lot about wigs, providing advice by itself is valuable. If you're going to let yourself be badgered into giving your cousin SOMEthing, it should be appropriate, in terms of size and ease of care. Just because other family members would like to get their hands on your expensive wigs does not mean they are appropriate gifts for a child.", "🎗❤️", "No. She needs months of starting with shitty cheap wigs that no one cares if she ruins. She needs to explore them, and have fun, and find out what she really wants.\n\n\n\nShe needs to pick a good quality synthetic one, and get that one. Learn how to care for it WELL, prove she can handle the responsibility, and THEN a human hair wig can be a *discussion.* \n\n\nThese things are works of art, that need constant care and attention. You can't just toss them on your dresser top, or in a desk drawer when you're done for the day.\n\n\nLittle cousin needs education first.\n\n\nAnd OP is 17, so if she doesn't feel she is able to provide ALL. THAT. well. Then she is NTA. Because that is a whole dang lotto ask of someone.", "Honestly, if the therapy is priceless, why are you DEMANDING a very expensive wig? Does a sick kid care? Do sick kids ask for very expensive wigs?", "also, wouldnt the wig be too big for the kid? Like for playing around with sure, but for daily use wouldn't it be falling off?", "Please be sensitive as we don’t know if her childhood cancer is terminal Hopefully  her treatments will lead her to a cure. I was not addressing you’re  saying she’s a lively kid .", "I was pointing out that she probably is more playful than an adult. Healthy or ill, children want to play however they can. And i tried being sensitive, which is why i didn't bring up the fact she might not be *as* lively as other kids. Cancer is objectively a process of dying.", "Would an adult size wig even fit a nine year old?", "NTA\n\nThere are organizations that provide wigs for children and many of them cost much more than $500 - some are made with real and synthetic hair together.    Maybe arrange to get one of those wigs for your cousin and you'll be back in everyone's good graces.", "OP, so many people here are telling you NTA. Yes, for sure. However, years from now, I believe you'll regret this decision. \n\nDon't be too harsh on the mother. The stress and fear she's going through right now, you won't be able to understand. Also, maybe you don't fully understand the seriousness of your cousin's illness. She could die. She probably doesn't feel well most of the time. This is the stress her mother is going through daily. Things that she can't tell others for fear of wearing out their kindness. \n\nAs for your cousin, it'll make her look good. When she's in school or out shopping, she'll look and feel good; nobody will be staring at her. What else are wigs for? \n\nMy mother died of cancer. Outside of immediate family, there's very little help. Even with health insurance, it's expensive. It could be the difference between staying in a room with 9 other people (my first and only time seeing a c-bag in use across the isle) or in relative privacy of a 2 person room. \n\nYou're 17, still a child. Give your cousin the wig with no expectations. When you're old like me, you'll look back with no regrets. I've nothing from those days. Possessions come and go. What's important to you now, you won't remember in 10 years. This gift, it'll stay with you for life. You helped a little girl. \n\nWhat's a wig for anyway, if not for wearing. Anyways, good luck. Only you can make this decision.", "NTA\nGive the wig as gift. Go to aunts house. Gush over her car. Demand the car.", "Okay but would the wig even fit her? Her head is probably too small for any adult wig anyway.\n\nNTA", "I have cancer too, though I'm 59. I recently went to buy a wig and I was told in no uncertain terms to avoid real hair. The upkeep and maintenance of a real hair wig is something you don't want to be bothering with when you have cancer or when you're looking after someone with cancer.\n\nI do think OP might consider lending the wig for special occasions though.", "100% NTA", "Nta Inform your aunt she's asking for a $500 you can't afford to replace but you can give her recommendations  of where best to buy a human hair wig for a reasonable price and that if she wants, she can ASK other family members if they'll chip in money for buying a wig and you too will contribute if they do.\n\nOR do some research for your country. There are charities that provide wigs for cancer patients. Print off some resources and give her them.", "NTA. They’re not demanding a wig, they’re demanding a 17 year old to hand over $500. Any of the flying monkeys have $500 in their bank account? How dare they not spend it on a wig? After all, why can’t they just go buy one like the way the aunt expects OP to?", "No one said she doesn’t deserve a good gift so where you reading that she isn’t deserve a gift yes they are saying it isn’t upto op to give an expensive gift but it is upto the parent too not a 17 year old kid"]}