{"id": 17948, "submission_id": "13pahjd", "title": "AITA for repurposing my parents china cabinet after they would not take no for an answer.", "selftext": "I am one of those terrible millenials that is ruining everything. \n\nMy parents downsized their house after my sister moved out and they \"gifted\" my their china, silverware, and china cabinet. \n\nI didn't want that stuff. I have a house where there is more likely to be a board game tournament than a fancy dinner party. \n\nThey insisted that I should have it.  Fine. I boxed up the china and put it up in the attic. I will bring it down if the king ever comes over to play Dungeons and Dragons. The cutlery too. \n\nThe china cabinet I actually found a use for. It is the perfect place to store my games. They don't get dusty and the glass doors let me see what is there when I have people over. \n\nMy parents came by this weekend and they freaked out that I am using a $$$$ cabinet to store my childish games. \n\nI offered to return it to them if it is really an issue. Or give it to my sister. But she lives with three roommates in Portland. Not sure they have room. \n\nThey want me to use it to display the dishes and shit. I thought I compromised enough by not just selling it or giving it away.  \n\nThey think I am being an ungrateful and spoiled jerk. I think they are Gen Xers that may as well be boomers for how they think. \n\nAITA?", "created_utc": 1684806662, "permalink": "/r/AmItheAsshole/comments/13pahjd/aita_for_repurposing_my_parents_china_cabinet/", "score": 500, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > My parents forced me to take their old china cabinet and stuff. I might be the asshole because I'm not using it in the fancy way they want me to use it.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Gen X here, people my age have China cabinets? NTA. They gave it to you, do with it as you please.", ">ungrateful and spoiled jerk\n\nYou have to be pretty ungrateful and spoiled to think you can store your useless junk in someone else's home and demand that it be displayed there to your liking because you no longer want it cluttering up your own home. \n\nNTA", "NTA\n\nI expected to see that you painted it or disassembled it. It's meant to be a cabinet, and if it works to hold games, then it's perfectly reasonable.\n\n(IMO China cabinets are great to store games)", "NTA. Are you sure they’re GenX because we mostly don’t give a shit about anything.", "NTA. People cannot foist furnishings upon you against your wishes AND dictate how said furnishings are then used. Also, you are not living in their home, so they need to *zip their lips about how you use furniture in your abode*.", "NTA \n\nWhen a gift leaves the hands of the giver, the recipient can do what they want. You reached a great compromise in repurposing the china cabinet.\n\nTell your parents that only old people display china and silver. It's so outdated a thing to do. I'm kind of old and I wouldn't use it as intended and if the china is nice (and dishwasher safe) I would consider using it everyday lol.\n\nYou could offer it all back if they disapprove so much.", "NTA. A China cabinet is nothing but a storage container.  Use it as such.  Mine doesn’t hold fine China.  It displays my kids grade school attempts at pottery.\n\nBut I would tell you that as long as you have the storage space and don’t need the money you would get reselling it, hold on to the China and silver.  10 years from now you still probably won’t want to display it, but you may find it more meaningful and want to use it occasionally.", "NTA. I'm Gen X - don't lump us all together. We aren't all jerks. That cabinet is yours now and you can use it as you wish. Easy fix: don't let your parents visit you anymore.", "Lmao NTA\nYou said you didn't want it\nYou took it after being forced to\nYou found a use for it that wasn't the original intention but it works for you yay!\nThen your parents are all shocked Pikachu face when you don't have their ancient traditional dishes up for display?\n\nKeep your gaming cabinet, and you can use the China for when the King shows up.", "NtA. \n\nYour house your rules. \n\nI used my China cabinet to display my bongs for years.\n\n My response is the good China will come out when it needs to.", "NTA, they wanted you to have it. It’s yours to do whatever you want with", "NTA. This wasn't really a gift. They wanted to keep THEIR china cabinet in YOUR house. You using it for another purpose ruined their plans.", "NTA. Tell your parents to look at the online articles about stuff no one wants. What you got is at the top of the list.", "NTA they either take it, and do what they please with it, or mind their business over your use. They don't dictate anything in a home that isn't theirs.", "NTA.  Once you are gifted something, it is yours to use as you wish unless otherwise specified/agreed upon.  You also made the best out of something they insisted upon.", "NTA, but I would love to see a photo with the game collection!", "NTA\n\nI'm a Gen Xer who was gifted an awful china cabinet. It is currently residing in a shed in my dad's backyard. I have neither the room nor the desire for that sort of thing.\n\nYou're using it. That's a good thing. If they want to micromanage the china cabinet, they can take you up on your offer to return it.", "Nta\n\nThey gifted it to you, it's yours to do with it as you please", "NTA; absolutely not. People like this want to unload and then get offended when you exercise agency/creativity that doesn’t align with your needs. They want the benefit of displaying their goods without the inconvenience of the clutter", "NtA. A gift once given should have no strings attached. Otherwise it becomes an obligation. You are not a strange unit for your parents.", "NTA. You can't give away furniture and then dictate how its used. Also that sounds like the most fancy board game shelf ever!", "NTA.  It’s your house.  If it’s so important to them that the china cabinet must display china, they need to put it in their own house!\n\nWhen my parents downsized a couple years ago, one of the things they got rid of was their china cabinet.  My mom actually suggested it might be nice for storing my yarn (I’m a fiber artist, I have lots), because she knew I had no interest in displaying china, so it needed to be useful to me for me to take it.  I ended up turning it down, because I just don’t have the space and I’m not a fan of dark wood like that piece.  I think my parents ended up selling it, along with the matching sideboard.", "NTA but I'm part of Generation X. Not all of us are like your parents or like baby boomers for that matter. My favorite piece of \"china\" is actually a cup I got from Target for a dollar.", "NTA,\n\nYour parents sound like they're trying to push a tradition onto you with the expectation that you play ball without even being asked to.  Maybe a heart to heart with your parents is in order?  Ask them why its so important that they dictate to you the use of a gift they gave to you.", "NTA - Definitely not, they should be thankful that you took it. You've done more than you need to IMO. As a Gen Xer I can't imagine wasting space on china that never gets used. But you are going out of your way for them, you've taken care of everything so they can have it back if they want it, but after a point it's not your responsibility anymore. You'd be fully justified in selling off the china and cutlery if they don't want it.", "NTA. Your parents didn't give you their china cabinet and contents, they FOISTED the damn thing on you. You even specifically...specifically said no. Well, too bad, so sad you're using your \"gift\" in a way that suits your lifestyle. They have no say.", "NTA, they didn't specify conditions of display in their giving of the gift.  You're keeping the items, just in your own way. You can always rehouse the china in the cabinet should you choose to.", "NTA. I lined the back of my China cabinet with Star Wars wallpaper, to better set off my Funko and action figures. Your parents can go suck eggs", "NTA - They gifted with stipulations that are not logical for what you value. You were kind to store some items properly if you or the next generation wants to experience them. This compromise is far more that what many adult children can accommodate. This may hurt their feelings but it is only because they are unwilling to adjust their expectation. Change is hard. They need to look at the good that occurred or you can ship the items to their home payment on delivery, if they choose. You don't deserve to be berated and put down for having an awesome game house vibe.", "nta", "NTA. They gave it to you (despite your protestations). Once a gift is given the giver has no say in how it is used. You could have sold everything on Ebay and they would be completely out of luck, since they gave it to you.\n\nAnd, speaking as a TTRPG enthusiast (and forever GM) myself, I **love** what you now use the cabinet for! Also, as a 53 year old man who plays these games, I resent them being called childish!", "NTA, they don't get to decorate your house. It's really that simple. You should absolutely keep the china but you have no obligation to display it.", "NTA and the only other advice I would give is use the fancy plates. I use my fancy China all the time, I let my daughter have tea parties with it, we busted out for holidays/birthdays and now themed dinner parties.", "Hard NTA and I'm trying not to laugh. \n\nMy parents have a China cabinet. My mom asked me when I was in my early 20's if I would want it someday, becauze my parents bought it while they were stationed in Guam in the 80's. It has so much sentimental value to them, so of course she wants it to stay in the family! But I told her something similar to what's in your post: I will likely never have any use for it, much less the space. Plus the thing is massive, and there's no way to move it without breaking something; and the cost of moving it would be just as astronomical. \n\nWhen I brought up all of these points my mom looked at the thing, made a face, and then muttered, \"Yeah, that's fair.\" \n\nBut I'll definitely be mentioning this idea to her, since maybe when she starts getting ready to downsize in 15-20 years my husband and I will have space! (I didn't have space in my twenties, and we don't really have space now/in our 30's... but maybe in our 40's?) Thinking about it, I'd love a way for my husband and I to display our figmas and amiibos!\n\nThanks for the amazing idea!", "NTA. Tell them you're worried about the china getting damaged or that there has been a rash of burglaries in the neighborhood, or that your friends want to eat on it all the time and even tried to stick it in the dishwasher, so you boxed it up and hid it for safekeeping. You can always bring it out if you have to. As for the cabinet, it's not at risk of being stolen or damaged (it's too big and sturdy), so instead of it sitting empty, you figured you'd better put something inside.", "NTA ! Throw that thing away already", "NTA .I have some beautiful china and glassware from my grandmother and great grandmother and I have no idea what to do with it. Certainly don't want to leave it for my daughter to deal with", "I wish I had a nice China cabinet to keep my games from getting dusty. \n\nNTA\n\nEdit - I just wanted to also mention that I believe when somebody gives you something you should be able to do whatever you want with it, include selling it or giving it away. \nYou kept the dishes nice and safe in your attic, and it sounds like you kept the cabinet in one piece and didn’t modify it. \nThey seriously shouldn’t ask for anything more than that", "NTA, and I wonder whether they've ever actually looked up what the cabinet, the china, and the silver are worth.  From prior experience I know that there are...a lot of people who think that their silver service, in particular, is worth more than it is.", "It may be worth your time to research the China and even test it for lead.  Leaded glaze on China was used up until 1971.  After 1972 many dishes were given the designation of \"lead safe\", meaning they contained \"safe\" lead levels.\n\nIt's a really good excuse to sell or toss the China.", "NTA \nSounds like a great use of the China.\nThey can't have cake and eat it too, you made it work for you.\n\nI store my pokemon \"Lego\", pokeballs, gelatinous cube statue, Themberchaud merch, some MTG, board games, jigsaw puzzles, overwatch merch, etc. on display in the living room. I don't have any gorgeous China cabinets, just some Ikea KALLAXs but there is no way my parents have a say in my decor choices.", "NTA", "NTA.  It's a perfect use!  You are using it to display and protect what you value and what brings you together with others!  \n\nMy repurposed china cabinet is full of curiosities on top, art supplies on the bottom.", "NTA, give them a timeline to pick it and the China up.  One person's treasures is another person's junk.", "You've done nothing wrong.  They're being the assholes here.  NTA", "Older Gen-Xer here, and I know of precisely zero other Gen-Xers who have “china cabinets”.  That’s just weird.  I bought a buffet and hutch years ago and we use it to display things that we’ve collected that we like.  \n\nBesides, the gift giver doesn’t get to dictate what the recipient does with a gift.", "Nta but you sound like an insufferable smartass", "ESH. I almost said NTA, but your attitude makes you seem absolutely dreadful. There’s nothing wrong with not wanting something purely based on sentiment, but you didn’t have to outright insult your parents by calling them ”boomers for how they think.”", "> may as well be boomers for how they think.\n\nAs far as I'm concerned Y T A just for this comment.\n\nOtherwise, for the reason you've asked judgement on NTA.  I wouldn't display stuff I didn't want but was 'gifted' - as you eloquently put - either", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI am one of those terrible millenials that is ruining everything. \n\nMy parents downsized their house after my sister moved out and they \"gifted\" my their china, silverware, and china cabinet. \n\nI didn't want that stuff. I have a house where there is more likely to be a board game tournament than a fancy dinner party. \n\nThey insisted that I should have it.  Fine. I boxed up the china and put it up in the attic. I will bring it down if the king ever comes over to play Dungeons and Dragons. The cutlery too. \n\nThe china cabinet I actually found a use for. It is the perfect place to store my games. They don't get dusty and the glass doors let me see what is there when I have people over. \n\nMy parents came by this weekend and they freaked out that I am using a $$$$ cabinet to store my childish games. \n\nI offered to return it to them if it is really an issue. Or give it to my sister. But she lives with three roommates in Portland. Not sure they have room. \n\nThey want me to use it to display the dishes and shit. I thought I compromised enough by not just selling it or giving it away.  \n\nThey think I am being an ungrateful and spoiled jerk. I think they are Gen Xers that may as well be boomers for how they think. \n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. it was a gift, you used it. No problem", "NTA. I would paint it next and add some lighting.", "NTA. They should be happy you have a house that can even fit furniture that size in it!", "NTA", "NTA, they \"forcefully\" gift it to you and you make use of the gift and repurpose it for storing your games.\n\nI don't understand your parent's logic.", "NTA\n\nTell them that you gave the china to charity shop, see if they still think it's 'your gift'", ">They think I am being an ungrateful and spoiled jerk.\n\nThose are two opposite things. Either you're too lowbrow or too highbrow. I do not agree with the apparent implication that you are showing that you think you're too good to use the fancy china (which only ever comes out three times a year in a family with a reasonable cleaning schedule). So too highbrow is out of the question. It's too lowbrow.\n\nYou didn't ask for it, it's not \"yours\" (in terms of your style), a china cabinet and set is not your dream. It was a poor gift. You made it your own. It's garish. Too bad. NTA.", "When I remodeled, I donated the china cabinet and just about everything in it, my DIL loved my mother’s china so she took it, I saved two of my father’s old coffee cups and my mother’s favorite vase for myself. If you found a way to repurpose your parent’s cabinet, that’s great and they should be glad it didn’t end up at Goodwill or the Salvation Army instead.", "Lol wtf? No. NTA. I’m an older millennial myself and have inherited some interesting shit over the years. Anything I get- I’m totally transparent with the fact that once it’s mine, it’s MINE. I’m getting ready to refinish my great grandmas grandfather clock. My mom gave it to me. If it’s gonna stay in my house, I’m gonna paint it and make it part of our HOME. It’s not a priceless antique; it’s just a piece of furniture a relative I never got to meet bought because it was the style of the time. I appreciate the history, and that’s why I’m keeping it- but I’ll be damned if I’m supposed to conform to the aesthetic ideals of someone that died 35 years ago.  \n\nYou can buy vinyl decals and put them on the glass to label your games by shelf or whatever. Make it your own, and make it work with your space without guilt.", "NTA. They don't get to dictate how you use your space. \n\nThis reminds me of our good china that I got shortly after getting married. Used it twice, it's been in a box for the last 28 years. Wonder if it's still in the garage.", "Gulp. Genexers? Behaving like this? I am one and am confident in saying you are NTA. They gifted it. You can do whatever the hell you want with it.", "NTA don’t let them boss you around, it’s yours to do with as you please.", "Ha ha  My son just took his grandmother's large china cabinet for exactly that purpose to display his DnD figurines. I am absolutely positive my mother would be thrilled that it has been recycled to family and that it is displaying a much loved collection. Not dissimilar to her using it to display her favourite collection of Royal Dalton figurines back in the day.", "Nta. \nI hope my MIL never finds out I gave away her cracked China plates. We pitched the China cabinet as well.", "NTA, my parents sold all of their antiques etc when they downsized.  I cannot imagine being given something as useless as fine china and silverware in a display cabinet in 2023.", "NTA! You're enjoying it in your own way. They're being ridiculous. \n\nWhat kind of silver and what kind of China??????", "NTA. Also please update us when the King visits you to play dungeons and dragons.", "NTA. Who are they to dictate what you do with the china cabinet that you have not defaced in any way? And doing so after they insisted you have it? They may as well take it back if they want a say. You're not a free storage unit for their property. \n\nAsk them who it belongs to and act accordingly.", "NTA - You *should* be ungrateful; it was a shitty gift and nothing to be grateful for. The freaking nerve to give you a cabinet you didn’t want because you’re not using it the ‘right’ way!", "I thought this was going to be about you like sanding it down and restaining it and making it look more modern or something. And even then it would be a very strong NTA because once it's yours you can do whatever you want with it!\n\nBut they're literally just mad about what you stored inside of it? That's very ridiculous.", "NTA. Boomer here who thinks those things are horrible. Good on you for repurposing it for your needs, although I wouldn’t judge you for chopping it up for firewood.", "NTA. At one point my wife and I had three sets of China and never used any of them. At least you put it somewhere safe. And I love what you did with the China cabinet. Way better than what they were using it for.", "Gen X here. And I love dishes. I have my grandmother’s dishes. They’re 90 years old. These are the dishes my mother grew up with. Every couple of years I drag them out for a holiday dinner. \n\nBut if we’re being honest? Grandma’s dishes are ugly as fuck. There is no way I would display them in my house. I don’t display any of my dishes, actually. Who has room for a china cabinet? I sure as hell don’t.", "NTA when I bought my house I literally bought a huge buffet for my dining room specifically to store my spouse's board games, magic cards, playing mats, cabochons, dice, and all the books related to dnd/rogue trader/pathfinder. It's a very functional way of storing it and utilizes furniture your parents no longer needed or wanted.", "NTA. You use that cabinet how you want to! I'm a Gen-Xer...almost Millenial...and had one. Had. A tornado took it. I used it to hold things my grandma gifted me...and dishes that didn't fit in my tiny kitchen. It wasn't a gift, per se, more like a friend of a friend was getting rid of it and I went - oh wow I can put Grandma's china swans she gifted me before her death in it...never understood the swans, but they belonged to my beloved Grandma and that made them special.  \n\n\nI think one swan survived. And some plates. Otherwise, the entire thing ate it with a wall. I'd say I'd have put minis in it, but we totally got these 2nd hand shelves for practically nothing that hold all manner of books and games and minis and yeah...  \n\n\nStill need a new china cabinet to hold my partner's mismatching thrifted tea cups. So we can see them all...use them all...admire them all. He has A LOT of tea cups.", "We used our 'gifted' China cabinet to show off all our Warhammer 40k armies! My hubby's mom was less than thrilled, lol.", "NTA. My fami.y uses the China hutch to hold important documents.(top) and to store games.(bottom). It's perfect for holding small things you don't want getting lost. Your parents are being selfish. They forced something on you that you don't need and didn't ask for. If they don't like what you store in the hutch then they are welcome to take it back.", "I'm gen X, my parents had a china cabinet, I have knick-knacks.\n\nI think you're using it perfectly. You should cross post this to       r/maliciouscompliance", "NTA, do as you wish, it was gifted to you.", "Next, I suppose they will demand that you paint your walls a suitable color to offset both the cabinet and the dishes. And, of course, you will need a better and bigger dining room table for all the family dinners you are now obligated to host. If you don't know how to cook, then you better take lessons so the meals are up to their standards. \n\nNTA. Your offer to give everything back or to another family member was perfect. But who knows? You might have kids some day that want the old stuff. Some kids today want flip phones that can't download apps, so I guess it's true that everything can come around again.", "NTA. I saw a thing about how Boomers don’t really understand that furniture has gotten comparably much cheaper but real estate has gotten much MUCH more expensive than when they were younger, so not only do their kids not want their old crap, they don’t have any room for it.", "Look at completed items on HiBid and see that those $$$$ China cabinets are going for $50-$500. Nobody wants them. Not even auction houses.", "NTA - Gen X here , who is thinking of finding a China cabinet for my board games after reading this.", "When I got married in the 90s, we got a whole set of fancy China and stemware because that's just what you did. 20 years later we realized we had used it twice, so we gave it away to an older relative.", "I’m Gen X and when my parents we’re moving they asked if I wanted their dresser and china…. I politely declined… and it all ended up at the charity shop. I \nN no way do I want that dated dusty stuff in my house. You are NTA", "NTA: also GenXer here.. My parents have a cabinet.. I do not and I do not want their when and if they downsize! 😐", "NTA but millennials are ruining the china industry!!!", "NTA\nTTA for having set expectations that you would appreciate it the same way they did. I wish parents wouldn’t be so concerned about passing things down and burdening the next generation with their stuff. Of course there are heirlooms that I’m sure adult children would like to have. Is there anything at all they have that you might like to have and appreciate?", "NTA... I'm so glad I didnt go down that road. My friends were collecting their royal Albert settings for their hope chests, and I was just not interested.", "I am a young boomer who inherited one of those from an old boomer, and it's stuffed full of my Star Trek memorabilia.  I want to paint the wood white one of these days.  \n\nEdit:  Oops I forgot, probably due to the boomer thing...  you young millennials, ruining my train of thought.  You are NTA.", "Hey, I'm a \"boomer\"....watch it buddy!", "GenX here and I approve this use of the china cabinet.", "Good for you! There are many uses for old china cabinets. I totally expected you to say that you fixed it up!  I'm kinda disappointed that you didn't chalk paint it!  I would have! Lol!  NTA!!!\n\nPs..I'm a boomer - late 60's, son is Gen X 1974, Granddaughter is late millennial 1996.", "I would be tempted to tell them, 'if you'd like, you can take it back now and give it to someone else. If you are giving it to me, as long as I'm not damaging it, it's no concern of yours. If it's mine, and you keep on me about it, I'll turn it into kindling in the street. If you let this drop, I'll never hurt it.'\n\nI have a tendency to go to anger as my first response.\n\nEdited to add: NTA", "Gen Xer here.  I have three inherited china cabinets. One of them has china that I use twice a year.  I enjoy looking at it because it is beautiful and it makes me happy.  The other two have beer and wine glasses.  I know no one will want them when I’m dead and that’s okay.  I’ll be dead.  \n\nNTA and not ruining anything.  Tell your parents that traditions are peer pressure from dead people and how would they feel if they were required to wear their grandma’s beehive hairdo or their dad’s pocket protector?", "Next time they visit, tip the cannot over and break it while maintaining eye contact the entire time. NTA", "NTA.  \n\n\nYou didn't want it, you kept it anyway, you're using it, they can deal or they can take everything back.  \n\n\nAlso if you REALLY want to make them squirm, tell them it could be worse: there's a comicker out there named Erika Moen who has a Dildo Hutch in her living room.", "Every person who has been personally victimized by “Old Country Rose” please raise their hand.", "NTA\n\nThey can decide what to do with it when they buy your house and pay your bills.\n\nI always strongly refuse \"gifts\" from people like this. They're just trying to covertly take over decorating your house.", ">I will bring it down if the king ever comes over to play Dungeons and Dragons.\n\nI like you. NTA. You might want the china for hosting holiday dinners when your parents get too old. But for now it seems like you use the games more so it makes sense.", "As a boomer who played D&D in 1978 in the galley of a fast frigate, you should display figurines and dioramas of really bad character deaths and their dice (you really gonna keep those after that roll?) in the china cabinet. Games go to the bookshelf, except collectors editions.", "NTA.I bought a fancy china cabinet from my boss, I kept a few coffee mugs in there, but it was mostly for my bongs. Turns out it was his wife's family heirloom. When she found out it was for my bong collection the first thing she said was \"well those better be some really classy bongs, because that's a classy piece of furniture\" \nPoint is, it was my bong cabinet now,  just like your new game cabinet was yours once they gave it to you. Most people would have sold it or put it in goodwill, I think it's nice of you to find a way to make use of it and your folks should appreciate that. Maybe have them over for dinner and have a few pieces of the china in the cabinet, just enough to get out and set for the dinner, that way they at least get to feel like it's fulfilling it's purpose.", "China cabinets make awesome storage spaces.  I used mine for my apothecary.  Drawer portions for craft supplies.  We use china plates from the second hand shop cause they were cheap....not because its special.  Its just not the norm anymore.  Your parents are being a bag of dicks.  NtA.", "NTA\nMy husband and I were left with a ton of furniture from my in-laws when we moved into their house.  They had China cabinet full of junk.  I made my husband clear out the junk and used the cabinet as a pantry 😂 I was actually kind sad when my father-in-law took it back", "I have 2. My mothers. It does have a few special bits of china in it. Also cake gins, easter decorations. Im positive mother wouldnt mind. My father gave it to my mother for her 16th birthday way back in 1949..it is full of love and special memories for me, more precious than money. When their estate was settled it was valued at $0. . I also have another ftom an elderly friend. Looks great as a wine cabinet.", "Last year boomer here , my ( grandmother's ) one has books and LEGOs and old bottles , and a really bad ( good ) purplish paint job", "My husband and I (Gen xers) use our China cabinet for minis and game terrain.", "NTA- I’m an older Gen X, parents were from Silent Generation (really old) so I have- china cabinet (no glass doors) with matching bookcases, desk, end tables, and a now “really cool lamp” (its art deco that has now come back in style) along with  3 full sets of china to include all the serving pieces, placemats, table runners, and 2 sets of silver. I have the room, and when my kid would bring friends from school over for thanksgiving I would bring out the “good stuff” as there were 12-18 people (I love cooking so it wasn’t a surprise) I just told her you have to let me know a week in advance the numbers (I always added 3 to the total) I would make turkey, ham, mashed potatoes from scratch, stuffing, green bean casserole (they like it I hate it) sweet potatoes, squash, and I would make (from scratch) apple, pumpkin, and pecan pie.  She had friends/teammates “fighting” to come up for thanksgiving.", "Lol. This is perfect. And exactly the sort of thing this gen X’er would do. Okay, I’d fill it with liquor and maybe stuff the games in the bottom ... although those are already in the bottom of my great-grandmother’s sideboard 😂\n\nObviously NTA. If your parents wanted it to display china, it would still be in their house. They gave it to you, and no longer have any say in its disposition.", "even my boomer parents have take down their china cabinet after downsizing. (I actually don't even know what happened to it... they may have just sold it along with the house LOL)\n\nNTA at all. They're welcome to take it back and display their fine china if they wish to.", ">I think they are Gen Xers that may as well be boomers for how they think. \n\nI was on your side until I read that.\n\nYou are NTA for the main story but cut the Gen X and Boomer crap. It's not clever. It just makes you look lazy and small-minded.\n\nDo you think you are the same as everyone your generation? No? Then don't buy into stupid memes that say previous generations are.", "As a Gen Xer, we do not claim your parents and their China cabinet. \n\nNTA they should take their shit back of they feel your are an ingrate. They shouldn’t have forced you to take it anyway!", "NTA but if they're going to be this controlling STOP INVITING THEM OVER.  Your house YOUR RULES.  IF they don't like it they don't need to be there.", "NTA.\n\nMeanwhile my mother gave her china to a friend instead of her own daughter, breaking my heart. But I guess she thought I didn’t deserve it or something, I never knew what she was thinking.", "NTA - Boomer here, it’s yours in your house use it in a way that suits your lifestyle. I’m glad I don’t know any of the stereotypical “boomers” we are more the flower children type. Very live & let live.", "NTA. My parents gave us their china cabinet. It now holds CDs, board games, and action figures. The china (which we hate) is in boxes God knows where. My parents have never said a damn thing about it.", "This sounds like pure uncut boomer behaviour, not GenX.", "NTA. My mom uses the fancy china cabinet she got from her parents for art we made as kids. I think the important thing is it's getting used.", "NTA. I find this amusing because my husband inherited his grandparents' house, complete with china cabinet, and we use said china cabinet to display our dice and board games and geek memorabilia. We have china that we were also given, and boxed it up too. If you don't want it, don't feel bad about either not using it or using it in your own way. It's YOUR house, and they shouldn't have any standing to dictate what you do with your own possessions in your own house.\n\nWe're thinking of donating the china... (The horror! We're also millenials that are ruining everything, I guess!)", "I have a few handed down  $$$$ china cabinets 2 are for my games and cook books, they are awesome for that kind of storage. Hell 1 I refurbished,  so they should be happy not having it farmhoused....literally the last is a bunny coop! Please don't feel bad, I've been in this situation. They want you to have the stuff only if used EXACTLY  as they did. Sorry  gran the feathered chaise lounge doesn't exactly work here , but new fabric does situation.  You could be sparky and get a few commemorative game plates for what corresponds to the ones in the cabinet and display them, technically still a china cabinet.", "I inherited ALOT of china from my grandmother, and I eat on it everyday lol. My mom actually commented about it last time she visited and I said “what am I supposed to do with it? Just hoard it?” It’s kinda fun eating on fancy plates every night", "nta, it's yours now, do what you want with it.", "I'm a Gen-xer who has despised china cabinets all her life. But guess who has been yearning for a china cabinet since her 50th birthday? Yes, it's me.", "As someone with an inherited China cabinet full of MTG, fabric, and yarn I say nta. \n\nI'm obviously a bit biased, but all of my grandma's children (my mom, aunt and uncle)  loved that I managed to make it work.", "NTA. I'm also Gen X. It's yours to use how you want, and I'd be putting games, figs, etc., in it too.", "NTA I would love also to have my games in a place they don’t get dusty. I think that if the king comes over it is great that you already have the appropriate china. In my house the king will have to eat with the same plates as everyone else… spoiler alert I have caught my cats licking them sometimes so…", "I use mine as a bookcase.", "NTA once you give someone a gift the recipient can use it as they want. However, in your quest to find a practical use for the china cabinet you have unintentionally hurt your parents.\n\nDownsizing, even if they want to do it, is a painful process because you have to let go of things that have meaning to you. They used the china cabinet to store the china they probably used to host numerous dinners for loved ones and friends. These things have many happy memories your parents associate with them. They likely wanted to give it to you so that you could have a piece of your family history and continue to use it by hosting your own dinners. To see you use their gift for something they would see as frivolous instead of it's intended purpose would make them think you don't appreciate it. You have admitted as much.", "My aunts fancy china cabinet just made it to my house, where we will be displaying my painted dnd minis and my husbands warhammer lol not sure if I should vote but I will say NTA", "Nta\n\nMy sibling and I argued over who had to take our family china cabinet and the china- he is the last of Gen X and I'm comfortably a millennial. In the end, I took the china and he took the cabinet. It is now the home to his children's Lego collection. It's honestly perfect. Assembled sets get displayed. Spare parts go in the bottom behind doors. And sets in progress get their own drawer. I think my parents thought this was temporary when he first did it, but 10 years later and I suspect the Legos will stay there even after the kids move out.", "I'm  a Gen-Xer.. my bf (also a gen xer) was given a china cabinet that was his parents. \nWe keep liquor in the bottom and glasses up top. \nHis parents (boomers) couldn't care less. \n\nThis isn't about what generation your parents are... this is about people being jerks and being unrealistic in their expectations. \n\nNTA, but maybe calm down with the generation labels.", "I’m a Gen X’er with a family bookshelf that I use to display my Star Wars helmet collection. NTA.", "NTA lol thanks for the chuckle at the classic Xer behavior", "NTA. check Replacements LTD for the value of the china and silver, sell it off, buy more board games. \n\nI’m the keeper of the family silver, and I use it regularly. I enjoy the patterns and the history. I have patterns from second cousins once removed because they know it’s one of my things. You’re STILL not the a here.", "My Godmother gave me she and her husband's Hardwood 5 Piece Living Room Set, which had *glass panels* while I was still renting in Indianapolis. Plus an enormously oversized Built-In Drawers they ripped out of their old home. I dragged the furniture out of the home and onto the porch and sold it to a reseller (who took it even though I mistook the Brand of Furniture, it was still quality). Mom and I borrowed a friend's truck and hauled the drawers to a local donation center in the middle of a lightning storm.", "NTA. \n\nI despise the living shit out of my mothers china cabinet for a different reason mainly due to being told for large chunk of my if I break it then lose everything. I hate the damn thing ours collects dust like no tomorrow and it takes up unnecessary space. \n\nEven I don’t want the damn thing the sad thing is I’m an only child and I doubt anyone else in our family bloody want it. While yes in theory WERE nice to have but have gone out of fashion nowadays.", "No you are not!  Your parents are being ridiculous- our children do not want the good china, the silverware that has to be polished or the China cabinets - they made you take, it is yours, use it for whatever you want, even paint it (though your parents might have a stroke).  You could also sell the good China, not worth half as much as they paid for it but at least it would be out of your attic.  My grown children do not want any of my \"good things\" so I am trying to clear it all out before they have to!", "Millennial here with TWO China cabinets. Both of which I lovingly hunted down from antique fairs, Craigslist, and FB marketplace. One, has the China that I always loved and I asked for as gifts along with stuff I’ve picked for MY tastes and styles at various antique/second hand shop. My other China cabinet is filled with…games. \n\nYour home. Your hobbies. Your interests. Your tastes. Your priorities. \n\nYou took the piece, and made it your own. Honestly I was afraid you painted a 200 year old antique or something and maybe I would have been hurt thinking about that, but whatever it’s yours. I can’t believe your parents are acting that way over something you have given new life and lovingly incorporated into your home. \n\nI’ve accepted a few pieces from my MIL and her mother. Just like there are some pieces from my grandmother in my china/dust collector collections. My MIL gets actively upset when we tell her we will not take any more stuff of hers or grandmas, honored as we are. At this point, that’s a her problem. Just like your parents being upset is a them problem. You accepted their gift, and put it to good use. NTA.", "I actually think it's a great way to repurpose the cabinet and honestly you have me an idea for my mom's haha\n\nNTA", "YTA for the boomer comment. \nThey aren’t all like that. Don’t be so quick to lump everybody into categories.", "Gen X here, mine displays my shoe collection!", "NTA, 40+ here, the only reason I would have a china cabinet of for uranium glassware", "NTA once an item is given to someone it’s no longer the gifters item to dictate it’s usage. I’m tempted to suggest it be turned into a cabinet display of dildos and sex games or scary mask collection for their next visit but then I’m sure you have better things to do with your money.", "Unless they gave it to you with a verbal or written agreement that you would use it only for display of the china they gave you, you should be able to use it how you want. Especially if they knew you didn't want it in the first place.  I have two china cabinets. One does have my set of china, which my husband started giving me for christmas many years ago. The other is where I store my material in my sewing room. My sister gave me that one years ago. She just noticed it a couple of weeks ago and asked if that was the one that was hers.  When I said it was, she said \"great idea\" and was happy I found a use for it. I used to use it for my china, but it was built around 1860 or so and some of the wooden shelves were no longer sturdy enough for the weight of 16 place settings and many serving pieces of china. NTA for finding a use that fit your lifestyle.", "NTA 😂 I bet your parents would hate my “China” cabinet. I’m a millennial but I do like the vintage China tea sets and I have a few that I have on display…… in a regular glass door cabinet with my other collectibles ranging from race car models to dragon statues to Lego sets and anime figures. 🤣 \n\nFancy telling someone what to do with something you forced them to take, at least you didn’t sell it all off, which you would be within your rights to do so. \n\nEnjoy your gaming cabinet! I love having all my DnD stuff on display 😌", "I'd be using the china & silver in my daily life. Why save stuff?", "NTA.  Heck, I'm a Gen Xer who is ruining everything by not wanting my mom's hundreds of china plates and large furniture items that hold the hundreds of china plates.  They insisted you take it, you took it, you kindly kept all the items you didn't really want and your found a practical use for the cabinet which works in your house.  They gave the gift, they can't continue to maintain control over what you do with it.", "NTA, my boomer parents used theirs to store bulk hand-wash, wet wipes and canned food💁", "I would have displayed my nerdy figurines in it but the games is a very nice touch!", "Are you really asking whether you’re the asshole for not letting your parents use your house as their personal storage facility/mini museum? 😂", "Gen X here, I don't have a china cabinet and I don't know anyone in my age group who does! Looks like your parents are boomers at heart lol! NTA", "I’m actually too old to be a boomer. I have NEVER used my fancy china (wedding gifts). I’m more of a paper plate kind of hostess, if my numbers go over four.", "NTA for not wanting to use it for China.\n\nYou are an AH for your miserable victim, generation-war nonsense. Grow up and stop feeling so damn persecuted.", "BRB, gonna get a china cabinet to display all my games, thanks for the idea! NTA", "Ha, as I was reading this I thought to myself, “what self-respecting Gen X has a china cabinet?”", "Lol I’m a millennial and have a China cabinet. It has China AND fossils in it.", "I'm Gen X and I have a china cabinet, but that is only because I inherited it from my mother.", "I’m on the border of Gen X and millennial. My Boomer/Gen X parents didn’t even have a china cabinet till they inherited one from their parents.  I never even register for china at my wedding. We have good old Corelle dishes.", "Gen X might have a killer MCM hutch for their home bar (raises hand) but not a traditional China cabinet. That’s definite boomer behavior.\n\nOP: The oldest Gen Xers are like 57-58", "Gen X here too, I display pics, shells & my favorite Lego sets. The parents wouldn’t approve of me either.", "LOL. I'm a millennial with a china cabinet that actually displays china, both the china and cabinet were (mostly) given to me by my mom & grandmother. The china never gets used, but it looks pretty.  \n\nI appreciate a fancy tea set on display, but I totally agree, OP is NTA.", "Millennial. I bought a china cabinet to use as a TV stand and hold all of my grandmother's crystal. It now holds mostly games as we have slowly broken the crystal over time. My grandmother would be so proud that I am using her glassware and would not mind it being broken. She would be happy that they were used and we were thinking of her.", "I’m barely a Gen Xer (younger side) but thought the same thing. China cabinets… *shudder*\n\nI do admit, I have a killer Fiestaware collection, but that shit goes in the kitchen cabinets. And we use it every day.", "Boomer checking in. I would’ve repurposed the china cabinet for storing yarn. NTA.", "NGL, I am a GenX would would LOVE a china cabinet, but I am also not the kind of arsehole to give someone something I no longer need and then get peeved that they’re not using it the “proper” way.\n\nNTA", "Gen X here. I also store my games in my parents old furniture.", "NTA! Fellow Gen X with my Lost Gen grandmother's Ethan Allen china cabinet. I put pretty fabric inside the glass doors and use it to store my canned goods and dried beans etc for when the inevitable apocalypse occurs soon. It's a lovely piece of furniture that reminds me of Grandma, who raised her babies during the Depression and would totally approve of this practical use.\n\nYour parents are the AHs. Tell them the other members of the tribe think they suck and whatever, man.", "Only reason I, a 27 year old, would have a china cabinet would be to display my many cute mugs in my still growing mug collection", "Gen-X here. We were gifted a China cabinet. No dishes, though... See, one day we will get the not enough room in the cabinet they were gifted china set that will be part of my only child spouse's inheritance.  And we were given an overflow set of cups and saucers to hold til then. They're in a box in the garage.\n\nI use the top cabinet part as a storage space in the closet for my husband's field gear and the base unit as a storage cabinet to rotate out our grandbabys' many games and toys. The TV sits on the base now.\n\nThe point is that if younger generations are gracious enough to take your old crap and repurpose it into something actually useful for their lives that you yourself didn't want but couldn't bear to toss you show GRATITUDE 😉 and be impressed with their ingenuity. \n\nWho knows? 150 years from now, a future generation might find all that old China and repurpose the game chest that came with their house into a China hutch! NTA op.\n\nP.S. I tore out the glass and replaced it with copper screen and painted the whole thing, changed the hardware, blunted, and rounded the pointy edges, too! MWAHAHAHA!!! 😈 And I'm going to match it anything we inherit too! Unless I change my style by then. I might. It's happened at least a half dozen times since I was your age.", "Exactly. I’m assuming OP didn’t cut it up or alter in any way. The whole point of those things is to display things that you value. OP values their games and the friends that gather to play them.\n\nNTA.", "I inherited one from my FIL and it has Halloween decorations in it lol", "Boomer here who has played D&D since 2e, and you are so NTA. I would be honored if my kids used a china cabinet to store their games. Hell, I’d most likely do the same thing. I love it!", "I mean I have an ikea bookcase with glass doors I keep my dishes in because there’s not enough cabinet space in the kitchen, does that count?", "Hahaha exactly!! “Here’s some old junk I don’t want anymore. How dare you not revere it as it deserves?!”", "This is literally the boomer mentality in a nutshell comment", "That's what we use ours for", "I’m GenX and I agree with this statement 😂", "Gen X checking in to agree.", "Gen X here too, and this checks out.", "GenX here too. Whatever.", "Boomer here (tail end), and I don’t have a china cabinet and would be happy you’re using it. We have my husband’s great aunt’s trunk, and I use it to store paper products.", "Can confirm. We really don't.", "X-ennial here (on the Gen X and Millennial border), this is the most accurate statement in this thread.", "GenX here, who fucking cares as long as it’s being used?", "gen x (1977) chiming in….i inherited a hutch from my mommom where i display cookbooks i don’t use (covered in 4 inches of dust) and my kids art projects \n\nNTA your cabinet your rules\n\nalso don’t give a shit about anything and i’m just as sarcastic and smug now as i was in 1993……except now i’m always tired and my back hurts", "I’ve seen them used as liquor cabinets as well", "Right, as a GenXer - I'd just as soon give stuff like that to a buy nothing group.  Pretty sure there is something else going on here.", "See this is the thing. My boomer mother has really tried to get me to take her stuff and gets super frustrated- to the point of an actual tantrum - when I say no.\n\nI’ve learned that even giving in, and taking the (stupid thing I don’t want or need) STILL won’t make her happy because I won’t treat it the way she did. \n\nPS the tantrum was when she wanted me to come look through her garage at all the old papers leftover from grade school and high school. I told her to just throw it all out, and that there was no need for me to peruse it.", "That sounds beautiful!", "My favorite \"china\" besides the china my grandma gave me that she got for her wedding, is just the stuff we got at the antique store by the box. Doesn't really match but that means it's ok if we break it so then my kids can eat off the \"china\" too. I'd rather teach them early and let them feel grown up, wine glasses with sparkling juice included and lose a few dishes then not make memories.", "He’s not wrong, though…", "They are being entitled… like boomers", "They are boomers in their thinking.", "Me! Years ago, I was in Marshall Fields with my husband. While we were there, I wanted to look at the dishes. We ended up looking at the china, and I just happened to point out a few patterns that I thought were pretty. Old country roses, was one of them, but not my favorite. Next thing, I know, husband surprises me at Christmas with 6 piece place setting of Old country roses. Then, for my birthday, my mother gifted me the complete tea set. Then, more pieces came...\n\nI never actually wanted them, but one thing led to another. Husband always wanted to get them out for holidays. I said, ugh. He said he would was them before and after. Years later, a few months after my husband died, I donated the whole lot to a local charity shop.", "After mine was repainted and added new hardware, it made an excellent board game closet. You can see all the games through the glass", "I do... it holds my kids collection of lego, Warhammer mini figs, and anime figures.... isn't that what it is for?  To display things you care about?", "I have one. It is filled with liquor. Glass doors are great.", "Speaking as a Gen-Xer who had friends who had parents with fancy plates, they could have inherited it. All I got was a Sears and Roebuck plate set that’s currently boxed up in my storage unit.", "painted black, to show off skulls and creepy shit", "Mine's full of liquor", "My BF and I do! We’ve got a dining room table & chairs, China, silverware, serving stuff, etc., and all from an estate sale. It’s gorgeous. It cost us about $200 for all of it. \n\nOdds are pretty good we will sell it and put an old F-14 flight simulator — think a training version of the original Top Gun fighter plane — in the dining room instead. That’s at least a proper Gen X accessory. :)", "I'm Gen X, and I have 2. Neither hold China. Lol", "I'm Gen X and I've seriously been looking at getting one to store my board games.", "Uh, I have two, and use them to store my good china, my crystal stemware, and some of my silver (a coffeepot, a teapot, a few dishes/platters, salt and pepper shakers, etc.).", "I don’t.", "I do.  The previous owner of my apartment left it behind, so I store my thrifted Wedgwood set in there.  I also have one of those Royal Doulton figurines in there.  And the good glasses.  And two bottles of hooch.\n\nI'll turn in my Gen X secret decoder ring.", "I have art in mine. Most Gen X I know have a pile of commemorative glassware, if it hasn’t broken or the logos worn off.", "Millenial checking in. No china cabinet. My millennial niece has one. She has a tiny kitchen and it houses her booze, shotglasses, beer steins and her daily use plates, because her cabinets are full with food and cookware. Only her water cups and coffee mugs are in cabinets. Everything else is in the hutch. Apartment life means dinky kitchen and she loves to cook. It's basically an extra cabinet.\n\nNot for fancy schmancy china. Her day to day plates go there. And the bottle of Milagro.", "My mom was born in '64, the boomer cutoff year, and my dad '66. Can confirm, they have TWO China hutches to display dishes and shit, and use the dishes in one for family holidays. They also have shadow box trinkets all over. TRINKETS. \n\nIt's a weird half generation that can't tell you where they were when John Lennon died because they didn't really care, and can't tell you where they were when Kurt Cobain died because he was a younger crowd's genre. \n\nWhen I was a kid and SVU was new, my dad told me Ice T was a rapper, but he knew none of his songs. He's into 80s hair bands. My mom always ranted about Guns N Roses dropping F-bombs at an award show. Gen-X who may as well be boomers tracks.", "My sister because she can't give it away. I have the handy excuse of sharing a one bedroom apartment. No heirloom furniture or tchotchkes for this GenXer.", "I have one, but it's built into the house. I store board games and liquor in it.", "You need to chill, you're making me (a millennial) want a fossil cabinet 😂", "I'm on the border of millennial and gen Z, my boomer parents also don't have a china cabinet. But i know if i was ever gifted one they wouldn't police what i use it for.\n\nOddly enough i do have green glass china i inherited from my grandparents, but it mostly just sits in a box. Except the coffee bean/grounds holder. That sits in my cupboard holding coffee beans.", "Ahhh gotta love those Corelle dishes! I was gifted a set for my engagement in 2006 and we’re still using them to this day- I’m pretty sure they bounce if you drop them on the floor.", "Fuck yeah Corelleware, that shit lasts forever!", "I’m a Xennial and I got a China cabinet to display the pretty China my aunt gave me. It also has booze in it and stuff we want to keep out of our 6 yo hands.", "I know a boomer that feels the same way. She inherited at least two sets of china and uses them often because she knows her daughters don't want them.", "One of the best pieces of “life advice” I ever read was, use the good stuff. Don’t save it for that mystical perfect occasion. Burn the good candle, use the fine China, eat the fancy chocolates. You’ll be happier enjoying your nice things and won’t have regrets when life passed you buy while you were saving it.", "Baby Gen X here (born January 79) who has a \"secretary\" (we call it \"the hutch\") and china given to me by my grandmother when she moved from her house to assisted living, that has done basically the same thing with them. Your folks are more boomer than Gen x for sure... please don't lump us in with them.\n\nETA: NTA", "Also, I bought my own damn china cabinet AND a matching buffet, but only because they are a cool art nouveau/craftsman set and match the year my house was built, 1922.  so THERE. :D", "What's the name for Boomer and Gen X border?", "Habitat for Humanity takes old furniture and stuff. They sell it and build houses with the money.", "Only way a self-respecting Gen X would use a china cabinet.", "See, I was expecting OP to say the repainted it cool funky colors or something and that's why the parents were mad and I'd have maybe said NAH...but this is clear NTA territory", "But that’s no longer a china cabinet.  There’s a fine distinction. 😁", "That’s just a properly-sized liquor cabinet.", "Yea my boomer parents were at least smart enough to offer me and my husband their liquor cabinet. We filled it with liquor. Thankfully I don't think they own a china cabinet. I would probably fill that with liquor too.", "That set might go for 200$ on Ebay...", "Do you ever use the stuff in the cabinet?", "I use my fine china at holidays and parties. If my children and grandchildren are all here, I need a set for 15 people. My everyday dishes wouldn't begin to be enough to feed all, and if I am going to put the effort into a large sit-down meal, I don't want paper plates and plastic cups.", "Your sister is a boomer at heart.", "I've used inherited crystal bowls to serve wet catfood. Looks like Fancy Feast.", "They will either bounce or shatter into a gazillion tiny slivers. There is no in-between, lol", "I got goose Corelle,  My husband was a young widower.  She died in an accident about shortly after their year anniversary.\nI just am not into the goose with the prairie hat.  I really didn’t care about the furniture.  I have never been jealous of her.\nI just told him the geese had to go.", "They do, until they don't. When they get too old, or if they hit too hard, they shatter like a window pane. Fine shards that fly everywhere. Our church used white Corelleware dishes. They had enough to serve 150. The shelves were overweight and one night the upper one broke causing the lower shelf to break also. Fine shards of white Corelleware all over the kitchen and 40 feet into the next room.", "Until they get old. Then when you drop one, it’s thousands of needle-like glass pieces everywhere.", "I ended up with Grandma's secretary. It houses beer glasses.", "When I finally get one, it's going to be full of bones and rocks.", "Or for our action figures or Lego sets.", "Mine was for bongs and shiny rocks.", "Some of the figurines were made in China, does that count?", "My mother owns two China cabinets. Fuuuuuuk.", "I checked after my mom gave ‘em to me. They sell, but not enough to make it worth my while to sell them by piece or as a lot. Shipping ceramics properly costs a lot of money and time.", "I worked at Target for almost 5 years. The 3 times I saw someone break Correll plates there were shards stretching all the way from the checkout lanes to the grocery department.", "Oh, my Omi (German for Grandma) would have loved that!", "I got the China without the cabinet and that crap is put away in a cupboard until I get around to valuing it and putting it on Ebay. I should do that before the Boomers all disappear because I cannot imagine a single Gen Xer paying good money for this rubbish.", "If I ever get one it's going to be where I display my collection of penis-themed tchotchkes.", "Oooh a curio cabinet. Excellent!", "MINE IS FULL OF BONES AND ROCKS!! I got it from an older lady for free and it lights up and everything. Keeps the cats away from my bird feet and bones. 10/10 do recommend", "Sooo you're into bone china and stoneware? 😉", ">When I finally get one, it's going to be full of bones and rocks.\n\nBe careful, some spouses/partners don't respect someone's prized collections and might throw them out in the garbage.  (sorry another thread)", "I like this! We have a hutch/china cabinet and my husband just added some action figures amongst the various dishes.", "My cousin has vintage Transformers in his.  It's pretty sweet, not gonna lie!", "Touché.", "Is that a \n     \"What do I do with two china cabinets?\" Fuck? \n      Or\n     \"I should start stocking up on my liquor\" fuck?", "If you ever break one in your home, you should probably file an insurance claim and hire one of those disaster restoration companies to clean it up.", "They literally explode if the impact hits them a certain way. I love corelle, but I got rid of the ones I had when my kids were little because I broke one, and I was finding shards in the house months later.", "Seriously...I was glad when one of my aunts wanted my grandma's china and I was able to convince my mom that she should have it as grandma's child (my mom thought I should ask for it, despite me neither wanting or needing fancy dishes). I got the stand mixer and her nice mixing bowls.", "The Boomers already inherited their China or got it as a wedding gift. You may as well donate yours now.", "When my ex and I split, we had a minor quibble over who got what kitchenware. I wanted the Magnalite her step father had given us. (He's cajun, it's an OG Magnalite. Best cookware I've ever used!)\n\nShe wanted the fine china my mother had given us.\n\nI said deal, easy trade.\n\nMy mother was a bit upset, but she admits that the Magnalite was a nice trade. It's so good, one of those 'they don't make them like they used to' items.", "Better idea: just eat off it. When my partner and I have broken all of our move-out-of-home plates I plan to pull my grandma's ugly ceramic dinner set out of storage so I can use it for its intended purpose.", "Same. You’re my tribe."]}