{"id": 17956, "submission_id": "13p7z7w", "title": "AITA for refusing to share food with my in-laws?", "selftext": "O.K. so I am asking for opinions. My husband and I try to spend as much time as possible with my in laws as our schedules permit. We recently took my mother in law to the movies as we arrived I asked my mother in law if she wanted anything to eat. My mother in law said she only wanted a soda. I asked her again if she wanted anything else after my husband got her soda. I was still waiting for pretzel bites and Chicken tenders when she mentions that they look yummy. I asked her again if she wanted me to order her some. she once again said no. I order another set of tenders just in case. Fast forward to paying I ask for two buffolo sauces, I know my mother in law likes to eat that with her popcorn.  My mother in law makes a comment about how much food i'm eating, I just ignored it. As we are sitting down my husband sits between my mother in law and me. Mid movie my mother in law asks for popcorn, I knew she would so I had already gotten a tray and poured some in there and my husband handed the bucket to her. She waits another 5 minutes and she tells my husband it would be great if I would offer to share some of the buffalo sauce with her. I grabbed the extra buffalo sauce and handed it to my husband. She made a comment, can't remember exactly what it was but something along the lines of \"too good to share\". I stayed quiet and didn't mention anything. My husband asked my mom to relax. Fast forward another five minutes and she asks my husband if I wouldn't mind sharing a small piece of tender with her. I hand him the extra box of tenders I got. She gets up and walks out of the theater. My husband and I of course follow behind. My mother in law starts crying to my husband how I am making her feel like I don't want her there. I explain to my Mother-in-law how I am not used to sharing my food and my mother has always taught me that if I am inviting my in-laws out I should be the one making sure they get their own food so as not to seem rude. Honestly, I don't share because some people double dip and honestly that grosses me out, I of course did not tell her this. I told her I absolutely wanted her there and I just assumed she would like her own food. My husband of course talked to her and asked her what was going on. We have been married for over 10 years and although my mother in law and I don't have the best relationship we tend to be civil to each other.  Was I the asshole in assuming that she wanted her own food? Should I have just shared with her? I mean I can't remember a time where she has asked me to share food with me but I do know she likes to munch when she watches movies.", "created_utc": 1684800246, "permalink": "/r/AmItheAsshole/comments/13p7z7w/aita_for_refusing_to_share_food_with_my_inlaws/", "score": 62, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I think I am the asshole because I might have made my mother in law feel like she wasn't wanted by buying separate food for her instead of sharing from my containers.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA it sounds like you knew she'd be hungry and prepared for that allowing her to have her own.", "NTA; it honestly sounds like she was trying to set you up so she could be mad at you (and try to get your husband mad at you too), and you weren't playing along.", "NTA.  You knew she would want some and got it for her, where is the wrong?", "NTA.   Why was she acting so childish when you anticipated and planned for what would happen?   She seems to have some weird power play and was pissed that you already planned for it.\n\n>My mother in law starts crying to my husband how I am making her feel like I don't want her there.\n\nYou give her food and that's her response?  She was already picking at you, commenting how much you were going to eat,  saying you were too good to share.   She was looking for some petty fight.    Annoying!", "NTA. It seems like you anticipated her wants much better than she did!", "You're definitely NTA.\n\nThis isn't about the OP's dislike of sharing food.\n\nHis mom's martyr complex and passive-aggressiveness is the only problem in that situation. OP anticipated her needs. When those predicted needs appeared, OP accommodated her.\n\nIf her desire was that OP literally share tiny chunks of her own chicken and take dips from the same dinky buffalo sauce cup OVER THE LAP OF OP'S HUSBAND, then she isn't thinking clearly and needs a check up that includes a dementia test. \n\nIf her desire was to be \"no trouble\" (a martyr) by denying the offer of food, because she prefers making weird requests for nibbles of someone else's food instead of being grateful that DIL was thoughtful enough to anticipate her needs, then she should probably be ignored the next time she says she doesn't want something. Buy her ALL the concession goodies and load up her arms, and tell her, \"I know you like to eat these, in spite of your denials, so here ya go, Barbara. And be careful you don't spill your soda.\" \n\nIf her desire is to be the center of attention and make sure they both follow her begging to know why she's upset, because that kind of attention fulfills her, then she needs to stay home and not attend the movies. \n\nShe's a manipulator and I always advise people to cut people like that out of their lives.", "NTA\n\nI guess there wasn’t enough drama on the big screen, MIL decided to add her own.\n\nYou were kind, showed forethought and caring. I’m not sure what else she could have asked for.", "NTA Sounds like she was looking for an excuse to blame you for a strained relationship. Perhaps it would be best if your husband and his mother had some more quality time, just the two of them. Sounds like she’s not a fan of competing for his attention or being a third wheel, so you might want to graciously bow out and spend that time with friends instead.", "Dear MIL, \n\nWhat you meant to say “OP, you are the bestest DIL in the world for taking me to the movies and buying me treats. I don’t know what I did to deserve such an amazingly insightful DIL but I’m so thankful to have you!”.\n\nSincerely,\n\nThe People of Reddit\n\nP.S. NTA but she sure is.", "She didn’t want to look greedy and insisted on just a small drink, this way she was counting on asking « just a small bite «  of your food, knowing you wouldn’t let her starve.\n\nwhen you gave her a full portion, she knew you saw through her fake humility. And thought you saw her as a greedy person.\n\nwhich, I mean, she is. I just hate people who pretend to not want anything and start asking for food from my plate as soon as we sit down.\n\nwhat am I? A mama bird ?   \n\n\nNTA", "NTA.\n\nMIL knows you don't like to share. She's aware of your boundary. She was trying to abuse you and you didn't let her.\n\n\"Too good to share\" gave it away. She didn't want her own. She wanted to get her fingers into yours.", "NTA- soooo, she’s upset that you got extra food for her ?? \n\nBut NO, that wasn’t good enough,she wanted YOURS??\n\nGood on you for putting a stop to what’s clearly a Power Move on her behalf.\n\nAnd when it didn’t worked. She went nuclear with the hysterics.\n\nJesus, that woman sounds intolerable. \n\nGood job , OP.", "NTA.\n\nMIL is going out of her way to be offended that she can't fuck with your food.", "My goodness you come off as a seriously prepared daughter in law. People would be lucky to have you that in tune with their snack wants at the theater. You are NTA for anticipating what she would ask for and graciously getting it for her before the movie started so she wouldn’t even have to get up and miss any of it. She seems like she’s trying to make mountains out of molehills.", "I suspect mil was the kind who pretended she didn't want to eat and then eats other people's food orders, the \"no, i m dieting, i don't want to eat dessert\" then reaches over and eats the majority of your ice cream kind.\n\nYour getting food for her shows her that you already anticipated her behavior and she doesn't like it pointed out to her.", "NTA. I don't know why her idea of sharing is so narrow that she feels like it must be confined to a single plate or a single entree, but it's downright weird. And if she feels uncomfortable because you managed to anticipate her every need, that's her problem. Hers! Not yours!! I have to agree with many other commenters, this really seems like some sort of incredibly bizarre power play and if the relationship between the two of you is bad, I sincerely doubt it's because of anything you're actually doing.", "Nta.  You will never make her happy.", "Nta because you were right. Would she rather you refuse to share, and she just goes without?", "NTA. You were in fact sharing with her. You purchased the food and gave some to her. That's sharing.", "NTA\n\nYou were considerate. She is an entitled narcissist. \n\nI don’t like sharing my food. I will happily buy my friends or family anything they’d like to eat or drink. \n\nI want to eat my own food. It’s a boundary I am comfortable with. \n\nIf anyone else finds my boundary irritating that is their problem, not mine. \n\nI’m a kind person, and will go out of my way to do nice things for others, but sharing my food is my choice, not theirs. \n\nYou just deftly sidestepped her drama and lack of foresight and she couldn’t take it so threw a hissy fit. I’d go LC. That childish behavior is completely obnoxious.", "NTA... Dont be apologetic about being prepared for her ways. You did nothing inhospitable.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nO.K. so I am asking for opinions. My husband and I try to spend as much time as possible with my in laws as our schedules permit. We recently took my mother in law to the movies as we arrived I asked my mother in law if she wanted anything to eat. My mother in law said she only wanted a soda. I asked her again if she wanted anything else after my husband got her soda. I was still waiting for pretzel bites and Chicken tenders when she mentions that they look yummy. I asked her again if she wanted me to order her some. she once again said no. I order another set of tenders just in case. Fast forward to paying I ask for two buffolo sauces, I know my mother in law likes to eat that with her popcorn.  My mother in law makes a comment about how much food i'm eating, I just ignored it. As we are sitting down my husband sits between my mother in law and me. Mid movie my mother in law asks for popcorn, I knew she would so I had already gotten a tray and poured some in there and my husband handed the bucket to her. She waits another 5 minutes and she tells my husband it would be great if I would offer to share some of the buffalo sauce with her. I grabbed the extra buffalo sauce and handed it to my husband. She made a comment, can't remember exactly what it was but something along the lines of \"too good to share\". I stayed quiet and didn't mention anything. My husband asked my mom to relax. Fast forward another five minutes and she asks my husband if I wouldn't mind sharing a small piece of tender with her. I hand him the extra box of tenders I got. She gets up and walks out of the theater. My husband and I of course follow behind. My mother in law starts crying to my husband how I am making her feel like I don't want her there. I explain to my Mother-in-law how I am not used to sharing my food and my mother has always taught me that if I am inviting my in-laws out I should be the one making sure they get their own food so as not to seem rude. Honestly, I don't share because some people double dip and honestly that grosses me out, I of course did not tell her this. I told her I absolutely wanted her there and I just assumed she would like her own food. My husband of course talked to her and asked her what was going on. We have been married for over 10 years and although my mother in law and I don't have the best relationship we tend to be civil to each other.  Was I the asshole in assuming that she wanted her own food? Should I have just shared with her? I mean I can't remember a time where she has asked me to share food with me but I do know she likes to munch when she watches movies.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA.  If she wanted more than a soda, she has only herself to blame and her passive aggressiveness isn't a good look.  If she wanted something else, she should've communicated that like a grown-ass woman.", "Exactly.  It shows similar things have happened.  OP was prepared and planned.\n\nAlso handing over an unopened package of food is sharing. Insisting food thats actively being eaten is gross and rude.\n\nDoes MIL have early dementia or stroke issues? If its not healthy related the lady is just intentionally being drama to cause issues.\n\nNTA", "I have not seen her in a while since both my husband and I have different schedules but I had promised myself that I would attempt to have a better relationship with her for my husband. We had our arguments before but never to this magnitude. I was really confused as to how I made her feel unwelcome.", "Yes,   very odd drama, but I agree", "The wrong is the OP was prepped and had food for MIL *without having to deprive herself* of food. MIL didn’t really want the food — she wanted OP to go without as a show of submission.\n\nAt least, that’s the wrong from MIL’s perspective. It’s not right but it’s clear MIL was pissed that her antics weren’t effective so she resorted to the huff-and-cry option in an attempt to still make it OP’s fault.", "My question exactly. Thank you for your comment.", "It is honestly the first time I have seen this side of her. She is usually straightforward when she doesn't like something. I know my husband has also been trying to work on his relationship with her and they started to go out together for breakfast. I don't know if maybe she did not participate me actually going but I know my husband asked her if wanted to join us.", "Thank you, I usually try to keep the peace. I am not perfect but I was honestly confused because I did try to be on her good side by making sure she had food if she wanted some.", "My mother in law doesn't seem to think so. Thank God she is a healthy woman and God willing we will still have her for many years to come. We have had a strained relationship but I honestly hoped it was getting better.", "**She deliberately wanted to deprive** ***you*** **of your food.**\n\nThat's why she was so angry -- because she expected to either be able take your food from you, or make you look like a selfish person if you said \"no\". Either way, she wins by punishing you!  \n\nBut instead, you headed her off at the pass by buying her her own set of food. So she found an alternate way to punish you, by forcing you to leave in the middle of the movie.\n\nThis is all about control. It was her attempt at a power play, and she's angry because you knew exactly what she was up to, and stopped her in her tracks. \n\nPlease show your husband my comment. He needs to understand exactly what his mother is up to. He needs to put a stop to this sort of manipulation.\n\nStop letting her control your lives. The next time she does something like this, the two of you need to stay seated in the movie and just let her leave to pout. Let her stomp away and don't follow her or apologize or attempt to appease her. This is the only way she will learn that her manipulation is no longer going to work.", "I agree completely! I think OP is absolutely overlooking how manipulative and passive aggressive MIL is! She completely foiled MILs plans!", "This is it! NTA op. Never surrender!", "I think she was looking to stir up some shit, otherwise her reactions don't make sense.", "Does your husband always hold her accountable? \n\nI honestly would be mad at the wasted ticket and food costs.", "I would've assumed my MIL had to pee and stayed out of \"blindness\" 😇", "💯 this!!!"]}