{"id": 18059, "submission_id": "13qihbr", "title": "AITA for not wanting to get a spray tan for my sister's wedding?", "selftext": "My older sister is getting married soon and made me one of the bridesmaids. Since her wedding is at a beachside venue, she told me to get a spray tan so I wouldn't stand out.\n\nMy family is white as hell so we all grew up using self tanner all the time. As I've grown up, I just prefer my natural shade since I think any tans look really artificial and harsh on me since I'm a ginger. My other sisters who are all natural blondes look fine with tanning and still use self tanner on a regular basis. My other sisters told me to just suck it up and listen to the bride, but I really don't want to since these spray tans last for a while and it would be super tedious to try to fully remove. My mom's on my side, but my older sister said I'll be sticking out like a sore thumb against everyone else and that I'm trying to stand out on her wedding.", "created_utc": 1684926655, "permalink": "/r/AmItheAsshole/comments/13qihbr/aita_for_not_wanting_to_get_a_spray_tan_for_my/", "score": 42, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1. I am not wanting to get a spray tan for my sister's wedding. 2. It's her wedding and my older sister thinks I'm trying to stand out in her wedding\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. \n\nI hate when brides try to alter bridesmaids appearances for their wedding day. That's super weird. And tans last for a pretty long while so I don't see why you should have to alter your appearance.", "NTA. I get wanting to co-ordinate dresses/shoes etc, but co-ordinating skin colour is just ridiculous and not fair to the people who then have to live with it after the wedding is over.", "NTA, can you ask your sister for a paid vacation to Dubai or something so that you can take a week off to get tanned naturally? Might help her change the mind.", "NTA,\n\nchanging the colour of you skin for a wedding is not a normal request. the way you have your hair and makeup yes but really tanning is just wild to me", "NTA.  I’ve heard of a white dress upstaging the bride, but white skin?", "Tell me you only know white people without telling me you only know white people. \n\nWould your sister ask someone with darker skin to bleach it for the wedding so they wouldn't \"stick out like a sore thumb against everyone else?\"\n\nNTA", "NTA\n\ni dont think ive ever seen a ginger with a tan and I believe theres a reason for that. yeah you'll stick out but i dont think itll matter since its her wedding and she'll be the damn bride. i hate it when brides think someone'll steal their \"thunder on their big day\" when they're just a normal person not in a big white gown.", "NTA\n\nSorry but it is your body and you get to choose what you put on it. Full stop!\n\nThe entitlement of some of these brides... wanting everything to look a certain way on their wedding so it will be perfect! Puuulllllleeeaaaasssseeeee!  \n\nI question the whole idea it has to be perfect. It is one day... a significant day, but only one day. If they cannot deal with it not being perfect, how can they deal with a real marriage where there is never going to be one perfect day after another.", "Obvious NTA. If it goes poorly, you can't get it off. And in photos everyone will just think how it doesn't look like you. Not everyone at a wedding has to have the same shade of skin color. That's weird even in a family.", "NTA.  I have Scottish pale blue colouring & fake tans just look ridiculous!\n\nI'm surprised there hasn't been a eugenics horror film yet about bridezillas wanting to clone the perfect bridesmaids.   It's a sign they're so obsessed they need to step back & join the real world for a while...", "NTA, spray tans always look like a spray tan and they last a lot longer than the stuff from the drugstore. maybe you could find a temporary / lightweight bronzing lotion as a compromise?", "NTA. I understand (barely) brides wanting you do dress a certain way or color or whatever. But I wouldnt put spraytan on myself, it looks fake, its unhealthy. Thats like saying \"can you please cut your hair or change color so it can look better on my wedding\" You are in the right here.", "NTA.     I have never, ever looked at peoples  wedding photos and thought \"oh, look how pale  this bridesmaid  looks compared to the others.\"\n\nTell her you either show up as you are or she can find another tanned blonde.", "I did this for my sisters wedding. She didn't demand it, just most people suggested it. I also dyed my hair from vibrant red to blonde.  Looking back at the photos now, literally everyone says that I look weird and not like myself. That stands out way more than if I just went to the wedding as myself. \n\nEdit to add NTA, obviously.", "NTA\n\nSpray tans are the one thing I loathe, iv done it for wedding parties before and oh boy does it make my skin crawl and itch.\n\nPull the allergic reaction card, works a charm", "NTA - no, you dont have to do this.", "**NTA**\n\nYour body your choice absolutely trumps her wedding her request.", "NTA ignore them all", "NTA", "NTA  your sisters are AH....", "NTA", "Unpopular opinion, but: ESH. \r  \n\r  \nI am not a fan of brides dictating to the degree of self-tanner/spray tans for bridesmaids, the color of bridesmaids’ hair, or the covering up of tattoos.  This is where I say NTA.\r  \n\r  \nBut at the same time, the reasons you gave for not doing it aren’t valid, given that spray tans don’t last that long unless you’re not one to shower every day (and especially if it’s just a light base).  If you were to say you were someone who only uses natural deodorants, sticks to a vegan diet or vegan adjacent diet, uses only vegan makeup, and doesn’t like the idea of the chemicals from spray tans being on your skin, then I’d understand more.  Or if you were to say that you can’t afford the spray tan on top of all the other requirements of your sister/the bride, I’d understand.  So, there, I do say YTA.", "YTA. Not wearing spray tan is the same as opting not to get your hair or make up done", "You're not the AH for not wanting to, but YTA if you don't. \nIt's a beach wedding and everyone else is going to have some color, you should too. You don't necessarily have to get a spray tan, but do something.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy older sister is getting married soon and made me one of the bridesmaids. Since her wedding is at a beachside venue, she told me to get a spray tan so I wouldn't stand out.\n\nMy family is white as hell so we all grew up using self tanner all the time. As I've grown up, I just prefer my natural shade since I think any tans look really artificial and harsh on me since I'm a ginger. My other sisters who are all natural blondes look fine with tanning and still use self tanner on a regular basis. My other sisters told me to just suck it up and listen to the bride, but I really don't want to since these spray tans last for a while and it would be super tedious to try to fully remove. My mom's on my side, but my older sister said I'll be sticking out like a sore thumb against everyone else and that I'm trying to stand out on her wedding.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. You do not have to do anything with your own body that you don't want to do.", "NTA\n\nAccomodations for the DAY are fine, anything that isn't gone after a shower is over demanding!", "NTA\n\nFellow ginger here. I would have looked at the bride as it she had three heads if she asked me to do something like that. “I want you to alter something fundamental about your appearance for my wedding.” F*ck no.", "NTA! As a fellow ginger- you’ll look like the Cheeto with a spray tan and mauve dress. We are literally known for “eating souls”, she doesn’t wanna mess with a ginger’s pale skin and freckles bc ginger snaps are only good when they’re cookies", "NTA. If she wants you there, she needs to accept who you are, not create her idea of you.", "NTA\n\nNo one is the owner of your body to make decisions about it. She could **suggest** this, but not demand.", "NTA. If your sister's concern is you \"standing out\", she's the AH. Has there ever been a tan ginger in the history of gingers? I think not, so you would stand out *with* a fake tan more than without one.", "NTA\n\nMy friend got an extremely light spray tan at the bride's request for a wedding (she is pale as sin and her hair is like red orange). And it looked fine, and only because the tan made her two maybe three shades lighter so she had a healthyish glow. And i thought even that was a bit silly...but that is different to this. If your sister wants everyone to look like a copy paste maybe she should just not ask you to be a bridesmaid? I don't get the logic to asking people to change so drastically to fit ridiculous pictures you have in your head...dreams and reality are different for a reason.", "NTA \n\nYou can wear a dress she choose and shoes. You can listen to mail color ideas \nColoring skin? Super weird", "There are foundations that are meant to cover tattoo’s. Foundation washes off.tell the make up artist to use a foundation to match a tan. DONE\n\nNTA", "Nta but if she won't budge I woukd ask her to pay for it to be done and pay for it to be removed", "She's claiming that the mauve dresses she chose for us will look off with me being so pale and pasty😭✋", "Omg this! Nta", "Very tempting lol", "(and the hair is how you wear it, not its length or color. nta. it’s her special day! emphasis on day. nothing that lasts past the day is a reasonable demand.)", "Maybe the bride is taking the whole 'wearing white' to a wedding a bit too far. Clearly being pasty white is a way to hijack the wedding and get all the attention. Therefore all pasty guests must be oompa loompa orange to divert attention back to the white wearing bride", "I think it's weird as hell too, like why are you trying to match your family to your color scheme. I remember her even joking that maybe I should be wearing a blonde wig too.", "literally what i was thinking", "This!", "That was my worry too. Being stuck looking even more like a carrot until it finally washed off", "Then why did she pick it? Or she loved the color why did she want you as a bridesmaid if she knew the color was going to go?", "So she looked at the dresses and thought \"wow those would look great with fake tan\"... very odd.", "Ask her which Pantone shade she wants you to be. Or show her the British tea chart and get her to pick one.  https://tea-chart.co.uk/\nYou are NTA.", "She doesn't want bridesmaids, she wants props", "Lol\n\nBrew haha will go fine with ginger hair. Witch outfit included"]}