{"id": 18072, "submission_id": "13qj21e", "title": "AITA for telling my sister I'm not going to let her disrupt me in a bath again?", "selftext": "So, I (17m, trans) have a sister (14f) who, to put it simply, is horrible. She is never nice to me. She always manages to get her way with things. She believes she is entitled to everything, and should have everyone do as she asks.\n\nSo, I was going to get a bath/shower (our actual shower is broken, so we have to have a bath and use the showerhead to wash our hair). I asked her, before I even started running the bath (at around 11.50), if she needed the toilet. She said no. So, I went ahead, started running the bath at a slow speed so I could get my stuff ready- as I was planning to do college work and stuff after, I was spending time getting that stuff out. When I actually got in my bath/shower, it was around 12 o'clock. Now, to make it clear, the most amount of time I have ever spent in a bath is 20 minutes because I sometimes just like to relax. \n\nI had been in there 10 minutes, and I was just about to finish washing off my hair when she started knocking on the door and telling me to get out because she needed to go to the toilet. I told her \"No, I'm not finished yet, there is an outside toilet you can use and I asked you beforehand if you needed to go.\" she made a fuss, essentially crying about it, before I had to get out and stand on the landing with a towel wrapped around me. This was super uncomfortable for me, as it made me spend even longer basically naked, which is already hard enough for me due to dysphoria.\n\nShe spent a few minutes in there, before finally getting out. I went back in, immediately finished with my hair and got out. Took me barely any time, 2 minutes max. I got dressed, went downstairs and told her that next time I am not going to be responsible for her weak bladder and that she can either go when I ask her if she needs to, go outside or wait a few minutes for me to finish. She, of course, starts to kick off crying and claiming its not her fault I take hours in the bath and that she doesnt like the outside toilet - she doesnt like spiders, and apparently theres loads in there. I have literal arachnophobia, and I go out there. Theres never usually any spiders.\n\nI hate people crying, and my mum told me off for being rude, and now I'm starting to feel bad for it. So, AITA?", "created_utc": 1684928351, "permalink": "/r/AmItheAsshole/comments/13qj21e/aita_for_telling_my_sister_im_not_going_to_let/", "score": 64, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > My sister cried and yelled at me because I told her I am not letting her disrupt me time and time again in my bath because she has a weak bladder.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nWe all shared a bathroom growing up, and I always hated it when my siblings barged in while I was showering or bathing.", "Lol NTA", "you asked beforehand, she said no. you weren’t in there for too long, and there was another bathroom available. she’s got a bad case of entitlement. nta, do as you said and stop letting her interrupt your bathing.", "\" my mum told me off for being rude\"\n\nMom doesn't care about fair or even reasonable expectations from the 14f.  Mom cares about quiet in the house.\n\nNTA, OP.", "Not an asshole for wanting to bathe in peace - and you're not spending an excessive amount of time in there.\n\nSoft asshole for running the bath slowly whilst pottering around getting your school stuff ready. You've only got one bathroom, so you need to be efficient at running the bath. \n\nOverall, NTA", "NTA", "NTA\n\nTbh I used to get this a lot also, if your asking her to go beforehand and there is another toilet then that's not your problem\n\nHopefully your bathroom has a lock, if so ask her if she needs to go beforehand (to cover your ass) as your gonna play music when your bathing....then play some music to drown her out incase she tries lol.", "How is it that she is scared of spiders but you are the one with arachnophobia? Yet you're comfortable going into places that spiders would hang out in? I think you have the two parts confused. Impossible to judge when this story is so very one sided", "[removed]", "20 minutes for a bath that's a lot of time unless you're a construction worker or something isn't it?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSo, I (17m, trans) have a sister (14f) who, to put it simply, is horrible. She is never nice to me. She always manages to get her way with things. She believes she is entitled to everything, and should have everyone do as she asks.\n\nSo, I was going to get a bath/shower (our actual shower is broken, so we have to have a bath and use the showerhead to wash our hair). I asked her, before I even started running the bath (at around 11.50), if she needed the toilet. She said no. So, I went ahead, started running the bath at a slow speed so I could get my stuff ready- as I was planning to do college work and stuff after, I was spending time getting that stuff out. When I actually got in my bath/shower, it was around 12 o'clock. Now, to make it clear, the most amount of time I have ever spent in a bath is 20 minutes because I sometimes just like to relax. \n\nI had been in there 10 minutes, and I was just about to finish washing off my hair when she started knocking on the door and telling me to get out because she needed to go to the toilet. I told her \"No, I'm not finished yet, there is an outside toilet you can use and I asked you beforehand if you needed to go.\" she made a fuss, essentially crying about it, before I had to get out and stand on the landing with a towel wrapped around me. This was super uncomfortable for me, as it made me spend even longer basically naked, which is already hard enough for me due to dysphoria.\n\nShe spent a few minutes in there, before finally getting out. I went back in, immediately finished with my hair and got out. Took me barely any time, 2 minutes max. I got dressed, went downstairs and told her that next time I am not going to be responsible for her weak bladder and that she can either go when I ask her if she needs to, go outside or wait a few minutes for me to finish. She, of course, starts to kick off crying and claiming its not her fault I take hours in the bath and that she doesnt like the outside toilet - she doesnt like spiders, and apparently theres loads in there. I have literal arachnophobia, and I go out there. Theres never usually any spiders.\n\nI hate people crying, and my mum told me off for being rude, and now I'm starting to feel bad for it. So, AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. We had just the one shared bathroom when I lived at my parent's, which thankfully had a lock on the inside.", "Y’all are gonna hate on me for this but I dunno it’s kinda normal. You just close the curtains and they let you know when they’re done so you can get out again and lock the door. \n\n3 siblings and one washroom, it is what it is. My sisters and I have done the same thing to each other countless times! When you gotta go you gotta go. \n\nAlso tbh it kinda sounds like OPs sister’s arachnophobia might be worse than his. I’ve done similar things with the threat of roaches.", "Squeaky wheel gets the oil. Op can be the bigger problem if he wants.", "Believe me, I have had full blown panic attacks because of spiders simply existing in the same room as me. The outside bathroom has one spider in it per month. Our inside bathroom is more prone to having spiders in there.", "What does that have anything to do with it? She's supportive, she doesnt hate me for it.", "Fuck no. I can do 45 mins in a bath! It’s not all washing and rinsing.", "No? Plus I stated the max amount I spend in there is 20, thats not my average. My average would be like 7-10 minutes.", "....No? The fuck?", "And you're not bothered about the spider outside? It sounds like you both have issues with spiders. You're more comfortable about running into the odd one in the outdoor bathroom, so that's good. Great, in fact. My sibling couldn't be dragged into an outdoor toilet if there was a risk of a spider being in there, at all", "I stay till I'm shriveled. I'm making rhe most of the hot water till it's cold!", "Isn't that just lying in dirty water which has all the stuff one washed off? Different povs I guess ☺️", "Its a rare enough occurence that if I absolutely had to use the outside bathroom while the main one was occupied, I would use it. I dont use it daily, only if its necessary. And she definitely doesnt have arachnaphobia, i can say that for certain. She will see a spider and go \"Oh look a spider :)\" and I will immediately freak out when she says that.", "Isn't that the point of a bath? If you're just there to get clean a shower is quicker, easier and uses less water and energy to heat said water.", "I don’t usually take a bath when “dirty”. I usually suds and rinse then fill the tub then rinse again", "Why are you invalidating her? She could say you don't have it because you're ok with using the outside bathroom. Did the psychiatrist explain to you how phobias can manifest differently for people?", "You fill the bath twice? Or am I reading this wrong?", "She only expresses a fear of them when its convenient to her. Such as this situation.. Correct me if im wrong, but you cant pick and choose when you get scared of something, especially with a full phobia.", "You are reading it wrong", "What do you mean by a \"full\" phobia? Symptoms of phobias can vary from person to person. It's great that you went to a psychiatrist and got properly diagnosed, maybe hold off on judging your sister until she does the same.", "You suds and rinse before running the bath then? Is that in a shower, or what?", "A phobia is a literal anxiety disorder, it is an excessive and persistant fear of something. Theyre present for over 6 months, they arent just one day youre like \"Ooh a spider :D\" and the next youre like \"I cant go out there because there could be a spider!!\", especially not when it consistently flips between the two. Yes, phobia symptoms can vary, but it is a persistant and excessive fear. If you have a phobia of something, you are not perfectly fine with the thing until it is convenient to you.", "Uhhuh", "Surprisingly I do know what a phobia is, but thanks. Maybe you should get your sister to speak with the psych you spoke to, if she thinks she has a phobia then they'd be the best person to tell her if she does or doesn't, right? And if the psychiatrist says she doesn't, that's great news.   My sibling is arachnophobic and can't even look at a photo of a spider, one of my close friends is fine around photos or drawings as long as they're not too detailed, but just thinking about a spider landing on her hair is enough to make her start crying", "I can see communication skills is probably not mentioned on your resume lmao", "My resume doesn’t have stupid questions on it", "It only ran for 10 minutes which seems a normal amount of time. 20 minutes total to hold it is nothing even if little sister had to pee before the bath started", "I mean, since he wasn't in the bath yet, she still had the option to go while it was running, no ?", "I was actually thinking it was rather short for a bath. If you're using all of that water you may as well sit in it for 40+ minutes, no? Otherwise it's a waste imo.", "Ive explained this in replies to someone else. She does not have arachnaphobia 100%. She is only scared of them when it is relevant to herself, such as this situation.", "[removed]", "Well that’s just silly behaviour", "Okay? That has literally nothing to do with this.", "[removed]", "You being transphobic does not relate at all to this post, thank you. Take your ideas somewhere else.", "[removed]", "Yes... Thats what transphobia is. \"Transphobia consists of negative attitudes, feelings, or actions towards transgender people or transness in general. Transphobia can include fear, aversion, hatred, violence or anger towards people who do not conform to social gender expectations.\" And its in no way disgusting, thanks :)", "[removed]", "I dont think you're reading my replies properly. Based on the definition of a phobia, my sister cannot be arachnaphobic because she is only scared of spiders when it is relevant to her. You seem to be dismissing that point entirely. She physcially cannot have arachnaphobia because she will only be scared of them when she can use it to her advantage, such as the situation in the post. Not even two hours after that situation had occured, she pointed out that there was a spider in the room we were in. Her words were along the lines of, \"Oh cool, its a spider!\". A phobia does not disappear in a few hours. I really dont see how you have yet to understand this.", "I dont think I was born the wrong gender, I know I was. Sorry your little bigoted brain cant handle that."]}