{"id": 18088, "submission_id": "13que9e", "title": "AITA for telling my niece about her mom’s past?", "selftext": "My (38F) sister, Lauren (42F), had a pretty wild youth. I did too, so no judgement on my part. When Lauren was 18, she got pregnant and chose to get an abortion. This was her wake up call. She went to college, later got a great job and found her husband. They had a daughter, Roxy, who’s now 17. \n\nRoxy is a very studious and responsible young woman, but this is in no doubt to how hard her parents are on her. Lauren has said several times that she doesn’t want Roxy to end up like her. Which I understand but I’ve also told her that she can’t be so hard on her. Let her make mistakes and guide her through them vs yelling.\n\nRoxy found out she was pregnant in March. Lauren and her husband reacted horribly. I have a daughter who’s of similar age and I know I wouldn’t be thrilled either. However, Lauren and her husband  took it too far in my opinion. They shamed her, told her she’s a disgrace. They said even if she got an abortion or gave the baby up for adoption, they found her irresponsible and didn’t want her around. They kicked her out. Roxy’s boyfriend’s parents did the same. The two are now living with my family.\n\nThis has been incredibly hard on Roxy. She plans on raising the baby, but keeps saying she feels like a failure. I never knew how truly bad Lauren was, but she’s always called Roxy horrible names and made her feel like she wasn’t good enough.\n\nI finally told Roxy all about her mom’s past and told her that Lauren had no right to talk. I prefaced this by saying this isn’t what made Lauren a bad person and I don’t shame her. But used it as Lauren has no moral high ground.\n\nRoxy called Lauren and called her out on her hypocrisy. My extended family is mad at me. Most aren’t happy with Lauren but say it wasn’t my place to spread her business. Apparently her husband didn’t know about her past either and is calling her a liar, etc. My parents and other family members say I should’ve kept my mouth shut.", "created_utc": 1684954888, "permalink": "/r/AmItheAsshole/comments/13que9e/aita_for_telling_my_niece_about_her_moms_past/", "score": 168, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) telling my niece about her mom’s past. 2) it wasn’t my news to share and I could’ve used something else to make my niece feel better.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA - don't throw stones if you live in a glass house. My god, how awful for your niece. Thankfully she has you to support her in her choices. This is a hard place for any 17/18 year old to be, regardless of their final decision. For her mother to be so horrible, especially having gone through similar herself, is truly awful. \n\nGood for you for sharing her mother's story. Normally I would say not your place, but in this specific instance, it feels necessary to help your niece.", "NTA.\n\nYour niece has just had world turned upside down, and your sister has practically abandoned her for doing the same thing she did at her age. \n\nOne thing some parents don't get is that by putting so much pressure on their kids so they don't make the same mistakes, it drives them to rebel and screw up. The fact that your sister hid her past from her husband of over 17 years says a lot about your sister\n\nYou have gone above and beyond by taking in your niece and her boyfriend and they seem to be showing maturity and responsibility by wanting to actually raise the child (I'm assuming the boyfriend wants to do so seeing as he is with her).\n\nYour niece deserves to know that everyone can make mistakes and your extended family are wrong for not helping out", "She has a right to know her mother is a hypocrite of the highest order. NTA", "NTA your sister brought it on herself.", "NTA, your parents and other family members are saying they'd rather let Roxy's parents make her feel like shit when they have no right to speak, instead of causing conflict", "NTA - And you are a great person for taking your niece and baby daddy in. Lauren is the worst kind of hypocrite.", "NTA\n\nYour sister’s a hypocrite. An abusive one, by the sounds of it.\n\nYou put a confused and ashamed pregnant 17yo who’s been treated appallingly by her parents first for what sounds like the first time in her life. THANK YOU, OP. \n\nI can’t believe your extended family is mad at YOU for telling a 17yo who’s been shamed by her mother for a teen pregnancy that her mother was in the same position herself.", "NTA.  What you shared helped your niece confront your hypocrite sister.  Good for you!", "NTA and I feel very sorry for your niece, this was something she needed to hear.\n\nPeople need to remember 2 things\n\n1 your past isn't a secret and people will find out about everything you did eventually\n\n2 people can, will, and should judge you on your past. Whether you learned and grew or didn't your past literally defines you, it's the reason you are who you are today.\n\nThe fact that your sister knows what your niece is going through from lived experience and still tries to hold the moral superiority is not only hypocritical, it's disgusting behavior. She knows she would not have wanted that treatment when she was in that situation, yet she is willing to treat others like that.", "You did right by your niece but burned your sister. \n\nYou blew up your sister’s marriage.  Well,  she blew up her own marriage with lies.  NTA \n\nIt is so sad that women like you sister feel so much shame about their past.  She wish she made different choices, but that doesn’t mean she has to be so hard on her daughter.  I hope the two of you can reconcile and both support your niece .", "NTA - I was quite the screw up in my early 20's, though made good. When my kids were growing up (now in their 30's), I never hid my past. Instead I used as a learning moment for them.", "NTA. Lauren made the situation, you just told a struggling teenager the truth in an attempt to start to heal some of the damage Lauren's abusiveness has caused.", "NTA/ it became your business when your family had to take her in because her own parents forgot how it is to be young and make mistakes. They also forgot how to parent obviously, sad…  Glad she has you for support, sounds like she could use all of it she can get. Let her know to use this situation to become an even better parent than hers are being", "NTA - Roxy was disowned by Lauren. Seems to me she lost parental rights about what Roxy should and shouldn’t know. I think this information was important to your niece and is something that Lauren should have shared herself. This is all very sad. I’m glad Roxy has you looking out for her.", "NTA \n\nYour niece deserves to know the truth, however I would have handled it differently.\n\nI would have taken Roxy back to Lauren to \"mediate\".  Get all the issues on the table. You do not actually say what your mom did when this happened, however I would have used this information as leverage.  Give Lauren a chance to back off.\n\n\"What would mom do in this situation?\"\n\nIf that did not work...\n\n\"What DID mom do in this situation?\"\n\nIf your mom kicked her out, I would say...\n\n\"So, still taking after mom?\"", "I was going to write YTA, but when I read Roxy was kicked out of her own home and she is now on her own, well then, that information is fair game.  NTA.", "NTA. Your sister is so typical, she’s a complete hypocrite.  Her daughter has the right to know that given the way she’s being treated.", "NTA.\n\nHypocrites hate being called out on their hypocrisy. And it sure as hell IS your business since your niece is living with you.", "NTA. Your sister is an abusive parent and a hypocrite. Screw her feelings. You are awesome for supporting your niece through this.", "NTA and decades ago I temporarily took in a teenager under very similar circumstances. Your sister lost her right to privacy when she kicked out her pregnant daughter and also banned her from options she'd personally used plus adoption. Thank you for taking them both in. I'm sure it is difficult with space and money but I hope both these kids still get the opportunity to go to school if they want. Anyone in the family should be encouraged to donate to their future and immediate needs if possible.", "Nta glass houses, people!", "NTA\n\n It amazes me how some parents are so ready to kick out their children.", "NTA", "ESH. Yeah, your sister is a piece of work, making horrible parenting mistakes. maybe talk to her about her hypocrisy. But it's not your story to tell. Counsel your niece. Be the positive in her life. Love her.", "ESH except Roxy.\n\nLauren and her husband are AHs for obvious reasons.\n\nYou're an AH for telling Lauren's secret without giving her a chance to do it herself first. Good for you for being there for your niece, but you lit your sister's marriage on fire. A justified AH is still an AH.", "Personally I'm torn on this one but here it is:\n\nESH - Except Roxy.  Oh and maybe Roxy's dad - not sure about him, he may have been part of the strict rules in place in their house (is he religious) but yeah he probably is an AH for not supporting his daughter in this particular instance.\n\nIt sure really wasn't your place to tell Roxy about her mums past. But I get why you did it and I might have done the same in your position\n\nLauren is an AH and a hypocrite for obvious reasons.\n\nThe rest of the family can go pound sand, This isn't their circus.", "Not going to be popular, but ESH.\n\nWhat shitty examples you all are for the kids you're supposed to be raising.\n\nYour sister's abortion was none of anybody's business, not even her daughter's. \n\nAnd Who is going to pay for that baby your niece decided to have if none of thé grand-parents want to be involved ? Because I'm guessing the teenagers can't really afford à kid...", "ESH. It wasn't your story to tell. You could have been supportive of Roxy without talking to her about Lauren.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy (38F) sister, Lauren (42F), had a pretty wild youth. I did too, so no judgement on my part. When Lauren was 18, she got pregnant and chose to get an abortion. This was her wake up call. She went to college, later got a great job and found her husband. They had a daughter, Roxy, who’s now 17. \n\nRoxy is a very studious and responsible young woman, but this is in no doubt to how hard her parents are on her. Lauren has said several times that she doesn’t want Roxy to end up like her. Which I understand but I’ve also told her that she can’t be so hard on her. Let her make mistakes and guide her through them vs yelling.\n\nRoxy found out she was pregnant in March. Lauren and her husband reacted horribly. I have a daughter who’s of similar age and I know I wouldn’t be thrilled either. However, Lauren and her husband  took it too far in my opinion. They shamed her, told her she’s a disgrace. They said even if she got an abortion or gave the baby up for adoption, they found her irresponsible and didn’t want her around. They kicked her out. Roxy’s boyfriend’s parents did the same. The two are now living with my family.\n\nThis has been incredibly hard on Roxy. She plans on raising the baby, but keeps saying she feels like a failure. I never knew how truly bad Lauren was, but she’s always called Roxy horrible names and made her feel like she wasn’t good enough.\n\nI finally told Roxy all about her mom’s past and told her that Lauren had no right to talk. I prefaced this by saying this isn’t what made Lauren a bad person and I don’t shame her. But used it as Lauren has no moral high ground.\n\nRoxy called Lauren and called her out on her hypocrisy. My extended family is mad at me. Most aren’t happy with Lauren but say it wasn’t my place to spread her business. Apparently her husband didn’t know about her past either and is calling her a liar, etc. My parents and other family members say I should’ve kept my mouth shut.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA\n\nPeople in glass houses...", "NTA  The TRUTH hurts", "NTA, at all.  Your sister did a terrible job in raising Roxy, at least in some respects, because she feels so bad about herself.  Roxy has the right to know the truth about her mom's past, and so does her husband.  You did the right thing by telling her and a heroic thing by taking in Roxy and her boyfriend!", "NTA. What a hypocrite your sister is. You’re trying to make your niece feel better when she’s so vulnerable. It’s a good thing she has you in her corner.", "NTA. Those who live in glass houses shouldn't throw stones. Your friend changed her life around and suddenly got too big for her britches. \n\nAt least you were honest with Roxy. Especially since, per your post, Roxy is in a better place than your friend was.", "NTA. In this case, it was relevant to \"spread her business\". And you didn't tell that story this whole time, it wasn't a random thing.\n\nYour niece was suffering over the treatment of her mother. It was important for her to know this story, her feelings take precedence over your sister's pride.", "NTA. Your sister did blow it massively out of proportion, and based on how she apparently treated her well before all this, it just sounds like she flat resents her own kid, which is terrible. You're not wrong for being one of the few people trying to comfort your niece through a difficult time.\n\nGotta say, I'm even more incensed by their comment about 'even if you got an abortion', so they're basically pushing her even deeper into this hole, and this coming from the woman who ACTUALLY got to have her abortion and live her life without a lifetime of judgment? Shame on her.", "NTA. She tried to throw stones from her glass house and paid for it. You only said that to help your niece and your sister is a massive hypocrite who lied to husband and he's not happy.", "NTA. Your sister is a hypocrite. Instead of owning up to who she is she’s angry everyone found out,", "Your sister is a shitty parent, a hypocrite, and possibly a liar. NTA", "Let’s take this further. Did your sister use her past experience to teach her daughter about birth control and safety or did she just outright try to stifle it all? I doubt the former. She basically treated Roxy like *she* was guilty of mistakes before the fact and thus made it a self-fulfilling prophesy. \n\n Even if Lauren did do the right thing (again highly doubtful),her and her husband’s treatment of her was nothing less than disgraceful. NTA. Is was Lauren herself through her words and actions who made it necessary for her daughter to know.", "NTA- it sounds like your sister has been emotionally abusing your niece for a long time. Your sister deserves everything coming to her.", "YBTA Lauren sounds like a nightmare but you don’t talk about another woman’s abortion, period", "NTA.   Sounds like you're dealing with a born again Christian type.  The worst judgment people of the whole Christian cult.", "NTA. Your sister could have used her past as an opportunity to guide Roxy through this difficult time. Instead, she stayed up on her imaginary high horse, shamed her child and pushed her away at the worst possible time.", "NTA.  I was all set to come down on you, hard, for talking out of turn, but dang.  Your niece needed to hear that.  And a whole lot of extra bonus points for you and your family for taking in the two of them.  You're good people.", "Oh no way! Sing that from the rooftops. You want to criticize your child for making the same mistake you did but not extend any of the grace she received? Nope. She then loses the right to have any of that information withheld. NTA", "NTA.  Someone needs to be in Roxy's corner and I'm glad you're stepping up. To hell with everyone else.", "“Rules for thee not for me”…your sis is that hypocritical shrew on an abortion table screaming that the docs are godless heathens who will burn for killing her baby.", "NTA lol 😂 all secrets come to light eventually. This is just the consequence of Lauren’s actions. Although they might end up divorced. Had she been honest in the beginning this could be avoided. But girl I wish I could have seen the fall out of the self righteous. 🍿", "NTA. Someone needs to look out for that girl and unfortunately it’s not her mother. For her to treat her daughter like that after what she went through herself is absolutely unacceptable. \n\nThat girl deserves to know the full extent of her mothers failings. She needs the whole story because her mothers past makes her current behavior so much worse. Good on you.", "NTA: please please keep us informed! Also,  if she isn't 18. Check state laws. You might be able to get temporary guardianship of her so she can get financial aid.  If over 18 help her get aid from the state please!", "I agree. I kept the wild stuff I did from my son when he was younger, but I eventually used it as a way to discuss issues with him as an almost teenager. I would have been upset if anyone had told him before that. Thing is, as a policy, I was pretty lenient on him in high school because I lived as if I had no rules. So, as long as he wasn't hurting anyone, he was good to go in my mind. It worked out as well because I had credibility with him. He listened and stayed away from drinking and drugs until after high school. I could not ask for more than that.\n\n\n\nSo, having a mother kick her daughter out over something she had done herself is unforgivable in my book.", "100% this!\n\nSister is a hypocrite. This makes me so angry that I’m at a loss of words. \n\nOP, you’re NTA at all. You only told your niece the truth about her mother.", "Same here. As a rule, I’d never share secrets to nieces or nephews about their parents, but in this case it was totally justified. NTA", "Roxy’s dad is exactly like Lauren, without the wild past (or maybe he does, I don’t know, I suppose this whole situation shows we don’t know everyone’s skeleton). I have since learned he was equally as hard on Roxy and called her worse names than Lauren. \n\nBut I accept your judgement on the rest.", "In fairness her telling Roxy about Lauren's past was meant to help Roxy reconcile with facts like unintended pregnancies happen and happen to everyone including mother dearest. It wasn't meant to embarrass Lauren,  but to bring Roxy to the reality of life and make sure she doesn't go spiraling into depression and help her realize that she just like her mother can have a successful life even with a teen pregnancy. I honestly think it was fair to bring to light as Lauren clearly would have never mentioned it and it is extremely relevant. If Lauren didn't want her kid to turn out like her she should have been honest and taught the poor kid about birth control. One conversation and one trip to the doctors could've been enough to avoid all of this.", "My niece and her boyfriend have jobs. We are not contributing financially outside of them living here rent free. Her boyfriend already graduated so he’s  working full time. She’s already got a part time job and plans to switch to homeschooling online for next year. Unsure what that has to do with anything pertaining to this situation?", "Yeah, I don’t really get it. My niece did explore all her options in the beginning and told them she was leaning towards abortion and they still threw her out for being “irresponsible enough to get pregnant”. She since changed her mind on getting one and they’re even more pissed.", "She never taught Roxy about birth control. Instead told her to wait until marriage. Then when Roxy got pregnant, she shamed her and didn’t even worry about her being safe or healthy. Just for “ruining her life”.", "Right? No one is perfect, and failures/mistakes/accidents are often where the most learning comes from so if you can share your experiences with your kids (age appropriate) it can be a great bridge in many ways.\n\nYou hit the nail on the head though; It is the mother's reaction to her daughter's situation that is so horrifying as she experienced the same thing. The hypocrisy makes my heart hurt.", "Ignore the troll. Some people just love to shame unplanned pregnancies.\n\nThank you for being there for Roxy and her boyfriend, and for treating them like human people with thoughts and feelings and who can be held accountable for their choices.\n\nIt's not going to be easy for them, but then again parenting is never \"easy\".\n\nYour sister is a hypocrite and a liar, so good riddance. Hopefully the rest of the family will get their heads on straight and apologizes to you and Roxy."]}