{"id": 1811, "submission_id": "ypsuod", "title": "AITA for causing my friend to be kicked out of our accommodation while on vacation?", "selftext": "For my best friend Elena’s 22nd birthday she invited a group of us on a trip to France. Her parents paid for all of our flights and we stayed in the home they own there. Her brother and a few of his friends also came on the trip.\n\nBefore the trip, Elena gave everybody one rule which was to not sleep with her brother.\n\n2 days into the trip, I walked in on another friend, Chloe, and Elena’s brother in a compromising position. Chloe asked me not to tell Elena because she didn’t want to get kicked out and I wasn’t going to but Elena’s brother kept goading me until it felt like my blood was boiling.\n\nI was so angry that Elena noticed and asked me if her brother had said something to me because he has a history of purposefully upsetting me. I told her what happened, including what they were doing.\n\nElena was upset and asked Chloe to leave the next morning. Chloe is blaming me for causing her to be left homeless in a foreign country and for causing problems between her and Elena. Our friends are divided but Elena’s brother keeps calling me a good little snitch so AITA?", "created_utc": 1667928602, "permalink": "/r/AmItheAsshole/comments/ypsuod/aita_for_causing_my_friend_to_be_kicked_out_of/", "score": 27, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I told my friend I saw our other friend and her brother in a compromising position even though I knew it would upset my friend and would most likely result in her asking our other friend to leave as it broke the one rule she gave us before the trip.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "INFO: Why is the rule for people not to sleep with him, rather than him to not sleep with anyone? \n\nwithout further context, I'm loathe to agree that anyone is an AH for engaging in consensual relations with another adult. Especially since the rule apparently doesn't apply to the man who gets to sleep with whoever he wants with no repercussions, but the women who choose to sleep with him are in the wrong? \n\nHard to judge. Is just Elena an AH? Is it Elena and her brother both? You for playing along with this weird imposition on people's sexual autonomy? I dunno. Seems strange, though. The whole rule about it and only applying to the women and not the man definitely grosses me out, though.", "Lmao actually what the fuck \n\n\nIs everyone constantly scrambling to fuck her brother or something?\n\nESH. And let Elena know she's weird as fuck for policing who her brother sleeps with.", "NTA. I feel like this is really 100% on the brother. He seems like a spiteful little shit.", "Esh. Literally everyone, you, the brother, Chloe, and Elena. No one should kick a guest that is depending on them out in a foreign country unless it’s a mater of safety, Chloe shouldn’t have slept with the brother, Elena shouldn’t be putting limits on her friends that she knows he brother will actively try to make them break, the brother is just an all around prolific asshole, and you’re a shitty friend to Chloe. She’s getting punished because the brother was bugging you, and brother is just going to try and sleep with another friend now.", "NTA - There was one rule, she broke the rule, unsure how that is your problem?\n\nHeck you were even willing to keep it secret until the brother was a knob.\n\nI think they both need to learn about personal accountability.", "ESH Chloe least of all she should be allowed to sleep with another concenting adult. But honestly,  you are so short temped and petty you could be goaded into fucking over your friend? Elena and her brother sound unpleasant to the extreme and happily fucking over other people in their stupid rivalry.", "NTA there was a clear rule in place and you did the right thing by telling your friend, especially if you we're being disrespected by the brother", "Like, that girl had a PAID trip to France and free accomodations and she couldn't keep her hoo-ha shut from ONE dude? I just don't understand the world anymore. \n\nI'd say NTA, that girl should have prepared for the possibility of being homeless if she's so bent on breaking the rules. It's not your responsibility that she has the libido of rabbit.", "NTA! You were keeping yourself out of it until the brother kept goating you, which he seems to have a history of. If he was worried he would have left you alone. And yes, no friend should go against their friend's wishes like Chloe did. \n\nPlus as a brother that is pretty shitty too, I always had the rule of not dating or dipping my toes in my sibling's friend group. So easy to create issues.", "ESH \n\n* because you were angry at the brother you did something that hurt your friend, not him. \n* the brother for going out of his way to upset you\n* Chloe for messing with the brother against her friends wishes and doing it so obviously that they got caught\n* Elena for making a stupid rule for her friends (and, I suspect, getting mad at her friend instead of her brother).", "NTA, Elena could have been smarter in this situation, and you have nothing to do with the main issue at hand. I believe it is OK that she restricted anyone from sleeping with her brother, but I do not agree with her decision to evict someone from a settlement in a  foreign nation. She might have simply told her that it was wrong, but it would only be reasonable if Elena's brother was old enough to be having relationships with people, he should be allowed to make his own decisions without interference from others. Elena could have done things differently, but you just did what was right and expected of you.", "NTA....no friend goes against her friends wishes like Chloe did.\nHe kept on irritating you and its not your secret too keep so goodbye Chloe", "ESH. I cannot imagine caring who my brother hooks up with, as long as they’re legal and consenting. That’s weird. Does her brother have a thing for you? Have you turned him down in the past? Or do you have a thing for him? I am just reading between the lines here, but why is always goading you specifically? Why does he have that power over you? I do think it’s lame that you ratted out Chloe because you were mad at Elena’s brother. Chloe shouldn’t have hooked up with him, though, if she doesn’t have feelings for him, bc her friend asked her not to. Now if she had a relationship with him, that’s different. But you can do without a one night stand if it would upset your friend.", "NTA. Elena had a rule. Chloe broke it. While it's unfortunate you walked in on them, Chloe knew the consequences of breaking the rule. You had two choices, stay quiet or not. You're less of an arsehole for 'snitching'.", "NTA/ESH. What a stupid rule, but it is a rule so I guess NTA but you all are adults, its weird his sister is controlling who sleeps with who.", "Mmhhh... ESH. But I think who Elena's brother wants to sleep with is you?", "INFO: How old is Elena’s brother?", "NTA  \n  \nThe lightbulb is never to blame for the roaches you see in the pantry.", "What is this guy's dick made of?? Lol this woman had a fully paid trip with the ONLY rule being to not to sleep with her friend's brother.  She couldn't find anyone else?  Is he the owner of the sole penis in a 50 mile radius??  It's generally pretty icky to dictate the sex lives of 2 consenting adults but this just seems almost spiteful for the brother and friend to do at this point. NTA.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nFor my best friend Elena’s 22nd birthday she invited a group of us on a trip to France. Her parents paid for all of our flights and we stayed in the home they own there. Her brother and a few of his friends also came on the trip.\n\nBefore the trip, Elena gave everybody one rule which was to not sleep with her brother.\n\n2 days into the trip, I walked in on another friend, Chloe, and Elena’s brother in a compromising position. Chloe asked me not to tell Elena because she didn’t want to get kicked out and I wasn’t going to but Elena’s brother kept goading me until it felt like my blood was boiling.\n\nI was so angry that Elena noticed and asked me if her brother had said something to me because he has a history of purposefully upsetting me. I told her what happened, including what they were doing.\n\nElena was upset and asked Chloe to leave the next morning. Chloe is blaming me for causing her to be left homeless in a foreign country and for causing problems between her and Elena. Our friends are divided but Elena’s brother keeps calling me a good little snitch so AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "[removed]", "INFO: Is Elena's brother Chris Evans or Idris Elba or someone else generally considered irresistible? I am confused why there would need to be a RULE...", "Info when you walked in on them who or what room were they in?", "Maybe it was a bet between the brother and the sister?  \"I can get one of your friends to sleep with me\"  \"No you can't\"", "ESH.  Other posters have pretty much explained why", "INFO Why Is there a rule not to sleep with her brother? This is so weird. Why does Elena care who her adult brother sleeps with?", "That rule exists too, but he doesn't always listen", "I agree with ESH. \n\nBut I do think that maybe the brother is the one scramling to F her friends and in her head she was trying to avoid drama. But then again, she should have made it a girl’s trip if that was the case.", "NOW I need to meet her brother.  He must be hot.", "So then Chloe’s the one who got punished for it because…?", "Exactly\n\nSounds like the brother wanted Chloe gone so he could sleep with another friend, nas used OP for that", "It's not. She could have stayed out of it though? Depends on the amount of goading I guess", "Sure, judge someone for having a consensual sexual encounter - just the female. Why was such rule put? And shouldn't it be on both the brother and chloe?", "The brother clearly wasn’t worried, he’s facing no consequences and got to be a shit disturber. It’s exactly what he wanted to happen.", "He's always goaded me since we were children. I don't know why he does it but this has always been how things are between us.", "> Chloe knew the consequences of breaking the rule.\n\n*Did* she?  Because I’m not sure why everyone’s taking sides if Elena actually warned people it would result in being sent home instead of…I don’t know, a stern talking-to, or not being invited back, or pretty much anything less immediate/drastic.", "Her brother is 24", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Given the fact that the brother was goading OP, I wonder if he's the type that intentionally \"romances\" sister's friends then ends things in a truly atrocious way so that it costs his sister friendships. That's pure speculation, though. If that were the case then it'd probably be explained why that's a rule. Who knows.", "They were in the kitchen", "Does he make a habit of sleeping with Elena's friends? Has it cost her friendships?", "Indeed, and why should he?", "Yeah I'm not sure if it's the brother who's the issue or the friends? But either way taking all of them on a trip to France and then kicking a friend out in a foreign because she slept with your brother? Like I get it was a boundary and I completely understand that, but this situation is overall weird and somewhat creepy.\n\nIt's incredibly weird that the sister made a rule to not fuck her brother, her friend is kind of an AH for sleeping with the brother despite knowing that it was a boundary (but realistically it's none of anyone's business except her and the brother), the brother is an AH for harassing OP, OP is an AH for getting a friend kicked out, purely out of spite, because clearly OP didn't actually take any issue with them sleeping together. That seems like something that she should have taken up with the brother and not thrown her friend under the bus for it. \n\nI'm also curious to know where they fucking in a somewhat public place or did she just walk into somebody's room without knocking?\n\nOverall the entire situation is a shitshow", "Yeah I've never had a friend with a brother who felt the need to ask her friends not to sleep with him like this. He's gotta be a solid 11/10 in all aspects.", "Well it was mum and dad paying for it so they probably wouldn't have agreed to kicking the brother out.", "She shouldn't have. The brother should have gotten thrown out but since it was his family home, Elena probably couldn't  I don't think OP is to blame for this, though. This is OP's brother's fault and Chloe unfortunately became collateral damage.", "Right, because it’s unclear how Elena could have kicked out Chloe if brother (also a kid of the homeowners) said Chloe could stay. I guess he didn’t?", "She didn't choose to enter it, she stumbled across them. She then agreed to do them a favour and the brother decided it was somehow a good idea to use that favour against her. They're completely to blame.", "The unfairness of the rule wasn't the question here though. I can't tell why such a rule was put in place but the rule was directed towards the guests and as such they should respect it or simply not come on the trip. \n\nEven though I have no such Draconian rules in my house, but my house does equal my rules. It's not suggestions, it's rules I'd like my guests to abide by to respect my living environment and property. If it's too much for some people, then they are no longer welcome. \nIt doesn't even have to be anything ridiculous, but even something as basic as taking off your shoes before coming in.", "And it will probably happen again. First and foremost OP probably should have left her brother at home.", "He does it because you let him get under your skin and that amuses him. If you would just move on and not give him the reaction he wants, it would end. Why punish your friend Chloe?", "She wasn’t even sent home. She was immediately kicked out on the street in a foreign country. Unless the person is dangerous, that’s pretty much never acceptable.", "ESH.\n\nElena- For having a weird rule about adult women and her adult brother choosing to do whatever. While I can understand not wanting the fall out if the 'relationship' turns ugly, it's not her business who her friends or her brother decides to date or hook up with.\n\nChloe-When you're dependent on someone else, it makes sense to respect them.\n\nBrother- All around shit starter.\n\nYou- Your sole reason for telling Elena was because 'the brother' kept 'goading' you. You mean to tell me that man doing or saying anything has that much power over you? No matter what he did, if Chloe was a friend to you, you very much shared her personal business when it had nothing to do with you. Girlfriend is literally stranded in a foreign country. You should feel bad about that.\n\nAll of you are immature AHs.", "YTA, then.  Don’t get me wrong, Elena is, too, for trying to control two grown adults’ sex lives in the first place and only putting the blame when that didn’t work on the one she thinks she should be able to control, even though the mere fact she apparently didn’t think telling her brother to stay away from her friends would work should’ve demonstrated the futility of the exercise.  But this was none of your business *at all*, no matter how badly you think you were goaded.  Again, if the brother’s that much of a jerk, why did Elena subject you all to him, much less expect you to keep him under control?", "The ESH elena for that BS rule everyone is an adult who could have easily told ger brother not to sleep with any of her friends, how come he ain't kicked out?  Chloe for not having better sense than to fool around in a common area. The brother because he was just goading you and being unconcerned of how this could effect chloe. And you letting him goad you, should have just kept your mouth shut sounds like they would have been found out eventually", "Yup."]}