{"id": 18153, "submission_id": "13rl7ox", "title": "AITA for screaming at my neighbours toddler?", "selftext": "i, (32M) have recently moved into a new neighbourhood with my wife (30F) and our two kids (3M and 5F). The house was a great buy, and the neighbours have been, in general, very friendly. Since we moved in, however, my neighbours son (4M) has been bullying my kids.\n\nWhen we first moved into the neighbourhood, my son started hanging out with him, since they were around the same age. Even since they first met, i had a bad feeling about this kid. I heard some bad things from other parents about him being rude or downright mean to their children. Some of the children he had supposedly bullied were as old as 10. Reminder, this kid is 4. \n\nThe bullying against my children really started after my son was eating some cookies my wife had given him and didn’t share any with the kid. He threw a little fit, and demanded his parents also give him cookies. After that, he made an enemy of my son.\n\nHe would steal my daughters dolls. He would tear up our flowers. It came to a point where we had to install a lock on my gate to keep him out of our things.\n\nThe day this incident happened, the kid had climbed over our fence to get into our yard and wreak havoc. My daughter was playing in the yard, so I went out there to tell him to get lost. When I came outside, he started cussing me out. you wouldn’t believe the language this kid was using. I lost my temper at this kid, and started to shout at him. looking back, it was pretty rude. I really shouldn’t have, but it was a spur of the moment thing. He began to cry, but he went home.\n\nSince then, the other parents in the neighbourhood have been telling me i need to apologize. His parents won’t even talk to me, theyre so mad. So, am I the asshole.", "created_utc": 1685029593, "permalink": "/r/AmItheAsshole/comments/13rl7ox/aita_for_screaming_at_my_neighbours_toddler/", "score": 2378, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > i shouted at a little kid, and i might be the asshole because it was only a kid and he probably didn’t know what he was doing\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "There is so much info missing on this that is questionable. Where did this cookie incident happen? How did you witness this kid throwing a fit about not getting cookies and then complaining about it to their parents. A 4yo old holding a grudge and \"making an enemy\" out of another kid is just super sketchy. I worked in kindergarten, kids that age don't work like this. How did the kid get to your daughter's dolls? And most importantly of all: Where are his parents in all of this?", "LOL What? This kid is on the loose, climbing fences, stealing and destroying things? Call child services. His parents are clearly not giving two shits about his safety and wellbeing, let alone curbing his inappropriate behavior.\n\nNTA because I get it was an in-the-moment thing.", "NTA\n\nyour yard your rules, if that includes yelling at an undisciplined kid invading your space, you’re all good.\n\nI mean i suppose there is a limit, grabbing the little shit by the ankles and discus throwing him back over the fence would probably cross it, but would also be funny as hell, so….", "INFO: Before your meltdown, did you speak with the parents about their child's behavior?", "NTA the parents need to learn to control their little demon and teach it boundaries", "Sounds like he had it coming.  NTA.", "ESH \n\n\nYou are right to scream about controlling this behavior. But it was misdirected. This kid is FOUR. And his parents see nothing wrong with him just climbing the fence and destroying your garden?\n\n\nHave you addressed the behavior with the parents at all, and what have they said? Because your first course of action should not be screaming at the kid.", "Soft YTA. Your frustration is understandable, but yeah, at that age, you should have really been yelling at his parents since they are the ones who apparently let him wander off on his own at 4 (!!!!) to get into other people's yards. Seriously, what's going on in that house? Such behavior doesn't start out of nowhere. You might consider calling CPS on the parents.", "NTA. You're not the little monster's parent, but you sure as heck can yell at him if he's on your property. Tell his parents you'll be calling the cops or CPS every damn time he trespasses on your yard or bothers your kids. 4 year-olds need to be under their parents' watchful eyes all the time, not roaming around vandalizing.", "These situations are super awkward but you need to have a chat with the parents to lay down some boundaries but first things first:\n\napologize to the 4 year old. Because you are the adult here and again, the kid is 4. \n\nYTA", "Yep, don’t scream at other peoples’ kids. It’s not ok.\n\nThere are other ways to handle these situations.\n\nApologize for the screaming. Do it with grace. And then avoid them like the plague.\n\nYTA, sorry", "NTA since this was not a one time incident and you have tried talking to the parents. Still, the kid is 4. And you’re an adult. Offer an apology for losing your temper. But tell the parents their kid is banned from your house and yard.", "NTA his parents need to control their child", "YTA but i understand why you did it.  Scream at his parents, ultimately this is their doing.", "NTA - trespassing? Come on. This kid and his folks suck.", "YTA for yelling at a 4 year old. You're the adult so act like it and go apologize for yelling at this child.", "YTA \n\nHe is four! His parents are the problem yell at them. How would you feel if someone screamed at your daughter? Call CPS if you feel it’s needed you are an adult deal with it like an adult……..", "YTA. i don’t think it’s a huge deal, but a grown adult should never yell at a child that young, especially one who is not in their direct care.", "Even if a child is as ill-behaved as this little one seems to be, he is still a CHILD. If the parents refuse to help you, call the police and get them involved.  If the parents are not supervising his behavior and he is running around without parental oversight, there are other agencies that can help.  \n\nIt sounds like he is not being taught how to behave, but for yelling at a 4 year old...... YTA.", "Info: why did you feel it’s appropriate to yell at a small child who is a new human being and doesn’t understand how to properly regulate himself instead of at the adults who are failing to properly parent their child? \n\nThe kid acts this way for a reason, take it up with the full grown adults who are responsible for him. If the parents are truly that horrible of parents, should you not call CPS? A child acting out this way isn’t doing it for no reason, something is likely going on at home. \n\nYTA", "ESH. But I think neighbours letting their kid act awful is more TA than losing your temper after a lot of provocation", "ASH (Adults Suck Here) you suck for yelling at a 4 yo and his parents suck for letting his behavior continue.", "ESH. Instead of having a yelling match with a 4 year old, you could've just taken him home and had the choice words with his parents. But they also need to take accountability for their kid's behavior.", "ESH- yeah yelling wasn't the best way but so what if the parents wont talk to you, they let this little beastie run wild and bully other kids.  He is 4yo and running around with them not having a clue where he is and what he is doing.", "ESH. Your neighbors suck for not disciplining their child and letting him run loose in other people’s backyards. The behavior you’re describing imo warrants professional help as it’s very aggressive and inappropriate for a 4 year old. You suck for yelling at a 4 year old child who clearly doesn’t have an adult in his life teaching him right from wrong. Cussing you out was wrong but he is 4 and you’re an adult.", "Apologize to the parent and the child. And also set boundaries. He isn't to come climbing over fences when gates are locked, if he wants cookies ask an adult, things like that. Stealing toys is pretty typical but it bothers me that it took them a week to get your daughter's dolls back. ESH", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n      i, (32M) have recently moved into a new neighbourhood with my wife (30F) and our two kids (3M and 5F). The house was a great buy, and the neighbours have been, in general, very friendly. Since we moved in, however, my neighbours son (4M) has been bullying my kids. \n     When we first moved into the neighbourhood, my son started hanging out with him, since they were around the same age. Even since they first met, i had a bad feeling about this kid. I heard some bad things from other parents about him being rude or downright mean to their children. Some of the children he had supposedly bullied were as old as 10. Reminder, this kid is 4. \n     The bullying against my children really started after my son was eating some cookies my wife had given him and didn’t share any with the kid. He threw a little fit, and demanded his parents also give him cookies. After that, he made an enemy of my son.\n     He would steal my daughters dolls. He would tear up our flowers. It came to a point where we had to install a lock on my gate to keep him out of our things.\n     The day this incident happened, the kid had climbed over our fence to get into our yard and reek havoc. My daughter was playing in the yard, so I went out there to tell him to get lost. When I came outside, he started cussing me out. you wouldn’t believe the language this kid was using. I lost my temper at this kid, and started to shout at him. looking back, it was pretty rude. I really shouldn’t have, but it was a spur of the moment thing. He began to cry, but he went home.\n     Since then, the other parents in the neighbourhood have been telling me i need to apologize. His parents won’t even talk to me, theyre so mad. So, am I the asshole.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", ">A 4yo old holding a grudge and \"making an enemy\" out of another kid is just super sketchy. I worked in kindergarten, kids that age don't work like this.\n\nThey absolutely can. I have a relative that was like this at that age. Vindictive, mean, angry, and just honestly awful. It took years for his parents to get a diagnosis and the proper medications/behavioral corrections started.", "> A 4yo old holding a grudge and \"making an enemy\" out of another kid is just super sketchy. I worked in kindergarten, kids that age don't work like this.\n\nMy son is in preschool, and there are definitely kids bullying and being nasty at 4.", "the cookie incident happened on my driveway. i saw him complaining to his parents because we were doing some gardening, and his parents were also outside. as for the dolls, my daughter was playing with them outside, and he took them and ran off.", "I think you misunderstand the purpose of CPS, and you really shouldn't waste their time with something like this. A kid climbing a fence and making a mess is not a sign of abuse or neglect, in the legal sense. At worst, it's poor parenting, which is NOT in the purview of CPS. \n\nThere are SO many kids who are truly abused and neglected who need help, and calling CPS for something like this siphons resources away from those who desperately need it.", "This may have been an \"in the moment thing,\" but what was OP doing after all the other incidents?", "I think the reason why I lost my temper was because there were other factors going on that day, some personal stuff with work, and my temper was just generally very short.", "Looking back, I feel extremely guilty about how I acted. My wife is reaching out to the family tonight to see if they wanna talk about what happened, so we'll see how things go with that.", "The ability to be angry or mean is not the same as holding a grudge and \"making an enemy\" as OP describes it. It's quite abstract for a 4yo to translate envy over not getting cookies into hating another child. Emotional responses are very immediate at that age and the boy didn't attack OP's son, but ran to his parents. So unless OP's son beat the other boy for trying to steal cookies I don't see how this would happen and even then it's not exactly normal for a child that age to categorically terrorize said child, their sister and whole household.", "Again. Not the same as \"holding a grudge and making an enemy\". That kids is destroying property at 4. Let me break it down to an evolutionary level: Kids are wired to survive and their survival depends on adults at that age. Sneaking out and getting strange adults angry by fucking up their property and harassing their kids is not exactly beneficial for survival.", "So he just took the dolls, ran off and you...? What happened then? Again: Have you confronted his parents?", "I think the commenter is assuming that the four year old is able to do these things because they're unsupervised. It seems unlikely that the parents are watching the child climb the fence and destroy the landscaping. I'm not sure where you're located but in my area an unsupervised four year old roaming the neighborhood is an issue for cps.", "you’re right. my wife and i had a couple convos about the right course of action, but we ultimately decided to leave punishments up to the parents as it isn’t our kid. looking back, the parents are for sure not taking care of that kid properly so a cps call is coming", ">I don't see how this would happen and even then it's not exactly normal\n\nIt's almost like kids are all different and have different functional levels.", "> Kids are wired to survive and their survival depends on adults at that age. Sneaking out and getting strange adults angry by fucking up their property and harassing their kids is not exactly beneficial for survival.\n\nThere are so many ways that kids can violate the principles you outlined, though. Neurodivergent kids are a big factor. There are absolutely children who don't actually care if adults are mad at them, even if they have been taught otherwise.", "That .... I mean, that's why they're cute and we as adults usually have the instinct to go awww. Kids don't have any biological instincts to not piss off adults, to my knowledge, which is admittedly lacking. \n\nKids tend to act out around trusted adults, because they know (or feel they know) those are trusted people where they can explore their boundaries. I've never heard anything about kids instinctively avoiding annoying adults.", "there have been a few conversations, but remember this has all taken place over a short time span, so we haven’t been going as much into detail as we should. and i did speak to the parents after the doll incident, and they returned them after about a week.", "I don't think I was clear enough about this, but he doesn't just roam the neighbourhood. My wife and I are friends with his parents, so he comes over when they do. He doesn't just run around destroying things lol", "I suggest you be explicit with the parents. Because you yelled at their young child, you should apologize, but use the conversation as a chance to make your position clear - that he is not allowed to come onto your property and that you're expecting them to keep him away from you and your family because he is destructive, uses highly inappropriate language, and bullies others. I think this is a prudent step in between 'we decided to leave punishments up to them' and 'calling CPS'.\n\nYou can also instruct your children to come inside if he approaches while you're not present. Realizing I'm not living your life right now - and I don't envy you - I think as the authoritative adult in the situation you can enforce these boundaries without having to call authorities. I don't consider the kids' behavior a sign that he is being abused or neglected, and thus, as of now, this is not a matter for CPS.", "Punishment for what? Were they aware of all the stuff he was doing? Like, standing there watching him and you didn't say anything? Or not in sight at all? Were they there when he climbed the fence....or did you make a point of waiting until the parents weren't around before screaming at him?\n\n\nDo you think he went home and said \"by the way, I destroyed Girl's dolls today\"? \n\n\nYou say you wanted to \"leave punishment up to the parents,\" but never actually talked to the parents. Maybe they are completely ignoring him. Maybe they are acting in a way he's mirroring. Maybe he's in multiple forms of therapy and psychiatric evaluations and trials of medication and the parents are trying to figure it out.", "What do you mean by \"short time span\"? I don't get what that even has to do with anything or why you would need to get \"into detail\". The kid stole your daughters dolls. Give back the dolls and stop letting your kid run around the neighbourhood wreaking havoc. What details more do you need to talk about with his parents? Although I am interested in what they had to say to that.\n\nI'm also confused as to why no one in your neighbourhood apparently bats an eye at this kids running around unsupervised at 4yo destroying gardens? Again. None of this is normal for a 4yo. Especially not in an enviroment where kids usually are rarely unsupervised.", "Sounds like they watch their kid as well as you watch your temper. \n\nYTA, be the adult, don't stoop to the level of a 4 year old.", "If his parents were over why did he have to climb a fence? Wouldn't he be inside the fence with them?", "It may have been a little unclear in the original post, but it's not like this kid is just running around the neighbourhood unsupervised. He's our next door neighbour, and he sometimes comes over to play. My wife is friends with his parents, so he comes over when they come over. Things weren't a real big deal until recently, when most of the drama happened, so we didn't see a need to take real action other then just mentioning his behavior to his parents.", "these were separate incidents.", "Was he outside unsupervised when you yelled at him?", "yes, but his parents weren’t far", "So he was roaming the neighborhood unsupervised in this incident. In my area that would be a cps matter because he's only 4.", "Is a 4 year old a toddler? I'm not from the US or any other English-speaking country, so I'm asking out of curiosity. I always imagined one had to be about 2-3 years old to be called a toddler? 4 sounded to big in my head😅", "ESH\n\nWhere are his parents? Have you spoken to them about this behavior?", "Uh, most of the behaviors you describe are very normal for 4. \n\nESH\n\nYes, he's a tiny terror, but you're a grown man. Control yourself.", "YTA.  You admit your wife invites them over.  That is the problem.  He comes with his parents and then does this stuff.  Stop inviting them over.  If your wife wants to see them, do it at their house.  Don't yell at toddlers unless they are in immediate danger.  Example:  toddler running into street, then it is okay to yell as you run to stop them, \"stop right there!\"  If the kid is actively destroying your yard.  You are bigger and can pick him up and remove him from the situation or make the parents come do it.  Yelling is not going to help as it is obvious he learned to yell somewhere and that is probably at home and so it does not affect him.", "I understand the frustration because some kids are annoying and can be very mean when they want to be, but it’s not okay to be yelling at someone’s kid and making them cry. Hell, I feel bad if I tell my dogs off so idk how i’d feel if I YELLED at a 4 year old!! \n\nI think YTA for the way you handled it, although I get that it was in the moment and you had a hard day. \nYou wouldn’t have liked it if someone else was screaming at YOUR child. The parents are the bigger AH need to step in and teach the kid right from wrong, and that it’s not okay to bully or damage other peoples property. \n\nI’d apologise to the parents and the kid and set some boundaries as a way of preventing anything like this from happening again.", "YTA. Really? You yelled at a four year old? And cussed him out.", "YTA, but a soft one. I understand it was an accident, but you’re an adult and have more control over your emotions/actions than a 4 year old who is still learning how to human. I would definitely try to apologize to the kid and his parents. Not to mention trying to set up some boundaries since clearly they are not doing so.", "NTA, theres only so much you can let slide, those parents suck and are in for a wild ride of parenthood if they dont act on that behavior now.", "NTA if his parents aren't going to discipline him, they should expect something like this to happen", "NTA", "NTA. I think you should hire a lawyer to write a no trespassing letter to your neighbors, demanding they keep their child off of your property.  Had he been hurt climbing into your yard, they could have sued.  They’d probably lose, but it would still cost you attorney fees.  Be proactive and get the letter sent.\n\nYou did lose control with a little kid, but I honestly can’t blame you.  Just know going further, that kids like this enjoy getting a rise out of people and now he’s received all this attention for crying, he’s probably going to ramp it up.  Stay calm. Be cold.  Remain emotionally detached.  Tell him to go home and if he doesn’t, call the parents and tell them you’ll call the police if he keeps harassing your kids.  Follow through.  A kid like this could eventually cause physical harm to your children.  Protect them.\n\nI say this as someone who has had to evacuate an entire classroom of kids due to a 5-year old actively trying to hurt other children by throwing classroom equipment at them. (Computers, laptops, chairs—everything he could lift). Your neighbor’s kid is in trouble and needs help immediately, but that won’t happen until the parents become uncomfortable enough to start to make the change.  Sadly, it will take a couple of years of schooling before the documentation will start to build up.  You may have a rough couple of years ahead of you.", "NTA\n\nI usually don't condone adults yelling at 4 year olds, let alone someone else's 4 year old. But...this kid needed that. A 4 year old bully that has free reign of a neighborhood? Yeah, he needed to have something happen to start to realize that not everyone would just accept his bullying. Maybe his parents will also realize that if they don't discipline their child, something could happen to him because of his behavior.", "NTA. You're never too young to learn your place in the pecking order.", "NTA. Nope.\n\nFight fire with fire. It's a horrible shame, but some rotten kids only understand fear. \n\nScream at the tiny ahole till he's afraid to break into your yard again. I am 100% serious here.", "Im gonna say YTA only because I did something similar and was told I was, though to be fair in a way i kind of directly threatened a small kid\n\nThis neighbor kid kept teasing my daughter and making her cry, was relentless and wouldnt stop.\n\nEventually I got sick of it and went outside and told him \"if you upset my daughter again I will cut your stupid little rat-tail off\" (he had one of those idiotic star wars ass anakin rat tail looking things that were supposed to have died off like 30 years ago)\n\nAnyways, basically ruined whatever meaningless relationship we had with the neighbors (were friendly enough) but it was fine as we bought a house soon after and I havent seen them since. My wife told me I should have not said that and I think she is probably right, hindsight, should have pulled my daughter away and been the bigger person as im supposed to be the adult\n\nIn the end I never apologized because I knew they wouldnt be a part of my life going forward and I simply didnt care. Ill occasionally think about it and feel slight guilt but my  and my family usually laugh about it in hindsight now.\n\nbut I feel for you, you see red when someone is hurting your kid, shit happens\n\nanyways, long story short - YTA but dont feel bad, we've all been there", "NTA\n\nThe kid crying tells you that no one has corrected this kid's behavior before.  You were likely one of the first people to get angry at his behavior.  It's not his fault of course, this lies solely on his parents.  \n\nThat said, I'd apologize to the parents, but tell them why you yelled.  Tell them that their son is not nice to your children or your property.  Take the high road now.  But be firm with them that any further property destruction will be met with a bill first, police second, lawsuits last.", "One word:  Cameras.   Catch this kid destroying your property, call the police, make a complaint and press charges against this kid’s parents.  You need to quickly and efficiently end this kid’s reign of terror.    \n\n\nNTA", "YTA dont yell at toddlers it doesnt even help anything. Talk to the kids parents and tell them to keep the kid away from your house. You should be dealing with the parents not the 4 year old.", "Probably an unpopular opinion but NTA. This child more than likely isn’t getting disciplined or getting enough attention from his own parents. Someone has to teach him boundaries and that just so happened to be you that day. Hopefully he learned his lesson.", "Leave it be. Why do you even want to be friends with people who are raising a child in this manner? Better you keep your distance away from them and keep that child away from your kids. NTA.", "This kid is 4. He is not a toddler", "NTA. Start recording his destruction and bad language and show it to his parents.", "Perhaps your work with kinders is not recent.  I can definitively tell you that I’m seeing behaviors that will light your hair on fire—bad enough to have to evacuate an entire classroom to keep the other children safe.  I totally believe this narrative.", "No they're not", "A four year old child? ‘Had it coming’ to be screamed at by a grown man? What in the fuck?! Does he sound like a wee shitebag? Yes. Does that mean that what the adult in the situation should do is scream at them? No. Because he’s a fucking adult. Not a four year old.", "The hugs didn't work and the strangling seemed excessive, so we met in the middle and screamed. Sometimes you have to compromise.", "Depends on what my kid did to make the adult scream at them.", "He is definitely the AH, but by no means have we ‘all been there’. And he should feel bad. He said he had a bad day at work and took it out on the child because he had a short temper. He needs to look into some better emotional management techniques.", "That is pathetic. Taking out work frustrations on a four year old…", "So you took your frustration out on a preschooler? YTA.", "And that doesn’t make you less the AH. Screaming at a child, especially a 4 year old that isn’t even yours because you’re in a bad mood isn’t okay. You are the adult, after all. I think you know that. \n\nIt happens, we all fuck up sometimes, especially in the moment. The important part is to recognize it and react accordingly. I think you should tell the child that while what he did was not okay, you shouldn’t have yelled and then address the issue with the parents. Recognizing what you did wrong is a great way to model this behaviour for both this child and yours.", "You have every right to be upset about what’s been going on, but you take it up with the parents, not scream at a 4 year old. They need to be made aware of what’s happening and take action to stop it. That’s their responsibility", "Punishment for the boy is one thing, but why did you continue to allow him access to your children?", "Not true, really. My 4 year old held a grudge for two weeks bc she and her friend accidentally wore the same dress to school on the same day. She was furious, and in true 4 year old fashion, completely unreasonable. She wouldn’t say hi to her friend or make eye contact at drop off for two whole weeks. It may have gone on longer, but I bribed the shit out of her because I was so embarrassed. Bad parenting 101, I know.", "and yet there are developmental and neurological realities to children at that age and the ages surrounding it", "Yes you are TAH.", "Why are 4 and 5 year olds \"hanging out\"? This is way too young. Are they supervised?", "Esh. All the adults are not on the same page and no one is actually doing anything to help this kid learn his actions aren’t ok.", "This is so outlandish. What 4 year old does this kind of stuff?", "YTA. Reminder, this kid is 4.", "Look this is an unpopular opinion on Reddit but congrats you’re a 32 year old man who reacted like a 4 year old and you said so yourself. I also missed the part where you told his parents about his behaviour and talk out possible solutions with them", "Unless it’s because of danger, no screaming at children. Screaming at a 4 year old? YTA.", "YTA. There’s really no reason to yell at a kid. Especially at a kid that’s not yours. You should’ve talked to his parents when the bullying started and definitely again after the last incident but you’re for sure ta for yelling at a kid that’s not even yours", "A four year old climbed over your fence?", "Does the kid avoid your kids now? If yes, good job, that was the goal. If he climbs again in to your garden, call the cops. NTA. Protect your children!", "YTA. Next time someone uninvited is on your property the best course of action would be to call the police.", "YTA.\n\nThe kids probably a rude destructive little shit and his parents seem to ignore it coz they can't be bothered to deal with it. (Unless he has been diagnosed or something and they just keep it quiet)\n\nBut he is 4, as awful as he is, he must have been terrified when you yelled at him.\n\nIts hard to get a person, especially a friend, to see what a little shit their kid is. Or they know but don't have the knowledge/resources to do anything about it.", "I would say YTA this is a toddler if they’re acting this way, they have to have an emotional problem, or problems at home happening. Yelling at them is only going to reinforce their behavior because you’re giving them attention. Even if it’s negative attention you’re giving them exactly what they want. If this kid is really having this many emotional problems, reach out to the parents, this kid is clearly not stimulated enough or he may just have some sort of mental issue that you’re not aware of. Regardless, there’s no reason to be yelling at the kids to the point where he cries instead of just trying to speak to him and understand why he is acting this way.\nEdit: typo", "YTA The kid could very well be a jerk but it is not your place to \"fix\" him.  Apologize to the parents for raising your voice to the child and ask them to keep him off your property.", "YTA\n \nBe an adult and scream at his parents and keep your kids away. \n\nDon't cuss out a 4 year old wtf", "YTA, confront the parents not the child.", "Yta he is a child and hasn't learned to control his own actions behaviors and moods. You on the other hand are an adult that should have learned to control yourself. \n\nNext time take a breath, count to five and take him by the hand back to his parent and scream at his parent instead.", "ESH there is no way on planet earth you can win by screaming at a small child when you're and adult.  That having been said if the parents can't control this kid, start sending them a bill for the damage and call CPS on them.", "That kid sounds like an annoying lil prick. Well Deserved yelling or worse", "Soft YTA, cus he’s four and you’re an adult.\n\nAs far as this kid being a bully at 4 years old, I 100% believe it. My half brother, who was eventually diagnosed as on the spectrum, was like this. My grandmother once confided in me she worried what he might do if my stepfather ever wanted a pet. She didn’t elaborate but even at like 3/4 yes old he gave off school shooter vibes and I knew what she meant. \n\nIt’s really hard to describe if you’ve not experienced it. He once snuck out of his room at night, walked into my room, gently whispered my name, and then cold coked me in the face, laughed, and slipped back into his own bed and went back to bed. WTAF?! It did seem like he planned that, executed that plan, and then made his escape. \n\n\nLuckily they got him a lot of help and as far as I know he’s pretty ok as an adult now.", "Get security cameras. Have some legal recourse if this is legit. \n\nBut i havr met some truly horrible and nasty 4 year olds.", "That child is not okay. He needs help. This is not normal behavior by a 4 year old.\n\nAnd yes, YTA. Not your child, you don't tell at them. You take your kids inside. Lock the door. Walk over to your neighbors and tell them to get their kid. You do not yell at someone else's kid. You instantly appear as the villain.", "YTA.\n\nHe's **four.**\n\nYou're allowed to be annoyed and frustrated, but as the adult, you also have a responsibility to get your shit together and handle things appropriately.\n\nAlso, any child acting this way is a MAJOR RED FLAG indicating that something wrong is going on at home.  I would call CPS to have them do a welfare check.", "NTA. Kids can be assholes too and so can their parents. Maybe he’ll stay out of your yard now, he’s clearly not welcome there.", "NTA, call animal control next time", "Nta. Maybe a cps call is in order", "NTA, that kid needed to be yelled at in that exact manner in the exact moment he was throwing that tantrum. He may dislike it as much as the parents, but ultimately you did that kid a favor. He'll think twice in the future.", "NTA.  It's called Authoritative Oppositional Behavior Disorder, or something very similar.  I had a stepson just like that..... it's one of those things on the Spectrum.  He needs a diagnosis and behavior therapy.  Good Luck.", "NTA - the kid was trespassing on your property.  It also appears that the child’s parents are not properly supervising their child if it can wander into other peoples properties. You did nothing wrong but I have serious questions about the kid’s parenting skills.", "Ferrel kids need ferrel treatment", "NTA. Your job is to stand up for your children. If the parents don’t supervise and teach correct behaviour then the community does. That’s what happens. It won’t be the last time either.", "NTA You need security cameras yesterday. Call the cops.", "Trespassing and verbally abusing your kid.? NTA", "This whole thing is super sketchy and I'm not sure how a 4 year old bullies other children. I don't think they have the development capacity for this - it's immediate emotional responses, not calculated planning. I say this as someone with a 4 year old. I can't judge this as either a lot of information is missing or there is some very unreliable narration happening.", "NTA\n\nThat kid needs boundaries or needs an psychic evaluation. The parents have to step up to the plate and act accordingly. Now, if you want to have a good relationship with the neighbors, you could apologize for the yelling and explain that the behavior of their kid made you upset but that you could have handled it better. \n\nThe question I have is, what if the kid does the same thing again. How/what will you do then? I would probably tell him to go home and that I will talk to his mum and dad about his behavior. But if the parents don't care, the kid will not be impressed. Difficult situation...", "Lol nta. \nSome kids need to learn the hard way that words can hurt. Lesson learned.", "NTA Get cameras for your home and yard", "NTA - sorry but there are real world consequences to trespassing and I feel comfortable wagering his parents weren’t going to dish out the consequence.\n\nHow’s this kid going to learn? If he’s going to be rude, rude behaviours coming your way. I get he’s 4 but he’s 4 and unattended long enough that he’s climbing fences into peoples yards? No thank you. The other neighbours who think you should apologize can have him dig up their flowers and steal their things. And let it go on and on and on until they snap. Who cares if his parents won’t talk to you? They sound annoying as well.", "NTA. Where do you think he got his mouth from?? I’m sorry, I’m not interested in apologizing to a baby jerk lol. But his parents and I should DEFINITELY have a talk. Him bullying my kids paired with the fact that I had to install a damn lock bc they couldn’t control their own kid is enough for me to tell everyone who wants an apology to suck it", "NTA.\n\nHe deserved it.", "NTA  You were protecting your child as a good parent should. If the parents aren't talking to you hopefully they'll keep their demon child away from your angels. I'd put up cameras if you haven't already because I'd expect some retaliation.", "NTA\n\nYou did your job by standing up for your kids & preventing this toxic child from continuing to bully them. Your duty is to protect your kids which sometimes will include protecting them from other kids.", "NTA - there’s a lot of missing info, but any kid not just bullying my kids but CLIMBING over my fence to do so can fuck right off. I’d go off on the kid and the parents. \n\nYou having to install a lock to keep him out says everything. Those who disagree and are getting upset haven’t lived near a mean child who have absent parents. It’s a nightmare.", "NTA\n\nNext time he sneaks onto your property, call the police about an unsupervised child. \n\n1. It'll scare him enough to piss his pants.\n\n2. It'll make his parents more proactive about watching their little demon.", "[removed]", "Sometimes it's ok be be TA if the pros outweigh the cons", "NTA\n\nHe for damn sure has a clearer picture of what he was doing now.\n\nI do think you should apologize to the parents for straight cooking their son. However, this apology should come with \"he is not free to trespass in my yard or otherwise damage the property. He's only 4 and so while I recognize that my response was extreme, his behavior needs to be addressed. He's depending on _you_ to keep him out of trouble\".\n\nHell, setting aside him being a little shit, he's lucky he only found an angry parent. A territorial dog in that yard could've taught that kid a far more permanent lesson - they can't be letting little dude break in to places like that.", "NTA…little monster will get over the trauma of a raised voice. His parents need to apologize for his behaviour.", "NTA - Little shit probably learned a lesson honestly, it's pretty apparent no one else is policing his behavior. \n\nShit I remember when I was a kid, had a friend over, he had taken to spitting. Just thought it made him look cool. So he spit in my dogs water dish in front of my dad. God damn he got a dressing down, how it was cruel, disrespectful, how dare he come into someone elses house and do that, the works.\n\nNever spat again lmao. I think we were like 8 or 9? Shit works.", "Put up cameras, document, get police involved. If the damage keeps going, sue them. NTA", "NTA\n\nThey expect you to apologize?\n\n\"I'm sorry your child is going to be a juvenile delinquent. Hope you put aside the money you didn't spend on parenting classes for a good lawyer.\"", "NTA the child was testing your last nerve. Sounds like an unholy terror. Why aren't his own parents doing the yelling and training?", "INFO \n\n\nThis is a 4 year old? Where were his parents when he climbed over the fence?", "Kids are dicks. \n\nGood luck living next to these people!", "That kid need an ass whooping. You can’t do that so you yelled at him for doing something wrong. NTA", "I've worked with children and they absolutely can behave like this. I was a high crisis staff at a residential behavioral school trust me there are definitely young children who behave like this unfortunately", "What kind of Fantasyland do you live in? All fucking kids that age do is hold grudges. They don't think of them as a grudge but when you're that age one bad experience can be formative and if the parents reinforced it which seems like they probably did if this is told accurately, then it's absolutely of zero surprise that he's now decided that he hates this girl. He certainly not sitting there thinking this is because of the cookies but he absolutely has internalized dislike of her that he probably can't even explain or tie to an event but that comes from this interaction.", "I definitely understand why OP reacted the way they did, and I also understand kids can be little demons sometimes. \n\nBut also, I honestly believe kids are good by default. With a *four* year old cussing and holding grudges, and bullying 10 year olds... Bullied people bully people, ya know? This kid is learning this behavior from somewhere, and I'd be trying to figure out where. And figure out if you can be a good role model/influence on the kid. Maybe seek him out and apologize for reacting the way you did, but explain why you did so and how four year old's own actions are making his life much more difficult... Might even warrant a wellness check/CPS check in?", "Those were some of my first thoughts. I worked in preschool for years. These are not normal behaviours from a child this age. This whole situation is oozing a lack of active supervision. All these incidents are preventable.", "Honestly, it depends on the child and what they’ve been through. Kids aren’t generally this mean but if he has some sort of undiagnosed mental health issue it’s not out of the question.", "Oh you are just not seeing. I vividly remember multiple children from nursery school onwards who were way worse than this kid. Child bullies are way way more common than adult ones. But I totally agree, the major question is to the kid's parents, and it's WTF?!", "I’m laughing so hard at “discus” 😭🤣🤣🤣🤣", "this is where I went, yelling at a 4 year old is never going to be a winning situation, but the parents who turned the little terror loose on the neighbors do need to be talked to, possible by CPS", "So you think yelling at a kid is worse than putting your hands on them?!", "Hard disagree. \"He would steal my daughters dolls. He would tear up our flowers. It came to a point where we had to install a lock on my gate to keep him out of our things.\"\n\nA 4 year old should not have to be locked out to not be able to destroy things. And a 4 year old should not be left unattended to roam around other people's properties. Where the heck are this kid's parents??? He just climbed a fence to get into OP's yard - he could have been injured doing that alone. Much less, what if OP and family weren't home and he got hurt on their property all by themselves?", "\"Or worse\" for a 4 year old? Excuse me??", "If he's swearing the way OP describes at four years old I imagine he's already in an environment where he's getting that 'lesson' more than enough. Kids that age absorb and repeat everything they hear around them, especially from the people they see the most, like their parents.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). If we’ve removed a few of your recent comments, your participation will be reviewed and may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Maybe jumping a fence isn't necessarily a sign of abuse, but cussing out an adult and bullying 10 year olds at the age of *four* certainly points to *something* not being right in my books.", "Allowing a four year old to wander through the neighborhood unsupervised is child neglect and possible endangerment. What if the next fence he climbs has an aggressive dog on the other side? Someone needs to intervene for his safety", "Not going to lie I worked at a preschool in college and the girls in it were so mean and cliquey already so it can definitely happen at that age. I say esh though because rather than scream at a 4 year old you should be setting boundaries with their parents and the parents need to do some actual parenting. This kid behaves this way because he knows there are no consequences. It also makes me wonder how his home life is for him to be so mean at his age.", "If they have parents who do this, they do it. Also who tf let's their 4yr old go into other people's yards. Yes I'd let my son play in the FENCED in yard alone at 4, if I didn't see him I'd go out immediately. Wtf", "All children are psychopaths.\n\nIt is the default state.\n\nMost start to grow out of this within the first few years. You have to teach empathy it isn't innate to the human nature. (Though we tend towards picking it up rather simply)\n\nSome children though, particularly with shitty parents, are just evil even at a young age.", "I agree, I dated a guy who had separated from his wife before I met him. He had  2 and a 4 year old boys. The second they met me, they hated me. The oldest especially would mean mug me every time I looked at him. I bought them cool toys that I know they wanted, and he smashed them, I bought him an art kit because he liked to draw, and he pitched it into the pond. This went on for 2 months, and I broke off with him because I had no desire to be the evil stepmom in this relationship. I just couldn't get the kids to like me at all.", "Trespassing and verbally abusing your kid.? NTA", "This was my thought. Sounds like an at-risk child.", "I'm gonna say OP is definitely YTA... toddlers are in the process of learning self regulation. Yelling is a lack of self regulation... and you're an adult. Grow up. Apologize and be a better role model.", "Uhh, what?\n\nScreaming at a toddler is definitely worse than just picking them up and removing them from the situation, yes.", "You heard me. He’s old enough to cuss and be a lil shit he’s old enough to get some yelling in. Tired of people parading around little shits because they are “kids”. Wanna act all grown up? Be treated like one", "I agree. However, it's still not a CPS situation.", "CPS? Are you serious? There isn’t anything in your description that makes it seem like the kid is neglected or abused. His worst offense was saying bad words. I’m of the opinion you are taking what this kid does WAY too personally. Yeah, guess what, kids like to eat cookies, especially if other kids are eating cookies. Kids run off with toys. Kids climb on things and make huge messes. Kids pick flowers and play in gardens. It’s all normal. I suspect you are way over exaggerating things and have a personal vendetta against that kid for some reason. Dude, seriously. YTA. Also, I bet $100 if you call CPS on that kid, the parents will do the sane back at you. You are going to create a war, and it already sounds like the neighbors aren’t supporting you - and his parents have a stronger case against you because YOU are the one screaming at kids in public.", "It's innate.  Some people (most men and some women) just aren't capable of it.  Very telling that you think that, though.", "Reading between the lines, I assume that the parents are a) not routinely keeping an eye on what their kid is up to (hence him being to climb a fence into the next garden), and b) not particularly easy to deal with (hence, per OP's comment, them taking a week to return the stolen toys).\n\nThe fact that other neighbours have also commented on this kid being mean to their kids suggests it isn't just OP who has encountered trouble with this kid.\n\nShould he have yelled? No. But I don't see the need to nitpick every detail of the account.", "It's absolutely possible. Maybe they don't remember/link that the cookie incident set it off, but kids can absolutely decide \"I don't like this person, I'm going to be mean to them\".", "My sister hated everyone and everything when she was young. She'd glare and fold her arms, there's many a picture of her doing it, mostly at me and I was a year and half older. My eldest brother has a now faint scar from her bite, I had a chunk of hair ripped out because she wanted my lolly.\n\nOne uncle called her Damien, as in the omen until she was about 7. Children most definitely can hold a grudge", "Nah my friend's kid got bullied at daycare by a girl and her minions. The 4 year old that bullied her will single a kid out and manipulate her \"friends\" to bully the victim kid. Tell other kids not to be their friend, say rude things, and only sometimes actually bully them directly so she hasn't really gotten in trouble. She notices when adults are watching and will immediately stop or leave when eyes are on her. Idk how they learn it so early, it's crazy to me", "My kid met another kid in kindergarten. Kid was really mean to my son. Just finished 2nd grade, hasn't dealt with that kid sincer kinder and he still hates him. \n\nSo I think kids can make enemies and hold grudges at that age.", "Yes, but at the same time, compounding incidents and your own children being hurt definitely makes self regulation difficult, even for the best of humanity.", "I feel like they meant “put your hands on them” as in spanking or something, but I still don’t know how their comment managed to miss the point so hard, anyway. \n\nIn that case, obviously hitting a child at all is *not okay.* But if it’s quickly grabbing a child to make sure they don’t hurt themselves or others, that’s fine. That’s not “putting your hands on them.”", "If you’re friends with the parents, why haven’t you discussed his behavior with them? Or told them he has to apologize! Or not allowed him over without their supervision?", "I would venture four year olds don't act out that much without some actual trauma. (Edit: Or mental health issue.)", "Absolutely, I witnessed domestic violence as a child and learnt to swear by the age of 4/5 only because of hearing it from them, a whole other can of worm for what punishment i would get for swearing to them even though i got it from them. But yeh trauma.", "There are developmental and neurological averages, not absolutes.", ">developmental and neurological realities\n\nThose realities are well understood in children who are not functionally abandoned and/or abused and are neurotypical.", "ESH\n\nYou are right to scream about controlling this behavior.", "Also “short time span” but returned the dolls a week later. So it’s been over the course of at least a week", "Don’t know why you are being downvoted. OP is carrying a grudge against a four year old as they work out the expectations of playing with a next door neighbor. \n\nSiblings run off with each other’s toys. Good friends do it to each other. Ya get the toy back, reiterate expectations. Move on. \n\n\nIn a neighborhood, classroom or sports team (any grouping of kids really) the adult in charge needs to shift from looking out for my kid only and start thinking about the group dynamics. Expectations for play need to be established and taught. \n\nOp, you think this little kid is an AH for wanting you son’s cookie. Can you concede it’s poor manners to not share? So your kid could look like an AH too? \n\nAnd the kid got upset. You’re mad he doesn’t have the tools to process emotions like an adult can even though his parents were in fact there and handling it(\n\nLater the kid is having some kind of emotional behavioral breakdown in your yard. Instead of feeling any concern you take a four year old’s outburst personally and scream back? What about your own adult emotional regulatory ability? You’re here looking for us to absolve you because you can’t put yourself in a kid’s shoes. \n\nYou should have made sure he wasnt a danger to himself or others and called his parents. Instead you had an outburst back? Why don’t you think you should apologize for screaming at a child a 1/3 your size)", "It is more likely this adult that barely knows the kid is misrepresenting things than this kid being not neurotypical though.", "So your wife is friends with the parents? Completely okay with just inviting them over and hanging out? Without either party addressing this?", "I was with you until \n\n>Can you concede it’s poor manners to not share?\n\nIt's rude to demand other people give you what you want because you want it.\n\nKids need to be taught to share, yes, but they also need to be taught not to make demands.\n\nFood in particular, especially a singular cookie that's already being eaten, should not be expected to be shared because of germs and allergies anyway.\n\nI agree with the rest though.", "Then you have a problem with the parents and not the kids. Why did you scream at a child when you need to be talking to the parents about how they let him destroy your garden?", "NTA for wanting to protect your kids but YTA for yelling at this kid. Go yell at his parents if you want someone to yell at. They are the ones not keeping an eye on him.", "A 4 year old did all this?  Really?", "Damn dude. Just give the kid some f'ing cookies already and apologize. \n\nGet down on the kids' level, literally. Speak calmly and tell him what you expect, and give him more cookies. \n\nYou made the situation so much worse than it needed to be. And you're re lucky the Dad didn't beat on you. \n\nYTA", "YTA Do not pass go, do not collect $200 Monopoly money. You are unequivocally with out a doubt TA. \n\nThat’s a child with dysregulated emotions and a lack of discipline and boundaries. You are an adult. You terrified a child. Short of protecting someone from physical harm or death there’s no way you’re in the right.\n\nAll you did was show them that what they’re doing is fine when they are big enough.  You added to the long long list of problems for that child.", "I'm sorry, but you're asking if you're the AH for yelling at someone else's *four* year old? \n\nOf course YTA! That is a *literal* toddler! If you have an issue with a child's behavior, you TALK TO THE PARENTS! You DO NOT scream at a literal toddler! \n\nA four year old child is psychologically not even cognisant of their actions. Hell they haven't even developed a sense of morality or right, and wrong. Any behavioral issues at that age are 100% the product of their parenting. So if you have an issue with this kid's behavior, then what you really have is an issue with your \"friends\" parenting. \n\nLike I genuinely cannot believe that this is even a debate!", "Yta. Just because this post is so bizarre. You have a 4 yr old bully, running around the neighborhood, creating havoc, terrorizing kids (and adults), destroying property, cussing ppl out & his parents are no where around & no one has thought to call the police or cps?!? Come on. Then you go on abt how your son was hanging out w him (they are 4 & 3- they are not hanging out, you put them together to play), then you say you got a bad feeling abt a toddler?!? And you still put him w your son to play? Really?!? Then the entire neighborhood goes on & on, talking abt a 4 yr old & how horrible & mean he is?!? Yta, for real", "YTA- he’s 4 yes old, his brain is literally not developed, specially the part that controls the emotions and how to deal with them.\n\nYou are the adult and that part should be developed.", "NTA\nPeople need to control their animals.", "NTA\n\nAt all.", "Kids are the devil. They have to be taught to be nice and today’s parent don’t know how to do that. I just read an article that a 6 year old committed armed robbery. SIX. Wth.", "NTA who lets their four year old wonder around alone outside. You know he learned that behavior at home.", "The next time he climbs the fence into your yard call cps and report an abandoned child.  \n\nNTA", "YTA You yelled at a 4 year old?  You do realize none of his behavior is his fault, right? That’s parenting, bad parenting, don’t become a bad parent too.", "INFO. What does your wife have to say about this, given that she is friends with the neighbours?", "ESH.\n\nthe kid is an AH, it was in the heat of the moment, yeah, i get it.\n\nbut at the end of the day, he's a four-year-old child and you are a thirty-two-year-old adult. it's not appropriate to scream at kids.\n\nwhy aren't his parents doing anything about this? they are the real AHs here for not controlling their child and letting him be a menace to the entire neighbourhood.", "ESH. He might be a little brat and deserved to be yelled at but you're an adult and should be able to hold your temper.", "Definitely NTAH.  Consider yourself lucky that they don't talk to you anymore.", "ESH. You shouldn’t have yelled at him, it’s his parents that should have been yelled at because they’re clearly not doing their job as parents. \nHe’s four. Screaming at four year olds is always gonna make you look like an AH", "NTA", "NTA.  He's climbed your fence?  Get a camera, you're going to want footage when you make a few calls regarding this unsupervised toddler.", "NTA- sure their family and your family seem to be at odds and stuff happens, a kid cussing at you if you're not too good with other kids does usually lead to yelling back", "NTA. I WANT to say ESH, because there just isn't a good reason to scream at a four year old unless there's a risk of imminent harm, but the simple fact is that you were only yelling at the kid because his parents refuse to properly supervise him, and it's resulted in him causing problems for you and your family.\n\nI'd apologize for screaming at the kid for the sake of keeping the peace, but I'd also make it abundantly clear that this behavior will not be tolerated going forward. Just imagine what would happen if that kid jumps the wrong fence and curses out the wrong person; we've got too many recent incidents of insane nutters blowing away kids over the pettiest of reasons for parents to be letting their kids run loose like this.", "Seems like a problem with the parenting the kid is just doing what he’s allowed to do. Why didn’t you talk to the parents about his behavior? Light YTA as him doing that to my kids and property would properly piss me off as well. I’d just direct my anger towards his parents.", "Nta, the kid's parents are.", "YTA, you cannot scream at a child, you realize his parents probably scream at him everyday, since he acts the way he does.   As soon as you saw him in your yard, you should have marched him over to his parents and set some firm boundaries", "Tbh you admit your wife invites this child over, I think it’s unreasonable that you or your wife wouldn’t have shared cookies with the kid if he’s been invited to your house? I’m not sure if that’s a hot take but I feel like your opinion is a bit skewed here and there’s some context missing.", "YTA. But that kid sounds awfully raised... so I don't blame you... But he's 4. \n\nExpressing your frustration to the parents would have been more appropriate.", "NTA. Sociopaths and psychopaths have a childhood, too. Good luck.", "Nta. His parents didn’t instill proper behavior. And you are setting boundaries. I think cursing at him was a little much and I would highly encourage you to let your child set boundaries too or else he’s going to be a push over too and just look for his dad to solve it.", "My gosh YTA and IF there is a bully in this situation it’s you. \n\nThe kid is 4. Stop misusing the word bullying. Throwing a fit over not getting cookies is not bullying. Tearing up your garden is not bullying. \n\nA grown adult screaming at a 4 yr old is bullying. \n\nThis kid has behavioral issues, was not taught and coping skills, and omg what 4 year old knows how to cuss people out? Instead of screaming at the kid and vilifying them, how about you be concerned for them, let their parents know about their problematic behavior, and continue to take steps to keep them off your property. \n\nYou don’t want that kid getting hurt on your property. Tell the parents to keep them out, document incidents where they come over, call cps or law enforcement if necessary. Don’t just scream at a 4 year old and call them a bully.", "YTA\n\nYou were trying to control the kid via anger - he’s 4.\n\nHE’S 4!\n\nYou know you’re the asshole. \n\nHow is a 4 year old bullying your kids if you are watching your kids? This makes zero sense.", "YTA, but it’s highly relatable.", "The kid was in your yard, harassing your family, and destroying your property.  \nThe parents of this little goblin seem to be nowhere to be found.  \nThey're lucky you didn't call CPS, people letting a 4 year old adventure around a neighborhood unsupervised have no right to be calling *anyone* an asshole.  \n\n\nNTA.", "i wanna know what you said 😂 but ntah", "INFO: what exactly did you say to the kid? In any case don’t apologize because they sure as hell won’t. Those parents are the type you strategically avoid.", "NTA. If he wants to act like a big man, he can get talked to like a big man. Install security cameras and start calling the cops on the rugrats parents. Wash your hands of these fools", "4 years old? OP major AH. Fuck off OP that’s so messed up.", "I would say screaming probably wasn’t your best moment, and I’m sure it could have been handled more calmly, but seriously that kid is totally TA here.", "YTA- imagine an adult screaming at a 4 year old and wondering if they’re the asshole. Sounds like someone can’t control their emotions, LIKE A YOUNG CHILD.", "YTA- the kid is 4 , you are an adult! You shouldn’t be shouting at anyone, let alone a 4 yr old, especially not someone else’s kid.\nThe right thing to do would have been to discuss this with his parents- politely.\nNow you are the neighbourhood ogre who shouts at children.", "He may be a brat but you’re an adult so yes Yta and if 4 year old  is running that wild file   a report with cos he’s , outside and breaking onto your property? Why is he so unsupervised?", "NTA. Screaming at a child is more hassle than it’s worth because it doesn’t help and you get the smarmy flying monkeys demanding that you apologize.", "YTA that's a 4 year old, a 4 year old had a tantrum and swore a lot, you... an adult sunk to his level and also had a tantrum... AT the four year old. \n\nI mean. This is a no brainer here, this is just straight up abnormal behaviour on your part. \n\nA 4 year old misbehaving by messing up a garden, stealing dolls or wanting your son to share his cookies is not license for you to act like your resentment is justified here. A kid that age will pull up flowers and not realise the consequence because he's just enjoying interacting with the environment he's in, a kid that age sneaking dolls home is normal toddler misbehaviour not delinquency, a kid wanting another kid to share cookies is also normal (Why would you force a child to watch another child to eat snacks and expect that child not to be upset and whine to their parents you're acting like it was spoiled/offensive of him to do so here and I don't get it). Like this is some next level weird, you screamed at what amounts to a baby. And you're asking if yta???? You need to contact lost and found asap and hope your common sense turns up.", "YTA.  \"Remember, this kid is 4.\"  He is too young to be unattended by his parents, you should have calmly escorted him home, told them what he was doing in your yard, and left it at that.  No need for a grown man to engage in ugliness with a 4-year-old.", "The kid sounds terrible, and I’m sure he did need a stern talking to… but if you’re going to yell at anyone, it should be the parents. Where were they when he was climbing your fence, getting into all your things and tearing apart your garden, even cussing you out? It’s understandable you hit your breaking point, but they are both the root of the problem and (hopefully) the way to a solution.", "ESH. Screaming at a 4yr old is not a good look, but that kid’s parents need to seriously A) keep a better eye on their kid and B) get him therapy if they can’t help him better regulate his emotions so he isn’t a bully.", "What exactly have your neighbours been doing about their abusive child? Sounds like nothing. This kid is abusive and destructive and is not being watched by his parents to the point that he climbs the fence onto your yard to bully your kids and destroy your property. Has anyone confronted these parents? Has anyone held them accountable for their neglect of their child. When people don’t take care of their kids and let them terrorize others they are leaving it up to adults to call out their bad behaviour. NTA for loosing your temper on a child breaking into your property to terrorize your family. Get cps involved for the neglect of this child that has him roaming freely without supervision.", "Op is NTA the kid is though and his parents for encouraging it", "I’m torn here…there had to have been another way than losing your temper on a child…", "Info: What did you say to him?", "NTA..", "YTA - stop having beef with a fucking 4 year old and march your ass over to his parents. What did I just read???", "Dude, your post makes it seem like he’s a stray dog running around unsupervised; even though you clarify in the comments the reason he’s over is become YOUR WIFE invites his parents over and he comes with them. YTA for that misdirection alone.", "NTA.", "Lmao. CANNOT get past the image of a grown man shouting at a 4 year old. A FOUR year old??? 😂🤣\n\nMost definitely YTA", "Honestly?\n\nNTA it was deserved", "I would consider his parents not talking to you a win\n\nmy youngest was bullied.. I had and have zero tolerance for it\n\nany time the kid finds his way into your yard.. spray him with the hose", "YTA mate you don't yell at a 4 year old what the fuck. You can't take the behaviour personally, the 4 year old has no idea what the fuck they doing because he is FOUR. \n\nPatience and understanding is key here. If you are shouting at a child then I'm concerned at how you parent your own kids. \nGrow up.", "NTA. It sounds like this kid has been pushing your buttons for a while. Someone needs to teach this kid some manners, and his parents obviously aren't. Honestly, I'm concerned about his home life. This is not normal 4yr old behavior, especially not the language", "NTA.\n\nThe parents won't speak to you? Good. That means the little tyrant can stay off your property. I'm sure you have other friends.", "If this kid is out of control like you claim, he needs help from a professional. Apologize to the parents for your behavior. \n\nThis is above Reddit's pay grade.", "Honestly yes I'd appoligize but Id talk to the parents as well about how you will be installing cameras and next time he comes over to destroy/ steal something, to rip up your yard, or to only terrorize your children you'll be calling the police on him to have him escorted back home. You shouldn't have yelled but if they won't start controlling their kid you will be taking matters into your own hands to protect your home and family. NTA", "That poor 4 y.o. can't have a good home life to be that rotten at that age. \n\nNTA, gotta protect your kids from bullies, and trespassers even if it means yelling at other children. Next time he does it, call the cops saying there's a trespasser because where tf are that kid's parents?", "\"Other parents in the neighbourhood have been telling me they need to apologise\" - are they scared of the parents of this kid? It seems to me like they want a peaceful life and they are fearful of them. It's the parents of the kid's fault he's uncontrollable and they're the ones you should be directing your anger towards, not the kid (although the kid does need discipline which he doesn't seem to be getting) but I assume the kid's parents are the bad apple in the neighbourhood, hence why the neighbourhood want you to apologise. Nobody wants a war with their neighbours but I agree with you that nobody should tolerate bullying. Were you the asshole for yelling at the kid? Yes to a point, he's 4, but the parents should be the ones getting the proper bollocking.", "Yes, YTA.\n\nYou absolutely have to protect your children, but do so without adding trauma to them or other kids. \n\nWhere are the parents? If they are this absent, and a child that young is running around with so little supervision that he is putting himself and others in harms way, call child services. HE needs someone to step on and address whatever is going on inside that house.", "The kid left and you don’t have to deal with him anymore….problem solved. Get a camera so you have proof you’re not insane and he needs psych help.", "Probably unpopular opinion but NTA no kid should feel comfortable to climb a fence into another neighbors yard after destroying that neighbors property. He's seems out of control.", "Don't know what to say, I love kids but kids who throw tantrums for no reason or use cuss words are just really pisses me off. I might have done the same.", "NTA. It was an in the moment thing, he broke into your fence and cussed you out. It's not like you beat him up or anything. Sounds to me like his parents need to do a better job at raising him.", "You have to ask? Bro you “screamed” at a 4 year old. Get a hold of yourself, you’re a grown man!", "soft ESH, the issue is the kid's parents and how they are raising him, not the kid. I imagine all the cussing out is likely something he picked up from his parents, either them shouting at each other or at him. \n\nI get he's been a menace and you lost your temper but you're an adult and he is a 4-year-old whose brain is barely developed. Shouting at him also isn't going to reinforce the fact he's doing something wrong, it's just going to make him hate you/be scared of you. Of course, you're not his parent you don't *have* to try and discipline him in a reasonable way when he's in the wrong but I feel like he may have undiagnosed behavioural problems/parenting issues that need to be explored. \n\nI get he is still accountable for his behaviour but shouting at another child, especially if what you said was rude, is still not that great.\n\nI mean he's 4, his behaviour seems far more likely to be a product of circumstance rather than him being innately evil.\n\nIt's a difficult situation but it would probably be best to apologise and if possible try and explain to the parents. I'm not sure how to resolve it tbh.", "The kid really needs a psychiatrist. It is rare, but there are kids who are just mentally disturbed from a very young age. See the case of 2-year-old James Bulgur, who in 1993 was kidnapped, tortured, and murdered by two 10-year-old boys.\n\nI had a friend whose stepdaughter showed violent, psychopathic tendencies at 4 years old. Her father was loving and attentive, and shared custody with her mother who also seemed to be caring for her properly. This kid's school was constantly having to call the parents in because she would intentionally injure other kids. It didn't matter what punishment was given, she just responded with a silent, blank stare. She just sat quietly, and never gave a reason for anything she did. She just seemed to enjoy seeing other people in pain. I don't know what ever happened to her, as I lost touch with her mother about 20 years ago. I know the family was desperately trying to find some way to deal with her, including taking her to a child psychiatrist.", "YTA . Only had to read the title. You're 32 years old and you \"had\" to scream at a toddler...\n\nA toddler was able to push your buttons. \n\nJFC.", ">A 4yo old holding a grudge and \"making an enemy\" out of another kid is just super sketchy. I worked in kindergarten, kids that age don't work like this. \n\nThe little monsters absolutely do. I have seen 2 Four year old twins specifically decide to harass a dog 3 doors down from their house. There's no uniform behavior set for children, and maladjusted children can and do have some very odd behaviors.", "Kids are monsters until they’re taught otherwise.\nMy guess is that this kid is feral.", "This post is utter nonsense and the off chance it's real..of course he's an asshole. You don't scream at a four year old.\n\nWhoever down voted this is genuinely out of their mind", "Oh trust me they absolutely CAN hold grudges, bide their time, make enemies. I've worked in daycare/ with preschool age kids and known several kids to hold off on retaliation until rest time (when we were \"allowed\" -aka required - to have one less staff member in the room so that breaks could be had) or outside time where we were more wide spread and supervision was less 'close' in order to ensure that they could complete their retaliation. Obviously as we knew who would engage in that behaviour we  would watch them much more closely - but also, shit happens... Figuratively and literally.", "I agree there is info missing but children as young as four can present with callous and unemotional traits", "4 year olds can absolutely hold a grudge.  My 4 year old 1/2 brother tried to light me on fire because I would steal milk for him.  Then he tried to strangle me when I didn’t steal someone’s mail.  I was 3 and in foster care.  So yes 4 year old can and do hold grudges", "I will make anyone cry that bullies my child. I stand with this man whole heartedly. He should’ve made the little shits dad cry as well. Lesson well learned, I bet he leaves your property and kids alone now.", "I have a cousin who recently had her fourth birthday. I went to visit this past weekend. Which was a few weeks after her birthday. A child at her party broke a strap off one of her toys. While I was playing with her, she went on and on about how much she hated that kid for breaking her toy. So they definitely can hold grudges.", "Super disagree. I remember one of my cousins holding grudges like this at that age. He could be downright scary for stuff his brothers did that was accidental. Like splashing in the pool or running into each other on the playground. He sent one of his brother to the ER for stitches even.", "Seriously? I made enemies since I can remember", "What? It's a perfect opportunity to practice your hammer throw!", "I just cannot imagine a situation where a grown adult is yelling in anger at a 4 year old and they’re not at least partially in the wrong.", "^ This needs to be higher. \n\nESH. Scream at the parents, not the child.", "“teach it boundaries” made me laugh out loud", "4 is not a toddler in the US. No idea where the OP is from, but apparently they yell at tiny kids there and try to justify it by blaming the tiny kid.", "Yeah I would never call a 4 year old a toddler", "He's not trespassing. His parents are visiting OP & his wife and he's coming with them", "He jumped a fence and went onto private property though. Anyone who does that deserves consequences.", "The COPS??! Call the cops....on a *4 year old*??", "The kid is 4 and knows swear words, is holding grudges at such a young age, and is unsupervised for long enough to climb over a fence and destroy property. This is not normal behavior for a kid in a good home. Calling CPS to just check it out is not a waste of recourses when this is EXACTLY what CPS should be looking into", "Right. You just call the police.", "poor parenting IS NEGLECT and they are neglecting they're obligations towards the kid", "It'd absolutely neglect.  This kid is FOUR. There is no reason for them to be this unsupervised.", "This 4 yo is committing crimes. I’m pretty sure CPS would be very concerned about a 4 yo climbing a fence into someone else’s yard (trespassing), tearing up flower beds on purpose, not just from being a kid and playing (destruction of property) and stealing things (petty theft). It isn’t a very good sign that this child’s parents aren’t trying to reimburse you or offering an apology for the behavior and watch their child more closely to ensure it doesn’t happen again. Or get their child help for these behavioral issue.", "Four year old children simply do not have the brainpower to be this calculating and manipulative.", "Speaking as someone who studies developmental psychology, a child that age is not even considered to be cognizant, let alone have developed a sense of right, and wrong. \n\nHe won't even be considered legally aware of his actions until he is five, and a moral centre doesn't develop until around the age of seven or eight.", "Children no longer have parents.\nThey’re raised by tablets.\nThey’re feral.", "Yeah, what's to discus, anyway?  😉", "Yes!  I was going to say, you yelled at the wrong people.  Where are the parents?  And his behavior is obviously coming from somewhere.  Either it is being modeling for him or he has a disability that is not being addressed and properly cared for.", "Not at all. Read the story again. The kid climbed the fence and came into their yard uninvited, on his own, started destroying things, and then swore at the father. He's lucky he wasn't sprayed with a hose.", "Stop hanging out with the parents and don't let your children play with this child. Problem solved.", "Don’t feel extremely guilty. It’s understandable in that situation, even if not the thing to do.", "What are they doing to correct their childs alarming behaviour?", "Exactly, if my kid was legit terrorizing someone else's kid by stealing toys, climbing fences to come bully them and destroy someone else's garden,  I lose all rights to be mad that they got yelled at by another adult. It'd be my fault for not controlling my child.", "Taking out your frustrations about things that aren't the kids fault out on him makes you even more of an AH dude. That'd be shitty if he was a full grown adult", "On an unsupervised 4 yr old, so the cops can take him back to his parents to discuss their inability to supervise their son", "I hope it’s and issue in your area but I doubt it. CPS in most areas are overwhelmed and can’t even do anything for much worse than this. \n\nThis is nothing unfortunately.", "Read OPs additional comments; child was not wandering around. OP is FRIENDS with the parents.  No neglect. You just jumped to conclusions.", "CPS investigation involves allegations of abuse and gross neglect. I'm not saying that they are great parents, or that the kid does not have serious issues. However, there is a VAST difference between shitty parenting and abuse. You have no idea whether or not this kid has cognitive issues that are responsible for the behavior, or what. \n\nInstead of rushing to call CPS, a better approach would be actually COMMUNICATING with the parents about the child's behavior.", "Considering everything you said there is no reason to call CPS… honestly you (a GROWN MAN) lashing out at a FOUR YEAR OLD CHILD is going to raise more flags with CPS thank any bad behaviour this child has done. \n\nYes the behaviour needs addressing but you also need to apologise to the boy and his parents for lashing out at him. There was other ways of dealing with it", "Lol what? Children below about 3 lack a well developed theory of mind, but a) this kid is 4, b) even when they aren't able to imagine another's perspective, they still show a tendency toward prosocial behavior in the sense of \"I do for you what I would want,\" and c) I know of absolutely no evidence that this needs to be taught and isn't simply a natural development with neurological maturation.", "All children are psychopaths, give me a break. That's just a ridiculous thing to say.", "Sounds like this particular child has an extensive history of developmentally abnormal behavior. Bullying someone more than twice your age is also weird.", "My older brother is 30 years old and still, *to this day* holds grudges that formed when he was in preschool. \n\nAnd of course it's not normal, if it was normal, it wouldn't be an enormous problem, would it? That's like saying that a serial killer can't exist because it isn't normal to want to bury people under your basement.", "There are exceptions to the norm. The kid is 4 with no supervision by his parents they likely watch inappropriate things around the kid. Unfortunately, there is going to be problems ahead for this kid if someone does not start parenting him or instructing his parents", "You were a kindergarten teacher, not a physiologist", "Kids have always been a-holes. They don’t understand basic social rules. Older kids also are a-holes but for different reasons.", "A child who never experiences consequences for their actions will become the worst kind of adult.", "I don’t think assuming that the child was unsupervised since OP chose to scream at him instead of talking to the parents who I guess were right there too(?) is jumping to conclusions. More reasonable to assume the kid is alone than that OP for some inexplicable reason didn’t talk to the parents. Why is the child climbing fences if the parents are there?", "One CPS investigation is not a waste of time or recourses. You can communicate with the parents all you want, but they can also lie all that they want. That’s the frustrating thing with these situation‘s. It’s the safest bet just to do an unsupervised visit so professionals can evaluate the situation", "That's extremely strange to me. If my four-year-old happened to wear the same outfit as another kid, they'd be tickled pink about it. They'd laugh and snort and then run off to play. Why is your kid angry someone wore the same outfit?", "Developmental stages are longer or shorter, more or less refined, but they exist.\n\nAscribing gridge holding and \"making enemies\" to a kid that developmentally young is to fundamentally misunderstand childhood development.\n\nObviously, what OP is seeing is something extra, there's something going on, but the reminder that it isn't what we as adult humans would feel or think about when \"holding a grudge\".", "There is a kid with a deaf mom who gets physically rough with other kids at our playground. I see him look around to make sure his mom's back is turned when he bullies so that she won't see it and can't hear the victim scream.", "I would say this is an ESH. Of course you shouldn't yell at a child, but if your own child is being bullied by said child, then emotions can run high. This kid's parents need to step in and parent their child. If you had already spoken to them, and their child continued to bully your child, then they need to do something about it. A happy child doesn't bully other children; they need to get to the root of why, and for the time being, your kids shouldn't hang out.", "There's always someone who's going to pretend this is something new. I remember what kids got up to when I was one, and the stories my father would tell of his and his friends behaviour...", "They won’t learn basic social skills from Candy Crush.\n“Mom, teach me how to be people!”\n“Here honey, play with these lights until you graduate.”", "Por que no los dos?", "Children are a reflection of the environment they are in.", "Children this age should never be unsupervised. This is disgraceful.", "Did you read OPs other comments? He is FRIENDS with the child's parents. No abuse or neglect.", "I’m perplexed why you think it strange. Do you expect all adults have the same reaction to every situation? If they did, this reddit sub wouldn’t exist.  My younger child also would have jumped for joy at the same situation. Children are people, and they all have different personalities, and a full range of emotions, just not the ability to regulate yet. My oldest has always been very individual with her style, so she was upset to see someone in the same dress. She’s 13 now, and would no longer react that way as she’s learned to regulate her emotions. I imagine she’d still be a little bit put out if someone showed up in the exact same outfit, but would be able to laugh it off. I hope you don’t have more than one kid because you are in for a rude awakening if you get one that doesn’t “behave” in a way you think is “normal.”\n\nETA: Question: Do you find every four year old that doesn’t behave exactly as your four year old to be strange? Is your four year old the gold standard of four year olds, to whom all others must be compared?", "Because kids are all different. I absolutely know kids that would react the same as this person's kid. I also have known kids that would react like yours.", "Yes there are, and they absolutely allow for four year old children to hold grudges and bully other children. Won't happen in every kid, but very much possible.\n\nSource: studied developmental psychology", "Life is a rich tapestry.", "That’s fugging terrifying.", "And once again there is only so much you can know into someone’s personal life. In my personal experience it is easy to hide if you are neglecting or abusing your child. \n\nThis behavior is not normal, and as you pointed out it may not be from any form of abuse or neglect. But either way his behavior needs to be checked out by a professional, CPS often has the resources to provide the a better opportunity for getting children like this “under control” \n\nI have a cousin who has very similar behavioral issues. He enjoys being violent, he will yell scream and physically fight other people or animals because he finds it amusing. His parents brought him to several specialists and they were not able to find any plan of action that actually stuck until CPS was involved and had recourses for the family", "Very likely he was being abused. My brother was like this and ended up throwing a chef's knife at me from across the kitchen and it sliced my arm open 6 stitches later and he didn't even say sorry whenever he was jealous he would lash out. All of us kids were being abused but he didn't care that was how he reacted to it. By lashing out at anyone he was jealous of. He is still like that to this day. It legit is like this when abuse is heavy in the home. Kids can be vengeful and vindictive. Kids can be little assholes. I say that as someone who is also a parent and not just a survivor of abuse.", "Where is a four year old hearing the language he used? Do his parents curse at him? There's a lot going on with his behavior. YTA for forgetting you are the adult. I wouldn't let your children play with this child, he's got anger issues from somewhere. Install cameras, sounds like he's free range", "hate to break it to you, but youre just plain wrong on that one. (source: was a neurodivergent, adhd riddled, anxiety crippled child who doctors refused to address and half of my symptoms were dismissed.) new research is constantly uncovering more information, such as adhd is not, in fact, an attention deficiency, but a dopamine deficiency", "That's not very long.", "I would say that your cousin's situation is the exception, rather than the rule. I live in a large city, and have actually called CPS. My neighbor at my old house pushed her toddler HARD in the middle of his back. The kid went flying, landed on his face on the pavement and was screaming and bloody. Mom continued to yell and swear at the child. CPS asked if she had hit him with an object or a closed fist. Since it was neither, they chose not to investigate. \n\nA 4-year-old with behavioral issues isn't even CLOSE to this level, especially given that OP is friends with the kid's parents and is privy to information and insight into the family.", "It's also likely that this whole story is either complete bullshit or partial bullshit like so many of the other posts on this subreddit.", "Look, I'm neurodivergent and I've been bullied by a child just like that in my childhood, so I really don't doubt what he's saying", "To have time to talk to the next door neighbors he’s friends with and were in their yard during the incident?", "Ugh… I’m currently loathing myself for typing this.. but… \n\nget cameras front and back, especially the gate a 4yo managed to breach. \n\nYelling at a 4yo may be wrong and I don’t see either family moving in the near future.  Tiny tyrants usually grow into little tyrants and then into tween age a$$ hats and so on… plus don’t discount it took the parents (friends of your wife) a week to return the dolls purloined by the tiny tyrant. \n\nESH\n\nEdit to add: if it’s feasible and legal in your area cameras with sound. You never know when you’re going to need the cameras to protect you kids, your property, or yourself.", "Wth. ESH. You and his parents must really want this little kid to get arrested or taken away.", "First of all that’s absolutely awful, I don’t think anybody is arguing that CPS is the best system in the world. I really hope that kid is in safer hands\n\nHowever how could it hurt this family? If your argument is that it wouldn’t benefit them in anyway the way that it benefited my cousin, what is there to lose? CPS, in theory, is there to help and protect families. \n\nI have had many experiences with CPS, some positive but not all, and in general they are here to help where they can. One investigation can’t hurt, especially when the kid is showing signs of having a problem either at home or with his behavioral health", "A 4 year old? Either way, like I said it's not impossible but it's not the most plausible.", "To potentially start a conflict with neighbors who witnessed most of the behavior and were presumably dealing with it themselves.  Yeah, a week isn't that long.", "He screamed and swore at their 4 year old..", "NTA\n\nYou need to call child welfare. They need to investigate this kid and his life. It sounds like he is angry at the world & jealous.", "A four year old with these behaviors doesn’t need more yelling. You need to speak to his parents. He’s simply a product of his home.", "A necessary evil. This world really needs people like you, willing to be the bad guy for the greater good. \n\nSuffering is necessary for growth. Hopefully the kid will grow a tiny bit from being yelled at by someone other than his parents.", "ESH it’s his parents you need to go yell at. He’s 4 and nobody is teaching him how to behave.", "If this is all true, fuck that kid", "> My wife is friends with his parents, so he comes over when they come over. Things weren't a real big deal until recently, when most of the drama happened, so we didn't see a need to take real action other then just mentioning his behavior to his parents. \n\nESH You were way out of line to blow up on the kid if you've never even taken the first step to try and address his behavior that you describe as consistently unacceptable. \n\nIt can't both be that this kid is bad enough that you had to start locking your gate because he's so destructive and his behavior isn't a big enough deal to do more about than mention in passing. Pick one. \n\nAnd how are y'all friends with people who would raise their children that way? Let their child keep stolen toys for a week? Be a well-known neighborhood menace who regularly terrorizes other kids? What did his parents do when you mentioned it? Laugh maniacally?", "ESH. Screaming at a 4yo isn’t going to help anything. Also if a 4yo was in my yard without their parents I would be calling the police/child services or escorting them home, not yelling at them and causing them to run away to who knows where. What if he didn’t run home? You got lucky there. \n\nSounds like this kid is being neglected and in a toxic household. His behaviour is likely the fault of his parents. That child will need therapy because of them (assuming he’s not arrested or taken away first).\n\nBut seriously take it out on the parents not the kid. He’s likely acting out for a reason. He’s only 4 so there’s still hope that a good home environment could reform him.", "sorry, but yes, yta for screaming at a four year old.", "There are many possible reasons for the child's behavior. However, screaming at the toddler is not acceptable. Consider reporting trespassing toddler to the police as parents seem to have difficulty managing (or are causing) behavior issues.", "YTA for screaming at the toddler and not the parents. This is a 4 year old, they are far too young to have this not be learned behavior. The parents definitely taught them this to some degree, or have been abusive/neglectful or otherwise just awful parents to have the child be this way. They are 4. \n\nYou should have spoken to the parents, so YTA for yelling at a 4 year old, but what that kid did was not okay and should definitely have been brought up with the parents.", "NTA based on the info given.\n\nSounds like a nightmare child. He didn't just learn that bad behaviour from nowhere. Either the parents talk to him like that, or he's being treated like that by someone he knows. \n\nEither way, I'd say I'm sorry for getting angry, but that you don't want their son near your children or house, because of the amount of bullying and property damage he's responsible for. \n\nDon't be afraid to stand your ground. A lot of the time, these kind of children receive no consequences for their actions, and just get worse. \n\nIf it were me, I'd cut off the entire family, and let them know, if he continues to break into your property, you'll get the police involved.\n\nYour children don't deserve to live in fear.", "OP's description makes the child sound feral, bullying and swearing is terrible behaviour and likely they are copying what they see at home or acting out because of what is happening at home. \nCan you do a safeguarding referral OP? There should be something on your local council / government website for reporting concerns.", "I wouldn't yell at the kid, but I would, in terms a four year understands, tell him to fuck off back to his useless parents, with a message from me to them, to come and have a nice little chat with me about their lack of parental supervision.", "NTA ngl as a fellow parent, my job is to protect my children. If someone dared trespass after I made it known that they were not welcome and terrorized my children and things, screaming at them is completely called for.", "ESH. Assuming that you've reported his behavior accurately here, something is extremely not okay with this kid *and* his parents. Nothing you've described is remotely normal behavior for a four year old. Holding a grudge isn't something a toddler should be able to do. Climbing fences to destroy your flowers? Not normal for a 4 year old. Bullying a child more than twice his age? Not normal. Cussing out an adult?? Something is incredibly wrong here. \n\nYou need to make an anonymous call to CPS. It may just be that this kid is wired wrong, but there could also be something going on at home that's not okay. A child that age shouldn't be wandering the neighborhood alone, either. \n\nSomething is not right here. Don't get any pets, OP. The neighbor kid might hurt them.", "The parents should be watching their FOUR year old kid so he won’t get in someone else’s property to destroy it… it’s pretty logical and it seems like the parents are being irresponsible.\n\nObviously you shouldn’t have yelled at someone else’s kid but tbh I get why you would feel done with having to deal with things that could be easily avoided \n\nKind of NTA?", "NTA. Someone needs to teach this kid.", "NTA. I usually don’t believe in yelling at other people’s children but this kid needed a wake up call, he can’t go climbing into your yard - why was no one watching him?? The only A-holes here are the other kids parents for not watching him and clearly teaching him foul language and behavior.\n\nI believe this story because when I was 5 I had neighbors that tormented my siblings and me like this on a regular basis, similar ages.", "That kid is bad news.  You may have done him a favor.   NTA", "You had every right to yell at this kid. Too bad if it made him cry, clearly he's not used to being told \"no,\" and his parents enable his terrible behaviour.\nNo need to apologise to the parents or the kid as you did absolutely nothing wrong. NTA", "YTA for yelling at the 4 year old and not his parents.  Ultimately, they're responsible for his ability to wander about the neighborhood behaving like this.  You can apologize to the little boy and then tell his parents where to get off.", "NTA-it's like the saying goes \"if you don't parent and discipline your own child, someone else will\".", "NTA, you did well to yell at him, he is not your son, he is attacking and harassing YOUR CHILDREN, parents are the type who do not educate their children but if someone else tells them something or complains about their children, they act offended, put more security and if the brat calls the police again, he is 4 years old and sounds like a delinquent teenager", "How does a 4 yr old \"jump a fence\".", "We used to live next door to a a totally undisciplined kid. Really young, like your neighbor. Parents were useless. Zero discipline. He was in our front yard one day swinging a plastic jump rope around, and my kids were there.\n\nI told him to stop, went to take it away from him when he refused to stop. Little brat swung it at me. It was summer. I was wearing a pair of shorts. Stung like the devil.\n\nI got up in his face and screamed at him to go home. Never regretted it. Never apologized.\n\nYour neighbor will not get better. The parents will not get better. If you say anything to the parents, tell them if they don’t want their kid to get screamed at to keep him the hell off your property.", "NTA. There are consequences for actions. That kid was acting like a feral A H and deserved it. The parents feelings are hurt so now they’re not talking to you, but there clearly not holding their kid accountable so you had to. Do you really want those parents or that kid in your lives though? Good thing you told him to get lost.", "Not a lot, of info, in this, post. Please double, check your, punctuation, points, as I couldn’t, read, the post,,,.", "This story is a complete work of fiction.", "Info: how the hell does a 4 year old climb a fence.", "ESH. The kid is 4. This is his parents’ fault, not his.", "You’re clearly the only one parenting him and trying to teach him boundaries and maybe a lesson?", "Definitely the Asshole.", "Put camera in your yard, now. Front and back. At the gates. When that kid is unsupervised and has an *accident* at your house and his family tries to say you were *watching* or *babysitting* him you’re going to need it to stay out of trouble. Also they’ve spread lies to the other neighbors and wouldn’t it be nice to show this little asshole climbing your gate completely unsupervised and destroying your property? Cameras. Now. \n\nAs for the rest I have to go ESH. This kid has been a problem for a while and you did nothing proactively. His parents suck, he sucks, but you suck for screaming at him. Did he deserve it? Yup, prolly but it didn’t have to go that far. Video evidence of him breaking into your yard would go a long way towards your neighbor monitoring their kid or go a long way toward getting a third party involved. Finally you suck for thinking you’re *friends* with this kid’s parents. My friends don’t let their kids destroy my property.", "I'm gonna give this an ESH. You acted horribly, but it seems that there were several incidents. The kid is acting out for some reason.", "ESH, look I'm sorry you're struggling but ANY adult that would have a screaming match with a 4 year old instead of just scooping him up taking him to his parents and dealing with them has questionable judgement in my opinion. Pretty difficult for me to think any 4 year old can eb some kind of established bully!", "YTA - you should have been screaming at his parents. This kid, acting this way, something is going on at home. You took it out on the wrong person. And if your wife invites this kid and his parents over and your kids end up being bullied as a result of this, your wife is in the wrong too.", "YTA . He's 4. If he's acting bratty it's on his parents anyway at that age. Grow up", "NTA the kid needs to learn a lesson, but where are this child’s parents are when he’s wreaking havoc and why aren’t they interfering or are they the reason he’s acting out. either way this situation is weird", "NTA. I would also be calling child protective services.  This kids behavior is not normal.", "The way Reddit throws around calling CPS is a fucking joke, there are real kids in real trouble and you want to waste their time on some spoiled little shit who is mean to other kids? What a joke.", "We just recently had a 6 year old shoot his teacher in the chest. When he was 5 he tried to choke a teacher to death. I would believe a 4 year old is capable of holding a grudge.", "> A 4yo old holding a grudge and \"making an enemy\" out of another kid is just super sketchy. I worked in kindergarten, kids that age don't work like this. \n\nSociopathic kids do. And yes, it really can start that young. There was a kid in my son's kindergarten class who gave off those vibes. Like, that kid freaked even ME out, and I'm an adult. \n\nMy son came home crying one day because they'd been \"making wishes,\" and that kid's wish was that he hoped some of the other kids would die (apparently he was laughing while he said it).", "I'm wondering how tall the fence is that the toddler climbed.", "This is some Spy X Family drama", "As a former kindergarten teacher I can assure you that there are kids this age that work like that.  They usually grow to be raging assholes but they do exist.", "You are kidding right? There are 6 year olds bringing guns to school. For real. 4 yrs old have no trouble making enemies. He's probably an only child.", "I seriously had a client's 4 year old tell me to \"Fuck off\" a few times, and do trust, he knew what it meant.", "Idk the 6 year old who spent several weeks planning out bringing stuff to school to shoot his teacher and had attempted to strangle her multiple times was probably like this at 4", "I'm totally baffled at \"he bullies a 10 year old.\" I have a 4 year old. 6 year olds barely give him the time of day and OP wants me to believe that a 4 year old is bullying a tween?", "i don’t really know. until now, i kind of thought toddler was just a little kid. i’m also not from an english speaking country, but moved to canada when my wife was pregnant with our first kid.", "I'd call a 4 year old a preschooler. For a toddler I'm thinking 18 months -3. Some people would say 1, but at that age, they might not be reliably walking and they're just a really mobile baby. \n\n4 year olds sometimes will exhibit toddler-like behaviors, but they're more like a really little kid.", "This behavior is not normal for a 4 year old at ALL.", "That’s how you get into fights with other parents . Most people are going to go nuclear on a full grown man shouting at their 4 year old.", "He didn’t. Yelling teaches nothing.", "If you read literally any book on child psychology this kid most definitely did not need yelling. Yelling does nothing to teach kids lessons except that yelling is okay.", "Rotten kid? He’s 4. He probably can’t even spell his own name. Fire with fire? If a 4yo hits you do you hit him back? I really hope you’re not a parent because that is super not how you teach kids right and wrong.", "I really hope you’re not suggesting physically assaulting a 4yo…", "I second this - I know someone with a child who is extremely anti-social, manipulative, and downright mean. The child is 4 years old, it seems so strange but it definitely does happen.", "Agree. When my son was younger than that, he would play with my mates son, one of the few kids in the neighbourhood of the same age. This kid was an absolute little shit! He would absolutely ignore his mom, he was violent, verbally nasty, snatched toys, broke toys. I ended up having to limit the time spent with my friend and always was present when they played. He wasn't as bad when I was right there since I would remove my son from whatever they were doing (distraction, cuddles) or scold the kid myself. He was actually not welcome to local play groups due to his behaviour. I could honestly see this kid ending up in some form of detention centre from an early age. He very likely had some undiagnosed medical issues.", "must be good to never have been victimized by other children during early childhood... my CPTSD is a proof that shit like this post happens way more frequently than people think", "Right?\n\nOP: where does this toddler learn to curse?!\n\nAlso OP: Screams at a toddler as a grown adult", "I’d feel bad for the kid but it’s understandable that you blew up.", "Consequences like explaining why you can’t do that and returning him home - yelling just teaches the kid that yelling is how you solve problems.", "Maybe but he’ll sure as shit remember it", "Balloon burst. I'm the father to 2 very successful well adjusted young adults. (16 and 21). \n\n4 year olds can very much be rotten kids. If you don't know that, you either haven't been around enough kids, or your kids are the rotten ones.", "“It’s not exactly normal”… Girl, I think that’s the point. I’ve known one kid in my life like this, so I agree it’s the exception rather than the rule. Having said that, I imagine that you have a class full of well-adjusted children suited to a classroom, and this doesn’t really compare. Does this sound like a child the mainstream system would tolerate? Absolutely not! This falls under the purview of abnormal psychology- I have no doubt the child needs help; however, that doesn’t excuse his behavior. NTA, OP.", "Did you not hear about the 6 year old who was so mad at his teacher that he not only threatened her,  but went home, packed a gun, brought it to school, and shot her? Yea, it might not be common for little kids to hold a grudge, but it is absolutely possible.", "I agree. My grandson is at the end of 2nd grade (8). They go from friends/enemies/friends as often as they brush their teeth. They don't have the mental stamina to plan revenge.", "Just because you taught kindergarten doesn't mean you know how every kid works.", "As someone with a 4 year old and with friends who also have 4 year olds… please don’t speak for every child. There has definitely been some grudges held and some vindictive behavior because of it. Just because they don’t show it during school hours doesn’t mean it doesn’t happen.", "I confirm. I have babysat for a decade, and the recent slew of children who SCREAM if you take a computer or tablet away from them is INSANE. I had one kid I babysat regularly who was the only one with a time limit that he EARNED his time on by completing his chores and homework. The rest were feral and destructive.", "Yes.  I call them Smartphone Babies.", "Not a four year old", "Sadly that’ll likely be worse for this poor kid :( sounds like he’s being neglected", "Your OP does make it sound like that's exactly what's been happening.  Maybe you need an edit", "The kid is scaling fences into other people's property on his own at four. Even if the parents were in shouting distance, the kid was wandering into yards unsupervised. It's the neighbor's yard, this time, but the kid could wander into the street next time.", "[removed]", "I totally held grudges at that age and for a long time, too. One I never got over because another girl lied about me hurting this little boy (when she did it and I told her no, but the boy was young enough not to be able to communicate properly) and I got in trouble for it. That same liar kid wanted to be my friend five years later and I was all nope, not dealing with you ever again.", "That sounds a lot like what's been done to me in my early childhood. It's infuriating how some people simply refuse to believe that children can absolutely be vile.", "I call them iKids", "good for you then. that's clearly not the case for every single person out there.", "It doesn't really matter tbh... OP's kids are at risk here. Yes, they might not die, but if they're bullied enough they could be forever impacted by it. They're kids as well, and they deserve to be safe. It's a shitty situation overall though.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "That’s actually hilarious. Your 9 year old self served up that revenge ice cold. I think people here are thinking about 4 year olds more like 2 or 3 year olds. Do most 4 year olds hold grudges, probably not yet, but some do, and it falls in the range of normal, just on the far end of the spectrum. I was just 4 when my brother was born (June birthdays both of us), and when he was a few months old, a friend came over for a play date. Well, she only wanted to play with the new baby, and not me. I was so annoyed, and when she asked me at school if she could come to my house to play again, I said nope, and I said nope every time after that too.\n\nETA: I expect my oldest comes by her grudge holding naturally 😂", "🙌", ">Those realities are well understood in children who are not functionally abandoned and/or abused and are neurotypical\n\nAnd we don't know any of this about the kid in question. Thus, saying it's unusual is on par, saying kids flat out don't do that (as the one comment did) is factually false.  This could *could* be abused in some way, or neglected. The kid *could* also be overly spoiled, even young that can make a monster of a kid (my cousin was a monster by 3...it never changed). The kid *could* be neurodivergent. Even OP might not know any of this information. \n\nAlso, while the concept of vengeance and spite might be too abstract for a kid to understand, doesn't mean they cannot act upon the emotions that lead to those actions. They just don't know what it is. We as adults *do*, and know it by words and abstract concepts. This is always the case. As an infant, kids don't understand *anything* they see/hear/feel, but they still react to it, and through those reactions they learn the abstracts behind it. Kids don't understand the complexities of bribery either, but I bet if you bribe them with a cookie to do something, they'll turn right around and do it to another kid 😉 \n\nThey don't have to understand, they just have to imitate. That being said, if the kid is *that* bad, what is being modeled for him?", "If the child is truly a menace, you and your wife need to have an honest discussion with his parents to establish boundaries of what is and isn’t acceptable in your home and with your kids. If his parents can’t, or choose not to control their kid, then you and your wife need to get on the same page about him (and maybe even the parents) not coming over anymore. And then enforce, enforce, enforce. Your kids shouldn’t have to be terrorized in their own home. I’m gonna say NTA, but you and your wife need to formulate an action plan. Otherwise, you’ll both be T A.", "\nI don't think OP should have yelled, but it's not right to downplay this kid's actions saying things like \"siblings run off with each other's toys\"... Yes, they do, but sometimes it isn't normal and parents have to keep an eye on that. Kids can be cruel to other kids. The adults in the situation should behave like adults, but if the kid is victimizing other innocent children, downplaying it is not the right way to go about it. I've been bullied like this by my younger cousin when I was a kid and have CPTSD as a result of it. Adults around me downplayed his actions as \"he's just a kid, boys will be boys\". He was, indeed, a kid, but so was I - and they failed to protect me from him. The adults need to recognize there's something wrong going on in order to protect the victims as well.", "Oh I never said she wasn’t an asshole, I was explaining to someone that clearly doesn’t understand that child psychologists have completely missed the boat on how some kids can be.\n\nThere’s this misconception, for example, that 4 year olds can’t form cliques. That’s obviously bullshit if you’ve spent more than 26 weeks at a daycare. The “experts” that study kids often do so in a controlled or semi-controlled environment. It’s no wonder they don’t know what’s going on in the chaos of real life.\n\nPHD holders are brilliant. They also can get so hyper focused that they miss the trees for the forest (which is weird and I hate that phrase).", "Yes, but ADHD is not the only form of neurodivergence. There are plenty of alternatives that might explain this kind of behavior: Oppositional Defiant Disorder (ODD), Disruptive mood dysregulation disorder (DMDD), Intermittent Explosive Disorder (IED), to name just a few. And ADHD *does* have a connection to emotional dysregulation.\n\nUnless you are a child psychiatrist/psychologist who has treated this individual child, you can’t possibly say this behavior may not have some connection to neurodivergence, and just because the research is still learning more about these disorders that doesn’t mean that the existing research isn’t reliable.", "So then unsupervised?", "My first thought", "The phrase might bother you less if you reverse it (as it's intended to be used) -- you miss the forest (the overall picture) for the trees (the narrowed down view).", "Yep, can confirm this. My cousin was an evil toddler, then an evil child, then an evil tween, then an evil teen and is now an evil adult who physically abused his 5 year old brother. OP, protect your children, specially your daughter. This can be way more serious than you imagine.", "I agree. This sounds like a lot of the signs for some serious issues at a young age. Either this kid is getting abused (where is he learning to scream all those swear words from??) or he has anti-social tendencies. Some of my friends have been diagnosed with anti-social personality disorders and this behavior sounds pretty similar to what they have told me about. Either way the best approach toost situations is surveillance and proof and more proof. If you guys ever get into serious clashes with the parents you'll want hard drives of evidence to back you up. However, I would suggest apologizing in some way as it is inappropriate to scream at a small child no matter how much you think they're being malicious. Maybe something along the lines of 'Sorry I yelled at your kid, I was extremely frustrated with his recent behaviors and didn't act like an adult in that situation.' done quote me I'm not sure how to phrase that properly.\nEither way, hopefully this kid is just dumb and destructive, but it's best to prepare for the worst and hope for the best.", "Because the parents don't appear to give two shits. This wouldn't happen as often if at all if the parents were doing their job. It's easy enough to go off on an adult and still have them not take accountability. But screaming at the kid will leave a lasting impression not to come on the property and destroy things again. Clearly, it scared him, yes. But sometimes, if you aren't going to learn the easy way, sometimes you must learn the hard way, and this kid was a walking liability.", "Yep, it started exactly at 4 years old. She looked at me and simply decided she didn't like me, then proceeded to terrorize me (while completely unprovoked) until we were 10. It's definitely not normal, though, but yeah, it's possible.", "NTA - You don't owe that little s*hit anything. \n\nAnd also- if you have pets, you should keep them well away from this little psycho.", "No, clearly this kid is being allowed to act like a complete menace. Let his parents be mad, what happens when the kid breaks into someone’s house and gets shot because someone thinks it’s an adult. They are allowing a baby to destroy other people’s property and they are not watching him while he’s breaking into other peoples back yards. The parents need to wake up before he steals a car, crashes it and spends his pre teen life in juvenile detention or worse. I suggest you get cameras set up stat.", "NTA The other parents should have a handle on their son.", "I find it hard to imagine a scenario outside of immanent danger where *shouting* at a 4 year old wouldn't make you an asshole, even if they are misbehaving. \n\nINFO: have you talked to his parents about this?", "NTA\n\nYou lost your temper after a small child began using inappropriate language and refusing to leave.\n\nYOU NEED CAMERAS. WITH AUDIO. Then you need to start turning the videos in to the local police. The child is unattended, climbing fences to trespass, and basically neglected. This kid's parents need to apply toddler proof doorknob covers and better window locks, with sticker alarms, AT THE LEAST. \n\nIt looks like they are not even doing the very basics to protect their child from being injured or even kidnapped. What if you aren't home one day and he just decides to try to break into your house, and gets snatched by a rando driving around the neighborhood? Go ahead and call me crazy, but there are videos of older kids getting snatched our attempted to be snatched out of their yards by people driving around.", " No kid hops my fence and curses me out and expects no repercussions. I would have turned the hose on him.", "YTA. Even if it's the worst behaved 4 year old on the planet. You just reinforced being unkind and losing your temper are conflict resolution skills. You're an adult, act like an adult.\nI recommend that you get some cookies together and go apologize so your own children see how easy it is to own a mistake and move on.", "I call BS.  Nobody with kids calls a 4 year old a toddler.", "Lol nta next time spray him with your hose", "You really have to ask? This? Yes, screaming at a toddler makes you and asshole. Seriously, you lost control and took it out on someone completely unable to respond to you any way other than fear. You can have a thousand reasons to justify why you think this toddler is a little shit but none of them justify screaming. \n\nYTA", " Don’t yell!  Just get the garden hose out.  Great for cats, squirrels and random little kids invading your yard.", "YTA. You're an adult. He's 4. It doesn't matter if he was speaking in tongues to curse you and your entire bloodline - you an an ADULT and he is a TODDLER. Why the hell are you getting into a screaming match with a TODDLER holy shit.\n\nYou could have taken him firmly by the hand and marched him straight back home. If you need to yell at anyone, yell at his shit ass parents.", "He's 4. FOUR!!!!! YTA be the grown up adult you are meant to be and recognise there is something larger going on here. He is obviously the victim of something, where do you think he learned all the behaviour and cuss words from??? Why do you think he spends so much time away from his house and parents??? HE'S FOUR. massuve YTA", "YTA for screaming, but NTA for feeling bad. Next time, take a deep breath and talk to the parents first.", "NTA. As a parent, if my 4 year old acted like this, I’d be livid. You shouldn’t have been the one yelling, they should have. Yes, he was probably a little scared, but it’s more likely he was only upset that he was being disciplined for what sounds like the first time. \n\nNow granted had you never met this child before, you would totally be an asshole. But it takes a village, you are a part of their village, the parents will get over it, or you no longer have to deal with people who don’t deal with their children.", "ESH, but maybe not your children. Supervise your children at all times. Ages three, four, and five really cannot play alone outdoors unwatched, certainly not three and four year olds. Video when the neighbor child is there. Have a security camera also, for another angle and verification. Do not leave your children alone. They are too young, and this child can climb your fence. Hover. Intervene. You're the adult, it should not escalate to you swearing at a very young child. Are you home during the day? Where was your children's mother? You call the parents to come and get their child. Point to the damage, and show the video.", "I’m wondering what’s happening @ home with this 4 year old to have such behavior….", "NTA, but you may consider calling Child Services in the future. Explosive temper, parents not caring, a four year old cursing you out? Something doesn't seem right to me about this. He may have a potential disorder, or he may be witnessing abuse at his house.", "NTA. They won't control their kid and the little shit wouldn't leave, better than chucking them back over the fence into his own yard. You're better off with them not talking to you and the kid staying the fuck away from yours.", "YTA \n\nDon’t scream at kids \n\nYou have the upper hand, by not being 4 years old.\nReturn the child and tell the parents he’s not welcome on your property \n\nIf he has behavioural issues screaming at him won’t help", "YTA.  I understand you must have been very angry. But it's a 4 year old.  They are pretty easy to outsmart.", "NTA\n\nI'm going to have a controversial take here, but that kid needs to be disciplined, and if his parents aren't doing it you have to be clear he isn't welcome. Obviously only because he's fucking with your kids and invading your property, otherwise you should just leave him alone. But yeah, the kid is jumping into your yard and cussing at you? That's a \"listen here you little shit\" kind of situation given that the parents have failed hardcore raising the kid and he's hasn't been invited.\n\nI'm always surprised at how much bad advice is given when other people's kids are involved. Obviously you dont want to go crazy, but clearly telling a misbehaving and unsupervised child, who is forcing himself onto your property and cussing at you, not to do something and making sure they understand it is completely acceptable in a lot of circumstances.", "You don't cuss out a child, you tell the parents and if the behavior doesn't change, you cuss out the parents because they are allowing the behavior, and tell them you don't want him climbing your fence. It's locked for a reason. I have no filter and the truth just comes out but perhaps you should use a filter and present it in an almost nice way. After if the gate is locked and he falls and gets hurt, it protects you and your family.", "Um yes. YTA. There's never a justification for yelling at a 4 year old, unless it is to keep them or someone else from getting hurt. Do I have children? Yes. Have I yelled at them before? Yes. But it's not okay. Like I said, unless of course it was to keep them from imminent danger.", "You should've directed your anger at the parents. At any point, did you try to talk to the parents at all? That's weird. YTA.", "He’s fucking 4 of course YTA", "I’d like more details. There is info missing.  But on the positive that kid won’t bother you anymore - hopefully.", "YTA. Yelling at a 4 yr old is not the answer. You should be having a discussion with the parents or maybe even CPS but being verbally abusive towards a child that isn’t even yours isn’t the answer no matter what the issue is.", "I am seriously besides myself that people are saying OP is NTA. You're frustrations are understandable but does NOT make it okay to yell at a toddler. Like it's not the end of the world. I don't think OP is a bad person or should burn in hell for this mistake, but yes, he's definitely TA in this situation.", "NTA, the kids parents should deal with the kid, starting with keeping and eye on him.", "I'm going to go with YTA. Yeah, the kid sounds like an unholy terror, but you are a grown ass adult.", "Now you know why the house was such a “good deal.” \n\nNTA. I would have done far worse for the kid to have climbed my fence in the first place. Never apologize and stand your ground. I do worry for your kids though. Moving or keeping them out of the same school when the inevitable comes will save you and your children a lot of hell. This kid is bad news.", "I have serious doubts about this story. I know a 4 year old that's rough and mean when playing with my kids and I have to supervise and intervene, but I wouldn't call it \"bullying\". If the kid has behavioural issues, then the parents should be aware or should be made aware. Why haven't you spoken to them? Why were they not watching him? And to cuss out a 4 year old? That's pretty fucked up. It's not as if a four year old is able to cause so much damage as to warrant that sort of reaction from a friggin ADULT. YTA.", "That neighbors kid is a menace he is a bod boyoioioi. (thank you for you consideration) #leapfrog", "YTA\n\nHe’s a 4 year old, you are an adult.", "ESH. Never go off like that on a child! Not to say it isn't sometimes deserved, but there is no way in hell that someone your age and size can ever explain  that in a way that doesn't make you a complete asshole. You always need to play it VERY safe with other people's kids. No one cares about your side of the story, you'll just be some evil abusive guy.\n\nHis parents are the obvious course of action. They're the ones you need to handle that kid. And of course it goes both ways, so make sure you communicate to your kids that you don't want them trying to talk to or play with that kid anymore.", "ESH\n\nThat brat's parents need to discipline their son better definitely.\n\nYou owe the brat an apology for yelling at him, but at the same time, his parents need to understand the reason you yelled was because of how awful their child is and that is their fault.", "Going against the grain here but YTA. Hes a 4 year old. You can't control your temper against a 4 yr old and you have similar age kids? Thats sus. \n\nYou're the freaking adult here right? Go talk to the other adults, who are this kids parents. \n\nReddit in general has a hate boner for kids, so you'll find a lot of people on your side here, but he's 4, you're how old?", "My 4yo nephew held a grudge for almost a year because his grandfather ate his cake we said he could have after dinner.  He didnt speak to or acknowledge him at all that whole time. That's a quarter of his life. Kids can certainly hold a gridge", "Incorrect, you are 100% wrong, some kids are indeed just like this and sometimes worse. Try not to make blanket assumptions and make yourself look foolish", "I have news for you: I taught pre K for 7 years, there absolutrly are young kids like this.", "Ok Trunchbull!", "It’s a made-up story, obviously.", "4 year olds are braggarts and liars and lovers of gross things like boogers and poop.   I love them, most of the time , but they can be tough to deal with.", "Yelling is abusive.  Full stop.", "Take a chill pill. No need to get insulting about it. SMH.\n\nI have simply never met a 4-year-old who would act this way. It's perplexing to me that a kid would act like ET hosts judging a red carpet event. I have two kids, for your information. And been around a lot of young kids and never seen any of them act that way. And as rusalkkamaya mentioned, 4 year olds generally do not have the emotional capabilities at this stage to \"hold a grudge for 2 weeks\". So yes, I find it strange. Your experience isn't universal. People are allowed to find things strange. You don't have to act so personally insulted by it.  \n\n\nETA - And don't put words in my mouth. I never called your child strange. I just thought it was a strange reaction for a 4-year-old. I was wondering if maybe you had a certain career or something that would've precipitated this kind of reaction (like you're in fashion or something). Or maybe you watch fashion shows around them. No need to get your feathers ruffled.", "I guess I've just never met a 4-year-old who would react that way. As rusalkamaya mentioned, their emotional reactions are usually immediate. As in \"that kid stole my ball\". But then five minutes later they're playing together again.", "Even children who are abused or neglected tend to react in a different way than OP is describing.  As a child of two child psychiatrists and a teacher myself what I can say is this child IS definitely bring neglected but OP seems to be (as most adults do) misconstruing common  \"this child is never being watched\" behavior for \"this child is out to get my family\" behavior.  It's the house next door, so this is the easiest place for this kid to wander, and you know what four year olds do when they aren't being watched? Destroy shit.  Not because they are being vindictive, necessarily, but bc they are still learning about the world and don't know how things work.  They don't know how to pick flowers or what is or is not appropriate behavior unless they are taught, and it seems the only thing this kid learns is swear words. \n\n I don't know where you live OP or if children running the streets is normal where you are from but YTA for not calling CPS the first time this kid wandered onto your property with no parent in sight. The kid is 4. He should have someone watching him at all times.", "You wrote “It came to a point where we had to install a lock on my gate to keep him out of our things.” \n\nWhy would you need to do that if he is coming over with his parents? You also say this has taken place over a “short time span,” but you needed to install a gate lock to keep him out?\n\nbut if he is coming with his parents, then what does the gate lock achieve? Unless he is running around unsupervised.  And if he is supervised and with his parents, why did the parents let him destroy your garden?   \n\n\nThis all screams fake, made up story. If it is real, it doesn’t make any sense. Don’t befriend neighbors who have a kid that terrorizes you or your children. Be a parent and protect your kids. Don’t yell at a four year old, what is the point, you are an adult. You choose whether or not that kid and his parents are invited over. right? Unless he IS unsupervised And sneaking on your property.", "You are blaming a 4 year old for his parents' bad parenting.  Children behave this way because they are ALLOWED to behave this way.  YTA for being mad at a child when it's obviously the patents.  Grow some balls and have an adult conversation with them.", "Oh no, you aren’t uno-reversing me. It came off as insulting. Perhaps you didn’t mean it that way, but the word “strange” has negative connotations. When you say the man down the street is “strange”, you don’t mean quirky or unusual.", "He forgot to write character motivations and dialogue for his wife and the kids’ parents, I guess. Apparently the neighbors just sit by and smile while their kid messes up the garden, breaks into things, and steals dolls…and his wife likes it I guess? And that is why she invites these neighbors over. Idk.  There are so many holes in this story.", "You are both wrong it's miss the forest through the trees.", "ESH.", "Kid jumps the fence and doesn't listen to instruction. You losing your shit at a little kid? YTA. Get it together man. You have a range of tools accessible to you as an adult to handle a 4yo. Next time yell at the parents", "ESH. You don't scream at him, you simply be *extremely* verbally firm while physically removing him from your home. Scream at the parents, then call CPS because there's a very high chance this behavior is a result of some serious stuff going down behind their closed doors", "NTA. Normally I would say you were wrong to yell at a 4 year old and make him cry.  But this kid and his parents need a reality check.  With any luck, his parents will keep him away from your home and family, and he’s so young he won’t remember why, he’ll just remember he doesn’t want to mess with you.", "Yeah. This info is pertinent.", "Apologize and build a better fence.", "The kid literally climbed over OP’s fence to reach OP’s daughter. The only way to keep their children away from the neighbors kid would be by OP/ OP’s wife keeping their kids inside or monitoring them, or even limiting their outside time.\n\nESH.", "Simply pick up the child and bring him back home. Not difficult."]}