{"id": 18152, "submission_id": "13rkcb7", "title": "AITA for putting a padlock on my bin?", "selftext": "\n\nI live in the UK in a block of flats. There are 9 flats in total.\nThere are 9 green wheelie bins (outdoor trash cans) so one per flat in the block.\nI was getting really really annoyed because there was never enough room in the bins for my rubbish. Eventhough each flat has a bin, they were unassigned and people would fill up theirs and then chuck stuff in a random bin.\nAll the other flats have families of four or more in them and in mine it’s just myself and my wife and we don’t produce much rubbish at all.\nThe bins get emptied once every two weeks and usually by the time we have rubbish to take down, the bins are full and we have to wait for the council to empty them.\nI was incredibly frustrated about this as I wasn’t getting to use the bin we paid for and would often have to keep bags of rubbish in our flat until space became available which is unhygienic.\nI contacted the landlord and he added numbers to the bins and then told everyone they could only use their assigned bins.\nThis still didn’t work. So I then asked if I could drill a hole in the lid so I could add a padlock to keep people out of my bin, the landlord said yes so it was installed.\nA neighbour came round and started complaining that I had locked our bin because now there is no space for their nappy waste (they have a new baby) and they want it out of their flat. They said I was being selfish because they shake my bins and can feel they are only half full by the time the council came to pick them, which is true but it’s my bin and I’ve had to deal with not having room in my bin for my stuff too.\nApparently this has affected all the flats as they have been using my bin as overflow because they all always fill up their own bins really quickly.\nI told them it’s not my problem, it’s my bin and they will have to find out a way to either cut down on their waste or find a way to dispose of the excess.", "created_utc": 1685027493, "permalink": "/r/AmItheAsshole/comments/13rkcb7/aita_for_putting_a_padlock_on_my_bin/", "score": 387, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I think I could be the asshole because I technically don’t need all of the space in my bin and it does mean that some families with young children could be left with unsanitary waste in their homes.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA I have lived in an apartment where all the bins were available to every apartment, and it was an absolute nightmare. Had similar problems finding space for my rubbish. You got permission to padlock it. They need to deal with their waste.", "NTA. you went through the appropriate channel and received permission to put the padlock. if they don't like it, that's their problem. they sure didn't care when you didn't have anywhere to put your waste.", "NTA.  Suggest to your neighbours that they pay for a larger bin.", "NTA at all also from the UK just ignore them, they need to request/pay for an extra bin as they make two bins worth of waste. Plenty of people where I live have done that because they have kids and make a lot more waste. They're just mad they're experiencing the issues you've had to put up with.", "NTA\n\nWe have a is 3-4 universal trash bins that get emptied weekly. \n\nThe problem is that not does maintenance uses them to clean out the apartments, we also noticed people from other places dumping their trash in there for free.\n\nIt gets so bad that no one can use them because it's full of construction stuff that's not from our apartment and other things. We found out that it was a bunch of families in the apartment that was telling their family to dump their stuff in our bins for free. \n\nIt took reporting the issue to get the people to stop. \n\nSo yeah, you're not their overflow because they're wasteful.", "NTA, and I'd tell them that their issue and perhaps a cloth diaper service with pickup and dropoff might be more of a solution for their issue.", "The most British AITA I've ever read. \n\nAnd, nah NTA. \n\nThe state/frequency of bin collection isn't your fault. They chose to have the baby.\n\nThe cheek of coming round to complain. I could never", "NTA \n\nYou are not Xzibit.\n\nJust because your bins like trash is no reason for someone to put trash in your trash. \n\nNo, Dawg. No.", "NTA. Your neighbors are entitled AHs that expect you to subsidize their need for extra bins. Nope - if they want more bin space, they need to pay for it instead of stealing yours.", "NTA", "NTA. You pay to use the trash receptacle, and if they fill it with their rubbish, you can't. \n\nIf that means that they need to order another bin, that's what they should do; but they aren't entitled to fill yours, too, just because you aren't using it all.", "NTA. Your neighbor is an entitled crybaby. It isn't your problem that they don't have any place to put their used nappies. Good idea locking yours up :)\n\nETA: What weirdo would shake a bin to see how full it is, lol. Circling back to entitled crybaby :D", "NTA\n\nI moved out of my flat at the beginning of this year and the thing I hated most out of the whole time being there, was the bin situation (Also UK).\n\nThey just need to start properly separating their recycling and waste or cut down on the amount of waste they're creating. \n\nA new baby isn't an excuse either, I have 3 kids (2 still in nappies) and I still don't overflow my bin. - although the bin men where I am are somewhat lenient with an extra bag from Nappies if explained to them.", "NTA\n\nIf you’re feeling neighbourly (and there’s space in your bin)  MAYBE take the lock off the night before garbage pickup so the extra space can take away some of your neighbour’s garbage \n\n\nAlthough this might just add fuel to an already petty shite fight with your entitled neighbours. Just a thought \n\nSeparate note.  They have A LOT OF NERVE to complain about having to store their garbage when they had no issue with blocking you out of your bin with their trash.", "NTA. Locks are great.", "NTA.  This is not your problem, it is the landlord's problem.  I just read in the comments that your neighbors can pay for an additional bin. So it is really, really a neighbor problem.", "NTA.. I get it. But there came a time I didn't have enough bin space for compost... And I used the others nearby. Even with ones consent. Give and take... But it sounds very one sided in your situation. F#ck them!!", "NTA but this is the most british AITA I have ever read. Bin drama. BIN DRAMA. Incredible.", "YTA, if they're unassigned it isn't \"one per flat\", it's just they've decided the block needs this many bins based on tenant numbers and the 9 for 9 is probably coincidental. It's not your bin either so you probably aren't even allowed to padlock it. The landlord has already numbered them for your benefit, there's not much more you can do. Just take your rubbish out on the day it gets removed/day after so the bins aren't full and accept it's part of flat living.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n\n\nI live in the UK in a block of flats. There are 9 flats in total.\nThere are 9 green wheelie bins (outdoor trash cans) so one per flat in the block.\nI was getting really really annoyed because there was never enough room in the bins for my rubbish. Eventhough each flat has a bin, they were unassigned and people would fill up theirs and then chuck stuff in a random bin.\nAll the other flats have families of four or more in them and in mine it’s just myself and my wife and we don’t produce much rubbish at all.\nThe bins get emptied once every two weeks and usually by the time we have rubbish to take down, the bins are full and we have to wait for the council to empty them.\nI was incredibly frustrated about this as I wasn’t getting to use the bin we paid for and would often have to keep bags of rubbish in our flat until space became available which is unhygienic.\nI contacted the landlord and he added numbers to the bins and then told everyone they could only use their assigned bins.\nThis still didn’t work. So I then asked if I could drill a hole in the lid so I could add a padlock to keep people out of my bin, the landlord said yes so it was installed.\nA neighbour came round and started complaining that I had locked our bin because now there is no space for their nappy waste (they have a new baby) and they want it out of their flat. They said I was being selfish because they shake my bins and can feel they are only half full by the time the council came to pick them, which is true but it’s my bin and I’ve had to deal with not having room in my bin for my stuff too.\nApparently this has affected all the flats as they have been using my bin as overflow because they all always fill up their own bins really quickly.\nI told them it’s not my problem, it’s my bin and they will have to find out a way to either cut down on their waste or find a way to dispose of the excess.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA", "NTA. They need to talk to the landlord and ask if they can get bigger bins or maybe jointly pay for an extra bin for their overflow. Your bin is your bin and they're not entitled to fill it.", "NTA. If their bins aren't big enough, they need to approach the council (or whoever) for a second wheelie bin or a bigger one.", "Definitely nta but damn I can't believe your garbage is only picked up every 2 weeks. I'm American, home of the waste,  and ours is picked up 2x a week.  Can't imagine having to hoard trash like that.", "Yeah, I’m just glad my landlord let me make the changes to help the situation. They can always pay the council for an extra bin but they don’t want to because they haven’t needed to before, I reminded them that they have needed two bins all along, they were just treating mine as their own", "I have too. But it was also my job as the live-in/on-site janitor to manage all that mess. Shift the full ones to back, bring the empties forward, make sure everything fits and lids are closed at all times (for smells/hygiene and because my city wont pick em up if the lid doesnt close), and even packing any extra into industrial garbage bags, the only acceptable solution when your bins are full.\n\nNot exactly sure how all this works in OP's area, but part of this would be on the landlord over here.", "My UK flats just have a bin shed and it's all communal.", "It’s even more frustrating because non of them utilise the space well. We have separate recycling bins that are mostly empty and they put their cardboard boxes from Amazon in the general bins WITHOUT BREAKING THEM DOWN. No wonder they fill up their bins so quickly", "Yeah this is a very British dispute", "Yeah I mentioned this in a comment above but we also have a recycling bin each and all the other ones except ours is practically empty. They put all their un broken down cardboard boxes in their general waste and then get confused why they fill up so quickly", "Yeah, if it was once in awhile I really wouldn’t mind people using my bin. But it’s every time and I wouldn’t even be left with enough space for my own stuff", "You must not have read the whole thing, the landlord provided a bin each, once it was brought to their attention that it was causing us issues, they put numbers on them and told people they could only use theirs. That didn’t stop it so the landlord said I could put a lock on it because it was my bin", "Tell me you didn't read a word in the post without telling me. Lol", "Mom signed up for a trash service that picked up trash and recycling weekly where the rest fid recycling every other week. She really needed a smaller trash bin and bigger recycling bin", "My old flat had that, it wasn’t too bad actually because the landlord bought four massive ones for one block of flats so there was always loads of room", "Hope it's big enough for all waste otherwise that sucks.", "Idiots", "Yeah, I wouldn't let them near a bin", "I live in an apartment building with trash chutes. I see your boxes not broken down and put in trash instead of recycling and raise you boxed shoved down and blocking the trash chute", "Also just using words like \"bins\" and \"nappies\". But yeah, I'm a Brit, who has been living as an immigrant for 20 odd years and the whole \"one bin per household collected once a fortnight\" sounds fucking ridiculous", "Be petty. Distribute any unbroken down boxes between the other bins (unless you know who they belong to). Otherwise, they will just keep doing it. Or lock your recycling too. \n\nYour situation would drive me nuts, I'm sorry you have such AH neighbours.", "And people need to be conscious of how much waste they are producing!!!", "It absolutely is, and I kind of feel bad because realistically it isn’t enough space for a large family for two weeks but I also need to throw stuff out and if I have to lock a bin to do it then 🤷🏼‍♂️ I can’t force the council to change to rules I just have to do my best with what I’ve got", "Not your problem and you're not TA. Your bin is your bin not the overflow bin. Everyone else could chip in together to pay the council for overflow bins, or get their own second bins. You just (smartly) decided not to pop out any sprigs lmao", "Don’t you have recycling bins? I bet they’re just chucking in loads of stuff that either could be recycled or stuff they should really be taking to the tip if they’re filling up this quickly.", "NTA Don't know if your council is the same as the one here but if you have a baby you can apply for  a second bin for free as they recognise that babies generate and astonishing amount of waste.  They will allow it up to the age of three if memory serves.  Might be something for your neighbour to look into, it isn't widely known even here as the council doesn't advertise it, this is Scotland though so it could be a Scottish only thing.", "NTA it really sounds like they are not bothering to recycle anything much. Obviously nappies cannot be recycled, but a baby does not get through a whole wheelie bin's worth in a fortnight, not even two babies would do that. I speak from experience. Plus they could always switch to cloth nappies.", "NTA that's your bin full stop. If they need more space green bins are like 20 euro at the shop.", "NTA \n\nIt’s yours, and people making you unable to use it because they put their trash in there isn’t okay. The fact that the neighbours felt entitled to it and COMPLAINED is ridiculous, especially since they don’t seem to have asked you before if you agreed for your bin to be the overflow. If they had, maybe you could’ve maybe come to a system together that works for everyone (or not, which would have been 100% your right still and NTA for), but since they didn’t and just assumed, they can figure it out on their own. It isn’t your responsibility.", "NTA and they can pay to take their trash direct to the tip or keep it in their house just like you were forced to with yours.", "My oldest son is mentally disabled and in nappies, so our rubbish bin fills up way before the next rubbish day. I simply take the excess rubbish bags to the local tip instead of using the neighbours bins", "NTA\n\nYour bin being half empty doesn’t mean it’s space for them to claim. They need to pay for an additional bin for their trash or pay the difference for a larger bin.\n\nSuper pleased to hear that your landlord has actually been reasonable about this by officially assigning bins allowing you to put on a padlock.", "NTA.  Tell your poopy nappy neighbor to request and pay for an extra bin from the landlord.", "NTA. Most councils will provide an additional wheelie bin or 2 if needed, sometimes for a small charge, sometimes not. Tell your neighbours to contact the council for an additional bin.", "NTA. Most councils will provide a larger non or an extra one at a charge. They can pay for the extra space.", "NTA\n\nI wouldn't even give this situation a second thought. From what I can see, this is already solved. All you gotta do is let everyone complain until they finally shut up.", "NTA, but as a compromise, tell your neighbours you'll unpadlock your bin on the afternoon before pickup, so they can use what space is left then.", "NTA. They can request larger bins from the council or an extra bin but they probably don’t want to pay the cost well that’s on them.", "NTA. End of.", "NTA. They can pay for an extra bin if they need it.", "NTA\n\nMan, people can’t even use their own bins now? Ugh. You’re clearly NTA.", "NTA. \n\nJust a thought on the diaper situtation neighbor. Out of kindness, you could offer to let them fill up the rest of your bin with their diaper trash on trash day. That way all the trash is still out of your place but then they can still get rid of some of their overflow.", "Plus if you have two children in nappies, most councils will give a second bin for free.", "I’m in Scotland so I’ll look in to it!", "Ours is Australia was picked up once a week with the recycling (paper/all other recycling) alternating weeks so you always had two bins to drag out. Where I live now it’s twice a week. But I wish it were more. Summers are brutal here and the trash sitting out just for a day is horrible.", "We get trash pick-up once a month, compost pickup twice every month. Recycle plastic, glass, paper and metal. Two person household. Bins never full on trash day. We actually considered the option to only have trash pickup every other month, since it is cheaper.", "it's become the standard in the UK and is q frankly a fucking nightmare but what can you do?", "Its important to read", "The issue is is when I did that, as soon as the bins were emptied in the morning, someone would go out and put more stuff in them. So it’s something I would be happy to do but these heathens don’t even let me blink before they have more rubbish", "Do you guys have recycling bins/service too? (Often recycling stuff takes up a lot of room, that’s why I ask) \n\nThis seems to be a landlord issue. If the bins don’t last 2 weeks for families, then the landlord needs to figure something out. It’s unhygienic for any renter to store trash in their apartment like that.  \n\nYou did nothing wrong, but perhaps all of you need to go to the landlord with this issue and get it addressed.", "Don't you have to unlock it the day the bins are collected anyway?", "In the UK for some reason houses have mandatory recycling into cardboard, plastics+glass, composting and general waste but if you live in flats then it's general waste bins only.", "Idiots who don't care about the planet.", "We have a whole other 9 bins for recycling, those are empty, except for my recycling. They really don’t utilise the space well, which I have pointed out", "Upsetting!! Maybe you should explain recycling to them!!!!\nMy area only collects the bins every 4 weeks and ours is never full because most things go in the recycling", "After the holidays my neighbors with the big family and tons of visitors fill up their bin pretty quickly. Even if I have family visit I almost never fill up my bin. You know what my neighbor does? He asks if it's ok to use my bin. That's what they should do instead of being entitled to your bin.", "Nta. You pay your council tax for this. They need to look into reducing the amount of their waste and recycling where possible", "NTA and if you fill a standard bin like that to overflow in 14 days, even as a family of four, then you are being incredibly wasteful.", "My Council will allow you to buy their own specially marked bin bags for “overflow”. You can’t just use any old bin bag. They will only take the Council bin bags. But you CAN get them by visiting the Council offices plus the designated offices (libraries for example), or ordering and paying for them online.\n\nIt might be worth your neighbours seeing if your local Council provide a similar service.", "NTA. Is there a recycling centre nearby that you can use? Can your landlord request kerbside recycling for your block? There would be enough space in the wheelie bins for landfill waste if everything that could be recycled was in the recycling bin.", "NTA, not by a long shot", "NTA. They screwed you out of using your own bin for ages. It’s their trash so it’s their problem. How can they not see this??", "NTA and the joys of the cut backs on the bin men. It's your space, there's no reason for you to suffer because they or the council can't get it right.\n\n \"Oh so if I let you put your nappys in my bin, can I bring my overflow garbage to be kept in your flat?\"", "NTA. This is funny.", "*Tough shit..  NTA*", "NTA, Tell them to buy a waste compactor.  I used to live in an apartment (states) building that had 4 apartments and 4 trash cans--they were always filled.  I didn't generate that much trash because I lived by myself--but I hated the smell of garbage.  I complained to my landlord, she put in compactors in every apartment and bam no more issues.  They were great.  The even had air filters built is so you wouldn't smell anything.  I went from having trash 2-3 times a week, again I hated smells, to 1 every 2-3 weeks.  There is nothing like taking out this perfectly square cube of garbage.", "NTA\n\n\"I pay for my bin and waste disposal. If you need it picked up more often, then you should ask the landlord to increase the frequency of pickup or you should buy more bins\"", "NTA I think you handled really well and I'm glad your landlord helped. They either need to get bigger bins or recycle/waste less. Either way it's not your problem.", "NTA, but check out your local council's website, because it may be possible for your neighbours to get larger bins (if the storage space at your flats allows). I know that a bunch of the houses on my street have larger green wheelie bins, and a few have smaller narrow ones.", "NTA Sounds like your neighbors should pool their money and pay for an extra bin to share. Either that or work to figure out how they can reduce the amount of waste their households produce (reduce, reuse, compost, recycle, switch to products with less packaging, etc). Either way, not your problem.\n\nItems being over-packaged as a marketing ploy really needs to be regulated more.", "NTA, they can request larger or additional bins for a fee from the council, it’s not on you to accommodate their waste.", "NTA in this specific circumstance. Although I’d like to add that doing things to ease the burdens of others is usually the best course of action.", "NTA I used to keep my bin on my patio during the week for this exact reason.", "NTA. I don't think I need to explain why.", "Why should they? That neighbour’s excess waste is not OP’s problem", "I probably would have let them use it if they asked nicely, however the ones with the baby were the main rude ones about it and I’m not really in the mood to “roll over” to them now. As a matter of principle I refuse to reward rudeness so as soon as they started saying I was being a dick instead of politely asking, they lost all hope in my mind", "I assume you remove the lock on pickup day, so you COULD tell the neighbors that it would be unlocked then, and they were free to use whatever empty space was left.  But on pickup day only.", "If they have the option to pay the council for a second bin, I'd print off the application / web address where they can apply and hand it to them when they ask. But I'm petty like that.", "Yeah, my old flat had that. It worked pretty well, for the most part, and I guess a more efficient use of space than lots of individual bins.", "My recycling bin was a plastic bin from Walmart because the official city one got stolen.  And the first Walmart bin.   \n\nThen I wrote my address on the second Walmart bin with a black sharpie.  It stayed.  But my inbred neighbors would chuck their dirty \"recycling \" into my bin and get it tagged.  Like, 2 inches of chunky milk in the milk gallon dirty.  \n\nAnd the city charged for bags and that ate into drug money so everyone was incentivized to recycle .\n\nJust the tip of the iceberg there.  So stressful living in the hood.", "Not necessarily a landlord issue.  Some people just produce massive amounts of garbage somehow, and often these are the same people that can't be bothered to either break down cardboard boxes, or at least fill them with garbage before sticking  them in the bin.  The bins are likely a perfectly reasonable size.", "Try living in my part of the UK - black rubbish bins are only collected once every three weeks!!!!!! As a single person household I'm all good, but the house up the road with 2 in nappies??? It's not even about the space, but also the hygiene of 3-week old nappies waiting for collection.....", "If 8 out of 9 households need more non space, and all 8 are 4ish person households, it’s likely a landlord issue.", "Certainly not universally true, having lived in flats in the UK...", "Or even their own convenience since they then don't have space for the rest of their garbage.", "When people choose to put cardboard boxes in their bins without even bothering to break them down or at least stuff them full of trash first, it's a behavioural issue.", "Oh sorry, I'm my area it's definitely something I've noticed in the north west but Im only speaking from own perspective and I do live in a house just near lots of flats and apartments and visiting friends and family in them. That's good, I've no ideas why they only seem to use general bins at the flats round here then", "That sucks, I was annoyed enough when we didn't get a brown bin... I guess it's about what landlords or management organise in individual cases?", "I thought so. They just can’t be arsed to sort it out. It’s not your fault that their bin is full of beer cans and bits of old carpet. I’d keep the lock.", "Ah, well. No sympathy from me, then!\n\n(I feel like I may have reached peak Brit with this comment...)", "That wouldn't fly where I am - the bin men put tape round your bin telling you off, and you can get in trouble if you continually put recycling straight in the rubbish bin..."]}