{"id": 18191, "submission_id": "13s1k8c", "title": "AITAH for not taking care of my sick \"husband\"?", "selftext": "Hey all, thanks for the read, let get into it. Me (34f) and my husband (34m) are getting divorced. We are almost done with this process and it has been contentious. We have been living separate for over a year. Recently he got a stomach bug. He was struggling to care for the children on his days. Thursday he called my mother who went over to care for him and the children. I had the children on Friday as planned. He called me Saturday morning and told me he was still unwell. I offered to trade future days with him but he did not want that. He stated it was my responsibility as his legal wife to go over to his house and care for him and the children. I honestly laughed because I thought he was kidding... he was not. I told him I will keep the children if it would help but otherwise it was not my issue. He told me this is why I would not be able to have a successful relationship because I am not able to give of myself for others. I thought I was in the right but my parents took his side and were actually mad at me for \"letting him suffer\". But he had a flu, which sucks but is not overly serious. They are not talking to me ... aitah?", "created_utc": 1685070440, "permalink": "/r/AmItheAsshole/comments/13s1k8c/aitah_for_not_taking_care_of_my_sick_husband/", "score": 259, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1 I refused to go over to my soon to be ex husband's house to take care of him when he had a flu.\n2 it was my responsibility as his legal wife to help him in his hour of need.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "I'm dying over here 🤣 He's separated and soon to be divorced and on his own - welcome to the big time dude. \n\nYour parents? That's the real mystery. I'd ignore them all. NTA", "NTA but your parents sure are! So sorry. Obviously, he is incorrect with his demands of you. Congratulations on almost being divorced!", "NTA\n\nYou offered to take care of the children if he couldn't. That's the most you can do. He needs to learn to take care of himself. I don't understand your parents though. Were they, generally speaking, unhappy with your decision to get divorced? I see that your mother is still in contact with your soon to be ex husband, and willing to help him out.", "You have a legal (and a moral) responsibility to... take care of your kids. That does not extend to the soon to be ex.\n\nNTA.\n\nI also share your amusement at his statement.", "NTA. i can see why you divorced him lol", "NTA\n\nHe can figure out how to survive the manflu on his own after being such an AH that he drove you away \n\nIf your mom is anything like mine she’d want me to stay married so I wouldn’t become her responsibility. Lol! That would never happen", "Info:  Are your parents still married?    \n\n\nBecause to meeeeeee, it sounds like they are siding with \"tradition\" and \"traditional roles.\"", "NTA\n\nI really want to say everybody sucks here because this sounds awful and petty, but you offered fair alternatives and have no responsibility to care for him.", "Sorry, having a hard time believing your parents are mad at you for not caring for your soon to be ex husband. Is there some weird family dynamic I am missing here?\n\nNTA anyway.", "NTA. If you had any sort of doubt about the divorce, they should be gone now. “Legal wife” sounds so medieval.", "Good lord, no wonder you're no longer with this guy.  And since you're asking, no it is not the one-year-separated, soon to be ex-wife's job to trundle over to her ex's house and make him chicken soup due to the fact that he has a minor illness and demands a mommy.  \n\nAs for your parents, I assumer they want you to get back together with him and the silent treatment is their brand of emotional blackmail.  You know, let them go over and take care of him.  And lucky you, you don't have to listen to their carping!\n\nTake your kids back to your house, let your parents know that your relationship with your soon-to-be ex is completely over and you won't be doing anything else for him, and if they want NC with you, keep up the silent crap and they've got it.\n\nNTA!", "Why are you letting him guilt trip you? He's a big boy! He can call his own mommy to take care of him!\n\nNTA", "NTA/INFO\n\nDo you think he really has the flu? \n\nIt's odd that the divorce has been contentious but he's still calling your parents and you for personal help.\n\nDo live on your own or with your parents?", "Sounds like you might need to divorce your family too. You’re not the arse.", "NTA. Taking care of the kids is probably best for all involved, but taking care of him after a year of separation is obviously ridiculous. If your parents love him so much, they can go take care of him.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nHey all, thanks for the read, let get into it. Me (34f) and my husband (34m) are getting divorced. We are almost done with this process and it has been contentious. We have been living separate for over a year. Recently he got a stomach bug. He was struggling to care for the children on his days. Thursday he called my mother who went over to care for him and the children. I had the children on Friday as planned. He called me Saturday morning and told me he was still unwell. I offered to trade future days with him but he did not want that. He stated it was my responsibility as his legal wife to go over to his house and care for him and the children. I honestly laughed because I thought he was kidding... he was not. I told him I will keep the children if it would help but otherwise it was not my issue. He told me this is why I would not be able to have a successful relationship because I am not able to give of myself for others. I thought I was in the right but my parents took his side and were actually mad at me for \"letting him suffer\". But he had a flu, which sucks but is not overly serious. They are not talking to me ... aitah?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA at all🤣 I'm dying at what a baby he is though🤣 either way I would definitely get the kids so they don't also get sick", "What a clown.\n\n\"I have testicles, and we aren't divorced yet, so it's your responsibility to nurse me back to health.\"\n\nIMO, you had a major obligation to your children to demonstrate your soon-to-be-ex is full of it. NTA by a long shot.", "NTA", "What?! No. You are fine here, you are establishing and defending reasonable boundaries around your time and sanity that will be necessary to preserve this ongoing (if not marital) relationship. Your parents are wild though and your ex has a lot of nerve. NTA.", "NTA - except to say this is why we don't allow children to make legal decisions like getting married. You married a child.", "NTA and I would utterly refuse to sent the kids over there if he was so unwell he was unable to care for himself, let alone your kids.\n\nThe fact ~~his~~  **YOUR** mum was there to care for him, shows he shouldn't have the kids.\n\nETA.. wtf is your mum doing over there.", "NTA, once the paperwork is started you are legally separated.  You owe him nothing.  IF you mom and dad give you crap ask them if they feel he has the right to force you to have sex with him as well since your are \"Still Married\".  That should shut them up.", "Yes my parents, they are struggling with the divorce apparently. They always tell me that they really love him and hope I come to my senses.", "Yes they were, they don't believe in divorce. I don't mind them helping him also. It's what's best for the kids and I try to protect them at all costs.", "Yes for 41 years. My mom took my leaving a little extra personal, a lot of the things I said I couldn't live with my dad also does to her. (Nothing crazy, but disrespect and high domestic expectations mainly). She said it felt like an attack.", "Everybody sucks except OP.", "My parents are old fashioned and don't believe in divorce. I have a career I love and they think the separation is because I won't give up my ambition to be a homemaker... its complicated.", "I try to stay low contact so I'm not sure if he was very sick. I moved out to an apartment, I was never sure my parents home would be a great place for my mental well being.", "Omg! Your parents need to get on board and support YOU.  They are the A**holes in this if they don’t.", "Well they can go over & baby a grown man with a cold 🤦🏻", "Their feelings are their's to manage. Stop worrying about their unhappiness and focus on what's best for you. You got this mama!!", "Time to go no contact with them for a while as they seem to love him more.  Let them know that since he is their choice they can see the kids when he has them.", ">they don't believe in divorce.\n\nThere you go. They are always going to judge you for making this decision and berate you for not fulfilling your responsibility towards your husband. I only hope they don't get too difficult to deal with in the future. When my mom wanted a divorce, my (paternal) grandparents, who were very \"traditional\", would say all sorts of horrible things about her in front of me and my brother. I do hope your kids never have to go through that.", "Good thing it's a fact and doesn't require belief.", "No, see it’s the flu! That’s basically like dying. Or so my husband acts.", "If they tried that they would no longer have access to my kids... I have gone to extreme lengths to protect my children.  No one gets to be as important as them.", "Bahahahahaha omg thanks I needed the laugh. When he said you were still his legal wife and you owed him I literally fell out of my chair. This man is excruciating, congrats on your divorce. You weren’t required to care for him even when you were still his wife. It’s a nice thing to do for your partner, and most people wouldn’t think twice, but it’s not an actual requirement. The only things you owe this person are the things that come out your custody order. NTA and your ex is ridiculous", "NTA\n\nTell your parents that if they think a grown man needs caring and coddling from someone, they’re welcome to go and provide it for him.\n\nI. Honestly. Can’t. With this.", ">He told me this is why I would not be able to have a successful relationship because I am not able to give of myself for others.\n\nPlease throw a divorce party once you get rid of this asshole. Thank you.", "OMG NTA.\n\nI'd tell him that if he's so sick he can't take care of himself or the children, you'll be right over to pick them up and you can call an ambulance for him to go to the hospital. And tell your parents they're welcome to go wipe his nose and sing Soft Kitty for him if they want, but you've got ACTUAL children to take care of.", "NTA one must give of themselves only to the worthy.", "NTA. What a whiney little misogynistic AH he is. He expected his soon to be ex-wife to take care of him because he has the sniffles.", "Why are you divorcing?", "NTA and your parents and him are being ridiculous. He's a grown man and he has the flu. He isn't dying. You offered even to take the kids. No more should be expected.", "Congratulations on getting away from this nonsense.  \n\nNTA", "Wtf. NTA. \n\nBaby's gonna baby.", "NTA... Not sure what culture that is, but it's a funny one. Once you are separated you lose privileges.  You extended the kindness of covering his parental obligations", "Good heavens it’s the stomach flu or flu , he has ,t broken his back or lost a limb.  Your children are your responsibility not your soon to th ex who has a stomach bug.", "Your parents backing him is not unusual. Keep a big distance from all of them. What a bunch of cookers", "Think the parents don’t support the divorce and think this’ll help push them back together.\n\nNTA- you’re getting divorced- he is no longer your responsibility. Not your circus, not your monkeys. What At idiot.", "I, too, am amused by his blatant audacity", "It sounds like a possession. ‘This is ‘legally mine’. Yeah no. Good for you kicking him to the curb. Your mom is just upset because you had the guts to actually put your foot down and stand up for yourself. It’d hard seeing others do something you know you never could.\n\nNTA- you’re essentially divorced. He’s no longer your issue. Your parents need to get caught up and get on your side or they need to butt the hell out and kind their own business.", "The flu/hungover...tomatoes/tomahtoes.", "She's not letting him guilt trip her. He's attempting to guilt trip her and keeps expecting the womanly (emotional) labour he assumes he's entitled to.", "He seems to confuse legal wife with legally owned property or slave.", "They might think this is ok though because tradition.", "Mostly because of disrespect. He liked to call me trash. I knew I had to leave when my children started to repeat it.", "Maybe your parents should marry him. He's gonna be single soon, so he'll be available.", "Misery loves company.", "Nice of her to make *your* divorce all about *her.*\n\n/s obviously lol", "Apparently, it is a non-contagious flu as your mother and children have been unaffected. \n\nGood for you for getting your own place.\n\nFrom his statement, it sounds like you made a good decision about the divorce.", "I was wondering as well since no one was worried about him being contagious.", "I would delete this comment and add (edit) your first comment. ESH is what you want to post but... not the OP.  So she's NTA.", "They sound “fun”", "Good job on setting a better example for your kids. Especially after seeing the trash comment you made ick I’m glad you got out of that situation. Enjoy not having to deal with him much anymore. Sorry your mom is bitter she didn’t have the guts to stand up for herself if she was unhappy in her own marriage.", "They did.. \nShocking how OPs MOM went to care for him...", "This is my only comment on this post.", "My first question is why are you guys getting a divorce? Did someone cheat?  \n\nHe definitely should not have asked for help how he did. As the father of your children, you might want to ask him if he needs you to bring over soup and Gatorade. That way you are the better person. He might take this kind gesture with a grain of salt and start making your divorce easier. You also want to look good in your children's eyes. I know that these days you can order stuff from the grocery store quite easily. Remember you don't want to mess with karma because it will always come back to bite you in the ass.", "Yta", "This was one of those cars where I thought 'I Brett there's something buried in the text that makes me flip my initial judgement over', so I re-read it, and nope, still NTA.\n\nOP has no imperative to look after the sick husband. The relationship is over, the divorce is merely the formality of recording it.", "NTA and uggghhh no wonder you're divorcing him he sounds intolerable.", "Even if you were still in the house you are not legally obligated to take care of him lol.\n\nI once let my ex husband (separated not divorced) stay in my basement when he was stuck and he complained that I didn’t cook for him.\nI told him he had mistaken me for his wife", "Man, what's with all the disobedient ex-wives these days?!\n\n/s. What a ridiculous, desperate expectation. NTA.", "OMG NTA. he's an asshole for thinking his being sick is YOUR responsibility... it's NOT.", "NTA! As you said, the ‘flu. You offered to keep the kids so that he can focus on himself, but you can’t do both, and it would be a much bigger problem if the kids got illl as well. So keep the kids, buy him groceries, make him chicken soup, but it’s as far as it needs to go.", "NTA", "NTA", "Lol omg. NTA. Anyone who says otherwise is just plain stupid.", "NTA", "NTA\n\nI bet he expects you to look after them with zero help when you're sick, doesn't he?\n\nMy ex decided to bring our kids home on day 3 of 5 last Christmas, because he had the sniffles. I had a chest infection, sinus infection and mastitis but still had to find a way to manage. I'm also single, whilst he's remarried so he actually had help with the kids whilst I didn't.", "Maybe tell him you can give of yourself to others but they actually have to\nBe worthy of that gift.\n\nNTA", "That was my thought as well, that I haven't seen brought up until your comment. Why would you expose your kids to an ill person (even if it's you) when it can be avoided!?", "I don’t know that she’d want the answer to that.", "Hah. Time to leave them all to their own devices.", "Is there something wrong with your parents? Do they not realise that you're their child, not him? What a pair of AHs.", "He seems to confuse wife with nursemaid at that.", "Sis your mom’s reaction aint nothing but a Hit Dog Hollering.", "It’s less complicated than you think. It’s a generational gap you need to accept. Repeat it like mantra. They’ll never understand you or respect your choices. \n\nI’ve been going through a similar battle myself and always thought it “complicated”. Until it hit me. \n\nDon’t let them get into your head. You’re doing the right thing and your priorities are as good as they can get.", "Tell them and especially him if he wants someone to care for him to hire a nurse. NTA", "Oh God that sounds horrible.  Good job getting out against all these bad inflluneces", "Why? Presumably they know op more then you. Maybe they are right", "I feel like i would go to just see wassup but if he actually said it the way she wrote it I'd be scared but honestly if we divorced on good terms i might take care of him...its honestly not that crazy unless you were seeing soemone already then its kinda weird", "But how old can these parents be? If OP has young children - parents are probably in their 50s or 60s? Which means their adult years began in the 1980s or 1990s. It's not like they're from the 1950s.", "It's a [Man Cold](https://youtu.be/VbmbMSrsZVQ), you just don't understand, do you?", "Man flu is a real thing, it really feels like your spirit is being drained :'(", "OP said in another comment their parents have been married 41 years so mid to late 60s? 70s? That'd put them as being born in the 50s, give or take.", "It’s not about the flat out age. My mom is barely 60 years old and she might as well be raised in a little house on the prairie.", "Poor lil bunny"]}