{"id": 18205, "submission_id": "13s9bos", "title": "AITA for asking my daughter in law to cook smaller amounts of food?", "selftext": "Throwaway account for privacy reasons.\n\nI (67f) have a son (39M) who is married to his wife (39F) for almost 7 years and they have a 3 year old daughter together.\n\nI noticed over the years that my DIL cooks more food than they need and when I asked her about it in the past she says that she packs lunches the next day for her and my son the next day but it still did not make sense to me.\n\nAnyway I noticed time after time that she does not limit the amount of food portions either for my son or their daughter, everyone is free to ask for as much food as they want so I decided to confront her out of concerns about my son's health and also my granddaughter.\n\nShe got incredibly annoyed and said that my son is a grown man and if he wishes to eat less, he can do that without her having to \"mom\" him around. As for his daughter she says she is a toddler and one day she barely eats and the next asks for more and that is normal.\n\nTo that I argued that I always had a specific amount of food for everyone and that went well, she then had the audacity to say maybe that is why my son eats so fast as if the food is running away and then she started with that crap that her food is always healthy and that it is wrong to control what other people eat, and that my granddaughter and my son are actually both at healthy weight but that is not really my point. She should not let my granddaughter grow up to be greedy with food.\n\nAnyway now she is mad and saying that if I cannot keep my comments in my brain (her words) I will not be welcome to their home and managed to turn my son and my husband against me.\n\n&#x200B;\n\nSo AITA here? I really do not think so but she is.", "created_utc": 1685096810, "permalink": "/r/AmItheAsshole/comments/13s9bos/aita_for_asking_my_daughter_in_law_to_cook/", "score": 59, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1. I \"interfered\" in their business according to them\n2. I have no reason to worry about anyone's health here, and I sound controlling (according to her)\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "You don’t believe … in leftovers? \n\nYTA", "YTA. Rule one of being a good MIL: do not interfere with the way your DIL runs her house.\n\nSo she makes more food than you would. Big deal.", "YTA she's right, it's none of your business. especially how much your son eats, you can voice this concern to him directly, not to his wife as she's his mom.\n\nshe and her husband will decide how to parent their kid, not you.", "YTA. Your DIL is feeding her family using best practices based on the evidence that we know today. \n\nArbitrary and puritanical limits on food can create a lot of problems (affect growth, cause eating disorders, etc.) and is now considered a form of abuse and neglect. \n\nIt sounds like you have some unhealthy beliefs and possibly childhood trauma of your own to process that is affecting your important relationships. Your DIL is not turning anyone against you. You are not in the right here. But it sounds like you still have time to make it right before it is too late.", "Yeah YTA no question. What gives you the right to tell a grown woman how to feed her family?  She found what works in her own home, and you want to change it because…it’s different than how you do it? Mind your own business.", "YTA, Ma'am. Why are you concerning yourself with what other people eat? You don't have a right to control your son, his wife, or your granddaughter. \n\nAlso, your daughter-in-law is right: food deprivation (both in cases of true food insecurity and in cases where the child's mother had \"restrictive feeding practices\") at a young age has been linked not only to developmental issues, but to obesity (up to five times greater chances of it). This is because children learn to feel that they aren't going to be fed enough and this leads to \"problematic eating patterns\" like the \"insurance hypothesis\"--where you eat even when you aren't hungry because you worry that you may not be able to eat when you *are* hungry. Please see the full study here: [https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5398923/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5398923/) (from which the quoted phrases come from). Please also apologize to your son and daughter-in-law.", "YTA. It’s not your household, so you don’t get to decide how it’s run.", "YTA. This reads as you either looking for conflict or trying to pull some power move on your DiL. And everyone in your life can apparently see that.", "YTA most definitely! Who are you to tell anyone who much food to cook? Or to control how much others eat? Or to give anyone unsolicited advice? \n\nIt’s none of you business what she makes, how much she makes, how much they all eat, that she packs their lunches with the leftovers, or anything else that you spoke about. They are grown ass adults who don’t need you hovering over them.", "YTA. You are a mother-in-law from hell. If you had the audacity to tell me how much I can cook you wouldn't enter into my home again.", "YTA. I look forward to reading her posts on r/justnomil", "YTA. I don't know why you're complaining about how your DIL spoke to you; she was 10 times more polite than I would have been. She's right, your son is a GROWN MAN and can decide how much he wants to eat. You sound like you won't let him grow up. As for your granddaughter, that's even less of your concern.", "Haha oh wow YTA.\n\nYou are being controlling and a cliché mother in law. If everyone is at a healthy weight and they can afford the food, what they are doing sounds very reasonable. You'd really skimp on a toddler's food?", "YTA. She doesn't spend your money, she doesn't cook for you, she is right about providing enough food for everyone in the family and btw everybody is at a healthy weight. You sound like a controlling person who would project her own insecurities on others.", "Obvious YTA. This has to be a joke.", "Yta I don’t even need to explain your DIL did a good job of that. You sound like a classic Almond mom and that’s not a good thing.", "YTA. Their food and eating habits are none of your business. Everything they are doing is completely normal. \nHow on earth is eating enough food greedy? They are eating healthy food. And teaching children they can only have a set amount of food can be cause long term disordered eating and give them a bad relationship with food.", "YTA.  You are not doing the cooking; your son and DIL are adults.  Mind your own business.", "The boomer energy is so strong with this one that you could power a small city. Even Thanos was this meddlesome with his own kids. \n\nYTA", "YTA, why does it have to make sense to you? Are you buying the groceries? Leftovers for lunch isn’t weird. It smart both from a time and financial budget. And your DIL in correct toddlers eat different amounts on different days. Teaching them that they have access to healthy food and to listen to their bodies and eat when they’re hungry and stop when they are full is a good thing! And your son IS and adult and can decide when and how much and what to eat. Get a grip and stop trying to control your adult son’s household.", "YTA, but also, bait.", "YTA. And by \"managed to turn them against you\", do you mean she told them truthfully what happened? Because I heard your version and I'm still sure YTA. Mind your business, and maybe explore why you have such a controlling relationship with how and what others eat...", "Who made you the arbiter of how much they can eat?  By your own admission, their weight isn’t an issue. If they can afford the food they eat and don’t ask you for a dime, it’s none of your business. \n\nYTA", "Just admit you don’t like your DIL and move on. \n\nYTA. \n\nJust sounds like you’re upset you can’t control things in your son’s life anymore so you’re trying to find something to bitch about. \n\nLeave it alone. This isn’t about food waste or the consumption as she answered you and told you how it’s consumed and whether or not it’s healthy. \n\nThis was about you taking control. \nI highly doubt she blew up one time if she answered your question annoyed.", "YTA...it's none of your business. It's not your house. You are not in control. You need to let this go before it ruins your relationship with your family.", "YTA. You are factually wrong and a bad parent. Your DIL's approach is the one proven to have the outcomes you claim to want. Your approach causes eating disorders and obesity. \n\nYou didn't bother to check if you were right.  \n\nYou found something petty and harbored resentment about it. \n\nYou started an argument about and advocated that your grandchildren be hurt. \n\nYou implied heavily that your own children and their children are an inappropriate weight and that because of that you think they're worse people. \n\nYou should apologize and look into your assumptions or consult experts before giving parenting advice.", "YTA, and need to learn to mind your business. They are grown adults. He's not your baby to coddle anymore bfr", "YTA, not only for your comments and your belief that you had any business or reason to confront your DIL about this, but also for the way you did things in your home (outside of if there was food insecurity, and you had to constantly control everyone’s portion for those reasons). \n\nThis is not just an unreasonable and micromanaging approach, it’s one that creates a mentality of scarcity and guilt, increasing the risk of eating disorders such as BED. It’s one thing to set limits on the amount of high calorie, low nutrition snacks/ meals a kid eats, make mostly healthy foods, and generally encourage healthy eating habits (which it seems likely your DIL does), and another to monitor and control every calorie that passes their lips, and even when resources are available to prevent them from leaving a meal still hungry/being hungry soon after, denying them further sustenance than what you’ve decided (I’m assuming without any education in dietetics or metabolic data too) they deserve. What you did, and want your DIL to do, is awful. \n\nShe didn’t somehow turn your husband and son against you on this. They know how wrong it was to do what you did to your child/children (I’m less concerned about your husband, because he can make his own food, probably sneak food out of the house easily, and is also in the wrong for allowing you to do this to his child/children. I hope he at least snuck them food).", "YTA and you should stop your controlling behaviour. You are stepping into peoples personal spaces and at your age you should know better. Seek therapy.", "YTA This is literally none of your business and she is totally right-it’s not her job to police what a 40 year old man eats. Also, lots of people do cook extra with the intention of using the leftovers for lunches.", "YTA and you probably also have an eating disorder", "INFO: so what is the point of you confronting your DIL? To control the way she cooks and much just like how you did to your son? And causing him to probably be hungry on some days when he was growing up because it must be based on a specific portion you decided?", "YTA. Stop nitpicking", "[removed]", "YTA\n\n> I noticed over the years that my DIL cooks more food than they need and when I asked her about it in the past she says that she packs lunches the next day for her and my son the next day but it still did not make sense to me.\n\nWhich part do you need explained? She cooks extra for lunches. Children understand this.\n\n> I argued that I always had a specific amount of food for everyone and that went well\n\nWho asked you? You did it one way, shes doing it a different way.\n\n>She should not let my granddaughter grow up to be greedy with food.\n\nOh no. She isnt. And you can take that attitude and throw it in the trash where it belongs.", "Repeat after me:\n\n“I am the mother of an adult and I will abide by the following:\n\n1. If they want me to know, they will tell me.\n\n2. If they want my opinion they will ask.\n\n3. If they do not tell and they do not ask, I will keep my mouth shut and mind my own business.\n\nI have successfully raised my children to be kind, honorable, and to make good decisions. They know they are loved and respected. They do not  require any interference. My job now is to continue to love them, respect them and be there if they need me.”\n\nNow let it sink in. YTA.", "Ffs they’re grown ass adults they can handle that themselves that is none of your business YTA", "YTA That’s absolutely none of your business. And even if it was, I really don’t understand the problem of her cooking larger portions.", "YTA\nIt doesn't even seem you live with them or contribute to their bills, so why you are so opinionated on how your daughter in law cooks is beyond my understanding. \n\n>To that I argued that I always had a specific amount of food for everyone and that went well,\n\nShe doesn't have to do things your way. And it's kind of sad to think of your kids growing up hungry because they weren't ever allowed to have more than the portion size that you deemed fit.", "YTA", "YTA\n\nLeftovers are a thing. And it’s a smart thing thing. It’s funny how you only seemed concerned for your granddaughter and son’s health but you’re making your DIL out to be some sort of villain. \n\nI’m not sure how making enough for leftovers is considered greedy.", "YTA why are you talking to his wife like he isn't an adult making the choice to eat. Your precious little boy can't make big boy decisions? I couldn't deal with you personally, you're lucky your daughter in law is having a conversation with you and not just telling g you where to go.", "YTA I’m afraid. Your DiL is doing a fabulous job and teaching her daughter an extremely important lesson - to listen to her own body to determine whether she has eaten enough, rather than an arbitrary amount an adult has set. This in turn feeds into all sorts of important lessons around understanding her body, boundaries and consent.\n\nTrust her and your son, it sounds like they’re doing all the right things and, frankly, a lunch of home cooked leftovers from the night before sounds like the absolute jackpot to me", "YTA\n\nYour son is an adult and not a child you can parent\n\nYour granddaughter has her own parents and is not a child you can parent.\n\nCooking enough for leftovers the next day is very common, btw.", "YTA and clearly have too much time on your hands to be so concerned with the amount of food your DIL cooks. You should really look into getting a hobby that occupies your time more.", "YTA mind your own business!", "This sounds like the DIL is writing this from the mother in law’s perspective lmao. \n\nAnyway, if this is really the MIL, YTA. It’s literally none of your business how much anyone else cooks and eats and she’s actually using intuitives eating principles. She’s doing a much better job than most.", "So, I actually have some sympathy with your feelings because there's a global planetary problem with overconsumption and food waste which has environmental and health consequences. I would, personally, like it if cultural norms changed and portions got smaller.\n\nBut I'm afraid YTA. Even if they had visible, evident health problems like obesity due to overeating, or if they were eating a diet entirely made up of processed food, it wouldn't be your business but it would be more socially acceptable to be worried about it. \n\nBut it sounds like they don't, and the bottom line is that your DIL and your son are adults, and the parents. These decisions are theirs, not yours, to make. You should keep your nose out and stop interfering, if you want to keep being welcome in their home.", "YTA. Put yourself in her shoes. Imagine your MIL coming to your house and starts to criticise you about your cooking, the amount of food you feed your husband and kids, blah blah blah. Will that go ok with you? \n\nWhat is your problem? It sounded you are making a beef over nothing. I’m thinking if she makes less food, you are going to say, she’s not feeding them enough.", "TYA. Seems you need to apologize profusely. If your’re lucky DIL can teach you how to run a kitchen, because she seems to have a significantly better handle on how to do it efficiently.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nThrowaway account for privacy reasons.\n\nI (67f) have a son (39M) who is married to his wife (39F) for almost 7 years and they have a 3 year old daughter together.\n\nI noticed over the years that my DIL cooks more food than they need and when I asked her about it in the past she says that she packs lunches the next day for her and my son the next day but it still did not make sense to me.\n\nAnyway I noticed time after time that she does not limit the amount of food portions either for my son or their daughter, everyone is free to ask for as much food as they want so I decided to confront her out of concerns about my son's health and also my granddaughter.\n\nShe got incredibly annoyed and said that my son is a grown man and if he wishes to eat less, he can do that without her having to \"mom\" him around. As for his daughter she says she is a toddler and one day she barely eats and the next asks for more and that is normal.\n\nTo that I argued that I always had a specific amount of food for everyone and that went well, she then had the audacity to say maybe that is why my son eats so fast as if the food is running away and then she started with that crap that her food is always healthy and that it is wrong to control what other people eat, and that my granddaughter and my son are actually both at healthy weight but that is not really my point. She should not let my granddaughter grow up to be greedy with food.\n\nAnyway now she is mad and saying that if I cannot keep my comments in my brain (her words) I will not be welcome to their home and managed to turn my son and my husband against me.\n\n&#x200B;\n\nSo AITA here? I really do not think so but she is.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA!", "YTA. Your way isn't the only way. You have no business deciding what DIL does.", "If their weight is fine then what is your point? The toddler asking for enough is greedy?", "YTA\nFor talking to you dil like that, but also for being such a controling narcissist that you think you should get to decide what your grown son eats in his own home. \nJust don't bother them again. Maybe... just maybe... they are more adult than you, and they'll try to have a normal relationship with you after you gave them some space. If you push this, I hope your son and dil go no contact. You'd deserve it.", "YTA you sound like a control freak, the fact that even writing this you did not see that you are the problem here is even more crazy. \n\nYou are the typical : \"why my children don't talk to me anymore\" person. \n\nThey are adults you don't have a say. Period", "Yta if the food isn’t being wasted they I don’t see the problem.", "YTA\n\nThe people you are concerned about are apparently healthy weights and have been for 7 years so who the hell do you think you are to criticise her cooking??\n\nYour DiL is completely right, your son is an adult and can manage his own portions. He's not a child, stop infantilising him.\n\nYou need to mind your own business, otherwise people will think you're the stereotypical hateful mother-in-law...", "YTA. It's nunya business how much food your DIL cooks, what she does or doesn't do with the leftovers, or how much your son and their child eat. None of your business. Not your business. Not your concern. You're not the boss of them. You're not the boss of her. I'm running out of ways to say this, but you apparently really really need to hear it.\n\nNot only is it nunya business in the first place, but your DIL has very logical plans for what to do with the leftovers, and all of them are at a healthy weight, so even if it were your business (which it's not), there's nothing to complain about anyway.\n\nYou've raised at least one child to adulthood. How is it you never learned that kids are sometimes very hungry and will eat everything in sight one day, and on another day they're barely interested in eating? They have growth spurts, different levels of activity, etc. — making it a very real and solid fact that sometimes they need more food and sometimes they need less. Your DIL is teaching her daughter to pay attention to what her body needs and to eat however much food she needs on that day, whether it's a little or a lot. That's a parenting approach that should be commended, not criticized.\n\nGoing forward, keep your thoughts inside your brain, if you want to maintain a relationship with the three of them.", "YTA\n\nNo one asked for your opinion. Plus given both your son and grandchild are at healthy weights, it doesn't seem needed. You can do what you want in your house and your DIL can do what she wants. If anything, her approach has been shown to be more optimal, as it teaches people to listen to their bodies, instead of eating a given portion. Sometimes portions are too big (like in restaurants), so it's worse to rely on your approach and finish your plate.", "YTA\n\nShe’s absolutely spot on right. \nYou son is an adult, \nToddlers will eat what they need without policing\nThey use it to save time to make lunch\nIt’s THEIR home and life\n\nHonestly, your comments/attenpt at policing them was inappropriate, unnecessary, not even out of worries for their health. Pretty misogynisc too. \n\nCongratulations, you’ll never be invited for dinner at their house again", "She didn't go to your house and try to control how you eat, you should do the game. YTA.", "YTA - You are so self entitled as a grandma as to be ridiculous.  DIL isn't doing something the way that you did it, therefore she is wrong.  And since DIL is doing something wrong, you have to get her to do it in the manner which you approve. The hubris you display with this kind of thinking and resulting behavior is undeniable truth of just how self centered you are at your core.", "YTA\n\n\"Why do you make enough food to have leftovers for tomorrow's lunch? Why do you let your husband and child eat enough to get full? None of this makes sense. I personally gave my family the bare minimum and they turned out fine.\"\n\nYour DIL is trying to ensure her family has a healthy relationship with food. Yet you seem to think that's a problem. It sounds like your son is still trying to heal from your gross views on food. Stop before you give your granddaughter the same insecurities.", "YTA your method gave your son issues with food.  Perhaps try minding your own business here.", "Holy shit YTA", "YTA you think she had the audacity…. to use common sense? You have serious control issues. To the point therapy might help.", "YTA. I wouldn't be surprised if your son and husband were always still hungry after your pre-portioned meals.", "YTA Massively! The audacity to think that you can dictate how two people who are almost in their 40s (!) and a TODDLER (!!!!!) have to eat is truly breathtaking.", "YTA.\nHow have you reached the grand old age of 67 without learning how to mind your business?\nIt doesn't matter if it 'doesn't make sense to you' because YOU are neither a deciding factor or a recipient of said lunches. Your opinion here DOES NOT MATTER. It is not your house, your food, your money buying aforementioned food OR YOUR BUSINESS.\n\nJust because apparently you thought it appropriate to ration outside of wartime doesn't mean she has to.\n\nSHE didn't 'turn your son and husband against you', you ridiculous individual. Your evident and incessant need for control did.\nStep back, sit down and learn how to shut up.", "Have you never heard of leftovers? Or being free to choose how much you eat?\n\nYTA and get a reality check, limiting food is just as bad as saying \"ypu won't leave the table until you empty your plate\".\n\n>her food is always healthy and that it is wrong to control what other people eat, and that my granddaughter and my son are actually both at healthy weight but that is not really my point\n\nWhat's your point then? \n\n>She should not let my granddaughter grow up to be greedy with food.\n\nSurely this can't be your point, because\n\n>I decided to confront her out of concerns about my son's health and also my granddaughter.\n\nWasn't this your original point? Why did your point then change all of a sudden? Cause you were proved wrong and told to mind your own business and you didn't like it?", "YTA Please butt out. You had your chance to raise your family. Don't be the in-law from Hell.  It's none of your business at all. No one asked for your opinion.", "YTA. Seems that you are a control freak.", "YTA  Big time.  Keep your nose out of it or you'll get fewer visitations.  Seriously.  This is not a hill to die on.\n\nMy SO and I make big meals.  We take them to work the rest of the week.  I work in a factory  and  it's a 1/4 mile walk or ride to the gate.  My SO is a teacher.  Going out to lunch all of the time isn't in the.  This way, we have homemade meals for lunch.  We also, usually, make something big on Monday night and eat left overs Tue-Thur.\n\nIt's convenient, saves time on later days/nights, and saves money.  Kindly stop being a busy-body.\n\n>managed to turn my son and my husband against me\n\nLOL!  You did that yourself.", "YTA. Your soon is a grown ass man. If you wanted to give him some advice because you think he is not being healthy (not the case anyway) you should speak directly with HIM. How is your DIL responsible for your son’s choices?\n\nYou don’t have a say in this, they make more food to save some time the following days (a lot of people do it, it is called batch cooking) and also they can eat whichever amount they please and it seems it is not an excessive one since they are healthy.\n\nYou should go to therapy and mind your own business.", "YTA.\n\nYou are just trying to control what they do based off your opinions, which dont matter here at all. Stop tryna cover that up with the \"worried for their health\" bullshit.\n\nJust because something isnt how you like it does t make it wrong, Mind your own damn business.", "YTA. Using leftovers for lunch is a totally normal thing. It's budget friendly and cuts down on work for her as she doesn't have to make another meal.\n\nYour son is a grown ass man. His health is his responsibility and he is perfectly capable of managing his own portions.\n\nAs for your grand daughter, your DIL is setting up a healthy relationship with food. Pediatricians and pediatric nutritionists recommend exactly what she is doing.", "YTA.. mind your own business and stop  interfering. I’d march you right outside and slam the door in your face. Congratulations on ruining your relationship with your grandchild!", "YTA. I would never have answered these questions. I would have just ignored you. What a respectful DIL you have who cares so well for your son and granddaughter. Go apologize and stay out of how she runs her home. In my home, the person who cooks is never insulted in any way. You run your home how you want and she gets to run her home how she wants.", "Why did you confront her and not your son?  It's his child too.  He's eating the food.  You just sharked in on your dil.\n\nNo soup for you.  YTA and butt out.", "Yta and your way leads to major issues around food", "YTA, that is exactly why your son eats fast. Keep your weird food bullshit to yourself.", "YTA, just quit being a diva. People have left overs ok?\n\nTriggers me ao bad because once i got shamed for giving my daughter food that was cooked the previous day.\n\nLike get bent with the holier than thou attitude.", "YTA and more you crazy lune", "YTA this isn’t your business", "Your daughter in-laws uses lefts overs for lunch... the AUDACITY /s\n\nYTA", "YTA. She literally told you exactly why she cooks more. LUNCHES THE NEXT DAY. You decided that wasn't good enough even though it is incredibly budget, time - and labor friendly, and came up with another ridiculous reason why you don't agree. You don't get to be in charge of anyone else's hunger, appetite, and portion sizes except your own. Your granddaughter is hearing you, and seeing you talk like this, and if you don't stop, it is going to cause major psychological damage and potentially an eating disorder.", "YTA! \n\nI make enough most nights to feed a small army. There is only 3 of us. \n\nThe food gets taken the next day or two for work or it gets chucked in the freezer for nights I don’t want to cook it for lunches when I make something like burgers with no leftovers. \n\nAt the end of the day, as long as everyone is at a healthy weight there is zero issue with cooking a lot of food and encouraging eating.", "YTA. Everytime I read one of these I thank all the gods in the heavens for my delightful mother-in-law.", "YTA.  It’s none of your business. That and your focus on how much others eat is bizarre.", "YTA - You're acting controlling and like a busy body", "Did you count the potatoes for everyone? Did you get yourself the same amount every time or had you days where you feels you earned more, because you worked hard? Is your life that boring, that you need to micromanage other people's food choices? The worst that will happen is that your granddaughter learns a healthy relationship with food and knows when she is full and to get herself the right amount of food every time an learns to say no, because there is no artificial shortage of food", "YTA you need to mind your business.\n\nFirst off your son is a grown ass man. He doesn’t need someone policing his food. If his mommy has to look out for him the way you are your dil needs to rethink her marriage.\n\nAs for your grand daughter. You are not her parent. Your DIL is her mom. Keep this up and you will not be allowed to be around your grandchild. The DIL doesn’t need a backseat parent telling her how to raise HER CHILD! You need to learn to stay in your lane and mind your own business. It doesn’t mater what you did at your house this is her house and she can run HER HOME AND FAMILY the way she see fit!\n\nSecond your DIL really needs to limit your contact with her child. Stop telling her how to raise her child. If your son needs mommy looking over his shoulder now that he is a grown ass man then obviously you failed at parenting and shouldn’t be giving anyone else advise.\n\nIn a few months when the DIL is tired of your meddling in things that do not concern you and frankly none of your damn business and decides. It have you around HER CHILD let me save you the time and energy on wonder why! Because you can’t mind your damn business!", "Huge YTA \n1 IT IS NOT YOUR HOUSE!!! YOU HAVE NO SAY!!!\n2. Have you not heard of leftovers???? Are you that delusional???\n3. Sounds like you controlled how your family ate to the point of being an almond mom. You would probably make a salad with just lettuce and say that’s the meal. \n4. YOU HAVE NO SAY", "This is hilarious! Thanks for the laughs OP. Your DIL sounds amazing and YTA.", "YTA.  It’s not your household and she is clearly making enough food so that everybody will be satisfied, and is purposefully making enough for leftovers.  She is feeding her daughter what she thinks is the right amount of food in a way that she thinks is best for her development.  Your son is an adult who can decide for himself how to control (or not control) his own portions. \n\nGiven the way that you think that your way is more important even in her house, you should give a thought as to whether what she said is true - somebody so pushy and entitled like you may want to think about your unhealthy view of food and people having access to food.  But either way, you ran your household as you wanted, and she is running hers as she wants.  Your problem is not only that you made this comment - it is that you made the comment with the expectation that she would start doing things exactly as you want it.  She is correct to say that you should keep these comments to yourself. It is not your place and quite frankly, it is an unhealthy view to have.\n\nAlso, your granddaughter is not just “his daughter” - it is her daughter, too. You know, their daughter together.", "YTA are paying their bills? Are you buying their food? No? Than this does not concern you in the slightest. You are trying to be controlling with people that don’t even live with you. Mind your own business", "> my son is a grown man and if he wishes to eat less, he can do that without her having to \"mom\" him around\n\nShe's right.\n\n> maybe that is why my son eats so fast as if the food is running away\n\nShe may have a point, have you ever thought about this?\n\n> She should not let my granddaughter grow up to be greedy with food.\n\nWhy would she grow up greedy if she doesn't have to stress around food, like your son had to?\n\nYTA. Get a grip, and be happy your son found a woman with a brain.", "YTA How does it \"not make sense\" that leftovers are used for a meal the next day? If you want to restrict someone's food, restrict your own.", "You are a control freak.  You need to butt out or you will vist your son his marriage.", "No, just eating disorders 😏", "Leftovers are the best part. I cook for 1 90% of the time and I always cook enough for 3-4 extra portions. A: so I can have leftovers the next day and B: so I can have some food in the freezer for days I really cant be arsed.\n\nYTA OP its non of your bloody business how your DIL cooks. You son is a grown ass man, he doesn't need mommy monitoring his eating habits. And if he isn't happy about the way his wife cooks then he should be the one doing all cooking.\n\nEdit to add; your DIL didn't turn your son and husband against you. Your actions alone did that", "yo I love her DIL too...like didn't take any shit from the first sentence. shut it down hard and clear.\n\nif anything it sounds like mom gave son some serious issues with food as well and now he's livin the dream\n\nYTA mama...let DIL steer this ship she's got it tight and right", "I wonder if they are living together.  I got the impression they all might be in a country where multi-generational households are common.  Regardless, OP trying to control how her DIL feeds DIL's family is YTA behavior.", "She wouldn’t be watching my child either. I don’t want someone to give my child insecurity or cause them a eating disorder because they limited thier access to food. MIl is abusive.", "Totally", "Just waiting for the double down in the comments", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). If we’ve removed a few of your recent comments, your participation will be reviewed and may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "She's making less beef tho..."]}