{"id": 18289, "submission_id": "13t6b0h", "title": "AITA Boyfriend wants to flip the mattress because his side has sunken in, I don't want to because my side hasn't sunken in", "selftext": "My boyfriend weighs more than me (80-90 lbs by his guestimation, but he hasn't weighed himself in forever[his words])  He has a very physically demanding job and has a lot of muscle.\n\nHis side of the mattress (a king size) is sagging and he wants to flip the mattress so he can have my side, the side that isn't sagging.\n\nThe mattress was a gift from my parents to me for Christmas last year (the mattress is less than a year old)\n\nI don't want to flip it because \n\na) It's been less than a year since we've had it\n\nb) I don't want to sleep on the sagging side and have my non-sagging side ruined\n\nThe mattress is the type where it's supposed to have the top on top throughout the life of the mattress so to flip it we would be moving the end where our feet are to where our heads currently are.\n\nHe suggested we post here and see what the general consensus is, and we'll check back in a few hours because we don't want this to be a big thing\n\n**Edit:**  We decided to take a shot every time someone suggested we break up over this minor issue and we're currently at 3.\n\nOne person said I should break up with him because he's selfish for wanting me to be uncomfortable while I sleep because of a problem he created, one person said he should break up with me because I don't want him to be comfortable while he sleeps, another person said I should just change my boyfriend for a different one\n\nAnyways after doing a little research, we saw we're supposed to flip the mattress once every few months to maintain the health of the mattress\n\nI grew up being told to flip a mattress once a year, not sure if this changed with the improvements on mattresses, or if it's just new info science decided.  Or maybe I was just taught wrong ¯\\\\\\_(ツ)_/¯\n\nThe mattress was an \"as is\" sale from Ikea, it was still in the plastic but because it was \"as is\" it can't be returned or exchanged for any reason.  My parents got a significant deal on it because of this and the bf and I were both super excited for it because it would have otherwise been out of their price range.  \n\nI did research on the firmness because I worry about that kind of thing, I did ask bf for his opinion and he was present for this research but he said whatever I chose he would be fine with because he didn't care about soft vs firm.\n\nWe will be flipping it for now, and if I notice a significant difference we will flip it back and look into getting a mattress topper or some other solution for the problem\n\nThank you everyone for your input!", "created_utc": 1685190920, "permalink": "/r/AmItheAsshole/comments/13t6b0h/aita_boyfriend_wants_to_flip_the_mattress_because/", "score": 344, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I said he shouldn't flip it because it's been less than a year and I don't want my side ruined\n\nI may be the asshole because I implied he \"ruined\" his side because of his weight.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "A mattress should not sag in 1 year. You should make a claim under the warranty. Most mattress warranties are 10 years to lifetime.", "You have a terrible mattress if it’s failing within a year. Check for a warranty and if it does not have one, invest in a good mattress for the sake of this relationship. Of course you shouldn’t have to sleep in the hole created by him.", "Nta \nIf the mattress is only a year old I'd be contacting your parents, since you said it was a gift.  You will need the receipt to contact the mattress manufacturer for a replacement under warranty.  As most mattresses I know have a 5-10 year warranty.\n\n One thing to look at for the future is going splits..   so you can buy two different halfs and get different types of mattress for each of you.\n\n Think adjustable bed that the frames can be latched together but you can have a softer side for yours. And he could have a stiffer side for him..\n\n Being heavier myself I find I need a stiffer mattress so it holds up, and I just put a pillowor foam topper on it for softness.", "In terms of the actual question, NTA, but as others have said, that sounds like a really bad mattress if it's sagging after only a year. It shouldn't matter how much your BF weighs, they don't collapse that fast. You should definitely claim it under the warranty", "If it's sunken in after only 1 year, it's not a good mattress. If he wants a different sleeping experience he should buy a new mattress.", "NTA he should buy the new mattress if he doesn't like the one you have. You should also get a much better quality one bc no mattress should sag after one year. I'm guessing your parents didn't spend much money on it or got it from one of those shady dealers (there are a lot of them in the mattress world).", "NTA. Relationships involve compromise and sacrifice at times, but a straight 1-for-1 “you get comfortable sleep every night, I get shit sleep every night” is dumb. No one’s at fault here, just buy a new mattress.", "180 degree rotate, not flip. Should be every month or so. Seems too late now or a bad mattress.", "Matresses are personal items:\n\nThey need to be selected on wanting hard, soft, a lot of a little support, what kind of material, type of maintenance etc.\n\nThey also need to be adapted to your BODY WEIGHT.\n\nIt seems that your matress was destined just for you, and the fact your BF is also sleeping on it, was ignored.\n\nIt's only a year old, but with his weight, and the matress being sagged on his side, besides the lack of comfort, it could lead to physical problems and not being well rested.\n\nAlso, if you flip the matress, it will lead to the same problems within a year, and then both sides will be sagged. And for that year you'll be sleeping on a sagging side. Which isn't nice, AND it is YOUR matress.\n\nBest option is to get a new matress together, one which is adapted for both your morphologies.\n\nNAH", "NAH, but your mattress is really a terrible one. \n\nWhen I bought my new mattress I made sure it was one I could either rotate or flip upside down if needed. It did cost me more than I had originally wanted to spend, but it is worth it in the long run because being able to flip it has extended the life of the mattress.", "Well you're in a relationship and it sounds like it's time for a new mattress. If you want to be a compromise of partner you should suggest going half and half on a new mattress, or if your partner just doesn't take care of the things in your home together or he's just typically the one who's responsible for buying new things then suggest to him that it's time to buy a new mattress.\n\nYou're not the asshole but you should try to find ways to maneuver around such a small situation.", "Mattresses should be flipped and rotated on a regular basis so there is even wear (you must have a really soft mattress).  Anyway, try getting a good memory foam mattress topper.  The good ones are 3 inches thick with a 1 inch pad on top.  They run from $75 to $150 or so.  They will disperse his weight and spring back.", "NAH. You are supposed to rotate your mattress every few months to help prolong its life. If the mattress is less than a year old and is already sagging, it is a very shitty mattress and you should look into the warranty or get a new one. If you can't afford a new one, get a mattress topper. I can understand your boyfriend wanting a comfortable sleep, but by flipping the mattress that will affect your side and your sleep quality. You guys need to either replace the mattress with a good quality one or get a matress topper and see if that helps.", "NTA. There's no reason for you to suffer comfortability in bed.\n\nNormally the mattrass is supposed to be suitable for people up to 250 lbs... I guess your BF's heavy weight would mean he'll be way heavier than the less than featherlight weight of 90lbs. If your BF is lighter than 250 lbs, you might be succesfully able to invoke the guarantee. Otherwise, you could at least try. If it's not succesful, bad luck for your BF, but still you don't need to give up your nice half of the mattress. Next time buy a mattress also suitable for heavy people.", "Have him buy a new one. This argument is ridiculous.", "Flip it. Meaning turn it over so no one is sleeping on a sagging side because a sagging side would be facing down. And then get a new mattress, because clearly this one is deficient.", "NTA The mattress was a gift from YOUR parents. Why should you suffer through getting the sagging side that he created?", "More information.  90 pounds is only 40kg.  That is the size of a child.\n\nI would be looking at the warranty.  Only the cheapest foam mattress should sink that fast, especially for a child.", "NTA\n\nFlip it & let him sleep on your side.\n\nEta- to clarify, your side of the bed Not the good side of the mattress.", "ESH. You're supposed to rotate them every couple months.", "put the mattress upside down, or just get him to buy a new one", "NAH since both sides are relatable. But i would get rid off that shitty mattress (emotional value wont replace a healthy sleep) and get two individual mattresses.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy boyfriend weighs more than me (80-90 lbs by his guestimation, but he hasn't weighed himself in forever[his words])  He has a very physically demanding job and has a lot of muscle.\n\nHis side of the mattress (a king size) is sagging and he wants to flip the mattress so he can have my side, the side that isn't sagging.\n\nThe mattress was a gift from my parents to me for Christmas last year (the mattress is less than a year old)\n\nI don't want to flip it because \n\na) It's been less than a year since we've had it\n\nb) I don't want to sleep on the sagging side and have my non-sagging side ruined\n\nThe mattress is the type where it's supposed to have the top on top throughout the life of the mattress so to flip it we would be moving the end where our feet are to where our heads currently are.\n\nHe suggested we post here and see what the general consensus is, and we'll check back in a few hours because we don't want this to be a big thing\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "You’re supposed to flip or rotate the mattress when the seasons change to prolong the life of it…", "NTA but if you would have been rotating it every few months or so it wouldn’t be sagging on one side it would have wore evenly just for future matteress", "The mattress should be flipped for even wear but I don't think this is an AH situation. NAH", "My reaction based just on the title: Absolutely, and if this is an actual argument you're not mature enough to be in a relationship.  \n\n\nAfter reading it:  Huh, not so fast, me.  That actually sounds like a reasonable position you're taking there.  I say, NTA, and don't flip it.  Next time get two beds/two mattresses, just push them together if you need to be right next to each other.", "NAH. Check the warranty on the mattress.", "ESH. If it is sagging in less than a year, you have a defective mattress. Neither of you should have to sleep on the sagging side. If it is a good mattress, you should be able to get it replaced under the warranty. If it is a cheap mattress that doesn’t have a warranty, you should replace it with one that can accommodate someone your bf’s weight.", "NAH you should be rotating your mattress periodically not flipping it though to prolong life.\n\nBut if it’s sagging after 1 year on his side, you either bought a crappy mattress or happened to get a faulty one. Or he’s literally half a ton?", "Yta flip the mattress. The other side isn’t sunk.", "YTA. Y'all got the wrong mattress - which btw should have been chosen based off the larger person between the two - and he no longer has support. If he wore out one side in 8-9 months, he'll wear out the other side in another 8-9 months and in the mean time y'all can save up for a new mattress based on his weight and not yours. \n\nI loved a man for 5 years who was 100 pounds more than me (mostly muscle). Beds/chairs/cars, etc. need to consider his size. Your size is easy to manage relative to his.....especially the mattress.\n\nEdit: I agree with others that HE should buy the new mattress in 8-10 months. Get a good one. Do your research. There are mattresses for heavier people now. Consider a Helix.", "Two issues: \n\nThe first is that no mattress should be sunken in after only a year. This sounds like a very poorly made mattress.\n\nSecondly, I wouldn't buy new furniture to benefit a boyfriend, unless he lives there and is paying his share. If he doesn't live there, he can go sleep in his own bed.\n\nIf he DOES live there, then it would be reasonable for both of you to go shopping for a new mattress. Because  even a Euro top mattress that isn't flipped should still get rotated. And if one side is sagged in, it's only going to get worse for both of you over time. Your side will start sagging too before long.\n\nThe answer here is not \"We should rotate the mattress so YOU are uncomfortable instead of me\", it's \"Let's replace this mattress with a better one that will wear evenly\" and then you stick to what the manufacturer instructions say. But again, only if you're living together. You are not obligated to drop hundreds on a temporary sleeping arrangement.", "NAH\n\nNo decent mattress should be sagging after just a year.\n\nThat said, if a mattress isn’t rotated / flipped regularly, it will wear out unevenly.  The situation will only get worse, with one side wearing down and sagging more and more while the other does not.  You’ll be left with a severely lop-sided mattress.", "Invest in two separate mattresses. You cannot use the same mattress with this weight difference.", "That's not true of newer mattresses now.  This one sounds bad if it is worn down after only a year.", "He weighs 90 pounds more than her, not 90 pounds in total", "Well, and this is why it HAS to be flipped. It's only going to get worse.", "They can if they get a really good mattress. Not this pillow top bullshit. Lol", "Well, the last mattress I bought was over 20 years so, but when I just Googled the subject, there are a lot of recent articles about regularly flipping your mattress and there were some articles about not flipping your mattress.  I would go with whatever the manufacturer recommends.  But yes, it sounds like she has a bad one if it is failing after only a year.", "Ha ha I had to read that part a few times because I thought how small is this guy ha ha", "Warranty aside...your bf wants to flip the mattress to make himself comfortable by making you uncomfortable? Is he selfish in another situations too?", "Right, you wouldn’t be flipping it, you would be spinning it - so that YOU would have to try to sleep in the sinkhole which your boyfriend KNOWS is uncomfortable, because that’s why he wants to change it!! \n\nAs others have said - a new mattress is in order, hopefully covered by warranty.  More importantly, though, why is your boyfriend pushing to solve his problem by giving it to you?!  NTA", "NTA \n\nHe'd preffer not to sleep on a sagged side, why would he expect you to?\n\nInfo: what's his justification?", "Your parents bought you a crappy mattress.", "NTA he’s uncomfortable. He thinks his comfort is more important than yours. If he doesn’t like the state of the mattress, then he can buy a new mattress.", "NTA. He’s being very selfish to pick a solution that makes it better for him and worse for you! Getting a mattress topper for his side is a better compromise!!\n\nThat being said, return the mattress. In no world during regular use does a mattress fail in less than a year. Return this mattress and get a new firmer/sturdier one. You can always get a removable mattress topper if you want it softer.", "I thought you were supposed to rotate your mattress every month or 2 to prevent sunken spots. \n\nThat's what we do. Kinda like rotating tires, helps it wear more evenly.", "NTA. your boyfriend sure is for suggesting that you rotate the mattress so you get the sunken side, though. I get wanting better sleep, but not at the cost of someone else’s. \n\nAs other commenters have pointed out, either look into the warranty for a replacement or look into an adjustable mattress/separate mattresses. Sleeping in the same bed is not the be all end all of a relationship. You have different sleep needs.", "NTA. If he wants a better side he should pay for a better mattress. Check your warranty you might be able to get a refund. \nMaybe seperate beds would be good? \n\nNeedless to say, I would be pissed if I get the worse side because of someone else's weight.", "If it’s a defective mattress, N A H, but giving you the bad side of the mattress so he can get better sleep is a duck move. NTA but do you want to be with someone who cares about his comfort but not about yours? I’d check the warranty and replace the mattress and the BF.", "Oh he wants to give you the side he ruined?   That's not flipping the mattress.  That's spinning the mattress.  \n\nHe's selfish if that's what he wants.  He ***wants*** you to have worse sleep because he ruined his side.  He wants to take your good sleep for himself.  \n\nReturn the mattress for a warranty replacement.  Never spin the mattress for his side if he ruins it.  \n\nNTA", "I don't care about the mattress warranty or whatever everybody else is talking about. \n\nThis is basically, my ice cream fell on the ground, so give me yours. \n\nNTA.\n\nHe can buy a bed pad or something if it bothers him that much. You shouldn’t have to give up being comfortable just because his side sunk.", "NTA - if it’s sagging after one year than like everyone else is saying you need to check the warranty. But why is he dictating to you what you should do with a mattress your parents bought for YOU.", "He owes you a new mattress or at least a topper. He broke it, you didn't. Your sleep matters as much as his.", "Have you rotated it monthly? I'm pretty sure it's recommended to rotate the mattress monthly in order to help prevent that from happening. Either way, you should contact the company about the warranty.", "The mattress is defective.  Put in a claim.", "NAH. There's just something wrong with the mattress. Make a warranty claim.", "NAH. Get a new mattress. He works a physically demanding job and you shouldn't sleep on a broken mattress.", "It shouldn't sink in a year. But it could be user error. We recently bought a mattress that similarly you can't flip, but we were told to turn the mattress about every 3 months for the first year then about every 6-9 months after that to ensure that this didn't happen. Our mattress is a hybrid mix of box springs and memory foam.", "NTA\n\nZoned mattresses are not supposed to be rotated. \n\nIf there’s a sag after a year it’s a bad mattress and needs to be replaced under warranty. \n\nRead the warranty tag that came with the mattress. \n\nI chose NTA because it’s a crappy request to rotate it so you have the sag. Rotating mattresses that require it should be done to prevent sags, not to force the lighter person to sleep in a saggy spot.\n\nWhen you get the new mattress don’t sleep in the exact same spot every night. Shift around. Some nights sleep closer to the foot of the bad. Some closer to the head. Some close to the edge, some closer to the middle. Try not to wear out one spot too fast. This is hard with zoned because of how the springs are laid out so different spots might not be as comfortable. \n\nAlso the zones are supposed to prevent sagging by having more springs and sturdier springs at the shoulders and hips. I personally find them super uncomfortable because of that.", "I agree it shouldn't be sagging after a year, but isn't it also regular practice to rotate or flip mattresses often to prevent any single spots from being over used?\n\n\nI rotate my matress(similar to op it's in not a flip able matress) about once a month to prevent any spot being over used. This also means any sagging spot moves to the foot of the opposite side of the bed so as long as it's not extreme it should not effect the other sides quality. \n\nI'm leaning toward YTA because you're sharing a bed with you BF but also making it seem like it's solely your matress and don't seem to be caring for his quality of sleep. First you should try to get the matress replaced by your warranty and second since your bf is bigger, you should rotate it often to prevent sagging.", "NTA. Put a thin board under his side. Do not sleep on the sagging side. I have scoliosis, I somewhat contribute it to the fact that we had a horrible mattress for decades. I didn't realize the importance..  Also a mattress can be rejuvenated with a mattress topper. I would not get a super soft one.", "You can flip and rotate the mattress so you both continue sleeping on the same sides", "If it’s not meant to be flipped, then that’s all there is to it. Is it a pillow top, or what? What makes it so that it’s not meant to be flipped? But if that’s not how it’s supposed to be used, then don’t do it.\n\nYou might wanna look into things though because I think, you should get a lot more than a year of comfortable use out of a mattress. Unless your boyfriend is like a really, really big guy.", "NTA.  You need a new mattress. You both need a good nights sleep.", "Guy court convened.\n\nPer a strict interpretation of the charter, this does not in and of itself constitute a dick move.  However, it is our opinion that the line is certainly being skirted by playing the bread winner card.\n\nWe recommend that BF man up and research additional options.  Do not consider this a zero-sum game.", "NTA, no reason to punish you for weighing less. However, if the mattress is sagging after a year,  it’s either very poor quality and should be replaced by the company or it doesn’t need your very different needs. If possible, invest in separate mattresses.", "It’s a bad mattress and see if you can return it for a refund. However you probably cannot. If not, yes, try flipping the mattress. The sent he made will likely be at your feet and hopefully won’t be noticeable. Try it out, at least. That may get you another year out of the mattress.", "Get a memory foam top if you can’t get a new bed and boom! Problem solved. Nta! But he’s a bit selfish  lowkey", "You have to check the mattresses' weight class as well as firmness. Some mattresses are made for heavier weights. You are supposed to flip your mattress regularly so it can wear evenly.\n\nCheck if you can return it. If you can, get a better suited mattress.\n\nNTA", "NAH. It sounds like the defective mattress is the actual A here. You guys both just want comfy sleep and that's valid. \n\nYou need to find out why a new mattress is already such crap. Flipping a mattress regularly will also help prevent sagging in the first place. If you don't want an even more uneven mattress, you'll need to start flipping it. I'm not really sure how I'd advise you to approach your parents about this, but the issue is that the gift they got you doesn't appear to be a good fit. Maybe they can help you exchange or return it for something more suitable.", "NTA\n\nHe fat lol", "You guys don’t flip your mattress regularly?\nI thought everybody did.\n\nObviously, like others said, you have a shitty mattress if it’s this much of an issue.", "When we bought our matteess, they told us to flip it once a month so it keep it shape.\nOnce head to feet, once flip upside down.\nWe made this for 5 years, including when pregnant, and it still like new.", "NTA", "Nta. But flip the mattress to where his side stays his side, if that makes sense", "My mattress is not flippable, but I rotate it once a week, every time I change the sheets.", "Flip it the long way so he is sleeping on the opposite side of his current one.", "NTA\n\nYour mattress, so your call. \n\nMy tip for a future mattress is that to avoid sinking in any side you should rotate your mattress 180° every 15 days when it's new and after some time (not sure how much) you can rotate it every 30 days. Many mattress manufacturers instruct you to do that and you should follow that for long lasting mattress. Even then, 1 year without flipping shouldn't sink that much with a good quality mattress.", "Flip and turn so he still gets the same side. NTA", "im gonna say NAH, i think you should just buy a whole new mattress if he's adamant about having a side that hasn't been sunk because they really shouldn't be sinking like that.", "Warranty claim or new mattress… NTA by the way", "NTA\n\nIf it's less than a year old, find out if there's a warranty to replace it. \n\nIf there's no warranty, then he should bear the cost of replacing it since he's the one ruining it.", "Nta. But this is why you're supposed to rotate your mattress. Every other week I spin it while I've got my bedding in the washer.", "Just rotate it or switch sides", "We added a thick mattress pad to our mattress to compensate my heavy, muscular hubby.  It works great.", "NTA\n\nFirstly, It's a rubbish mattress, ask your parents to check the warranty and see if it can be replaced / returned\n\nSecondly, it's YOUR mattress, why should you have to sleep in the side that's sagged under his weight?!..\n\nHonestly, who does that? It's like a kid with a broken toy that thinks because they broke theirs, they deserve their siblings new one, and the sibling can suffer instead. Why, why should that be someone elses problem?. \n\nHe is a grown ass man, if it's that bad then he should offer to replace (ot atleast go halves) on a new mattres. If he's not prepared to do that, then he continues to sleep in the sag!.", "Do a flip and rotate?", "Just flip it longways instead of sideways.", "NAH\nNew mattress.", "Info: Was the box springs replaced at the same time as the mattress? If not, this could be the issue. As others have stated a mattress should not fail within one year.", "Flip and rotate, that way he still has the saggy side.", "Meet in the middle and get a mattress topper¿", "What brand is it? A year????", "You should have been flipping it every time you changed the sheets. Get a new mattress and treat it properly.", "NAH. It will possibly be covered under warranty. Even if someone is heavier, that shouldn’t be happening so soon. But (source: worked in furniture for a decade), they likely will ask you if you’ve been flipping and turning it. You absolutely must do this with most mattresses to avoid this exact situation. We used to recommend doing it when sheets were changed. Turn it the first time, then flip it, then turn it, then flip it again, so you’re getting the same wear everywhere.", "As someone said check out the user warranty.\nBut hell no NTA.", "File a warranty claim. This should not have happened.", "Do you guys not rotate the mattress? I rotate mine every week or so and flip it every six months. It's a regular £400 mattress, nothing expensive and it feels the same as when I bought it 🤷🏻\n\nNAH", "NTA, why should you have to sleep in the sunken in hole that HE created??", "YTA, you should also be flipping it more regularly so it wears evenly between the two of you. I mean, whats your plan, that he's just gonna have to deal with bad backs every morning while you don't get a new mattress? You use it TOGETHER so you should both be trying to maintain it to prevent having to replace it. Flipping it every month or so will mean your side slowly gets worse, but the alternative is separate beds, not keeping a half busted mattress just because you're still good with your half.\nBuy a new, BETTER mattress, and figure out a rotation plan, first of the month works for my parents.", "My gf did this with our couch. I didn't think it was fair but I can't explain to her that her side was ruined because she's heavier than me or she'll get very upset.\n\nShe's started commenting that my side of the bed is nicer now, too. I'm getting worried.\n\nBut both items are over 10 years old.", "Um i would take it to the warranty. It's either manufacturing error, or just very bad quality mattress if it's sunken in less than a year. Those things usually last 10++ years. Also most mattresses (except very cheap ones) are advised to turn sides every 3 months or so (meaning current top side will be bottom side). Don't know what other advice to give you except going for the warranty with it.", "He should not get your side just because his sags! That’s so cheeky", "I’m not sure which brand you have but certain newer brands of mattress aren’t even meant to be flipped / rotated; it’s worth checking. In any case if it’s this bad only one year in then it doesn’t sound fit for purpose and you should get your parents to contact the retailer.\nEither way, I’d be pretty hacked off if my partner told me he wanted to rotate the mattress so he could have the most comfortable side! NTA", "Your mattress should be lasting 7-10 years. If it’s sagging after 1 year then it’s a crappy mattress", "If it is less than a year old it should still be under warranty.  Ask your parents where they got and call and complain.  It should not be sagging at all unless your husband is jabba the hutt", "Just as an aside mattresses should be turned every six months  to help stop this problem. If it's a pillow top one you turn it so the feet bit is at the top.", "NTA It’s really selfish of your bf to want the “good side” for himself and sacrifice your comfort", "NTA he expects you to sleep in his lumpy sagging side? Hell nah. Buy a new mattress or he can suffer with the damage on his side and not force you to suffer. Imagine being that selfish, my back hurts just thinking about it.", "Hahahah, I enjoy this plot twist that the mattress is the asshole!", "Info: which side do you fuck on?", "Nta", "This kind of mattresses are supposed to be flipped that way every 2 weeks so this doesn't happen. \nYou're both the A. Because you ruined your own mattress... Sorry\n\nI don't know what to do about the situation now lol", "NAH \n\nYou have a crappy mattress. Try to claim the warranty or get a new mattress. If there's a Menards near you they usually have good deals.", "Gentle, padded YTA, because you haven't tried it.  \nWhy don't you try it? My beloved hubbie and I always flipped it, because his side would sink. We rotated it so the bottom was now the top. That's what made it work because the majority of the sink part is under under the torso. Since I was smaller than him, it still felt puffy for me. Just try it, with an open mind. If you like it, great!  If not, but a new one. Either way, is a team effort, and you want both of you to sleep well. I hope this helps, because your are both worth more than a mattress! Take care.", "INFO: how far is his side sagging? If it's a minor indent that's just a little uncomfortable, that's a different conversation than deeply sagged. I am a pretty heavy guy and I dent my mattress over the course of a few months. I rotate my mattress whenever it gets noticable and it goes away on the side I'm not sleeping on pretty quickly.\n\nIf you caught it early enough, rotating the mattress may solve it pretty quickly.", "Make sure the box spring is positioned correctly under the mattress. We bought a brand new mattress and it was sagging in a few days, turned out the box frame thing underneath it was upside down. It fixed the problem instantly", "Vacuum it.", "NTA, if he ruined his side he can't just give it to you. He can either carry on sleeping in the pit, or buy a new mattress for you both, but you sleeping in the pit is not an option.", "Yta asshole, and you don't understand geometry. Flipping mattresses regularly is good for them. You are supposed to flip it over so you sleep on the underside. Your thinking of turning it round so your boyfriend sleep on your side.  This is not the same thing.", "You 100% can both get what you want. You flip, and then rotate. His side stays his side,  you don't get saggy side.  What's the issue?  Besides your 1 yr old mattress probably being faulty if it's sagging already.", "There are mattress companies who make mattresses for heavier people. Maybe look into that. Having that much sagging after one year is odd. He may need a better quality mattress.\n\nETA you are NTA.", "Nta. Your bf is a selfish ah though. His side is messed up so his solution is to have you sleep in discomfort for his.. what a catch.", "Flip the boyfriend.", "You are supposed to turn your mattress routinely to avoid this and flip it as well if it’s not a pillow top type.", "I would put a 2x4' board under his side to limit sag (if on a box spring). Board can range from a 1/4 fiberboard to 3/8 plywood in thickness.", "The mattress is the AH.", "NAH, get a new mattress, this one's faulty. Speaking from fat-person experience, being a garden-variety amount of large will not break a mattress in a year.", "A lot of people are talking about the bad quality mattress. And yes it is, i agree you should get a new one. However on the topic of flipping mattresses, if its just for the short term i say you keep your side. Its neither of your faults but would still make you very uncomfortable. Also as a small woman, trying to roll out of my boyfriends mattress dip is a huge pain and very uncomfy.", "What kind of man would give the shittiest half of their lot to their woman. Especially when the entirety belongs to her from her parents.", "A mattress shouldn’t be sagging after only a year. My husband and I were gifted a mattress 4 years ago and at that point it was 10 years old (used in a guest bedroom) and it’s still not sagging. I have been at almost 300lb and am currently 250. You should be able to file a claim under the warranty.", "Flip and rotate..give him other sunken side.", "Bf should buy a new mattress of half size on for his side and should not share with you", "IDK about AH but not sleeping would definitely give me lots of time to contemplate my future and strategize how to get more comfortable sleep.", "NAH except the mattress. Sounds like it's faulty.", "ETA. You showed no concern that your boyfriend is miserable here. He showed no concern that he'd be giving you the shit side. You sound perfect for one another, at least.", "NTA, why should you have to put up with a sagging side if he isn’t willing to? \nAlso yes something is very wrong if your mattress is sagging after a year. Should be covered under warranty", "Mattresses should be rotated periodically. It helps even out the sag. Also anything more than a 2 inch sag should trigger the warranty.", "NTA. Your boyfriend doesn't get to take your stuff just because he ruined his.", "Contact the mattress manufacturer.", "Flip it, but also rotate it. Let him have the underside of his original side.", "NAH there is an obvious solution: go for the warranty like the dude above me said and in the future, squish two twins together with a nice foam topper so that his side can wear out faster than yours and it doesn't make it so you have to buy a whole new king mattress, just another twin.", "NAH, but the company that gave you that mattress is very odd, or very cheap, mattresses don’t sag that fast", "Don't do it! Also,  I recommend getting 2 twins to replace the king mattress so you don't have to replace the whole thing every year!", "NAH.  \nYou're right that you shouldn't be sleeping on the sagging side, but using the same logic why should he be forced to?  \nEven with a foam mattress like this you should be rotating it semi regularly so the wear is even. However even allowing for you not doing this a year is NO time for this to have happened so quickly.  \nReturn it if you can, and when you get the next one rotate it.", "You should flip a regular mattress once a month anyway. Horizontally, vertically, horizontally, vertically. That keeps sag problems to a minimum and helps the mattress last longer.", "NAH. Your parents got you a cheap, shitty mattress as a gift. There’s no reason it should be in that rough of shape otherwise. Most mattresses are good for 10 years.", "You wouldn’t have as big a problem if you rotated and flipped regularly. The wear would be more even. Time for a new one", ">The mattress is the type where it's supposed to have the top on top throughout the life of the mattress so to flip it we would be moving the end where our feet are to where our heads currently are.\n\nLol, you can just rotate it so one side is on the other.\n\nDon't do that though.  He can buy himself a firm mattress topper or something.", "We have a memory foam mattress and have to rotate it every week or so to allow it to decompress. The slight dip that develops is where our legs end up after rotating so it doesn’t affect us.\n\nOP, YTA if you don’t even try rotating to see if it bothers you. It’s good for the health of the mattress and if it makes a big difference to your partner’s sleep at minimal cost to you then everyone’s a winner. You’ll probably find that the sag begins to disappear over time as the mattress relaxes back into shape.", "You’re supposed to periodically flip the mattresses so they can wear evenly, but it shouldn’t sag that much after a year so you may want to try the warranty. NAH.", "NTA but you’re also supposed to rotate your mattress monthly so it wears evenly.", "NTA. My bil actually did this to my sister. Flipped the ruined dipped side to her side of the bed. She made him flip it right back. Told him if he was uncomfortable to order a new mattress. They are now separated.", "NTA. If your bf if breaking down mattresses that quickly then he needs to pay for a new one once he’s ruined his side of the bed. He broke it, he buys a new one. It’s only fair.", "Mattresses should be flipped at least every other month to stay even. ESH?", "Does no one flip mattresses anymore?  Is it not a thing anymore?   I still rotate and flip my mattress monthly.  It wears evenly that way.", "You could also flip and turn so his sunken foot end in now bottom his head- might seem fresh/re-supportive for him and no real change for you 🤷‍♂️ but otherwise NTA", "Flip the mattress the monthly then you won't have this problem. Also just flip it so that the head and feet stay in the same section but swap sides?", "You’re supposed to rotate mattresses every few months.", "Nta he’s a pretty selfish boyfriend if he would rather you suffer for something he caused", "He'd still be in the same spot, just the other side of the mattress. Do you want him to get a separate bed? What is your plan here exactly?", "Put the matress on the ground. It won’t sag anymore. That’s what I do.", "NTA. He can get over it or just sleep somewhere else.", "NTA. everyone blaming the mattress is helpful, but not answering the question posed. No, you shouldn't have to be less comfortable so that he can be more so. It was a gift to you and if you both left now the mattress would come with you. It sucks he is heavier but there are mattress pads and any number of fixes that don't include him automatically assuming that it should be you that takes the shit of the stick. That's a red flag IMO. What else will he just assume the best is his and not take you or your autonomy into consideration?  just saying...", "Matresses should be rotated regularly to avoid sagging on 1 side. This is indicated in the warranty booklet of matresses.", "NAH - don’t flip it, rotate it. The dip will be on your side, but down by your legs. If that doesn’t work, contact the warranty department to see if you can get a refund/new mattress. Or maybe the store will give you store credit so you can get a better mattress.", "YTA. Just flip and rotate", "Yea you’re an asshole", "Edit: YTA\n\nUh, when I got my new mattress they told us to rotate it like that every 6 months so it wears evenly. That was 8 years ago, mattress is still pretty damn good. Ours also has a top that needs to stay there, so it's not flipping.", "Only because you are suppose to flip a mattress every six months to prevent sagging - YTA.", "I have a king mattress with a pillow top that is always supposed to be the top and the way your boyfriend is suggesting moving it is actually a requirement under the warranty and best practice to extend the life of your bed. You should definitely be rotating the mattress. I believe mine said like every 3 months. YTA if you don't rotate the mattress for him. Like I have 100 lbs on my wife and my side of the bed sometimes starts to feel more compacted so we rotate it she never notices the difference being so much lighter and as I start working on that side of the bed the other side kind of comes back up.", "YTA \n\nget a bed that can accommodate more weight, figure out if the mattress is defective if it still has a warranty. Do something? Anything that makes it seem like you care about him getting a good sleep. You just sound like a selfish weirdo, if my partner wasn't having good sleeps in my bed I'd work out how to fix it together not just write it off because the bed is ok for *me*. If you want to stay in a partnership that's generally how things work, if you wanna just think about yourself do him a solid and breakup.", "NAH - your parents bought a cheap mattress and nobody wants to be uncomfortable. If you are financially able to, I really recommend investing in a good quality mattress. Nothing is worse than ending up with preventable back problems in your 40’s because you were too cheap to buy a good mattress.", "Yeah, this exactly\n\nI would be looking to replace the mattress since it failed so quickly", "Just make sure you read it carefully before you try to claim - it should absolutely be covered but sometimes they're nightmarishly specific warranties. Ours was nullified because we kept it on a wooden bed frame instead of a box spring/divan for example.", "im wondering if user error also might contribute. the guy is big and bulky, is there a chance he just kinda kerplonks onto the bed? thatd wear it down a lot faster being a larger person", "This! You should not have to sleep in a mattress crater created by your husband.", "Would suggest a sectional type of mattress as well\n\nIe instead off one large king, two separate ones pushed together, with a topper or memory foam covering both.  \n\nThat way if he really is tough on the mattresses, he can just swap his side out without affecting her side.  And the memory foam topper would keep the surface feeling like it was one complete mattress with no seam in the middle.", "The more physically demanding your job the more you should spend on a quality bed.", "Exactly. But, this guy is selfish AF. He is uncomfortable sleeping on his side of the sunken in mattress. He has deemed this bed unfit to sleep on. His solution is to ask OP to sleep on the unfit side of the mattress so that he can be cozy while completely disregarding OP's comfort.\n\nThese are the little things in relationships that give you an insight into the true character of the person you are with.", "Everyone forgets that NAH exists. If you're saying this is neither party's fault, but a mattress quality issue, it's No Assholes Here.", "We have this set up and love it!! You can get split queen size or split king size.", "Get split box springs, too! My husband “walks” in his sleep. One knee goes up and then bump bump bumps down. Then the other knee. I would get so frustrated. I would roll him on his side, but that never lasted long. The split box spring saved our marriage! 😁", "No, rotating a mattress is common place. He wants to do this to even it out, not to be malicious. The best answer is to find out if there us a warranty or buy a new one. But here we were with OP disregarding her BF's aching back without even trying to find a solution.", ">why is your boyfriend pushing to solve his problem by giving it to you?!\n\nNowhere in the OP is it stated he's trying to push it on her side. He said he wanted it flipped. OP is the one that said because of how the mattress is, the sunken side would be on her side, but that's only when flipped one way. There is more than one way to flip a mattress and they can easily flip it so the sunken end is still on his half, just now at his feet and no longer \"sunken.\" NAH, OP's BF isn't being malicious based on the post...", "Geez, I rotate every week.", "Beware all those shady dealers in mattress world 🤭 I would a watch a show about mattress hustlers", "Not all mattresses are designed to rotate. Some have a zoned system and you are not supposed to rotate it. OP said their mattress is like this. \n\nIt needs to be replaced.", "Nahh boyfriend is TA for suggesting she suffer a bad nights sleep because he doesnt want to. They should def get a new mattress but hes being really selfish", "I rotate every six months. Isn’t that standard?", "First time I've ever heard user error in regards to going to sleep.\n\nShould still be covered under warranty.", "My cat jumped onto the corner of my matress once and it snapped the corner of my boxspring.. she wasnt even a fat cat 😭", "I don't think we can assume he's \"big and bulky\" from the post. She said he's like 80 lbs more than her so if she's 130 then he'd be 210 which isn't really all that big for a 6'0\"+ dude. Without knowing how much she weighs or his height and weight the numbers she gives us don't really tell us much.", "Surely a mattress should be able to cope with that.", ">You cannot use the same mattress with this weight difference.\n\nYes you can. I weigh 130 lbs. My boyfriend weighs 245. We sleep on the same mattress and we've never had this problem in fifteen years.", "My bf is twice my weight (150 v 300) we got a big fig mattress and it made a huge difference. I barely notice him moving around now it's pretty cool.", "I was gonna suggest this.  Two XL twins are the same size as a king. Then each person can have their level of firmness (he probably needs a more firm mattress). \n\nI also very much recommend separate duvets/comforters. My husband and I have our own blankets and it's made a world of difference in our sleep quality.", "I don't think that has anything to do with. If you spend all day sitting in a chair and all night on a shifty mattress I think you're going to be much more sore than a person who's moving and keeping their muscles loose all day.", "[removed]", "I mean she's also being a bit selfish because her solution is do nothing and he just has a bad sleep. They could find an alternate solution to one of them getting the shit side of the bed but they seem unwilling", "Him wanting to rotate it so that it's her problem is what makes him TA. Yes it's a mattress quality issue, but he's not suggesting a new mattress.", "He's still an AH.  He wants her to have worse sleep so he can take her side.", "We never rotate. I never knew that was a thing you needed to do.", "Tbf when you rotate or flip a mattress you would position the sinking spots at the foot ot the bed and if they aren't extreme they aren't noticed. (Spurce I had a pretty sunken spot of a memory foam matress because I sat on one side of my bed often. When. We rotated it the spot was under my husband's fee and he didn't notice at all. So I don't think the bf is expecting her to just sleep in the sunken spot.", "If bias was a person", "Ours is only 2 years old so unless something changed in those 2 years specifically. We were told to flip ours and to date it on the card provided because it could help with warranty if needed.", "Yeah, something like that.", "I had a saatva mattress that started to have a dip in it after only a few months. I have chronic pain so I spend quite a bit of time in bed sleeping and just trying to be comfortable. When we put in for the warranty they told us that dip was because I spend too much time in bed and it wasn’t made to have someone it it more than a couple hours a day. So basically user error", "Would have been infinitely funnier if he simply suggested the guy slept wrong", "Talk to my ex. I was constantly in trouble for rolling over in bed the wrong way.", "As an insomniac, I can tell you that user error in regards to sleep occurs nearly nightly.", "first time ive ever said or heard it too lol\n\nyeah true, just wondering if itd make the wear and tear worse", "This!! I don’t think “user error” has anything to do with it. Not the way you’re describing it anyway. Usually user error breaks are in the middle of the bed, maybe a corner post.", "Some ppl do weird stuff with having a bed frame/ slated wood instead of a box spring but the gaps are too big. But that’s really just with the foam style mattresses that come rolled up. You’re right there’s no reason a one year old mattress should be in such a state.", "You haven't hit your 30ies yet, have you? I go to sleep tired but okay and wake up tired and hurting in random places.", "she says his job is very demanding and he is muscly. and yeah we dont know specifics, thats why im considering it a possibility. that much weight being dropped at once is a lot of force.", "ive seen it happen with heavier people. its a lot of force to just drop that much weight on a bed and can wear it down faster especially if it is a spring one", "Wow, interesting. My husband and I don't even weigh that differently ans still got separate ones. His feels to me like it tries to swallow me. He thinks mine is a bouncy board.\n\nPlus we each can move without moving the other half of the bed.", "IMO pillow tops are the absolute worst! Hate them. I’ve never had one that lasted even half the warranty period, even with recommended rotations. Now have firm memory foam and it’s wonderful!  Has lasted for years.", "Yes, there are mattresses designed for people who weigh more than X pounds.  Stronger coils, more coils per square foot, etc.\n\nNo, he does not get to make you suffer back pain and poor sleep because his weight destroyed his side of the mattress.", "Yeah I got a great mattress 5 years ago and it has held up great. My fiance is smaller than me. No dip.", "I was wondering about those! My husband and I have a similar weight difference and he destroys mattresses. They’re just not made for big guys. \n\nI wondered if they’re actually as good as they claim to be.", "I came here to recommend this. My friend is 400# and he bought one and loved it. \n\nI will say I outweigh my husband and we rotate our mattress every 6 months. With the old non plow top you were supposed fo do it every quarter, rotate then flip. \n\nWith the pillow top you are still supposed to rotate for even wear. \n\nI will say the correct headboard and frame make a difference. You either need good box springs or a good slat foundation built into your frame. \n\nI am curious if they have a poor foundation not build for a big guy. If so their next mattress will breakdown too.", "LOL.  The duvet comment made me chuckle.  My wife and I are constantly \"wrestling\" over them when falling asleep.  Usually not an issue for us unless it's winter.", "Bad bot. Comment stolen from u/thisisdrivingmebatty", "I mean, it’s not her problem if he sink, and shouldn’t be her to give an alternate solution to that ridiculous request, also because the only solution is to buy a new mattress", "Mattresses are meant to be flipped every couple of months. Boyfriend is not an AH.", "It's amazing the difference you feel in the mattress when you rotate.", "How is she supposed to make it specifically at one end if they spin it without flipping?", "That's exactly what I said. It seems like most people here are under the impression the mattress has to be flipped along the longer axis when all they'd have to do is flip is along the shorter axis. This way the sagging side is still on BF's side, just towards his foot. I think there's some miscommunication going on.", "In the post she mentions how he expected her to I thought.", "If she had ruined her side of anything, she shouldn't swap with him either!  \n\nIf she dropped her ice cream, he shouldn't have to give her his.  \n\nIf she had ruined her side of the mattress, he shouldn't have to give her his. \n\nHe wants her side of the mattress and give her the side he ruined!  That's being an AH!", "Why should she sleep on the side *he* collapsed? Just get a new mattress if it bugs him so much (i know money sucks at times but he shouldnt be trying to make her suffer too)", "I cannot imagine saying to the partner that I love “this is uncomfortable for me and sleeping is very important. You be uncomfortable instead. I’ll be fine with that” For me I’d be stunned if my husband behaved this way toward me. It may sound small but for what it says about an attitude toward your partner, it’s not really.", "Same. We were told to flip/rotate ours...and we bought a pricey temperpedic.", "When I got mine they said that wasn't necessary.  If you get one with a pillow top, then def not.  Maybe depends on the type.", "I really doubt the mattress flipping advice would help in this situation. Its already messed up and rather than suggesting a new mattress, bf decides its gf time to suffer (so he can ruin the other side)", "Um, couple hrs a day total?", "I do remember her mentioning that once", "Hell, its quite possible. I'm gonna have to go watch some mattress infomercials to learn some scientific facts about these things. \n\nI still can't wrap my mind around the wine glass not tipping over, so I have quite a bit of research to do.\n\nI'm also seeing if my side of the bed is worse than my wife's side as well", "That doesn't really have anything to do with weight difference, that's just a preference to different mattress styles. Most people will just compromise on mattress style, but buying separate mattresses is another option I guess. \n\nIf you have the right size bed you shouldn't feel the other person moving all the time unless they're encroaching on your half of the bed", "I had an old school double pillow top, that you could actually flip over and rotate and all that jazz... And it lasted like 20 years until I got lazy in a move and decided to just get new furniture... All the new mattress out suck tbh. And why tf did they stop making flippable mattresses???", "I must have a unicorn because we have a 15 year old sealy with a memory foam pillow top and it's still amazing despite our very fat asses using it daily for 10 years. It's our spare room bed now because we upgraded to a king, and it's still so comfortable that our friends look forward to sleeping on it. Like, they speak of it wistfully. In the meantime, we're on our second king size mattress because the first done lasted not quite 3 years. We have a ghost bed now but I do wish we could find that model of Sealy again.", "Yes!!!!!", "My husband and I had the same problem as OP with a pillow top. We bought a regular mattress and a memory foam topper and that solved the problem. No more saggy dip on his side.", "Idk what World y'all live in but I care if my partner is getting a good sleep. I care if he has a bad day or is having a hard time with something. I would work with him to fix this even if It was my own bed in my home, I wouldn't just say oh tough luck sink away.", "Doesn't sound like they have a good mattress that's meant to be flipped if it has a head and foot end difference", "He doesn't want to flip it.  He wants to spin it.\n\nDid you read the post?", "but he’s doing it specifically so that he can have the non sagging side. that’s an asshole move", "I rotate myself💀", "If the sunken spot is currently where the bulk of his weight lies, then it’s likely in one of the upper corners where his upper body lays. Rotating the mattress would put the sunken spot in the opposite lower corner, where her lower body lays.", "Flipping the mattress so the sagging side is under her isn't the only way to flip the mattress. They can always flip is so it's under his feet instead. I don't think OP's BF actually wanted it under her side.", "Yes what IS this??\n\nAfter this suggestion  I 'd be suspicious of every suggestion  he makes because he clearly is looking out for himself and not for me.", "Yea. Like you’re supposed to get like 8 hours of sleep a night so being in bed any more than that isn’t what the mattress is made for. It’s strange", "the wine glass is pretty close to tipping over xD they dont jump full weight, it shakes a fair bit, and they do it at a distance - kinda cheating lol\n\ngood luck on your scientific quest, let me know if you find results lol", "Can confirm the whole wine thing is true, I tried it when I got my MF bed lmao.", "I'm the small person in my relationship, but my side is significantly worse because I sweat like a donkey at night.", "Yeah this is a modern \"no flip\" mattress aka a crappy one", "lol, that part is just her own hangup. She doesn't like that if they rotate it, where their feet used to be will be by their heads. (Aside from the sagging concern).\n\nDisregarding that there should be a sheet in between, which can and should be washed, which has probably accidentally been flipped more than once when putting it back on anyway, and that most people use pillows underneath their heads double-anyway I guess.", "I wonder if OP didn't consider flipping the mattress along the shorter axis, so the sagging side is still on the BF's side. There could easily be miscommunication. I don't see how he's an AH here. Both are going to have to compromise something. I also wonder if their bed doesn't have mattress supports underneath. All of the beds in my house except one have some kind of mattress support that covers the full size of the mattress so sagging wouldn't happen unless the supports themselves broke or caved in. The one that doesn't is an old one that has some sagging problems but it's like 20y old at this point lol OP's mattress shouldn't be sagging after one year though", "Upside down & back to front. Winning!", "EXACTLY my point", "No where in the post does OP mention that BF specifically wants it to be flipped so the sagging side is on her side. That's not the only way to flip a mattress. Why are people assuming BF has selfish motives when it's clear there's probably a miscommunication issue going on?", "[removed]", "Modern “no flip” mattresses are not crappy. Every high end mattress is made this way now for a reason. Flippable mattresses essentially had to have two sets of materials inside them. By making only one side of the mattress suitable to sleep on, manufacturers are able to put much thicker and more durable support layers from bottom to top, with a softer “comfort layer” on the top. I worked in a mattress store for 5 years. Old flippable mattresses are garbage and far less supportive than modern ones.", "he’s an asshole because his “solution” is just him getting the better side and her dealing with the shitty one. i definitely agree that the mattress does sound like a piss poor one", "OP says they can't flip it that way because the mattress is designed so there is a top and it can't be flipped onto that.", "why am i getting stalked by bots?", "There are certainly good no flip mattresses and bad flippable ones. But you can also still get the good kind of flippable mattress if you know where to look. Ours is a handmade, traditional one made by a specialist company that cost a small fortune but is already holding up a million times better than the expensive no-flip one we had before. \n\nI know the cheap open coil flippable mattresses suck ass but so do the more expensive memory foam topped no-flip ones. You might have sold them but we slept on one for 5 years before it had to go to the tip and I'd already had to do \"mattress surgery\" to remove the compressed memory foam and replace it with a topper at around year 2. If there's an internet movement based on having to hack these mattresses back into useability that's hardly a good indicator of their quality."]}