{"id": 18315, "submission_id": "13tggcv", "title": "AITA for calling my friend delusional?", "selftext": "Okay so for background I (23f) am friends with this guy (36m). He doesn't have kids nor a significant other. He wants kids but he doesn't want a baby mother or that\"drama\" So he's been looking for a surrogate. He asked most his friends and they all said no. He asked one friend if she would and if she did he'll pay for her medical bills and she can stay with him but he doesn't want her to have any other kids or surrogate for anyone else. She said no. I told him that he's delusional to think someone would be his surrogate and not have children of their own or be a surrogate for anyone else. Now here's where I might be the asshole. He said to me he was picky not delusional. I told him he's delusional to think that any woman would want to be his surrogate with his ridiculous requests. Also with the edition of wanting to do NI because he finds them attractive. I told him he's weird and needs to get a grip on reality. He called me an asshole for not understanding him. Part of me feels like an asshole because I was kind of harsh but I don't know. Am I the asshole?\n\nEdit because some people find it confusing. He called me on the phone to complain about the friend.\n\nEdit: For everyone saying I shouldn’t be friends with him. I called him after I saw the influx of people saying he’s crazy. I told him that I will no longer be continuing our friendship because I don’t think his mindset is something I can support", "created_utc": 1685216993, "permalink": "/r/AmItheAsshole/comments/13tggcv/aita_for_calling_my_friend_delusional/", "score": 4158, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I think I’m the asshole because I was very harsh when I called him delusional for thinking any woman wouldn’t accept his request.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Professional surrogates aren't allowed to register unless they've had a live birth of their own, and it sounds like this chucklefuck has exhausted the four women he knows, so he'll realize what's up soon enough. NTA", "I mean, technically you're very much NTA for all the obvious reasons.\n\nBut I'm very concerned for you, because you're 23 years old and hanging out with a man who isn't just delusional, he's got some deeply, pathologically misogynistic shit going on. He literally wants to pay a woman he finds personally attractive so he can breed her like an animal, and then permanently separate her from her child.\n\nThe term \"Natural Insemination\" is incredibly disingenuous. Surrogacy is done in certain ways for a reason, to maintain psychologically healthy distance for the carrier among them. Bringing sex into it, particularly for his personal gratification - \"because he finds them attractive\" - is incredibly dehumanising in a process that can already be inherently dehumanising to the woman involved. He is literally talking about using a single woman as both prostitute and surrogate . . . paying to use her body for his gratification in multiple ways. The parallels with trafficking and just the commodification of women's bodies in general is grotesque.\n\nMy point is, your \"friend\" has some serious pathology going on. He doesn't need a child of his own, he needs psychiatric treatment and not to be allowed near women or children. I would suggest that you distance yourself from him for your own safety.", "Nta. He's not just delusional. He's creepy af.", "NTA He’s in some fantasy world he he wants everything to be the way he wants it. He wants certain women to do things he wants not what they want. He’s living in a delusional and kinda messed up world", "NTA. and I'd ditch your creepy friend if I were you", "nta hes got some weird impregnation fetish imho", "NTA. Your friend sounds crazy. Also, what does “NI” mean?", "NTA, I mean imo you’re just telling him the harsh truth of the reality of what he’s trying to find. He’s trying to find a needle in a haystack. I think in this situation, he needs to realize what he wants is not going to be easy to find at all, there’s picky, but there is trying to find a unicorn, which it seems he wants.", "NTA, and I would not continue an acquaintance with this person.  Everything he is being “picky” about is basically a way of dehumanizing women.  Making sure they have no agency in his perfect little fantasy.  He is being delusional but best to protect yourself and remove yourself from his problems.  \n\nDude does not have a healthy attitude towards women or pregnancy, and he’s unlikely to make a good parent either.", "NTA - Your friend is a delusional freak, and I pray to God he never has kids. You're a little off too for wanting to hang with him.", "NTA and I would bet he has an awful lot of anti-women opinions on top of it. He basically wants a child and a young woman to bang without any of the responsibility of a relationship", "Actual surrogates have already had a child, often several.\n\nAnd they do not have sex with the father of the baby they are carrying (and usually the egg is donated too).\n\nYour \"friend\" is a creepy creeper. NTA.", "No. He’s delusional and a predator, full stop. I am in the egg donation process right now and your friend is completely clueless about surrogacy. Also if he thinks all he’s gonna have to pay is for her medical bills…. He has a rude wake up call coming. The surrogate who will be carrying my egg will be getting paid 70k plus medical, plus legal. NTA and your friend needs to go to an agency and stop harassing people he knows.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nOkay so for background I (23f) am friends with this guy (36m). He doesn't have kids nor a significant other. He wants kids but he doesn't want a baby mother or that\"drama\" So he's been looking for a surrogate. He asked most his friends and they all said no. He asked one friend if she would and if she did he'll pay for her medical bills and she can stay with him but he doesn't want her to have any other kids or surrogate for anyone else. She said no. I told him that he's delusional to think someone would be his surrogate and not have children of their own or be a surrogate for anyone else. Now here's where I might be the asshole. He said to me he was picky not delusional. I told him he's delusional to think that any woman would want to be his surrogate with his ridiculous requests. Also with the edition of wanting to do NI because he finds them attractive. I told him he's weird and needs to get a grip on reality. He called me an asshole for not understanding him. Part of me feels like an asshole because I was kind of harsh but I don't know. Am I the asshole?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. This guy is a weirdo and it's quite clear why he's hanging around 20 somethings at his BIG AGE of almost 40.", "[deleted]", "ESH. IS ANY OF THIS YOUR BUSINESS?", "yes. RUN !", "Yeah this is making me think this isn’t something I can look pass as friends. I haven’t spoken to him since the conversation", "Natural Insemination.", "We haven’t talked since this conversation a couple days ago.", "It sounds like this friend asked OP, not OP just stepping in to tell him he's being nuts.", "Well he called me complaining about it so", "probably for the best. your friend wants a woman to breed and wants total control of her reproductive organs and sex life. that's insane incel behaviour.", "Oh even worse NTA. He basically wants no-strings-attached raw sex with hot women. No wonder he can’t get any takers 🙄 and if there’s a kid he wants to keep it but not the mom. Good grief he’s an AH", "[deleted]", "Then that's necessary information to include.", "That’s what I was thinking but he said he was picky and argued it so much I low key thought I was insane", "please don't listen to him. you're not insane, HE is. please consider cutting him off because he's not the kind of person you'd want around.", "NTA\n\nThe fact that he thinks he can impregnate a woman the natural way, and then not only not allow her contact with her biological child that she would carry to term… but that she not be allowed to EVER have another child?!\n\nThat’s beyond delusional. That’s horrific. \n\nIf he wants a surrogate he should go to his doctor to talk about legal surrogacy. Surrogates by nature are require to have already birthed children so that there is a safer chance for this new birth. He would also need to find an egg donar as the surrogate is unlikely to be volunteering her eggs. \n\nHis method? His method is purchasing another human’s body with the intent to use it and control it.", "Umm. Yuck. \n\nJust yuck.", "That guy is a fucking incel, please be careful.", "Why are you friends with a creepy old man? Seriously. You need to move on from this person. NTA\n\n\n\nEdit: I know he's only 36, but I stand by what I said", "NTA\nYou actually were very nice in this circumstance oO", "Obviously NTA, I am to flabbergasted to say anything else about this individual....", "OP, if he made you feel insane for saying he is creepy, he’s gaslighting you. Please don’t talk to this incel. NTA.", "NTA. If anything you’re a good friend. He really needs a wake up call and some therapy sessions.", "This guy is a creep. Stay as far away as possible. OP you are NTA", "NTA. Thats some weird shit right there. He only wants people he finds attractive? For what? He wants to see his kid be attractive? I honestly hope he never gets a kid. He sends really incredibly creepy. He’s looking at women as an opportunity to use them and then control them by saying have no more kids. But in the end…wtf is he gonna do if she does have more kids? 🤔 anyone can lie to him and say okay, for the money, but wtf is he gonna do if she does get pregnant again? Hm?", "What does NI mean? Got to love when people use uncommon abbreviations lol", "Why doesn't he just donate his sperm? Lol.", "NTA. Your “friend” is a creep and I hope you stay away from him for your own safety/sanity.", "NTA. Listen to your gut on this one, it’s screaming alarm bells and red flags for you to get away from this guy! When someone makes you feel “crazy” that’s a sign to get away from them!! Major incel vibes here", "Ew. That man shouldn't BE a father. Ever. Imagine what he would teach - or do to - his children.\n\nSo. Much. Ew.\n\nNTA.", "Sounds like he wants a wife without the effort of being liked first.", "This sounds like human trafficking", "NTA. This sounds like a serial killer origin story. Next, he won’t allow the woman to leave the house during the pregnancy, which is just a stone’s throw from chaining her up in the basement! Or I could be overreacting because I was just listening to a podcast about Gary Heidnick…", "INFO\n\nWhy are you 23 and friends with a 36yo misogynist?  \n\nHe views women as baby makers and thinks he owns their bodies if they birth his child even without being in a relationship.   What possible reason do you have to be friends with someone 13 years older than you that views your existence so little?", "Not only is he delusional, but he sounds like an awful person. He's The A. YWBTA if you continue to keep such a garbage bag as a friend.", "NTA. He sounds like a real creep and is delusional bordering on dangerous imo. Personally, I’d cut him out of my life. He sounds like the kind of guy who’d r-pe a woman & then say she enjoyed it.", "NTA, but I'd lose this guy as a friend.  He's giving very creepy vibes with his bizarre requirements so time to start distancing yourself.  He clearly hasn't done any research regarding surrogacy, so if you stay friends with this weirdo, change the subject when he brings up surrogacy or children or just smile and nod.  No way he's getting a baby this way.", "Info - what does \"wanting to do NI\" mean? Me no goodly engrish speek..", "Does your friend not know that adoption exists?\n\nNTA.", "NTA\n\nHe is eww", "NTA, but also get away from him asap", "Why are you friends with this person?", "NTA and why are you friends with this very very creepy man?", "he basically wants an incubator who he can also use for free childcare and probably sex. but nothing else! just an object. \n\nhe’s misogynistic, creepy, and f’d up. run from this friendship. i wouldn’t be surprised if he tried to propose this idea to you next. there is a reason he can’t find anyone.", "#NTA", "NTA hes delusional asf", "NTA in anyway. This man should not be allowed to have children on his own unless (maybe) he gets proper therapy.", "Um, I’m deliberately child free and offered to be a surrogate for my best friend who was struggling with fertility. I had started on hormones etc but she unexpectedly conceived.\n\nI understand this isn’t a common situation, but it’s also not unheard of", "NTA. He shouldn't have a child of his own with such issues. God forbid it turns out to be a girl child, he will turn her life into hell by putting up all sorts of restrictions under the name of protecting her. He is delusional.", "NTA times 1000.\n\nYeah this man is trying to live out a fantasy that is at best extremely creepy and at worst literal human trafficking. Please dump this friend - the tip of this iceberg is horrifying enough and I would be careful of just how deep it goes.\n\nP.S. I hope you know that he called you to complain about this so that he could guage your reaction and decide whether or not you were a candidate!!", "you’re the asshole. there’s so many other phrases for “delusional”, & if that’s really your friend you would explore those options. you never know what someone is going through so it’s always cool to be straightforward, but also kind. The two can go hand in hand, & should when we speak to our “friends”.", "Yta. You went a little too deep. Some ppl have to face a lot of rejection b4 they can grasp how out of touch they are", "Can I DM you? OP", "I think many women chose to have kids this exact same way. Often, they will choose a father at random to become NI and never tell the man about it. Two of my friends had children like this in their late 30s because they wanted children. \nTo call a man who wants a child this way, who is being upfront about it with the women he is asking, delusional is fueled by unconscious sexism in regards to the way we see single men in our society.\nWe still call them 'mother and toddler groups' and ask dads out with their kids if they are 'babysitting' for christ sake.", "Chucklefuck, lol, ll be using this term frm now on. 😂", "I’m curious what country this friend is in. \n\nIn many countries his demands would be completely unenforceable. \n\nAnd given he wants to have NI, the “surrogate”  would likely  legally and biologically BE the mother. And severing those rights would be…difficult.", "I don’t get how OP is still talking to this person ?? He sounds psychotic.", "Friend between air quotes is exactly right... but the air quotes also apply to \"paying\" right?\n\nLike, he'll house her (during the pregnancy \nonly I assume, since he doesn't want baby mama drama) and take care of the medical bills of a friend he deems attractive enough to:\n- sleep with him\n- conceive and carry his child\n- give him said child and terminate her parental rights\n- sacrifice all her future decisions about procreation, since he doesn't want her to have any other kids (neither another surrogacy, nor even her own kids!!)\n\nIt's like that horror movie *Don't Breathe* with those clueless kids trying to rob the blind serial killer!", "Even if he were to accomplish all of this his way, NI and complete separation from the mother upon birth, what if the baby ends up being a girl? Would he even keep it? And if he did, how would he treat her? Truly disturbing to think about...", "1000 % this", "I assumed he wanted the surrogate the medical way but if he wants to have the woman become pregnant the old fashioned way, that’s 1000x worse than his insane demands already make him. Good lord.", "This man literally thinks he's entitled to a brood mare.", "This is a well worded, succinct summary of all the demons on display in the guys demands. Bizarre.", "Thank you explaining what NI means.  I'm an older person and all these anacronyms can get confusing and overwhelming.", "Also voting NTA. I read it out to my husband and he said, “Oh hell no. He’s delusional AND creepy AF!”", "When the kink goes full circle and becomes Catholicism", "Good luck on your baby journey 💕.", "He wants a clone", "It's not only that. He wants to control the lucky lady who would win this brilliant prize's reproduction for the rest of her life as well.", "The age gap is creepy, especially with his mindset. I fear for everyone’s safety around him.", "Also unsolicited advice… please be careful  around this friend. I had an older male friend spike my drink… not saying it’s going to happen but I want you to be safe always.", "NI means natural insemination", "Considering how his mind works, I really hope he doesn’t 😭", "Depending on how he's asking people, it might actually qualify...", "I didn’t realize he had these types of thoughts when we became friends. This is the only time I’ve ever heard something so absurd come out of his mouth", "Nah that’s valid. I’m thinking the same after these comments", "Natural insemination", "He was nice when I first met him", "Is this guy a drug buddy? I can think of no other reason a woman your age would be hanging around a creep like this who is that much older than you. Definitely sever ties with him, and you need to develop tools to determine which people out there are safe, normal people to be friends with. If you've been partying with people like him, I hope you consider getting clean and going to therapy.", "If the US that is correct. We are trying at home insemination with a known donor and we have to have an outside party witness that it is indeed being done by a kit and without sex. If it were to be done with sex, the donor is legally the father.", "This post sounds like human trafficking:(", "He'd literally rape her and let other people pay h to rape her\n\nThis post is fucking psychotic", "I know. I didn't realise what NI meant. He's scary.", "Please💀🤚🏽", "Your friend (hopefully ex friend) has a breeding fetish and views women as fuckable objects.", "Ah I see, I've never seen that abbreviated. It's not used in sentences very often lol", "It absolutely qualifies as human trafficking", "Thank you! (Also, facepalm. That is one weird dude)", "Not a drug friend met him at church years ago. He only drinks and doesn’t smoke or anything. I thought he was cool cuz he was a church friend that was nice mostly", "Possibly? \n\nBut I’ve unfortunately met a couple men like this who want to raise a kid without then”taint” of a woman interfering in their parenting ideals. They usually tend toward the incels spectrum…want to raise kids to think the way they think.", "don’t forget she can’t have any other kids afterwards! who could pass up such a sweet deal. i think i just threw up in my mouth a little. nta.", "He wants to fuck a woman and then permanently take her baby from her lol", "Lmao I already go to therapy for my own stuff but I think my therapist would say cut him off", "What’s you’re deal dude? Anyone who realizes someone they knew was shitty suddenly has to be treated for it professionally?", "Therapy ? You are joking, aren't you ?", "You’re welcome. Incredibly weird!! I hope she stays safe.", "INCEL says they are picky", "he has a forced breeding fetish. warn anyone you can and run", "He's not nice. He's an incel/predator and has a terrible attitude towards women. Just because you met him at church doesn't mean he's a safe person to be around. Please try to avoid him and especially don't be alone with him. Do you have friends your own age?", "This is not a funny story per se, but \"met him at church\" is very funny indeed in context (in a dreadful, creepy, *quelle surprise* kind of way). Drop him like a hot rock and seek out better friends, I think.", "honey all the men at church want to breed women like livestock, some of them are just more obvious about it than others.", "Yes, that is human trafficking. Paying someone for a human is human trafficking.", "OP and I have already established a relationship. Why are you butting in? Asshole Enthusiast? Name checks out, lmao We've \"spoken\" before this post. Who the hell are you people? Wtf is wrong with you?", "[deleted]", "Yeah of course I do. He’s just one of my older friends. I don’t go to that church anymore either", "Yeah, the guy is a creep in the extreme. OP should definitely distance herself from him permanently.\n\nThat doesn’t in any way jumping to wild conclusions and blaming OP for this in any way. We’ve all learned the hard way that people can be awful.", "I'm confused, you think surrogacy in general is human trafficking?  Surrogates are usually paid", "A relationship? Creepy thing to say", "you haven't established shit", "You should seek professional mental help. I've never read anything more creepy than your comments.", "You do know these posts are public, right?", "We have all met people we initially liked but eventually turned out to be problematic. It's a part of life. None of us has a creep radar, plus people might start out all right and then take a turn for the worst. \n\nYou don't have to excuse yourself for having that friendship. But now that this friend has shown who he is, it's OK to run.", "Actually in many places surrogates very specifically CANNOT be paid... only their medical expenses and other pregnancy-related costs. To stop this exact situation from happening", "This is not how surrogacy happens", "Right??? He’s projecting. Don’t think OP is the one who would benefit from therapy.", "Thank you I lowkey feel like some people are blaming me for not realizing he would be like this", "You haven't done anything wrong. These men are master manipulators. I got sucked into the trainwreck life of one who I thought was super smart and accomplished when I was late 20's and he was early 40's. Nope, just a VERY charming asshole with no control over himself or his life. It took me years to figure it out.", "There is people like that all over Reddit.", "Seriously, don't blame yourself. I am 43. Even now, people I have known for years suddenly take a sharp turn for the worst and act like assholes. Out of the blue! It feels awful, as if the floor under your feet has been snatched, your heart hurts for the friendship and the emotions you had for that friend, and you might even start doubting the healthy relationships around you. But it happens to everyone and it happens more than once. \n\nThe only trick you need, is to be ready to distance yourself from such cases, after initial conversations prove fruitless. Suppress the guilt, and don't wonder if you might change their mind eventually ; you could possibly have a chance with someone your age, but not someone that older. If you still feel bad about leaving, remember that one of the best things we can do about the world is not to be bystanders when others behave badly. Leaving the friendship is safer, best for him and best for you. Onwards to people who don't make you feel insane.", "I thought you had to have already carried a child to be a candidate for.... oh.. oh, he wants to have sex with her. Oh no.", "NTA and a 36 year old wanting to be friends with a 23 year old is a big red flag! I would reconsider this friendship.", "NTA and your friend seems like a sexist creep. I don’t think I would be friends with him anymore lmao. I know 23 feels very grown up, but there is a BIG age difference there, and a lot of life lived in the years between. If he were normal I wouldn’t see it as an issue, but this guy, again, seems like a sexist creep.", "There used to be this letter sent around the area I lived looking for someone to “produce an heir” the conditions were insane: the woman had to be 18-24 and her mother had to be under 50, they offered $1000, the child was supposed to live with the woman full time and he wouldn’t pay child support but would assume custody occasionally “for special events”. This has the same energy", "NTA. OP spoke the truth, we all know the execution is not good and everything become ugly, but the truth is not always pretty.\n\nHe is delusional for wanting someone to have a baby for him and only for him, but rejecting emotional attachment with it. Babies are not a toy, if he is not ready to have a relationship with a woman, how is he supposed to have a relationship with his child? He needs to get his shit together.", "I could be wrong, but Most women can't be surrogates unless they've had a pregnancy/birth of their own. Also, if it's a true surrogate situation, why would her having other kids matter unless its her egg being donated, they wouldnt be related? Or does he think  he's just gonna knock someone up and they hand iverthe kid no strings attached? That's not surrogacy...\n\nETA NTA here. He's weird and creepy.", "What if she changed her mind about having other kids? What would he do? Force her to terminate?", "NTA. That mans a weirdo", "NTA - you were not harsh ENOUGH", "Definitely NTA. Just hearing this guy's demands gives me some strong Criminal Minds vibes. The most disturbing part of all of this to me is his desire for NI + all of the demands he's making. What he wants is a concubine, not a surrogate", "NTA \n\nThis person you know is absolutely delusional.   If he truly wanted a baby, he'd go about finding a surrogate in a more above-board/regulated way as opposed to trying to control the reproductive choices of females he knows that he finds attractive. \n\nThis person is not a friend to you or any other females he knows.\n\nKnowing that he thinks he can screw a baby into someone, keep the baby, and tell that someone they aren't allowed to have other children makes it clear he's really looking for a sex slave to breed.", "Daaaaaaaang he’s not just delusional. He’s actively disgusting. NTA", "I'm pretty sure it's not legal to surrogate without having had at least one kid. What he wants is to impregnate someone and have her be available to parent without actually having to marry her or give her rights to the kid. \n\nYou're NTA. Your friend is, uh. Something.", "This is TWISTED. NTA but you may need to find a new friend. He is delusional", "NTA but stay away from him...there's trouble brewing", "NTA\n\nIn other words he wants an excuse to screw his hot friends with no strings attached. Why are you friends with this creep?", "NTA but also depending on what country you’re in, surrogates are often/usually/legally have to be solely the carrier/protector/grower of other people’s genetic material. Your (hopefully soon to be ex-) friend wants someone to give him their baby.", "Nta. He would be a terrible parent I hope he fails at tricking someone into doing this.\nIt’s also weird that he’s friends with you. A huge red flag.", "NTA why are you hanging out with old vulturous creeps like this dude?", "Your friend is essentially treating women like livestock to breed.\n\nNTA", "He wants to fuck a woman, make her have his child, and presumably (since he said she could “stay with him” as long as no other children were involved) use her for free labor but not be required to do anything for her in return like you would if you have a partner.\n\nNo, that’s not how it works.", "NTA , but the way you describe your friend and his actions makes me think he shouldn't have kids at all.", "NTA - \n\n1. he doesent own the surrogate's body he doesent get to dictate to them that they cannot have other children\n2. he is 100% delusional\n\ncouple that with the idea that he wants to have sex with them as insemination is fucking weird\n\nhe is a fucking creep, i cant think of a single person who would consider his criteria of \"my child is the only one you are allowed to bear and we have to have sex, no turkey baster\"\n\nas delusional, unreasonable and creepy as fuck, i can see why he is single.", "NTA. I had a friend that wanted to do the same thing but this was a woman. She kept having unprotected sex with tinder dates and lying about not being on birth control because she wanted a baby. It pretty much was everyone in my social circles breaking point and everyone cut her off.", "NTA. Please be careful & stay away from this man. He's dangerous.", "NTA, what he’s describing is not a surrogacy situation. “Naturally inseminating” IE fucking a woman he finds attractive, a woman who can’t have other kids mind you, that he then wants to take the child from. That’s not how any surrogacy works full stop. He’s just delusional and a freak.", "NTA. This friend should seek out some therapy, because none of this is normal.", "Yeah I didn't really get why you are friends with him while y'all are 13 years apart. He was in his 20s when you finished high school. But NTA and yes he is delusional.", "I wouldn’t call him delusional or picky.          \nI will call him entitled, controlling, and possibly antisocial with misogyny.       \nDoesn’t surprise me at all that every single one of his friends turned him down.        \nAs far “drama” perhaps he needs to look within.", "NTA and run from this guy.", "Nah NTA, a good friend calls out friends on their bs when needed, and you did. He IS delusional and very obviously sexist. I hope he doesn't get to reproduce at all.", "Obviously some huge issues with his plan. HUGE! \n\nAnd here is one more issue: he pays the woman to be a surrogate, houses her during the pregnancy, and then goes to court so he gets 100% custody of the baby.\n\nGuess what happens next? The judge refuses termination of parental rights, and the sperm donor/creep asks for child support. \n\nConveniently, I think most women are smart enough to not sign up for this idiocy.", "NTA, glad to see you got away from that creep before he could do something to you. He doesn't want a kid, he has an impregnation fetish and a weird ego.", "NTA. The truth is he IS delusional. He wants to completely control a woman without giving her the security of commitment in return. That's insane. I'm glad to read you're ending the friendship and you're NTA for that too.", "NTA\n\nI think this friend heard about *The Handmaid's Tale* and thought it was a great idea", "NTA. Just block him, warn your friends what a creep he is, and move on.", "Glad to see your edit.  Because you are not his friend, you are his prey.  Block him on everything.", "What is NI?", "NTA. Dude wants his surrogate to not surrogate for anyone else OR have their own kids AND he wants to F them for insemination because he finds them attractive. \n\nThis isn’t picky because the woman he asked is a person, not his personal breeding stock. Nothing harsh about that truth being told. He needs to get over himself and realize maybe THEY don’t want any of that with HIM nor do they want to leave children in his care.", "YTA\n\nThis is one of those that scenarios reveal the gender bias of AITA. If a woman wants a child without the complications that come with of a boyfriend or husband, it’s totally fine for her to go to a sperm bank and get AI. If a man wants a child without the complications of a wife and wants to find a surrogate he’s a creepy weirdo who you should cut out of your life. WTF? How does that track?", "ESH. His requirements don't make much sense, but it sounds like he's at the beginning of this process and needs professional help with it. I thought most surrogates were already parents because it made the whole thing easier if they had had successful pregnancies and had no overwhelming desire for their own babies. It seems like the kind of arrangement he wants should be done through an agency or a lawyer with a contract in place. I don't think he's delusional, but I'm not gonna harp too much on using clinical words incorrectly as insults because I'm certain these comments will include plenty of that. He is wrong and sounds kind of ridiculous, but you were definitely way harsher than is necessary and doubled down on delusional when its not accurate. Basing this on your post, haven't looked at other follow-ups.", "This is what I was thinking too? Aren't those who choose to be surrogates already had to have given birth before?", "Gestational carriers are those who have no genetic relationship to the fetus. Surrogates are often also the one who provided the ovum. (Learned from Mama Dr. Jones.)", "Not only all of this but also the DEMAND that they never have any other children?? Like he owns them after surrogacy, dictating what they can and cannot do with their bodies and lives??? Insane.", "Not to mention that “paying her medical bills and housing her” comes nowhere close to the typical price of surrogacy. You can expect that the pay for an egg donor plus surrogate is $150k ish. He’s offering what.. 10k? Please talk to your friend because even if she wants to make some money, there are far better ways. And please spread word among your friends what a creep this guy is especially with regards to suggesting NI which is very rapey at best. I would avoid him like the plague", "This dude sounds very much like Ariel Castro types. Like keeping someone prisoner as a baby machine. Scary as hell.", "Women are not livestock. Your friend is sick.\n\n\nNTA", "This guy does sound very not right in the head. But if a man who went through all the correct steps and seemed to be sound of mind. Do you still think there is a problem with a man who would simply want to raise a child on his own?", "This, op. Read this again. And then again.", "Basically the guy sounds like he wants his own Handmaiden’s Tale.", "Can you imagine someone with this thinking raising a child by themselves? I know it happens, but I definitely wouldn't be a part of encouraging it.", "If she agrees to be a surrogate, it's not \"her\" child.", ">bang without any of the responsibility of a relationship\n\nI'd be less upset with this creep if all he wants is casual sexual relationships with women.", "He has to find them attractive because NI apparently means natural insemination 🤮", "Yeah. He doesn’t want “his” child to have any siblings so he rather they don’t have any other children whether for themselves or others", "WTAF this is weird as hell tbh", "He specifically wants a woman to have sex with him get pregnant give him the child and give up rights. As well as not surrogate or be an egg donor for anyone else and also to not have kids of their own either before or after being his egg donor and surrogate", "Delusional is not strong enough.", "Yeah but he doesn't wanna hire someone who's already a surrogate. He's asking his FRIENDS to have sex with him and have his baby. Completely different from a sperm donor.", "My mom had me by donor insementation and went through a sperm bank to do so. Since it was an agency, it was an unknown donor and my mom signed papers saying she wouldn’t track the man down for child support.", "It’s not legally enforceable. But I hope that OP talks to this woman and convinces her what a horrifying proposition this is. Their friend group should also know and if they are remotely decent will shun him.", "They're just quotes. Air quotes are when you do it with your fingers.", "I was going with narcissistic", "I'm not that young myself . . . when the OP explained it in one of her comments I realised just what was going on here, and I thought, \"I'm old enough to be this girl's parent . . . if she was my kid, I'd be terrified if she were spending time around someone like this.\" I wanted to clarify for her, in case she wasn't seeing the bigger picture, just how dangerous this guy is. Terrifying.", "I’m in my early 20s and I had no clue what NI means", "Natural Insemination... basically he wants to get her pregnant the original way", "I would block him. The amount of sheer... entitlement to women's bodies is gross. I am concerned for your safety because these kinds of \"friends\" can quickly go from seemingly stable and nice to \"I've been your friend for X years, you owe me\" stalker/r*pist etc. \n\nI can't begin to express how concerning it is that he thinks he can demand that a woman have sex with him, give him her only child, and never procreate again. Not only is he delusional, he's sexist and *dangerous.*  These are not the kind of people for whom \"consent\" (or lack thereof) is particularly meaningful.\n\nAs someone almost this guy's age, I beg you to block him and move on. No good can come from seeing him again.", "Now, you know. And as folks like to say, when someone shows you who they are, believe them.", "there’s a reason men like this don’t try to befriend women their own age…don’t feel bad now you’ve seen it for yourself and will avoid it.", "Yep it was so weird, it would just be sent around the area every few months I hope they stopped because he gave up not because he found some poor sucker.", "Yeah, you were right. DELUSIONAL", "NAL, but I’d check with a doctor bc in most places in the US, it has to be done in front of a doctor/licensed professional even if it’s done with a kit, or they can still legally pursue parental rights", "Sperm banks typically have legal cut out and protections and work to protect their clients. \n\nWhat this guy wants has none of those protections.", "Yeah, that's where my mind went, too (unfortunately), but I thought maybe I was crazy thinking that.... the more I think about it the worse it gets.", "He's a narcissist and he's fucking gaslighting you. Kick his ass to the curb!", "Church? Well, that explains a lot. That's usually where predators hide.", "[deleted]", "🙌", "In California, the sample has to pass through a doctor’s hands. Most legal agreements like this are unenforceable because the rights belong to the child, not the parent.", "A relationship could mean acquaintance, friend, coworker, partner, lover, etc.\n\nJust because you don't know what something means, doesn't make it creepy. 😂", "What did he say his comment got deleted as I was reading it", "Surrogates are definitely compensated for their time in many places. But they also have lots of protections to ensure that a couple is using surrogacy for the right reasons. This is a great case for why that should be so", "It is in Canada. We can’t be paid anything except proveable expenses like maternity clothes, medication, and time off work for appointments.", "I think the majority of people are just worried about you and hope you can safely exit the friendship!\n\nIgnore the trolls who just need any reason to get angry.", "No one really knows this right out the gate as a young adult. But you can probably bet 99% of the time a guy that age hanging with people your age is a loser. When I was your age I thought it was just mildly creepy, but now that I'm closer to 40 I realize that someone my age has almost *nothing* in common with someone your age and that 39 year old who kept trying to hit on me was a huge loser.\n\nEspecially in this era there's just not a ton of common ground. That's nothing against you at all. We just grew up very differently. Like, I remember what it was like without in home internet or cell phones and you likely don't. I don't understand so much about younger people these days, but your generation is full of wonderful people who are very open and caring.\n\nThis isn't to say that you can't have friends that are older than you, but if they seek you out and the friendship doesn't evolve naturally it's probably bad news.", "Yep true, but I'm in Canada where surrogacy is considered altruism and legally cannot be compensated monetarily. They can be reimbursed for things but not paid for their time! I think it's the same in the UK, Australia, New Zealand, etc.", "I wish. I’d be a surrogate but in Canada we can’t be paid and god knows I’m not puking my guts up for 9 months just to have my expenses compensated.", "Afaik, it's the same in the UK, only expenses related to the pregnancy can be reimbursed.", "No shit!", "so women do it for fun?", "NTA. And if he does manage to obtain a child I’d be reporting him so the child can get some welfare checks. He sounds absolutely insane and creepy. Stay away from this guy.", "Tell him before he finds a surrogate, he best talk to a lawyer.  Some states do not recognize surrogate agreements.", "What a gross, creepy, misogynist. He clearly only views women as an incubator to carry on his less that subpar genes.", "NTA\n\nGood for you for setting boundaries and ending that friendship. Feels like he was trying to groom you and brought it up to see if you'd be up to the idea of it as well. Soooo creepy :|\n\nIf you have a friend who's wholesome and sweet and makes you laugh, I'd contact them just to remind them how much you appreciate them. If you don't have a friend like this, you deserve one 🩷", "NTA, let me guess. \"Surrogate\" is incel term for *\n\"girlfriend\"\n\nYa this is super fucked.", "What is NI?", "Absolutely NTA. This bloke needs mental health intervention, help and treatment and should not be allowed to adopt.", "Consent is King!", "So many WTF's here but I will focus on one-what was his logic in demanding no other kids?", "NI?", "Your Not the A**hole. Because I believe the guy has issues and needs to see a psychiatrist. Too many predators in the world.", "NTA you're quite right he's way too ott if he expects a woman to carry his child and no one else's ever not even for her own marriage.", "INFO- please explain further when he said he didn’t want “drama”", ">Also with the addition of wanting to do NI because he finds them attractive. \n\nYUCK.   NTA.\n\nGlad to see you are going to ditch this guy.  He is a creep.", "No", "NTA but you could have found a better way to say it.\n\nFwiw, your friend is bananas delusional that any woman would be his surrogate, live in his house without a relationship, and not seek her own companionship. Life isn't a Sims game.", "Of course", "NTA. Your friend is delusional and absolutely should not have a child. I’m not even sure he should ever be allowed to be a sperm donor. Who the fuck says they don’t want “baby mama drama” but also wants to personally breed their surrogate because their hot?", "NTA. Odd, but I seem to have read this same scenario before...", "NTA. your friend IS delusional and CREEPY. I’m afraid that if he doesn’t get what he wants he’s resort to something worse. women need to be protected from him", "ikjuiiiuiiiiiuiiiiiuiiuiii5iuiuuuuiuuuiiiuuiiuuuukiuuuijiuiuuiiuuiuiuuuuuiuiuiiuuiuuuuuiuuiiu⁸sßc", "op call the police or something. or at least like talk to your friends and the people in the same community with him about this weird fetish shit he has going on. bc he seems the type to escalate to even more creepy and ugly stuff. block him, tell your family and friends about this guy, in writing as well. and if he ever contacts you again, run. this man is a creep. NTA.", "Maybe see if you can report him or have him on a watch list or something. If he's this young and already thinking this way, he may actually be the kind of freak who kidnaps a girl and keeps them locked up. \n\nYou may be able to save some lives. Please look into it.", "NTA and heavens pray for that child if it is a girl.\n\nSide note for anyone who has had a woman friend suddenly stop taking your calls. Its because you're a creep.", "Not the asshole, what he is looking for is a wife. Good on you for calling him delusional. Maybe he will come to the conclusion he is or not. but thats also not your problem", "Hm. Well, youre NTA, but I think you could have handled it better. Pointing out that the surrogate would probs still WANT their own kids and that its rude to suggest that they absolutely cannot have any is a start", "No, you’re instincts are kicked in bc you realize on a certain level of what he wants with his persistence & how psychotic it is. Stay away from him before he tries to get his way with anyone including you.", "YTA \n\nCreepy to me, obviously to you, and I would never want that. But if two consenting adults of sound mind agree to mutual understanding and contract that benefits both and doesn't harm anyone, who are we to judge. It's a free country and I don't see anything illegal here either.", "I think delusional is a word that can offend people. You could have chosen kinder words. But he definitely seems to be seeking something unrealistic. So I think YTA. Sorry.", "Ugh. I'm sick of how people label things these days. So he has his requests, so what? If that's what he wants, then that's what he wants. He's laying it all out on the table prior to the entire ordeal. It's then up to the woman to decide if she can accept the details or not. He's not forcing himself upon anyone. This would work if he found someone who would be willing to help him but doesn't want any kids of their own.", "NTA\n\nYour boyfriend on the other hand is.", "Considering Creepaziod isnt trying to do this is any sort of proper fashion...he may not figure it out.", "> He is literally talking about using a single woman as both prostitute and surrogate\n\nAnd egg donor. A surrogate is simply who carries the pregnancy and delivers the baby. He specifically expects some poor soul to carry their *own* biological child with him and then simply be cool with giving it away to him. He needs to be on some list somewhere, and I *don’t* mean a waiting list.", "On a less serious note, why is a 36-year-old man complaining to a 23-year-old about this? Do you wonder why he doesn't have friends his own age? I'm glad you've distanced yourself. This whole thing is yucky.", "Not only that, she needs to report this to the police. She already knows several people have been asked so there's proof. He's crossing the line from delusional to dangerous. He needs to be contained or god knows what he can do. Please report this.", "I didn't realize what NI meant. It was bad enough without that. Finding out what he meant made me feel physically sick", "All of this. I’m pretty sure I just watched this on Law and Order SVU!", "Thank you for clarifying what \"NI\" is.  Google failed me.\n\nAnd yuck.  This guy is gross.", "Plus, she has to sign away her right to have more children. He's disgusting. NTA", "This was my first thought. Glad to see you've broken off that friendship, OP", "As soon as he called women “drama” as his reason for this, that was 🚩🚩🚩🚩", "No, but really. Two of my coworkers are late 30s men who are constantly trying to hang out with the 21-25 year old woman age group and it’s soooo damn creepy", "He is absolutely delusional. Who in their right minds would fuck this guy so they could give them a baby?", "Surrogacy I find kinda creepy but it isn’t uncommon. His insistence to “naturally inseminate” (fuck them) is just not how it works.", "wtf dude", "There is no shortage of sperm. Surrogacy is a whole level of commitment and this guy is 100% deluded if he thinks one of his friends is gonna fuck him then deliver a baby then not have any babies of their own", "This guy wants to fuck one of his hot friends so they can give him a baby then he doesn’t want them to have any other babies of their own. But doesn’t want any of that “baby mama drama”. This is a lonely lonely man that likely hates women and doesn’t actually want a kid just doesn’t know what else to do with his life.", "Those women are gross. Sperm donation and surrogacy are completely different levels of commitment.", "Not my boyfriend. I’m a single person", "I was really happy to see your edit. Please stay safe. If you live with anyone, please make sure they know what he looks like. Guys like this don't like to be cut off.", "That’s what I’ve heard every single time it comes up on the internet, although I can’t say for sure. I mean, it makes sense", "And another layer is that in the US, if someone were to be a surrogate, they also have stipulations that you have to have successfully been pregnant before and delivered. So his request of never having had a child, can’t happen either.\n\nThis guy is seriously creepy.", "Just because he's decided that he deserves that child. Maybe nature did the right thing after all, oml.", "I was thinking of that movie too.  This guy seems like the type who would lock a woman in his basement.  Since he doesn't want her to have any more children, would he even let her go?", "I thought it was a typo! 😳", "THIS. Make a report and make sure it is documents. This is how women end up in basements for years on end.", "That’s not even close to what they’re talking about here!\n\nGuys can want to be parents and not want a coparent- this guy wants a woman he can screw, impregnate, take the child\nTotally cut her out of the child’s life AND demands she never have any other children.\n\nThis isn’t about a man wanting to be a parent- this is about a man treating a woman like a broodmare only it’s SO much worse as in that case the guy isn’t actually screwing the mare (we hope) and he’s not demanding she only breed with him.\n\nNTA- but you need to get away from this guy talk to the friend and show her this post so she knows just how pathological this man is and he should 100% be on some kind of list", "No, there are women who want to and do so. I don’t think there’s anything wrong with a ‘good sound’ man wanting to. Just like the woman should be of sound mind and etc.", "Yes, men are allowed to have children via surrogacy thanks to the LBGTQ2S+ community fighting for their rights. They are not even close to the same situation.", "For real 😂", "This just went from \"creepy\" to \"fully psychotic\" real fast", "did he think he owns the woman? what a creep", "I hope you take all this advice to heart.  This guy is creepy and potentially dangerous.", "I'm not throwing all dudes under the bus for wanting to date younger, but this guy gives off all the \"creepy, controlling, pervert\" signs.", "Are you trying to say he wants to fuck you?\n\n>  Also with the edition [sic] of wanting to do NI because he finds them attractive\n\nWhat does \"finds them attractive\" even mean in this sentence? What are the \"them?\"", "What does that mean", "Men love to find young women to be friendly with. It has nothing to do with drugs.", "He’s getting around that by wanting “natural conception”. Then he doesn’t need a surrogacy clinic etc.", "This only applies if you are going though an agency. There are no such rules for private arrangements.", "YUCK", ">I know. I didn't realise what NI meant. He's scary.\n\nSame. I thought it meant Northern Island and I was trying to work out what was an internet euphemism for.", "He originally called OP to whinge because everyone he’s asked has said no, so I don’t think there’s anyone needing to be rescued out of this situation thankfully", "I’m 30 and I didn’t either, if that helps 🥴", "When those older dudes refuse to date women over ~age 28….that’s usually indicative of creeps lmao", "It’s an abbreviation op made up", "The women he's trying to pay to be surrogates", "Conception through penis in vagina intercourse instead of through the turkey baster method or IVF (in vitro fertilization)", "This man is not your friend. He is not a friend to the other women in his life. He has fostered relationships with women he deems fuckable and worthy of carrying his offspring. He is looking for someone to surrender their rights to parenthood so that he can have a child. Stay away from this man. There is a reason that formal surrogacy arrangements exist, and he is trying to avoid them in order to exploit women in his life. \n\nHe may feel misunderstood. I'm sure it happens every day. Because he sees women as objects and society has largely moved past that. He is not picky. He is more than delusional. He has likely categorised you as above- someone worthy to fuck and have his child.", "Lol Church, the other place where incels/ creeps thrive. NTA fucking run!", "You would think, but in the US and Canada, there are actually very little regulations. Search up the words sibling pod and Laura High.", "I was kind of leaning that way. When I googled it, they said NI meant 'No Idea.' There was no way she meant that, so I was figuring it was it was a trade abbreviation.", "Oh! Thank you 😭", "Not all liberal stars are so liberal on this issue.", "There are some places where surrogacy is not legal specifically because it is considered human trafficking. Personally I think it's a very gray area", "I've been saying the words to every young woman I can that he doesn't think your mature, he's trying to groom you. Thankfully they know I speak from experience and trust me, and have no problem recognizing these types of terrible men.", "NTA: And I would be concerned that what's going on in his head is more sinister than merely \"delusional.\" It sounds very weirdly controlling and more like some sort of fetish he wants to do \"natural insemination\" (i.e. have sex) with a woman he wants to live with him and never have children other than his, who he won't marry, and who won't be the children's mother because he is a single parent.\n\nThat's not \"wanting to be a single parent.\" That's wanting a baby factory and semen repository.\n\nI'd be worried exactly what he wants the kid for, too.\n\nThere's a whole lotta red flags here.", "He's delusionally picky, he doesn't want a surrogate, he wants to buyout part of someone's body, and pay as little as he feels necessary to justify his delusion, dude's crazy and needs some help. I'm even afraid he might want a child the same way some people want a pet but without the hassle, to the point that raising d caring for them will come second or third or even lower on their list of priorities, like buying random hobbyist stuff but letting it to gather dust.", "NTA  This guy sounds like a crazy misogynist frankly. I think the commenters understand him perfectly.", "Glad you won’t be continuing the friendship. It’s weird to be possessive over someone even if you’re with them. Let alone to try to control someone else’s body.", "NTA, surrogates make like $80k and get their bills paid I'm pretty sure. No one would take that deal. And why does he care if they have their own kids later??? What? He's trying to trap your friend isn't having a legal tether to him for 18 years, you don't have sex with your surrogate and she would be the legal mom with legal ties to the baby unless they did this through a proper IVF doctor", "Why does he so desperately want a child?\nI'd be seriously worried about a child's safety with this guy. Does he want to breed his own little sex toy? Yikes, this guy shouldn't be anywhere near  women or children.", "You’re NTA but you’re friends with a man clearly associating with you before you’re 23&female, considering he is likely a patriarchal misogynist who associates women with “drama” and shouldn’t be having a kid at all, much less discussing his options with a young woman who, in theory, he doesn’t respect the opinions of if he won’t respect the opinion of the mother of his own child he is requesting like a custom car job. Legacy involves being able to work through thick and thin with people for higher purpose. He deserves none with his approach and we don’t want more of him and what could possibly come of how he would raise a child. That poor kid will have a serious lack of maternal care if he is to be successful. \n\nYour position unfortunately won’t help. It is not your place necessarily to insert yourself in the situation so best tell the dude:\n\nYou wouldn’t ask a lawyer for advice on your teeth or have a dentist look over your contracts. Go ask someone who knows about this stuff and not a 23 year old. I can’t help you if you don’t like my opinion so go ask someone who you respect maybe you’ll listen then.", "NTA. <shudders>", "NTA but also. . . Run. Far far away from this creeper.", "Guys a weirdo, cut him loose. Nta", "You’re definitely not an asshole and he should be grateful that someone cares enough about him to speak the truth. He’s out of his mind asking that much of somebody, especially without offering them at least a significant amount of money or something else huge in exchange like an estate with the taxes paid through the foreseeable. \nI have a child, so I never experienced what people go through that can’t. And asking someone to have his child/children and not have any of their own, he’s batshit. Or, he’s got some serious psychopathy something, batshit", "NTA this dude is psychotic and a narcissistic like he says ur an asshole when u told him the truth and that’s the good part cause why should a woman’s life be ruined by that prick he’s practically tryna claim her as his own breeding grounds with no ties. Like seriously this dude needs more than a psych ward to help him out u don’t take rights from a woman on her body and also because he ain’t marrying her. Whoever associates with him need to cut him off he’s bad news!", "Which is he a bigger fan of: Jordan Peterson or Andrew Tate?", "Wow, sad you gave up a friendship based on what strangers on the internet told you to do. But, I guess if you're that flimsy, you'll likely befriend him in a week again.", "NTA.  It's one thing to want to gather a child through surrogacy, but it's another entirely to want to have intercourse with an attractive woman and take their child away from her, because at that point it would be THEIR child not just his. I'm glad you've decided to part ways because I'm getting a vibe like this guy only sees women as an object.", "Does he read too many erotic books on forced insemination or something.", "NTA, that's not how surrogacy works. Obviously some people choose to do this but typically you get matched with a registered surrogate and they are impregnated with your semen samples. This guy just asked every woman he knows to have sex with him? I hope nobody says yes", "Honestly OP, you should send him this thread if you feel like you can do so safely, anonymously. Maybe would help him to see how much of a delusional fuckwad he is.", "NTA - he has a breeding fetish. I somehow doubt he’d take care of the kid after. Wonder if he already has kids that you aren’t aware of 🤔", "What he wants to do isn't even legal..he can't have sex with a woman, get her pregnant and expect her to just hand over the child and sign her rights away..I mean, I guess he could, but nobody is going to do that. Nobody. There is no money in the world that could convince a stable person to agree to such barbaric requests. This man sounds ill.", "Dude is creepy level 9999. Good you ended the friendship.", "Things like this are more common than anyone thinks.\n I had a nasty breakup and needed somewhere to stay, I was roughly the same age as OP and my \"friend\" the same age as hers. First, he wouldn't give me a key to the house, second, he gave me substances under the pretenses I thought it was something else, and third he offered to impregnate me and \"take care of me\" when he knew I didn't want kids, all as a way to trap me. This is 1000 percent a way for this guy to get a young woman under his thumb where she cannot leave.", "NTA\n\nI think delusional was actually pretty mild. \n\nSide note: Can we get this guy on a watchlist?", "NTA. \n\nSo your boy wants to have sex with a friend, impregnate her, and then steal her child with the expectation that there’ll be “no strings attached” and that they’ll be totally cool with it?\n\nVery weird dude.", "No. He is delisiounal. He doesn't want a baby mama nor a relationship. Yet he wants the women to act like they love him. Only want him and no one else. Yes he is quite insane. No wonder he doesn't have kids or is married. He would have asked you next. I think you bet him to the punch by dumping him as a friend. Goodbye and good ridance.", "He is litterally dehumanizing women. I hope no one gives this man a child", "EDIT from scrolling other comments, I just learned what NI means, and I think you should touch more on that in your post because holy shit, it puts an ENTIRELY different spin on this. This guy us terrifying and you need to get as far away from him as possible. (I still say that using the word \"delusional\" is problematic, as it is a valid psychological diagnosis and shouldn't be a slur, though. Not caring what you say about this guy, but just something for you to think about in your general vocabulary.)\n\nSo, calling him delusional is harsh. Name calling never helps. Also, using actual psychological issues as slurs is bad form. I agree that his demands are 100% inappropriate, but name calling never helps. Just tell him what he is asking is not appropriate to ask, that it is way too much and he is out of line. No need for name calling. I think you're smart to be ending the friendship, though.", "NTA, he's a total creep.\n\nBut, you seem to understand the acronym NI which seems a bit specific. So is this the first time his wierd creepiness has seeped out? I'm sure if you look closely there are several hundred red flags throughout your 'friendship'.\n\nYou also don't say how you know eachother. If that is creepy too, block him and move on. Fast.", "Most 23 year old women don't have friends with men approaching 40. OP could stand some more complimentary company.", "How does a blind man become a serial killer? I am never watching that movie. Just your describition makes me shiver", "god imagine being on his list of people he thinks are hot enough to ask and thinks would agree. my skin would crawl right off my body and continue to scuttle around for the next million fucking years.\n\nnone of the women he contacted are safe, hell, none of the women he ever shares air with are safe", "Yes! It’s like he watched the show and was like hmm not a bad idea 🤔", "I see your update, but I'm curious. What even gets you into such a friendship? Like, how did you *get* to the place where you interacted with him recreationally, or actually *felt bad* after this lunatic raves at you?", "Yeah I didn’t know that. Never even have heard the term. But the fact he wants to do it naturally is incredibly fucking weird. Thats definitely not apart of the surrogate process and the mom would have full rights of the child unless she signed her rights away. Which if she was smart i would hope so much that she would realize what a dickless d bag he is.", "I agree that the NI is super creepy and he’s being gross. Just because you get the ick about surrogacy though doesn’t mean it’s creepy.", "As a 40yo all my friends are varying ages - have to say though mostly in a 8 year range (either side) for compatibility reasons. Just a note for OP it's normally easier to make bonds with people within this age range of you as they've grown up with the same things (to a degree) and are often in the same stages of life as you", "I can confirm, they have to have given birth previously, with little or no complications", "You know you just made realize something. Just as much a woman could go to a sperm bank. A man can go donate and get a sugroate for kids of his own. Plus he could adopt a kid. Or ask a prositute. I have heard of some be willing to do so for big money. He has to have big money though. At the same time I am glad he has no kids. He is too childish to probably raise a child.", "He doesn’t want a surrogate he wants a ducking handmaid!", "It definitely sounds suspiciously like he wants to trap a woman into a situation where he has all the power over her children, so she’ll have to do whatever he wants. Offering for the “surrogate” to stay with him is the first step to literally getting her in the door and becoming dependent on him (for housing). After having that first child and giving up her parental rights, she’ll feel obligated to stay as she’ll be powerless to leave with the child. This sounds like the plot of a horror movie.", "Yeah, this guy doesn't really want kids,because that's not what one would do to become a parent. He has a fetish and is involving everyone around himself in it. NTA, stay away from this guy and warn your friends.", "But then why would you want a woman with no other kids? Surely a woman with other kids would be less likely to claim yours.\n\n&#x200B;\n\n&#x200B;\n\nNo, he just wants someone he owns and uses completely but has no emotional, physical or any responsibility towards", "Not sure about American Laws, fertility laws are wildly different everywhere, but another option with a known donor is to pay a Lawyer to draw up a parenting contract where the donor surrenders parental rights prior to if there is a child that happens.", "Yup. Adoption is human trafficking", "Oh god, was it on Netflix that had that show about the one sibling pod but it was because the doctor was using his own sperm and not the parents’ or another donor?\n\nI watched it and I was so sickened by it.  I felt so awful for all of the donor kids.  Especially when they confronted him and he basically judged all of them like a fucking experiment based on their perceived success in life (as determined by him).", "There are WAY more than just that one guy. The stories that Laura are giving a platform to are horrifying.", "There are way more than just that one. Look for the podcast: insemiNATION", "Oh man.  Will mentally prepare, but I need a new podcast to listen to during my runs.  So thanks, will check it out"]}