{"id": 18360, "submission_id": "13tonti", "title": "AITA for taking custody of my niece & \"spoiling\" her now", "selftext": "Without getting too into my family's history. I(28M) have been the legal guardian of my niece(17f) for the last two-ish years. So when my niece was born and until I was 20 and moved out of state. I was pretty involved in her life. My older brother that struggles with substance abuse had a daughter He lived in various apartments/motels with my niece. Sometimes he'd leave her with my parents for months/weeks. My parents have their issues as well so it's never really been a good stable life for her or any of my siblings and cousins. I always tried my best to look out for her when I was around. I worked a pizza shop in as a teen and I'd bring her home a pizza or pastries when I could. We'd play video games and do things together. Even when I was in college I would always make time for her.\n\n&#x200B;\n\n&#x200B;\n\nGot my tech degree and certifications. Moved out of state for a good job making 35k a year at first. Now I bring in 110k on salary but also get frequent bonuses + benefits and a groceries & gas paid for. I'm putting this here because my income is brought up A LOT by my relatives. The state took my niece away from my brother. They were going to have her stay with my parents or my aunt(both not good living situations) but I opted to take her in. I had to go through all the steps and show my income & living situation and why it'd be better for her to live with me. She's been living with me the last two-ish years and it's been great. She has her own room for the first time. And I will admit. I do buy her things she wants. But she never makes outrageous requests. I just think about me as a kid having to save up for a whole year to buy a single video game and how I can just buy her any game whenever. She asked me for parts of a gaming desktop, I bought them and she put it all together herself. If she's out with friends I Zelle her money without her having to ask. She's a good kid. Sure she has some emotional issues to work through but she's good and kind. Even if she weren't I don't want her out there broke.\n\n&#x200B;\n\n&#x200B;\n\nMy brother is pissed at me for \"taking his little girl away.\" My parents and aunt are pissed that they can't have her. It has not been proven I suspect that they just want the government assistance that would come with it. I could just be looking at them judgmentally though, but I grew up with them. My niece posts pictures on instagram from where we live. She will post pictures of our outings and I always get snippy calls and messages from them that I am spoiling her and making them hate her. I got EXTREME hate when I got her a car a couple of months ago. They think I am doing this to rub it in their face which maybe I am. I don't send pictures or give them updates but I do enjoy knowing that she is living a better life. It does feel good given how I grew up and how they've treated her but it's not my only motivation.", "created_utc": 1685239474, "permalink": "/r/AmItheAsshole/comments/13tonti/aita_for_taking_custody_of_my_niece_spoiling_her/", "score": 110, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I care about her greatly but I do get joy in doing a better job than my family. Feeling this way about it could make me an asshole\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nIf she is in your care, you can buy her whatever you want her to have and raise her however you see fit. As long as she knows right from wrong and treats people with respect, there’s nothing wrong with what you are doing. They either want the government money like you said or wish you were spending money like that on them.", "NTA- and politely, f#ck them, they are driven by insecurities and spite, they see her thriving and instead of being happy they make it about what they lack and try bring you both down.\n\nThey lost custody because they are not capable and you are and that's the only baseline you need on their opinions", "NTA. \n\nYou didn’t take her away, he lost her by failing to be an adequate parent. After that, she probably needs some ‘spoiling’ but honestly, what you’ve done is just decent parenting giving her a start in life. Don’t accept other people blaming you instead of facing their own failures.", "NTA you are giving her opportunities and a chance at something different. More isn’t necessarily spoiling, if she’s grateful, growing, and doing well… it’s great that she’s getting the opportunity to experience the opportunities that your hard work brings. Hopefully, it will inspire her to work towards her own goals.", "NTA - it doesn’t sound to me like you are spoiling her.         \nIf she’s a good kid then what she gets is obviously not a problem.         \nI think you are giving her what you can (maybe a bit extra) to make up for her childhood, nothing is wrong with that.            \nI agree with you that your family just want the money they can get for having her.        \nKeep it up but make sure she knows that their problems are their own and nothing to do with her.", "NTA. You’re a good man.", "Ignore the rest of your family, give ypur niece a balanced home (don’t buy her everything but treat her occasionally) and get her into therapy to help deal with her upbringing asap.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nWithout getting too into my family's history. I(28M) have been the legal guardian of my niece(17f) for the last two-ish years. So when my niece was born and until I was 20 and moved out of state. I was pretty involved in her life. My older brother that struggles with substance abuse had a daughter He lived in various apartments/motels with my niece. Sometimes he'd leave her with my parents for months/weeks. My parents have their issues as well so it's never really been a good stable life for her or any of my siblings and cousins. I always tried my best to look out for her when I was around. I worked a pizza shop in as a teen and I'd bring her home a pizza or pastries when I could. We'd play video games and do things together. Even when I was in college I would always make time for her.\n\n&#x200B;\n\n&#x200B;\n\nGot my tech degree and certifications. Moved out of state for a good job making 35k a year at first. Now I bring in 110k on salary but also get frequent bonuses + benefits and a groceries & gas paid for. I'm putting this here because my income is brought up A LOT by my relatives. The state took my niece away from my brother. They were going to have her stay with my parents or my aunt(both not good living situations) but I opted to take her in. I had to go through all the steps and show my income & living situation and why it'd be better for her to live with me. She's been living with me the last two-ish years and it's been great. She has her own room for the first time. And I will admit. I do buy her things she wants. But she never makes outrageous requests. I just think about me as a kid having to save up for a whole year to buy a single video game and how I can just buy her any game whenever. She asked me for parts of a gaming desktop, I bought them and she put it all together herself. If she's out with friends I Zelle her money without her having to ask. She's a good kid. Sure she has some emotional issues to work through but she's good and kind. Even if she weren't I don't want her out there broke.\n\n&#x200B;\n\n&#x200B;\n\nMy brother is pissed at me for \"taking his little girl away.\" My parents and aunt are pissed that they can't have her. It has not been proven I suspect that they just want the government assistance that would come with it. I could just be looking at them judgmentally though, but I grew up with them. My niece posts pictures on instagram from where we live. She will post pictures of our outings and I always get snippy calls and messages from them that I am spoiling her and making them hate her. I got EXTREME hate when I got her a car a couple of months ago. They think I am doing this to rub it in their face which maybe I am. I don't send pictures or give them updates but I do enjoy knowing that she is living a better life. It does feel good given how I grew up and how they've treated her but it's not my only motivation.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "They would've abused her too get more money from the state. Speaking from personal existence. Good on you", "NTA, and feel free to enjoy the wine you both make from their sour, sour grapes.", "First of all, congratulations for being this successful despite your background! And sharing your success with your niece too. NTA, OP. BUT, I would talk to some parents who have raised more children to be successful, responsible adults about what spoiling a kid is and what isn't. Or at least read the part about kids of the book 'Millionaire next door' by drs Stanley and Danko (in fact I recommend the book in its entirety, you can find it online for free, it's a bit old but evergreen). You want to reward success (which is not spoiling) and not create entitlement (which can be created in the nicest kid if you try long enough). Best of luck!", "NTA. How dare you provide a child with safety and security, for shame.", "NTA \n\nBut I'm changing your title to.  For treating my niece the way she should of been treated her whole life.....like a human being", "Your kid is 7 and posting on instagram? I hope you have given her a good lecture about being responsible…", "NTA I think what you're doing is admirable.", "NTA for being generous and supportive of the child who is in your legal custody. Her father and her grandparents resent that you can and do provide her with a life and opportunities they couldn’t, or more likely, *couldn’t bother* giving her.", "imagine being a good person and yet people are mad for being one. \n\nNTA", "Definitely NTA.\n\nYou sound like a beautiful soul op and I'm sure your niece is probably the happiest she's been in a long time. A stable home, as I'm sure you know, is definitely the best thing for her and everyone who is mad about it is just pissed off that they have to see just how terrible of parental figures they really are.", "17. The niece is 17.", "Thanks! I was horrified but it was just my dyslexia"]}