{"id": 18396, "submission_id": "13u8kfk", "title": "AITA for not changing my destination wedding?", "selftext": "I am getting married at the end of next month and the wedding is going to be in Canada (hubby to be is Canadian and that’s where we will be living beginning in the fall). I am American and so is most of my family. The wedding will be about 5 hours away from where me and my family currently live in the states. We already have everything planned and paid for, including the venue for the ceremony and reception. \n\nToday I get several texts and calls from my dad, aunt, uncle and cousin asking me to change the location of my wedding to within the US. I am bewildered at this request (even though I already knew my answer was going to be no); apparently my 20 year old cousin got a driving under the influence charge in Canada last year and isn’t allowed back into the country because she’ll be in serious legal trouble. \n\nIm not close with this side of my family NOR did I know about this until today. I reply to my aunt telling her that the venue is already paid for and that im not changing my plans. I then get several phone calls and paragraph text messages from my aunt and cousin calling me selfish and that I don’t care about my family. I then get a call from my dad asking if we can postpone our wedding and just have it at city hall near where my parents live. I tell them no (mind you my fiancé and I paid in full for our wedding with no help from our families). I get the same response calling me selfish and that no one wants to come to our wedding anyway.\n\nWas I the asshole?", "created_utc": 1685301427, "permalink": "/r/AmItheAsshole/comments/13u8kfk/aita_for_not_changing_my_destination_wedding/", "score": 2225, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > (1) not postponing my wedding (2) not accommodating my family because of their needs\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA - Your family is full of idiots. It's probably a good thing you're starting your new life in Canada with a Canadian. Sorry you're going through all this. You have a great head on your shoulders despite your upbringing, lol.", "NTA and I'm not sure how you possibly could be. You planned based on the information you had. Sounds like your Cousin and Aunt are just lashing out out of shame or embarrassment.", "NTA\n\nIt's definitely a win when unhinged relatives uninvite themselves from your wedding and your life.", "NTA \n\nThat request is cuckoo for cocopuffs", "NTA, I see why you are moving to Canada.", "NTA, imagine getting a DUI and having the nerve to call someone else selfish, lol.", "NTA. How are they not embarassed? For them to expect you make such a commitment to your ALREADY PLANNED wedding just because a hooligan cant control himself on the road is ridiculous. If they really want to attend, THEY should travel. Don’t pay them any mind.", "NTA.  Proceed with the wedding as planned.  You still get hassled?  Block them.  As a compromise, ask your dad to pay for a local reception for those family members that can not, or do not want to, travel to Canada.", "NTA\n\nYour drunk driving cousin is, by definition, TA, as is anyone who thinks you should rearrange your whole wedding to accommodate a literal criminal.\n\nYour family seems to think they own you.  Be careful, that kind of behaviour probably isn't going to improve any time soon.", "NTA! How is this YOUR problem?", "This seems like it’s a “your cousin” problem and not a “you” problem. They expect you to move everything for a something stupid your cousin did?", "Clearly NTA. Who cares about your idiot cousin.", "NTA.  If your dad wants a local reception he can pay for one, but this isn't a random location -- it's the country you'll be living in!\n\nYou might have been an AH if you'd deliberately chosen Canada to exclude your cousin on purpose, but that isn't what happened.", "\\>apparently my 20 year old cousin got a driving under the influence charge in Canada last year and isn’t allowed back into the country because she’ll be in serious legal trouble.\n\nYeah, tough shit. NTA. How long have your family known about the wedding?", "It's a destination wedding. You go into it knowing that not everyone is going to be able to go, and you don't really know your cousin anyway, so NTA. And if that 20 year old cousin is getting DUIs (something that endangers them and everyone around them, and shows very poor judgement), I wouldn't want them at my wedding anyway.\n\nIf the wedding weren't so close, I can understand telling someone you're close to that a destination wedding is something that you and other loved ones won't be able to attend, and maybe to have a small celebration once you're back. But this? Nope.", "NTA\nPSA yes or no are the only acceptable responses to a wedding invitation. Asking the couple to change the location of their wedding is not appropriate.", "They obviously conspired to gang up on you at the same time. Your dad is the J-hole for not sticking up for you immediately.", "NTA. Cousin can only blame herself, and so the rest of your family, you did nothing wrong, you're not the one with the charge. Cousin isn't entitled to be there at your wedding and as you said, you're not even close, so why the hassle?", "Wow. NTA, but you are related to some remarkable assholes. Just as well you're moving across the border from them.", "Your cousin got a DUI and has to deal with the consequences and they've cast you as the bad guy‽ It's nuts of them to expect you to change your plans at the last minute because your cousin made poor choices. NTA, and congratulations on your upcoming nuptials.", "NTA. I recently got married and experienced a similar level of irrationality from my in laws. It's a useful way to understand what they are like and a good way to set boundaries. I hope you have a lovely wedding.", "NTA\n\nTell your aunt to blame your cousin for driving under the influence for not being able to attend. The absolute nerve on those people to try and make that your problem....", "NTA. \n\nHave a beautiful wedding!!", "NTA. And your family sucks.", "NTA - Do they think you're selfish for inviting them to your wedding?  cos you didn't have to imo.   It should be a privilege for them to go, not a right that you are preventing cos your cousin is an idiot.", "NTA it’s your day and as someone who has a DUI and got readmitted into Canada (you can it just costs a lot of $ for the lawyer) tough shit if she can’t go- that’s her own fault. She had advanced notice and could have gotten it resolved- it takes about 4 months to- if she really cared about being there", "NTA!! This is a completely inappropriate request. Proceed with your plans. If your family doesn’t want to come then you know how important you are to them and how selfish they themselves are.", "NTA I was thinking it was going to be a financial issue not a spoiled brat issue", "NTA - It's your wedding so you get to choose where to have it. Your cousin not being able to go is her own fault (Another consequence to her stupidity that I hope she's learned from).\n\nYour family are AH though for thinking they can ask you to change everything you've planned and paid for just so 1 person can attend. They should be telling your cousin that she only has herself to blame not telling you to change everything for her.\n\nGo have your dream wedding and continue your happy life in your marriage.", "NTA. It’s your wedding, by definition you cannot be selfish by… creating a situation that unknowingly excluded someone you’re not close with? Well, it’s not your aunt or cousin’s wedding!", "Clearly your drunk driving cousin is far more important to the family than you.  NTA", "NTA. It’s your cousins problem not yours.", "Nope.\n\nNTA.\n\nWhy is everyone hellbent on enabling your cousin, especially as it doesn’t sound like you’ve ever been all that close?", "NTA- best decision you’ve made to move to Canada. Why is your wedding less important to your family than one single member? Who you’re not even close to btw. Your family is selfish. Enjoy your wedding!!", "NTA.  It is beyond insane to expect OP to drop all plans and eat the costs of reservations to accommodate a not very close relative making a bad choice and being barred from traveling to Canada (Canada!).  Tell all complainers to stuff it.  Family sounds pretty suspect any for the ways they put down OP.  You one needs that in their lives.  Dad ought to be ashamed, but usually people like that don't have any shame to begin so I wouldn't hold my breath. \n\nI'd imagine there is WAY more than a DUI for cousin to be outright banned from Canada.  I suspect that she likely skipped out on court appearances/fines and is electing not to go back because there are warrants out for her.  Which again, is her problem on account of her shitty decisions.", "NTA they seem to care more about this cousin than about person getting married.", "NTA! Sound like it might be time to uninvited some folks though.", "NTA! Their request is nonsensical, outrageous, and self serving. They don’t care about your wedding. Your dad, especially, should be ashamed. \n\nAll for a 20 year old with a drinking problem and DUI! Wow! Morally bankrupt to say the least. Where’s the shame and embarrassment? \n\nLiving permanently in Canada sounds like a good idea considering. \n\nI hope you have a wonderful wedding day and that they cause you no further angst.", "NTA. You could try telling them that the cousin isn't invited so it makes no odds, but I doubt that will appease them.", "She got the ticket last year and their just now bringing it up during the month of that wedding? NTA.", "NTA ignore them and have a great wedding in the frozen north", "NTA.\nThere is a wonderful phrase I've picked up here on reddit \"This is garbage taking itself out\".\nHave a GREAT wedding shared with the people who care genuinely for you and your fiance.", "NTA. It's your wedding, you can have it where you like. Your cousin is finding out, now that she's done the fucking around, and there's some chutzpah there to think you should change your plans because they're a fuck up.\n\nI'm more than looking a little askance at your father for entertaining this bullshit, too.\n\nIn the meantime, congrats on your wedding. Welcome to Canada. If you need attendees to fill seats and eat meals you've already paid for, I can probably come. I have table manners & don't drink, so there's no chance I'll do anything except dance at the reception.", "NTA. A month away?? Seriously?? And for a random cousin who made a poor choice? Nah, NTA at all. \n\nEdit: since so many are incredibly confused, below is separate commentary from the one above and is my general feelings on destination weddings. Not on OP’s wedding. Hence why I separated the paragraphs lmao \n\n——\n\nI will say though I hate destination weddings because many don’t have the extra finances to book travel and accommodations so they miss seeing their loved ones married. I get that weddings are about the bride and groom, but idk asking people to either pay a lot of money to travel or don’t go seems not good", "NAH and I think your wedding budget just improved significantly with all the people you can now NOT invite!\nBest of luck with your nuptials", "Nta", "NTA. Clearly your cousin knew they couldn’t get into Canada. Your wedding day, you get to be selfish.", "NTA. I hope your wedding is beautiful and smooth. Also good luck in the move and starting fresh. I hope you have an amazing life away from such selfish people.", "I am Canadian and freezing my ass off in 27 Celsius weather. \n\nIf that cousin can’t come back to Canada because there would be legal problems I would bet there is a warrant out here for her arrest. She got charged and booked, but went home without going to court at all. They are on the lam!", "nta - and we look forward to you moving here to canada :)", "NTA    I can't get over your family calling you selfish, when they are asking you to change your entire wedding, for 1 person. That's just ludicrous. \n\nI hope you have a beautiful wedding, and a long loving marriage. \n\nWelcome to Canada!", "Not only did your cousin get a DUI, but it was A YEAR ago. So she had plenty of time to hire a Canadian lawyer and figure out a solution. Your family only lives 5 hours from the border, and not attending a wedding is not the worst consequence she will be facing in her life as a result of being banned at the border. She and her family are idiots. \n\nAnd don't forget all your other guests who have arranged their lives to attend. Guests who managed not to get a DUI in a foreign country.\n\nNTA. Your relatives are.", "[removed]", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI am getting married at the end of next month and the wedding is going to be in Canada (hubby to be is Canadian and that’s where we will be living beginning in the fall). I am American and so is most of my family. The wedding will be about 5 hours away from where me and my family currently live in the states. We already have everything planned and paid for, including the venue for the ceremony and reception. \n\nToday I get several texts and calls from my dad, aunt, uncle and cousin asking me to change the location of my wedding to within the US. I am bewildered at this request (even though I already knew my answer was going to be no); apparently my 20 year old cousin got a driving under the influence charge in Canada last year and isn’t allowed back into the country because she’ll be in serious legal trouble. \n\nIm not close with this side of my family NOR did I know about this until today. I reply to my aunt telling her that the venue is already paid for and that im not changing my plans. I then get several phone calls and paragraph text messages from my aunt and cousin calling me selfish and that I don’t care about my family. I then get a call from my dad asking if we can postpone our wedding and just have it at city hall near where my parents live. I tell them no (mind you my fiancé and I paid in full for our wedding with no help from our families). I get the same response calling me selfish and that no one wants to come to our wedding anyway.\n\nWas I the asshole?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA You cousin’s criminal record and its consequences are not your problem. The request to change your wedding location was ridiculous.", "NTA - weddings usually take ages to plan, and yours was probably no exception. They most likely had plenty of time to bring this issue to your attention. Even if they had done so promptly, it is not your cousins special day. It's about the bride and groom. It's a wedding, NOT a family reunion. If she can't be there, that's no one's problem but hers. Sucks to suck.", "NTA, the entitlement is strong", "NTA. Literally thought from the title it was because you were being one of *those* brides who expect everyone to shell out $5k so you can be on some tropical island. \n\nYou’re getting married in a place you will be living, have people there, and it’s where your husband to be is from. It’s not your fault your cousin is a disgrace to the country of Canada.", "NTA. It's not your problem that your cousin is an f'n idiot for driving under the influence.  Apologies for insulting your cousin, but they could have killed someone with their stupidity.  Congratulations on your upcoming wedding, I hope everything goes well for you with or without your family.", "NTA. Your family is pretty selfish and stupid.\nHave your planned wedding and enjoy it. If your family won't make it there, it's their loss.", "NTA. The bride and groom can do whatever they want for THEIR wedding, including having it in an inconvenient location for some guests. Sounds like they're using your cousin's DUI as a scapegoat reason to not have to travel for the wedding, when they could realistically just say she can't make it but they'll be there. Conversely, they could just wish you well for the wedding and apologise for their absence as they do not want to attend without your cousin. Their response is entitled and rude. Good riddance, enjoy your life away from them.", "NTA\n\nNot your fault your cousin did something stupid. You don't need to accommodate that.", "Nta. Cousin played stupid games and won stupid prizes. Not your fault they're an idiot.", "NTA but wow your family sure is something", "NTA\n\nAnd just for your own defence, this isn't a destination wedding. Not if it's where his family is, in the same way that it wouldn't be a destination wedding if you had it where your family lives and his family had to travel. I'm not trying to denigrate you, but this isn't a destination wedding in the sense that not everyone is travelling.", "NTA. Silver lining here is you’re moving away from these morons.", "NTA. I would be mortified if I were your cousin.", "As a Canadian, I say: Welcome to Canada!\n\nWe have a long tradition here of taking on Americans trying to escape from assholery. They thrive by leaving the assholery behind and focusing on building community here. Your wedding gift from your side of the family is a totally clear conscience in doing exactly that.\n\nEnjoy your wedding. Invite some extra friends now that a few spaces in the peanut gallery have opened up for people you actually want there.\n\nNTA", "NTA 5 hours away is hardly a destination wedding… \nYour wedding shouldn’t sacrifice for the sake of your cousin choosing to drive under the influence!! I don’t get why your family would even back that! They are the selfish ones, congrats on the wedding", "NTA...how can you even consider that you were the AH?", "NTA and uninvite everyone complaining. They aren’t worth it and will probably make you and your fiancé’s day shite.", "NTA - Remind your family that cousin is the selfish one for risking lives while driving under the influence. \n\nAlso - this is not a Destination Wedding in the truest sense. Your not asking all your guests to fly somewhere purely to visit a new destination. Unless the couple are from the same town it is completely normal to have choice. This is his home. Soon to be yours.", "NTA! \n\"It's such a shame she did that! We'll miss her.\" /s", "NTA, in what world of entitlement does your clueless family reside in? When did your cousins situation become the primary consideration for your nuptials Tell em you'll be missed,but not too much ,In fact,on 2nd thought ,lose my #", "How could you possibly be TA here? \n\nYour whole family are ridiculous. I don't understand how anyone could possible demand this off you. If that was my family they'd all be like 'Well, sucks for you cousin, guess you can't come'. Your Dad joining in is something I can't get my head around. \n\nIt's YOUR wedding. None of them need to be there, you're not doing it for them. \n\nIf it wasn't clear, NTA.", "NTA. I don’t even understand how this is a discussion. \n\nEven if you set aside the additional costs for changing locations at this stage, the bottom line is that it’s YOUR wedding. You and your fiancé get to pick when and where you get married, and it’s up to your family to figure out how to get there.", "Send them a bogus new invitation with a location on the other coast. It's still within the U.S., right? Lol\n\nNTA", "NTA \n\nYour cousin can stay home.", "NTA. What an entitled request!", "NTA OP.  Your family sounds entitled.", "NTA\n\nMy hubby and I had our wedding in Europe (we live in Canada). BIL has been in trouble with the law since he was a teenager and we knew that there was a chance that he might not be able to come and MIL asked us to postpone for a few years until he could apply for a pardon for his most serious offense. We told her no. Our wedding was about us and not BIL and his bad choices don't dictate our decisions.", "Love the cut and dry ones. NTA.", "NTA.  Sure, cancel your wedding with 6 weeks to go!  Get married in city hall!  The bottom line is that your cousin FAFO, she can miss the wedding, it's called consequences.  Your family is being ridiculous.\n\nEdit.  Welcome to Canada, eh?  🇨🇦", "NTA. So one stupid cousin can't go. Don't drive drunk.", "NTA - you know who’s selfish and doesn’t care about other people?  People who drive drunk, like your cousin.  The whole situation is not your problem.  Enjoy your Canadian wedding.", "NTA, just tell them you'll send your cousin a zoom link she can attend through.", "NTA", "NTA. Your family is selfish. It's your day, it's not your problem your cousin fucked up and can't get into Canada. Its only a 5 hour drive for the people that can make it.\n\nI really don't understand people who do this.", "No not the asshole! It’s your wedding and they can choose to participate or not. They are being selfish! You do you and enjoy your day", "NTA- the wedding is paid for and it’s not your fault your cousin is in legal trouble in Canada. You should not have to change your plans just because your cousin thought it would be a good idea to drive under the influence.", "This is not a destination wedding. Destination weddings are for assholes only and they go somewhere nobody involved lives. NTA but consider a separate smaller celebration in the states if people can't make it who you actually want to attend", "NTA\n\nIm glad to see cousin is feeling the consequences of her actions. Your organising an event for a lot of people, to change it now would be selfish to absolutely everyone else involved if you want to sum it up that way. The other thing is that your dad and aunt are selfish for putting your lawbreaking cousin over your wedding day. I hope you have a lovely wedding, and wish you luck on your new start in Canada.", "NTA. They can fuck off with all the gaslighting.", "NTA. Change the whole thing for one cousin? C'mon. Also, may I wish you early Congratulations and early Welcome to Canada!", "NTA, why isn’t everyone mad at your cousin for committing a crime and endangering people instead? Priorities are backwards here.", "NTA-and when they ask again (make no mistake they will ask again) simply say, sure I can change my wedding however since WE paid for everything you will need to repay us for the Canadian wedding AND pay for my wedding here.  Repeat this every single time. It will shut them up.", "NTA.\n\nAnd tell \\*both\\* aunt and uncle that THEIR SHITTY PARENTING caused this problem, and that THEY should work on making sure your cousin behaves properly in public.", "NTA\n\nAnd tbh it’s good that your cousin can’t attend so you don’t have to worry about your obviously irresponsible cousin drinking and driving at your wedding. See the news last month where the bride was killed by a drunk driver leaving her own wedding?", "NTA.  Your family sucks.", "NTA.  Your cousin could have killed someone.  She's the asshole.", "Why are you calling it a destination wedding? It is where you'll life and even where one of your families live. The US is no the centre of the world.\n\nOther than this pet peef obviously nta", "NTA\n\nyour family asking you to move or postpone your wedding because one young relative cannot attend due to her own poor decision-making is what is selfish", "I refuse to believe this is real because what? No way people are serious in that request. In any case you're NTA", "NTA - I’m happy your not letting your SELFISH family control where you have your wedding.", "NTA.. just tell them not to come.. good riddance.. the entitlement because of a 20 year old cousins.. it’s almost laughable", "NTA your cousins dui is not your problem. Enjoy your wedding!", "NTA", "NTA\n\nIt’s unfortunate your cousin can’t attend your wedding due to circumstances beyond your control.\n\nExpecting you to change your wedding that is a month away - not only impacting you but everyone else who has RSVP’d - is not okay.\n\nFunny how you’re being called selfish by family you aren’t close to when they want to upend your wedding and everyone else’s plans because one cousin decided to drink and drive.\n\nAnd WTF is up with your dad playing into this nonsense? He’s really going to miss his daughter’s wedding over a neice’s DUI? And asking you to give up all of your deposits to get married at city hall?\n\nYour cousin attending your wedding isn’t a need.", "NTA. If your cousin can't come to your wedding due to her pervious inappropriate behaviour, then that's on her. My mind boggles that your family think otherwise.", "NTA and as another American who married a Canadian and now lives in Ontario, congrats!", "For 1 cousin? Lol no, NTA.", "NTA and preemptive welcome to Canada. They are being rude because they don't want to face the consequences. Someone who drives under the influence deserves no sympathy.", "NTA. 5 hours isn’t a destination wedding, and the 1 family member who can’t attend can just suck it up.  If it’s that big of a deal, proceed without anyone who disagrees.", "NTA.  Tell them you'll be getting married where and when you planned and that you'll be sad if they can't make it, but your plans are firm.  Then let the chips fall where they may.", "NTA- daughter, please change all of your completely paid for wedding plans to accommodate the previous bad behavior and decisions of your cousin, that you knew nothing about but now that you do, you would be selfish not to.  \n\nEntitled,much?  Enjoy your wedding without these toxic people.", "NTA: But a bit of advice; not every question needs to be answered. I'd have suggested you just not responded to or explained your decision.", "NTA— Wow! Have a wedding in a city hall in the US and cancel your own plans for your own wedding to accommodate someone who got a DUI. WTF!", "NTA\nHow are you selfish? You paid for YOUR  wedding. It's your wedding so it's yours and your fiance's day not theirs. If they don't like it then they don't have to go", "WTF, not the AH. They want you to change the venue because your cousin is a drunk?", "So you're selfish for wanting to start your life with your soon-to-be, Canadian fiance. Paying the entirety of it yourself. But your cousin isn't for getting behind the wheel under the influence then expecting you to change around your entire ceremony for HER - someone you aren't even close to? That logic doesn't logic for me. NTA", "Ask them to clarify who isn’t coming. You can save a lot of money on the food alone! Congratulations on your drama free day. NTA", "Your family is delusional!  But you probably already knew that. \n\nNTA.", "NTA. Dad and the rest of your family should come to the wedding. Your cousin can deal with the consequences of her incredibly irresponsible choices.", "NTA.", "NTA let them not come and enjoy your wedding with your new family and no drama or entitlement  \nwhen they said \"it's like you don't care about her coming!\" I would have said \"you're right, I don't. it's a destination wedding and I didn't expect everyone to make it\", but I have an attitude problem so", "NTA. It's insane for them to expect you to change your whole wedding around with only a month left. She knew a year ago she wouldn't be allowed to go.\n\nI think not getting to go to an estranged cousin's wedding is a pretty mild consequence for an underage DUI.", "NTA. Evidently your family thinks their wants should be more important than yours on your day. That is extremely entitled of them. Don't let them bully you into making your day about them instead of you.", "NTA. However, everyone who asked you to change the location is an entitled, delusional asshole.\n\n“Hey OP, one of the biggest and most important events of your *entire life* (that actually has nothing to do with us) is only a month away, and I know you’ve already planned and paid for everything in full…but I need you to scrap all the special stuff you planned for your own wedding. Cancel all the stuff you booked. Forget what *you* want your wedding to be like. This random cousin (who you barely know) got a DUI once, and you need to accommodate her. We don’t care that your fiancé and his whole family live in Canada, we need the wedding to be here, for us.” - See how asinine that sounds?", "Can see why you're moving to Canada with that family around.", "NTA... Getting a DUI is the epitome of selfishness NOT having a wedding near your fiance's home. \n5 hour drive is not really a destination wedding. It's just closer to your future home then where you and your family live.", "NTA, that just means that this cousin can’t come. It’s their own fault, they just have to stay home. Not your problem.", "NTA. I wouldn’t actually call this a destination wedding, since it’s where your partner is from and what you both will call home. If anyone has a partner from a different place, the wedding will be a destination for someone. They request really disrespectful and selfish. Maybe this is callous, but i honestly think you’re better off without them at the wedding. They seem like they’d be high maintenance guests. \n\nAlso, congrats OP! I hope this hassle doesn’t stop you from having a brilliant time!", "Best solution is cousin stays home and sends a gift. *She* can't make it because *she* broke a law. What does that have to do with you?\n\nNTA", "your wedding your choice and a legal issue with a guest is not your problem \n\nThey can leave the 20 year old behind", "NTA maybe if the cousin didn’t get a DUI in said country it wouldn’t be a problem.  I guess cousin won’t be attending.  Doesn’t seem to hinder anyone else from attending.  Sacrifice the one for the many.  She did it to herself.  If she’ll be in serious legal trouble then there’s more to the story than just a DUI.  She probably has fines that are unpaid.", "You should send a text to your cousin “Hey, since we’re asking for impossible things, can you just go back in time and make better life choices? It would make it easier to not have this pointless drama leading up to my wedding! Thanks!” NTA.", "NTA as long as you're okay with them not coming.", "Obviously NTA. Just as a thought, for my sister's transnational wedding she had a secondary 'wedding' in our home country for the people who couldn't come out for the main one in my BILs country. \n\nI mean it sounds like your family aren't worth accommodating that much even, but could be worth suggesting.", "Totally Y T A, everyone knows you’re suppose to move your wedding to help out an idiot cousin who you didn’t know got in trouble in Canada. You are the worst cousin ever. Sarcasm clearly, your NTA.", "Your cousin did something stupid and is dealing with the consequences.  It is NOT  your problem.\n\nYou are not selfish.\n\nThe family are selfish for even making the request..  Are they going to refund all the money lost on deposits , hotels, etc that go into a destination wedding?\n\nIf you own family will not attend YOUR wedding over this, they are making their choice, and you should treat them accordingly.\n\nNTA", "A wedding in Canada is not a destination  wedding.  It's just a wedding.\n\nSource:  am Canadian.", "NTA\n\nRelish in the fact that you are a *responsible* adult who has no concerns about crossing the border to have the Canadian wedding of your dreams, and gets to call all the shots since you paid for it. Your cousin and aunt are immature, and if they didn’t want to come anyway, why are they putting up such a fuss? Those hypocrites are better left where they are….at home", "Your cousin's problems are not your problems. NTA", "NTA, why should you change your wedding venue to accommodate a criminal?", "NTA, at this point when everything is paid its just an AH moved to just throw It all away", "NTA - Imagine asking for a whole wedding to be moved because you acted like a drunk idiot and now a whole country doesn't want you.  I'd be so embarrassed about the DUI I would do anything to avoid bringing attention to it.", "NTA.\n\nYour family is insanely selfish and out of pocket for even suggesting this. Enjoy Canada, sounds like you'll have less and less reason to return after your move.", "NTA. You already booked and paid for everything! Are they going to give you all that money and time back? \n\nIf they were being nice, I’d say maybe have a little party with them after the wedding, but they kind of just sound like jerks.", "Just seeing the apology makes me think you are Canadian haha", "Yup. Come on over. Most of us aren’t this big of idiots. Join us. \n\nDon’t be fooled. We still have some questionable characters. Haha", "Even if OP had known that their cousin couldn’t go to Canada *before* everything was booked…they still wouldn’t be TA. Wedding locations aren’t chosen by random extended family members, who aren’t even close to the couple. Unless the couple is *extremely* invested in a specific person being able to attend, that person’s preferences for the location don’t matter at all. These people have way too much audacity.", "I'd make the uninvite permanent personally.", "Yes it is!! We just had this with a relative and their spouse and as soon as my fiancé and I got the call, we high fives silently😂", "**NTA**", "A DUI that you fled from!  The only reason they wouldn't be allowed back is because they didn't show for a court appearance or didn't show up for their jail sentence.", "THIS 1000000% if the cousin attending is more important than everything else, they can pay for 1 local 😁", "This is the way.", "I can't help not thinking that it is better that they will be living in Canada. Probably the best move ever with this family", "I think OP should use your sentence: I’m not going to rearrange my whole wedding to accommodate a literal criminal. \n\nGreat phrase.", "I can't speak for OP, but when organizing my wedding, no one person other than me and my wife were explicitly considered.\n\nYep, making a choice deliberately for the purpose of excluding the cousin would be a dick move, but so would everyone else forcing a choice deliberately to include the cousin be a dick move.  And that's before getting into \"and the cousin is a criminal\" part.\n\nIn truth, the state of the cousin should not have been a concern one way or the other, and almost certainly wasn't.", "It’s not even really a destination wedding…it’s being held where OP’s fiancé and his family live (and are from), and where OP will be living after the wedding. It’s “home” for them. It’s no different than if OP had planned the wedding in the U.S., and invited fiancé’s family to attend.", "No. A simple DUI makes you inadmissible to Canada. Former CBSA officer.", "Yeah it's interesting OP said they'd be in \"serious legal trouble\" if the cousin went back. Getting turned away at the border isn't \"serious legal trouble\" so it makes me suspicious of the whole story here", "LOL. The \"frozen north\" where it's 79 degrees Fahrenheit in Toronto today.", "We live in Igloos too! 🇨🇦🇨🇦🇨🇦", "Downvoting for an ignorant comment. It's presently 29° celsius or 84° Fahrenheit. My AC is on full blast. Canadian here.", "Do you live near Toronto? 😅", "As she’s American and he’s Canadian, it was going to be a destination wedding, one way or another. Not like they chose to go to Bermuda.", "You do know that not every couple has families that happen to live near each other right", "I also dislike Destination weddings, but this one makes total sense considering the circumstances.\n\nOP, tell your family that you can't move it to the US because one of your husbands cousins is a wanted man in the US (UNO reverse them in other words).  \nNTA.. so long as you don't do a gender reveal party as well!", "They actually live about 25 mins from the border lol but the location of the wedding is about 5 hours away", "My mother did this when I wasn’t invited to my cousin’s wedding, she hounded them into giving me an invitation and then I was shocked when she told me to go. Of course I said no and could not believe she had done that", "I can believe it. If only the cousin isnt there, everyone wants to know why, mama bear wants to protect her alcoholic baby", "Your comment has been removed because it does not address the OP in good faith.\r\n\r\nIf you suspect a post breaks one of our rules, please report it instead of commenting. **Do not feed trolls**\r\n\r\nContinuing to post comments like this will lead to a ban.\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "My dad is pulling the “it’s your baby cousin !!” Guilt trip like ….. I’ve never even been close with her ???", "Thank you! I look forward to living in Ontario 😄", "My dad was pulling the “but it’s your baby cousin “ guilt trip on me… like yeah, my cousin who is 9 years younger than me who I was never close with", "right! I heard “soary” in my head for sure lol", "Actually I'm in the US. We're known to be idiots, lol. Canadians have far more sense ; )", "EXTREMELY invested…like grandma can’t travel cuz she’s on her deathbed. Otherwise, you go or politely decline.", "Well, if she's moving to Canada then cousin will never visit.  Sounds like a win-win.", "I don’t think that’s entirely true. Canada doesn’t allow criminals into their country. They even have access to criminal records in America and won’t let people with DUIs into the country. You can submit an application in advance requesting entry and if approved they will let you in.", "Yeah, it seems like getting out of the USA is a good plan for OP.", "Yup! I once hired a subcontractor (that I worked with frequently) to do an installation job for me in Canada. He was turned away at the border for having had a DUI. Really screwed up the job schedule. He ended up sending someone else, but that cost a couple of days.", "Wow.  I stand (er, sit) corrected!", "The cousin got the DUI IN Canada. For sure there are warrants.", "Im in London/Uk so most people in Canada actually live south of me (London is about  Newfoundland) but Canada is always 'north' in my head", "It was humour I'm sure. Your a/c might need to be a little colder fellow Canadian. You need a little more chill - all is well.", "Negative. Western Canada, a region viewed with some skepticism & side-eye by Toronto.", "Exactly. I got married in the Chicago area. My husband is from Canada. It's not like someone wasn't going to have to travel. Almost everyone had to travel anyway as my family is pretty far flung.", "Yep. Traveling states is a bit different than countries. My brother was going to do a Jamaica destination wedding and it was gonna cost about $2000 for each one of us to travel there and get accommodations at the absolute cheapest. And I was a bridesmaid. So yeah I have different opinions based on my experience, and you have different ones based on your.", "I can believe there’s one crackpot mom. But multiple family members begging to have a chance to go to a family wedding?? And in a timeframe everyone knows wedding decisions have been set in stone?? And being directly rude about it?? Family drama is usually accomplished by talking about people behind backs. Not direct text messages saying “you are selfish.” Never mind family weddings are generally seen as a chore. A destination wedding is a great excuse to not go. Send a nice note, your obligation is done. 🤷🏻‍♀️", "I know what you mean... But I took it that they had been charged in Canada. If they'd addressed the charges they'd probably be allowed back. I'm Canadian, fyi.", "Yeah, I suspect the issue wouldn't be getting into Canada, it would be leaving Canada again. Or doing anything in Canada besides sitting in a jail or attending court.", "I live in Windsor, so the US is north of me. As in, I can see Detroit in the north from my front porch. This is a great way to win bets from Americans, but other than that, it's not a big deal. Except so much American news. I despair for them. It's a literal dumpster fire these days.\n\nIf a cousin is barred from my country for committing a felony, stay away from her. She's straight up bad news and you're not marrying her so what's the difference.", "Yeah, that’s one thing, but OP said it was about 5 hours away from where her family lives though. So even though it’s technically in a different country (US to Canada), it’s a lot closer than even many non-bordering US states.", "It really depends on the family. This kind of drama is surprisingly common, unfortunately - especially when there is / was a golden child dynamic. \n\nI also have never viewed family weddings as a chore... it's always a huge reunion.", "Five hours is multiple tanks of gas, they need passports if they don’t already have them, and accommodations still need to be made. But it’s really not that bad in this case. I think it’s important to note that that comment was separate from OP. I was just commenting my general feelings on destination weddings. That’s why I separated the paragraphs. Sorry I wasn’t clear.", "\"Dear Family,\n\nAs you know, my Canadian wedding venue and all of the vendors have already been scheduled and paid for.  \n\nToday I discovered that Cousin committed the crime of drunk driving in Canada and chooses to evade the legal consequences of her crime.  Hence, she has made the decision not to attend my already scheduled and paid for wedding in Canada to avoid arrest.\n\nThe family has asked me to reschedule my wedding and hold it in the United States, asking everyone who has already booked travel and paid for hotel accommodation to eat the costs and for me to pay for two venues and two sets of vendors, in order that Cousin can attend my wedding without risking arrest.\n\nI am being told that my refusal to comply with this request, and for thousands of dollars to be lost so a drunk driver can attend my wedding without facing the consequences of her crime, is selfish and shows that I don't care about my family.  This isn't the case.  \n\nBut the consequences of drunk driving in Canada are for Cousin, the drunk driver, to bear, and not for me and fiance's family to bear.  I am sure that the families of the approximately 1500 people killed and 63,000 people injured by impaired drivers in Canada each year would agree with me.\n\nThere will be no further discussion.  I will not respond to anyone who contacts me about this again, and anyone who contacts me repeatedly about this will be blocked.  \n\nShould you decide not to attend or send me a gift over this, you are welcome to make a contribution to Mothers Against Drunk Driving in my name.  \n\nOr in Cousin's name if you prefer.\n\nBest, Bride\"\n\nNTA!!!!! Congratulations on your wedding!  Have a wonderful life in Canada!  Ignore your family's outrageous request and block if you must.  Eventually, the reasonable members of your family will calm down and stop being assholes toward you.  And as for those who don't calm down, well, at least now you know whom to avoid.", "NTA. Sorry your dad is being so shitty. Is he used to doing what his sister says to \"keep the peace\" or to not have to hear her bitch and moan or something? \n\nI never got that attitude people seem to have that it's more important to make extended family happy at the expense of immediate family/the people who actually matter.\n\nEdited for grammar.", "NTA and it sounds like the trash is taking itself out! I do wonder though OP if your immediate family have the whole story about why the aunt and cousin want to wedding in the US rather than Canada…", "Weddings that take place in one of the couples home town or nearby ARE NOT DESTINATION WEDDINGS! Even if the hometown is in Hawaii or the South of France.", "How is this even a destination wedding? Isn’t a destination wedding where everyone travels and no one is going to be living there?", "NTA. Too bad if cousin can't come.  \nBTW---if your fiance is from Canada, and you'll be living there, I don't think yours is really a 'destination wedding'. That designation is for ceremonies taking place away from hometowns or current homes; usually a vacation area.   \nGood luck.", "NTA\n\nI like when the garbage takes themselves out. How dare a family member even request this of you, and then guilt trip you for your reasonable answer. \n\nNot that it would matter but are they even offering to reimburse what was already paid for you to make these “accommodations”?\n\nEntitled people never cease to amaze me", "NTA- something tells me they knew before today that your cousin wasn’t allowed in Canada so why’d they wait? \n\nI got married 2 years ago. I had to postpone my original wedding date due to the pandemic and they charged us for that nonsense even though it was obviously not our fault or choice. It was a nightmare trying to get everything straightened out and together again for another date. If you don’t have to postpone your wedding, don’t do it! \n\nYou gotta make your own choices and ask yourself if you really want those family members there. Have a frank discussion with your parents about it. We also had family telling us that our new date was inconvenient to travelers but we couldn’t change it again without having to take out loans and it would have been a huge issue. We had to think about what was best for us. You have to think about what is best for you. I’m probably not a good person but I said to people “you don’t need to be there if this doesn’t work for you and that’s okay with us.”", "NTA. Your cousin's mistake isn't your fault, nor should you pay any price because of it. That your dad is making requests is ridiculous. \"But faaaaamily!' is never a valid reason. Stand your ground, think about maybe at least going LC with anyone who makes this their hill to die on, and I wish you an amazing wedding!", "So the expect you to change your wedding because your cousin is stupid? NTA", "NTA disinvite anyone giving you grief and tell them that with the catering savings from that, you’re making a donation in the cousin’s name to a charity/non-profit that works against drunk driving.", "NTA. OP isn’t being selfish; however, the cousin who chose to drive while intoxicated is. Cousin and family shouldn’t expect OP to make changes this late in the process-or to accommodate someone who could have hurt or killed themselves and/or others. Next time they call you selfish, OP, be sure to ask the complaining family members who cousin was being considerate of when they got behind the wheel of their car.", "“Soory boot yer family eh!”\n\nBut seriously, Canadian here, what a bunch of garbage to expect you to change everything for someone else’s terrible choices. Go and enjoy your wedding and post a ton of pics of your super fun and enjoyable day for them to see. Congrats OP!!!", "NTA. It sounds like your cousin had to fess up to the family why they can’t attend and now everyone is in shock and deflecting. Welcome to Canada! We are very nice up here :) \n   \nYour cousin is absolutely an asshole for driving drunk, though. Better off without them in attendance.", "Nope, NTA. This wedding is not about your cousin and she's gonna have to sit this one out. At the risk of sounding super judgmental (and as someone who knew two people who have died because someone else got behind the wheel drunk) I'm incredibly ok with your cousin facing lingering ramifications—like missing out on events in Canada— as a consequence of her driving drunk. \n\nHave a wonderful wedding. In Canada.", "This is an excellent opportunity to examine who would be very convenient to cut out of your life when you move to Canada.\n\nI'm currently in the process of immigrating to Canada myself, family is there and all. Good luck on everything in your future, it sounds like you've made the right choices.", "NTA\n\nI think the better question would be why is you cousin, getting a DUI with the associated consequences, more important than your wedding? \n\nThe wedding that YOUR paying for.\n\nI really don't get it. IMO, I think YOUR wedding will be better if they choose not to go. I really do.", "NTA.\n\nYour family is bonkers. A cousin was an idiot and now a bunch of people who, I assume, won't be compensating you is demanding you rearrange your plans. They sound kind of childish, too. \"I don't want to you to your stupid wedding anyway.\" Yikes.", "NTA, how dare you not to change your wedding for someone you barely know, because he commited a crime and cant go?\n\nAre they dilusional?", "NTA I'm amazed they are expecting you to change your whole wedding because your cousin got DUI ! That is crazy to me and the fact your dad is suggesting this to would make me go LC or NC", "NTA", "NTA I'm amazed they are expecting you to change your whole wedding because your cousin got DUI ! That is crazy to me and the fact your dad is suggesting this to would make me go LC or NC", "NTA. I got married 1200 miles away from home. You have to do what you want and just be ok knowing some people will decide not to come. It's ridiculous to ask you to change venues (countries!) and doesn't matter what their reason is.", "So you gotta suffer for her irresponsibility? Nope. If it's that important, she can watch via Zoom", "NTA\n\nEnjoy your wedding and don’t forget to send them LOTS of pictures. And I mean you can even sneak in some doubles.", "Your cousin and her mother are terrible. Shame on your dad for asking you to postpone. At the end of the day your wedding only requires you and your future husband to be there. Anyone else who would like join is a bonus. Getting married should be special and dealing with shit like this just ruins the whole experience. Fuck em. Go marry your Canadian and live happily ever after eh 🖤\nWishing you the best!\nA Canadian ❣️", "NTA wow so because your cousin, who aren’t even close to, was stupid enough to get a DUI, you have to abandon your wedding plans, lose money, change the venue, do all the work all over again, just so…this one person can go", "NTA - absolutely, have the wedding where you planned, their asking otherwise is ludicrous. \n\nIs there a possibility of doing a small casual open house where your parents live either before the wedding or after the honeymoon? Obviously, you don't have to do *anything* to appease them, but it could be a possible compromise. (Those wanting you to move the wedding would need to pay for and plan the open house, so you can focus on your actual big day, of course.)", "NTA.  Why are they bending over backwards to fix things for your cousin?  Crappy actions have crappy consequences.", "NTA disinvite all of the ones who’ve complained and called you selfish. They’re not going to contribute any joy to your special day anyway. Might as well be with those who actually love you.", "NTA \n\nYour wedding, your rules. Why should you change the destination of your wedding because a cousin got caught being an idiot?", "NTA, you can’t please everyone and like you’ve stated you’re not close to that side of the family, so why change all of your plans when everything’s already been paid for? \n\nThey sound entitled as hell, and well for your cousin she’s paying the consequences for her actions. Never to set foot in Canada again because of the DUI charge. She’s the asshole. Maybe she shouldn’t had gotten drunk and gotten behind the wheel.\n\nEnjoy your wedding OP and ignore/block that side of the family.", "NTA, but destination weddings (esp international), almost always encounter last minute drop outs as people underestimate the cost & effort involved. Have your wedding where you want, just accept many people may not attend.", "1. NTA\n\n2. Congratulations!\n\n3. Ignore your family. Do not let them ruin this for you. If they want to side with an irresponsible cousin over you, they’re the selfish ones.\n\n4. Welcome to Canada!", "NTA. Not sure why that one cousin can't just stay home. They're asking you to reschedule the entire wedding? Entitled much lol", "NTA. Your wedding, your decision. Cousin broke a law, this is a consequence of breaking that law.", "In no way shape or form are you the asshole. \n\nYour cousin is the irresponsible one who has the problem and everyone expecting you to drop your wedding plans because of her poor choices is an idiotic, toxic, selfish person. It's YOUR wedding. And if they're threatening not to come because you won't lose thousands on your deposits, than ask yourself if those people truly care about you at all. (Hint: they don't)\n\nNTA. Enjoy your new life in Canada and I wish you a happy and healthy marriage.", "Are they out of their minds?  They want you to completely upend your entire wedding for the sake of a drunk driving random cousin???\n\nAsk them why she is more important to the family than you are.\n\nThen enjoy your wedding day IN CANADA as already planned and paid for.\n\nNTA", "NTA.  Completely agree with others who said to let your family plan a reception near them for anyone who can’t make the actual wedding.", "They did you a favor letting you know how shitty they are. Now you don’t have to pay for their food. \n\nJust reply to their garbage messages with “thanks for letting me know, I’ll adjust the menu and seating accordingly.”\n\nOr even \n\n“Oh fantastic! There’s some people I really wanted there instead but felt obligated to have you! Win/win for us all! Take care!”\n\nThey just don’t talk to them again. I understand it’s tough for people to cut off immediate family in many scenarios, but extended family is so easy to drop lol.", "NTA.\n\nDamn what is it with \"family\" and meddling with weddings.", "No, you're not. They are for even trying to make you change your plans.. This is YOUR big day, not your cousins.", "NTA - Welcome to Canada! I'm not sure if it would do anything, but I'd make sure LE in Canada knows where cousin is residing in the States...but maybe I'm an A H.", "NTA. \"It's not that I don't care about family, it's that I specifically don't care about cousin.\"", "NTA.  Tell your dad, aunt and cousin you will miss them at your wedding.  And then block them!", "NTA because your cousin did something irresponsible you're entire family wants you to abandon your plans? Is your cousin that important to the entire family that if she stays home the whole group falls apart?\n\nand what about your fiancée's family? Does your family understand they are expecting everyone of them to suddenly have to make major changes to their plans if they are going to change? seriously, good thing you're moving to canada to get away from your selfish family.", "NTA. So your cousin did something illegal, which has consequences, and instead of...I don't know, accepting those consequences and staying home, you are expected to change everything to accommodate her? Um, no.", "NTA and just to prove a point I would tell the aunt and cousin you are willing to move the wedding to American but since you already paid for the Canadian wedding you will need them to reimburse you for what you spent for your wedding and you will need additional funding for the wedding in America. That should shut them up.", "NTA. You are not selfish. They should be happy for you and feel honoured to be part of such an essential moment in your life. You are just asking for them to be there for you and share the joy. When your loved ones really have your best interest at heart, they will come to you and know you will be busy-and-stressed-and-overwhelmed. But they will come and be there for YOU. \nFor our wedding, my husband's family drove/flew 800 kms. They didnt know me, but they came for his special moment. \nWe just came back from the latest, newest little cousin's baptism 600 kms away. In just 48 hours. It was an easy decision, we had to be there.\nDo not let their excuses set the tone for the years to come. It will be their loss. Have a wonderful wedding.", "You know you’re NTA. Good call - 5 hours away from family sounds perfect.", "NTA- LOL nope. I actually like all my cousins but if one of them told me they couldn't make my wedding because they had a tattoo booked that day I'd reply \"No worries, send me a pic! xxx\". Cos like, cousin. Not mum or dad or best friend, bonus person who it's great to see but doesn't have to rearrange their life for me, and I'd rather see happy than see on any specific date. Maybe put it like that: 'I'd never ask her to give up anything for me, let alone something this huge.'?", "You are so NTA here. \n\nAnyone who seriously expects you to rearrange an event that is already planned and a month away to accommodate someone else is unbelievable. The fact that it’s because your cousin isn’t allowed to enter Canada is even more brazen. Your cousin has probably had her mommy cleaning up after her and justifying all her mistakes and shielding her from consequences her entire life. FWIW your cousin wouldn’t be allowed in Canada even if she’d gotten the DUI in the US. \n\nPlease, please move to Canada and don’t look back.", ">no one wants to come to our wedding anyway.\n\n\"Don't threaten me with a good time.\" If no one wants to come, then it doesn't matter where it is. NTA.", "NTA\n\n1.  The destination is chosen because that is where you are going to live.  This is different from choosing a place to which you have no connection.\n2. The idea of suggesting a change at this late date is silly.  This is an attempt to make you feel bad rather than a true request for a change.  It is quite unreasonable to suggest this now rather than in the early planning stages.\n3. This is a test to see to what degree you will be controllable by your family after the wedding.  Do not fail this test.\n4. The reason given is that someone else has broken the law and that you should suffer the consequences?  I would not even dignify this with a response.  Just say no.  Do not give a reason.  Let them learn that no is a complete sentence and will not be followed with an explanation for them to reject.  You do not owe anyone a reason.", "Sounds like moving to Canada is a great idea! \n\nObviously NTA.", "So your cousin can’t come so your entire family demands you have a simple city hall marriage to cater to them.\nClearly they are lazy and entitled and just don’t want to trek to Canada.\nAlso I call bullshit on the cousin. I don’t believe an DUI would ban them from entering? I could understand barred from driving there but entering!?!", "If no one wants to come to your wedding, why do they care where it’s held? You are NTA.", "Oh no, cousin and aunt are suffering from the consequences of their own actions! NTA", "\"Just to be clear..  you want me to move MY wedding to a different location a month before the wedding.  \n\nA wedding that I've paid for myself.  \n\nA wedding that has been planned for a year down to the last detail.  \n\nA wedding that all the guests have booked and paid for their travel and accommodation.\n\nA wedding that not just the location is booked, but also the entertainment, food, photographer, etc for this specific location.\n\nSo you want the bride and groom to move this wedding because cousin decided to drink and drive.\n\nAnd because the couple don't want to move THEIR wedding which they woulf then lose tens of thousands in costs plus force all the guests to change their plans and money, all because one of the guests is a criminal and a drunk... I'm the selfish one???\n\nDo you think that this wedding is somehow for you?  Do you think that the world revolves around you?  That you are the main character?\n\nDon't bother getting me a gift.  The invite to my wedding has been revoked.\"\n\nNTA", "NTA. Your family sounds selfish as hell. They want you to lose out on all the money you've already spent on your wedding, in advance might I add, because your cousin was stupid and got a DUI in Canada? They can kick rocks.\n\n> I tell them no (mind you my fiancé and I paid in full for our wedding with no help from our families). I get the same response calling me selfish and that no one wants to come to our wedding anyway.\n\nThis tells you everything you need to know about how they really feel about you.", "NTA...you are in no way the AH..I have a serious issue with drunk driving your selfish cousin can stay in the US. I am Canadian and I welcome you! Enjoy your wedding which I am assuming is in Toronto given your comments!", "Nta \n\nDo people really think it’s easy to change the venue of the wedding just like that? It really seems like this is the 20 year olds problem. Not yours. He should have been less selfish and not driven drunkn", "NTA - I got a little pushback when I got married in Mexico.\n\nBut then our families had such a wonderful time, that one couple got married there later, and others started to make it a regular destination. They remarked how magical it was and how it was “the home moon they never took”.\n\nThey’ll enjoy it once there.\n\nAs for thee 20 year old - not your problem. Maybe they can get some sort of exception, but leave it with them to sort out or miss.", "NTA\n\nSounds like you chose well in living near his family instead of yours. Yours sound awful.", "Oh ya for sure - NTA, eh? Your aunt and cousin sound like a bunch of hosers.", "NTA, but your dad MASSIVELY is.", "NTA Your cousin should experience the consequences of her actions.", "NTA!! The gall of your family members! My God \n\nYou will have the most amazing wedding ... Good luck and block them all!", "NTA.", "NTA\n\nIf she can't come to Canada because she drank and drove, then that is HER problem.\n\nWe don't want drunk drivers in Canada and if the time has expired (I know Americans who have drank and driven before and after a time, they came back), we don't want her doing it again!\n\nWe would like you to get married here - fall leaves are nice to see but we don't want driving drunks.", "Hmm... Sounds like living in Canada will be a wonderful break from your family. Who cancels a wedding for a random alcoholic cousin?\n\nNTA.", "Is this real? I can’t believe people have family this selfish. \nNTA.", "\\*OP has planned to have her wedding in Canada, her fiancé's home country and OP's future home, which has been known for at least a few months\\*\n\nAunt/uncle/dad/cousin: \"Apparently this cousin you're not close with can't enter Canada ATM, change the location to *our* country\"\n\nOP: \"No\"\n\nA/U/D/C: \"Okay... Than postpone the wedding. It's already paid for, but fAmIlY is more important, right? So, just postpone.\"\n\nOP: \"No\"\n\nA/U/D/C: \"OP, you're selfish!\"\n\nReddit: \"No\"\n\nNTA. OP, be glad you're moving to Canada, away from this \"if you don't cater to me, you're selfish\" toxic mentality. If you want to \"fix\" this mess they have known for about a year but decided to ignore untill it was too late, uninvite the cousin and everyone that is calling you selfish for \\**rereading the post\\** going through with your wedding planned to be held in a little over a month, that both you and fiancé have been planning for months and have fully paid already.", "Wow, OP, NTA\n\nIt's YOUR wedding. Period\n\nWhy do they expect you to do this for one person? One who, from the sound of it, isn't even all that close to you? So what if she doesn't get to come to your wedding. Her mistake, her problem. \n\n\"A mistake on your part is not an emergency on mine\"", "NTA and there isn’t even a question. Changing a wedding date and venue to accommodate a single guest is an insane and bizarre request. Not even a member of the immediate family or bridal party, a cousin who isn’t particularly close. The fact that your dad is in on this is particularly weird and alarming.", "So, you're marrying a Canadian, and will be moving and living in Canada full time. Craaaaazy, that your want your family to come visit nearby where you'll be living and meet the inlaws.....\n\n\nNTA", "Why do people lose their frickin minds when it comes to weddings? Your family has no say. Either they come or they don't. End of. \nSheesh. There's always somebody that has to ruin it for everybody", "Tell them all you will do it.  Then, don't do it.  What are you losing?", "NTA: your family would rather side with your one alcoholic cousin than go to your wedding which they all RSVP. My crystal ball tells me you won't see them much after the wedding even if they do go.", "NTA! If they are so bothered with the location, they can just simply don’t come. Easy. Sorry but they are very selfish! Welcome to Canada, OP!", "Has anyone else noticed that people who call other people selfish do it only because those other people are refusing to meet the name caller's demands?  \"You're refusing to bend yourself into a pretzel to accommodate my wishes? How selfish of you!\"  I always think that the accuser is the selfish one.", "Why is it so hard for people to be decent human beings nowadays? NTA", "NTA, congrats and welcome to Canada from a Canadian!", "NTA. Your family sucks and is trying to turn your day into their day. If they can’t go then unfortunately they’ll have to miss it and it’ll be your cousin’s fault. Instead have fun at the wedding and ignore your family and their attempted guilt trips", "NTA - holy projection.  you're not the selfish one, your cousin is an entitled idiot. She was an idiot to drive drunk in the first place, never mind doing it in a country she does not live in, and for her to demand that you change your paid for plans for your wedding because of said stupidity is entitled as hell.  Especially at what amounts to the 11th hour - it would be one thing to suggest that this could be a problem if you were in the early stages of planning, but now?  Not going to happen, and they were huge AH to be demanding this of you.", "NTA and what is with your dad? Is his niece/nephew more important than sharing your big day with you? Tell them all to kick rocks and leave them in the dust for your fresh start in Canada! Congrats on the impending nuptials", "Hello Canada, goodbye murica", "NTA. You and your fiancé have paid for everything, now some distant relatives are demanding you forfeit the money and choose a new venue (unobtainable during wedding season) for the convenience of a cousin who can’t get to your chosen venue?\n\nCanadian here, for the benefit of those in Yankeeland (roughly half of Redditors), in Canada impaired driving is an indictable offence under the Criminal Code, closest ‘Murican legal term is “felony”.\n\nTell your extended family that the matter is closed, your wedding will be following your original plans, and any further attempts to convince you to change your plans will result in the invitation for the person involved being revoked.", "It's not your fault that your cousin skipped on a DUI charge and has a warrant out for her arrest.  NTA.", "Jeezus. Do you even have to ask? What is with American families trying to just casually get their kids to change their WHOLE wedding for some extended family member?? NTA, but you’d be an idiot to change anything for them. You won’t even miss them there.", "NTA OP. On behalf of my fellow Canadians, welcome eh!", "NTA but, maybe you could drop a dime to the Canadian police and give them an anonymous tip as where they can find the fugitive…😉I mean, that would solve the problem…", "NTA. How did they even come up with that nonsense? If your cousin can’t attend, then she can’t attend. You can all organize a family dinner next time you come for a visit?\n\nJust looked into it a bit and perhaps she can apply for a single-entry Temporary Resident Permit for the wedding? Though I’m not sure how long that takes or costs. The processing of such things can sometimes take weeks or months so it might be irrelevant. But I've seen somewhere mentioned that the process is much shorter if you apply at the port of entry into Canada that you plan to use. At least it's worth looking into if they want her to attend.\n\nEDIT: Added info about TRP", "NTA. I think driving whilst intoxicated and risking killing someone is WAY more selfish than having your wedding where you want. Also, welcome to Canada, eh.", "NTA. Sure it’s a nice to have everyone who loves you and wants to celebrate you but really it’s the bride and groom the person whose legally able to officiate and the witnesses who are required. Then again I was prepared to go ahead without my mother (she didn’t object to the wedding she was just doing her usual let’s sabotage me and stress them out and I was like come don’t come I’m only getting married once 🤷‍♀️) cousin doesn’t even rate in importance to start,let alone continue the discussion of needing to move the wedding location imho.", "NTA.\n\nMy mass text reply back would be. \"Instead of focusing on my supposedly selfish behavior in having the wedding *we* want, and *we* paid for, let's focus on a 20 year old who already has a DUI on their record and isn't showing any further signs of maturity. But thank you, now I can invite more friends who care about my new beginning, since you freed up a LOT of space by not attending.\"\n\nCongrats on your wedding, OP!", "NTA for not caving in to the whims of the chick who wants you to change your entire wedding plan so she can drive drunk again.\n\nYou have to laugh this one off, for sure. In fact, lives may be saved.", "NTA - who plans their wedding on the basis of a cousins criminal charges?!!! Like seriously. Enjoy your wedding. It’s about you and your fiancé, it’s not about petty family members, they can kick rocks! And welcome to Canada future Canadian. You will love it here lol", "NTA. I didn’t have ANY of my cousins at my wedding and we managed ok. It’s an invitation, not a summons. She can’t come ? Nevermind\nConsider if you want any of the whiners at your wedding ??", "NTA but your family is! \nMaybe if they hadn't spoiled your cousin she wouldn't have gotten an DUI and kicked out of Canada!\nShe's 20 she can stay home by herself. \nI'm sorry you have such a crappy family.\nIf your mom isn't backing your dad on this, I hope she comes to your wedding.\nI think you better off without those people in your life.\n\nHave a wonderful wedding and focus on the fact that you're starting your own family with your husband that day, and not about not who is or isn't there.", "NTA - and other people’s delusions of being the centre of the universe are not your problem. Enjoy your Canadian wedding.", "That’s literally unbelievable.  There is no way a sane person would make such a request, and it’s even less likely that your father would support those idiots.  If this isn’t a fabricated AITA, then I’m flabbergasted at the selfishness and nerve of Op’s extended family.  Either way, NTA", "NTA - if this is how your family thinks, I hope you're adopted.", "Ask them why she would be in trouble?  Did she skip the country?\n\nAsk them why they are trying to support and enable her poor life choices and minimise any consequences. \n\nTell them that you literally cannot change it and didn't do anything wrong (unlike your neice).", "NTA Aren't you glad you are moving to get away from all the toxic nonsense of your family? Congratulations and best wishes!", "NTA. It sounds like maybe Aunt is making a big deal about her son missing out on things. And you know how other people like to give in to keep the peace. So the rest of the family might be trying to keep the peace.", "NTA but why did you pick Canada instead of your home? Why not a more neutral place? Just curious", "Nta. Your selfish for not changing the venue? They’re selfish for expecting you to change it just because someone in the family decided to be an idiot and BROKE THE LAW. If you are not close with this family member anyway, they shouldn’t even have to invite them to your wedding in the first place.", "NTA! Tell them to pound sand. It's your wedding, the day is about YOU and your hubby-to-be and the venue is paid for. Who in their ever-loving mind thinks you can find another venue in that short amount of time?? THEY'RE the selfish ones. Your family member chose to do something stupid by driving drunk, got a DUI and one of the the consequences of her actions is not being able to attend your wedding. \n\nBut maybe one solution is to set up a livestream for family who can't attend. My niece just got married in Rome with only close family and friends, but had her brother live-stream for everyone else in the US. \n\nCongrats and good luck to you and your fiance!", "NTA.  the audacity of even asking for a venue change for the sake of a cousin you’re not even close to.  (And I was sure this was going to be a vax-related issue)", "/s/s/s Yeah, and you forced your cousin to drive under the influence!! how could you... And your fiancee is Canadian.... \n\nNTA, it is looking to be a very good choice of having the ceremony Up North... Congratulations make it a day to remember forever!", "NTA - your father, aunt and cousin are the selfish ones, expecting you to change everything for one family member who broke the law.", "NTA. Since your family isn't coming, cancel their meals and have a marvelous honeymoon.", "NTA\n\nI would tell them their selfishness is not my problem.", "NTA. Your cousin just saved you a lot of time and money, hosting terrible people who don't support you. Update the caterer with the new, smaller number, invite any friends that were on the maybe list, stop responding to calls and texts from your ridiculous relatives and have a wonderful wedding.", "What’s with the influx of clearly NTA posts getting upvotes in here? \n\nHow on earth would anyone think they they are an asshole in this situation?", "I don't get destination weddings, this family and community cared for you and raised you until age of marriage, to leave them out of it seems selfish.", "Now you know who to walk away from for good. NTA", "I dare say the wedding will be a lot better without them.", "Happy to have you here in Canada. Your family can stay put!  NTA.", "Eh, I’m Canadian and I have a branch of my father’s family that would absolutely be this petty. Surprise, we’re not close.", "The drunk driving cousin is TA for drunk driving, and is then massively, massively TA for expecting you to change your wedding to accommodate them…", "Came here to say this.  Undeniably, your cousin is TA and selfish for putting her wants (drinking and driving) over the safety and lives of others.  It's 2023--we see billboards and PSAs about this nearly every day.", "NTA OP but definitely agree that cousin is TA, as is anyone who drinks and drives actually!", "The irony of someone who got a DUI calling you selfish actually made me laugh. They felt it was okay to put others' lives in danger so they didn't have to pay for cab fare and are still claiming you're selfish. They could have made this request prior to you booking and paying for everything and you'd still be in the right to tell them no.\n\nIt certainly wouldn't help the situation, but I'd have been tempted to point out that your cousin is a hypocrite to all involved. Best of luck for your wedding, and a pre-emptive welcome to Canada!", "Right? Some folks are being selfish & it isn't the OP", "It's not a destination wedding though. It's where the groom's family lives and where the married couple is going to live. It just so happens that some family has to travel for it.\n\nDestination weddings are when you pick a nice place to travel to and get married, not when some people have to travel.", "NTA your cousins dui is not your problem. Enjoy your wedding!", "Yea! And to have the reception virtually at the same time the wedding is taking place! Lol", "Oh, you’re right about telling these selfish, entitled relations to stuff it, but DUI does get you barred from Canada. Countries can decide who they want, and Canada does not want potentially drunken road hazards they aren’t obligated to accept.", "Yeah, she should call them out on their crap.  Let's be honest when people can't get their way then they make up lies to make themselves look like a victim and people like OP look like an arse when it isn't the case.", "no I think her own dad saying \"no one wants to come to your wedding anyways\" definitely warrants him being an asshole", "Lol", "right my thought is your aunt is saying the cousin is that important to the entire family that you all must surrender all events to her convenience even though she's clearly an idiot for the dwi actions", "Not to mention that it’s completely the cousins fault and they’re basically rewarding her for what she did. When people do bad things they have to face the consequences and not have people bend to their bad decisions", "Too much audacity? Is that a level of audacity that is just...what's the word...audacious?", "Exactly. I don’t understand why they’re exerting so much pressure on OP. Tha damn wedding is already paid for!", "Questionable Canadian character here, even I'm not that bad... NTA\n\nAlso your cousin is the worst for Boozing and Cruising. The US can keep her.", "Fer shure we have more than we actually like to acknowledge.\n\nOh, sorry, forget I said that.", "Am American, am banned from Canada due to criminal record lol (though not due to a DUI) so I am up to date on the rules \n\nUS citizens convicted of an offense in the US that would be considered to be an indictable offense if committed in Canada cannot go to canada without a special kind of permit. ALL duis are considered indictable offenses as of 2018.", "Exactly,  there MUST be a warrant out for her arrest.", "They're up here in Canada too.", "Before setting our wedding date, DH & I checked the schedules of everyone in both our immediate families except for the one dick BIL who caused drama over another sibling’s wedding.  Predictably, he called as soon they received their invitation and demanded we changed the date. “Sorry, can’t do that,” I replied.  “We’ll miss you”.  They attended and he actually behaved himself.  You gotta nip that foolishness in the bud!", "Also a 5 hour drive is nothing in Canada/US terms.\n\nI live 4 hours from my parents/where I grew up. Travelling 5 hours is pretty normal for a wedding.", "Yes! And have it at the exact same date & time so that the supporting A Hs don't set foot at the real wedding and ruin the mood.", "I do...", "But it’s “F. A. M. I. L. Y”, you can lose all the money you’ve already spent, reschedule everything in a different country for “family l!!!  It’s an obligation!!  Please spare me the family card, would they do anything like that for you?  Doubtful. Sorry you are going through this, OP, but congrats on your impending nuptials!!!", "Offer to live stream the wedding so cousin can watch it live from their home.\n\nNTA", "Lucky you. It's 86 in Ottawa.", "We went to Vancouver a couple of weeks ago. We had a lovely time, but it was also 80 Fahrenheit.", "Hey Babsie from Canada! Did you hear aboot the polar bears on the loose again,  eh? \n\nHave a good one and stay safe,  ya hoser!", "Someone made a cold joke about Canada? I bet you would downvote Bob and Doug Mackenzie.\n\n\n29°C here too, you in southern BC as well? Went from heater to AC within a week this year!", "I'm in northern ontario! Stay in the cities!! The north is too cold in the winter lol. Like -45 cold some nights", "I'm going to guess lives near Detroit with a wedding in or near Barrie.", "I generally think of a “destination wedding” as a place where neither person in a couple lives, nor their families. If OP was originally from New York and that’s where most of their family lives, but they to have a wedding in California, that’s a destination wedding IMO.", "Wait, how do you say it?", "American checking in here. Also embarrassed by how true this is.", "Yup. There are very few charges in the US that don't have an equivalent, the only one I've heard of is adultery.", "Aahhh. Another colo-rectal Surgeon. I’m watching y’all.", "This is from February, enjoy!  Screw the beer tax. https://www.google.com/url?sa=t&source=web&rct=j&url=https://m.youtube.com/watch%3Fv%3DaVeXhmcHGRI&ved=2ahUKEwjbos7ViZn_AhUHkokEHVWPBFQQtwJ6BAgOEAI&usg=AOvVaw1_oUDQEQ2yl7aQljp-1BpT", "That is exactly Sacramento weather! Spring is like 2 days long.", "Nope. Montreal. Now it's 31°c.", "Ding ding ding but the wedding is in Toronto which I guess is 4.5 hours lol", "Canadians say it like sore-y and Americans say it like sahr-y", "so sounds more like saw for an american saying sorry i think", "Canadian here! We know there are lots of you Americans who AREN'T idiots!!  \n\nAnd AREN'T assholes... like OP... NTA", "American here... confirming and embarrassed as well. 😵😱", "\"addressed the charges\" means a DUI on your record.\n\nThat is an automatic ban from entry.\n\nSo no they wouldn't be allowed in. We are extremely harsh on criminal convictions for border patrol.", "Makes sense. My info is from watching too much Border Patrol.", "My dad spent part of his teen years living in Windsor. He told me of Americans crossing the border in July looking for snow. From 200 miles north in Michigan.", "That is such a Canadian/Canadienne thing to say.  You guys are the best neighbors ever!", "thank you, though I'm english living in the US", "Is first time DUI in Canada definitely going to result in a criminal conviction? \n\nUsually does in the US but anything can be pled down if you're wealthy, connected, or just get a lucky dice roll.\n\nLike I got busted for weed in my 20s in a state where it wasn't legal in the US & it completely went away as long as I paid a fine and basically did nothing wrong for 6mo. Usually only available to \"good citizens\" who clearly just \"made a mistake,\" and only once.", "I invited a friend from New York to visit in July. He asked if he should bring skis. I said do you have snow? We're just about the same weather. He didn't end up coming after all", "Five hours is not multiple tanks of gas. I just drove ten and a half hours on one and three-quarters tanks of gas. Passports, yes, but they’d probably already have them since the wedding is a month or so away. \n\nThis is not an unusual amount of travel for a wedding, minus the passport issue, unless you’re lucky enough to have family all within the same state (in the US).", "Aww thanks!", "Right? We don’t deserve them.", "It will result in a criminal conviction- we have mandatory minimums in sentencing for impaired drivers which rule out any sort of ‘alternative’ sentencing measures - and a conviction for impaired will make it very difficult to come back in.\n\nI would bet the cousin didn’t show up for court, so there’s probably a bench warrant out for their arrest.", "Texas has entered the chat.", " Oh look it's the consequences of my actions. \n\nThe only selfish person in this story is the one who drove a car after drinking. \n\nNTA", "NTA but there's a Canadian way to say no \n\nTake off, eh.", "YTA because you said “hubby.” Otherwise, NTA. Not at all. They sound like selfish dopes.", "NTA - this is pretty unreasonable, your family should stop trying to guilt you and push you around over this. The 20 year old can stay at home since they broke the law in the country you are getting married in and are going to live in, no one else in the family is affected by this so why would you have to change everything for this random cousin.", "NTA.  Welp, new marriage, life and thank goodness…a new family!!   Gurl, run for the border asap!!  And congratulations.  I wish a happy and joyful union!", "NTA. It’s ironic they call you selfish when your cousin was the one booze cruising. Forget demanding a wedding date be changed because of your circumstances. It’s plain selfish to drink and drive considering the danger you could put others through. Enjoy your wedding in Canada", "NTA. No it’s a complete sentence, specially if you’re not close to them. If you compelled to explain anything you can apologize and explain that unfortunately moving the location of the weeding would mean a significant penalty for you. Had you known before that your cousin cannot travel, you would have planned differently. You’re happy to receive the rest of the family, and you hope your cousin can resolve his legal situation soon. Maybe he can hire a lawyer and resolve the situation before the weeding? In any case, if he or anyone decides share this special moment you and your husband they are more than welcome.", "And to think! You're moving to Canada. NTA", "NTA and move away from your family as soon as possible", "NTA.  Your cousin's legal problems is not a reason to postpone your wedding.  All this drama a month before your wedding must be exhausting.  Block you aunt and cousin to stop the drama, tell your dad he can come or not and if he starts harassing you he'll get blocked too.  They had plenty of time to voice their concerns, but the cousin's problems would still not be a reason to rearrange your plans.", "Nta, your family is selfish. Your cousin for driving under the influence. They won’t be able to go into Canada for possibly 10 years so wait for what? Your aunt is enabling their bad behaviors. Your dad can shove it. This wedding I assumed has been planned for months and maybe 1-2 years already. They had a full amount of notice to make arrangements. You’re not responsible for your cousins reckless actions. Text them that if they continue to act entitled and berate you for YOUR wedding, then they do not need to be in attendance to YOUR wedding or your life going forward. If your dad continues to enable their behaviors for a wedding he did NOT financially contribute to, then he can miss out and hang out with his family at home since their feelings matter more than his own child.", "Wtf NTA this is insane and I’m sorry you’re dealing with it", "Holy shit 😮 all I can say is stick to your plans and get closer with in-laws as your relations sound pretty selfish/self-centred (not sure if these are the best adjectives but best I could think of , off the cuff). The cousin should just stay home and others come but after those messages/calls, if it were.me,.I'd be happy about not coming", "Your reply should be,   YES I'M SELFISH, IT'S MY WEDDING AND I'LL HAVE IT WHEN AND WHERE I WANT, EITHER COME OR DON'T. IT'S MY FUCKING WEDDING NOT YOURS!!!", "NTA. How is a drunk 20-year-old cousin more important than you are? Your relatives have WAY too much time on their hands. And, why is this suddenly the talk of your family?\n\nHere's a thought. Ask the bunch of them to re-Rsvp. Make it clear (better talk with your caterer first though) that those who do not reply, or reply with a NO, are definitely no longer on the list. If they don't want to come to your wedding, they won't be welcome if they do show up---having already made their point.\n\nI really do not understand why someone in your family went out of their way to stir up this anger at you. You and your wedding have nothing to do with the drunk driver, and after all, your plans have been public for months. Tell your father, from me, that he should be ashamed of himself: his job is to support you, and he's failing mightily. Their behavior is disgusting.", "NTA", "NTA - it is likely that the cousin wouldn't even make it across the border anyway; a criminal offense is a criminal offense, CBSA would have her name on a \"do not enter\" list. But to have to move the entire wedding to accommodate this situation - nah, nope, no way. I suspect some of the \"move it\" feedback you are receiving is more smoke than fire. They know where the wedding is and when, see you there... or not.", "Block them all. Tell the family the wedding will not change, come or don't come. NTA.", "NTA. Enjoy your wedding in Canada, without these loony relatives, and more importantly: enjoy living in Canada!", "NTA \nI don’t understand this. You are not close to this cousin. Why would they even care if they were invited? Also, the amount of entitlement from these people is ridiculous.", "It's not selfish of you. It's your wedding. They are the ones being selfish. \n\nI would 100 percent bet that if you did change to a venue in the United States,  your cousin would drink at the wedding and break more laws.\n\nNTA", "I already posted earlier that you’re definitely NTA, but I also just needed to opine on how many people go absolutely fckin nuts like this over not being able to make it to a wedding (or wanting to make the couple getting married change plans to other people’s liking). It BLOWS my mind because one of my greatest hopes in life right now is to NEVER EVER BE INVITED TO A WEDDING AGAIN.", "Hey, welcome to Canada. Just remind your relatives that she isn't allowed in Canada. The rest of them are welcome to attend(provided they agree not to make a scene). Consequences of her actions. If she's old enough to drive, she's old enough to stay home.", "NTA\n\nGood thing you’re moving away.", "NTA. WTF is going o with your family? I can't believe they're all after you to change your wedding plans to accomodate one or more of them. Congratulations, and I bet you'll enjoy living in Canada.", "What the “duck” (phones auto correct).  It’s your wedding, not your cousins. Cousin was stupid. Not your fault. Cousin can stay home. NTA. That some of the family is though. If they don’t like it, they can not go. Doesn’t sound like a big loss.", "NTA. Ridiculous! The obvious solution is the cousin doesn’t get to come. Keep your wedding plans have have a great time without these people who don’t care about your special day", "So cousin was reckless and got a DUI, could have killed people, and YOU'RE the selfish uncaring one?  Wow, that is incredibly un self-aware on their part.  NTA, obviously.", "NTA. Part of having a destination wedding is that not everyone can come. So there are always people who can’t go- for money reasons, limited time off at work, etc.\n\nIt wasn’t your job to assume there was a legal reason why a random cousin couldn’t make the trip.", "NTA let the trash remove itself from your life", "NTA. and welcome to Canada!", "NTA.  These people exhibit poor manners.", "The ONLY reason we changed our wedding venue was coz grandma was 94 and couldn’t travel far. I’m so glad I did. Your relatives on the other hand sound like selfish a-holes. Your wedding will be so much better without them.", "NTA. Your family are idiots for even asking something like this and you should have laughed at their request.", "NTA. I'm going to vote you keep your dream wedding and let those who choose to stay home  do just that. It sounds like your life is about to change and seems exciting to relocate and build the life that you and your husband want. It's selfish of others to try to guilt you to change that.", "NTA, fyi to anyone else, Canada takes DUI very seriously, even if you get one in the US it can effect your travel plans into Canada.", "NTA. \n\nInvoice them! Tally up the costs of canceling so close to the date, making new arrangements locally so close to the date AND reimbursing airfare and accommodations for all the other family and friends you're supposed to care about, who would have to cancel and rebook for this one cousin. Surely if they care so much about family, they'll be willing to cough up that dough.", "NTA of course but now I'm just being nosy... Did she skip out on going to court on the CA DUI or something? \n\nI can see them not letting her back in after that but additional serious legal trouble sounds like she never dealt with it, lol.", "NTA... Create a group chat with all the family member that asking for it to be changed or move, send the bills for everyting you already paid for in it and ask when then will cover them for you to afford to change the venue closer to them. Dont know why everyonebis so held up on traditions in wedding, you dont need family present to get married.", "NTA you’re supposed to change everything and (I’m assuming) lose money because your cousin was irresponsible and got a DUI in Canada??? \n\nIt’s not like she’s your parent or someone close to you. One of the consequences of driving drunk is that you’re going to miss out on some things.\n\nEdited to fix punctuation.", "NTA but man your dad sure is.. he rather not go to his daughters wedding over an irresponsible unimportant cousin?neice? Not being able to go. \nSound slide moving to Canada is a good move.", "Driving under the influence is the most selfish thing a person can do! Dude, yesterday I blew a week's entertainment budget on a $60/7 mile Uber ride (crossed county lines hence the outrageous price) because I wanted a few beers at a party. It sucked. But it was the *right* thing to do. Your cousin didn't do the right thing. She should not be rewarded.\n\nPlus, this is your wedding! You get to choose! Its already planned! Ugh. NTA", "Nta and I'm very jealous of your new country. Leave those imbeciles in the dust.", "American here. I prefer to not say I'm sorry and instead I say 'I apologize' I feel like saying I'm sorry is like covering a genuine apology with a sorry excuse. If you're not genuinely apologetic, don't say anything at all.", "NTA, your cousin getting a DUI is fuckin selfish so that’s a cool projection by them!", "Nta. Tell your family that it's completely irrational to ask someone to lose a ton of money and to completely change a very important day, just to accommodate 1 adult person. They don't have to come. I mean, it's kinda telling that even Canada doesn't want them to come back. And like you said, you're not even close to them. Any other family members want to argue, \"our wedding day is set and paid for. We will not be changing anything. Period. If you continue to harrass us, we will make this easy on you and uninvite you. you're perfectly within your right to not attend if you feel like you don't want to leave 1 person behind.  that is your decision. You'll be missed but we understand some family is more important to you. \"", "NTA sorry your family is dumb, take this opportunity to get close with your inlaws, assuming they arent crazy too.", "NTA - You aren't selfish for not changing your plans because of an extended family member having legal problems. They however are for making the demand & becoming disconsolateed when you explained your position. It falls to the parents for not teaching their child to drink responsibility, and not to drive while intoxicated. They are probably trying to save themselves the embarrassment of having to explain why their daughter can't attend.\n\nYour father's behavior is shocking. Insisting you marry at city hall when you already have a wedding planned and paid for. I'm honestly gobsmacked by that. I mean even to support his brother or sister by robbing his daughter of the wedding she had planned and paid for in exchange for a quicky wedding so his relatives can attend. That is not the actions of a supportive parent. Then calling her selfish, when they are the one's making unreasonable demands quiet literally becoming the selfish A-holes.\n\nOP - Congratulations on your coming nuptuals! May you and your hubby have a long happy marriage!  🥂", "NTA …Your families reaction is really troubling. An adult cousin can’t come and everyone starts calling you selfish? When you’ve paid? Did they know where the venue was before this all came up? Were they ok with it? Not that their approval should dictate your choice of venue…this just doesn’t make sense. And I’m reasonably well acclimated to nutty….", "So you should change your entire wedding because your idiot cousin got a DUI! Yes a bunch of idiots!", "NYA, obviously, but I also have an idea: I wonder if you might be able to recruit the drunk driving jackass cousin themselves to defend you.  If they themselves say \"Family, I fucked up and you shouldn't hold it against OP.  I would like you all to attend the wedding. Nobody else should suffer for my idiocy,\" I wonder if that would get your, frankly, ridiculous family back in line.\n\nOr, like everyone else is saying, screw em.  You may, in fact, be better off without them.  But if you want them to attend, consider the strategy above.  If you don't have any better ideas, it might...MIGHT...be worth a shot.\n\nCongrats, and good luck!", "NTA - oh you’re selfish,  not the aunt who can’t attend the wedding without her daughter? And not the people asking you to move an entire wedding and forfeit deposits for their own benefit? Not them making YOUR wedding about them?\n\nHow could you be so selfish! /s", "Have your wedding without any of them.", "Are they kidding? You should change your wedding plans because some 20 year old  cousin got a DUI? Why don't Aunt and Uncle just leave the 20 year old home? Are they afraid he/she will drink all their booze while they're at the wedding?", "NTA\n\nAny time I see a family calling someone selfish, I instantly know said family wouldn't piss on the OP if OP was on fire.", "Play stupid games, win stupid prizes. Your cousin did something stupid, isn't allowed in the country, *she* can't come. Nobody else is prevented from going. NTA, but my god that side of your family sucks.", "I cannot believe the audacity of your family - obv nta", "Nope you’re family is nuts though. Stick to your guns and keep your plans.", "NTA\n\nWow! Who the hell demands that someone change their entire wedding because one dumbass family member can't go. \n\nThe cousin doesn't have to be there... consequences of her actions and all that. \n\nNo one else has restrictions in going that you've mentioned. So it sounds like people are looking for excuses. \n\nHave a lovely wedding", "driving drunk is selfish! NTA", "I meant it as a joke.  The way I see it is that a wedding in rhe place where I am is not all that much of a destination wedding.\n\nSeriously,  I do realize that for people who are from other places, Canada is a great destination.  But when someone is discussing a destination wedding in the very place you happen to be sitting, your first thought is, \"wut???\"", "Nta, sweetie congrats on the wedding, you will have a great time, yr family is ridiculous.", "NTA.  Your family is absolutely ridiculous.\n\nAnd FWIW, you're not even having a destination wedding. You're getting married where you and your husband intend to live, as well as where his whole side of the family lives. It's perfectly normal that you'd have your wedding there. Your side of the family has simply been invited to the wedding of an out-of-town relative. (A 5-hour drive isn't even that far. They're just butt-hurt that you won't rearrange your entire wedding THAT YOU PLANNED AND PAID FOR to accommodate your AH cousin's poor choices).", "NTA. First off, this isn’t a destination wedding, not really. It’s a wedding in the place you will be living and where your soon-to-be husband is from. \nSecond, they couldn’t have brought this issue up when you originally started planning the wedding? I presume you didn’t JUST get engaged so waiting until ONE MONTH before a wedding to bring this up is a fail on them. \nThird, this is your wedding. You (and your future husband) get to have it wherever you want. Especially since you paid for it. The fact that you paid for it yourselves (and that it’s already paid) is even more reason that it is completely inappropriate to drop this on you. \nFourth, why should you have to pay for your cousin’s delinquency? They made a choice that came back to haunt them. They don’t also get to ruin your wedding. Your cousin is an adult. The rest of your family can come and leave her at home.  NTA AT ALL. Your family is the AH for making you feel more stress at an already stressful time instead of just telling the cousin, “well, I guess you can’t go then.”", "NTA. I love how your cousin managed to get a DUI charge in a foreign country but somehow you're the selfish one. Also, welcome to Canada!", "NTA, your cousin is too for driving under tgr influence.", "NTA and welcome to Canada soon! Canada's the best 💓..I may be a little biased hehhe...what province are you moving too?", "Someone that gets a DUI calling someone else selfish is rich.  NTA", "NTA - Some people really don’t understand what the word selfish really mean.", "NTA. Hahahahaha they are calling YOU selfish?  What’s wrong with your family? What’s wrong with your dad? Is he indebted with them or something? You can’t simply cancel and change plans a month before a wedding. It is not your responsibility to change your life to please your shitty cousin. She could had killed others while she was DUI!", "NTA", "NTA. You have to change all of your wedding plans to accommodate one random cousin that can't show up?\n\nLet me guess, your aunt and other family members won't help out financially with all the money that you'd be losing?\n\nAnd they call you selfish. \n\nLook at the bright side, if they don't show up, more food and booze and cake for everyone else. Have fun.", "NTA. You've already paid and planned for everything and THEN they tell you. You're not selfish, they are\n They're inconveniencing you, your fiance, and all your other guests because someone both failed to accept their consequences for a crime and failed to tell you early enough to change plans with minimal repercussions. You're absolutely not the selfish one here.", "NTA, the audacity of putting a DUI over your major life event is spectacularly misguided. Congratulations to you and your partner, and wishing you joy!", "By their own words, they didn't want to go anyway. Sounds like sour grapes, but whatever. NTA. You don't have to adjust because he screwed up. If anything, maybe an engagement party should have been in the US. Too late for that though. Carry on and have fun at your wedding reception.", "Not that I support drunk driving obviously but I think the better response is “so sorry that you can’t join, we will have to catch up at some point after the wedding when we are stateside!” No need to go on a rampage when you can breezily brush off their suggestions (and block anyone who gets too belligerent in response obvi). Don’t even break your stride", "With the dad I am wondering about early Alzheimers. His behavior is wildly inappropriate and stupid as well. What could have possessed the man?", "If the cousin got the DUI in Canada, it’s likely not an underage DUI. Legal age in Canada is 18 or 19, depending on province.", "Partly true. A wedding in Canada where one half of the couple and their families live in Canada and the couple will be living there too, is not a destination wedding. A wedding in a foreign country where no one resides is a destination wedding, even if it’s in Canada.\n\nIn this case, it’s not a destination wedding because it’s the groom’s hometown, who, coincidentally, is also one of the people getting married. I imagine OP’s use of the term “destination wedding” is them giving in to their family’s insistence on it’s use, which is either an attempt to paint them in a worse light or a disparaging comment on how the groom and his side of the family is not as important and should not be treated with the same respect you would give the bride (I’m making an assumption on OP’s gender here, because a lot of people tend to overly focus on the bride and forget the groom is getting married too).", "She's getting married at her fiance's home. The place that she is going to live after the wedding. Why should the groom's family not count? Especially since it's clear that her family suuuuucks.", "I’d love to come over, pretty please.  I was hoping someone would invite me to their wedding in Canada so I could claim asylum.\n\nAnd OP, you are sooooo NTA. It is wild assholery for anyone to ask you to change anything about your wedding, let alone relocate you all to another country so a scofflaw can continue evading the legal consequences of endangering you wonderful Canadian neighbors. \n\nI volunteer as tribute guest and would make you a lovely handmade gift.", "Or they were deported as a felon.", "I absolutely agree!", "Why do you folks think OP's parents should pander to these idiots? Anyway, I would hope her father pulls his head out---although it's in pretty deep---and gets to her wedding, which is where he belongs.", "Are parents using cousin as an excuse for themselves?  Not wanting to travel?", "I was under the impression that you could fly into Canada with a DUI, you just can’t drive over the border. Is that wrong?", "I'm not buying all this. Not your part. You're NTA and you should absolutely die on this hill.\n\nIt's the explanation for why they want you to cancel the wedding. Your cousin got a DUI. If she can't go, that's her fault. Plain and simple and everybody should know that. She's one person and people cancel or can't make it to a wedding all the damn time. Plus, if you canceled you would lose a lot of money. Unless you're so well off that you can shrug that cost off, they know this and are STILL pushing you to cancel.\n\nAll of this sounds like there's some kind of panic amongst them about you having this wedding in Canada... or perhaps at the scheduled time. In any case, this much scrambling, entitlement, and vitriol is completely out of proportion to one younger cousin not being able to go because she fucked up. \n\nI'm very intentionally stirring the pot here. Something stinks in Denmark. Are there any other big events that you know of that your dad and Uncle would want to go to during your wedding? Could your cousin be bribed to take the fall? \n\nIt's just a hunch, I could be totally wrong, and your dad's family could be this entitled, but it seems hard to believe that a sudden uproar over canceling the party would pop up because one person can't come.\n\nAre they generally this entitled?", "Your cousin got her DUI a YEAR ago! And she waited until a month out to bring it up? This is all on her. I'd tell your dad that she's had a freaking YEAR to bring this up and waiting until the last minute is a stupid, selfish move.", "I meant it as a joke.  The way I see it is that a wedding in the place where I am is not all that much of a destination wedding.\n\nSeriously,  I do realize that for people who are from other places, Canada is a great destination.  But when someone is discussing a destination wedding in the very place you happen to be sitting, your first thought is, \"wut???\"", "Don’t worry about this treasure right here.\n\nJust remember, they’re the ones who said that no one wants to come to your wedding anyway.\n\nBtw, if they say that again, just reply with “Great, then that’s sorted! No need for this conversation, ever again! Good luck with the drinking and the driving, and preferably not combining the two, seeing as how it’s an utter dick move. Cheers!”", "I wouldn't call this a destination wedding. It gets people all bent out of shape for no reason. You are getting married at your new home and your fiance's home. That's not a destination. It's you getting married at home. Just because some people have to travel doesn't make it destination.", "And they’re completely ignoring the groom’s family, most of whom live in Canada.", "This should be OP's response \"Let me get this straight, you are going to allow someone who was dumb enough to get a DUI in a foreign country dictate what you do with your life? That's alot of power to give to someone who makes such bad decisions but hey if that's what you want.\" Then end it with the Canadian equivalent of \"bless your heart.\"", "I as a Canadian Lol’d at this. We don’t. I’m sorry but we really don’t have more sense.\n\nWe have bucket loads of idiots. I mean they are our idiots and we love (some of) them. But the idiots just don’t travel much so they are our little secret. But now you know 🌈", "as an indigenous person, Canada is not as great as y’all make it seem. even today, the disrespect indigenous peoples go through from both the people and the government is disgusting.", "I like you.", "My guess is her father doesn’t want to travel and has grabbed onto the cousin’s situation as a convenient (yet stupid) rationale.", "I know I was like since when is a 5-hour drive a destination wedding. My cousins getting married at his moms cabin 4 hours outside of the city, is that suddenly a destination now too lol?", "a DUI in some states may be considered a driving infraction. so many people believe that because it's a driving infraction (like a speeding ticket), it 's not a criminal offence.  In Canada, we take that DUI and we have to find the equivalency in Canada's criminal code (CCC).  For Canada, for what may be a driving offence in the USA, the equivalent to that is Operations while impaired. So, if an offence exists in the CCC, for us in Canada, you are deemed ineligible in Canada because you have a criminal conviction or its equivalent in the CCC. Having said that, if the officer doesn't ask you and you don't tell and they waive you in, well.....   So legally speaking, there is no difference whether you fly in or drive in: a criminal conviction is treated the same.", "Still is! We don't do temperature variation. It will be about 80 until the end of August.", "How do I know it's humour? As I've mentioned somewhere in this post, former CBSA officer.  have had Americans coming to Canada to visit the Queen.  Queen doesn't live here.  An American tells me they can come whenever they want. No sir, you are coming to Canada, it's not USA.  Asked someone, what is your purpose of your trip to Canada. oh coming to ski. We're in July....", "I knew someone from New York State, Long Island, and they pronounced it \"soar-y\".", "Lol", "This is true. And that part sucks too. But it's not like Americans treated their indigenous populations well either. I mean we subjugated and decimated them. Along with all the buffalo. We sucked hard with that : (", "I’ll make something for you, too 😀", "Yeah I think what confuses people is that most misdemeanors in the US won’t cause you problems, just felonies, but DUIs at least CAN often be a misdemeanor depending on where you live but will still get you banned", "Well after all that, she’d be taken to the border and removed from the country. It won’t be hard for her to leave, it might just take a while.", "Ah. It's less than 4 hours to Toronto from Detroit so I figure an extra hour you would go north towards Barrie which has lots of lovely wedding locations. Unless it's a long weekend then 5 hours doesn't get you anywhere. \n\nRegardless, welcome to Canada. Please leave your guns at the border and a reminder that the country will shut down for a good hockey game.", "I live in St. Louis and I’ve driven to Toronto for fun! It’s not that hard!", "I’m Canadian, but I didn’t realize sorry was a word Americans thought we said funny! 😂\n\nI’m feeling kind of old, I’m used to the aboot jokes.", "SOME Americans say it like that. \"Sorry\" is a word with varying pronunciations all over the country.", "Hi. We can’t paint all Americans (or any other nation) with the same brush. You are not an idiot and you don’t need to be embarrassed. OP is an American and she isn’t an idiot either, moreover she is NTA.", "Yes, I should have said leaving in a timely fashion.", "We combine them. \n\n\"Soary aboot thaht\"", "All good points", "Driving while impaired is an automatic felony here. You don't get to plea it down. Maybe 40 years ago, you might have been able to have the right connections but not in the last at least 30 years. We might not be perfect up here, but there's absolutely no wriggle room for something like that. Unless you get a cop who doesn't do a sobriety test on site you are fucked. \n\nWeed, not a felony. Not until you get into heavy amounts. It's not even illegal since 2018. Handguns, they're illegal. Don't bring them here. You will get a colonoscopy from the rcmp. \n\nDon't let Canada's reputation of being the nice guy fool you. We're very strong on our stances, and we don't put up with shit. I live in a border city, and I'm terrified of the way things are going just across the line. I watch the local news for 5 minutes, and if it isn't about the weather, I'm freaking out and having nightmares.\n\nI'm Gen x, and I remember Watergate, the OJ trials, I remember Reginald Denny and the LA race riots. The US is becoming a huge dumpster fire, and it's only getting worse. Canada needs to shore up her bulwarks to keep you in your own festering pile of crap and not let it spill up here.\n\nSo, some dumb girl committed a felony and fled. We're happy to keep her out of our jurisdiction. She's your problem now. If she tries to come back, we will politely send her through our justice system. Probably won't be a lot of fun for her. \n\nI'm glad I'm old enough to remember a lot of US presidents and Canadian Prime Ministers, both good and bad. I'm looking forward to a millennial US president, I hope I see one in my lifetime. We have our gen x Prime Minister right now, but I'd really like to see the millennials take a hand in our future. You all need to ditch the baby boomers and get a president with a discernable pulse. Seriously, it's annoying.", "George W Bush had a DUI from 1976 where he paid a $150 fine, if he wasn't the President when he came to Canada he would have not been granted entry."]}