{"id": 18442, "submission_id": "13up00w", "title": "AITA for kicking a stranger out of my house at 1230 AM because I’m uncomfortable even if my roomate supposedly knows them and possibly told them they could be there?", "selftext": "I 22f came home to a stranger a man in my kitchen and had a mini heart attack. (Idk his age sorry) but again I literally have never met him. Upon talking to said stranger my roommate was supposed to text me letting me know he was going to be there. My roommate left for a few days and there was no prior conversation that he was going to be here. I have my own personal issues with men let alone men in my only safe space which is my house. Anyways he said he was just going to eat for a bit a leave. This was 9 pm. I gave him the benefit of the doubt and let them stay til 1245 around when I was heading to bed. At 1245 I asked if he was leaving soon. He then said he’s spending the night. I immediately told them I’m not comfortable with that. I said I’ve never met you and I’m sure you’re nice but I was given no heads up or warning so I’d like him to leave. He was reluctant but said he understood and ultimately ended up leaving at 1. I texted my roommate and told her politely I’m not comfortable with that and I would really appreciate common courtesy of respecting my living space since it’s just as much mine as hers. But now some stupid little voice in the back of my head is telling me I’m a massive cunt and drama queen :(. I don’t feel like I’m in the wrong but my brain won’t stop saying I am.  \nEdit: I let him stay so late bc I’m awful and confrontation and he said he was only going to stay for a little bit. Mistake on my part I should’ve made my boundaries and uncomfortableness clear much earlier on. I hope this never happens again but should I know how to respond.", "created_utc": 1685349077, "permalink": "/r/AmItheAsshole/comments/13up00w/aita_for_kicking_a_stranger_out_of_my_house_at/", "score": 719, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I kicked a stranger out of my house at 1230 AM bc I was uncomfortable\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. Could be he was the nicest guy in the world and your roommates best friend. Could also be he was a super bold serial killer who was about to murder you in your sleep. \n\nIf the first, he’ll / they’ll forgive you.", "Yeah, NTA. You haven't even heard from your roommate confirming this is someone they actually know and did invite over? Nope, nope, nope! I've watched too many Mr. Ballin stories to let that happen. Also he said he would leave in a bit, then said he was staying? **NOPE!** I'm glad you're safe. Your roommate owes you a *huge* apology and a promise to never, ever invite anyone over to stay without your consent, meaning they *ask you if it's okay and get your permission first.* I mean, if they were inviting someone over to stay with them while they are there and never leave them alone in the house unless you are familiar with them and comfortable with that, that's fine, but inviting someone to come over to your place while they aren't even there and stay the night and not even bother to tell you, let alone *ask you first?* **Oh hell no!**", "NTA.  This was a really creepy story.  I might have nightmares.  What was your roommate thinking?", "NTA. That’s weird as hell", "NTA, not even a little bit", "NTA.  First he said he ww going to leave after he ate; then he said he was spending the night.  NTA at all.", "NTA. You don't spring an unattended, unknown male overnight guest on your female roommate without talking about it.", "NTA — glad you are safe, that was a horrible situation to be in. I would have kicked them out asap. How did they even get in? And do they still have access?\n\nTell someone you trust to care about your safety in real life just in case.", "NTA \n\nMy God! How scary! You did nothing wrong by asking him to leave. When your roommate comes home, (if not before) you need to sit her down and have a serious conversation with her about strangers who aren’t known to both of you to just come on in and lollygag around! It’s a scary world out there. How would she like it if you’d done something like that!? It’s extremely disrespectful not to mention scary.", "NTA, if I walked into my home and saw a stranger and my roommate was out of town I would have backed out and called the cops.", "NTA at all! She shouldn’t give a person access to your shared space when she’s not there. Especially not someone you don’t know and without even a warning. But also if you did know him and she did warn you, you get to refuse.", "NTA. I have no issues with men and have some experience wich makes me believe that my chances to protect muself aren't too low, bur I would make him leave at once if I were in such situation. You was not warned, you have almost no means to verify its the very man your roommate allowed, even if you text them to check. But the most important, your roommate should have asked you first, not just inform (wich wasn't done as well), and if you didn't allow this unattended guest, he is not supposed to be in your apartment. You waited too long to kick him out.", "Absolutely NTA. Even if this person was a woman, you would still have good reason to feel uneasy about sleeping under the same roof if they are a complete stranger to you. It's your home - you have a right to feel safe. Your housemate should not have invited this guy over without clearing it with you first - they were totally unreasonable.", "NTA, but a really strange story overall. next time - text your roommate directly when you see the person. Why did you allow a stranger in your house for 3 hours? This seems like the weirdest part.", "NTA.  You have a shitty roommate.  How about a phone call to say \"Hey is it ok with you if my friend Jeff stays over?\"  Otherwise there was just a creep you didn't know in your house at night.  \n\nHow did this guy even get into your place?  Does he have keys?", "First of all you tell your roomate that this isn't a hotel, it's a SHARED living space. If she wants to leave randos then she should move out alone, and then you don't give a fuck if she invites Jason, Freddy and Chucky, just not in YOUR home. Second: look for an other roomate or the posibility of living alone, this type of ppl only brings problems, and u should try to live life as confortable as you can.\n\nNTA", "NTA. I was in a similar situation years ago, and the guy wouldn’t leave without me and my friends kicking up a stink. It was so uncomfortable and infuriating to have a stranger in the house who decided to make himself at home. I nearly called the police. \n\nYou are absolutely NTA.", "NTA and no you can never accept anything like this. Huge red flag! And don't ever stall your actions again...like whattt...you let him stay those hours. You need to learn to act on your feelings and to be firm when your instincts say: NO", "NTA but how did he get in? If he has a key, locking the door won't help. \n\nMy suggestion is definitely stay with family or a friend until she gets back and you can talk to her.", "NTA he never should have been there in the first place if your roommate wasn't home.", "Oh HELL NAW!! You don’t have to be nice. You deserve to feel comfortable and safe in you own space. Period. No more explanations needed. \n\nThis is where you live. This is not some public rest spot for your roommate’s people to stay in. Safe trumps nice ALL THE TIME. Please put your mind at ease about this because you were not rude, your roommate was for putting you in this situation. Your response was reasonable, logical, appropriate. Too bad for the stranger, but you have to look after yourself first.", "NTA. They shouldn’t be leaving people there alone regardless of texting you.", "I would have told him to leave when I got there and if he didn't want to I would have gladly called the police to escort him out. But thats me. Also I hope you were able to snap a photo of him, because if he's not your roommates friend, and actually is someone who wanted to do you harm, that would definitely come in handy for the police...\n\nYou are 100% NTA. And you should really consider either getting a new roommate or getting cameras in your personal and shared spaces plus have a roommates agreement signed. How do you know he didn't steal anything or do any creepy stuff to your rooms? \n\nKeep us updated if your roommate says anything.", "NTA. This is not ok.. your roommate is AH", "NTA. So what did your roommate say?!?!", "NTA. But you should have told him earlier to leave if you were so uncomfortable with him. Also do you have a roommate agreement that takes care of these situations?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI 22f came home to a stranger a man in my kitchen and had a mini heart attack. (Idk his age sorry) but again I literally have never met him. Upon talking to said stranger my roommate was supposed to text me letting me know he was going to be there. My roommate left for a few days and there was no prior conversation that he was going to be here. I have my own personal issues with men let alone men in my only safe space which is my house. Anyways he said he was just going to eat for a bit a leave. This was 9 pm. I gave him the benefit of the doubt and let them stay til 1245 around when I was heading to bed. At 1245 I asked if he was leaving soon. He then said he’s spending the night. I immediately told them I’m not comfortable with that. I said I’ve never met you and I’m sure you’re nice but I was given no heads up or warning so I’d like him to leave. He was reluctant but said he understood and ultimately ended up leaving at 1. I texted my roommate and told her politely I’m not comfortable with that and I would really appreciate common courtesy of respecting my living space since it’s just as much mine as hers. But now some stupid little voice in the back of my head is telling me I’m a massive cunt and drama queen :(. I don’t feel like I’m in the wrong but my brain won’t stop saying I am.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "You haven't heard from your roommate?  Do you realize he may have just broken in and blooded, because he overheated her name?  If your roommate gave him a key she put you in danger.  Do you even know if he knows your roommate?", "NTA but you are massively under-reacting.\n\nIf be changing all locks and going absolutely ballistic at the Friend. How fucking dare she do that. As a Dad this has triggered a primal rage in me. I'd wanna go there and replace everything, install deadbolts and yeet your roommate through the front door.", "NTA. You let him overstay. It’s ok to say you are not comfortable with a situation. .", "He said he was leaving soon then after midnight he was going to spend the night. This was not the nicest guy, even he wasn’t serial killer.", "Yeah exactly, it might’ve been different if I’d met him a few times but honestly when I knocked on her door bc he was in her room he didn’t answer multiple times and my first thought was omg he’s gonna kill me or something whether that be true or not I’m still freaked out", "Thank you, my roommate already has pretty bad boundary issues in general with just having people over all the time and whatnot but they’ve never done this so I’m pretty taken aback.", "Idk she doesn’t really respect a lot of my boundaries but this is a new one I’m very upset tbh", "Yeah that’s what weirded me out. Her friends and her are night owls so I figured he would leave hopefully around 11 or 12. So when he didn’t and said he was spending the night I immediately was like no can you go to your house, he said it was because he has to work early and he didn’t want to go home. I was like shaking with anxiety the whole time but he finally understood that I wasn’t going to be comfortable til he left.", "I think they were here when she was here earlier before she left for her trip. But I’ve never met him so I could be wrong but I hope not. You need keys to access the building and a pin to enter my apartments door but she could’ve given it to him idk, I’m trying to just not think about it bc even though I’m sure he was just her friend and she just forgot to text me I’m still paranoid", "Yes you are right. I texted her to help soften the blow for myself so I can bring it up to her when she returns. I probably grew up watching to much ID but you are right the world is scary and her friend or not I don’t know him. Thank you.", "He started talking instantly and I was already inside with the door locked bc my back was turned to him. And I was honestly too scared to try and take any action or make something big out of it but I really wanted to at first. I typically have freeze response during fight or flight unfortunately. But him having the explanation ready made me relax a tiny bit but like barely.", "I know I waited and I’m glad that he wasn’t an axe murderer (I hope). I’m just very non confrontational which my roommate also knows so idk how she thought I was going to be ok with this. I’m surprised I let him stay as long as I did but if the situation ever somehow occurs again I’ll put my foot down much sooner.", "Thank you. I probably would react the same if it would have been a woman too. I’m just not good with new people in general even in public. So yeah coming home to one in my house at night with no warning set off my panic alerts :///", "I did text them they don’t have service rn at some music festival. I let him stay bc I’m very bad at confrontation and I’ve met her other friends so I was just trying to be polite bc I’m a loser pushover whose scared of men in general so just trust me those 3 hours were internally hell.", "I believe he was here earlier with her before she left for her trip. You need keys to access the apartment building structure. You need a pin to enter my apartments door so she could’ve given it to him but I hope not bc that would also constitute me being pissed off bc it’s like giving keys out. So let’s hope not.", "Thank you for the response. I’m definitely gonna put up a very firm boundary over things like this and if she fails to respect I will break my lease asap and move elsewhere", "I’m sorry you had to go through that. That sounds like an absolute nightmare. I got worried when he was reluctant at first but thankfully he wasn’t too hard to make leave.", "Yeah absolutely. I got very lucky with how this situation turned out. I have a very hard time saying no but this incident has definitely made me realize I need to push through my anxiety and stand up for myself. Thank you for the response.", "I believe he was here with her earlier before she left for her trip. I have records of the doors being unlocked and locked since you enter into my apartment by pinpad. I hope she didn’t give him it. To enter the apartment building you need keys but we’re not allowed to make copies so I don’t think she would’ve given them to him. I don’t have anywhere else to stay. He’s gone now and I’m just trying to not think about worst case scenarios. But I’m definitely hoping she texts me back soon. Thank you for the response.", "Yeah I thought someone had broken in at first it really put me on edge.", "Thank you you’re right", "I thought about it but I also had never been in this situation so I didn’t know what to do. The only reason I semi believe him knowing my roommate is because he seemed to know his way around the place like he’s been here before. That’s stupid I know but it helped calm me down. I didn’t get a photo but I’m searching my roommate’s Facebook friends to see if I can find him. My door has a lock on it so you’d need to Jimmy it open so I’m guessing he didn’t come in here. And nothing appears to be missing. I will keep updating. Thanks for the response.", "I checked her following list and he’s on there so they are in fact friends. Doesn’t change the fact that I didn’t know him but I’m 99% sure he’s not a murderer.", "And she’s away at a festival with no phone service", "You’re right.", "Might be time to get a new roommate.", "You don’t “just forget” that if you respect your roomate. You’re making excuses for her that wouldn’t be acceptable even if she made them. You will need to confront your roomate, please don’t let this get swept under the rug", "You’re welcome sweetheart. I’m glad you’re ok!", "Put your foot down now- you need to confront her before this happens again and something bad actually DOES happen. She is showing bad judgement and you do not want to be on the wrong side of her being a bad judge of character. Seriously, don’t let a fear of confrontation stop you from advocating for yourself - its far better than something bad actually happening because you wanted to avoid confrontation.", "Don't be so hard on yourself, nothing you described about this situation makes you a loser!\n\nI think anyone would be taken aback by this!", "Yikes.  I would feel so unsafe.  I hope you can have a serious conversation with your roommate about boundaries and agreements.  Do you guys have any kind of roommate agreement?  Like [This Roommate Agreement Template ](https://opendocs.com/wp-content/uploads/2019/10/Roommate-Agreement.pdf)?", "Is there anyone you know that can stay with you until she returns? You have a right to feel unnerved.", "Its a very strange and scary situation to be in. I don't blame you for not knowing how to handle it. I think you did your best, and you did get him out of the house so thats a huge win. For now, just try to relax and destress/ let the adrenaline calm down. Make sure your phone gets charged, eat something comforting and try to get some sleep.", "[A Case of the Creepy Dudes](https://captainawkward.com/2012/08/07/322-323-my-friend-group-has-a-case-of-the-creepy-dude-how-do-we-clear-that-up/)\n\nPlease read this, OP. Every time I share it, a woman will comment how she wished she'd read it sooner. I shared it 3 days ago, and the replies are heartbreaking. \n\nIt's the best explanation of 'rape culture' I've seen. It shows how much we women have been taught to downplay important warning signs. It'll explain why you wanted to give the guy the benefit of the doubt, and it will reassure you that your gut reaction is worth listening to. \n\nEven if the guy was a friend of your roommate, that doesn't mean he's safe. Please, empower yourself and read that article.", ":// conflicted but if she thinks I’m in the wrong over this that might be the eventual case", "This is my first time living alone so I didn’t even think to look for these but this a good idea, thank you for sharing it. I hope so too. There’s been other instances where I’ve felt she gaslighted me and I just kind of move on bc idk what else to do but I like where I live so I really hope she understands where I’m coming from and it doesn’t get to a bad point.", "No I don’t, maybe I could ask someone but I’m gonna wait out the night maybe try and get some sleep and hope my roommate reaches out to me but if not by tomorrow I might message my friends mom bc she has an extra room.", "Thank you very much for sharing. I hate how much I could relate to over half of those disgusting instances. Being a woman is hard. I’m glad he’s gone now I just don’t think I’ll be able to sleep til the suns up.", "You should not be conflicted about this. Especially since you said she already doesn’t respect a lot of your boundaries. Please don’t stay in this situation. You need to do what’s best for you!", "It's already at a bad point. She left a stranger alone for you to deal with in your safe space.", "That's valid because honestly... how did he get in?? It doesn't sound like your roommate was around to let him in, so does he have a key? Do you have a door chain you can use so he can't let himself back in?", "Thank you I’m really thinking about it but moving and everything is expensive so it would definitely have to be a planned 100% decision I’ve only been here a year and besides these few incidents I do really like my roomate. It’s just hard. But this is definitely showing me a new side.", "I know I just don’t have the capacity to move right now :/ and I can’t break my lease with paying a shit ton so I really have to wait it out for now unfortunately", "I believe he was with her here earlier before she left, no door chain but my apart needs a key and PIN code to get into it so I’m guessing he doesn’t have those I hope. I’m locked in my room and he’s gone and left hours ago so I think for tonight at least I’m ok.", "When people show you their true colors, don’t give them the benefit of the doubt. People who are fun to be around (like your roomate I gather) should always be pleasant (though misunderstandings and arguments can happen). \n\nPeople who disregard others as blatantly as your roomate rely on others giving them the benefit of the doubt as they’re so great all the rest of the time. Don’t tolerate people like this in your life as all the good times will very quickly get erased when they do something that has serious and permanent consequences. \n\nYou seem very nice, which is a big problem in this situation, as your niceness will only serve your roomate and will NEVER be reciprocated in any meaningful way. Be decisive and always maintain a standard of how YOU deserve to be treated, which your roomate has flagrantly breached, by enforcing consequences and leaving situations that do not fit your level of self respect. People who do not respect you as you respect yourself should not be kept in your life.\n\nYour roomate left you with a total stranger in frankly unacceptable violation of what you should expect as a roomate, and as a result left you in a situation that was dangerous, causing you a great deal of fear. Do not leave your roomate in a position to get you hurt on have your stuff stolen. Making moves to make sure this never happens again respects your need for a safe home environment", "Are those extra costs worth your missing safety? Being a possible crime victim in your own home in the future because your roommate is reckless?\n\nThis is what you should weigh the costs against. Not if this in convenient etc.\n\nYour roommate doesn't care about your safety. She just doesn't care. And this is what you should have on your mind. Not her being nice most of the time. She isn't your friend.", "That's such a relief to hear! Stay safe!", "Thank you 🫶🏻", "NTA  \n\n\nMy g/f (now ex from years ago) and I were at home, watching TV (we lived with her family member for the time) and heard the back door in the middle of the afternoon. We thought it was her family member, so I went to go see if he was ok since he never responded to our calling his name repeatedly. When I looked in the bathroom, some guy was in there blowing chunks. I was like, \"excuse me, but who in the heck are you?\" He said \"Joe\" (fake name) gave him a key to go in at anytime and he did, because he had to \"puke and poop\".   \n\n\nBruh....  \n\n\nWhen her family member got home, we all had a huge blowout and her family member ended up moving out.   \n\n\nThis is absolutely not ok. Your roommate is a huge idiot.   \n\n\nRethink the people you call \"home\" with.", "I can’t believe you let him stay for hours. I’d have kicked him out immediately", "So, you found this guy you don't know, eating your food in your kitchen at night. I would have called the cops. Your roommate is a complete a****** and so is that guy. I would make it very clear to her that that is not going to happen again.", "NTA. Your roommate is supposed to be present when hosting visitors.", "NTA. Roommate could have called or texted you before she left the apartment, she didn’t.  That’s suspicious.  He said he was just staying a short while, 3 hours later he says he’s staying all night.  Suspicious.  Trust your instincts, if your gut says get away, then get away.  Don’t ever let your “personal issues with men”  silence your instincts.", " NTA and don't feel bad and your roommate is a huge AH for making you go through this.", "Typically your first reaction is the correct one...", "NTA. This was such an inconsiderate situation for you to be put in", "NTA  any guest should be accompanied by the host.  If your roommate is not present, her guest shouldn't be either.", "You held your ground appropriately. Did your roommate ever chime in to say if he was there legitimately? It doesn't matter if he was, btw. Both of them should have realized they were creating an awkward position for the guest and come up with an alternative. Nta. Keep practicing. You're getting good at this confrontation thing!", "NTA \n\nTell the roommate to never do that again. You need to tell someone if this ever happens again, “you need to leave immediately and if you don’t I’m calling police.” Hold the front door open and stand by it with it open until they leave, if not stand in the doorway and call police. This is scary! That could’ve been anyone just saying your roommate let them come in and stay and they actually didn’t! Wtf!?!?", "How did he get in?  Did your roommate \"lend\" him a key?  This is scary.", "NTA I'd kick him out immediately and lose my shit at my roommate. That's so scary, who knows who they might have been?", "NTA. What a scary evening. Don't feel bad about how you acted! You definitely didn't overreact.\n\nIt's such a bizarre situation too. Why would someone's friend hang out at their house without the actual friend being present? Is he homeless? Anyway, it's very unusual and definitely not your problem.\n\nI would ask your roommate who she has given access to the apartment to.", "NTA HOLY CRAP. If roommate is actually ok with this, and if they truly did leave a complete stranger to you alone in your place, then that roommate would no longer be someone I would feel safe having in my life. This is insane.", "NTA, and your room mate is a giant asshole. Who invites a random person to be in your house while you aren't there and forget to tell your room mate at all. Literally absolute bare minimum here is to introduce to room mate and ask if it's okay (without the person there at the time you ask) and make it comfortable and have some trust before the situation.\n\nThen this guy is weird as fuck for being there with someone he doesn't know having not been explained to you, then saying he'll stay for a bit before suddenly he's staying the night?\n\nLook for a new room mate, or someone to sub let your place asap.", "Nta and I would have immediately called the police if there was a stranger in my house when I got home", "You don’t have to be nice to everyone and not cause trouble so you don’t appear like a ‘drama queen’.\n\nThis bulls**t has been fed to little girls for far too long. Seem weird/rude/mean if you are uncomfortable. Own jt, because your safety is way more important than being ‘nice’. Next time ask him to leave immediately. NTA.", "Oh hell no, NTA.\n\nThat is a serious breach of trust and disrespectful behavior by your roommate\n\n You DON'T invite a random stranger to the house without alerting others, and definitely not if she wasn't there.\n\nYou absolutely have the right to be safe in your own home.", "NTA at all! You did the right thing better safe than sorry!!", "NTA. Depending on what state you live in, your roommate could have gotten the stranger killed due to self defense laws.\n\nAlso, the dude was incrementally asking for more and more. Never trust someone like that.", "Nta\n\nIf he was your roommates guest, he should not have been there if *they* weren't.", "NTA. Who does that to a roommate? \nI left and called the police to remove him.", "There was only one stranger so he’ll not they’ll", "I think you need to tell your roommate that she can’t have anyone staying over without her being there and without your prior approval. If she is a boundary-stomper, let her know that from now on, you will call the police if you find anyone in your home you don’t know and haven’t been informed about. \nTell her and then be prepared to follow through with this. She won’t be popular with her friends for long if she decides to pull these stunts. \n\nIf I were you I would also go to a women only self defence class, maybe do several of them. In my opinion it’s not so much about the physical aspect of them but actually being told that you are allowed to use the word ‘NO’ and to stand your ground with people who don’t respect your boundaries. This is a skill that can be learned.", "Change the code or call the building manager/whoever to change it for you saying you had a strange man in your apartment and you have no confirmation at all that your room mate knew them.\n\nThis could be someone who was there to say attack your room mate and copied down the pin or something. Even if he was there 'with' permission of your room mate they crossed a massive boundary and compromised your safety. Make sure your place is secure, when they get back they can call building manager or you to get code if you aren't in.", "Seriously, if your roommate is letting people stay in the house with no prior agreement that it's okay and without even bothering to give you the tiniest heads-up text to let you know what you're walking into, then your roommate does not concern herself with your safety or comfort in the slightest. I'm a bigger guy and this would be a once and done event for me, I would be using this as an excuse to break the lease and leave today. NTA.", "While this is a great article and all, I’ve never heard this thing where women have been told to downplay anything and if they have its by men and who cares what they think? \n\nIts like what OP did here, I think women and men don’t trust their instincts but women especially since unfortunately they will be the ones 3* to be attacked or attempted attacks. \n\nOP, call the police first and ask questions later. You literally had no idea who this man was. And when he was still there, you should’ve just called the police, don’t confront him or tell him, just do it. \n\nYour roommate is an idiot savant. You don’t do this to people. Especially a woman.", "\"You've never heard this thing where women are told to downplay anything\"!?!?! I can't even finish reading this comment because **seriously**??", "This incident was 100% inappropriate for any housing situation.  Guests should not be allowed over if their host is not present!  It's also exceedingly rude to try to force you to be responsible for their guest.\n\nYou would not be wrong to contact the landlord to report it.  This incident may even blatantly violate the terms of your lease, especially if she gave a stranger a key!", "NTA. Check out the Gift of Fear by Gavin de Becker. Trust your gut. Say no and stand firm. Glad you are safe. You and your roommate have some talking to do.", "NTA.\n\nYour roommate is insane and a massive idiot to leave a strange man behind in your apartment. I would have kicked him out immediately, after grabbing the closest sharp knife. \n\nYou could not possibly have expressed this boundary earlier because the situation was unimaginable. \n\n*\"Oh, and by the way, house rule number one: Don't leave me alone with possible homicidal men.\"*", "I think you should find a new roommate.  That was way out of line on her part and put you in serious danger.  Let me emphasize, this is not a minor thing, it’s a major boundary violation on her and his part and you shouldn’t feel guilty about it in the slightest.  You should have never been put in that position", "NTA. This is completely unacceptable.  Let your roommate know she is NEVER to allow people in the apt when she’s not there.", "I am so sorry you are going through this OP = please don't second guess your instincts. If there is a stranger who is known only to your roommate and the roommate is not there and didn't tell you he was going to be there....? That's damn dangerous. Calling the police (not my favorite option) would be totally justified. NTA but your roommate big AH", "NTA dont even for a second question this decision, I wouldnt have let him even stay to eat! My brain was screaming no the second there was a stranger in your apartment and you didnt get a phone call about it let alone a prior text, and multiple with a whole conversation explaining who is going to be in your place. Yikes,", "NTA and since I live in the US, there is a good chance I would have shot him. I would have absolutely called the police and fuck your friend for not telling you he was gonna be there. I would have let 5-0 come and sort out why the man is in my home. I can’t believe you even asked him why he was there instead of immediately seeking safety and calling the police. Jesus, go take a self defense class if your plan is to just have conversations with stranger who potentially broke into your home, that way you have a chance of fighting them off when they attack you. Edited for clarification.", "Nope nope nope. Your roommate is the complete asshole here. Even if she was THERE she would be an asshole, let alone not being there with a fucking strange man. Nope NTA. You were nicer about it than most.", "Not an asshole. Roomate should have discussed this with you, at the very least, give you a heads up.", "NTA. How did he get in? Does he have a key?\n\nThe rule one I had roommates was always that you would accompany any guests unless everyone agreed that the person could be there without the actual roommate.", "Nta, that’s violating what’s suppose to be your safe space. If your roommate disagrees, then ask her, “If I bring a stranger home, didn’t tell you, left him there to do as he pleases while I’m gone. It’d be okay?” The man could be a thief, a predator or a serial killer for all we know.", "Nta", "NTA your room mate should have told you in person someone was coming and allowed you to meet them if that man was staying the night. Coming home to a stranger would have freaked anyone out !", "I’m confused about what he was doing and what he was planning to do. It seems like he had other places that he could be but decided your place was a good spot to be.", "NTA. If your roommate wasn't going to be there, they should have asked if it was OK for their guest to stay unaccompanied.", "NTA. \n\nYou should have sent him out immediately. You didn’t have any confirmation about who he was, you could have been robbed, raped, assaulted, or killed.", "If your roommate is out of town, how did he get in? Did she give him a key?!?", "NTA. You should have immediately called your roommate and asked wtf.", "NTA. I wouldn't be comfortable with a stranger in my house showing up unannounced either.", "NTA - you lucked out this time but holy crap! I get it because I hate confrontation too. But get some assertiveness training. This cannot happen again.", "NTA. If you were uncomfortable, THAT'S what matters. Especially in your safe space. I wouldn't let a strange man sleep in my apartment if I was there alone. You come first. Your comfort and safety, (especially in your own home) comes first. I know being assertive is difficult, but don't be afraid to stand up for yourself. I wish you very good luck, OP. You never should have been put in that situation to begin with.", "NTA. Your home and your safety. Perfectly reasonable response by you.", "NTA\n\nrape happened with far less.", "Call Police at 9PM.", "NTA\nYou would be well within your rights to kick him out instantly even if you knew him and he hadn’t tried to stay the night. Even with the best intentions, that’s a major breach of boundaries. The fact that he told you he was about to leave, stayed for HOURS, and then tried to tell you he was staying the night, is incredibly creepy and you were right to not trust him.", "**NTA**\n\nThere’s a time to be nice and polite. There are people who deserve the benefit of the doubt. Some strange dude in your place without your prior knowledge or consent does not deserve anything other than you getting out and calling the police.", "NTA Get a new roommate", "Hell no. You are NTA OP. This screams red flags everywhere, and you need to consider getting a new roommate if at all possible. Who the hell does that to a roommate? Is she mental?", "NTA. It is inappropriate for a roommate to be inviting people over when they are not present themselves. Male, female, that’s unimportant. This is a common sense thing, you don’t need to justify this with any of the other details. The fact that you’re having such strong feelings afterwards suggests that you struggle with unhealthy boundaries. I suggest seeing a qualified mental health professional to talk about this, you are in the right and should feel good about making decisions which keep you safe.\n\nEdit: autocorrect bad", "Negative 10/10 - very NTA. I don't care who you are... some rando stranger in my place would be booted no questions asked. You just don't know who these people are and what they are capable of.", "They = stranger & roommate", "You need a New roommate . NTA", "If it happens again, don't even talk to the stranger. Exit your home, call the police, alert a neighbor. Honestly, you have/had no idea who this person was, he could have been lying about everything. Be safe, don't end up as victim #5 in a serial killer documentary ffs.\n\n\nAnd please, if he was telling the truth, chew your roommate out. Hard.", "OP your mistake wasn't waiting for a few hours to ask him to leave, your mistake was not asking him to leave as soon as you saw this stranger in your house regardless of whether your roommate gave him permission or not. She's not there and you are, she doesn't have the right to set your boundaries on your behalf. Don't be apologetic to her or she'll walk all over you, engaging in these kinds of social respectability politics gets women killed.", "Time to put your foot down. This is unacceptable. Warn your roommate that the next time you will call 911. I had my heart in my throat reading your post. He stayed till past midnight????? \n\nYour safety first. Your (censured) of a roommate feelings second.", "Would a serial killer have a ready response? Absolutely. You need to trust your initial reaction. Please work on standing up for yourself.", "OP, listen to me and repeat it to yourself again and again if necessary:\n\nNo portion of this was your fault. YOU are not a loser in the slightest. Your fear of men likely comes from a very genuine place/experience. Just because you didn't get every single reaction correctly in this instance doesn't mean you're a failure; on the contrary, as you pushed for what you needed to feel safe even though it went completely against your self-protective instinct to avoid confrontation. **This dude** is the creep loser who needs to learn how to behave.", "Roommate was completely selfish, when they left, guest should also have left. \nThey were oblivious to respecting your agreement. Just aweful. \nI would definitely consider moving.\nAlso it means, you cannot leave any of your valuables lying around in any common areas.\nGet a lock for your room. Camera for room if need be, when your out.\nStart packing.", "Next time call the cops directly . \n\nMight teach your roommate to not let anyone unknown in the apartment if her plans are screwdvandvher friends are angry with her.\n\n The most important thing calling the cops will do : protect YOU  if this is a lie.", "Complain to the landlord so he throws HER out not you.", "I would throw him out immediately", "Also, most people violated by someone are violated by someone they know and trusted. Stranger danger is real and a threat but the real danger is people we know and trust violating that trust.", "NTA. I have no issues with men and have some experience wich makes me believe that my chances to protect muself aren't too low, bur I would make him leave at once if I were in such situation.", "I’m not sure what the conflict is? Letting strangers into the house when they are not there is utterly inappropriate. This is unfair to you (and the person who you *rightfully* asked to leave), and potentially dangerous.", "This is very black and white, what she did is incredibly not OK. If I were you I would already be planning to get her out regardless of what she says.", "Have you actually spoken to or texted with the roommate to confirm the guy’s story? What has she said by way of explanation? NTA. She put you in a very vulnerable spot.", "Op inform the landlord . I doubt he/she would be thrilled to know unknown people are in the apartment or possibly have the code. The landlord can set a really hard boundary for your roommate", "Hahahahahahahaha you've never heard of women being told to downplay? You are either a unicorn or a man.", "The downplaying thing usually comes from people who are in their immediate circles, so close friends, relationships, family, and while yes, it's especially men, it can also be women. Women who are complicit because the institutions (colleges, first responders, law, etc.) are bred with rape culture and teach women and men to look the other way or silence the person in front of them.", "Why is roommate an idiot savant? Saying an idiot is one thing, but I don’t see why savant or linking it to autism was needed.", "I totally agree with your comment tho, btw. Just wanted to clarify on your first statement.", "Wow!", "Well I know it definitely has happened at Universities, they totally quash it, thank you for your response. That I know is definitely true. 👍", "I didn’t mean it literally, just that she was beyond idiotic to do this to her roommate, I meant no offense. Or comparison actually.", "Moving would be a pain. But how safe do you feel with your roommate, given what's just happened? And there have been other incidents? How much is your peace of mind worth to you? Because she's shown you she can't be trusted to take your safety into consideration, and to me that's all kinds of deal-breaker.", "Your roommate doesn't like you or respect you and your safety if she's letting people into your shared home without any heads up or okay from you. I lived in a similar situation for less than 3 weeks and ended up fleeing after she gave a sketchy dude a key and he threatened me. The police won't help you if you call because these people have permission from at least one tenant of the property, so if it somehow manages to escalate further, your only option is to leave.\n\nStart saving and prepping now, and if possible, look for housing in a bit more rural of an area. It tends to be cheaper than cities and therefore easier to afford. I pay around $100 more for my current 2br place than I did sharing a 2br in a city. I live in a HCOL state and my first place I found after the move was a $700/mo studio with utilities included. There's not as much to do but it's safer than living with someone who would turn you into an episode of Dateline without a second thought.", "I understand, BUT that doesn’t mean you have to tolerate this.  I get the whole fear of confrontation/people pleasing thing, absolutely, but you are ignoring your gut feeling and letting other people cross your boundaries.  That is a very bad idea, because it puts you in situations like this where you feel bad/guilty for having basic rights, ignore your own discomfort, and end up in potential danger.\n\nYou have the right to feel safe in your own home.  Just keep repeating that.  Your roommate is absolutely out of order.  When she comes back, you are going to have to put your big girl pants on and say “That was completely unacceptable and must NOT happen again.  If it does, I will call the Police immediately and report an intruder.”\n\nDo not get drawn into a debate about it.  You are absolutely NTA.", "Ok, just so you know, that’s a derogatory term."]}