{"id": 18475, "submission_id": "13v2it6", "title": "AITA for telling my son to suck it up and deal with seeing his bullies twin", "selftext": "My son, Alex, was bullied in middle school, he was the shy nerdy kid that was a pretty easy target for people. One of his bullies was a kid named Ryan, and he had a twin name, Rebecca. Ryan was a pain in the ass for basically everyone in the school. When high school came around most people chose the private high school or the public one and people split up. Ryan went to the public school while my son went to the private one.\n\nMy older son went to the public one also, I let them choose which one. He is a junior while my youngest is a sophomore. Ever since Alex went to high school he really came out of his shell and the bullying completely stopped. The new school really helped. My oldest started to date Rebecca and she is a nice girl.\n\nThe problem is Alex refuses to go anywhere is Rebecca will be there. It came to a head today when we were going to the picnic and Rebecca was invited. The moment Alex heard he refused to get in the car. I finally had enough and told him basically suck it up and deal with seeing Rebecca. That she is not Ryan and that he has confirmed that she never did anything. We argued and I left him at home for the picnic. My wife thinks I am being too harsh, but I think it is ridiculous for him to refuse to be near someone that didn't do anything wrong and is only related to Ryan\n\nEd; We have talked to him about it, multiple conversation with me and my wife. He was in therapy and stopped of his own free will. At this point all he is doing is damaging his relationship with his brother. Can't bring Rebecca to the house, can't be around her at all when she has done nothing wrong. Even a picnic which had a ton of people at. The oldest kids birthday is coming up at this point if he invites his gf well then is brother won't be there. It is ridiculous\n\nEd2: Looking at all the responses, Alex is going back to therapy if he wants to or not, so that will be a conversation I know will not go well. I will let him pick to go back to his old one or find a new one. ", "created_utc": 1685384783, "permalink": "/r/AmItheAsshole/comments/13v2it6/aita_for_telling_my_son_to_suck_it_up_and_deal/", "score": 1916, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > AITA for telling Alex to basically suck it up and deal with seeing his bullies twin. I think it is redluouls to avoid someone that didn't do anything even though she is related to his bully. I may be an ass for being too harsh on Alex\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Something is going on. Some information is missing in this situation. Alex isn't telling you something.", "I feel like something's missing here.", "This is hard. I feel like more conversation and therapy has to be had. I would personally look at is as a win for your son her could always tell Ryan “ha my brother banged your sister” but for realz therapy…. And no one is the AH.", "Sounds like he needs therapy", "NTA. This does sound like something deeper is going on within your son’s life to have him so up in arms about this but ultimately you are right, Rebecca does not deserve to be punished by your son for her brother’s behavior. It might be worth trying to have an actual conversation with your son about it rather than just trying to tell him to knock it off. Some insight may help you to navigate getting over it.", "YTA - You should be helping your son deal with this unresolved trauma he clearly has, not just telling him to get over it. Don't be surprised if he is reluctant to open up to you in the future.\n\nI also feel like Ryan may have been more than \"a pain in the ass\".\n\n&#x200B;\n\nETA because I'm tired of the replies: No. I don't think his behavior is good or acceptable. I think OP went about dealing with it completely wrong, that is after all what the post is asking.", "I N F O How serious was the bullying?  \nEdit: YTA", "He's not telling you something here.", "INFO: Has Alex received counseling for the PTSD from the bullying? If so, how often and for how long?", "**NTA/quasi ESH although you should have been more gentle when telling him that he needed to move past it.** \n\n**This is reddit, so people are going to call you YTA because any behavior is justified by many of their standards once one has been bullied.** \n\nAnd bullying is traumatic, don't get me wrong. But your son has had years of therapy at this point for verbal bullying, and Rebecca has done nothing to him. She is not guilty of her brother's sins, this is not Game of Thrones where one's family carries the sins of their other family members. \n\nNot only that, this is not fair to your other son.", "NTA- you’re absolutely right.  I don’t care how many YTA you’re seeing.  This person did nothing to him and it’s not acceptable for him to act hateful to her.", "NTA.\n\nYour son is behaving ridiculously. Rebecca has done nothing to your son, and her mere presence doesn't warrant a teenage temper tantrum. \n\nYour son refused to go, so he stayed home. He got what he wanted.", "NTA long and short of it is that Rebecca is not her brother. Full stop.", "I feel like we are missing info here. I know your son willingly left therapy but maybe suggest he return. To be this adamant about not seeing Rebecca even though \"she didn't do anything\" is very odd. \n\nNot sure I can make a judgement based on the info provided. ESH ?", "... So your child have unresolved childhood trauma. And your solution to it is to tell him to \"suck it up\" ?!?\n\nYTA. Your son is struggling with a situation and you are invalidating his feelings. Have you tried maybe... talking to him about his trauma and try to understand how you could help him, instead of bullying him into accepting a situation he is not comfortable with ?!", "worst part of this is how OP makes it sound like the kid DESERVED to be bullied.\n\nPoor kid, clearly still traumatized by it. Hop he resumes therapy since he needs it.", "YTA\n\nTelling a child with unresolved trauma to \"suck it up\" is peak toxic masculinity.\n\nYour children deserve better than you are currently giving them. Do better.", "YTA. You're right of course, that logically he shouldn't be upset at Rebecca, but children do not think logically.  All he sees is that you're taking the bully's side and don't care about his feelings\n\nIt's pretty rare for a parent to tell their kid \"suck it up\" and be in the right. Kids have feelings and implying that their feelings are invalid or stupid is condescending and leads to a relationship of distrust", "ESH.\n\nTelling a kid with PTSD to suck it up is absolutely not the way to go. He needs to go back to therapy if this is the way he's going to act.", "YTA. Do you think he’s avoiding Rebecca to annoy you? Why not do some actual, you know, *parenting* and try to find out why it bothers him so much to see her?", "Sorry but I’m sort of leaning towards YTA, just a bit. Emotional responses exist. Seeing the twin of boy who bullied your son will trigger that (FOF) response. Its normal.\n\nAlso, has it ever knocked your mind that wherever Rebecca is, Ryan might be too?", "I’m going to say ESH. \n\nHe’s clearly still traumatized, but you’re right that it isn’t fair to hold that against Rebecca. I had a bully who made my life HELL, to this day my blood boils when I even think of him, but I’m friends with his sister who’s one of the coolest people I’ve ever met. \n\nAs much as I DO believe he needed a “wake up” statement regarding his treatment of Rebecca, it’s also important to help people face their traumas/fears in a healthy way. \n\nIs he afraid she’s like him or is it solely just the reminder of him? If his brother ends up wanting to marry her someday, what does Alex plan to do then? \n\nIs his issue possibly feeling betrayed by his brother for dating his tormentor’s twin? Does he feel the acceptance of Rebecca by everyone else is discrediting the trauma he endured at her brother’s hand?", "YTA \n\nPTSD is real. Your son has it and forcing him to be around Rebecca only reminds him of her twin brother. \n\nIt doesn't matter that she wasn't the person who bullied your son. She's the sister of the bully and that's enough to make your son uncomfortable and relive everything that happened. \n\nPlease educate yourself and if your hasn't been in counseling/therapy for everything happened to him with the resulting PTSD, then he should.", "If we called bullying what it really is instead of using childish language you wouldn’t find it so hard to understand his reactions and the trauma he clearly still has. Bullying is a cutesy word for abuse. Ryan wasn’t a bully, he was an abuser, who abused your child and your child is still suffering because of it. YTA", "I will say YTA . Because just confirming Rebecca did not bully him is not enough for you to ask your son to \"suck it up\". He might have other issues. Do talk to him - it might have caused a deeper psychological trauma. Rebecca might be a reminder for the terrible terms of his life.  Check with him. Take him to a therapist. Do the right thing. If you do this, he will learn to cope with it better.", "NTA. It’s unreasonable for him to refuse to be around someone just because they’re related to someone he had a bad experience with.", "YTA. \n\nJust merely for saying 'suck it up'. \n\nBullying can cause more trauma than you realize. \n\nThanks to comments like yours people will internalize these traumas and think they are over-exaggerating, which will cause them to minimalize future traumas.", "YTA\n\nOf all the girls, his brother had to date his tormentor’s sister. He is finally feeling good about himself. His family wants him to “get over” it to the benefit of the kid who chose to date his bully’s TWIN SISTER!", "Your description makes it seem like you think the bullying was deserved or at the very least expected. YTA", "Has Rebecca ever acknowledged Ryan's bullying of your son and admitted that her brother caused him trauma and harm? \n\nBecause if she is going around thinking the world of her brother, I can definitely see how your son doesn't want to be around her. \n\nYTA for how you worded things to your son. Try see it from his perspective. Bullying leaves DEEP scars.", "YTA. Seems like it is bad parent day in this sub. I just commented on another post with a bad parent.\n\nTelling someone to \"Suck it up\" is NEVER the answer to anything. It is the height of lazy parent crap. \n\nIn the moment when your kid was upset why not forget the picnic and go sit down and TALK to your kid. Not at your kid. Listen to him. What is he feeling that makes him uncomfortable around Rebecca? Then LISTEN.\n\nYou may feel that you want to teach your kid to not let this kind of thing rule his life but instead of bad advice like \"Suck it up\" you could explain that allowing negative emotions to rule his decisions only feeds them and will make him feel worse in the long run. It is much better to attempt to deal with the situation in a healthy manner. Explain that you would really like him to go and that you will be there for support the entire time. If it is too tough then you can leave early. Something like that achieves the same goal but is much healthier and empathetic than \"Suck it up\".", "YTA god would it kill you to actually talk to your kid? Go back to therapy, individual and family.", "YTA.. telling someone to suck it up when they're in pain is a dick move...  \n\nWhy don't you find out if it's because Rebecca looks so much like Ryan that it's bothering him too much.", "YTA. Twin. Yep. You know what that tells me? She looks enough like her brother that y our son sees his tormentor with a feminine visage. The fact that he doesn't even want to be around her? Even if she didn't bully him, I wonder if she was a bystander who may have passively enabled the bullying.", "YTA. Not just for the situation, but there’s just something about the way you talk about how your son was bullied that feels shitty to me. You’re awfully casual and a little callous (esp in comments) about this happening to him. \n\nRebecca may not have done anything to him but did she condone her brother’s behavior? Did she ever condemn it? Tbh, unless she spoke out against the bullying at some point, even now, I’m kind of side-eyeing your older son for dating her.", "YTA, \nHe must have a valid reason for not wanting to see Rebecca either. Further emotional and mental abuse can far outlast physical abuse.", "A very soft YTA - I understand your train of thought but there has to be more to your son’s story for this to make sense to them; is it because of appearances and just the similarities that are triggering? Is it because although Ryan did the bullying, maybe Rebecca stood on the sides and watched their twin instead of stepping in? Is it because your son is going through a list of “what ifs” and is “protesting” the relationship to avoid having any future interactions with Ryan? Is it more than one of these or none at all? You need to have a calm, open, and honest conversation with your son and allow them to provide more context without fear of judgment - so avoid telling them to suck it up or that their feelings don’t make sense.", "NTA. He's transferring the feelings for his bully to someone who didn't have anything to do with it. He needs to treat Rebecca as her own person.", "What a bad parent you are. Downplaying your son trauma like that . It’s not as simple as it look. You should feel ashamed. YTA", "YTA. Your son associates her with the bullying since it was her brother who was the bully. I think it is safe to assume that she knew what her brother was doing and chose not to do anything so she contributed to it a little bit. This should be taken a little more seriously and you seem to be brushing it off. You should try to respect your son's wishes, if you force him to be around her, he will only resent you.", "INFO you say in one of the comments speaking of Ryan \"she said\", so ryan and rebecca are twin sisters, identical perhaps.\n So your son should face the identical replica of his tormentor? If this is the case, you have knowingly hidden an extremely important fact allowing to better understand your son's behavior.", "Light YTA: I agree with you. This situation cannot go on, and it is a little over the top for your son to refuse to interact with Rebecca when Rebecca did nothing wrong (atleast as far as we know). However, I don’t think telling him to suck it up when he clearly still has some residual PTSD from the bullying is the correct way to go about this. \n \n\nI think you and your wife need to have a frank conversation with him about what the issue is with Rebecca. Is it that Rebecca looks like Ryan? Is it that she didn’t do anything to stop Ryan and Alex feels she could have? Is Alex worried about her (intentionally or inadvertently) giving Ryan information about him that he could use to attack him? Did she do something to Alex that just never previously came up? \n\nYou won’t know the answer to that question until you have that conversation with him. Once you have that knowledge, you and your wife, with Alex’s input can figure out what to do next. It also might not be a bad idea to have a separate conversation with your wife, your oldest, and Rebecca about what’s going on. If it’s that he felt she failed to prevent Ryan from bullying the “nerds” maybe a simple, but sincere apology will go a long ways? Maybe instead of forcing him to see Rebecca, you see if she’d be prepared to a video call or even a phone call with your younger son before you make him see her face to face?", "He needs to go back to therapy. Soft YTA because yelling at him to suck it up isn't helpful at all. He clearly hasn't fully moved past the trauma from bullying or there's more here he's not telling.", "NTA, sometimes in life I have to tell my kids to grow up a little. Life isn’t always fair. In this scenario he has been in treatment for the bullying. He does not have to interact with the bully. Unless there’s a reason missing, he can go to a picnic and be polite to his brother and Rebecca.", "NTA\n\nHis brother has a right to have a girlfriend and bring her around. He's not dating Ryan. He either needs to agree to go back to therapy to deal with his issues and learn how to be civil to her or he needs to suck it up. It's not fair to her or his brother. \n\nAll the Y T A's in this sub would be in the other camp if the brother came on here and said his brother was treating his girlfriend like shit and making the whole family rearrange plans so he didn't have to look at her because her brother bullied him years ago even though she had nothing to do with it.", "One of my bullies was brother to a girl in my class, I some how knew she was innocent in all this so I'm gonna give you NTA based on this story. Sometimes sadly you need to buck up, it freaking sucks so much.", "NTA. But asking the room full of losers on reddit about anything involving bullying or \"sucking it up\" isn't going to get you anywhere.", "I knew just from reading the title that you were his father and not his mother. YTA. They don't call it \"toxic masculinity\" for nothing. \"Suck it up\"? Really. I doubt you could have stood up to that at his age. For the love of all that is reasonable, he is your SON!", "YTA why do you think your son is doing this?  You need to tell him that Rebecca is invited and it’s his decision to join but you shouldn’t be forcing him to go if he doesn’t want to. You should ask more questions and try sitting down with him to talk it out, or start up therapy again and join. It seems like your just throwing up your hands and think he is being over dramatic.", "Your son is clearly traumatized and Rebecca triggers him due to being twins with someone who severely bullied him during his formative years. He does need to learn to see Rebecca, but that requires THERAPY. You're the adult. You need to take him back to therapy and provide him with some coping skills for seeing Rebecca. Exposure therapy is helpful in the right circumstances. Make sure to hang out in places where he can get away easily/have a break from his trigger. Rebecca may or may not be a long term part of Alex's life, but YOU need to support him, not tell him to \"suck it up.\" \n\nBeing a shy, nerdy kid doesn't mean that your son deserved to be bullied. The fact that you made this comment is sad and telling. \n\nYTA", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy son, Alex, was bullied in middle school, he was the shy nerdy kid that was a pretty easy target for people. One of his bullies was a kid named Ryan, and he had a twin name, Rebecca. Ryan was a pain in the ass for basically everyone in the school. When high school came around most people chose the private high school or the public one and people split up. Ryan went to the public school while my son went to the private one.\n\nMy older son went to the public one also, I let them choose which one. He is a junior while my youngest is a sophomore. Ever since Alex went to high school he really came out of his shell and the bullying completely stopped. The new school really helped. My oldest started to date Rebecca and she is a nice girl. \n\nThe problem is Alex refuses to go anywhere is Rebecca will be there. It came to a head today when we were going to the picnic and Rebecca was invited. The moment Alex heard he refused to get in the car. I finally had enough and told him basically suck it up and deal with seeing Rebecca. That she is not Ryan and that he has confirmed that she never did anything. We argued and I left him at home for the picnic. My wife thinks I am being too harsh, but I think it is ridiculous for him to refuse to be near someone that didn't do anything wrong and is only related to Ryan\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NAH. The kid should get back to therapy, the fact that he's so triggered by the sister if worrying, I imagine he's imagine is the relationship continues he will have to deal with the brother in the future and he's triggered by that.", "I’m not gonna give judgment, and i know y’all hate bullies on here, but uhm… Rebecca isn’t the one who bullied him?? He’s rejecting her simply because he knows whose sister she is, not because she bullied him herself. Do I think he needs therapy? Yes. Do I think Rebecca should be punished for what her brother did? Nope.", "[removed]", "YTA. Just be honest and tell us our son the truth - his feelings are utterly important to you, and you wouldn't care if he got bullied daily for life because his feelings are utterly irrelevant and just a nuisance to you. He should know where he stands.", "Please, get the *whole family* into counseling *now*.\n\nSomething seriously seems to be missing, but there's hints of favoritism for the brother with the girlfriend vs the bullied brother told to just sick it up because the bullying was \"only verbal\".\n\nI wonder if this dynamic of favoritism is at the base of this ... with one brother always being brushed off as his concerns/needs don't matter plus how great his sibling is doing.", "NTA. Your son made the choice to stop therapy. He needs to deal with his trauma in a healthy way. He needs to go back into therapy or he’s ruining his own relationship and life", "ESH. The suck it up comment makes you an asshole, but Alex shouldn’t be punishing Rebecca for existing as his brother‘a girlfriend. Honestly, talk to your son and issue an ultimatum. Go to therapy or just don’t go to events anymore and be ok with that. Alex may very well go NC or LC with all of you in the end regardless of what you do because he does, indeed, hate Rebecca and thinks treating her like she’s her twin is perfectly fine and normal. Unfortunately, Alex is indirectly bullying Rebecca and his own brother by trying to isolate her from being a part of the family.", "NTA. I had a bully at school that made my life absolute hell. My younger sister was best friends with her younger sister. I didn't really want to have anything to do with her, because of her sister, but I had to drive her & my sister somewhere one night. I got to know the sister & she was so awesome, I couldn't believe she was related to my bully. She still is best friends with my sister, but even back then, I wouldn't have demanded my sister not be friends with her anymore.", "INFO.  How strong of a resemblance does Rebecca have to Ryan?  Might be a trigger.  Something is not right here.", "NTA.\n\nYour son is probably better equipped than most to deal with this after his therapy, and he is refusing to deal with it.\n\nDon’t be surprised if it comes out that he likes Rebecca, and also that this is the reason the bullying started.", "YTA.  I agree with the earlier comments.", "ESH. Your son's behavior is unacceptable, creating issues with a girl just because of her brother. That being said, you're not handling this situation properly. This situation has triggered your son's past trauma and he needs help processing that, while at the same time being assertive that Rebecca isn't to be treated like a pariah for something her brother did. You could also reach a compromise with Rebecca that her brother and your son shouldn't be in the same place - which shouldn't be hard to do.", "YTA. Sounds like ryan was more than a bully. He doesn't want to deal with him or anyone that relates to him. That includes rebecca. You need to deal with that fact and stop pushing it on him. Or in your words \"suck it up\".", "YTA, for the execution of your actions, not for the thought behind them because it's true he needs to get over it, however, it's not up to you to force him do so, you, as a parent, help your kid navigate his feelings, his needs, and that requires you to be mature and stable, you're obviously not, that's fine, we're humans, not robots, but you must put their needs first and think about this with calm, don't let your feelings drive you, because then you are just an hypocrite demanding of your son what you yourself can't achieve.", "NTA. If it were Ryan, YTA, but Rebecca’s never done anything so, yeah, Alex can suck it up.", "Are you forgetting op is a parent? Parents can't allow themselves so be so obtuse and dismiss the trauma and feelings of their kids, while it's true she doesn't deserve to be seen as her brother, op's kid comes as a priority, resuming therapy is a way.", "Rebecca wasn't the bully. She has no guilt in her brothers behavior\n OPs son needs to get back into therapy. NTA", "This. YTA. Also it is clear from your comment that you see your son as a weakling… Which also must be really hurtful to him.", "[deleted]", "Verbal, nothing physical. It was a pain to prove stuff against Ryan for the school since it usually turned into she said he said situation", "Yes, in middle school and then a freshamn year. I was beginning once a week and then as time went on became less frequent. He is the one that stopped wanting to go when he was at the new school since he didn't think he needed it anymore.", "This is giving me major flash backs to when my sixth grade history teacher didn’t like me when she had me in third period because she had my brother in first period and he was catching up with his friends on the first day of school. We, like Ryan and Rebecca from this story, are fraternal boy-girl twins. We’re nothing like each other, not in terms of personality or interests or anything. We don’t even look like each other unless you see us next to each other and then we just look like siblings. I would be pissed (and was in sixth grade with our history teacher) if someone decided that because my brother did something they hate my guts or are going to treat me as less than. Because it’s absurd. \n\nI could maybe understand if they were identical, but they’re not. Looking at Rebecca is not looking into the face of the guy who bullied him.", "He's not being hateful though. He doesn't want to be around her because she (presumably) reminds him of his bully whom he is clearly traumatized by.", "*Tell me you don't understand trauma without telling me you don't understand trauma*", "[removed]", "He refused to go, that doesn't sound like a temper tantrum.", "Allowing him to bully Rebecca by making her feel unwelcome in her boyfriend's home, embarrassing her and putting a strain on her relationship with his brother is not the answer. She did nothing to him and his behaviour must be unpleasant for her. They've talked about it multiple times and he decided to stop going to therapy so what else can they do? He's the one being an AH not Rebecca. Past trauma is not an excuse for treating people badly.", "Kind of disagree. The kid is not handling this normally. Bullying is terrible, but verbal bullying, after years of therapy, should not interfere with this kid's life so much he refuses to be even around Rebecca (whom he admits had nothing to do with her brother's behavior). This is not Game of Thrones, Rebecca is not responsible for the sins of her family. \n\nOP handled this badly, but I can understand why he's frustrated if his son has had years of therapy and this is how he is reacting...especially if it's impacting his relationship with his older brother.", "They've talked multiple times and he was in therapy which he decided to quit. Telling him to suck it up wasn't his first response, he did better and his son continued to treat this girl badly for no reason.", "Maybe it's the realization that if things remain serious between the brother and the twin, that he will be forced to interact with his tormentor for the rest of his life. Instead, he is creating a clear boundary (the healthiness of which is debatable) in order to ensure that he won't be an easy target in the family for the rest of his life, judging by the suck it up comment, I could see the family being chummy with the tormentor just to screw with the son.", "It sounds like OP/his wife did put Alex in therapy. Alex chose to stop going. \n\nPTSD sucks. Believe me, I have it. It’s not an excuse to not work on your triggers. It actually DOES matter that Rebecca has done nothing wrong; she shouldn’t be isolated and shunned because she happens to have shared a uterus with a bully who probably honed his skills on her at home. \n\nPTSD is not a “get out of passing along your trauma free” card.", "Yeah, their son should just shut themselves away and never have to interact with anyone. Good call.", "Why? Why is it unreasonable? If I dont want to be I the same room as someone else, then I don't have to. Why force this poor kid to be around someone who makes him THIS uncomfortable?\n\nAll this \"what will he do if his boss bla blah\"\n\nHe will do what he WANTS. Don't like your boss? Quit. Don't like a coworker? Transfer. \n\nNobody would tell an adult to suck it up and hang out with someone against their will.  Why? Like what is so precious about this girl that OP wants to FORCE his fucked up son to be around her? \n\nOP, YTA. Pick your battles man. Jesus.", "Really makes you think doesn’t it? Like maybe parents should be questioning brother on why choice of girlfriend. Like where is this going to go? Going marry into family that sent brother into serious therapy? Brother suppose to keep “sucking it up” I guess. Wonderful supportive family…", "Fraternal twins don’t always even look alike no where in the post does it say they do", "From the post:\n\n>he has confirmed that she never did anything.", "Its a saying \" he said she said\"  It came from a song a while ago and is used often to describe when you have two people saying two different things", "Agree that therapy is the way. Alex, though, has to want to go for therapy to be effective.  Alex cut himself off from therapy when he actually needs it to sort through his unresolved trauma.", "This is why I said that they should have an actual conversation with their son instead of just telling him to get over it. I replied to this post before it was edited to say that he was in therapy, so I did not have any of that context.", "Except his son shouldn’t be forced to be around someone he’s uncomfortable with.", "No reason to assume that simply because she is Ryan's twin.", "Sometimes words can hurt more than physical harm. Emotion trauma is as relevant. I feel like when you bracket the bullying as \"verbal\", it appears to be in an attempt to trivialise the event.", "I can so vividly remember every vile thing said to me.\n\n\"K*** yourself.\" \"Do you feel high when you *** your own wrists?\" \"You're fat and ugly. What use are you?\" \"Dumbass.\" \"Idiot.\" \"No one likes you.\" \"Bet I could get away with b***ing you up.\" And so many more...\n\nI also vividly remember waking up in a hospital from a failed overdose. Because those words felt like knives and my parents were just as supportive as you.\n\nAnyway, I didn't go to my parents' funerals. Just keep that in mind. YTA.", "Well, sounds like he still needs it. Saying \"suck it up\" to someone who has been bullied isn't great. Does Rebecca resemble Ryan in anyway?", "Ah, then you need to get him back in, because he's obviously still suffering from PTSD. And YTA for trying to force him when he had such a visceral reaction.", "And that might have been fine if brother’s girlfriend didn’t bring it all back", "So what is he going to do if he has a boss in the future that looks or acts like his bully? Shut down and refuse to go to work? The mom is right", "It’s hateful to refuse to be in the room with someone who did you no wrong.  Also…trauma is getting thrown around way too freely.  He was verbally picked on.  Not every event in life that’s unpleasant is “trauma.”", "Tell me you don’t understand the necessity for basic coping skills in life without telling me you don’t understand the need for basic coping skills in life.", "I understand trauma just fine. I carry a great deal of it.\n\nOne piece is that I was viciously verbally abused by an aunt. Throughout my adult life, when I've seen a woman with short blond hair, I've immediately had a negative visceral reaction.\n\nWhen I realized this, instead of trying to ban short-haired blondes from the world, I began compensating for it. These other women have never harmed me, and it's not right to treat them as vicious because they somewhat resemble someone who is.\n\nNTA, OP. Your son shouldn't be allowed to shun his bully's sister for actions she did not perform.", "Are you 10 years old?", "He was throwing a temper tantrum. Bullying sucks but being bullied a few years ago doesn't excuse his behavior now.\n\nThis girl has done nothing to him.", "Honestly I feel bad for Rebekah. She's being treated badly and avoided because her brother is a little jerk.", "Sure, I get OP is upset. But the solution here is not to tell his kid to suck it up. He needs to talk with him, try to understand what is happening, and try to fix the situation. They both need to sit with Rebecca so they can have a talk and fix their relationship. \n\nTelling a kid that is struggling to \"suck it up\" is just toxic masculinity. The son is allowed to have feelings and he has the right to not want to be in a situation where he feel unsafe.", "But did you think that maybe the son realizes that if he has to interact with the twin, there's a good chance he will have to interact with his billy as well? Why bother?", "Yeah.   Not buying it.", "OK thanks, i am not native speaker and in my langage there the same meaning whithout the different pronouns, he said he said if the 2 are boys and he said, she said if there a boy and a girl", "This. He is old enough to make decisions for himself, even if they aren’t the best decisions for him. If he’s not going to work on himself by himself then things aren’t going to improve without some form of conversations with him.", "Irrelevant, you tried to justify a parent losing their calm and yell at their kid who needs help, that's not parenting.", "*sticks and stones may break my bones but words leave psychological wounds that will never heal*\n\n- fairly odd parents", "That's awful. I'm very sorry you had to go through that and I genuinely hope you are doing better now.", "Yeah, the YTAs in this thread are wild to me. Reddit can be irrational about bullying, though (and I feel like I have to preface this by saying bullying is terrible and traumatic, but even then reddit seems to think any sort of reaction is a justification after being bullied). \n\nOP handled it badly by saying 'suck it up,' but the kid has had years of therapy for verbal bullying. The kid also says Rebecca did nothing to him. \n\nThis is not some type of Game of Thrones situation where the sins of the family carry on to everyone. Rebecca is his older brother's girlfriend, and it's insane that the older brother can't even bring Rebecca over to the house. \n\nOnly thing the younger, formerly bullied son is doing is wrecking his relationship with his older brother.", "Then he could get another job? Transfer to another department?", "No. He should get therapy or help to work through the trauma so that does not happen. What do you think telling him to suck it up is gonna do?\n\nEDIT: I love how suggesting he get professional help is somehow an unpopular opinion.", "Obviously something more was going on than him being \"verbally picked on\" if he can't even be in the same room as her.", "Having your parent telling you to \"suck it up\" is not \"developping coping skill\". It's \"being taught toxic masculinity\".\n\nIf OP wants his son to develop coping skill, he needs to sit down with him and talk, and then figure out what is coping skills could be in this situation.", "Sorry unless OP describes a  literal screaming meltdown, or screaming match not a temper tantrum. Sounds like he just refused to go. He didn't prevent anyone else from going. It honestly sounds like he still needs therapy. I was wondering if she resembled the bully. That might be enough to trigger him. There is no time limit on trauma. As I said it sounds like he still needs therapy.", "I can't really blame the son though. Yeah Rebekah had nothing to do with it, but she is still related to the billy, maybe the son isn't jazzed about the idea of having to become family with his billy?", "Yeah, I agree that OP needs to sit down with his son. He definitely handled this poorly. \n\nHe has the right to not be in a situation where he feels unsafe, but the problem is his feeling unsafe is irrational and impacting his relationship with his brother (and unfairly dragging Rebecca). T*he kid absolutely needs more therapy ASAP imo, or to see a different therapist because their current one is clearly not helping that much.* \n\nI disagree with Rebecca. Rebecca is a high school junior...a 16/17 year old girl should not have to sit down and deal with OP's youngest sons trauma when she had nothing to do with said trauma except to be related to the bully. It's putting way, way too much on a teenage girl to ask her to have a sit down with the kid.", "Op says they have talked about it multiple times and he was in therapy until he decided to quit. He is absolutely allowed to have feelings but he is not allowed to treat someone else like cr*p.", "I’m a native speaker and the situation should be described as you stated.  I’ve never heard he said she said used universally for all sex combinations of the people involved.", "Are you okay? I literally never said any of that.", "Yep. Got a spouse I love and a professional rumble machine who sits on my bladder and screams at me. Things are okay.\n\n\nBut people like to downplay bullying to \"it's just words!\" Seeing parents be so... Cold to their kid because \"well they didn't HIT you.\" Makes my blood boil tbh.", "There are moments in life where no matter how much therapy you get, you gotta \"suck it up\" and face reality. Hell if he spent a day with her he'd probably discover she isn't anything like her twin. By avoiding it and letting fear take over he is making it far worse for himself.", "Lol ya so spend his entire life in avoidance? That sounds so much healthier /s", "The kid is in therapy!", "That’s how he describes it.  Not my description, his.", "Oh please.  Sometimes we actually do just have to deal with it.  Not everything needs a 14 step plan.", "If Alex was still actively in therapy? I’d be  much more sympathetic to him. \n\nHowever: \n\n1) he’s actively choosing to not deal with his traumas in therapy\n\n2) Rebecca did nothing wrong and can’t help who her twin is\n\n3) Alex is choosing a path that hurts not only Rebecca but his brother.", "The kid was in therapy for *years* over this. OP has had multiple conversations about this. At some point he really does just need to suck it up. \n\nWhat if he gets a job and his direct manager is a guy named Ryan? Is he just gonna quit?", "He was in therapy and chose to leave on his own. If you’re going to learn coping skills anywhere, that’s where it would be. OP can only do so much if his son doesn’t want to help himself.", "Exactly, life isnt ideal all the time sadly and he will be fine. I was bullied and put in my bullies friends class later (who did a little but not as much). I didnt like it but at the end of the day it was fine", "This. I have been through so much in my life and while therapy helps me talk through it, it is not magically fixing anything I’ve dealt with and takes a good bit of effort on my part.", "He was. He is not anymore. Also I wrote that comment before OPs edit.", ">Sometimes we actually do just have to deal with it\n\nSure... but they are different way to \"deal with it\" ?! Maybe there is a easier way for the teenage boy to deal with it. Maybe they could organize a quick chat between the son and Rebecca to talk. Maybe he could go back to therapy. Maybe he could talk with his brother so he can learn that Rebecca is a nice person.\n\n\"Suck it up\" is the last resort, not the first one. This is just lazy parenting.", "Alex is a just kid and he is not expected to be able to regulate his emotion like an adult would do. It's the parent job to help them navigate those things and show then proper coping mechanism and help them understand their emotions.", "And the parents would possibly be harming the kid (and their relationship) if they forced him to continue, especially at high school age. This is a no-win situation for them.", "Pretty sure they’ve talked about how Rebecca is a nice person.", "Yes but the parent cannot force their kid to go to therapy/talk through their issues if the kid refuses to.", "Well, they can still go to the other 38473847 ways they could solve the issue ¯\\\\\\_(ツ)\\_/¯", "Or maybe this kid is just wrong and being obstinate for the sake of it.", "Maybe. But how is OP supposed to know that if he doesn't talk with his kid and just right to \"suck it up\" without a proper conversation ?", "INFO: How does Rebecca feel about her brother and the bullying? I'm asking because maybe your youngest son is worried that Rebecca will go home and talk to her brother about him, and the thought of this makes it hard for him to feel safe around her.", "God damn. You're the fucking asshole. Your son is dealing with serious trauma. Obviously you don't take it seriously and you're allowing his triggers into what is supposed to be his safe space. \n\nIf he can't be safe and relaxed around family and at his home, wtf is he supposed to do?\n  \nYou assume the twin did nothing wrong, but realistically she was there and witnessed all the bullying and probably laughed along with it. Maybe he just doesn't like her. He's not stopping his brother from hanging out with her, he's just both participating.\n\nWhy the fuck are you more worried about your older sons dating life than your others mental health? In 2 years this relationship will probably be over, but your permanently damaging yours with your son. Do better.", "Hey, I really hope you see this\n\nI want to say E S H but you’re the adult and your son is a child. you aren’t communicating with your child effectively and YOU need a therapist who specializes in this stuff. \n\nyou’re the parent and you should be emotionally supporting your child instead of forcing and pressuring him to do things he doesn’t want to do. that’s because he has unresolved trauma and is fearful. \n\nI really think if you talk to your therapist about your relationship with your son they can guide you. I don’t think you should outsource your parenting to a therapist especially if your kid doesn’t want to go to therapy. respectfully, YTA", "a lot of people are going to say YTA because they’re projecting their own bullying experiences on your son and have not had their “suck it up” moment themselves. i’m gonna go with NTA", "If not for the edits I would’ve said very obvious YTA for not understanding your child’s unresolved issues, PTSD is real and kids get it too (I’m in NO way a doctor but it seems like PTSD is a possibility here, struggled a bit myself).  After seeing the second edit I’m going to say NTA and I wish there were more parents like you willing to grow and understand and actually listen instead of just going to the internet for confirmation bias.\n\nGood on ya man, we all gotta keep on growing.\n\nNext time, be kinder.  Remember, he doesn’t want to feel that way either.", "Nta but your son needs more therapy, whether or not he is willing to admit it. Seeing someone who never did him any harm should NOT upset him that way and he very clearly needs more help. If you ignore it and don’t help him then you’re an asshole", "YTA. Did Ryan apologise to Alex? What does Rebecca think of what his brother did? Does she think that was horrible or not such a big deal? If Rebecca knew about the bullying and did not find it problematic, he might find it hard to forgive her as well.\n\nAlso, when you say \"he really came out of his shell and the bullying completely stopped\" it sounds like you believe Alex to be the reason for the bullying. You could also say \"Ryan's out of the picture so the bullying stopped\", but you choose to place the emphasis on your son's behaviour, as if he was asking for being bullied.\n\nYou should be going to therapy with him.", "Yta. Sounds like Ryan’s not your sons only bully. You could really do better to advocate for him.", "YTA. This happened exactly to one of my close friends growing up. Bully and him separated school. His sibling started dating the bully’s sibling, the bully’s sibling would then tell her brother about my friend and take pics of him just chilling in his own home that the bully used to send around my friends new school and caused him a lot of grief. He’s justified in not wanting that potential source of grief or potential trigger in a place that he’s safe and comfortable.", "YTA - please learn about how trauma impacts children. This indicates an avoidance coping mechanism. Your own  child is telling you unequivocally that he does not feel safe around her. Whether it makes sense to you or not is irrelevant.", "Ehhh ok I know I’m going against the grain but I think a very light Esh- \n\nYou are a bit of an ass for not recognizing and respecting his turmoil and ptsd over being around someone related to the kid who made his life hell. I do understand where you’re coming from but memories like this stick with teenagers. \n\nAlex is being a liiiittle unfair because as you said, she was not the actual bully. \n\nRebecca kinda sucks cause she should recognize why Alex feels this way and at the very least apologize for what he went through at the expense of her brother. \n\nYour other son should consider his brother’s feelings and try to compromise with visits and get togethers so he doesn’t have to be around her so much. They can go hang with the bully", "He does need to suck it up tbh. Life doesn’t work that way. But obviously in a help him kind of way. I say NTA", "INFO: have you specifically asked him why he won’t be anywhere that Rebecca is? This whole thing sounds suspiciously like Rebecca had a hand in his bullying.\n\nSecond question - if there is some unknown part of this story, so you think your son would tell you? You’ve already flagged him as the bad guy here and Rebecca as the “nice girl”. \n\nIf a story doesn’t make much sense it’s usually because you don’t know all the details.", "YTA for not digging deeper as to why Rebecca affects him so much. They’re twins so is there a resemblance? Did she watch Ryan bully him and never speak up against it? There’s something more here and telling your kid to just get over it is shitty af", "I'm gonna say NTA, I don't think yelling at him was the answer, but I get that as parents, we sometimes get angry when our children are being unreasonable and we are not perfect. I don't think him treating Rebecca that way is fair, and you and his wife need to have a talk with him.. and emotional and transparent one. Get him back into therapy because this isn't ok for him to do.. his trauma doesn't give him a pass to hate on ppl who didn't cause it. \n\nHowever, maybe it'd be better to not force him to go to functions where she'll be there, if he'd rather not go then that's on him, his brother is allowed to have a girlfriend, his brother shouldn't have to tippy toe around life trying to please Alex, he likes Rebecca that's the end of it. \n\nIf he had dated his actual bully, then I'd have a different tune to sing, but this isn't the case. If Alex refuses to be a part of certain gathers because of someone who did absolutely nothing to him them well.. I guess it it what it is.. it'll only sour his relationship with his brother, and I think you should bring that up to him as well. As long as Ryan isn't invited ( which he should never be and make this a clear boundary), everything shouldn't be WW3.", "NTA", "NTA, but your lack of sympathy or understanding is not doing you or your son any favors. You could have handled this without being so... belittling.\n\nPut him back in therapy. \n\nAnd honestly, don't argue with him. Stop accommodating this behavior. If he doesn't want to go, leave him at home. Have Rebecca over, and he can stay in his room or go out. Have the birthday party, and he can miss out. \n\nAt this point, he needs to understand that we all have an obligation to work on our issues so they don't affect others. If he is unable to manage his trauma from being bullied to such a degree that he holds an enormous grudge against an uninvolved party... well, that's on him at some point. Give him the tools he needs to work through it, and see what happens.", "Do you actually think you can force someone into getting something out of therapy?", "Not going to lie man I agree with you. NTA. any other father would agree. Maybe be more open to just letting him stay home but I agree that he needs to suck it up eventually.", "NTA, your son is taking a ridiculous line here, though as others have pointed out, it may be hints of something deeper.", "NTA, & I'm glad you already posted Alex is returning to therapy.", "NAH-I get that Alex is dealing with stuff, but taking it out on Rebecca is misplaced.  It is not wrong to call that out.    \n\n\nObviously (and this is covered in the edits) Alex still needs help.  I am not 100% sure a therapist is the right course, unless you can find a very gentle one.  Going to therapy has the stigma of implying that the kid is broken.  This will make him defensive  \n\n\nAlso, do not let the older son know that Alex is going back to therapy.  Irrevocable damage will be done if Ryan hears from Rebecca who hears from your son that Alex is in therapy because of Ryan's bullying.", "Apparently my view is going to be unpopular. OP is not wrong for saying his son needs to get over this. Rebecca shares DNA with his bully. That’s it. It is very bad parenting to say a kid can’t have their girlfriend over to the house or to go anywhere with the family. You want your teenager to want to have their girlfriend or boyfriend included in family things. It also sucks to hate a person just because of who they are related to. That’s bullying too. \n\nI agree the younger son needs more therapy to deal with the trauma he obviously experienced. His behavior towards the sister is unacceptable.", "NTA. But it seems some information might be missing here. I don’t really understand the asshole votes. He is a “child” but he’s not a little kid as some commenters are treating him like so. If rebecca truly did nothing to him then he should be able to be around her. It’s selfish to the other son. He’s been in therapy and at some point you do have to let things go.", "YTA.\n\nYour son doesn't want to spend time with Rebecca. While I agree that this is a ridiculous response to trauma, he shouldn't be forced into doing things with her at this point. \n\nI'm not saying cut her out of the family's life entirely, but you should respect that your son wants nothing to do with her. Maybe this means occasionally planning family-only events where girlfriends and in-laws aren't invited. Maybe you could still have family events with Rebecca as long as your son gets to choose whether or not he attends. Heck, have her over at your house with the understanding that your son can just stay in his room the whole time and/or that the party's confined to one room of the house.", "“Shy nerdy kid, easy target”. Hmmmm. Sounds like OP might have been a bully himself!   \n\nYTA. Don’t you know the shy nerdy ones grow up to be people like Bill Gates?    Better start supporting your son or. Foresee him leaving you in a cheap nursing home someday!", "Yta\n\nWhat does Rebecca think of her brother bullying ur son??", "YTA. Listen to how you are describing Alex. Thats no way to help your son.", "Oh, you came here knowing full well you’re the AH and just wanted vindication.", "I hope your son realises you are abusing him and takes legal steps against that.\n\nSo much YTA, you're not even in the same galaxy.", "YTA for bullying your kid and blaming him for being bullied in middle school.", "Yta sounds like u bully ur own son seriously fuck u", "The term Bullying has lost all meaning due to how it’s used to describe everything. Did this kid beat your son up everyday, did he call him names, did he have the whole school freeze him out, was he just an asshole that was rude to everyone? I think anytime anyone mentions a ‘bully’ there needs to be more context.", "Maybe  I'm a bit harsh in my thinking but NTA, Sometimes teenagers need to be told to get over the weird ideas that they have in their heads and fathers are very good at explaining that to them(i f you've built up the requisite goodwill), \n\nMy father did that to me and  and  I did it to my kids but neither of us were being malicious in any way and my kids don't t hold a grudge and neither do I .", "Rebecca isn’t to blame in this (as far as we know) but OP needs to recognise that even so, she is a GIANT TRIGGER for him. And he needs to still process his trauma from this. OP, as his parent needs to help him navigate this, not tell him to suck it up.", "YTA.\n\nYou're punishing Alex for being a bullying target, simply because you find it inconvenient and annoying. Bullying affects a kid for life.", "YTA.\nFirst of all, of course he felt he was doing well enough to stop therapy. He was at a new school away from Ryan. So yes, he does have to go back.\nSecondly, you never say “suck it up” to someone with clear PTSD. \nThirdly, when he does go back to therapy, whether he should be required to attend events where Rebecca is in attendance should be at the therapist’s discretion. You DO NOT try to force him until that way has professional approval. It sounds like YOU created the issue by trying to make attendance at the picnic mandatory.\nLastly, it sounds like you are downplaying the bullying because it was verbal.", "YTA, deal with the problem, dont tell him to ignore it.", "Don't waste your money on therapy again if he says no. He will just sit there and not talk. Many of my friends kids did that.  He sees her but I bet when he looks at her he sees her brother the bully.", "YTA\n\nEven if Rebecca did nothing... nobody has to like another person, even if they are tied to the family romantically. \n\nIn this situation, your son has unresolved trauma. So it's a good thing that you are taking care of therapy for him. \n\nHe may never like Rebecca. But maybe therapy will allow him to stomach her presence while visiting. But don't expect more than that.", "YTA \n\nEdit: you suck. Did you at least apologize to your son? Therapy isn’t all, if you don’t do your part.", "YTA your edits make it clear you still have no empathy for your son. No remorse just ‘your going to therapy, regardless of how you feel’. And that the problem you present to your son, A disregard for his feelings. And the way you talk about the bullying “Ryan was a pain for everyone” - minimizing what your son went through. “Shy nerdy kid that was a pretty easy target” - sounds like your blaming your son for getting bullied. \n\nWhy don’t YOU go to therapy and learn how to be empathic to your son?", "YTA because you never should’ve just let your son be bullied to begin with, you should’ve stepped in.\nThere also seems to be something more going on that he hasn’t told you about and it’s absolutely not surprising because you seem to dismiss the kids concerns left and right. \nGet your son some help and stop complaining about how he’s ruining your oldest sons fucking high school relationship.", "YTA. Something is going on with your son, and something is going on with you.\n\n99% of issues with children have some component rooted in their parent-child relationships. The other 1% are also rooted in their parent-child relationships.\n\nAlex absolutely needs to go back to therapy. You should also find a therapist. Your lack of empathy for your child is troubling, consider working with a professional to figure out what that is rooted in.", "YTA. The twins are not just \"related\", they live together and go to school together. He's probably worried Rebecca will tell his former bully things about him or share photos, and even if they're totally random things, the bully could still use that against him, through other kids they both know or online. \n\n  \nI'm sorry OP, but your son is justified here. Realistically, it's unlikely your older son will date Rebecca forever (high school relationships usually don't last), and you should probably stop inviting her to family events.", "YTA. And no your son is not weak, because he had to put up with a complete shit father like you, which I am sure if you had to do that when you were his age you would've killed yourself already.\n\nAlex is not the only one who need therapy. Your whole shit family especially you need therapy", "YTA. You don’t ever tell someone to suck it up or get over it when they’ve been through something as traumatic as that. The fact that it’s his own PARENT saying that makes it worse. He’s not gonna open up to you in the future and I can’t say I blame him if that’s the response he’s going to get.", "YTA\n\nGiven by how unclear you are about Ryan and Rebecca, I take they are in fact twin sisters. I take it they look very much alike. \n\nHow soon is it before Rebecca wants to invite her twin to these family functions? Will your son have to just get over that?\n\nYTA", "YTA and I mean You are the asshole on a high stool.\n\nYou watched him getting bullied, you didn't do anything to help, you sat on it and enabled it.\n\nHow is it a surprise or annoyance to you that you could of done something about it if you know he was getting bullied.\n\nNot only that you called him shy and a nerdy kid and that he is an easy target and done nothing about it.\n\nYou can't be serious thinking this situation is ridiculous when you didn't fought for you're son who you know is getting bullied.\n\nHe prob won't open up to you knowing that you won't do anything to help if I assume that he told you about the bully.\n\nIt will be a hard time to support him because you left him in the mud.\n\n&#x200B;\n\nEdit: another note Rebecca doesn't deserve this but it's not you're son fault for literally being shit scared of someone family member who is connected to his worst bully. Just going to therapy as a way to deal with this is a good thing but not even fighting with the principle at the school to do something about the bullying is on you. Also saying suck it up is just toxic masculinity that hurts someone mental health in the long run and guess what you're son look like he is already struggling mentally.", "Jesus. Some of these comments are insanely out of touch. Nta, I feel badly for Rebecca when she starts picking up on this if she hasn't already.", "Yta.  What about if they end up married? He's going to have to live with that bully in some capacity for their entire marriage if he wants a relationship with his brother. Brothers a bit of a jerk. You probably don't know the extent of the bullying because he obviously can't come to you with problems if this is how you treat him. Yta for the way you handled this situation hands down. His bro5her knew what he was doing when he invited Rebecca and you know that too.", "YTA. Clearly his bully might be at events that his sister is at and obvious this upsets him. It doesn’t matter if Rebecca did not do anything, he might feel she failed to tell her brother to stop. Bullying is a serious issue today which sometimes ends tragically. He needs to talk to a therapist because obviously he cannot talk to you.", "Suck it up? Spoken exactly like someone who's either never been bullied or was a bully in fact your bullying your son now. Y T gaping-wide A.", "YTA. When a child fights back on not seeing someone, you should listen. No child should be forced to do unnecessary and uncomfortable things. Example between the two. A school presentation is uncomfortable, but sometimes necessary. Going to a picnic not necessary and makes him uncomfortable.", "YTA lol give a shit about your child and ask why instead of getting pissed", "NTA\n\nBeing hurt doesn’t mean you get to use that against other, innocent people.\n\nAnd not going to a picnic is one thing  - your younger son being able to ban his brother’s girlfriend from his home when she didn’t even do anything wrong is another.\n\nYour son should be able to invite his girlfriend to his home.\n\nRebecca didn’t wrong him, so frankly I think telling him to suck it up is warranted. *She didn’t hurt him.* He doesn’t have to like her, but he does need to learn how to handle interacting with people he doesn’t want to be friends with; especially when they are dating his brother.", "NTA\n\nEvery person justifying your sons behaviour needs to think carefully regarding what your sons OSTRACISING, EXCLUSIONARY, CRUEL treatment of an innocent woman and his own brother based on something beyond that woman's control would be called if he did it in a school playground...\n\nYour son is behaving like a bully, and he needs to learn that treating his brother and his brothers girlfriend like shit based on the girlfriend being RELATED to his bully is childish, concerning, and he does actually need to suck it up", "No one is going to address his brother dating bully's sister?  Very suspect decision.  There is wayyy more to the situation than has been shared.", "NTA\n\ni know this will be unpopular because Reddits stance is all feelings are valid and need to be catered for, this is just ridiculous. he needs to get back to therapy because he won't be a functioning adult if he has to hide from everything. let alone face difficulties in life from work, relationships etc.", "NTA. She can't be held accountable for what her brother did", "Holy crap at all these comments expecting a kid to act like an adult.", "NTA. This is not like this is the first time Alex has acted like this upon knowing Rebecca will be present at x event. It isn’t like this is the first time and he expressed discomfort and was told to get over it. While I understand being bullied is awful and can have awful consequences Alex’s bullying was recognized, validated and the situation was dealt with. He has even had therapy to help him deal with the effects bullying may have had on his mental health and development which according to dad he ended because he felt it was no longer needed. Good parenting now means drawing a line of acceptable behavior which is that significant others are allowed to attend family functions and that you are not allowed to skip just because you don’t like them. A critical soft skill is being able to be courteous and polite to people you don’t like. While your wording could be better I agree with you dad that it is time to suck it up and move on. You need to have one more conversation with Alex in a place he feels safe to see if there is something he has yet to disclose and if the answer remains no then I would set the boundary that Rebecca will be welcome into the home and certain family events and his attendance at those events are required and his behavior is to be polite and courteous. They don’t have to be best friends but there is no reason they cannot be in the same space. If Alex cannot manage that on his own then he has to return to therapy. You and wife also need to sit down and decide how often Rebecca will be allowed at the house and at events. While she has done nothing wrong you know this is a struggle for Alex and you shouldn’t set up a situation where he is miserable all the time because Rebecca is over 5 or 6 days a week. Good luck and keep your boundary unless some new information comes to light.", "YTA. How can you be that dense?", "YTA as someone who was bullied you can’t just ‘suck it up’. Knowing the kid he has probably hidden a lot of details for either his safety or because he’s thought that no one would care. There’s ALOT more going on. Rebecca might look similar to her bully brother OR maybe she was there…laughing, encouraging. Maybe even she got told to do something to help or instigate. YOU DON’T KNOW.", "NTA. Rebecca shouldn’t be punished for something she had no part in. Find out why he left therapy and a courage him to go back.", "ESH  \n  \nyour tone implies you really don't put much weight in the traumatic experience your kid had with being bullied. you should be focusing on HELPING him deal not just ORDERING him to. he's still hung up on the bullying, so time to do the hard work of digging into why.  \n  \nkid shouldn't be punishing his brother and his girl just because the girl's brother was/is a bully. that being said, I'd find it completely reasonable if he didn't want to be around the kid that bullied him so if the twins are a package deal, my judgment would change to you being TA.", "He is setting boundaries for himself. Why push him to do something he wasn't confortable doing when he didn't even have to do it. YTA.", "So wait..... You letting your son date the sister of the guy who tormented your other son??? And on top of that,  you are basically disregarding Alex's feelings about that fact and telling him to suck it up??? \n\nIf you can't see how you are the AH in all this, then I really doubt there is any hope for you to have a relationship with Alex once he moves out \n\nYTA, and I really hope it comes back and bite u in the butt. Cause you are well in your way to losing Alex.", " With your son’s permission,maybe get Rebecca on the phone to talk to him? If she’s really that much different perhaps she could assure him or,for that matter,share a story or two about her rotten brother bullying *her* (as I’m sure he did if he could.) Maybe your son would see her as an ally. Doable?", "YTA", "ESH/soft YTA\n\nHow you went about it was definitely wrong, but I don't think you're wrong that Alex's behavior is rude towards his brother and his GF. He clearly still needs therapy, and you should talk to him about resuming it.\n\nIf I had to guess the \"resolution\" he found that lead him to believe he no longer needed therapy was that he'd never see Ryan again. Obviously, his brother dating Ryan's sister makes the odds that he will have to one day face Ryan again jump from slim to very likely. Alex having any relationship with Rebecca, at least in his eyes, will likely further increase those odds. He isn't avoiding Rebecca; he is avoiding Ryan.\n\nINFO: Have you ever tried asking Rebecca if Ryan has any remorse for how he treated Alex? Does she even have a good relationship with her brother?", "NTA", "NTA, the son was being over dramatic about their brother daiting THE TWIN of the bully and is trying to take most (if not all) chances to stay away from Rebecca who only LOOKS like the bully", "What happens if his brother and Rebecca get married? YTA", "NTA - BUT...this is not a surface issue and it needs to be handled very carefully. You are dealing with trauma here. Yes, you are correct in that he cannot continue to behave this way. It's not healthy for him, and it will damage his family relationships. However, you are bordering on becoming the AH if you continue to simply say \"suck it up\" and expect him to heal himself of his trauma. It sounds like you're on a good path with the therapy, just keep it up and don't blame him for his trauma and you'll continue to not be the AH.", "Bwahahaha!  YTA.\n\nDid you honestly believe there was like any version of a reality that exists that doesn't make you an AH by telling your kid essentially that you don't give a sh\\*\\* about his trauma and you'd rather he suffer?\n\nIt doesn't matter that Rebecca didn't do anything to him - obviously anything even tangentially related to her AH brother is a trigger for him and he managed to cope up until now by no longer being at the same school - not thinking that there's the possibility his bully could come back into his life, however remotely, through their siblings (although the odds of Ryan being invited to something and in the same place as your son is now a lot higher when their two siblings are dating).  And instead of either helping him get help to work through this new trigger or accepting that he has the right to avoid things and people that he finds does not make his life better, you decided to just be one more AH bully in your son's life.  Can't believe you needed the internet to tell you you're TA.\n\nThe next time you decide to be the AH bully in your son's life, save yourself time.  There's no reality that exists where telling your traumatized son to suck it up buttercup will ever make you anything but the AH.", "NTA. He can’t blame his bully’s sister for something her brother did. \n\nBut he clearly needs therapy, this is a pretty big reaction and he obviously hasn’t moved passed it.", "It sounds like your son needs to return to therapy. It is taking out his trauma on a completely innocent person.", "I hope OP gives us an update. \nYTA, he could have handled it alot better.", "He’s clearly traumatized and this is a terrible idea all around. His brother and his relationships going to suffer, as if they continue to date his brother will likely be around his bully and have to be friendly. Your relationship with him will suffer, as you are showing zero compassion for his trauma. Don’t be surprised if this is the straw that splits the family as he’s seeing his entire family choose his abusers family. \n\nYTA", "You don’t understand the problem of being bullied, obviously- and everyone is different.  Something you can brush off others may not be able to.", "Def YTA. Way to make your son hate spending time with the family.", "YTA for the update. You learned nothing and you're just going to use therapy to make life easier for you. You see your son as a burden and you are not showing him any compassion.", "YTA - and your oolder son too!    \n\n\nHow couold he associate at all with anyone in a family that let their child abuse and bully others.   \n\n\nI'f be worried about Rebecca as well.", "NTA.  Alex does not run your house and he doesn't get to decide who can and can't visit YOUR home. You are right in how you deal with Alex.  Alex can choose to not go where Rebecca is. But your older son has just as much right to have his gf over at the house he lives in, as Alex has to stay away.", "Holy hell.. YTA. It sucks for your other son but do you know what it's like to be bullied?\n\nIt's very clear your son has a ton of unresolved trauma from it and you're telling him his trauma is second to his brothers relationship. No one's stopping the brother from dating her and sure, she's innocent. But you can't just tell your son to suck it up like that. He's the bullying victim. You don't get to tell him how to deal with it.\n\nYou, as a parent, help him figure out what he needs to either move past it or just enough to handle at least the sister being around.\n\nYour older son is allowed to date whoever he wants. But your younger son is also allowed to choose who to be around for whatever reason. If he's uncomfortable even through association, that's his prerogative.", "NTA - This isn't the first time you've talked to him about it.  I understand how traumatic bullying can be, I was bullied, and my daughter was as well.  However, there's a time in every ones life when faced with a real-world situation that could and maybe will make us uncomfortable where we have to realize we're being unreasonable.  He's old enough to learn this life lesson.  If Rebecca had joined in, I would be more understanding, but it's unfair to judge her on her brothers sins.  \n\nAll he's doing is putting strain on his relationship with his brother and creating an impossible situation for his parents, which has now become a point of contention in their relationship.  If he's still having all of these issues dealing with the bullying, then he should go back to therapy instead of trying to restrict his brothers relationship with his girlfriend.\n\nWtf is he gonna do at his brother's graduation if they're still together?  What happens if they have kids?  Will the kids be responsible for Ryan's wrongdoing as well?", "YTA, your sons feelings are 100% valid. I’m surprised you even allowed your other kid to date the bullies sister. You need to face the facts, that girl might not be responsible, but she is a representation of the person who hurt your child. You need to talk to both of your kids and put some boundaries down. Your son is clearly deeply traumatized and I don’t think he needs to be forced to be around someone who is family or close to the person who bullied him.", "NTA- he’s gotta move on.", "You are right, but YTA. You will never get anywhere by telling your child to suck it up. You're invalidating their feelings, and they will resent you. It doesn't matter if you're right. As a parent, you make that sacrifice to love and be kind to them even when they are wrong. If you've talked to him multiple times, then at some point, you have to recognize that he will have to learn the hard way. Save yourself the frustration and let him make his choices. Recommend he go back to therapy, because he clearly needs it. What you should have done is let him stay home, and then have a conversation once you got back. Listen to him and then explain what he's doing wrong without judgment. Kids are ridiculous and stupid, but they are also vulnerable and confused. He is his own person and can avoid her if he wishes. If it tears him and his brother apart, then he will deal with the backlash. He will learn to listen to you the hard way by regretting his actions. He will realize, \"My dad was right,\" and hopefully, if you raised your children to believe in forgiveness and love, they will make up and be happy. (Assuming that he comes back and respects his brother and his girlfriend rather than continuing his behavior)\n\nHe shouldn't prevent her from coming over, though. He can hide in his room. You can explain to him that he can't choose who comes over to the house, but he can choose who goes to his room. If he really can't stand it he can go outside, find a library or something, go to a friend's house. She's not going to hurt him. \n\n\nTLDR\nYou won't be able to change his mind without being kind, even if you don't want to be. So if you can't be kind, you have to let him learn the hard way.", "YTA.\n\nI see your point but that's the worse possible way for you to try and stop him from disconnect from the family. By pushing him like that, your just saying that Rebecca's presence is more important then his feelings in your eyes.", "YTA. \n\nYour sons dealing with trauma from psychotic shit you apparently did nothing to help him with and now you are calling him weak. Get him into therapy and yourself you pretentious shit excuse for a father.", "YTA, \n\nHow dare you? Your poor son has been through hell and all you can do is make a mockery of his pain, and you call yourself a father?\n\nWow, it's you that needs therapy, not your son.", "NTA. Speaking as someone who was bullied in a really really bad way and who had to do a lot of work on myself to recover mentally and physically, this is a bridge too far and a ‘him’ problem. He should continue his therapy because obviously he isn’t done yet.", "I wholeheartedly agree that there is missing info. The way the father acts, no wonder, the child doesn't want to communicate. He is dismissing his own son, no wonder. \n\nI hope the son gets help. I think op should go to therapy, too. There's disdain to his own kid, which kid is picking up. I hope there's a family member that kid can at least talk with.", "I agree. A lot of times in bullying situations, it only takes one bully to have the whole class laughing at the victim. Maybe Rebecca didn't say anything to him personally but she may have  laughed or never moved to help him or has made excuses for her brother's behavior. Verbal bullying usually comes with an engaged audience. Who would want to be around someone who laughed or did nothing while they were being tormented?", "I think the bullying might have been worse and more traumatising than what OP knows.", "[deleted]", "I read the first sentence a few times. Wonder what the chances this kids first bully was his dad? lol", "This should be higher. I've had bullies. I wouldn't want them touching a fragment of my life, tarnishing it with their filth. I wouldn't want them knowing anything about me, wouldn't want them told anything about my family or private life. I want them to exist in a bubble completely apart from my own never to cross.\n\nThe idea \"well, she didn't do it\" and he's just meant to jump on board. What kind of fucked up older brother does that to his younger brother.", "I dont agree. Rebecca should not be punished for ryan. Son needs to mature", "Part of dealing with it is him seeing Rebecca who never did anything to him. Or maybe he can just build him a panic room and anytime any scary thing happens he can hop on in and not have to deal with it.", ">This does sound like something deeper is going on within your son’s life\n\nAgreed. It makes OP the AH for refusing to investigate the deeper reasons, and for failing to empathize with his kid's stated preference (arguably the kid's need).", "Poor take. Rebecca is not being punished in any way, shape, or form. OP's son does not want to see her because it is obviously triggering a flare up of unresolved or buried trauma. And OP is handling it entirely poorly.", "I can see his perspective though. If Rebecca and his brother end up get married (unlikely, but not impossible) than he will be family with his bully. He would have to see his bully at the wedding, at family events etc. And if Rebecca resembles her brother physically I can also understand why he wouldn't want to be closer to her", "Rebecca doesn’t deserve to be treated differently, but the truth is the older brother is kind of an AH for dating her in the first place.  No, she can’t pick who she’s related to or how they behave, but her brother abused (verbally and emotionally- possibly physically too) Alex.  If this becomes a very serious relationship then Alex will be exposed again to her brother at some point when the families interact.  It doesn’t sound like her brother has apologized or changed his behavior.  It’s a messed up situation and OP is YTA for telling his Alex to suck it up.  If Alex was an adult with the ability to remove himself when he felt uncomfortable, then maybe he could give Rebecca a chance.  The whole family could use therapy instead of OP saying he’ll just force Alex to go again.", "He also is allowed to no be around her if he doesn't feel at ease with her.", "What's so hard to get here? \n\nShe reminds him of being bullied. Alex should be able to decide who he is around. And if seeing this girl brings it all back for him, then he is protecting himself by avoiding her. Alex deserves some agency about his own life. Of course, he's nor going to get that while his own father is a bully, too.", "This is a terrible take away. OP's son doesn't want to have anything to do with her. Period. He's not being mean to her, in fact he is exercising the ONLY right any human being has with regards to one another; the right to walk/keep away from them. Why do all the NTA people say something that involves forcing Alex to do something he doesn't want to do? Look at every comment and tell me that's not what they all are saying: it's ok to force him past his personal boundaries. Shame on all of you", "dude its a trauma response not hate, i have PTSD and its not something y choose to feel, I would love to not feel scared for my life anytime something triggers me (i can literaly be triggered by smells, and obviously i was never harmed by them it just brings bad memories), but it is what it is.", "While she did nothing to him, she also did nothing to stop her brother from bullying.", "Why should Rebecca acknowledge her brothers faults, when she is not her brother? Just because she is related to him that automatically makes her an accessory to him in some way.  mindless speculation", "Thank you! I can't believe the comments I'm reading saying the sister shouldn't be allowed to date the brother. If her brother is a massive bully to a lot of kids, this means she should be forbidden from dating loads of people, which isn't fair to her as she can't control her brother. His sins can't be imposed on her.", "Disagree-- my parents absolutely told me to suck it up and get through difficult situations. This is what you have to do for most of life's difficulties-- suck it up and get through it as best you can. Learning this as a teenager is valuable, and it sounds like the parents did the right thing with therapy", "This x 100%", "THANK YOU!!\nMost reasonable and compassionate take here", "He's not telling his son to \"suck it up\" in reference to his bullying trauma, \" he's telling him to suck it up dealing with Rebecca being around. There is a difference, and He's right in this situation. Rebecca has done nothing to warrant this reaction from him, op even stated Alex has said himself she didn't, he's placing hatred on someone who doesn't deserve it.", ">Of all the girls, his brother had to date his tormentor’s sister.\n\nFrom the sounds of it the events happened down a lengthy time line regarding middle school and high school...the brother might not have joined the dots on who her brother was - hell I learned not to mention my brother in high school dating because certain high school boys get really panicked about 1 foot out of line spelling \"beatdown\" - till way down the line and \"break up your relationship because of info neither of you knew at the time regarding her brother and your brothers history\" is actually horrendous.", "Jesus did you read the same post I did? The assumptions you just jumped to is insane.", "It's like an alternate reality on this sub, jfc", "Wild assumptions about this dad AND A CHILD (Rebecca)!! Didn't realize redditors were bananas about bullying", "How are you reading that OP thinks it was deserved??? The amount of projection going on in this discussion is OUTRAGEOUS", "this.  He doesn't want to see her.  He left therapy because he thought he was ok being away from his old tormentor.  Now there is a physical reminder in his presence again.  Why is that so hard for people to see?", "\"Letting your son\" are you suggesting he should forbid his son from dating a girl who had zero to do with the bullying, and ignore the emotions and needs of that son? As far as the story states, this girl is innocent, and if her brother is a menace and bullies loads of kids does that mean she shouldn't get to date anymore her brother traumatized? That's a really unfair thing to put on her. \n\nThe brother who was bullied needs to seek further therapy so he can learn to cope with this situation, but it's unfair for him as a whole to hold it against her as she did nothing to wrong him. I know families of people where one sibling is a huge jerk, and the other siblings are nice, it's not fair to judge people based on their sibling. Dad needs to be more understanding and gentle, and not say suck it up, but also son needs to go back to therapy so he can handle being around the sister or at least tolerate it when it comes up.", "They’re brother and sister, so no they’re not identical twins.", "In the post itself it's stated that Alex has confirmed that Rebecca didn't do anything. \n\nI feel sorry for this boy, but even more so for his brother whose life is now being dictated by a younger brother.", "I used to wish my bullies would just kick my ass on the playground when I was a kid.  It would have been easier to get over than the shit they said.", "The way you minimize what your son experienced in your entire post and comments and then to his face. Do you care about his wellbeing at all cuz at this point it only seems like you care what's an inconvenience to you and not the actual trauma.", "I will tell you this based on my experience. I would much rather have the crap beat up of me than deal with emotional abuse. The bruises go away, but the words stay and have a habit of popping up in the mind at the most inopportune times.", "Even if it was verbal, you are still an asshole. I only asked that to see how much of an asshole you are. Even if it was verbal, doesn't mean it doesn't leave trauma. So instead of telling your son to \"suck it up\" maybe support your son. Also you said your son was \"punishing\" Rebecca by not seeing her. It's not \"punishing\" her, he's just not ready yet.", "I sniffed it out in the first two sentences.", "He see's his son as irrational and prejudiced. This girl has done nothing wrong but son is treating her as a pariah. You think that's not bullying?\n\nSupporting your kid doesn't mean enabling or excusing their poor behavior.\n\nThey did put him in therapy but he wanted to stop. I don't think reddit really understands therapy - it doesn't work without buy in from the patient. Sure they can try again but if son doesn't want to engage you can't force someone into participating.\n\nIf son was bullied by a black person, is it okay to take that out on all black people \"because trauma\"? That's where your reasoning leads.\n\nNTA OP.", ">  he was the shy nerdy kid that was a pretty easy target for people\n\nYou can tell how much OP despises his own son. OP probably bullied kids like his son when he was in school.", "Oh we're not debating THAT part. It's OPs callous attitude towards his sons pain that makes him the AH. OBVIOUSLY, Rebecca is innocent and the son shouldn't make her pay for her brother's bullying but there are BILLIONS of ways to settle this without just saying GET OVER IT. Take him to therapy, listen to what happened to him, and I MEAN REALLY LISTEN. No one is blaming Rebecca here, we just think OP could give a damn about the bullying and address the lingering trauma rather than just wave it away. \nOP: You're son has clearly not healed from this bullying. Sit him down, apologize for telling him to get over it. Ask him to tell you about his experiences...and LISTEN. HE NEEDS YOU TO HEAR HIM AND CARE\n\nEDIT: Thanks for the award!", "Its not about Rebecca or the other son, the question is, is OP an asshole for how he handled this. \n\nYes. Yes he is. Majorly. That's why it isn't having the intended affect, because you can't just tell people to get over shit. While his sons behaviour is wrong, it's understandable and its a fathers son to teach not berate and force. \n\nOPs behaviour is aggravating the situation. A little kindness and empathy over \"suck it up\" would be far more effective.", "Damn it why can’t all these children stop acting like children. So immature. /s", "You're not wrong, but you're also not right. Children mature on their own timeline. For the kid to be holding a grudge against someone who isn't an identical twin (which I would acknowledge to be potentially triggering), the kid's holding a grudge for a reason as-yet-unstated.\n\nOP is YTA for both not understanding his kid, and for cultivating his own ignorance by assuming the key issue and steamrolling his kid's *clear* preference.", "They didn’t say Rebecca should be punished", "Why did Rebecca not do anything to stop her brother", "Your just inventing stuff now. Its clearly stated by the victim that she didn't participate.", "That’s not fair.  She’s not responsible for her brother’s actions.  They were in middle school.  What would you have expected her to do?  She’s not her brother’s keeper.", "\"why he is so against Rebecca? Her mere presence is triggering him. That's not normal.\"\n\nNo, it's not. It's a sign of trauma and a damaged mind. He is clearly still dealing with issues. People will respond in all sorts of unexpected ways after they have suffered trauma.", "It sounds like they have had multiple conversations about it and the son was in therapy but chose to stop. I understand that the son in 15/16 yo but even at that age, you need to decide you WANT to address trauma and learn to move on. OP's son doesn't sound like he wants to- which is fine, except that it heavily affects the lives of other people in him home. The son needs to be back in therapy or at least come to an agreement about staying in his room with his brother's girlfriend is over so that his brother can continue to live his life. Unfortunately, even if you force someone into therapy, unless they're ready to.do the work, it won't help. Therapy would be the best options but it's really up to the son if he WANTS to move past his trauma and judging by the facts OP laid out here, this kid doesn't want to- otherwise he would would have stayed in therapy the first time.\n\nI say this as someone who has trauma from Jr high and high school bullying.", "If your kid refuses to actually put in any work to resolve their trauma with tools you've given them, I'd argue that you don't have an obligation to let them behave inappropriately/cater to their demands. \n\nIf he won't do therapy and actually try at it, what exactly can OP do?", "Except for this kid has been through years of therapy that he chose to leave on his own because he felt he “didn’t need it”. Clearly his parents are not inattentive to his mental health needs.", "OP’s son also willingly left therapy because he believed that he was over it but clearly is not. It sounds like Alex isn’t handling it the best either but for some reason everyone seems to think he can’t possibly be at fault because he has mental health issues. Mental health issues do not remove all fault from someone, you still have to take responsibility for yourself and your actions.", "It is still not fair for Alex to punish Rebecca (or his brother by extension) for what her brother did. I understand his perspective as well, but you have ti remember that he is a sophomore and has few other options at the current moment than to either suck it up and deal until he’s old enough to make his own independent life choices or find a way to work through it.", "Here's the key phrase here: \"when he was at the new school\". \n\nHe was away from the bully. Seeing his sister probably brought a lot of that trauma back up.", "As someone who was bullied horribly- I improved once I stopped being in the place or seeing people related to my trauma. \n\nThat doesn't mean I was healed, it meant that the physical and emotional strain of seeing someone close to/who was my tormenter wasn't on me every single day. Your son is still dealing with massive emotional pain, and he might even be feeling physical pain. When I am forced to see those people, and/or when I went to the same school I would have unfixable stomach pain and head pain that would mean I had to leave school around 2 times a week. I was in physical pain because of the stress. Don't tell him to just get over it, he has trauma.", "Key words:  he went to a new school and didn't think he needed it anymore\n\nThis is because he was no longer seeing his bully.  This is because he has surrounded himself with safe people.\n\nNow, he is being forced to see Rebecca- and he is reliving the trauma.\n\nTherapy does not always work the first time you get it- maybe he and the therapist did not click- but he should be encouraged to go back and try again.  I personally would recommend a male therapist who can address PTSD in adolescents.  As much as people might say- well, it was only verbal bullying or it only happened for a few times or the sister did not participate, in your son's mind, it is worth discarding relationships over.  That makes it important.", "Does Rebecca have a strong resemblance to her brother?", "Him being traumatized does not make the OP an AH because they see their kid's behavior is unacceptable. Their behavior IS unacceptable and needs to be dealt with, albeit in an appropriate, caring, and loving way. OP is NTA because they recognize inappropriate behavior that needs to be corrected.", "That’s up to his parents.", "He does not have PTSD from some verbal hostility for crying out loud.  These internet psychologists are out of control.", "Yes, but we don't even know if she knew about the bullying, and there's not much she could've done anyway to stop it short of reporting it and getting Ryan to stop.", "Trauma isn't a get-out-of-jail-free card for treating people like shit.", "Someone can acknowledge something that isn't their fault. Humans are all about relationships. If my brother did something horrible to someone, who I was then friends with, least I could do is say 'hey, that was horrible, I'm sorry they did that'.", "Because she witnessed this kid being tortured for years by her own brother??? A simple \"hey, I'm sorry that happened to you. You didn't deserve that\" isn't too much to ask for.", "The problem is I don't think it was just bullying. I think it was something severe for the kid to not even want to hang out with his brother. I'm really leaning towards sexual assault from your post because then it would reason that the sister looks like her brother and it triggers emotions he'd rather not feel. In addition, I'm really concerned that OP doesn't understand that if the sister and older brother get serious then her younger son would directly have to deal with his bully.", "Refusing to be around someone IS NOT bullying. He has done nothing to this girl. OP YTA!!! Way to railroad over your kid.", "And then he just goes no contact as soon as he's an adult.", "He literally said this is ruining the relationship between the brothers. Look, I'm all for encouraging additional therapy, but sometimes in life we all have to be around people we don't love for the sake of cohesion (esp since Rebecca did nothing wrong!!!)", "It's unreasonable because it's not healthy behavior. It goes way beyond simply hanging out with who you want to hang out with. The kid is clearly traumatized and that trauma is clearly affecting him. It's not like they're asking him to live with her. If he REFUSES to spend a few hours with her at the cost of spending time with his own family too, then there is something much deeper going on and it's not healthy in the least. The kind of mentality you're espousing here is what leads people into deeper and deeper mental health issues because everyone who questions it is vilified.", "THIS ... people still marry thier high school bf/gfs which means ops kid is gonna be subjected to this for as long as thier together. Brothers the ah for putting his own brother through that knowing what he went through. But you know golden children can do no wrong. He'd rather have his sons gf there then his own son. Yta op", "Couldn't agree more", "It's just odd that you fucked it up even though it's a common saying. It's \"he said she said\"  but you used \"she said he said\" which is awkward if you natively use it even infrequently. And definitely not the lyrics from Limp Bizkit. \n\n\nAll this to say, you obviously look down on your son, so maybe just be better at being his parent instead of dismissing it as \"he was an easy target\" and \"he said, she said\"  bullshit that he has to just get over.", "For the record, verbal abuse is serious, but physical and verbal assault often go hand-in-hand.  How many bullies do you know that just randomly beat you up without explanation or intimidation? Getting the crap beat out of you plus having mean words hurled at you is objectively worse. You’re quite literally dodging blows from all directions. And then you never feel safe.", "As someone who got my ass kicked by bullies, the grass isn't really greener 🤣", "As someone who was in an abusive relationship, getting my head knocked between the stove and fridge was definitely worse than the things he said to me. 🤷🏽‍♀️\n\nThe bruises from physical assault do not just “go away”, it creates emotional damage. I did not just forget my nights in the hospital concussed or getting my hair snatched out because I said something too smart. Just like I don’t forget being called a “stupid bitch” over and over and over. \nThey shouldn’t be compared really because at the end of the day Abuse is abuse.", ":/ hard disagree but aight", "Identifying a kid as \"shy and nerdy\" and equating that to \"an easy target\" does speak volumes, doesn't it?", "Sheltering your kids from every single thing does nothing for them.", "> This girl has done nothing wrong but son is treating her as a pariah. You think that's not bullying?\n\nHow is he bullying her when he's the one excusing himself? Nobody is owed association.", "The racism comparison is dreadful. They aren’t saying they should encourage their kid to be hateful towards Rebecca, they’re saying that simply telling him to ‘get over it’ is unlikely to work and may prevent him from opening up in future. It’s about how you go about encouraging them to overcome the trauma", ">enabling or excusing their poor behavior.\n\nI don't think it's poor behavior.\n\nOP's son just doesn't want to see Rebecca. That's it. It's not a punishment, it's just the son choosing whom to spend time with.\n\nPoor behavior to me would be calling her names or assaulting her or something.", "I was with you until you used a race based example…", "The argument you used does not make any sense, There’s a huge difference between those two examples, in this kids case his brother is seeing his bullies sister. That’s a direct link back to the bully and depending on how far that relationship goes he may end up being forced into the same proximity of the person who hurt him. It’s a constant reminder for him. \n\nThe key difference here is he wants to avoid a couple of people who caused him harm not an entire race in a made up scenario. He needs help sure but it’s also unhelpful to force him into a situation he’s simply not ready for. Honestly why on earth is his brother even with his bullies sister, we have no context on their relationship or her relationship with the bully. If she hates her brother then she’s got a leg to stand on but otherwise it’s extremely questionable on his brothers part imo.", "the girl is the twin sister of his tormentor, that's about as close as you can get. even if she didn't do anything to the kid, she's pretty much a walking reminder of his pain.", "They are teenagers. Let them be. Help them find compromissions. Instead he is showing a lack of empathy towards his son and forcing him into situations. Why cant Rebeca go in their house while OPs son is away? Or in a diffeeent room? Why is this such a big deal? I still feel something is missing from the story.\n\nEdit: typo", "NTA, OP.", "> If son was bullied by a black person, is it okay to take that out on all black people \"because trauma\"? \n\nBecause people with trauma responses are totally in control of them, right? They're just *choosing* to get triggered?", "Thank you.", "Being shy and nerdy is not an insult. Some kids are shy and nerdy. That is a fact. Some are not shy and nerdy, some are shy and not nerdy and some are neither with every variation of grey in-between. \nAnd it is simply the truth that a shy and nerdy kid is easy to bully. They have lots of ammunition. It's much harder to bully the captain of the football team. \nThere is nothing wrong with what op said. He simply recognises who his son is and the realities that incurs. \n\nI actually think it tells far more about you and the others that have said the same, that you see \"shy and nerdy\" and think it's a bad thing and an insult.", "Or OP could have just been describing his son. You must be an Olympic level long jumper, given that leap you made there.", "Hahahaha!!! Wow you are beyond ridiculous.", "OP is bullying his own son right now. Calling him ridiculous and obviously favoring his other son. \"Weak\" son's feeling are unimportant because \"golden son\" might be inconvenienced.", "\"Just wav\\[ing\\] it away\" doesn't seem like a very accurate characterization. The kid has already had years of therapy, and he's the one who chose to end it.", "This comment is awesome, thank you.\nOP is an idiot.", "Sometimes as a parent you just have to put your foot down and deliver the tough love.  Is it an AH move? Maybe, but if so then in those situations it's warranted assholery.\n\nIn this father's shoes, I'd put my foot down, as well. Patience isn't limitless and life isn't always sunshine and rainbows.  After years of therapy and a complete change in behavior (no more bullying, good school life, etc) a young adult needs to start reflecting on their own behavior instead of being catered to and making life miserable for the rest of the family simply because of a coincidental blood relation.\n\nRebecca didn't do anything to him.  He's throwing a tantrum at every opportunity and driving a wedge between his bro, bro's GF, and himself. He's basically forcing his brother to choose, and not for anything *she* did. The son is the AH. I wouldn't tolerate that, either.  Kid needs to go back into therapy, as OP now plans.  NTA.\n\nEdited a word", "Rebecca isn't the bully. OPs son is dictating his family's behavior. He needs to go back to therapy and stop blaming the Wrong person", "But Rebecca hasn't done anything worth being uncomfortable over. Nobody chooses their relatives, so unless she's out there defending her brother's actions or something she shouldn't be blamed for Ryan's behavior.", "Lmao ... ok well good luck accomplishing anything in life then.", "My bully's brother was my brother's best friend, back in the 70s when kids didn't go to counseling for anything short of an actual breakdown. I relived the assault every single time I saw the brother. I get his point of view. His dad sucks.", "Well I guess he can stay in his room and miss picnics. His bully wasn't invited, Rebecca is dating his brother. He doesn't get to punish them, they did nothing wrong", "Legit my first thought.", "I agree with you. This is an opportinity for son to mature. You cant go through life avoiding discomfort", "Yes op  needs to work with son to know whats really going on.", "??? So its rebeccas fault she didnt police her peer?", "This is a joke right? Or should we hold you responsible for any misdeeds your relatives have ever done too?", "If your father's response is to \"suck it up\", would you be 100% honest about the bullying situation?\n\nI suspect that a lot more happened than the OP has presented or the son has been willing to admit.  For example, the bully and the son are now attending different schools.  By being forced to \"hang\" with the twin sister, the bully now knows where the son is at that precise moment.  Maybe the son has an underlying fear that at any moment, because the twin is there with cell phones etc., the bully just might show up?\n\nYTA.  Telling your son to suck up his past bullying just created a reason for him to not ever want to talk about any future issues.  You need to fix this, immediately.\n\nEdit:  to clarify- by attending different schools, your son no longer has to \"see\" or think about his bully.  He was able to relax his guard.  However, when he sees the twin, he is faceplanted into a reminder of the bullying.  Whether the twin sister participated or not is not the point- the point is that the sister reminds him of everything that happened and he gets to relive it.", "[deleted]", ">What would you have expected her to do?\n\nUh, I don't know, literally anything? Maybe talk to him, maybe tell her parents about it", "> Unfortunately, even if you force someone into therapy, unless they're ready to.do the work, it won't help.\n\nSeriously, people need to stop acting like therapy cures everything. Sometimes avoiding a singular trigger is the better or only solution.\n\nPeople are advised to not avoid their triggers if it affects their daily functionality. This doesn't seem to be the case here. OP's son seems to have moved on into a good spot in his life since the prior bullying. He doesn't seem upset at all by having to miss these events. Not sure why all that has to be put in jeopardy and why he needs to put in all this effort over one person he just doesn't want to be around. \n\nGenuinely, I do not see any therapist recommend forcing him to associate with Rebecca until he's able to cope properly with the triggers involved. The reality is that no amount of therapy *might* be enough to help him do so. In which case, a therapist would then recommending avoiding that person altogether. Then what? Ignore the therapist?", "Therapy isn't a cure-all. It is not uncommon for therapists to recommend avoiding severe triggers if methods of coping with them just don't work. Then what? Still force the son to be around her?\n\nFrom OP's account, his son has largely moved past his bullying and is currently doing just fine in every aspect of his life but this. It seems rather insane to jeopardize all that progress by forcing him to associate with *one* person. \n\nIt's not like the son is being unreasonable about it too. He's not demanding that Rebecca be excluded and he's excusing himself instead. What's the problem?", ">Ever since Alex went to high school he really came out of his shell and the bullying completely stopped. The new school really helped.\n\nI mean he's right about not needing it if he's doing fine in virtually every aspect of his life outside of Rebecca.\n\nThere are some triggers that are so severe for people that therapy isn't going to address it. If that's the case and the next therapist advises he just avoid the *one* person, then what?", "Alex is a child. A. Child. You know? Children? Famous for their level-headedness, wisdom, patience, and judgement?\n As someone who was bullied relentlessly in highschool, i really don't see a way to me respecting what you have to say on this issue. \n Mental health issues do not remove all fault from someone? Ok, what fault is here to be removed here? How T F is Alex at fault here? For not wanting to see someone? Ok so he's at fault, in your world. Now what? What do you suggest to remedy the fault? Force him to spend time with her? To what end? She's going to feel soooooooo much better being in someone's company that was forced to be there and actively wants to be elsewhere, right?\n Please don't mistake my trying to figure out what exactly your point is by asking rhetorical questions as straw-manning.", "There are likely familial similarities. I’m not saying that as an insult but they likely have common physical traits even if they are different personality wise.", "You can't force someone back into therapy, it's not going to work if he's been dragged there under parental duress and isn't invested in it, it will only cause ill feelings towards the parents", "Except Alex was the one who chose to leave therapy because he “didn’t need it”. You don’t think he’ll call his dad an asshole if he tries to force him into therapy he doesn’t want?", "Probably just like get a different job", "Yes? Obviously if you're uncomfortable in your work you should quit.", "Except this isn't the future, he's a kid, not an adult, who has obviously suffered trauma from a bully. And is being told get over it by his parent. \n\nInstead of the parent helping him work through whatever it is he's going through, which is what I'd hope you'd do as adult.", "It's not the same at all. This is a direct link you that bully, and being a twin most likely participated or at least was entertained the whole time. The parent says otherwise, but that's just how teenagers are \n\nThe parent also says he's been thriving since changing schools, so obviously he's ready to move on and has done that, her probably just wants nothing to do with that family, and I respect that.\n\nIf someone hurt my kid, their whole family would be banned from mine, call it petty, idc.", "Get a new job? That's what I would do.\n\nIt's his choice to not see her. His family should accept it and if that mean they don't invite him, then it is what it is.\n\nAlso there are so many people and his brother choose the twin of his ex bully. Ngl kinda dick move. 🤷‍♀️ If they ever marriage then the ex bully will be part of the family. And then what? They have everything double? Or tell him to suck it up and just be nice around the ex bully?\n\nDunno seems like they just don't care about him.", ">needs to be dealt with, albeit in an appropriate, caring, and loving way.\n\nWhich OP was not doing. That's the point.", "If you need years of therapy to deal with bullying, it was more than \"getting picked on\".", "Clearly you (person above) have no idea the trauma bullying can cause. I was picked on by one kid daily for several years until he moved away after eighth grade. It took away all of my self-esteem and gave me body image issues, both of which lasted well into my 20s, as well as other issues that were a direct result of a single bully. Sure, most girls have body image issues, but what I wouldn't give to go back and experience high school and college with some self worth. \n\nOP, He needs to go back to therapy. And in the meantime, if he doesn't want to be around Rebecca, don't make a big deal out of it. You don't know his reason and you don't know the extent of what happened with her brother. Make the deal that you won't bother him about her if he'll go back to therapy. Then hold up your end and show no negativity about him not interacting with her.", "How is that hateful? He doesn't claim to hate her at all.", "Not it's not. She is his brother's girlfriend right, he doesn't have to be around her.", "And we don't even know if the two of them are even on speaking terms. Wouldn't be the first time a pair of twins can't get along.", ">When I realized this, instead of trying to ban short-haired blondes from the world, I began compensating for it. These other women have never harmed me, and it's not right to treat them as vicious because they somewhat resemble someone who is.\n\nWell OBVIOUSLY you're a victim of brainwashing by society...you had \"trauma\" and you were a \"victim\" and those short haired blondes should have catered to you and dyed their hair and wore extensions instead.", "Ah good to see the the Logical Old Soul & expert in Temper Tantrums join chat", "Life however can mean you wind up in places where you feel unsafe. They can be unsafe too, e.g. you might be in  court as the defendant in a trial. Knowing you can still function even when you're scared is an important life skill.", "I’m so tired of this narrative that people need to feel “safe” all the time. They don’t. That’s not how people grow or thrive, in environments of comfort. Our children are developing rates of anxiety like never before because they never have to face adversity, and it needs to stop. \n\nI’m not saying physical safety, that obviously is different. But it’s been stated that Rebecca never did anything to him. He is with his family who would protect him even if she tried to. There is zero reason in this situation for him to feel “unsafe”. Uncomfortable yeah maybe, but there is zero threat to his safety. I’m tired of people saying they feel unsafe when they’re really just uncomfortable", "He hasn't railroaded him. They've had multiple conversations and therapy which the son decided to leave. Op let it go on for so long until it came to a head and then told his son that if he didn't want to be around Rebecca he was free to remove himself from the situation instead of expecting her to be excluded for a change. He hasn't forced his son to do anything. If his son wants to avoid someone for no reason then his son should expect to be the one left out. This girl has done nothing wrong. The parent has tried to work it out with his son to no avail. If being left out and excluded is not bullying then his son shouldn't be upset about not joining in with group events going forward.", "Hes what? 14? So they can force him for 4 years and then what?\n\nAnd why is his brother daring the bully twin? That's fucked.", "Sure but how is forcing him helping anything?  Why not just let him be? Maybe he will change his mind and maybe not. But yeah by all means crack this kids psyche for the sake of his brothers date. I guess?\n\nWeird hill to die on.", "This very well could be the beginning of the end of this poor kid’s relationship with his family. Not unlikely to go NC as adult", "So let's jump immediately to strange catastrophic thinking that kids dating will lead to marriage and a lifetime of seeing that person? Yikessssssss", "I'm sorry, but this comment is gold 😆", "My ribs healed. My nose healed. After being released from the hospital. Over 30 years later even with a good husband and years of therapy. When something  happens, I will still hear my ex’s voice in my head saying the reason it happened is because you are stupid, dumb, you caused it  it would be better if you weren’t around.", "A broken bone will heal, a broken nose will heal. But being called stupid, fat, ugly,being told you should just go kill yourself because no one likes you. Those words stick with you. Even with therapy those words come back to haunt the victim.", "As someone who was once a shy and nerdy kid, it didn't say a damn thing to me. We're definitely easy and obvious targets. Because we're \nnot  confrontational we don't fight back. That is a grade-A easy target.", "easy target!? I feel like OP did his own bullying as a child", "You are being overly PC. Some kids are extremely shy and, yes, nerdy. And yes, guess what, they are bullied very easily. It is the truth. There is nothing wrong with being shy and nerdy. It's not an insult from dad to recognise who his son is. It is something that is easy to bully, so bullies use it.", "“Easy target” is particularly victim blaming", "Truth volumes", "\"Shitting in your kids' throat does a lot, though.\" -you, prolly", "I am a teacher and I work at a youth's critical care home. I know. Being a demeaning asshole does a lot *to* your kids, though :)", "Trauma. Talk about an overused word.\n\nEdit: hey you can’t downvote me do you have any idea how traumatic this is going to be for me if you guys keep doing this?!!", "\"he wants to avoid a couple of people who caused him harm\"\n\nBut it wasn't a couple of people. It was 1 person. Rebecca is not responsible for someone else's behaviour.", "That just it though, their trauma is there responsibility. Rebecca poses no threat, he should be controlling his emotional state not letting it loose.", "Exactly it's called trauma for a reason it's involuntary and it make the person with trauma far more miserable than the friends and family some people genuinely believe people want to live with that shit lol.\n\nTrust Reddit to turn high school bullying into a political thing no reasonable person could argue with... It's almost like they can't articulate a standpoint/belief without a low blow \"gotcha\"", "Feels like you’re projecting here", "Dude, I'm 43. While reading this I got choked up remembering my own bullying. I cried. I graduated 25 years ago and I still remember exactly how I was made to feel. He may very well have thought he was healed but seeing Rebecca brought it all back. Bullying stays with you. TRUST ME", "Yes, this 👍", ">dictating his family's behavior\n\nHe's not doing that, he's just saying \"I don't want to see Rebecca. Therefore I want to stay home,\" which I think is perfectly reasonable. If I don't want to see someone for any reason, I'm not punishing them simply by choosing not to spend time with them. Now, if, say, OP's son were to punch Rebecca and say \"That's for being my bully's sister\" then that'd be a different story.", "He rather specifically isn't dictating his families behaviour, just his own. He has never said they can't see her, do anything, etc. He just won't be there when they do.", "It isn’t as simple as “blaming the wrong person” if she brings up trauma for him then there’s no easy solution for that. He may even know himself she’s not to blame but it’s the trauma that’s the real issue here and it’s obviously being brought up just by her presence.", "As someone who’s been hurt before, if I was forced to hang out with someone who looks like the person who hurt me, I’d be uncomfortable regardless. What I know would be healthy is to make an effort to know this person and grow to see them individually, apart from the shitty past I have. This is about how OP put 0 effort whatsoever to help son grow and learn. \n\nAlternatively, if someone didn’t want to be around me because I look a certain way, I would understand. I would make an effort to show I mean no harm, but I would never tell someone to get over it and hang out with me.", "We don’t know she didn’t do anything. And neither does OP. The fact Alex is so adamant about not being around Rebecca suggests there is missing part of this story. \n\nIf I was Alex the last thing I’d want to do is own up to OP about being bullied by a girl. He already thinks poorly of his son and of Rebecca as a “ nice girl”. OP has a poor, authoritarian relationship with his son. Those kind of parenting styles often lead to secrets. \n\n. If that’s what happened it would explain Alex’s actions right now.", "How do we know that? She very well could be involved. Trauma hits deep, regardless. This is a boy who needs help and understanding parents. Everyone has a reason for not wanting to be around someone they don’t like, he doesn’t HAVE to like Rebecca and he doesn’t have to be around her either. Perhaps his brother should have put more thought into who he chooses to date.", "Agreed, your trauma doesn’t get to dictate everyone’s life.", "I disagree. He doesn't want to be around her because it triggers past memories of being bullied. He's also the one excusing himself from events where she'll be there. People go through life enacting their own boundaries and avoiding triggers all the time. What's the issue?", "The son who was wronged has to mature to cater to everyone else? As the father said, he did great being away from his triggers. \nHe chooses not to be around the sister of the bully(who was most likely involved herself) and he's the problem?\n\nEven as adults, if there's someone you don't like, you don't have to spend your personal time with them.\n\nIt's obvious the father doesn't give two shits about his kid so I can't blame the son for also disassociating as well.", "Her brother, not her peer.", "I'm not holding her responsible, but if my sister was bullying a classmate I wouldn't just accept it like Rebecca did", "The girl is literally not her brother's keeper and she has no power over what a teenage boy does.", "A whole post judging her invented actions, followed by \"I'm not gonna judge her\" 🤣", "Pfft. Parents are human. Son needs help yes but parents can only do so much. Giving into this behaviour wont set son up for success.", "Considering they’re twins probably", "He's still a minor.  Minors sometimes have to do what their parents tell them to do, like tpngp  therapy to learn how to be an adult who can handle things and not crawl into a hole everytime.\n\nOP, NTA.\nYour youngest son does need suck it up and get back into therapy. He's using Rebecca's being Ryan's twin as an excuse to be a bully to her.", "Clearly he still needs it and this episode should allow OP to see it too. OP is TA for still trying to force Alex to go when he had such a visceral reaction. OP should have said, fine you don't have to go, but clearly we need to re-start therapy if this was so triggering.", "Essentially banning his brother from being able to invite his girlfriend over when she did nothing wrong is getting close to bullying itself, imo.", "She got him therapy, it's been several years since he's been around the kid. He has a few years left, mom is being a parent by teaching him an important lesson. Sometimes you just gotta suck it up and face reality.", "Well if you looked at the edit, it says that the dude has been through therapy and stopped going on their own free will. So like, the parents did try to help him through it. With that in mind, it's fair to get to a point to go \"Suck it up, they did nothing wrong to you.\"", "I really feel like so many people are glossing over the fact she’s directly related to his bully. Seriously, how are people dismissing that point", "Yup, why are people acting like it's absurd to not want to be around someone who's directly associated with someone who caused you trauma? He's currently doing well in his life, has his own friends, doesn't demand Rebecca be excluded and willingly excuses himself from events where she'll be there. What's the problem again? That he's established his own boundaries in a way that protects him without affecting his ability to function in the day to day (and yes, that's still the case if missing out on some family events doesn't bother him)?", "If you tell a HR department, with 100% sincerity, as a grown adult, that you want a transfer because a senior colleague LOOKS like someone who bullied you in high school they're either going to immediately deny that, pretend they're going to try and immediately start searching for a way to have you fired and replaced by next quarter, or deny it and still start searching for a way to have you fired and replaced by next quarter...\n\n\"Suck it up/get a grip/grow up\" are SOMETIMES used incorrectly when that person needs genuine sympathy and such...in this case though and many others it's the only applicable phrase...\n\nIn this scenario we're talking fraternal twins - which usually have a resemblance but aren't identical (especially when girl/boy) - but wheres the line on \"vague resemblance to high school bully as justification for mistreatment and prejudice\"? \n\nWhere I'm going with that is - what if the bully was black? Does the victim have the right to refuse to work under black men? Or tall men? Or men who wear glasses? Or men with blue eyes? How far does this go? Or do we accept that \"you don't get to mistreat/assume bad intentions of people who resemble your bully because THEY. AREN’T. YOUR. BULLY\"", "Yeah because good job opportunities / job hopping is so easy.\n\nLife means dealing with difficult situations. \n\nAlso this is elementary school..???!!! This blame children for being verbal bullies for the rest of their lives is absurd.\n\nIts possible ryan had something really rough happen and was acting out and as he matures he will change.\n\nI dont hold grudges for how people behaved as children\n...... children unless they were dangerous. Then i have empathy because that denotes mental illness untreated", "Sometimes appropriate, caring, and loving means being very blunt about someone's behavior. It's not all hugs and sunshine all the time. There are so many nuances to human interactions we do not know here.", "Read his own description of what happened.  Also…everyone seems to think you need 6.3 years of therapy for stubbing your toe nowadays so I wouldn’t be too sure.", "If OP is correct and Rebecca did nothing to his child, this is more about association. A lot of people think of twins as one unit, unfortunately. This  is very much something that could be happening here. That's definitely bad for Alex, but it may not have a single thing to do with Rebecca. \n\nIf she really hasn't been involved in her brother's bullying, it is completely unfair to her. However, that doesn't mean the association Alex has is irrational in a social sense since, again, people often treat twins as a unit. It does mean he's either got to suck it up or go back to therapy though, if she's going to be this involved in his social settings.", "I was bullied as a kid.  I did, in fact, have to get over it.  It’s called resilience and we need to teach more of it to our kids.", "He’s a minor and his parents decide what functions he goes to.", "It's a high school relationship and evening it works out he still do t be related to the bully.", ">And why is his brother daring the bully twin? That's fucked.\n\n...Why is that fucked?  Rebecca hasn't done anything wrong.  She's not responsible for the sins of her brother.", "I don't know about you but I didn't see where anyone FORCED him to see her? They left him at home, meaning they eventually gave in to his demands despite recognizing them as inappropriate. Just \"letting him be\" is called enabling and it ruins peoples' lives. As a parent, I can tell you that I'd never just let my kids be if I saw they were having serious mental health issues. You don't just ignore them and HOPE someone fixes it on their own.", "I married the guy I started dating as a junior in high school. It happens.", "Native speaker here. Have heard it. It's used to describe a generic hearsay situation. It's not meant to be an accurate description of a specific spat.", "It’s one of the most generic sayings ever, used even when we’re talking about people of the same genders.", "Can we not acknowledge that being beat up is on the more serious side of the bullying spectrum, though? It didn't seem like he's diminishing, it seems like he's clarifying what actually occurred. So sorry this happened to you, AND you are majorly projecting onto this man", "And for me personally, it’s been the opposite. I can’t speak for anyone else, just like you can’t. I love my now husband to death and I know he’d never harm me, but I flinch still when he moves too quickly towards me and there’s certain things he can’t do physically or I go into a panic. I KNOW I’m not stupid or worthless or any of the things my ex said. I honestly can’t even remember 99% of the things he said because honestly I didn’t hold onto his words because they’re not true. I also never blamed myself for him hitting me even though he tried to make it like it was my fault, but I always saw it as a character flaw in him…..and I think that’s mostly why I fully hold onto his actions. He chose to hit me & knock me out on his own volition. My brain can’t fully make the connection that I truly won’t get hit again because I never deserved it in the first place, just like I wouldn’t now.\nPhysical abuse causes emotional damage as well. The damage of physical abuse is more than just the healing of the physical wound.\n\nI’m sorry that for you the verbal abuse stuck with you. It’s all so tough to get over. And it sucks that either of us had to go through both forms of abuse.", "The physical wounds heal but the trauma of being in fear of physical assault regularly is its own kind of emotional damage. People act like physical attacks only have physical effects, and that is *not* true. Someone hating you enough to beat the shit out of you is an insult just as big as \"you're fat and ugly\"", "I'm sorry but this is just straight up borderline ignorance. Just because a physical wound heals does not mean that the beating doesn't have psychological effects on a person. A person that deals with physical abuse has triggers, has trauma, has insecurities and yes even in therapy those \"broken bones\" will come back to haunt them as well. You're downplaying what happens to people just because you THINK that words hurt more, when they both have different effects on a person that are BOTH horrible on a person's mental health. They BOTH require years of therapy. They BOTH haunt the victim.", "I fought back. I wasn't tough enough to win, but was tough enough to keep it going until we both would get busted, me and the4 bully of the week. After a while they learned to look for easier prey but my memories of 6th grade are particularly nasty, even decades later.", "Yeah I was also the shy nerd easy target. It sucks but it still holds true even today..the non confrontational shy kid with easy to bully interest is easy to get. There is a reason it keepd happening year after year. \n\n\nSure once I learned to fight back it got easier but still", "I know many kids who are shy and nerdy who are not bullied.  Identifying that as the reason for the bullying is inaccurate.  I do know a number of kids who are nonconfrontational who are bullied.  One reason to be nonconfrontational, is because people tell you things like \"it is what it is\" and \"suck it up- this is the way things are\" so you don't fight back because you are convinced that nothing can changed.\n\nThis child is using skills that are nonconfrontational (avoiding conflict) and yet, are avoiding potential situations of perceived harm.  I give him kudos for trying and I feel said that it only backfired in his face.", "I think OP is still bullying - except not it’s own child. Telling his son to get over his trauma and even blaming him for getting bullied sure feels like a bully. Worse, a bully with complete control over you.", "He's was likely his son's first bully and continuing it now.", "The father could find a better way of putting it, or god forbid help him", "And this makes it okay?", "More like too often overlooked. Everyone carries a lot more trauma than they think, so it’s a surprise when it’s brought up", "Replace it with any word you prefer and my point remains identical.", "And Alex is taking responsibility. He didn't stop anybody else going to the picnic or doing other activities, he's just absenting himself. I'm assuming Alex is a teenager - OP doesn't write the ages and not everybody is American and knows what the hell a junior or sophomore is - and should be starting to make decisions about his own life, such as who he socialises with. Maybe he'll never be friends with her, and that's okay. \n\nOf course controlling one's emotional state is the goal.. doesn't mean he's there yet. What teenager is? He's had some therapy, probably needs to start again, but clearly his bully's twin being around disturbs him and it's not unreasonable for Alex to do what he needs to be comfortable. \n\nAll made worse by OP's terrible attitudes.", "It's because the best way to show how wrong or ridiculous something is, is to magnify the situation. The reason It's a situation you can't argue with is because nobody should blame someone else on the actions of a person they have no control over. \n\nIn my own opinion it's a NAH situation where if he feels like avoiding her that's up to him. Unlike with the racism situation ducking out of dealing with one person isn't the same as a group of people. He can choose to not want to be around them however mom and dad don't have to keep the brother from having his girlfriend around. He can choose to stay away, go to his room or a friend's house or not go to family functions but that's his choice and he might eventually realize he's isolating himself and slowly expose himself to the situation like they do for phobias.", "You're speaking as if I had no experience. That's not correct.\n\nI'm 54. When I was in school, nobody cared about bullying at all. Parents and teachers alike thought it was the child's problem. In one particular class, a bully spent the entire period, every day, repeatedly kicking me. Nobody cared, and it was still supposed to be my own fault if I didn't ace the class, since I was supposed to somehow \"ignore\" being kicked constantly.\n\nYes, it was maddening that nobody cared, but that's not what's happening with this kid. His parents did and do care. They have taken the problem seriously, going through with reporting even though documentation was a PITA, and they have provided him with years of therapy, stopping only at his own request.\n\nThey're not ignoring him. They're not dismissing it. That's not what's being described here.", "And you cannot be in the room with someone from your bully's family? Wow.  There's something that deserves its' own post.", "Well if Rebecca can't come to their home, that's dictating", "OP clearly stated Rebecca couldn't come to their home. That's dictating. Older son lives there also", "Well he shouldn't have stopped therapy. That was his decision", "It's a real slippery slope to put the entire onus of making Alex comfortable on someone who hasn't actually done anything wrong  because they \"look a certain way.\" Would you say that about a person of color if you'd been hurt by a person of color, or men with beards because you were hurt by a man with a beard? Because it's equally shitty to blame her for any resemblance she may have to her brother.", ">he has confirmed that she never did anything. \n\nIt's right there in the post.", "You avoid everyone you dont like even if they have done nothing to you? (Post says rebecca has done nothing)\n\nHow do you go out at all? Have a job? In laws?\n\nThere are plenty of people id rather not see .... employees id rather not supervise due to personal dislike not anything they have done. \n\nThis is not reality for a successful life. \n\nDad has paid and promoted therapy for years??? Thats not caring?", "Why are you assuming she was present for all the bullying? It’s a good assumption that she wasn’t. What you can’t assume is that she definitely knew about it.", "Amazing how this subreddit can seamlessly flit between \"at 10 years old males are unquestionably stronger than their female counterparts 9 times out of 10\" when it comes to discussion about roughhousing, sports, etc but apparently \"oh you know the teen girl should have just walked up and using a thumb and forefinger lifted her bully brother off his victim\" depending on what the situation needs.\n\nI've got a younger brother, love him to bits.\n\n4 years age gap.\n\nWhen I was 16 and he was 12 - if I wasn't in heels he was taller than me, by a slim margin, when he turned 16 I think he had a full foot and a bit, even IN HEELS he still towered over me...", "Buddy said “irrelevant 🤚🏽” lmaooo like no sir it is actually very relevant with context ???", "Also, that's the excuse for abuse, parents are only humans, they're doing their best, they're trying... And what you get? Kids that were neglected, punched, abused in many ways, parents need to be more than any regular person, they need to accept their responsibility, having kids is a responsibility, and if you're not ready, then better don't have them, if it forced onto you, get help.", "I never said to just forget and go along with son's irrational aversion, he needs help, op also needs therapy.", "Chances are forced therapy won't work here. And no, he's not bullying her.", "I don’t disagree by any means, I’m just saying that this kid won’t be happy if his dad forces him into therapy either. It would likely be a better result, though.", "Not even close to. It is.", "Sometimes you do just gotta suck it up. This ain't one of those times for us to decide. He stopped going to therapy cause he was at a new school and wasn't seeing his bully and thought he was better. Based on his reaction to Rebekah obviously he isn't better and there's still some unresolved issues to deal with.", "I know that. My point is that OP is not being responsive to his son's needs or caring. OP is trying to invalidate his son's feelings and experience with being bullied. The reasonable thing to do would be to find out why specifically he doesn't want to be around Rebecca then work it out; not get angry.", "We’re getting the dads perspective on a situation he didn’t even experience. We can take what he’s saying with a grain of salt", "So was I. It's fair to lay down some ground rules with Rebecca, as in 'please don't waffle on about Ryan and his achievements'. It's not fair to Rebecca to be persona non grata for something she didn't do. I did the same thing with the sister of a former friend who turned into a bully. If Rebecca doesn't respect Alex enough to be sensitive to his past with Ryan, that's a different story, but to be banished because she's had the fortune or misfortune of being his sibling is uncalled for.", "He is a teenager, he can stay in the house if he doesn't want to go to picnic with her. It's not like he demand from them to not go.", "No they don't, unless it's something to do with the child's health, they absolutely cannot force him to attend.", "Or he could also decide that he doesn't want to deal with her. And his family could accept it. If that means he doesn't attend family gathering - then it is what it is. 🤷‍♀️\n\nHis decision.", "Here is why:\n\nI assume he goes to her house?\nI bet he has dinner with her and her family including her bully brother.\nDinner conversation, maybe board games,  he's fine with breaking bread with someone who was *that* bad to his brother?\n\nIs it just me? If someone tortured my sibling to the point he needed years of therapy, I would probably just give the whole family a wide berth. \n\nIs it such a wild idea?\n\nJesus is this the same forum that advises people to go NC because someone in their family dates someone with racist parents? \n\nI dont have a dog in this fight so my interest is minimal, but I feel sorry for for this obviously damaged boy who has a father telling him to suck it up and putting cute quotes around the \"verbal\"  in abuse like it's less harmful.", "Would you tell them to suck it up? That's preferable to enabling?", "Yeah, it happens. But “it happens” isn’t synonymous with “it will happen”. Breakups also happen, especially at this age.\n\nMany, *many* people just break up when they go to college (or do the other paths of life). There’s no reason to assume they’re set for marriage at this stage, nothing in OP’s post even hints at this.", "Thank you! So weird how this is controversial", "Plot twist- he bullied the kid who is bully's father 🤯🤯", "Who said it’s ok? It’s reality. Minority kids are more likely to be targets of racism. Girls are more likely to be targets of sexual assaults. Immigrant kid are more likely to be the target of xenophobia. Shy and nerdy kids are more likely to be targets of bullies.\n\nDo those statements blame the victim? While many people DO blame these victims, talking about the real impact these personal characteristics have on the behavior of others is not victim blaming.\n\nOP’s issue is a lack of compassion for his kid, not victim blaming.", "Not being perfect accepting ourselves...that's not just a one way street. Dad gave autonomy and respect to his son's truama, that doesn't mean every response is in the moment perfect. He's not judging or namecalling he used the wrong words but made correct action's, space, understanding and allowing son to self soothe.\n\nNTA, but also not perfect.", "Nobody is blaming the girl, it's how triggers work you can't control them 😂\n\nI have a father who told me to \"suck it up\" my entire life I grew to hate him soo fucking much.", "But alright let's go there if you were sexually assaulted and your brother/sister married a sibling of that person how would you feel being told to \"suck it up\" see how \"magnifying a situation\" sounds really dumb? Because I sure do.", "Agreed!! Responses here are making me feel like I grew up in the dark ages and I'm 32 😅", "Yes because I am initially scared of all men. No blame individually, it’s a fear based off of trauma and I try to get past it but this is life. I’m not saying to put Alex on a pedestal or make  Rebecca suffer because of this, if anything I express the importance of not making it a big deal. But the point I’m trying to make is that it’s more common then you’d think and OP needs to teach him good coping mechanisms.", "The father confirmed that. I'm not sure sure the son did. There's a VERY HIGH chance the twin sister was there for all three bullying and laughed right along with everyone else. That's what teenagers do. I also suspect the son would be too scared to tell this particular father a girl was involved in the bullying.", "No, not at all. I don't hang out with people I don't like, and that list is maybe 1 or 2 people. That's what normal people do. The son stated he wants nothing to do with Ryan or Rebecca, save that is fine. He's not stopping his brother from dating her, nor house parents from spending time with her. \n\nThe reality is this relationship will probably be over by end of high school, so I don't understand why it's so important to push the girl on the traumatized kid.\n\nJust let him be.", "He is only choosing to avoid Ryan and Rebecca, not the whole world. He has a right to avoid severe triggers.\nAnd maybe his dad should've looked into why the son is that traumatized... there is a deeper story here.", "Right?? I did not have the therapy context and, as I read through the comments, I find myself continuing to stand with what I said. If Alex chose to leave therapy on his own, his father trying to force him back into it won’t help. Sitting down and having an actual conversation with Alex about why he feels he doesn’t need therapy or what is actually going on here is way more likely to lead to a better outcome for everyone involved than just letting this kid stew in his trauma and destroy his relationship with his family.", "Your taking a massive leap here.... op telling his son its time to push through his discomfort and move on IS NOT akin to neglect and physical abuse.\n\nParents are human and sometimes react/say the wrong thing .... leaping from there to dont have kids youre an abuser tells me a lot about you", "They’re his parents and he’s a minor.  If they want him at a family event he’s going or having consequences.", "Man I wish someone would have told my parents this when I got dragged to functions I didn't want to attend. /s \n\nParents can force their children to go qith them to functions. What is the child going to do, call CPS because they are being forced to go to a Waterpark with their family and brothers girlfriend? Get real lol", "He’s a minor.  His parents get a say here.", "I'd probably suck it up by avoiding them like the brother does. I'd have to make a choice to ether go no contact or learn to live with it.  I'd probably drop contact. Not a hard choice", "Don't hurt yourself with that giant reach", "I also think its fine to not develop a close relationship with her or even a quasi friendship is fine. Refusing to be in the same vicinity is different.\n\nIf someone i dont like is attending the same event as me i just dont talk with them outside of pleasantries. I dont refuse to go.\n\nI can say not going to a picnic is to my mind not a big deal but rebecca is not allowed at any event because of this.... thats where i think son should try to get past this issue\n\nThere will always be triggers ... i dont think coping by avoidance is a pattern that should be encouraged", "And there could be a reason he wanted to leave therapy. That therapist may not have been the right one for him and he may not have felt able to open up to them. Or he could not be ready", "Having therapy in the context doesnt change anything… like the previous person commented… \nYou either lack real world experience or are that obtuse… either way your comment lacked tact .", "I said that's the excuse people use, great that you recognize parents make mistakes, shouldn't they apologize then? At the very least?", "What consequences lol. Again him being a minor doesn't mean his parents can force him to do things he is not at ease with it. It doesn't put him and danger or jeopardy to not go to picnic.", "Are you for real?", "Ah yes because if your pressure someone, then it will be good.\n\nI know these kind of people who say \"suck it up\". Now they are wondering, why I don't give a fuck about them and just banned them out of my live.\n\nConsequences.\n\nHe doesn't want to see her. They should accept it and not pressure him. And at some point he maybe deals with her.", "It's a reach that teenagers bully?", "Rebecca is definitely allowed at events, the parents made it very clear. The son just chooses not to go. \n\nI agree with you, it's not a way to go through life in every situation, but he's like 15 and this isn't the end of the world. The parents are making it worse than the son.\n\nShould he go to the event with all parties understanding Rebecca is not to talk to him? Maybe a policy of hi/bye and nothing else? how about a 20ft minimum distance rule? That seems worse than him just not going. \n\nAnd if we're being honest, adults do this all the time. People choose not to be around people for certain events because either they won't enjoy it, or they might say something and ruin it for others.\n\nIt seems like the family is trying harder to accommodate everyone else besides the child who was actually hurt. Very strange behavior.", "> If someone i dont like is attending the same event as me i just dont talk with them outside of pleasantries. I dont refuse to go.\n\nWell, here's a good lesson I've learnt from therapy: you *can* refuse to go.\n\n>but rebecca is not allowed at any event because of this....\n\nBut that isn't the case here. OP says that his son excuses himself.", "Then he can find another therapist or something. Not being “ready” for therapy does not excuse mistreating someone who did nothing to you.", "Things like losing a phone, being grounded…you know, consequences.", "Yes.  I think parents should parent.  Crazy I know", "Has it occurred to you that they might be relieved to see you go?", "If we're inventing facts from whole-cloth, why stop there. By the same logic, if Rebecca's brother is a bully there's no proof that he doesn't bully her at home too.", "Of course you dont have to go but then you miss out because of someone else\n\nI read it as rebeccas not allowed at the house or anwhere son is, this is the first picnic where rebecca is invited to the same place as son", "His trauma is absolutely valid, and a very common part of abuse trauma is being triggered by those close to the abuser. It took me 2 years from leaving an abusive relationship to realise how many things were triggers and that I needed help, but I also had to be ready to deal with it.\n\nThere's absolutely info missing about just what Ryan did to Alex (ironically his bully has the same name as my ex, until a year ago even the name was a trigger)", "no, but as a twin this person is a constant reminder of his trauma. if my brother dated my high school bullies sister, i would simply cut contact. you can be happy, however it is not the kids responsibility to have the adults in his life telling him how to handle his trauma. sure, she may not have done anything, but the family that allowed and raised a bully isn’t a family i want around. especially because this trauma is unresolved. i’d like to hear the specifics of the bullying. i’d imagine it was pretty bad if the kid required years of therapy and is still internalizing it. also would like to know why he chose to stop seeing his therapist. could have been incompatible", "Over not wanting to hang out with someone ? Who are you, Staline ?"]}