{"id": 18498, "submission_id": "13v8go6", "title": "AITA for declining to be my cousin’s bridesmaid because her wedding is on the same week as my college graduation?", "selftext": "My cousin, let’s call her Polly (F 24) recently got engaged and she announced that the wedding would be in Puerto Rico next year. Polly is the first person in my generation to be getting married so it is a very exciting thing for our entire extended family. \n\nGrowing up, we were not super close since our parents didn’t have a good relationship. However, as we were the only girls in our generation, she asked me to be a bridesmaid for her. Which I am very flattered by. \n\nThe problem however is that the wedding’s on the same week as my college graduation. At my school, graduation consists of week-long events, traditions, and ceremonies which I know may sound trivial but I didn’t have a high school graduation due to the pandemic and my entire first year was online so I have been looking forward to the graduation festivities for the past few years.\n\nI told Polly that I couldn’t be her bridesmaid since I don’t want to miss my graduation and also that I probably won’t have the bandwidth to help her with all the bridesmaid duties leading up to the wedding. I could still attend the actual ceremony since it’s the day after my graduation but I just wouldn’t be able to arrive before then. My cousin got very upset and basically told me I’m being selfish for putting my wants over our family and threaten to not invite me to the wedding. I lost my temper and told her that she should go ahead and take my name off the list then since I cannot be her bridesmaid. \n\nNow my entire extended family is asking me to apologize to Polly and to agree to be her bridesmaid. My aunt, Polly’s mom, actually suggested me to skip graduation all together since they will just mail me the diploma if I can’t attend. \n\nMy parents were not very happy with what my aunt said and now they’re having an argument with her and also said they would not attend the wedding either. I didn’t mean for it to get to this and now my grandparents are also getting involved. Yesterday, my grandma actually called me and offered to pay for my flight to PR if I agree to be Polly’s bridesmaid and it’s really hurt because I’ve already made peace with the fact that she isn’t coming to my graduation since she can’t afford the extra plane ticket to fly from home to my college and then to PR and the wedding is more important (which I 100% understand) but now it just feels like she doesn’t even care. \n\nAITAH for doing this? I thought I was justified for not wanting to miss graduation week but now I’m not so sure anymore considering all the reactions from my extended family and especially my grandma.", "created_utc": 1685398953, "permalink": "/r/AmItheAsshole/comments/13v8go6/aita_for_declining_to_be_my_cousins_bridesmaid/", "score": 252, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I’m refusing to be my cousin’s bridesmaid since I don’t want to miss my college graduation and might have started a family civil war between my parents and my extended family.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA - youre literally busy the weekend of her wedding and Polly is being ridiculous", "NTA. Graduation can’t be rescheduled", "NTA, you did the right thing by telling her upfront you wouldn’t be able to and she’s throwing a tantrum over it.", "NTA.  Congratulations OP.  Attend your graduation, you earned it.  This is a legit conflict of schedules, and you're not even that close with the cousin to begin with.  Family is causing drama for its own sake.", "NTA, but let me fix one sentence there for you: \"My cousin got very upset and basically told me I’m being selfish for putting my wants over her wants\"\\*   \n\n\nShe's being a main character of the universe here. Enjoy your festivities, you've earned them I'm sure.", ">At my school, graduation consists of week-long events, traditions, and ceremonies which I know may sound trivial \n\nNTA at all!  College graduation is just as big a deal as a wedding.  And it's your life, not your cousin's.  You have every right to be there for your big life event.", "NTA! Go enjoy your graduation, and congratulations for this goal!\n\n(if she goes on berating you for not attending the wedding, tell her you won't miss her next one :))", "NTA.\n\nYour cousin is being selfish. Both are exciting life milestones, but one is yours and the other is not. Put yourself first.\n\nYou guys aren't even close so I'm puzzled as to why she's so adamant for you to be in her wedding party to the extent that she'd not invite you at all if you were merely a guest. The main character syndrome seems strong in this one.", "NTA in any way, but the bride and her mother definitely are entitled AHs.", "NTA. You are not the one being an AH. They are.", "Polly is over the line. She asked you felt honored, advised of your prior commitment for something equally as important.\n\nalso..do you all reside in PR? If not it's even a big ask if you weren't graduating to travel for a full week.", "NTA. Graduations are IMPORTANT. You don’t get a redo, or a chance to say goodbye again, or any opportunity to recreate that moment of celebration- take it from someone who had one cancelled due to the pandemic and didn’t get to say goodbye to anyone. Don’t let anyone take that accomplishment and moment of closure away from you if you feel it is important. Given that you can still make it to the wedding there is NO reason you should have to choose between the two. If it means you can’t be a bridesmaid that is unfortunate, but you shouldn’t put your life to the side for someone else’s.", "NTA. You’ve worked so hard and deserve to enjoy your graduation with all the events your university has going on that week. \n\nYour cousin is an entitled selfish brat. You should decline her invitation before giving her the satisfaction of uninviting you.", "You are NTA the AH. Your cousin and family who is siding with her are being total assholes. They are trivializing your graduation down to nothing and gaslighting you for being smart and practical. You informed her from the beginning that you could not attend, but her and other family members you mentioned just could not accept that. Your parents are doing their job and sticking up for you. It is not your fault that your cousin and her family are being selfish. Enjoy and attend your graduation ceremonies, you will only get to experience them once in your lifetime. Congratulations!", "NTA. \n\nA graduation is just as important as a wedding. In this situation, it just depended on which one would give OP more happiness and relief. Unsurprisingly, you picked the graduation. Just remember, if you ever get married and have a wedding, don’t invite this cousin to be a bridesmaid. If she’s pulling this now, who knows what she is going to do to you in the future. Good luck and have fun on your graduation.", "NTA. \n\nIt's an invitation to participate, not a summons to servitude. You and your parents should decline the invitation and immerse yourselves in the joy of your graduation. It's a celebration of years of dedication.  The wedding is a celebration of narcissism and arrogance. Easy choice.", "NTA. You get to decide what events are the most important to you. And all wedding planners have to deal with the fact that other people have their own schedules.", "So very very much NTA!\n\nCollege graduations are special, and it sounds like yours is going to be a week to remember -- mine was, and it more years ago than I'd like to think about!\n\nYou're not close with her, so there is really no reason to give up that once-in-a-lifetime experience.\n\nYou did not cause this - your cousin and aunt did.\n\nEnjoy this special time. You earned it! Congrats!", "NTA. Your graduation is important to you so she should respect that. Afterall you did say you'd come for the ceremony itself. \n\nBoy reading this makes me feel not sad for not having a big family. Less headache.", "Absolutely, you are NTA. Graduating from college is a big accomplishment and you deserve every bit of celebration that goes with it. In ten years your cousin may not be married anymore but you will still have that diploma.", "NTA \nYour graduation is important to you just like her wedding is important to you. \n\nIf your family is happy with you arriving the day of the wedding then fine but they shouldn’t get to decide your priorities.", "NTA. Stop letting bullies bother you. You worked hard, for years to get to graduation. Stiffen your spine. Stop making yourself available to people trying to bribe you to go. Just don't answer the phone. People pleasing will screw your whole life up. All this crap for someone you barely know and don't even hang out with? Please.", "NTA. It is your life and your choice.", "NTA. Being *asked* to be someone’s bridesmaid is not an obligation. You’re allowed to decline, even if the reason is ‘thanks for asking, but I’m not comfortable with that.’ In your case, you have a reason for declining which is outside of your control (it’s not like, say, a road trip you’re planning and could choose to reschedule; you have no say over when your college graduation falls) and relates to an important life event for **you**. I think far too many brides (and families of brides!) forget that, while their wedding is incredibly important to them, it’s not the central focus of everyone else’s life. You offered a respectful answer to her bridesmaid invitation, and you were still happy to fly down after the graduation so you could be part of her special day. She’s by no means entitled to more than that from you, and anyone who tells you otherwise is being unreasonable.", "Absolutely NTA. Polly’s wedding is the most important thing in the world to everyone else like she thinks it is or should be. It’s only that important to her. Asking you to skip your college graduation is a selfish, entitled thing to do. And I’m glad your parents support and back you up in that! Graduating college is a big deal and congratulations!!", "NTA. Graduation is just as important as a wedding. She is the one being selfish and not understanding. Glad your parents are on your side, as they should be. Enjoy your graduation with your parents.", "NTA", "DO. NOT. MISS. YOUR. ONCE. IN. A. LIFETIME EVENTS. FOR. OTHERS.\n\nYou being a bridesmaid in her wedding is not “for the family”. It’s for her. Don’t miss your stuff for her stuff.\n\nNTA", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy cousin, let’s call her Polly (F 24) recently got engaged and she announced that the wedding would be in Puerto Rico next year. Polly is the first person in my generation to be getting married so it is a very exciting thing for our entire extended family. \n\nGrowing up, we were not super close since our parents didn’t have a good relationship. However, as we were the only girls in our generation, she asked me to be a bridesmaid for her. Which I am very flattered by. \n\nThe problem however is that the wedding’s on the same week as my college graduation. At my school, graduation consists of week-long events, traditions, and ceremonies which I know may sound trivial but I didn’t have a high school graduation due to the pandemic and my entire first year was online so I have been looking forward to the graduation festivities for the past few years.\n\nI told Polly that I couldn’t be her bridesmaid since I don’t want to miss my graduation and also that I probably won’t have the bandwidth to help her with all the bridesmaid duties leading up to the wedding. I could still attend the actual ceremony since it’s the day after my graduation but I just wouldn’t be able to arrive before then. My cousin got very upset and basically told me I’m being selfish for putting my wants over our family and threaten to not invite me to the wedding. I lost my temper and told her that she should go ahead and take my name off the list then since I cannot be her bridesmaid. \n\nNow my entire extended family is asking me to apologize to Polly and to agree to be her bridesmaid. My aunt, Polly’s mom, actually suggested me to skip graduation all together since they will just mail me the diploma if I can’t attend. \n\nMy parents were not very happy with what my aunt said and now they’re having an argument with her and also said they would not attend the wedding either. I didn’t mean for it to get to this and now my grandparents are also getting involved. Yesterday, my grandma actually called me and offered to pay for my flight to PR if I agree to be Polly’s bridesmaid and it’s really hurt because I’ve already made peace with the fact that she isn’t coming to my graduation since she can’t afford the extra plane ticket to fly from home to my college and then to PR and the wedding is more important (which I 100% understand) but now it just feels like she doesn’t even care. \n\nAITAH for doing this? I thought I was justified for not wanting to miss graduation week but now I’m not so sure anymore considering all the reactions from my extended family and especially my grandma.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA   NTA   NTA   NTA   NTA     If your cousin and aunt wanted you in that wedding sooooo  much, they would have made sure you could be there.  There is something really, really wrong with them expecting you to miss your graduation when you could still at least attend the wedding. And no way should your parents miss your graduation.", "NTA\n\nYour graduation is a once in a lifetime event for you. \n\nYou can go to her second wedding 😉", "NTA, enjoy graduation festivities! You worked hard and you earned it.", "NTA. You have no control over when graduation is. She, however, does have control when her wedding takes place. Perhaps she should change her wedding to accommodate your graduation.", "NTA. She's selfish and self centered to think that her wedding is the only important life event", "NTA.. And to be the total cynic.. This will be a once in a lifetime event.. statistically, it's unlikely this would be her only wedding", "nta at all sorry to be cynical but there is a good chance it wont be her only wedding i dont mean to judge your cousin but its just the way the world is", "So NTA!!! Graduation from college is HUGE and you deserve to enjoy all of the events and other activities offered because you earned them!  She asked and you politely declined.  No harm, no foul and she’s acting extremely entitled.  Any family member that has harassed you about it should be ashamed also.  You do your thing and enjoy every second of it. Congratulations grad!", "NTA - if your cousin wants you there so badly she should move the wedding since the graduation can’t be rescheduled.", "NTA.  You deserve to have your graduation and the temper tantrum your extended family is having is ridiculous.", "You could invite Polly to your graduation, then get really upset when she declines as she's clearly selfish, putting her wants over your family. NTA", "NTA and shame on your family for trying to make you feel bad about this. I cannot believe she told you you were putting your “wants” over your “family.” How is her wedding not just her “wants”? And how does you not being there affect your family in any (major) way? (You aren’t the bride or the groom.)\n\nEveryone in your family who thinks that a wedding is more important than a graduation is being a bit of (some of them, a complete) AH right now.", "Agreed.  I don't know of anyone that asks people to be bridesmaids AFTER renting the venue (unless you are a second string bridesmaid...)", "honestly I would argue that graduating college is a much bigger accomplishment than getting married!", "Because she wants to take away OP’s shine and wants her not to get any attention at all.", "Furthermore I think we found out why your parents are not close to this aunt and why you aren’t not close this cousin. Graduations are one in a lifetime events to celebrate your hard work.", "And actually graduating is a once in a lifetime event for OP. Polly’s wedding May very well be the first of several.", "Good point, I agree.", "Another good point.  People who put this much store in the weddding, imho, often aren't as invested in the actual marriage...they just want that \"Queen for a Day\" thing.", "NTA. My best friend got engaged when I was a second year law student. She asked me to be her maid of honor and then wanted to know when my law school graduation was going to be held, as well as my schedule for studying for the bar exam, to ensure that the wedding wouldn’t conflict. She came to my graduation, I went to her wedding before starting the hardest part of studying, and 18 years later we are still friends. \n\nYou are never obligated to attend an event like this, and your cousin’s reaction suggests the wedding will be a shit show. Enjoy your graduation!", " NTA, please go to your graduation.  Now you know why your parents have not gotten along with her family. Respond to your grandma that you are sorry she will be missing this major event in you life but you understand that she cares more for your cousin than she cares for you.  Yes she is an AH and call her out.  If she can afford to fly you to PR she can afford the ticket to come see you graduate.  Have a blast all week.  Post the heck out of it on social media.  Make sure there are a lot of photos with your parents as well.", "NTA - SHE'S being selfish. Go to your graduation and do what YOU want to do.", "NTA. Being a bridesmaid is an honor, but one that you can decline. You're not being rude. College graduation is important!", "NTA", "NTA - graduating from college is a much bigger achievement than getting married.   Your grandma and aunt and cousin are totally in the wrong.  You offer a reasonable compromise to attend the wedding but not as a bridesmaid, and you aren’t throwing a fit over your grandma not attending your graduation.  Don’t feel guilty for not giving into their demand.  Feel proud of your achievement and celebrate it!", "NTA\n\nTell her you’ll skip your graduate degree graduation & be her brides made at her next wedding if they fall on the same date.", "NTA. Ask her why can’t she change the date of her wedding, as she can literally pick any other date. Tell her you are hurt that she’s choosing to miss your graduation. And tell grandma that you are hurt that she’s choosing to skip graduation on the ruse that she can only afford one plane ticket when clearly she can afford two. You have worked hard for your day. Enjoy it and congratulations!", "NTA. Your college graduation is more important than Polly's wedding. You need to have a great memory of your own life milestones and your graduation is it!", "This post broke my heart NTA. \n\nMeasuring milestones is relative to each individual and so I can’t tell you one is better than the other because they are both huge moments for each of you. I think you being honest was the best thing you could do. A Mature and a difficult conversation.  I’m getting married soon and yes it’s stressful and exciting etc but I would also support people who can’t come especially if it was for such a huge event. We do not own a day, week or month. Your cousin was super immature and your extended family pandering to her is only going to fuel the fire. You might have dodged a bullet! \n\nYou’ve done nothing wrong and you deserve to enjoy the experience of graduating! No doubt you’ve worked so hard to get to this point you deserve to enjoy your moment. While your behaviour of your extended family is horrible you have your parents who are standing up for you and will be so proud of you! \n\nCongratulations and enjoy your graduation day! Try and ignore all of the background noise x", "NTA. Congratulations! This is a bugs accomplishment & you deserve your celebration. The entire week of celebration if that is what your school does, you go & do it & don’t think twice about it. It’s not selfish to want to celebrate your accomplishments. Your cousin’s wedding is a big deal to her & probably the rest of the family which is ok but you & your parents have a conflict which is also ok. If your cousin & family cannot understand or accept that, they are TA, not you. Congratulations again & enjoy your week!", "NTA. The wedding is over a year away- a loving, kind family member would have heard about your graduation and would have been happy to make it possible for people to attend both events! I’m sure you spoke up about your graduation as soon as Polly said something about a date. Her wedding can be rescheduled; your graduation cannot. Have fun and I hope it smooths out soon.", "Or...if it's that important ... now hear me out...they can push the wedding out by one week. If it is that important for OP to be there, then they have enough time to change the date. Family over everything, right? \n\nNta", "NTA\n\nIt doesn’t sound trivial to me and it’s a big deal that you’re graduating!! Congrats!!", "NTA\n\nShe can choose the date of her wedding - you can’t choose the date of the graduation.\n\nAnd “family” doesn’t mean “hostage”.\n\nWhat’s awful is you can attend the wedding, but that isn’t good enough for your cousin. \n\nYou don’t have anything to apologize for - she threatened to remove you from the guest list. You aren’t close to her and you have a schedule conflict. \n\nYou’ll also be in your last year of school, so I totally understand being worried you won’t have the energy to be a bridesmaid for a wedding - and it’s no one else’s business to judge how much energy you have or where you spend it.\n\nYour college graduation is just as important milestone to you as her wedding is to her. Your cousin and aunt are behaving incredibly badly.\n\nYour grandmother is trying to play peacemaker, but is missing the point of the conflict.\n\nYou said no to being a bridesmaid and Polly won’t accept it.", "NTA Don't let your grandma make you feel bad. She's wrong. I'm happy your parents are on your side as they should be. Attend all your graduation festivities and enjoy them! Use the money you would have spent on traveling to your cousin's wedding on something for yourself and CONGRATULATIONS 🎉", "NTA this is a big achievement and a big day in your own life, you do not have to miss it because your cousin is getting married and demands you be a bridesmaid.\nDoes she not have other friends? She’s being ridiculous, as her mother.", "NTA\n\nCONGRATULATIONS ON GRADUATING!\n\nIsn't she putting her wants over your graduation? Something you have spent years working towards? Honestly, if she wanted you in the wedding that badly why on earth didn't she schedule it for a different week?\n\nYou didn't say you couldn't go, just that you would be too busy to be the kind of bridesmaid she would need. Plus, you said you aren't really that close so why does she care so much? \n\nINFO: Does she not have any close friends to be her bridesmaids? Are you her only option?\n\nAs for grandma, I would say you need to talk to her. Explain your side and how you feel. She might not have all the information. It kind of sounds like she thinks you can't afford it, which might be why she offered to pay for your ticket.", "NTA. Sure you could show up for the wedding and wear whatever dress she wants you to wear, however, as you say you won't be able to do all the usual bridesmaid stuff in the months prior to the wedding because you'll still be in college.  You know she won't be happy if you just show up and wear the dress.  If you agree to be a bridesmaid, she will throw a fit every time you say you can't do all the other stuff she demands because you're still in school, and professors don't reschedule exams because your cousin demands that you go cake tasting with her.  Not to mention all the financial demands she will put on you, the broke college student.  You can't win, so just stick with \"I'm sorry, but I can't due to school\".", "NTA. \n\nAn invitation was asked, and invitation was declined. Zero explanation required.", "NTA\n\nShe wants you to prioritize her life event which doesn't affect your life at all over your own well-earned life event. You aren't even close and your lack of participation won't affect things.", "NTA... Her wedding is NOT more important then your graduation.\n\nYou probably put more effort and sacrifice into achieving your diploma.", "You are NOT an AH!", "Do as you wish, your body, life, and time. \n\nI was backpacking during my college graduation ceremony.", "NTA.  Go to your graduation 🎓.  And, congrats 🎉🎉", "NTA. \n\nWhen you are invited to a wedding or asked to be in the bridal party, you have a right to decline to both. You deserve to attend your graduation and walk the stage.", "As someone who didn't bother with my graduation with my BA or with my Master's -- and I don't regret it for a second -- you're absolutely NTA for wanting to spend your graduation time preparing for graduation and going through the ceremony. Congratulations and best wishes in the future! This is the culmination of years of hard work", "NTA your college graduation is a huge deal and your cousin and her family are entirely 100% in the wrong here.   Even your grandma is wrong although the poor woman is probably stuck in the middle listening to your cousin whine about it and is just trying to keep the peace.  If it was that important for you to be there, they should have worked around your graduation.  It is a huge deal, you worked hard for it and deserve all the festivities.  Don’t let any of them try to steal your moment!  You offered to rush to PR the day after graduation to be there for her wedding which is more than generous.   Don’t skip your graduation for them!   They’re not making any compromises for you at all.", "NTA.  Go to your graduation.  Also, appreciate your parents and let them know it.", "Absolute NTA. A graduation is an important milestone as well, and she's the selfish one thinking you should give up attending your milestone for hers. Your extended family sucks too for making you feel bad and demeaning your graduation.", "NTA and actually, your graduation IS more important than a wedding. A diploma is an accomplishment made up of hard work. Literally any adult can go get married right now without any effort whatsoever. From Polly’s selfish, self-involved behavior, you can make it to her next wedding, but you only graduate from college once.", "If this is all as recent as it sounds, is there a reason she can't move the wedding a bit? If it hasn't been booked and this is so damned important than it shouldn't be a problem. I have no idea why people are harassing you over this, you've made the right decision. You deserve to celebrate your accomplishments!!\nNTA.", "NTA. Your graduation is important to you, the two of you have never been close. You obviously won't have time to fulfill your bridesmaid responsibilities and being a bridesmaid can be expensive. Not a tough decision. Don't cave.", "My cousin who I was close to asked me to be a bridesmaid the day of my graduation. Nope sorry. Love you. I absolutely understand. Love u too. NTA", "NTA. The wedding and the graduation are equally important. Says a lot about the family to see what they value more. Obviously Polly’s parents would pick their daughters wedding, but op’s parents should pick her graduation. If Polly wants op to be a bridesmaid so bad, she could reschedule the wedding. Or she can just accept that sometimes people have other plans, which sucks, but it is what it is.", "NTA, you're not obligated to agree.", "NTA. She didn’t have to schedule her wedding for that week if it was so important you be there. You go enjoy your graduation. No one can take away your education that diploma will be valid forever. Your cousins marriage may not last. Don’t let anyone tell you she’s more important. \n\nAlso keep this in the back of your mind and when you’re planning a wedding make sure to schedule it for the most inconvenient  day of the year for Polly and ask her to be a bridesmaid. Then make the same stink when she says no", "Also college graduation is far more important than a wedding.  OP accomplished something and deserves a big party and for family to be there over a silly wedding. NTA", "And she still was planning on flying there right after her own graduation that her family wasn't planning on attending just so she wouldn't miss it.", "Totally agree.  NTA.  Congratulations on this major achievement!   your parents are right, and why would you want to stand in her wedding now?!?  She was horrible.  And I’m disappointed in your grandmother.", "I would argue, the Polly’s “wants” are 2nd tier wants.  Polly *wants* OP to be her bridesmaid. \n\nBut OP’s *wants* are first tier.  OP wants to be at her own graduation.  \n\nPolly’s wedding can happen without OP. Op cannot walk at graduation unless she attends.", "Maybe the OP can ask them to reschedule the wedding", "Not American, but I understand these graduations are a huge thing there.   If Polly  and bitching family were true family they'd recognise that surely.   It's not like they were joined at the hip best best bud cousins.", "My guess would be that she was counting on a certain amount of free labor, which makes it especially wise for OP to say no to this during her final year of school", "What kills me about this situation is that OP CAN attend the actual wedding ceremony - they just can’t arrive early/commit to all the bridesmaids obligations.", "This is going to sound very blunt but OP has spent (probably) four years to accomplish college graduation. Cousin met someone and said yes when they proposed. Which of these took more effort? So to demean OP's accomplishment is definitely the AH move, especially when the wedding date can be changed but college graduation cannot.\n\nAnd let's not forget that OP will be very busy in the weeks leading up to graduation with school and finals and everything. OP is smart to say upfront that they cannot be a bridesmaid because they can't be involved in all the things leading up to the wedding.", "Meh. Both are extremely important days in the persons life but insignificant for everyone else, except maybe their parents. \n\nAnd it depends on the person. My wedding was a much more important day for me than my college graduation.", "Graduating means you put in a lot of time and effort into achieving your goals and, depending on where you are in the world, may have gone into massive debt. It's a great accomplishment. All the bride did was convince someone to marry her, though based on her attitude, that may have been somewhat of an effort. Absolutely NTA, congrats!", "I'd even argue that OP's \"wants\" are really needs. She needs to focus on her senior year of college, and all that goes with it. She needs to focus on getting HER life in order so she can hit the ground running when she graduates. She deserves to attend her graduation in all its glory.\n\nOP's future may depend on how that senior year goes. Grad school, a good job- these things can come down to how much she focuses and gets shit done. Being distracted by someone else's wedding isn't her responsibility.", "That's what I'm saying. She can suck it up and be glad OP promised to attend at least.", "Could be a sentimental date or whatever. My grandparents got married on the anniversary of when they started dating, so something like that would mean a fixed date before the venue", "Right? But the family thinks she’s being selfish because she won’t sacrifice her graduation in order to, what, prep some wedding favors and show up for some nail appointments?", "Was someone else's wedding more important to you than your own graduation, though? Because that's what we're talking about here.\n\nAnd it's not just graduation day vs wedding day. OP is right that she will be focused on her senior year and wouldn't be able to give the bride much help or attention, which would surely be a BFD to the bride.", "It's not her wedding. Someone elses wedding is not more important then their own graduation that too years of effort.", "I mean, I have two bachelor degrees 😂 so I had two graduations and so far only one wedding.\n\nBut I agree that OP is NTA.", "You can get multiple degrees, so this isn’t a very good point.", "No? I literally said that both events are insignificant to everyone else but you and maybe your parents. The person I responded to made a blanket statement that in general, college graduation is more important than a “silly wedding.” I was just pointing out that that’s not always true.", "Yes that’s literally what I said. Your own wedding and your own graduation are significant to you. Someone else’s wedding and someone else’s graduation are not. I was responding to someone saying that, graduations in general are more important than “silly weddings.”"]}