{"id": 18507, "submission_id": "13v64b1", "title": "AITA for telling my mom there’s no way she’s coming on my vacation with me?", "selftext": "On mobile, TLDR at the bottom.\n\nSo, my boyfriend and I have been planing a week long getaway for about 6 months now. The trip there is going to be about 14 hours and we’re going to road trip it. My mom (since I live with her still) is adamant I won’t survive the drive there. I told her where we were staying to try and ease her mind because she’s a worrier. Rookie mistake. She bought a hotel room in the hotel we’re staying in, without telling me, and expects to come on the trip with us. When she told me she will be attending my week long romantic vacation with my boyfriend and I, I pretty much flew off the handle. I laid out all of my grievances about how despite the fact that I am a tax paying adult, she is still clinging on to me like I’ll die the second she lets go. My dad is telling me that while he understands where I’m coming from, I should have been more gentle with her because she’s just worried about me. However, I’ve been getting steam rolled on decisions my entire live and I feel like I’m entitled so spend the trip, that I paid for, the way I want to and not have to drag my mom on my vacation with my boyfriend.\n\nTLDR: planned a romantic getaway for my boyfriend and I, told my mom about where we were staying because I thought it’d ease her mind. Only to find out she booked a room in the same hotel and is expecting to come with us. Flew off the handle at her. AITA?", "created_utc": 1685393339, "permalink": "/r/AmItheAsshole/comments/13v64b1/aita_for_telling_my_mom_theres_no_way_shes_coming/", "score": 507, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I think I might be the asshole because I could have treated her more gently.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Get a different hotel. NTA. Don't let her invite herself.", "NTA. You planned a trip for two. You didn't invite her. It shouldn't be hard to understand.\n\n>I should have been more gentle with her because she’s just worried about me.\n\nBeing gentle hasn't worked so far as\n\n>I’ve been getting steam rolled on decisions my entire live\n\nYou need to be able to do things without her.", "NTA. Mom needs to let go. Don't explain yourself anymore. Just book a hotel at a different place and leave quietly. Do not let her tag along. That's cringe on a whole other level.", "NTA\n\nBook a room elsewhere. Don’t tell her. Don’t let her in the car.\n\nDad’s wrong, BTW. You don’t need to be gentle with someone who makes arrangements to attend your couples’ holiday.", "Wow at first I wondered if you were a minor from how she is acting but to read that you are an adult, even if you are a young one, NTA at all. She’s way out of line.", "NTA - change your reservations and your departure time.  Leave without telling her in advance.", "Info - why does your mom think you wont survive? This is clearly very odd behavior so is there some more context?", "NTA. That’s crazy. You seriously need to change hotel or even destination because she’ll sabotage it otherwise. Also don’t use life 360 or some other nanny tracker because she’ll use that too. If you’re all on the same cellphone plan, you can be tracked that way too. Bigger picture, you need a plan to get out on your own. This type of clinging and controlling behavior is not normal (albeit way too often seen in the era of helicopter parenting). Something bigger is at issue here, but if she won’t listen to reason, you need to break off or consider going low contact. Good luck.", "NTA. And now you need to alter your plans without telling her. You learned from your rookie mistake, lol, and now is the time to change a few of the details. You should book a different hotel. Perhaps you can be gone and out of touch for a few days before you leave, or leave a day earlier than she thinks you will. You need to go briefly very low contact with her. You can call her once you're gone and let her know you're OK, and as often as you want totalk to her. But don't feel any pressure to. You are an adult and you've been looking forward to this and you deserve a fun and romantic vacation. Without your mother.", "NTA. She needs to let you be an adult.", "NTA. Your mom is acting kinda nuts. Book a different hotel.", "Mom needs therapy. Her happening to be in your hotel when you arrive does nothing to increase your physical safety; this is obviously about her resistance to letting you cut the umbilical cord.", "NTA.  Tell her she isn't coming with you.  Change your plans.  Let her get to the hotel alone.  And find out you are not there.", "NTA.  You are still living under her roof and rules.  While you may be an adult, you haven’t forced her to really accept it by moving into your own space.   Not making an excuse for her because that was twisted.  Stand firm on this though.", "Nta, she's not controlling,  she's got issues.", "NTA, either find a different hotel or actively avoid her. Don’t talk to or acknowledge her on your trip", "Reschedule the trip and don't tell her. NTA", "NTA.\n\nThese type of parents will suffocate you as long as you let them. You need to create boundaries with your mom and let her know that she will push you as far as you can go if she doesn’t respect you and start treating you as an adult.", "Coming from a person who’s parents are super over protective get a different hotel and don’t let her come with you, I might not be a parent so I don’t know how it feels but I know how it feels to get invited or plan something just to have my mom tell me it might not be safe or if there better I can be doing with my time. At some point you have to live your life, you can’t be scared of everything or you won’t be able to grow.", "Over protective Mom here.  NTA.   I can understand you are upset.  That is fully justified. \n\nPlease take a deep breath and try talking calmly to your mother.  Remind her that you are an adult, and that she helped raise you to be safety conscious.  Assure her that you will call or text every day (and even use a password -- i.e., every text will include the word scenic) --but you are entitled to your independence.  You are not doing this to frighten her, but she needs to trust that she raised you with coping skills and situational awareness.  \n\nNeither of you will grow into a full ADULT mother-grown child relationship until you spread your wings accepting responsibility for your decisions and choices, and she accepts letting you make decisions and the occasional mistake.\n\nTake care and have fun.", "NTA for blowing up. Your mom was inappropriate. But it’s your fault you  keep living with them as a „tax paying adult“. That invites overbearing moms to act like this", "INFO: how old are you? Why do you say you're \"tax paying adult\" yet still live with her/your parents?", "How old are you, OP? \n\nDo you live with your parents, are they supporting you?", "NTA\n\nBut if you're feeling mean, take her with you on the drive there. Then lock her out of your room and don't answer. Take a day trip from where you are staying without her, or even letting her know. \n\n\nThen say how she was concerned about the drive there only, and now you've made it safe there's no need to babysit until you go back.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nOn mobile, TLDR at the bottom.\n\nSo, my boyfriend and I have been planing a week long getaway for about 6 months now. The trip there is going to be about 14 hours and we’re going to road trip it. My mom (since I live with her still) is adamant I won’t survive the drive there. I told her where we were staying to try and ease her mind because she’s a worrier. Rookie mistake. She bought a hotel room in the hotel we’re staying in, without telling me, and expects to come in the trip with us. When she told me she will be attending my week long romantic getaway with my boyfriend and I, I pretty much flew off the handle. I laid out all of my grievances about how despite the fact that I am a tax paying adult, she is still clinging on to me like I’ll die the second she lets go. My dad is telling me that while he understands where I’m coming from, I should have been more gentle with her because she’s just worried about me. However, I’ve been getting steam rolled on decisions my entire live and I feel like I’m entitled so spend the trip, that I paid for, the way I want to and not have to drag my mom on my vacation with my boyfriend.\n\nTLDR: planned a romantic getaway for my boyfriend and I, told my mom about where we were staying because I thought it’d ease her mind. Only to find out she booked a room in the same hotel and is expecting to come with us. Flew off the handle at her. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA\n\nShe can't go with you if you don't let her in the car...\n\nMaybe throw in a few uncomfortable reasons why she might not want to go...\"mom, it's gross you want to join your daughter and her bf on a romantic road trip. You know what couples do on romantic vacations, right??? If you have some kink, leave us out of it.\" You know, something to really make her skin crawl 😉", "Cancel her room for her, don't tell her.  Tell her you aren't going and you hope she's happy! Stay at your boyfriend's the night before you are supposed to leave ( calling the hotel telling them if anyone tries to cancel your reservations not to let them) and leave from there. \nLeave a day early. So easy peasy.", "NTA.  She is not concerned about you, she is trying to control you.  Don't let her.  Setup hard boundaries and don't let her cross them ever.", "NTA and please book a hotel somewhere else and for the love of dog, don’t let her come in the car with you.", "Ewww. Why does she even want to go.  That's just wierd.", "Your mother is very controlling. NTA.", "Just info: how old are u and your bf? Bc I could maybe understand if u are both 18 and maybe tell you to have a sit down convo with everyone including your dad, after you cancel her hotel, and maybe when u come back some counseling for both of you so it doesn't scalate when you are older. But if you are older you also need to get your own place, since u look like u have financial independence, and this would be for both of your mental peace.", "NTA but it would be super ironic if you died on holiday.  Please update us after to let us know you're ok.  :)", "I have never driven that long before and she’s convinced that I can’t do it. Even though I’ll be driving in shifts.", "I’m attending college right now and my mom doesn’t want me to move out. Mostly because I’m the youngest of my siblings and she doesn’t want to be an “empty nester” in her own words.", "I’m not comfortable disclosing my age but I live with my parents because I am attending college and my mom doesn’t want me to move. I am leaving in a few months against her wishes due to some factors I’m not comfortable posting.", "Nah, even at 18 they have a right to go on a trip and not expect uninvited parents. Otherwise responsible teenagers should be able to travel somewhere without a parent.", "I’ll make sure I don’t get murdered", "NTA - good luck, but its time for your mom to back off.", "She doesn’t get to cripple you because she doesn’t want to be an empty nester. Move out already.", "She can’t stop you. It‘s not up to her. You do not need her permission.\n\nMaybe consider postponing the trip until after you’ve moved out. It’s a lot easier to have autonomy without someone literally looking over your shoulder whenever you’re home.\n\nBtw I love road trips and driving, primarily because being in the car was the one place where I had absolute freedom. My recommendation is to stop every 100 miles to stretch your legs/pee/get the blood pumping. You’ll be much less tired that way. And if you feel sleepy at all, that’s when you pull over and switch drivers and/or take a little nap. Don’t drive when you're sleepy. And top off your gas tank when you get below half a tank, if you can combine it with a stretch/pee stop. The only reason I say that is because I’ve had a couple nailbiters where I was out in the middle of nowhere, trying to find a gas station while the car was on fumes.\n\nIf you follow those 3 rules, your road trip will be a blast.", "It’s just that if you are dependent on your parents-financially or for college or for someplace to live- it might be better- for your own good- to (and I hate to have l to say this!)- submit. Do they don’t cut you off. \n\nThey sound controlling. Controlling parents pull stunts like that.\n\nBut if you are an independent adult? Change those reservations. Hell, get reservations in the next town over. You don’t want your mama interrupting your vacation.", "Of course they should, but it would make a little more sense and yes sometimes we have to talk to our parents, and have the convo of I'm not a teen anymore. Even if you were LEGALLY obligated to take care of me last month and for the last 18 years, now u can relax. And also, talk about concerns not everything needs to be a fight or put under the rug or passive agresive, I'm a firm beliver in talking things out. But more so if you are just 18, bc AGAIN you are just becoming an adult and your parent is just becoming not responsable of you.", "NTA - do we have the same mom? She booked a hotel room and brought my whole family to my prom. She bought herself a folding cot so she could stay in my living room when I went to university. The only way I got her to back off was by giving her an ultimatum (she takes the cot and stops visiting so much or I put the cot in the garbage and she will have to sleep on the floor) about 15 years ago. She finally stopped after that. Change your hotel and don’t tell her to where. Time for some good boundaries.", "Nta but you need to get away from your mother. Her anxiety over you going away with your boyfriend is her problem. Booking a hotel and demanding to come along is outside of the realm of normal.", "Your mom's emotions are your mom's problem. You're not her therapist, her emotional support animal, or her punching bag. If she can't deal with her own feelings, that's her own damn fault. You are not required to change a single thing in your life because she's an emotional wreck. Absolutely do not let her come. This is absolutely the hill to die on. \n\nTell her to take the money from the hotel refund and spend it on a therapist. NTA", "NTA. My 21yo daughter and her boyfriend are planning a trip away together and you know what I did? I offered to pay for the 2 of them to do a nature boat tour that they wanted to do but couldn’t due to their budget.\nDon’t let her into the car with you.", "NTA. Most hotels let you cancel within a few days of travel.  Book one nearby and don't mention it to your mom. No is a complete sentence.", "NTA but omg girl move out. Don’t tell your mom any details about your life ever and make sure she knows that it’s because of stuff like this. Cancel the hotel your staying at and get a different one and inform her that if she tries to come on your vacation you’ll go no contact for a while and then follow through. Being worried isn’t an excuse to absolutely stomp over your boundaries.", "NTA: I am a 44f and live with my parents because of a duchy ex who abused me. My mom is narcissistic to the point where if I do something without her she’ll ignore me for days until I apologize to her for upsetting her. This is the narcissist way, when you apologize they take it as a win and will continue the behavior because they know we’ll always give in. If you allow her to come along you will be on a constant course of this. You do not owe her anything if this is your fear. I was in constant fear that she’ll disown me and I’ll have no where to go and therefore for many years I didn’t date, go out with friends, or make any kind of life for myself. For the last 14 years I have been in torture with myself because of this fear. Do not let it get this far. I’m finally put my foot down and I’m planning a trip this September without my mommy. Have a life, do the things, make mistakes and please don’t worry about upsetting mom!", "First, put mom on a permanent information diet.  Don't tell her your plans for ANYTHING!!!  Keep a suitcase at your boyfriend's place and smuggle out what you'll need over a few days to pack the suitcase.  You work, so have your boyfriend pick you up there the day before the departure date your mom currently has or go to his place to meet up and either travel an hour or two outside of town then stop for the night or stay at your boyfriend's that night then leave directly from his place in the morning.  Turn off your phone.  When you check in at the hotel, ask them to note on the registration that absolutely NO ONE is to be given your room number.  Hell, I'd even tip them to register me under an assumed name!  Or change hotels completely.  Leave your phone off.\n\nAt some point mom is going to figure out you aren't coming to pick her up.  She either makes dad drive her or takes a bus/train/plane or decides to cancel her reservation and sits home and stews.  Hopefully, the cost of getting there will be enough to prevent her following you - sneaking away is a pretty strong statement that you don't want her with you.  Wishing you good luck and a great vacation without mom.", "NTA- nobody want their MIL popping up everywhere. Lemme ask my mom first....holy shit.", "NtA. I'd ask her to get a room booked RIGHT next to mine, then have loud sex as much as possible to make it as uncomfortable for her as I can. Fuck I'd even say let's go get breakfast afterwards and wear a cum stained shirt lol", "INFO How old are you?\n\nIf you are an adult - just say no\n\nNo need for drama.", "Time to move out", "NTA. \n\nIf you can, I would think about moving out soon. Your mom is sounding more like a helicopter parent than a simple \"worrier.\" And get another hotel, but definitely don't tell her.", "NTA. Put her on an information diet. Stop telling her your plans.", "NTA - Time to put your mom on an information restriction. Unfortunately, this may also lead to needing to go low contact or even involve law enforcement if she refuses to respect boundaries. This is a sad and all too uncommon tale.", "NTA- My mom was fine with me traveling by myself locally but she flipped when I decided on Hawaii. The first time she drafted my aunt into going.   She was taking care of her husband who had cancer, talk about guilt. But the second time, I was all set. The Lincoln was pulling up to take me to the airport and she was trying to talk me out of going. I went and had a great time! \n\nMom has to learn to let go.", ">Get a different hotel.\n\nBut don't tell mom, let it be a fun surprise for her.\n\nNTA for.... every reason imaginable.", "It’s like trying to stop a bulldozer with a feather.", "Thank you for saying “helicopter parenting”. Plucked that term right out of my head. I may not understand fully what it’s like to be a parent (no kids) but good golly miss Molly this is a whole other level of “concern”.", "Are you guys south asian?", "I’d add: Cancel’s mom’s reservation and let her know once you are safely on the road. Text her this info then block her for a few days.", "Times are very hard for young people (among others) these days and OP is trying to get through college before launching. Parents should be willing to help without strings or not at all.", "How old are you OP?", "That drive isn’t even that bad honestly. Me and my husband travel full time for his job in an rv. After about hour 4 it’s like whatever.", "That's a her problem to deal with", "Submitting would worsen their mother's attachment issues and strain the relationship to the point where the entire thing implodes and is ruined. It would be unfair to both OP and their mother. Financial dependence or not, this is not sound advice. I'm saying this as someone with direct experience with it.", "NTA. Tell her that if she wants to play third wheel for someone else's week long fuckfest, she's gonna have to find a different couple to creep on.", "NTA - Tell her  you have changed your hotels and aren't going to tell her which one. But don't go through that effort and keep your original hotel.", "NTA. I relate to your experiences with your mom a lot. The tension from constantly being steamrolled and frankly disrespected in the name of your mother’s anxiety and overprotective worrying really does build up. It’s not your responsibility to make her feel comfortable, it’s her responsibility to learn to let go.", "NTA\n\nSpoiler Alert... it's super easy to cancel hotel reservations at no cost with ample notice.", "NTA\n\n> She bought a hotel room in the hotel we’re staying in, without telling me, and expects to come on the trip with us.\n\nWHAT\n\nFor the record, I think it’s reasonable to assume someone isn’t going to be inviting themselves along to your vacation - and for safety reasons it is a good idea for people to know where you are staying.\n\nFrankly she WAY overstepped, and sounds like this blow up has been a long time coming. Some parents don’t get it or dismiss more gentle no’s as unserious and easy to override.\n\nWorry isn’t an excuse to pull this stunt. And if she’s worried to the point of not being able to function, then she needs to seek treatment - not permission to smother you.\n\nAnd book a new hotel (and tell a trusted friend) \n\nAs for your dad - if he understands where you are coming from he could do a better job of advocating for you instead of enabling her.", "NTA. Let mom know you won’t be sharing a car with her.  Can you stay at bf’s place the night before you leave?  That way mom doesn’t know when you hit the road.  Make sure hotel knows to not give your room info to mom.  Don’t tell mom any of your plans, especially not sexy time plans, you don’t want her to know exactly when to knock on your door.", "She's not just an adult, but a tax paying adult, so she makes enough income to pay taxes btw. Her mom should be happy for her instead of getting in the way of her happiness", "So treat protective mothers as children since they have the same levels of logic and emotional intelligence. Got it.", "My relationship with my parents improved a LOT after I moved out - even if it was just because I didn’t have to hear their constant worry that was a form of putting me down. I hope the same is true for you as well :)", "Gently please.  I am overprotective because I am, by nature, a worrier and because I work in law enforcement, and I have been exposed to a lot of depravity in my life.  My husband and I raised several children,  including two strong independent women.  Even though I raised all my children to be strong, their first steps out of the nest were still hard for me.\n\nYou know nothing of OP's family life, her mother's role in raising OP, whether there were other children or family losses or other dynamics involved.  I just suggested that a more understanding approach might help them both.", "Yeah, I was the baby and my mother was not thrilled by my leaving home. She didn't hinder me, mind you, and once I made it plain I was making plans, she helped out by finding inexpensive used furniture. But she REALLY didn't want me to go.\n\nIn retrospect, I kind of understand why. She and my father lived with my grandparents when they were first married, and had their first two children before they moved into their own place. In other words, in all their years of marriage, they had never lived alone until after I left. Big change for them!\n\nYour mother will survive empty nesting.", "Yup. I’ve driven multiple times with my husband and kids from California to Georgia, which is a 39 hour trip. OP, you’ll be fine.", "You can't use \"because im a mother\" to just overstep boundaries whenever you want. I don't care about OP's family life and i don't need to to know its totally out of pocket to invite yourself on your kids holiday with their partner. This is also just the tip of the iceberg according to OP since her decisions have consistantly been steamrolled per her own admission.\n\nAnd yes your understanding approach is to treat mom like a child because they're acting like one.", "NTA\nI assume your an adult so it’s not like she’s needs to chaperone you guys.", "That’s batshit crazy. NTA, and your mother should be reigned in by your father, not by you.", "NTA\n\nCancel the hotel booking and get a different hotel but don't tell her", "NTA.  If she is worried about you, let her track you on Find My Friends or a similar app.  Even though our children are in their twenties now, we are all still able to see where the whole family is at any given time. It has been a really great at lessening worries when one of us travels, doesn’t check in, return calls, etc.  If I can see where you are, I won’t worry. \n\nOur kids just used Find My Friends to keep track of us when we went on a road trip.  We are “old now (51 and 59)” so the kids like to make sure we are okay. It’s hilarious!!!", "It doesn’t matter if your mom is genuinely concerned about you, she’s being controlling and that is not ok", "NTA. Simply do not allow her to get in the car. Leave earlier than planned, and change hotels.", "You'll be ok!  I have chosen family that lived 12 - 15 hours (depending on traffic in a major city I have to go through to reach them) away, and I've done it multiple times over the years - always alone and in one go/no overnight stops.  My mom kept telling me I couldn't do it in the months leading up to the first drive, but proving someone wrong is a great motivator!  \n\nYou'll be with your boyfriend, so you two can help motivate and care for each other.  Have fun with the company and enjoy the sights!  You two can do it!  🥰  Conversation and tunes/audio books definitely help the time pass quicker.  After this, you'll have an example to throw at your mom when she tries to put you down too.", "Does your dad do all the driving by any chance!?", "My mom was abusive and exactly like this. She actually booked a room in the same small b&b on my wedding night. As soon as I found out, I made a different reservation. It was almost comical - if it wasn't so sad.\n\nYou are more than capable of living without her, and that's why your mom is acting this way. She's trying to retain control of you.\n\nI don't mean to worry you, but make an exit plan. Make sure you have your important documents. Make sure your mom doesn't have access to your money. Don't tell her in advance before you move out. It will all be okay and so will you, but it helps to be prepared.", "FYI I am young and still in school too… when I realized my mom couldn’t treat me as an adult, I got myself a job and moved out. It’s tough but my relationship with my mother is much better \nOf course parents should support their kids, no questions asked. But that’s in a perfect world. after all they’re human, so they have flaws and are sometimes AH like mom here. Being an adult means taking responsibility. I rather push myself than complaining that life isn’t fair like a child", "I have the same question.", "In the OP she says she's an adult, but even if she's 18 and fresh out of high school, this seems like a bit much.", "Once I was trying to get to the lone service station in this rural English town and the DAMNED ONE WAY SYSTEM really took it all up a notch. So close and yet so far!!", "NTA", "NTA...your mom and dad are both stepping over boundaries. Your mom's behaviour is NOT normal! They both need to see that and act accordingly.", "BAHAHAHA that's terrible!", "NTA\n\nThough you may want to change the date/destination or at the very least, the hotel. Just give that info to a trusted friend.\n\nMake sure you’re not on any ‘find my phone’ family apps with your parents. \n\nAnd check in with a daily text. That should be more than enough.", "NTA\n\nIt’s time to stop sharing information about your life with your mom. She has shown you over and over again that she can’t be trusted with it.", "NTA - this is overbearing and honestly quite disrespectful of her. I get she worries but what’s wrong with a call or text here and there? Not all the time like but wow you need a break and a life to yourself", "Are you my long lost sister? Because my mother does this exact sort of crazy shit, and I can tell you it does not get better unless you put your foot down HARD. Example: my mother was utterly convinced I would not survive a trip to Bali and would be \"blown up by terrorists.\" Thinking to reassure her, I made the mistake of texting her from the airport to say we would message her to when we had arrived safely at the resort. She immediately went crazy and phoned a friend of hers who she knew had a son who worked at the airport newsagency, demanded his number (\"It's an EMERGENCY!!\") and phoned him begging him to get over to the departure lounge and stop us boarding! Your mother will be pulling precisely this sort of utterly insane stunt unless you put her on a complete information diet. Tell her nothing. She will scream and cry about being \"shut out\" but it's the only way I've been able to keep my sanity with her.", "NTA\n\n&#x200B;\n\nChange your reservation, but dont tell her. And just leave.", "NTA - I would call and cancel your mother's reservation", "Agree and let her take care of her own transportation. Do not take her with you.\n\n Leave with your bf in the car without your mother - go stay at the bf s house the night before. \n\nIgnore her when you are there if you  don't/can't change hotels and go on trips without saying anything other than good day and goodbye.\n\nNTA", "\"Yes, I *did* make a reservation for that room\" (that I then canceled)", " NTA.\n\nTell her you’re going to have wild sex half of the trip, even stop to go at it in the car on the way. I’m sure that would change her mind.\n\nBut seriously, what she’s doing is not okay. She has no right to invite herself to come with you guys, especially without asking. You’re an adult, doesn’t matter that you live with her. She can be worried and that’s okay, but she needs to let you live your life and make your mistakes in the future. I think it’s good that you were harsh, otherwise she wouldn’t have listened at all. If that hurt her feelings, she should take a long look in the mirror. This situation is not your fault in any way, so try not to feel bad about it.", "What your mom did is so utterly unacceptable that I can see why you'd fly off the handle.  She's not \"just worried about you.\"  Following you on your romantic getaway would be intrusive, inappropriate, infantilizing, and reflects a real problem with boundaries.\n\nAssuming refundable, you might want to book into different hotels and slightly change your schedule without sharing the specific info with her, as it's entirely possible that even with your firm limit-setting, she'll still show up down the hall of your lodgings.\n\nNTA", "Perfect time to set hard boundaries or she’ll never let go.", "NTA\n\nYou need to move out of there...", "I wonder if the parents see red flags op is ignoring?", "From some of your other posts I think your mom has a point of not allowing g you to go alone. NAH.", "Different hotel, in a different city!", "There’s an entire subreddit devoted to this. /r/helicopterparents", "Nope, Canadian. good to know the insanity crosses cultures.", "It has to happen some time. Does she expect you to live at home until she dies?!"]}