{"id": 18517, "submission_id": "13veelp", "title": "AITA (as a woman) for not agreeing to drive the whole 1 hour for a date", "selftext": "I’ve (20F) been talking to a guy (22M) , on tinder for 2 weeks. He’s a total catch. He always talks about hanging out in the future and initiates calls/ texts single everyday. However, when I suggested we meet in the middle, he preferred if I drive an hour to meet him at this apparently super good restaurant near where he’s from (20 minutes). I excused it because he told me he is very inexperienced and never even had a girlfriend. Also he says he’s really overwhelmed with his new job. But I can’t help, but feel a little turned off. But I also know it’s 2023 and I should be more progressive and open. So AITA for disagreeing to drive the 1 hour", "created_utc": 1685415060, "permalink": "/r/AmItheAsshole/comments/13veelp/aita_as_a_woman_for_not_agreeing_to_drive_the/", "score": 71, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > (1) I disagreed to drive an hour to meet a tinder match partly because I’m a woman \n(2) It’s 2023 and maybe I should be more open and not rely on traditional gender roles\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Nta. If the dude won't meet you halfway for the first date he will never meet you halfway on anything. He's not a catch. Throw him back.", ">He’s a total catch\n\nNo, honey, he's not. \nNTA", "NTA - he's still a stranger, and you suggested somewhere in the middle. Insisting on someplace way closer to his home for the first date is pretty thoughtless(or just lazy) at best, to being on the dangerous side if he tries getting you drinks then wants you to come to his place.\n\nAnd I'd say the same thing if genders were switched. People can be crazy, and/or dangerous.", "NTA. I'm not sure why your gender is relevant, but you certainly aren't obligated to drive farther than you would like. For a first date, meeting in the middle would definitely be reasonable, and it's kind of a red flag that he's so adverse to this compromise. Btw, why do you have your distance set to include places to which you're not willing to drive?", "NTA.\nIt’s not unreasonable to suggest something more mutual for a location.\nHe may be inexperienced but it’s more notable that he’s not amenable to making sure you also feel comfortable with decisions.", "NTA- He’s not a catch. A catch would agree to meet in the middle of a first date. Then if the date goes well, plan a future date where he takes you to the restaurant he wants to share with you. \n\nIf he is overwhelmed with his new job, he really needs to take a hiatus on dating until he’s settled into the job itself.  \n\nAnd it’s not being “progressive” to not want to do something, it’s having standards. If you’re feeling turned off, listen to that feeling. You wouldn’t be wrong for declining the date altogether and moving on", "NTA - but you gotta figure out if an hour is too long of a distance. Is it just cause it’s a first meeting? Like if this actually went somewhere, are you always going to be opposed to driving out to him?\n\nAre there any alternative restaurants you can suggest instead?\n\nETA: changing it to NTA from NAH cause I can already see where his attitude is going.", "So no one is the AH here. \n\nJust a suggestion, but this is how I live my life… \n\nI ask myself “based on what I know right now, is this man worth an hour drive to meet?” \n\nIf the answer is no, then you don’t go, and there’s no point continuing the conversation, cause that is not your future husband. \n\nIf the answer is yes, then just make the drive and meet him. \n\nOnce it’s over ask your self “was he worth the hour drive?” \n\nIf the answer is no, there’s no point in continuing the conversation, cause that’s not your future husband\n\nIf the answer is yes, then he’s likely worth having a discussion about a fair commute. \n\nIf at any point you feel like it’s not worth the effort for you to do “the thing”, then release “the thing” to the universe and let her deal with it…", "NAH. Maybe suggest somewhere halfway for the first date and if it goes well take it from there?", "Not the asshole!  For a first meeting and he’s not willing to compromise on anything you dodged a bullet babe, keep running!! Good for you!", "NTA\nYou suggested meeting in the middle and he is insisting on something that is more convenient for him. I would think this is unreasonable even if you weren't a woman. \n\n\nFor a first meeting, something more neutral makes more sense.", "NTA and who asks someone to drive an hour for their first date?  You were right to ask to meet in the middle, and I'm doubting he's as much of a catch as you think.  I also doubt he's never had a girlfriend. It's more likely he's never had a girlfriend for long, or that he's never made it past that first date.", "Regarding it being 2023 and being progressive, that's about having the -choices- that you didn't have before when it comes to roles. \n\nYou can still enjoy having a guy \"woo\" you with his efforts if that's what you like, and there's nothing wrong with that. Many guys still like being in that role. Progress just means that if you wanted the relationship to have a different dynamic, that's cool, too.\n\nSo yeah, if you don't want to drive 1 hour (I'm guessing it's 2 hours including the return trip), don't do it. Let him do the drive if he thinks you're worth it.\n\nNTA", "NTA - he wants you closer to his apartment for after dinner activities. Meet in the middle", "NTA.  A first meeting should be on neutral ground.", "NAH. You are NTA for wanting to keep a date within an area you're comfortable and safe in, that also won't put you out too much. That can be the difference between going on the date or not for most women.\n\nHowever he's also NTA for suggesting a nice place and wanting to impress you. You probably both think of each other as a catch but he may not realise the importance of or have the resources to meet you half way. But you WNBTA for requiring a date closer to your location.\n\nGood luck OP!", "YTA: from my point of view it seems like you aren't ready for a real relationship. They take work. He's a catch who wants to take you to an awesome restaurant but needs flexibility to maintain a job that allows him to pay for finer things. And you can't be arsed to drive an hour? I drove across the literal u.s, ocean to ocean, to be with my partner for a week. Come on, either put in the bare minimum effort or accept that you need more time to mature and find yourself. Stop fishing.", "NTA. While it is the modern era and genders are \"equal,\" that means effort should be shared 50-50. If that's his favorite restaurant, it can be saved for another time. A more balanced compromise is needed for the first date.", "To be honest, I'd be wary of him in future.  I had an ex who made me drive everywhere.  We once had a function at a place that was literally at the end of my street.  Ex made me drive the 20 minutes to pick him up and drive back to the function, then drive him home afterwards.  So, an hour and 20 minutes of driving to a function I could have walked to.", "NTA.  Best to meet for the first time in a public place closer to where YOU live.   If he’s legit you can go to the nice restaurant another time.   If he’s a creep irl, he could be trying to lure you away from home to have you at a disadvantage.  He may seem like the real thing online but you don’t really know.", "Why are you talking to a guy this far away? I do think you're kinda YTA if you've been talking to this person knowing how far away he is, and not being willing to travel.\n\nI'm nervous for you, though-- travelling this far when you haven't met him before. Also, it might low-key be a pink flag that he's never dated anyone (or he says he hasn't). All that together, I would say that, yeah, keep your safety front-of-mind. Insist on meeting closer to home for the first meeting.\n\nIf he doesn't understand the importance of you feeling safe, he may not be the person for you.", "NTA but I don't understand what being a woman has to do with this. No matter what sex you are, both parties need to meet in an agreed location somewhere around the middle.", "this has nothing to do with your gender, OP.  first meeting's definitely should be somewhere neutral, and preferably in the middle. you said this person doesn't have experience dating so *maybe* it is a genuine awkward mistake, or maybe it is a play. go slow. your safety is PRIORITY. 🖤\n\neta: NTA", "Since he says that he's very inexperienced, enlighten him. He will meet in the middle or not meet at all. Sounds like a power play, especially from a Tinder guy. \n\nNTA but when chatting with guys from dating apps, know what you want and don't compromise if you don't want to.", "Maybe I'm paranoid but this sounds sketchy to me. He's 22 and never had a girlfriend wants you to drive to his home town where you may not know your way around or have friends leaving you vulnerable. I feel like this will be one of those bad stories you here on the news. NtA and he's not a catch, he may be a creep.", "Edit: I know this seems really silly, but I’m worried if I drive an hour that’ll make me seem desperate since that’s what my mom always told me growing up", "NAH - an hour isn’t a big deal.", "YTA. Meet him there then next date have him come to you. Simple", "NTA - Read this aloud to yourself for perspective and pump the breaks", "NTA\n\nDont settle for this one.", "Meeting in the middle puts you on neutral territory a good place to start.", "What do you think makes him such a catch? Because he’s not acting like one.", "NTA, what you are experiencing is millions of years of BS detector evolution. It's telling you something is wrong with your \"catch\". It's a catch and release situation.", "NTA you are not a pizza. Don't deliver yourself to him.", "NTA, the first thought I had was why does he want you closer to his home? As for his \"inexperience\" with women, some men say that crap so you'll think it's cute and you'll trust him more. These are real red flags and you should just drop him off of your radar.", "He probably just excited to take you to a nice restaurant...a hour is not a big ask IMO.", "YTA. Why engage in conversation with someone if you're not willing to make the drive. Seems silly..change your distance settings.", "NTA. It's not so much that you would or would not make the drive but that you would be traveling quite a distance to meet a stranger. It's a safety thing. He should be willing to come to you, in a public location in which you feel comfortable.", "NAH, he's allowed to ask, you're allowed to decline.", "He’s definitely not a catch - he’s a 🚩\n\nFor a first date (and second, third, etc) it should be about  meeting each other and spending time together. That shouldn’t depend on one person driving an hour away - especially the first time you’re meeting up. Don’t make the drive. Time to go back to the apps", "It's easier to get you back to his place afterwards if you are in his town.  NTA", "NTA.  You should be either meeting in the middle or he should be coming closer to you for a first date. While you have been chatting for only 2 weeks, him texting daily sounds a bit off and needy. The important part is that you should feel comfortable and if this is bothering you then listen to that little voice.", "NTA\n\nHe is not a catch. He is just good pretending…", "NTA,  but you may miss out on a great match. What is an acceptable amount of driving time for a date?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI’ve (20F) been talking to a guy (22M) , on tinder for 2 weeks. He’s a total catch. He always talks about hanging out in the future and initiates calls/ texts single everyday. However, when I suggested we meet in the middle, he preferred if I drive an hour to meet him at this apparently super good restaurant near where he’s from (20 minutes). I excused it because he told me he is very inexperienced and never even had a girlfriend. Also he says he’s really overwhelmed with his new job. But I can’t help, but feel a little turned off. But I also know it’s 2023 and I should be more progressive and open. So AITA for disagreeing to drive the 1 hour\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "He still lives with his family so I’m not sure if he could even try to hookup", "NTA and Girl don't do it. The plan is to take you somewhere close to his place so it's easier to convince you to go home with him.", "NTA\n\nMeeting in the middle is no good if you are left with no good place to spend the time. \n\nWhen it comes to this guy, the questions are:\nIs it really so much to be the one with the longer drive? (20min for him, 60min for you. So it would still be a 40min ride for you of you met somewhere closer to you) \nWhat if he turns out to be a jerk IRL? (Would it make a significant dent in your budget if you had to drive 20 min longer)\n\nAnd with asking her you've kinda answered it. You don't want to drive a hour, so don't do it.", "NTA. Unfortunately in my experience, people who insist on you doing the driving either don’t have a license now or never had one.", "NTA. Meeting somewhere in between is what most people do for a first date/meeting. This gives me the ick.", "If it doesn’t seem worth it for either of you, then maybe it’s time to unmatch.\nNAH", "NTA you don’t have to have had a girlfriend to have a basic concept of fairness. Wanting to meet halfway is not being non-progressive. Y’all haven’t even met in person to determine if it’s worth an hour’s drive to you to spend time with him. \n\nFrankly, if he doesn’t want to figure out a way to put in his share of the effort for the first date it will not get better from here. It’s also pretty likely he wants you to drive to him because he wants to try to get you to go back to his place and/or he’s only interested in low effort arrangements and will quickly move on if that’s not what you provide him.", "  \nFirst off either way NTA but I would like more information. Did he straight go no I am not doing that? Or was this a hey this place is great type of suggestion not really thinking about distance? If you say hey I would like for us to meet halfway for a first date and he is hard against that then blah not a catch bye.   \nIf he realizes the mistake and is down to meet halfway then I might give it a pass this time.", "Just because you caught him doesn’t mean he’s a catch!", "I would be willing to drive 1 hour if it works out, and I kind of expected most guys  would at least agree with meeting in the middle. But I guess not", "I honestly don’t mind driving an hour at all especially if it works out, but I’m unsure about doing it for the first meeting :( Where I live is remote so not much places. But there’s a lot of places in the middle, apparently he’s too busy to drive for that (but I have more time than him, so I feel pressured to drive to his area)", "I feel like the guy gets some benefit of the doubt here. He says he's inexperienced. He probably picked that restaurant hoping to impress her and is missing the bigger picture. It was a counter offer. I wouldn't call dude an AH unless OP restated her preference for middle ground and he was out of line in refusing. I chalk this up to the learning curve personally.", "Yeah I am not sure from the post if he is straight up saying no I am not meeting you halfway. Or he simply was suggesting a place he knew was nice which happened to be farther from her.   \nI think? she is saying its a 20 min drive from him which from his side of things is pretty much the same as the 30 meeting her halfway so he might just not be thinking about her drive too much and focusing on \"I know a great place!\"", "Wow I want to fight this guy.", "But then that also goes the other way around doesn't it? Somewhere in the middle makes more sense.", "Dude definitely has AHish behavior, but not dating anyone at 22 isn’t exactly weird. Like that’s still really young.", "Why is she an AH for not wanting to travel all the way to him when he's just as far away, he could be offering to drive to her as well?\n\nShe offered to meet in the middle, which is logical for a first date. Nothing wrong with starting slow.", "Seeming desperate is not the issue here. Safety first.", "That's antiquated. I don't think you should drive that far bc it's unfair, simply. I hope the other comments haven't convinced you to cancel. You like the guy, and he's inexperienced. Give him one more chance to understand your need to meet halfway. If he reacts poorly, you save yourself a lot of time, gas, and trouble.", "Driving an hour for the first date is a bit of an ask since it’s pretty unlikely there aren’t any other places closer to both of you. Sadly suggesting a place really close to his can be because it’s his favourite restaurant just as easily as because he wants a hookup and thinks being that being far away from your home and near his makes it more likely:/\n\nIf he’s already making you feel uncomfortable then that can be a hint not to meet him in person.", "It’s unsafe and unreasonable. You gave him a very reasonable and fair option. If he can’t be fair and reasonable now, why would he later? He’s not a catch if he can’t even be slightly inconvenienced by driving a few minutes but thinks you should drive twice as long. Don’t do it!", "NTA, don't invest that much in the dude. Absolutely this is part of his tactic to keep you around on the date longer. 'Well, you're already here, no reason to drive all that way back'. He's just trying to stack the deck in his favor", "There’s also a possibility we don’t click and don’t have a second date. That’s why I want to meet in the middle.", "is it tho? From what I can tell she is saying the place is a 20 min drive from his house. Meeting her halfway on a 1 hour drive is only 30 mins so..... seems like not much of a difference (on his end anyway) as far as distance from house is concerned.   \n\n\nHe may jsut be getting excited and kinda got ahead of himself with going \"Oh! I know a great place for a date!\"   \n\n\nI would address it with him that you need to meet somewhere more middle ground first and if he is hard refusing then I would agree with you.", "She’s willing to if a relationship develops a bit. She doesn’t want to do it on the first date and I don’t blame her a bit.", "Yeah I forgot it only goes one way.", "You could ask the same question about him.", "Okay 1. Does he have a car? 2. Does he live in a major city and you live in a more rural place? Just thinking I used to live in a rural place about 30 min away from a big city and if I was going to go out with someone who lived I'm the city it would make way more sense for me to to there then to end up at the Chili's in a random suburb.", "No he didn’t say directly, but he ignored my suggestion when I texted him and then later said he would prefer to meet at the place closer to him. Of course, after reading these comments I’ll have to talk with him and be more firm that I want to meet in the middle", "Decent guys do. Lazy guys don’t.\n\nDon’t lower your standards.", "INFO: Is it because he is a guy? I really don't get the gender-ancle on this one.", "He’s not as good of a catch as you think. Half way would be 30mins vs the 20mins that the current place is. If he’s “too busy” to drive an extra 10mins each way, then he’s not even willing to put bare minimum effort into things.\n\nIt also means that he’s never going to be willing to drive the hour to you. He’s always going to expect you to come to him.", "If he’s willing to drive 20 minutes but not willing to drive 27 minutes to save you 30, he’s either full of shit or he doesn’t have enough time to be dating you. Just say, “hey, I’m not comfortable driving so far for a first date. It’s not much difference for you to go to that place or somewhere in the middle, so if you’re too busy we can just wait until you’re able to meet in the middle, but it’s only about a 10 minute drive different for you where it’s over an hour for me. I understand being busy but for the first few dates I definitely want to meet halfway.”", "INFO: How far from each other do you live? If you would be driving 60 minutes and he would be driving 20, it's 80 minutes apart.", "Hahaha.  When he broke up with me, I laughed.  Apparently he was pissed with me for years afterwards because I didn't beg for him to come back.  His mother was pissed that he didn't marry me.  I'm pissed I wasted 3 months on him.", "Sorry but it doesn’t go the other way around because women are more likely to be victimized.  However as she could also potentially be a fake it always make sense to meet in a public space on neutral ground.", "Agreed-- my first bf was at 21. My point was more that coupled with his hesitancy to travel towards OP. Maybe it indicates a lack of willingness to invest, and maybe it indicates something sinister.\n\nMost likely nothing, though. But I do think OP should listen to their spidey sense", "1.) Yes, he has a car and he drives an hour for work in the city \n2.) That makes sense the his place does have more stuff to do. But so does the middle. Even for past dates they were always willing to plan something fun to do together in the middle or even closer to my place", "I grew up in a conservative household, so I’ve mostly been taught that the guy should show more chivalry when courting. But, currently I think it should at least be equal in effort", "He lives like 53 minutes away", "Yeah especially for people of tinder, MINIMAL effort they are total strangers. I leave it borderline serendipitous for tinder first dates, if you guys like 40 minutes to an hour away from each other no questions asked you’re meeting halfway for at least a few dates.", "I'm going for NAH. I think you should meet somewhere on the way. If he drives 20 minutes in your direction it's 'only' a good half hour on your part. If I were you I would find a nice place I was comfortable with both in distance and atmosphere and suggest meeting there. Within a ~20 min radius of him. \n\nI don't necessarily agree with most here saying that he will never meet you halfway if he doesn't do so in this case. That's my two cents.", "Man you’re in for a world of disappointment. These guys these days want the roles reversed, i.e. this guy meaning they want you to put in more effort to date them. It’s horrible", "Thanks - so he's not suggesting a restaurant on the route to your place? That's a bit odd.", "We both went to the same university, so he wanted to pick me up at the campus since he thought I would be familiar with it?? Idk his logic because there’s places in the middle I’m also familiar with", "Don't let him pick you up anywhere. Choose a restaurant a meet directly there. And I'd say meet halfway. I second what others have said, if he doesn't put in a bit of effort for the first date, what can you expect later? I'm going to sound like a granny, but be careful. Let a friend know where you'll be meeting a plan the old text/call to see in case you want an excuse to get out. I hope he turns out to be a great guy, but it's always better to have an exit strategy just in case.", "*never* get in the car with someone on the first date. Always meet in public until you feel comfortable enough with a person and always make sure someone you trust has your location."]}