{"id": 18531, "submission_id": "13vija2", "title": "AITA for calling my cousin by her Tinder name?", "selftext": "background story:\na few years ago, my brother (m20) had tinder on his phone for some reason. i (f18) was at the movies with some friends when i got like 7 missed calls from him. he left a voicemail and he sounded very frantic/hysterical. i got home and he nearly threw his phone at me. i looked at it and i saw our MARRIED cousin's (f31) profile under a different name. i scrolled through the account and it really was her. she had inappropriate photos/videos on there (i'm traumatized to say the least.) and she lied about her age. (she said she was 26/27). i was kind of in denial for a bit and didn't want to believe it until a few days later. we were in a car together and i saw her phone unlocked on a separate homescreen page that had tinder on it. i dont think she saw me look at her phone but when she saw that her phone was unlocked she quickly snatched it and turned it off. \nin 2020 or early 2021, she was going through a rough patch with her husband and they separated for a while, and were about to get divorced. i'm not sure if thats when she got it, but in her religion she is not supposed to be with any man for a few months after separating from her husband. (in case she was pregnant or something) but instead, she was flying out across the country to meet up with random men, and her excuse was that it was a \"work trip\"\nmy brother and i swore to never tell anyone about this because we did not know what to do with the information (yes, it was wrong to not tell the husband right away. i 100% admit that.)\ntheir marriage ended up well and they were doing okay for a while. \nrecently, this specific cousin has been preaching her religion onto me and was arguing with me because i said i would not pursue anything religion-related because it is not my priority. i am focused on college (i'm a STEM major and i have 0 time for myself, let alone pursuing credentials for something i'm not even remotely interested in.)\nthis is not my proudest moment, but i ended up getting irritated and said \"you're the last person to be preaching religion onto me (tinder name)\" in front of our entire family.\nher face dropped and she got quiet, but everyone around us was confused.\nher husband looked at her all confused and asked why i was calling her that. she quickly left without saying a word and i stayed quiet for the remainder of my visit even though i was bombarded with questions. i ended up having to tell my mom and she said that i should not have said that. i told my brother over the phone and he laughed so hard he almost cried LOL. i kind of feel like a dick but at the same time i dont because she needed to either stop talking to me about religion or be humbled. if she ends up telling her husband (which idk if she actually will because she lies and manipulates people for fun) their marriage might blow up and i kind of dont want to be the reason for all that. i am already struggling so much with other things and i just dont need even more negativity in my life. \nso, am i the asshole for calling my cousin by her tinder name?", "created_utc": 1685428150, "permalink": "/r/AmItheAsshole/comments/13vija2/aita_for_calling_my_cousin_by_her_tinder_name/", "score": 29, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > i called my cousin by the fake name she uses on tinder to get her off of my ass\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nAll you did was flip her sanctimonious rant right in her face. And it was well deserved, and delivered well. Good job OP.", "NTA\n\nShe made her bed(s), she can lay in them.\n\nYou didn’t out her maliciously, it was in the heat of the moment with her badgering you. Also, you didn’t come out and say it all to everyone either. You found the info inadvertently and didn’t have a real obligation to keep her secret to begin with. She’s the duplicitous one.\n\nIn theory, you could have spoken to her at some point when you found out, or kept your cool when she was hassling you, but I don’t think you’ve done anything wrong.", "If you and your family is the religion that I'm thinking you are (same as mine, and it's the only one I know where women can't be with a man for a few months post divorce) then I say good for you for throwing that right back to her face.\n\nTechnically you didn't out her in public or humiliate her directly, but she knows you know she's not so holy either and perhaps now she would look inwardly and learn some humility. So NTA and I would probably be like your brother and laugh my A off if I'm one of your siblings/ other cousins", "NTA. Although, debatably for not telling husband. \n\n She’s dealing with consequences of her own actions 🤷🏼‍♀️", "slay, but i'm petty, so don't trust me at all. But yeah, slay", "INFO: was her Tinder account and hookups with other people limited to her separation or did she actually cheat on him?", "Whoooa that's some serious fucking around and finding out, like quite literally\n\nNTA\n\nIf she hadn't reacted so guilty after you called her by her Tinder alias, everyone would have missed it. She  still has a lot of catching up to do with her husband.\n\nI mean cheating is bad enough but to go on Tinder with your own pictures is just asking for this to happen. Derp.", "Paragraphs and Tl:dr", "NTA she’s a holier than thou hypocrite.", "I laughed with your brother I’m sorry lol", "I was so prepared to say Y T A and that it was none of your business especially since they were separated at that point. However when she threw the religious stuff into it and wouldn't stop I changed my mind. NTA and she shouldn't throw stones when she lives in a glass house.", "ESH. You are too judgy about her sex life. Why would you tell her husband about her sex life AFTER they separated? That’s not your place at all. But the comment was ok. If she keeps pushing your boundaries, she has to expect being called out for her double standards. However, your whole family sounds so judgy and not loving with each other at all…", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nbackground story:\na few years ago, my brother (m20) had tinder on his phone for some reason. i (f18) was at the movies with some friends when i got like 7 missed calls from him. he left a voicemail and he sounded very frantic/hysterical. i got home and he nearly threw his phone at me. i looked at it and i saw our MARRIED cousin's (f31) profile under a different name. i scrolled through the account and it really was her. she had inappropriate photos/videos on there (i'm traumatized to say the least.) and she lied about her age. (she said she was 26/27). i was kind of in denial for a bit and didn't want to believe it until a few days later. we were in a car together and i saw her phone unlocked on a separate homescreen page that had tinder on it. i dont think she saw me look at her phone but when she saw that her phone was unlocked she quickly snatched it and turned it off. \nin 2020 or early 2021, she was going through a rough patch with her husband and they separated for a while, and were about to get divorced. i'm not sure if thats when she got it, but in her religion she is not supposed to be with any man for a few months after separating from her husband. (in case she was pregnant or something) but instead, she was flying out across the country to meet up with random men, and her excuse was that it was a \"work trip\"\nmy brother and i swore to never tell anyone about this because we did not know what to do with the information (yes, it was wrong to not tell the husband right away. i 100% admit that.)\ntheir marriage ended up well and they were doing okay for a while. \nrecently, this specific cousin has been preaching her religion onto me and was arguing with me because i said i would not pursue anything religion-related because it is not my priority. i am focused on college (i'm a STEM major and i have 0 time for myself, let alone pursuing credentials for something i'm not even remotely interested in.)\nthis is not my proudest moment, but i ended up getting irritated and said \"you're the last person to be preaching religion onto me (tinder name)\" in front of our entire family.\nher face dropped and she got quiet, but everyone around us was confused.\nher husband looked at her all confused and asked why i was calling her that. she quickly left without saying a word and i stayed quiet for the remainder of my visit even though i was bombarded with questions. i ended up having to tell my mom and she said that i should not have said that. i told my brother over the phone and he laughed so hard he almost cried LOL. i kind of feel like a dick but at the same time i dont because she needed to either stop talking to me about religion or be humbled. if she ends up telling her husband (which idk if she actually will because she lies and manipulates people for fun) their marriage might blow up and i kind of dont want to be the reason for all that. i am already struggling so much with other things and i just dont need even more negativity in my life. \nso, am i the asshole for calling my cousin by her tinder name?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. I hope you have screenshots to send when she tries to twist it on you", "NTA and by glob, that's hilarious. \n\n\nThat's the problem with hypocrites, they get as surprised as the crowd. Not your problem tho, and keep the screenshots in case she tries funny stuff in the future. \n\n\n People are weird.", "ESH. Both you and your cousin are toxic.", "A clear case of FAFO. NTA op. And btw everything is her fault and her responsibility you have 0 to feel guilty for.", "Not op but TLDR they found their married cousins tinder under a different name and was essentially cheating, they never told anyone they found it other than their brother who first found it, one day cousin is preaching about religion over education to OP and op call them out on front of family by calling them by their tinder name.", "ROFL too. Total savage.", "> their marriage ended up well and they were doing okay for a while. \n\nBecause they got back togheter?", "They kept that secret for a long time but the cousin just had to act self-righteous and preach to OP 😂", "Still he doesn’t necessarily have to know what she did in the meantime. Broken up means broken up…. I agree that she should have told him but it’s certainly not the cousin’s job to get involved in that. OP shares that weird religious mindset even though they are not religious"]}