{"id": 18542, "submission_id": "13vlsrq", "title": "AITA for screaming at my husband for burning dinner", "selftext": "I cook almost every night for myself and my partner (other than when we get takeaway). I enjoy cooking, and I’m quite good at it, so it isn’t a massive burden. The last couple of weeks have been very hard for me. My uncle was diagnosed with terminal cancer, and my Dad needed emergency surgery, as well as a slew of other big stressors. I think I’m suffering from reactive depression and I cried most of today. \n\nMy partner offered to make dinner because of how I was feeling, so I gave him a recipe which was very straightforward and didn’t need much technique. I’m relaxing on the couch when every fire alarm in the house goes off. So I run to the kitchen and he has a pan of black salmon streaming smoke. I tell him to take it outside and put the pan on the bricks because of the billowing smoke, but he stands there and argues with me saying, “the salmon is still good”. Eventually I yell at him to go outside with it and he does. Then I run around opening windows and flushing the house with a towel. Eventually we have to get the ladder and remove the smoke alarms to stop them. \n\nI then strip the salmon of the burnt exterior, leaving about 1/3 of the fish edible. And we eat that with the now cold vegetables. I got pretty pissed while I was trying to salvage the dinner and called him incompetent and raised my voice. \n\nI feel like I do so much more mental labour and I can’t trust him to take anything on because shit like this always happens. I don’t think it’s weaponised incompetence, just plain old carelessness, I think he really did want to do a good job tonight but he still messed up and left me more stressed out than if I cooked it myself. He thinks I was way out of line and was “screaming at him for a genuine mistake”. \n\nAm I the asshole for being a bit of a jerk about his mistake? I feel like I probably am, but it also feels weirdly justified to me in the context of our relationship as a whole.\n\n**Edit:** thanks everyone for the input so far. I apologised for yelling because that was uncalled for and an asshole move. He accepted my apology. I mentioned maybe he could start cooking more in general and improve his skills.\nHe said to just ask him to and he will. \n\nI think it’s also clear there is probably more to unpack about our dynamic in general, because I think I have some pent up resentment about the mental load I take on. But we can have that conversation together on a less heated night.\n\n**Edit 2:** Okay, this is a much bigger issue than I originally realised. Thank you to everyone who shared comments about unfair division of labour, mental load etc. I’ve done some reading this morning and it’s pretty clear my partner does weaponise his incompetence and I don’t know how to feel about it. It’s just sucks. I do all the planning and organising for our lives and he does some of the execution, but often needs direction. I’m an exploration geologist and when I’m away in the field, I cook meals before I go and freeze them for him. I always thought of it as an act of service and an expression of love, but I think I’m realising it’s also because I know he can’t feed himself…. And I just don’t know what to do with that information. \n\nI feel like I’m suffering from chronic overwhelm and the emotional distress of the last few weeks has been a breaking point. I’m just not sure how to navigate this and improve our relationship. Because again, I think that will fall on me. I’ve been looking into couples counselling this morning", "created_utc": 1685439994, "permalink": "/r/AmItheAsshole/comments/13vlsrq/aita_for_screaming_at_my_husband_for_burning/", "score": 631, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be an asshole because I flipped out at my partner for something which could be perceived as a simple mistake. He thinks I was an asshole for yelling at him, and I think he is wrong and that it was justified given the fact he was trying to help my stress but ended up causing more through his incompetence.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "The “context of your relationship as a whole” is obviously key here. On its face seems like your partner offered to help because you were having a rough time (seems like a positive) then burned the meal (sucks but happens to the best of us) and then y’all disagreed about next steps (also not atypical). So in a good light your partner had good intentions but an unfortunate series of events followed. But if your partner is typically lazy, incompetent, self-centered, basically always making your life harder than it has to be, then that’s a different story. NTA in the latter scenario.", "NTA\n\nLook you were clearly at the end the end of your rope and what you needed was him to handle this one thing, just one thing, and that was too much. And yes, maybe the salmon wasn’t the easiest, but it’s not about the salmon is it (shades of Iranian yoghurt!).\n\nBecause what you needed was for him to take a look at the salmon, realise he couldn’t cope, and order takeout. \n\nI get what you’re saying about the emotional labor and that’s the issue which needs to be tackled.", "NTA.\nGenuine mistakes can happen, of course. But it's the way he's handling it. If he would have taken the responsibility and solved this (open the windows, stripping the fish of burnt parts etc) it would be different. But he did not manage to solve those things on his own but made you take care of it when he knew you needed rest", "\n\nNo, you are not the asshole. It is understandable that you were upset given the mental and emotional stress you have been under as of late. It is also understandable that you felt very frustrated by your husband's lack of understanding of the situation. While you may have been a bit \"jerky\" in your attempt to explain the situation to your husband, it does not make you an asshole. Your reaction was understandable given the situation and therefore you are not at fault.", "NTA\n\n>I mentioned maybe he could start cooking more in general and improve his skills. He said to just ask him to and he will. \n\nI think you might still have a problem. I mean, you did ask and now you need to ask again? You told him you need him to take some of the mental load and he can cook more to get better and he says you just need to ask??? His response should have been, \"that's a great idea, how's about I take 2 nights a week to start?\" So now, the mental load is still on you to ask him to step up...again.", "YTA. I’m sorry that you have a lot going on, but it’s not an excuse to treat your partner poorly. Just like it wouldn’t be acceptable to slap them because they made you angry. \n\nIf you knew he wasn’t going to be able to make dinner without issue, you should have had him order takeout. \n\nDon’t be surprised when he stops offering to help you. I know I wouldn’t help someone who screams at me for something I’m not very good at. In fact, I wouldn’t stay with someone who did.", "YTA and find better ways of coping with stress. Other human beings are not punchbags for your misery, talk to your people with respect, no matter the situation.", "ESH/ YTA. Yes, he should have been quicker about getting the burning fish out. But telling someone to cook fish, when they aren't normally the cook, was already a risky move. You sound like you're trying to find a reason to be pissed at him, and he didn't really do anything wrong. This is not how to process your emotions.", "Soft YTA. Lots going on and it sounds like bearing a lot of the burden at best of times.\n\nEven if you do most of the cooking through your partner should be motivated enough to learn 3/4 recipes that they can do when you are tired/ill. Fish probably not the best place to start to be honest.", "YTA\n\nHe was trying his best and even though it didn't work out, you took your stress out on him. If you felt this was justified in your relationship, then you may be the problem.", "People that can cook will consider something an easy basic recipe when it’s just not to someone that doesn’t.\n\nYTA for screaming at him for making a mistake.", "Salmon is straightforward ? \n\nESH to me. Sounds like you're not happy in this relationship.", "YTA\n\nPan seared salmon as a 'very straightforward and didn’t need much technique' recipe for someone who doesn't cook much?\n\nI'm a very good cook and don't like to make pan seared salmon because of how finicky it is. Baked is super easy, I've even taught tweens and teens to make baked salmon in the toaster oven. \n\nYou're stressed from everything else going on in your life. Perhaps stick to takeaway on nights your partner is responsible for meals for now. \n\nOnce things calm down, kindly bring your partner into the kitchen and start cooking together. Make it an enjoyable activity, build confidence!", "ESH, unless the fish was meant to be blackened, he just want paying attention.  Screaming really doesn’t help anyone.  This sounds like a final straw that broke the camels back kind of issue.  Take a few steps back and weigh the pros and cons of your relationship, you don’t sound happy.", "ESH. Yes, you shouldn't have yelled. However: from what you are saying about his behavior in your post and your comments, his behavior *does* sound like learned/weaponized incompetence.\n\nGetting therapy for your mental health could be very helpful for you right now. \n\nEvaluating your relationship should be helpful, too. If you really do carry most of the mental load and he isn't pulling his weight, things need to change or you will stay unhappy.", "Very soft YTA, he was trying to help, and I feel like you're projecting all your frustration and anger about how things are going at the moment on to him because there really isn't anyone else to blame and having someone to blame makes it easier.", "Soft YTA, I think that it wasn't your husband's intention to burn dinner, since the effort to present you with a meal is clearly there so your anger in him is misplaced. However, I think that you are clearly beyond stressed out, and slip-ups happen. We're only human. Just make sure your husband knows that you were at the end of your rope, and apologize for the yelling.", "He’s probably terrified of fucking up because he is afraid of your reaction leading him to be under so much stress that in the end he fucks it up. Chill out and let him just get on with it and stop being a control freak. YTA", "YTA\n\nYou were a jerk. You need to see a therapist to learn how to manage your anger and express it in a responsible way.", "YTA. He made a mistake. Humans make mistakes. You make mistakes. Be kind", "Yeah YTA soft one (as you are in a fragile moment).\nI also do all the cooking at home. It’s my hobby, I did bunch of cooking classes, I come from a family that cooks a storm. It really relax me after work. My husband doesn’t. And while he cooked at the beginning of our relationship after many years of me me me he just regresses at a preteen level of cooking. (He does the cleaning after while I park my butt on the couch). \nWhen, for whatever reason, I can’t or don’t want to cook my husband does eggs, pasta (sauce from my freezer collection, sandwiches) or simply orders. I don’t expect much at all. \nYou give your husband a recipe you think was easy but probably it wasn’t for his cooking level. He tried. He failed. It happens. I also burned sometime things. Screaming and calling him incompetent for his mistake was uncalled for, sorry.", "YTA accidents happen.\n\nYou're going through a lot right now and you may, subconsciously, be directing all your hurt, frustration and anger at your husband.\n\nBe kind to him. He's trying and you will need to lean on each other a lot over the next few weeks and months.", "YTA, personally I think if you get to the point where you're screaming at a partner you're always going to be TA. I also think you suspect that already, your first paragraph reads lile excuses. Sounds like you're having a tough time and your partner might well be a buffoon but clearly they were trying to do something nice so it ending in screaming at them does feel a bit out of order.", "Soft YTA if he was honestly trying and just made a mistake. Shouting and calling him incompetent is unnecessarily mean. But it is a soft YTA because you have a lot of unhappy things going on in your life at the moment, so it is understandable that a fish fire in the kitchen could have just felt like the last straw to send you spiraling over the line. I would apologize for the shouting and mean words though, and maybe go have a nice dinner together.", "YTA, mistakes happen in the kitchen for all of us. The timimg wasn't the greatest but mistakes happen. Your over reaction makes me think there's more going on.", "YTA here. Obviously. I also wonder how much of his supposed incompetence is more about you refusing to let go of control. How do you perform when someone is standing over you ready to criticize or take over?\n\nDon't tell him what to cook. Let him choose his own recipes to shop for and try. Don't tell him how to do things. Together make a list of things that need to be done and divide them up then leave him alone to accomplish his tasks. \n\nYou want him to be a partner, stop acting like a parent.", "YTA. \n\nBut stress makes assholes of us all.  \n\nA guy who rarely cooks fucked up, and you overreacted - simple as that.", "Am the main cook in our house and I'm pretty good, yesterday I totally ruined a frypan, non-stick and whole house full of smoke.\nEveryone fucks up sometimes and hopefully your partner is there when you do, karma is real. YTA.", "YTA.", "Your edit makes me cringe.\n\nYou shouldn't have to \"ask\". He's not your child, he's an adult and he needs to take initiative, not wait for mommy to tell him what to do.", "Soft YTA but only for the choice of food. Pan seared fish is notoriously hard to cook for novices. It would be like asking someone to sauté food then getting angry they messed it up.\n\nThat being said I know someone who is serially incompetent so can be sort of forgiven when it happens for the x^(th) time.", "YTA\n\nHe screwed up and let you down, but screaming at him is not an appropriate or acceptable response. \n\nYou said yourself it was a genuine mistake, and it's not as if you couldn't have just thrown it out and order food in. It barely even needed to be an issue.\n\nIn short he was careless but you were _nasty_.\n\nFrankly if my partner screamed at me for burning a bit of fish I'd pack my bags.", "YTA. \n\nI’m sorry but if the genders were reversed and a guy blew his lid and screamed at his partner and called her incompetent for burning dinner - everyone would be all over him. Because that’s verbal abuse. That’s absolutely not okay. Ever. No matter what the circumstances are. \n\nIf you’re frustrated with the mental load you take on, seek couples counseling or get a divorce. But berating and verbally abusing your partner is not justifiable and the comments in this thread saying it’s fine should sit with the fact that they’re defending abusive language.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI cook almost every night for myself and my partner (other than when we get takeaway). I enjoy cooking, and I’m quite good at it, so it isn’t a massive burden. The last couple of weeks have been very hard for me. My uncle was diagnosed with terminal cancer, and my Dad needed emergency surgery, as well as a slew of other big stressors. I think I’m suffering from reactive depression and I cried most of today. \n\nMy partner offered to make dinner because of how I was feeling, so I gave him a recipe which was very straightforward and didn’t need much technique. I’m relaxing on the couch when every fire alarm in the house goes off. So I run to the kitchen and he has a pan of black salmon streaming smoke. I tell him to take it outside and put the pan on the bricks because of the billowing smoke, but he stands there and argues with me saying, “the salmon is still good”. Eventually I yell at him to go outside with it and he does. Then I run around opening windows and flushing the house with a towel. Eventually we have to get the ladder and remove the smoke alarms to stop them. \n\nI then strip the salmon of the burnt exterior, leaving about 1/3 of the fish edible. And we eat that with the now cold vegetables. I got pretty pissed while I was trying to salvage the dinner and called him incompetent and raised my voice. \n\nI feel like I do so much more mental labour and I can’t trust him to take anything on because shit like this always happens. I don’t think it’s weaponised incompetence, just plain old carelessness, I think he really did want to do a good job tonight but he still messed up and left me more stressed out than if I cooked it myself. He thinks I was way out of line and was “screaming at him for a genuine mistake”. \n\nAm I the asshole for being a bit of a jerk about his mistake? I feel like I probably am, but it also feels weirdly justified to me in the context of our relationship as a whole.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "A small YTA here. It even seems like you already know it. If he is not that good at cooking and you are, easy to you might not be easy to him. No need to yell at him about it though. \n\nHe wanted to help because you are having a rough time, which does suck for you. Just apologize for blowing up and thank him for trying. You both sound ok to me. \n\nAlso, if he really has a hard time cooking (many people do), maybe let him throw down for some pizza, chinese or DoorDash something if you can afford it.\n\nEdited for a spelling issue.", "From the title alone, yes. Screaming at your spouse for burning dinner guarantees a YTA. \n\nThere are mitigating circumstances (this idea of \"helping\" needs to be dealt with, it's the equivalent of saying somebody \"babysits\" their own kid) but screaming in response to a burned dinner is a dick move.", "\"Ask him to and he will\"? That *was* you asking, wasn't it?", "This feels right to me, I think it’s a reaction to the fact it’s a bit of a pattern. He sort of messes up a lot of things through genuine mistakes. I don’t think he is lazy, or self-centred, but he is pretty incompetent at a lot of basic life things. I feel like I have to do a lot of the basics to just keep things together. But yeah, I think he was also coming from a good place", "So its not an AH move to scream at your partner for a mistake?", "Yeah… I see your point there. He said to “say the word” on the nights I want him to cook. I guess it’s a step in the right direction. It would be nice for him to take on a task from beginning to end, including the initiative to plan what nights we would both cook: I just don’t think he gets it. He can’t fathom that the planning and conceptualising is more taxing than the doing itself sometimes", "How was she to know that he couldn't make dinner without an issue when he said he could handle it? Should she have not believed him and taken over because she knew he couldn't do it? \n\nAlso, as a partner, he shouldn't be \"offering to help\". That's what an assistant does and automatically places her in the position of manager. He should be taking on half of the responsibilities without needing to offer.", "I agree I shouldn’t have yelled, I’ve landed on the fact I’m an asshole for that. But I still feel it’s not my responsibility to know his level of cooking ability, he assured me he could cook the salmon and I took him on his word. I think it’s a crappy situation if we have to get takeout anytime I can’t cook, so obviously we both need to work on a solution and him improving his skills", "Thanks, I agree with this sentiment. I probably need to employ some extra coping skills right now because my emotional regulation is much shakier than usual", "But he said he could handle it. Why should she have not believed him?", "I think I can see fish was a silly thing to ask him to do now. It was just the only thing in the fridge and he said he could do it no problem. I guess I feel a bit salty that it’s also my responsibility to also gauge his level of cooking competence when he said he could manage it. But yeah, not particularly well handled on my part", "He said he could handle it. Should she not have believed him?", "I guess I thought 2 minutes on each side in a pan was simple, but that was maybe silly. I’m not particularly happy, no. The fact I’m posting on AITA about a cooking incident is pretty sad honestly..", "You literally just put in in a pan for a couple minutes then flip it and wait a couple more. That’s it", "Yep, I can see it wasn’t the best recipe to go for. He said he could handle it, but I suppose I should have known that wasn’t the case. I’m going to ask him to find some easy recipes he likes the sound of and start cooking more in general, and I can give him some pointers. I don’t think it’s great that only one of us can do a basic and essential life skill like cook dinner", "I’m not happy in general right this minute. But I do think I’m not happy in the relationship as a whole. A few years ago him burning salmon would have been a funny moment, but today it made me want to cry from stress. I think it probably is a wake-up call that I need to think about the relationship more seriously", "This is literally the first time I’ve ever been angry at him for a mistake. A one off occurrence. So I wholeheartedly disagree with this take!", "I agree I should have just cooked dinner myself seeing as salmon was all we had. He thought he would be fine, I did ask him if he thought he could handle it. Yelling was uncalled for though, I should have cooled down and then had an adult conversation about things", "I just want to clarify I didn’t berate him. I yelled one sentence and it was, “goddamnit you are so incompetent sometimes!”. Which was a mean thing to say, but I didn’t try to intimidate, or humiliate him. I wrote “screamed” in the title because that is what he said. He said I screamed at him for a simple mistake, and I wanted him to have his voice heard in the post. I actually disagree with his take, I don’t feel I was screaming and he also yelled at me while we were trying to fix the fire alarms. Was it okay, no! But I genuinely don’t think what either of us said or did this evening constitutes any kind of abuse", "I completely get you, it shouldn't be your responsibility to evaluate his level of skill in doing something, he's a grown man and should be able to tell by himself. Having to actively consider whether he can do it or not and having to keep an eye on whether he burns the place down is what the mental load is about and it's absolutely exhausting, even more so when you're already mentally drained.", "Yeah, maybe a little less yelling would have been good but at some point, being with a partner who is pretty incompetent at a lot of life (partly because you are so competent, he can just skate by) is so frustrating and crazy making, I'm sure it can drive you to tears. But also, has he no self-respect? This is a character flaw. The mental weight of it all, esp when you have your dad to worry about sounds crushing.  Good plan to talk about all this when emotions aren't running high and see if you can find a path forward. Essential especially if you plan on having children. I hope your dad recovers well. NTA", "Something to think about is if a grown-ass person can’t handle basic tasks like cooking a meal, then I’d wonder how they’d handle life when it throws something even more serious your way (e.g., *you* being the one with a serious diagnosis). On its own, burning dinner is NBD but you’ve mentioned a pattern. I don’t know about a partner who is generally incompetent, if that’s what the situation is.", "The only way he's going to get more confident is to get experience and make mistakes, but getting yelled at for those mistakes will be counterproductive.", "Wow. You make him sound mentally challenged. Maybe you aren't a good fit. Your expectations seem to outweigh his competency. By the way you describe him, I am surprised he can tie his shoes.", "> I mentioned maybe he could start cooking more in general and improve his skills. He said to just ask him to and he will.\n\nDid you explain that you are, in fact, asking him?  Right now?", "Gender is relevant here.  If a man screamed at a woman for burning dinner, that guy wouldn't have survived AITA's wrath.  But it was a woman screaming at a man so we have to bend over backwards to find a way to make her NTA.", "I think you need to continue the conversation. He needs to eat, right? Why should it be on anyone else to continually plan and execute his meals? And why should someone need to tell him to figure something out occasionally? He's in a partnership, right? \n\nSteps are still steps but he needs to take bigger steps. Good luck!", "You definitely need to have a deeper conversation about all the things you're carrying. If you haven't heard of it, you might want to check out Fair Play. It's a system designed to help couples balance out tasks and mental load equitably. Or write out everything you carry the mental load for and decide together who will take responsibility for each thing - whole responsibility. Then revisit those assignments as necessary; it's a continuing conversation.", "Thanks! I appreciate this. I do feel like I do a huge amount of mental labour and have to assign him tasks to complete, and also know what tasks he can and cannot do. It’s frankly really exhausting, and doesn’t feel like an equal partnership, which I think is why I flipped out tonight. Still not an okay thing to do, but that’s what I meant by “in the context of our relationship”", "She said herself that she doesn’t trust him to take care of things, so there’s obviously a track record of things like this happening. \n\nWhen he offered to make dinner, she should have told him to figure out what to make. Instead she gave him a recipe to follow. OP has to give up some control in order to not carry the weight of all the emotional labor.", "Be good to yourself so you can be good to others. I don’t think any of us are above frustration but I know you don’t want to lose the person you love, it’s happened to me.", "And if he can't cook fish, why didn't he say so? Why does it fall on her to actively consider whether he can do it? He has a mouth, he can use to say he's not confident with the recipe", "True - he could have taken one look at her, realised that she isn’t up to a cooking disaster, and suggested delivery.", "It's not your responsibility to do that. It's actually his. He's not a child. He should know what he can and cannot do.", "He is also an idiot in this situation and needs to learn some recipes", "I’m kind of bemused about the comments saying cooking fish is somehow a super advanced skill. A lot of the time you can just cover it in foil or paper and shove it in the oven for the correct amount of time and it comes out good. What I think might be the issue is that he doesn’t cook enough to know the peculiarities of the oven/hob, and he might not have realised that cooking stuff for the first time requires pretty much constant attention. Then again, I have been cooking since I was a teenager (yay parentification) so there’s probably a bunch of knowledge you get from that which we just don’t think about. It’s exhausting having to teach an adult to cook, I’ve had to do it more times than I would like (housemates, not partners- I’ve always somehow found partners who are excellent cooks). I’ve found pasta to be a relatively reliable ‘starter meal’ if that’s any help to you at all- especially if all they have to do with the cooked pasta is stir in a jar of pesto or something. He’s said he’s willing to learn, so that could be something he could start with. He could also consider those meal kit delivery things they always advertise on podcasts- i don’t know first hand how detailed the instructions are though", "That depends. \n\nDoes she have reason to not believe him?", "I agree you should both be able to cook but he needs to start with stuff that doesn't go from raw to cooked to burned and smoking in a few minutes even if you think it's easy.\n\nHe might not be an attentive cook, some people just don't have the mindset to pay attention to time or stand over cooking food to watch it. Everyone can cook something but he might be a casserole in a crockpot kind of cook and not a seared salmon in a pan kind of cook even if he starts cooking. He needs to step up his cooking but you both have to accept any cooking limitations he has and buy groceries accordingly.", "When my parents got divorced, decades ago, my mother told me that they just had “different life standards.” \n\nAnd the older I get, the more I understand her. \nI really love my dad. He has a great heart. He’ll help me whenever I ask him. But I don’t ask him because I don’t have much faith that he could figure stuff out and end up being really helpful without a lot of handholding.\n\nHed definitely be happy eating cereal for breakfast every day of his life and turkey sandwiches for everything else. And see nothing wrong with his whole family doing the same. Not because he’s cheap or anything but because the idea of working harder to have better just doesn’t appeal to him. His idea of “enough” in life is a LOT less than my moms idea of “enough.”\n\nAnd not just food. It the same with everything else. Like you have a week off….do you sleep in and couch potato all week with some movies (dad) or do you plan a road trip to the beach which is a lot more work but more payoff (mom). \n\n I see a lot more of these kind of low effort types lately. And a lot of excuses for it (burnt out, “down to earth,” “nobody taught me better,” etc). \n\nI’m the oldest kid and the only daughter in the family with three younger brothers. My mother (and I) put a LOT of effort into trying to make sure my brothers weren’t like this. Making sure they could cook some meals, clean up, laundry, make their own drs appointments, plan a date, etc. \nAnd yet still, the youngest brother has ended up always manipulating other ppl in doing his share for him. \n\nDad wasn’t incompetent. My brother is a brilliant, highly educated, big earner etc. \n\nIt doesn’t matter what your backgrounds are. If you have different life standards, imo it’s a no go. \n\nIn this day and age, there’s really no excuse. He could learn to cook off YouTube for free. At any level. He could learn something else to balance out the fact that you do all the cooking (like he maintains a beautiful garden for your home). \n\nImo it seems to me that you just don’t feel like equals. \n\nI’m going to say NTA. Because TRYING to help is really just not enough after a while. You should be able to rely on your spouse to ACTUALLY help, specially with small things like dinner. It’s not rocket science….just dinner. \n\nThe only thing I’d change in the future is don’t even tell him what to make. He can figure it out on his own. If fish is too much for him, he can go grocery shopping and come back with something else.", "Do you have DoorDash where you live? Sounds like this would be a solution.", "Thank you! I really appreciate the well wishes. And yeah, absolutely not having children with the current state of responsibilities, I’d be run ragged", "This is just the one side of him, the home side I suppose. He’s incredibly competent in his career, he’s a civil engineer and recently became a consultant. Big corporations come to him for advice. I’m an exploration geologist and also very competent at my job. Maybe he burns all his common sense at work? I’m not sure. Somehow I manage to do both\n\nEdit: typos galore", "I think he expects me to ask on the days I don’t want to/can’t cook and then he will do it. Which, is still me planning who cooks when I know. I just don’t know what else to do. Asking is probably the easiest option, getting him to initiate feels like an uphill battle and I’m just not in the mental place to take that on right now", "I agree, all these n t a votes are very telling on how much bias there is in the sub. Did anyone ever stop and think maybe since she presented it as an easy dish he thought he could handle it but got over his head when he found it not to be?!? At least he tried.", "Welcome to AITA", "Don’t fret, I’m definitely the asshole for yelling at him. That was not okay. But I think there might be shades of assholery to this and he’s not entirely without sin", "Not really, because the algorithm determines what kind of person finds a post.", "Oh and OP, be kind to yourself. You are extremely stressed and you have good reason to be. You also come across as someone who takes on all the work and downplays how much effort is involved. And as someone who doesn’t want to impinge on others. Another name for that is ‘a ticking time bomb’. I say that because that’s exactly how I operate, and it makes me a bloody nightmare sometimes. Your other half might not even realise how much work you actually do to keep the household running. Particularly if he has been raised in a family where that same work has happened out of his view. You might not even consciously realise how much work you actually do. So- tell him. And don’t just ask him to do some of the tasks, ask him to take responsibility for them- so that you aren’t having to do the work of keeping track of everything all the time. As you’ve said elsewhere- he likes to live a certain way. He should know what that actually involves (not as in he should automatically know- people are not mind readers- but he should pay attention when you tell him.)", "Thanks for this comment! Holy wow, “different life standards” hits the nail on the head. I think I’ve even said to him we have different standards for things, and I guess I just end up doing them so they are to my standard. That isn’t to say my standard is the benchmark, but maybe people with such disparate standards just don’t make it in the long haul. It is starting to wear me down a bit. The thing which gets me is that he enjoys the standard I set. He likes good food, he likes the way we have a nice garden to enjoy, and the house is clean and smells good etc. but those things just wouldn’t happen if it were up to him.", "Hey I wanna say - you're bang on about the mental load. Even in your edit, he's still making you do the work to tell him when to cook.\n\nNTA.", "He doesn't burn is common sense at work, he respects his boss and therefore understands his responsibility and takes the initiative to do tasks unprompted.\n\nIf he doesn't have to deal with the consequences of being incompetent in the house he has absolutely no incentive to try and change anything.", "So he's a civil engineer, yet when he walks into the house he becomes completely mentally deficient to the point he needs to be told what to do and supervised at all times?", "Sigh. \n\nJust tell him ‘you will be cooking dinner on Tuesday and Thursdays for the near future, I want you to plan what to cook and make sure we have the ingredients instead of making me plan it and do the grocery shopping for it’ <—— exactly like that so he knows exactly what you expect. Text it to him so it’s in writing. And  make sure you have sandwich fixings for when he forgets or flubs it. Don’t be surprised if it’s next Tuesday and he’s shocked that you actually meant it.", "Same. My dad definitely liked the “real food” my mom made. He talked about it all the time. The thing is, my mom is not even a good cook. She still messes food up a lot…but you can tell she aspires to meals that make you feel loved. \n\nHe even learned to make like 2-3 “real food” dishes after the divorce….mostly just for days he had the kids. Because he probably knew my mom would not be ok with the kids reporting back that we ate cereal and take out during our stays with him. \n\nBut did he like it enough to do it for himself? No.\n\nYou can’t live your whole life dragging someone uphill with you.", "I caught that too, 'Just ask me to and I will'. That's not helping you, that's making you ask him, and then probably explain it to him, and then help him when he gets careless and be expected to not be frustrated. That ends up being more of a mental load than if you just do it yourself, and that 'just ask me' line is a slippery slope.", "> You can’t live your whole life dragging someone uphill with you.\n\nThat is something to really sit with for me. I appreciate your in-depth comment and thanks for sharing your own personal experience. My partner is an excellent person, just like your Dad it seems, but I guess that doesn’t necessarily mean he’s an excellent partner. \n\nMy Mum actually refers to my partner as a lovely useless man a lot. Which I guess is pretty telling. But she seems to think it’s endearing (she’s very traditional)", "How is a useless man a good partner, though? :( \n\nESH because screaming at your partner isn't ok. He sucks as he's a grown ass man who should be able to cook, and I'm sorry but he could have looked up how to cook fish if he wasn't sure. Partners shouldn't be spoonfed all directions and handheld. \n\nMy partner's lack of quick thinking in the kitchen ( he would see something boiling over and just stare instead of lifting the pot off the heat) used to have me snapping until I learned it actually intimidated him out of learning to cook better. Because now he felt judged on everything he was doing. So now when he's making dinner I don't go in the kitchen unless he wants help, and will just give advice after the product is finished so he can improve next time (which he does definitely try to do.) He may still forget to salt things, lol. But if I'm stressed and having a bad day, at the least I know he can make a garlic butter chicken breast or sear up some steak and steam some broccoli. \n\nI think you probably need a sit down talk on you need a partner and someone you can rely on.  Not someone you bave to take care of on top of yourself.", "“He said to just ask him & he will.” There’s the problem OP. NTA", "NTA what the hell was he doing while cooking. Salmon doesn’t just burn that quickly you would have had to of walked off and left it unattended for it to be that burnt.", "If he tried his best and failed, yelling just reinforces that failure is something to fear and avoid as opposed to a learning opportunity. If you want him to improve at cooking, you need to let him fail and learn from his mistakes. Your reaction is definitely because of the stress, as it was disproportionate. YTA.", "YTA. Despite all the mitigating factors, at the end of the day, if someone is cooking dinner for you, you're not allowed to yell at them.", "YTA\n\nIt was just some fish. Nothing to worry about.\n\nAlso, fish is not simple. If he is not used to be int he kitchen, maybe start simpler. Like hot dogs, or pasta and meatballs.", "YTA \n\nYour partner saw you were going through all lot and he cared enough to TRY to do something to make it better. It was an ACCIDENT. Don’t take your stress out on your partner when they were just trying to make the day easier for you.", "sorry, yta. I get life is pretty shit for you, but if he was just trying to help, then you didn't need to yell at him. he's careless, for sure, but you could've just ordered takeaway or something instead.", " I hate cooking but like to eat cooked food versus frozen dinners. I buy frozen salmon fillets & have mastered a pretty fool-proof method of cooking them. Most of the fillets are anywhere from fist size to hand size. Turn your oven to 450.  Put salmon on (spray) greased cookie sheet. Bake for 15-20 minutes (usually). I always check the internal temp to make sure it is at least 150 degrees. I start checking the temp at 15 mins. **This is being done by using a timer.** During that 15-20 mins the side dishes could be prepared. If I want fries with my salmon, I'll put them on a separate pan & pop them in the oven with the salmon. BTW, I have both a regular oven & a countertop toaster oven. I could cook the fries separately, but don't see the point of running both ovens.", "So why didn’t you communicate any of the stresses to him instead of taking it out on him.", "YTA", "YTA. Inexperienced cooks make mistakes. Your yelling at him completely destroys his confidence and makes him not want to try. It also makes him more nervous and more likely to make mistakes when he does. \n\nInstead of you cooking, or him cooking, why not make it a hobby to cook together when you are more relaxed and capable of teaching him. This way he will learn and you will be keeping and eye on him until he is more comfortable in the kitchen.\n\nIf you yelled at me like that, even if you did apologize later, I would never step into that kitchen ever again.", "YTA", ">If you knew he wasn’t going to be able to make dinner without issue, you should have had him order takeout. \n\nAny grown-up who cannot cook dinner is automatically an asshole, unless it's due to some handicap. There are so many resources available, and so many easy menus, that you must *choose* to be unable to cook. OP shouldn't have to guide him, she should be able to ask him to fix dinner, *and expect him to succeed*.", "She didn't yell at him for burning dinner.  She yelled at him for refusing to take the smoking pan outside and arguing with her like an asshole.\n\n> I tell him to take it outside and put the pan on the bricks because of the billowing smoke, but he stands there and argues with me saying, “the salmon is still good”. Eventually I yell at him to go outside with it and he does.\n\nReading is FUNdamental.", "He wouldn't have been yelled at if he'd taken the smoking pan outside, like any intelligent person would do, instead of arguing about it with OP.", "To be fair, OP didn't yell at him for burning the fish.  She yelled at him for refusing to take the smoking pan outside when the house was filling up with smoke.", "She didn't yell at him for burning the fish.  She yelled at him for arguing with her like an asshole while the house filled up with smoke, instead of taking the smoking pan outside.", "It wasn't an accident when he refused to take the smoking pan outside, and argued with her like an asshole when she told him to do that.  *That* is when she yelled at him, because the house was getting filled with more smoke.", "> I feel like I have to do a lot of the basics to just keep things together. But yeah, I think he was also coming from a good place\n\nYou most likely sought out a partner like that because you enjoy, at some level, being the one in control.", "So, say the word.  \"You cook on Tuesays and Wednesdays from now on.  That includes planning the meals and gathering the ingredients.  Thank you, I really appreciate it.\"", "I guess I get that but there is a grey area to that. Ive seen my in-laws with cooking. They both cook pretty equally regarding frequency. One is better than the other. If I enjoy my cooking, I might do it more than my partner and splitting responsibilities can't equally guarantee them learning to do something the way I do it. And I'm okay with acknowledging that someone is better at something than the other, and while you can say \"well the other person can learn to be just as good\", we have to acknowledge people have strengths. Where I am strong I will take care of that, where my partner is strong they may be more of a lead in that regard.\n\nThough I do understand that my example doesn't exactly correlate to burning salmon lol. Sharing responsibilities would give the partner enough of the basics to learn to cook salmon which is quite easy for most recipes", "I understand how frustrating this is. When my husband moved in with me, he could not cook or do most household chores properly (laundery disasters). It was more work for me because i had to either do it myself to make sure it got done properly, just keep him to the easy tasks, or walk him through it (so doing it together). His attempts at cooking alone often resulted in spoiled food. But the thing about learning is that if i never gave him the opportunity to do the things he was bad at because i would always just take over and do it myself, than he would never get the practice to get better. Learning to cook means burnt meals, over or under spiced meals, weird ratios of ingredients etc. If he is going to learn, mistakes *will* happen. It sucks, because this is something his parents should have been doing with him when he was a kid- but if you ever want to share the load you will have to let him mess up and learn from it. My husband is often now a better cook than i am and he doesn't screw up the laundry any more. If you dont have the energy or will to help your partner learn, there is google and/or cooking classes- but you will have to accept that things will turn out poorly for the first while. Scolding your partner like this for beginner mistakes will just discourage him and will not help the situation.", "I have to disagree with all these comments of *you should have known\" how good your husband is at cooking. I'm sorry, but you have all these strangers telling you to treat your husband like an adult, and yet within the next breath tell you to treat him like a toddler and read his mind. He told you he could handle it. How were you supposed to know he couldn't? You're his partner, not his mom. If he says he can handle it, it's only natural that you should be able to take him on his word and let him handle it instead of hovering over his shoulder and backseat drive the entire time.\n\n\nNow that you both know he couldn't, ask him what he's comfortable making. Go to a bookstore and shop for cookbooks for beginners with him; there are tons of easy semi-homemade cookbooks out there. He can probably find a few that suit him. Schedule alternative cooking schedule and don't expect perfection when it's his time to cook. Let him know you're willing to help but let him be in charge.  If the veggies come out from a can or the freezer, or if they're unevenly chopped or extra charred, so be it. \n\n\nGood luck.", "Just going to throw it out there that I'm a good cook who just doesn't care much for fish and I assumed I was perfectly capable of cooking pan seared salmon a few years ago. Turns out it's wayyy more finicky than I realized and I messed it up. That isn't to say the rest of what you're frustrated about in regard to mental load isn't fair but it can be very hard to accurately guage how difficult a task will be or your ability to complete it well when you aren't actually familiar with the task. It's not crazy that he assumed \"yes, I'm perfectly capable of following a recipe and tossing something in a pan\" and didn't realize salmon wasn't equivalent to most other things he may have cooked.", "> He said I screamed at him for a simple mistake\n\nIt wasn't a \"mistake\" to argue with you about taking the smoking pan outside.  That was pure assholery.", "You don’t think it’s abusive to called your partner uselessly stupid over a mistake then dismiss how it made them feel? Then you further try to justify it by saying “Well, he raised his voice to me too”? Wow, just wow. Was he hurling insults your way while fixing the fire alarm or was he just loud and defensive because the alarm was blaring and his partner just called him a worthless idiot after he tried to do her a favor and make her day easier? \n\nI was close to saying e-s-h but after seeing this comment, and your complete inability or refusal to take responsibility for your behavior, naw it’s a full blown YTA for me dawg. It really makes me wonder what other things you say to him that you “don’t agree” is abusive .", "OP needs to sit him down for a in depth conversation about mental load, and the fact that if she has to ask she is still carrying the mental load of feeding them both.  He needs to take on the labor of planning to cook, buying what he needs to cook and communicating with her about his plans.  You just tell me what to do is not an equal partnership.", "He wasn't yelled at for burning the fish.  He was yelled at for refusing to take a smoking pan outside, and arguing with her when she was trying to remedy the situation.  That's not a \"mistake\", that's being an asshole.\n\n> I tell him to take it outside and put the pan on the bricks because of the billowing smoke, but he stands there and argues with me saying, “the salmon is still good”. Eventually I yell at him to go outside with it and he does.", "Seriously, assign him a day or two a week.  WHY???? Why do you have to ask him?  Do you intend to be his mother forever?", "Just use your big girlwords,and say \"Husband, cook these days this week\".\n\nPost it on the fridge, he cooks these 3, or 4, or 6 days a week.  Done.\n\nI get it, sick relatives, stress.  that's life.   \n\nI dunno, saying you take on too much mental load, based on what you say, is a you issue.  And saying you are too drained to say \"You cook\" seems... sketchy.\n\nAs others have said - there's way more to this than him burning the fish.  You need to sort out your actual issues,keep track of the background stuff and not let it colour other events and your reactions.   right now, you're basically bringing home your stress to take out on him, or, rather, having that stress ready to turn minor stuff into screaming matches.", "No he isn't but what I would suggest for him to improve.\n\n Every night until he learns you cook together : you start him on the easy stuff and he stays around till the end to see how it's done. \n\nIn time he takes over under your supervision parts of the meal .\n\nWhen he is proficient enough you split the cooking days and he won't make any or very few mistakes.\n  \nThis would also be time spent together however arm yourself with patience\n\n If I have to give a judgement for this instance it's ESH - you for yelling him for not listening and burning the salmon - ban the cell phones from the kitchen while cooking cause I think that's why he burned the fish", "OP is kidding him/herself that this isn't weaponized incompetence.", "Having to ask for help, doesn't negate that the person is actually helping when they do as asked.\n\n\"Do the work of telling him...\" is really reaching, folks.\n\nI fucking hate people who expect me to just know what they want help with.  Be an adult, use your words, folks.    \n\nBecause, otherwise, if you expect me to just do whatever I think you'll want help with, I'm going to start fixing your entire life for you, without asking.", "For you. He’s not an excellent partner for you. \n\nThere are plenty of women out there who also live that lifestyle, will gladly have cereal and turkey sandwiches as their staple foods and call that “cooking at home”, watch Netflix over every holiday instead of road tripping, etc. \n\nOne of my closest friends is a real estate agent. And she keeps saying her job is about matchmaking. She used to see old uncared for houses and think they’d never sell… and then she realized they just weren’t to HER taste but somebody else would see that house totally differently than how she does.", "OP did ask (him generally cooking more), and his response was ‘sure just ask me to’. It’s like ‘hello, she already did!’\n\nThere’s asking for help, and there’s asking to spread the burden. Totally different", "That's true for tasks that aren't part of your normal routine. But do you eat dinner everyday? Does someone have to ask you to think about making dinner or eating, or do you just do it?\n\nShe's asking him to make dinner, something that needs to be done everyday, and his response was to just ask...there's a difference in the type of chores that you're referring to and a chore that is part of your household daily routine. She's asking now, she shouldn't have to ask him each day again.", "Most people don't expect their partners to be mind readers. What they expect is basic understanding of the household and some competence so they can take over when life happens, and in turn, they do the same.\n\nAlways expecting the other to tell you what to do puts an unfair burden of them where they have to juggle their own tasks AND manage you with the added bad feelings of being bossy and naggy.", "Lol, no.\n\nAsking somebody to do something isn't a huge burden.", "How is he to know when she feels like cooking, and when she doesn't?  \n\nI mean, if she does most of the cooking, then it's not his routine task, now is it?\n\nIf she wants him to do it every day, she needs to say that.  Just say what days you want him to cook.\n\nand then, eat the damn food without complaining about it.", "Still strikes me as bogus.\n\nNot seeing how saying \"I'd like you to make dinner tonight\" is adding any kind of burden here.", "When you have to do it over and over again it gets kind of annoying. It's not a secret at that point it's expected of them to do x, y or z you should big boy/girl pants on and do it WITHOUT having to be asked. This isn't asking someone to read your mind, it's asking them to be aware that it's Tuesday night and on Tuesdays it's your turn to cool dinner so just do it without being reminded. That's not hard.", "You've never been with anyone who showed zero initiative? Do you seriously don't understand how draining it is to constantly be on the top of everything and be responsible for all the decisions? It's simply selfish to always expect the other person to coordinate.", "This is asshole *behavior*. I’m going to give you a pass and I bet your husband will give you a pass because of the extraordinary stress you’re under, but do what you can to keep it together. \n\nFor now, NTA", "'He said to just ask him to and he will.'\n\nThis attitude annoys me to be honest. You have asked. And why should you have to ask?   \nThis is an understandable result of the pressure you are under. NTA", "NTA\n\nI saw your edit and what he said is not good enough. I know some people need things spelled out but you shouldn't have to ask.\nHe is a grown-up and should see what needs to be done.", "NTA. This is just weaponized incompetence. He probably assumes all women are born knowing how to cook, clean and do laundry. Cooking salmon is not that hard, putting together a meal is not rocket science. Stop asking him to help in a house he also lives in, and stop making food for him if he doesn't cook as well.\n\nEvery other story I see on Reddit is about incompetent men and women always excusing them. \"But he's depressed\", \"he has ADHD\". No, he's lazy and sexist. You shouldn't have to tell a grown ass man how to throw together a meal, that laundry needs to be done or that you're out of groceries. \n\nThis is not an equal relationship, and you clearly don't get the support you need at a difficult time (which you would probably give him without having to be asked for it!).", "This post and replies are the epitome of Reddits hatred towards men. YTA undoubtedly, hope he gets wise and leaves you.", "YTA.\n\nI understand you’re going through a lot but you need to remember your bf is trying to help. You did in fact yell at him over a mistake. You are the one who typically prepares dinner so consider this may be new/unfamiliar territory for him. He’s bound to make some mistakes.", "OP you’re going through a lot right now. You’re anger came out backwards. Just apologize & maybe explain to hubby how you feel.", "Yta don't scream at your partner, its never called for \n\nAlso, who the fuck thinks salmon is an easy recipe.fish is notoriously famous for being hard to cook.", "OP your edit with \"he said to just ask him to and he will\" made me soooo sad.\n\nIt sucks that he doesn't seem to take imitative of his own accord...you aren't his manager or his coach or his mom! You're his partner who would be hopefully growing as a person alongside him. He should want to get better at stuff not to fulfill an obligation to you (thus making you responsible for any success or failure, because you're obligating him to try and by nature people are bad at things to begin with. You're an easy fall guy here and expected to manage stuff even when you're \"off\".) but because he wants to be a more competent person, adult, and partner. It's natural to feel frustrated and unappreciated. \n\nI'm sure you've been linked this already but just in case, it reminded me of this: https://english.emmaclit.com/2017/05/20/you-shouldve-asked/.", "YTA, screaming at your partner is never OK...  \nSure, a mistake was made... But it's still a mistake.  \n\nHonestly taken aback by all the NTA answers here.", "NTA but if your relationship problems have proceeded to the point of screaming, in the absence of a serious commitment to counseling and doing better from both parties, you should probably just break up.", "YTA", "“Just ask me to” UGH\n\nhttps://english.emmaclit.com/2017/05/20/you-shouldve-asked/", ">He said to just ask him to and he will. \n\nThis just reinforces your point about mental labour. He'll work on his cooking skills, but only if you *ask* him to.", "Yeah, I caught that too. What does he need, a notarized letter?", "I’m losing my mind that this was the “resolution”.\n\nSo we’re back at square one.", "Yes like WTF\n\nCONSIDER THIS BEING ASKED my guy. Just do it.", "But also like he is a grown ass adult and can Google stuff to cook. She is providing him recipes because he seems to be acting completely helpless. A competent adult would google, find out pretty much immediately that it’s simple to get some Taco seasoning mix and make tacos, and figure out how to make that happen, and then ask questions along the way to solve the problems. \n\nHe’s presumably a grown up who can manage to have a job, pay bills, drive a car…! He can figure out how to cook some simple foods within his comfort range. It’s a very solvable problem IF he cares to try", "Yeah I'm sitting here wondering how the problem was solved. \n\nShe shouldn't have yelled but from this short post she's said he's careless and she has to handle most things. And then when she gets stressed and he offers to help he makes a mess she has to clean up and then he says next time she needs help *ask* instead of just being a proactive partner that doesn't need to be told what to do?", "It’s very telling that you ask him to start cooking more… and he response is “sure just ask me” \n\nYOU JUST DID\n\nY’all need to have a mental load talk since he wants you to carry it even when he makes dinner", "You may also be generous in your estimation of his intentions as his wife… it’s beneficial to you not to see maliciousness.\n\nBut… standing and arguing with black salmon, billowing smoke, and every fire alarm in the house going off… \n\nI’m what you might describe as careless when it comes to cooking, I’m no stranger to fire alarms, and that sounds outrageous to me - maybe he’s not neurotypical or I’m missing something - but that’s such a severe under-reaction it almost seems like he must be messing with you.", "I notice that he says he will cook dinner if you \"just ask him.\" But this is still placing the entire mental load on you. I mean, dinner happens every night and it doesn't just cook itself from groceries that magically appeared in the fridge. Why need to be asked?\n\nNot OK to yell but I get the frustration level.", "Totally feel you on the pattern thing- but reverse the genders here and ask yourself how the comments would look for a man who screamed at his wife because she did a poor job at something he wanted her to do- regardless of the external factors, it wouldn't be acceptable.", "if he's a grown man who messes up basic things, how the hell did he live this long? it's either he's playing dumb or people around him had to baby him all the time. either way, yikes.", "> I got pretty pissed while I was trying to salvage the dinner and called him incompetent and raised my voice. \n\nI read your update to the main post, so you probably realized that this is where you earned YTA. And it does sound like a good idea to unpack the source of your resentment.\n\nAlso, I cook quite a bit but I do think salmon is not on the short list of easy recipes. Spaghetti, hamburgers on a saucepan, cheesy pasta are all much better places to start.", "I will admit I am a fan of them, but check out the SideKick app from Sortfoods for him.  It does the grocery list, recipes, and videos to walk you thru the cooking process.\n\nI don't know if they have the free trial right now, but go check it out.", "Ok, next time my girl says she has something handled but screws it up, I'm going to yell at her if I'm in a bad mood and I'll feel justified because our relationship needs work. Sounds reasonable?", "Oh I’m sorry, it’s totally justified to scream at your partner and call them incompetent then, my b /s \n\nNo. Still not okay.", "“You’re so incompetent” is a cruel and humiliating thing to say to someone. Impact matters more than intention when it comes to stuff like that. And yes, that’s abusive language. If it’s a one off, then maybe your relationship isn’t inherently abusive, but that comment definitely was, and the fact that there are people in this thread bending over backwards to find you completely faultless is insane to me. \n\nIf your relationship is at the point where you feel justified calling your partner incompetent, then you guys need to do some serious reflection on how you want to move forward, bc talking to your partner like that is not okay", "Like giving a novice cook a fish recipe to cook. At least give the dude a chance and puck something actually suites to a novice\n\nEdit: I mean OP is an asshole for quote clearly giving a hard recipe to her husband on purpose.", "To expand in a collaborative way, OP AND Hubs could  make a meal plan together at the weekends with meal ideas that make sense & have varying levels of difficulty factored in & then as part of the grocery shopping, those items can be purchased so they're ready to go . It might be a bit more work upfront but I cannot BEGIN to tell you how much it helps me not to have to wander the mental hills & valleys of my brain after work to answer \"What can we make for dinner tonight\" after a long day. I took photos of common products that I absolutely cannot have substitutions for so that my very capable & competent Chef-y husband knows what I need when he's alone doing the shopping. There's still a mental load in that, however it has made a WORLD of difference to our lives, & I'm not dealing with a scenario like OP's. I concur with divvying up the days for cooking (maybe allot a day for getting something In from Out (if budgets permit)  to make it an even 3 & 3 & move forward knowing that feeding your family is a TEAM effort & no adult should have to be asked to do their part as it should be EXPECTED. Sending OP a hug & a resounding NTA!", "There are plenty of easy fish recipes. Honey Dill Salmon was one of the first things I learned how to cook in high school.", "It's his routine task to eat though right?? \n\nHow is she supposed to know when he feels like eating and he doesn't? OP doesn't skip making dinner just because he didn't explicitly say I'm hungry today, just as he could give it  half a second of thought to ask her...'hey, want me to make dinner tonight'. You know, help plan the day instead of being a passive participant.", "“Never attribute to malice that which can be adequately explained by incompetence”-Hanlon’s Razor. Yes, YTA in this situation; but with that said context is everything. You said something a bit out of line, but I don’t think it’s gonna be the end all of the relationship. I do however get the feeling that you hold some resentment towards his incompetence in areas that you are gifted in. Understand this idea goes both ways. He probably gets annoyed with you when you attempt things that he’s more proficient at and you mess it up. Understand that everyone has different strengths, and that he was genuinely trying to help you. A little compassion and understanding goes a long way.", "YTA\n\nDon't scream at your partner. Nuff said", "YTA\n\nHe was trying, and you overreacted due to the stress you are under. \n\nThough I bet he was cooking on high because that seems to be the default for folks who don’t cook regularly. It wouldn’t burn if it was cooked at the correct temp typically. \n\nI see in the edit you apologized to each other and that is amazing. Maybe you guys could teach him to cook better and it would be a good way to spend time together.", "Addressing your edit: he is STILL putting the mental load on you to ask him to make dinner. Say no. You’re not his secretary or scheduler. Sit down, as a couple, and determine when he is responsible for dinner- maybe you do M/W/F and he does T/Th/S and you do Sunday together or have leftovers. Or maybe you base it on your work schedules, etc. but you could to an agreement together- or should not be dependent on you providing recipes and ingredients and instruction. He can Google simple recipes, or make easy meals.", "NTA “he said to just ask him and he will” that alone says a lot to me along with you talking about the emotional labor you put in which is real. Why should you have to ask him. He is a grown man not your child. You would not have had to yell if he had taken the smoking salmon outside when you asked instead of standing there arguing with you. Does he bring any real help into the daily relationship? You say he isn’t weaponizing incompetence and if that’s true than he just sounds plain incompetent. Dump him", "ESH/NTA. Honestly divided here since while you should not have yelled, he has his issues.", "If you messed up and someone called you incompetent, how would you feel?\n\nOf course YTA. The way you reacted is a pretty effective way of crippling confidence.", "No it sounds like she phrased it as a suggestion rather than a direct request or an assertion of her desires. We could expect him to pick up on it. But I think it's an equally reasonably suggestion that she just ask for what she wants directly. Presumably she's an adult, should be able to manage that", "OP said that she enjoys cooking and is good at it, so it would be hard to know exactly what days/nights she doesn't want to shoulder the cooking without directly saying so. Cooking is a weird household \"chore\" because it can ride the line between chore and hobby, so when you're in a relationship with someone who treats it as both them it's easy to feel like you're taking away something they enjoy, hence the husband's wording of being willing to do it at her request. It lets OP still enjoy cooking the times she wants to, and can tap in her husband when she doesn't want to.", "Not if you are a woman", "Right, but not everyone knows how to cook salmon. She picked the menu. If she gave him free reign in the kitchen, maybe he’d have made something like spaghetti or an easy thing that he’s cooked before. If someone handed me a recipe on how to cook lamb, I wouldn’t know what to do and I’ve been cooking my entire life. It’s just not something that’s in my wheelhouse. Could I figure it out? Of course I could. But again, that’s because I have a strong foundation in cooking. \n\nI’m just saying that just because something is simple to me, doesn’t mean it’s simple to everyone. OP should have played to his strengths and picked something she knew he could handle, or she should have let him pick.", "Understanding domestic abuse is fundamental. Someone not following instructions is not a valid reason to start berating them.\n\nThat shouldn't happen in a relationship. Would you be as lenient with a man calling his wife incompetent  because she shredded the screws when trying to dismantle something?", "It is understandable that you were upset given the mental and emotional stress you have been under as of late.", "My husband said the same sort of thing to me many years ago now...I said if I wanted another child I would have had one. I needed a husband. A partner. An equal. Not someone who must be told when to chip in with housework, when to cook and how to do it. You are clearly mothering this grown infant who, as you can now clearly see, cannot even be there for you when the chips are down.", "And this is the exact attitude that comment is pointing out. There's only shades of assholery when a woman is in the wrong. When it's a man he's the most evil thing in existence, no understanding, no mitigating circumstances, he's just wrong. When it's a woman every single excuse you can think of, some entirely made up, will be trotted out to lessen the much of an asshole she is. YTA. He tried to help and you purposefully gave him a difficult recipe so you could take out all your stress on him.", "I JUST had this exact experience with my husband. Before the weekend, I reminded him that we're having my aunt & uncle over for dinner on Weds. We were out of town on Friday, so I'd cook Sat-Sun-Weds. He was responsible for dinner Mon/Tues.\n\nSunday, I go shopping. I tell him, \"You're cooking tomorrow. Let me know if you want me to get anything while I'm out.\" Silence.\n\nYesterday, 4 PM, \"Who's cooking tonight?\" You are. We have x and y proteins. \n\nGuess who went off to the grocery store? Yup! Hubs!", "Agreed. They always allow the women more rope. It's never really their fault. But the opposite and the man is crucified.", "I just started eating meat for health reasons after being a vegetarian for over 25 years. I was terrified of cooking meat dishes myself for the first few months in fear I would ruin it or undercook and make myself sick. Baked salmon was the first dish I tried. Stick it in a pan, smear some butter on it, sprinkle some spices you like, add some lemon if you’re feeling fancy, stick it in the oven at 425° for 20 minutes, and you’re done.\n\nEdited because I now see from other comments that it wasn’t baked salmon, but pan seared salmon which is apparently more tricky. I haven’t tried that yet, might wait a bit based on these comments! 😬", "Salmon isn't a fucking novice recipe. I'm a pretty good to even above average home cook and I'd struggle with salmon, granted I don't make it much since I don't eat it but still. Sea food is notoriously difficult to cook  just right. Why did you not have him make some pasta with a jar of sauce? That's idiot proof. Pan sauteed salmon is not. Almost like OP wanted him to fail so she'd have an excuse to take out all her recent life stress on him.", "I hope you had a nice cup of tea.", "Yeah I picked this up too. OP, tell him you are asking him NOW, to make dinner every Tuesday and Thursday (or whatever works for you). And not to just \"take care of it\" by ordering something, but to cook. SO that you don't have to think about it again - much like he currently doesn't have to worry that YOU will cook dinner unless stated otherwise.", "This sub is insanely misandrist", "I thought it sounded like she (op) wanted him to fail. I'm also a pretty good cook, but pan fried fish us always a challenge.", "Salmon is incredibly easy. It's a fatty fish and very forgiving provided you just don't burn it.", "There may be easy fish recipes, but cooking fish is certainly not an entry level recipe.\n\nOn another point, I'm so curious to where you went to school that taught that as a school recipe. That's utterly bananas. Is that normal where your from. I'm literally just curious because it's so different from my experience \n\nWe had to pay for our most expensive ingredient, and cause the area was poor. It was never more than maybe an egg,  one time cheese I think.", "The alarming thing is I don't think it is confined to this sub. It's happening all around us.", "Sorry, I learned it from my Mom at high school age. Not in a class. The wording makes it confusing", "Ahh OK, that makes more sense", "Ok. So as someone who has been on both sides of the coin. YTA for the yelling. NTA for being frustrated. I think with more context on this relationship the answer would be more clear, but from what this post tells me it’s very black and white. You got overwhelmed, he tried to help, he messed up, he didn’t fix the mistake and rather made you fix it. You had every reason to be frustrated, but I think the key thing here is yelling at him over something that was at the end of the day, a mistake. As the designated chef of my house I make mistakes quite often. With cooking it happens. The key here is how you and your partner handle the mistake.", "YTA", "NTA Many people who don’t know how to cook put the burner on too high. Number one problem!", "Op you need to read this if someone hasn’t already linked it. \n\nhttps://english.emmaclit.com/2017/05/20/you-shouldve-asked/", "NTA.\n\nA man too stupid to know that black, billowing smoke with a fire alarm going off is “bad” is a man in desperate need to be screamed at. My guess is the next time the food has black smoke, he’ll think, “oh shit. I should handle this”.", "ESH", "I'm glad you've had some resolution with this issue. \n\n&#x200B;\n\nWhen you have the next conversation to unpack the other relationship issues, can I suggest that you talk about his \"just ask him to and he will\" statement. This is the underlying problem with these household chores related issues. People need to share the workload, not \"help out\". The terminology here is so vital. He needs to take responsibility for various chores, INCLUDING cooking dinner regularly without you having the job of asking him to do it.", "NTA, just having to ask him leaves you with the mental load. He lives there, he eats, he should step up without being asked.", "I don't like cooking and I usually just eat out more times then not, but when I do I always make meals I know I can cover! Maybe tell him to plan easy meals during the week such as Hamburgers or tortalini!", "Oh please! If genders were reversed yall would be killing him with all type of he's the asshole comments. Unless there's other shit going on, that she neglected to mention, she's the asshole here. YTA", "A fucking fire in a pan and standing there saying “it’s fine” isn’t a mistake, it’s rank stupidity.\n\nBurning food is one thing. It happens. \n\nNot knowing what to do? That’s a choice that’s going to burn the fucking house down. It’s deserving of a yelling.", "He’s an adult man, not a child.", "Do you ever feel like you're raising a child rather than having a partner? It sounds like you're becoming resentful because you feel like this is stuff he should already know how to do.", "OP, have your husband look thru this. I've seen it posted in lots of places (maybe even here) when the sentiment is \"just ask me!\"   \n\n\nhttps://english.emmaclit.com/2017/05/20/you-shouldve-asked/", "Can we have a bit more context here? Do both of you work? Are kids involved? I ask, only because cooking is a part of what needs done each day, but certainly not everything involved.", "You're literally excusing \"look what you made me do\"", "A one off occurrence that immediately led to verbal abuse and humiliation. You’re such a great gal!", "It does not matter. It is not an appropriate way to speak to someone.", "This lol. We’re both good at cooking and enjoy it. Depending on our individual moods, we’re either annoyed that we “have to” cook “for the other” or very happy to whip out a tried-and-true recipe", "I think most people would yell if there was black smoke filling the kitchen, the fire alarms were going off all over the house and their partner was just standing there like a dope and refusing to take the burning food outside. Is she supposed to whisper while the shrill, blaring smoke alarms are wailing? How is she going to be heard?", "He definitely didn’t seem to grasp the seriousness of what was going on, or maybe you’re right and it was more that he didn’t care? I’m not neurotypical I have ADHD but I actually thing he is NT. I had proper sensory overload with the fire alarms which I think contributed to me flipping out. \n\nHe’s a lovely person so it’s hard to think he does it on purpose. But I guess being careless is as bad as being reckless in some ways", "If she was about about to set the house on fire and then argued about it? Yeah. Scream at her.", "Hearing I’m an abusive partner for this instance was confronting. \nI guess maybe I had thought of abuse as a pattern and this was a complete one off. \nI suppose abuse feels like an incredibly loaded word to me too with a definition which includes intent, but I can see it was an abusive thing to say.", "If you’re too stupid to put out a fire in a house then you have well and truly earned your screaming", "A literal _fire_ is definitely one of the acceptable reasons to yell at someone.", "Well, I’d say as an adult, the only way he seriously couldn’t grasp that situation is by not being NT - he may not know what temperature to set it at or what seasoning to use, but he should understand smoke - the alarms are meant to be alarming to snap sense into even the most absent minded people lol.\n\nThere’s limits to the cluelessness functional adults can get away with, I’d say this level is highly suspect. \n\nSaying he’ll take initiative when you tell him to also sounds so badly like it’s taking the piss lol, but if he genuinely wants to be helpful - let him know you need to see he’s competent enough to self direct.\n\nHe needs to take complete ownership of learning cooking skills, enough to cover common sense - and think if there are any other basic things he may be this inept at. Might he mix clothes and dishes into the washer when doing laundry? Would he think mopping the floor with paint sounds reasonable? If he broke glass over the food he was cooking, would he still think that’s safe to serve?\n\nHe displayed dangerously poor judgement - and he has some ground to make up to return your confidence in his abilities (again, unless he is low-key a manipulative and lazy guy (most people are) who knows this is his way out of additional responsibilities).\n\nTruly for that amount of recklessness - a strong reaction was warranted, and his making himself out to be the victim and you the unreasonable one afterwards also sounds a bit ridiculous. \n\nThe only reason I’d be speaking softly is if there were other signs of medical distress or mental disability - but that’s the assumption in this situation - that’s how strange that level of idleness and unawareness is.\n\nNot great that it’s preventing you from considering children, or very reassuring if you were ever to fall ill and genuinely need to rely on his care. \n\nJust saying it would be reasonable for him to match some of your intensity and direct it towards self improvement, not for you to ‘relax’. NTA", "Don’t forget you called him incompetent. I’m sure he feels wonderful about that", "He wasn't about to set the house and fire and no.\n\nThere are more effective ways of communicating.", "Unless you burn it, which I'd easy to do if you've never cooked fish, especially in a pan", "How is it hard? Stand by the stove and watch. If any food starts looking burnt take it off the heat. For it to be as blackened as OP described indicates a lack of attention.", "NTA - he said he would do it but then made you do the extra labour of finding him a recipe, making you take into account his skills and then he still messed it up, and then acted defensive about it. Cooking non-burnt food isn’t hard, he could have watched a YouTube, he isn’t a toddler. \n\nI know people make mistakes, but I don’t believe people burn food that they’ve offered to make unless they aren’t actually caring or paying attention. And grown adults should know how to cook edible food, it’s a basic human skill, it’s not much work to look up a video on how to do things and relying on your partner to be the only person who feeds you is embarrassing.", "ESH.\n\nYelling because an inexperienced cook fucks up salmon is over the top and unnecessary. \n\nYou’re obviously at the end of your rope though, and even his “I’ll cook more if you ask me” is putting you in charge of making sure the household work gets done, not him being an even partner. \n\nAsk him which nights a week he wants to be responsible for cooking and cleaning up after on. (Some people do it where the cook doesn’t have to clean, in my house, I cook simpler dishes and clean as I go, while things simmer or whatever, where my husband cooks elaborate meals with a ton of gadgets and doesn’t clean anything while he cooks, not even putting a spoon in the dishwasher. The food is amazing, but the kitchen is a top to bottom disaster. So I clean my cooking and he cleans his.)", "YTA:  salmon is a skilled dish to cook.  I’m a professional baker and decorator,  and I cannot cook salmon. If I were giving someone with no cooking experience a meal to cook, it would be spaghetti or a hamburger. Heck, a ham sandwich. Salmon is hard, and he burned it.  No need to yell over it when he was helping you who admittedly was so distraught you couldn’t function.", "Sign him up for cooking lessons", "YTA", "YTA, I don't think I need to explain why tbh", "YTA\nIt sounds like you have a lot of resentment for this man and you're taking it out on him in an aggressive aggressive manner. Your mental stress is no excuse to treat your partner like that. We all make mistakes and it's normal to get angry and snap at people every now and then, but for people we love, we realize our mistakes and try to change. But you're sitting here trying to justify it, even ascribing malice to his mistake.\nTbh, you sound like the gender swapped version of my parents. My father would yell at my mom over anything she did wrong. It created an extremely toxic home life and both my mother and I resented him. You're creating a similar toxic environment by getting all pent up and then bursting. Either work it out and learn to tolerate the man you married or just break it off.", "YTA - you yelled at him for a mistake. If he's bad enough in the relationship that it forces you to treat him poorly, then leave the relationship and find someone who has the qualities you are looking for. If the relationship as a whole justifies abuse -- it's not a good situation for either one of you, and a \"look what you made me do/look how you made me treat you\" attitude is not going to fix it.", "Thank you. This is unfortunately very familiar", "I actually think this is unfair. I have absolutely taken responsibility for yelling and for making a very nasty and uncalled for comment in the heat of the chaos. I apologised to him, and I’m going to take steps to not let it happen again. \n\nNot once have I ascribed malice to his mistake, I think he was genuinely trying to help and failed. But in our relationship as a whole it’s difficult for me to be able to drop any balls, because he just won’t catch them. I think this is a genuine problem. You are right though, I think I am becoming resentful of the dynamic and we probably need to go to couples therapy. This is the only time I’ve ever gotten angry at him this way, in 7 years.. it isn’t a pattern, but it’s indicative of underlying issues \n\nI’m really sorry you had a toxic environment growing up. That’s not okay. But I think you might be projecting that onto my situation a little bit. Both my partner and I are normally good at emotional regulation and having discussions when we are “in the green”, we don’t belittle or shame each other. I agree the way I spoke to him wasn’t okay, it was very out of character, and I’m regretful for it", "Can you afford for him to take cooking classes so this isn't just another thing on your plate (teaching him to cook and holding his hand)", "You want to be the victim of your story soooooo bad.", "Thank you! I looked this up and the book and the  cards seem worthwhile. I think he absolutely does not comprehend how much work I put into making our lives run and the cards may help him visualise that and take entire responsibility for tasks end to end.", "We both work full-time. He works longer hours than me, but I do a fair few field trips yearly. No kids. I do all the planning for everything home related and he does maybe 40% of the actual tasks, but none of the planning. If that makes sense", "If my husband told me \"he's got it\" when it comes to anything culinary, I'd know to not believe him 😅", "That's not what I'm referring to. In the post she says after the smoke was gone and the alarms were taken down she \"was pretty pissed, called him incompetent, and raised her voice at him\".", "NTA assign a rota you cook S, T, Th, S and he cooks M, W, F then do a meal plan what each person is making each night. That's what we do in our house, then when guests come for more than a week we add them to the rota. It works out amazingly well!\n\nId also suggest perhaps having him learn to cook using Intagram like the Pasta Queen or Hungry Happens. Some people don't follow written recipes well but following the videos works really really well for them.", "Abusive language is different from being an abusive partner. You’re right, abuse and being an abusive partner is a pattern. Everyone has reactions that can be categorized as “abusive”. Everyone snaps unkind things. But it also sounds like it was an explosion of frustration and burnout, and that doesn’t make you abusive, that means you had a fight. Just like someone can use problematic language without understanding why something is bad to say, doesn’t mean *they* are problematic.", "Pasta queen is fabulous! I will suggest that to him, he might find her content engaging and fun to follow along to", "Maybe since he's an adult he should just learn how to make food so his ~~mommy~~ girlfriend doesn't have to do it for him or hold his hand while he does it.", "He's a grown adult, he should know how to cook - or at the very least, he's still an adult and can use his words to say to his wife \"hey, I've never cooked salmon before, maybe we can choose something simpler to start\".", "Maybe he shouldn't be incompetent then lol", "Thank you for your comment. I had a knee jerk reaction to the word abuse because I have experienced verbal and emotional abuse in my own personal life, and seeing that written about me was intensely uncomfortable. I agree we had a fight, and what I said was nasty and uncalled for and could be categorised as an “abusive” comment. Thanks for validating that I’m not defined by one nasty reaction in the course of a 7 year relationship. I’m feeling emotionally vulnerable in general right now, so that really got to me for some reason", "We started doing this when lockdown hit to minimise shopping trips, since we were in the habit of popping to the supermarket to get what we needed when we needed it, usually me after work when I was tired after being on my feet all day, because I was the closest to the shops due to where I worked.\n\nI planned the meals, he did the shop.\n\nWe kept it up partially out of habit but also as you said it takes all the “what do we have tonight?” out of every single night and we’ve been eating better as a result plus there’s much less food waste.\n\nThen I got burnt out on planning recently and he took over. I help with it now instead. He also does most of the cooking because I can’t stand cooking, but I do still do it a handful of times a week for various meals.\n\nI do more of the cleaning: dusting, laundry, vacuuming, cleaning the bathroom, washing up, etc. I’m also the financial planner. I work less hours than him in my job so I don’t mind it.\n\nHe mows the lawn and takes the rubbish out too, lol.", "Ah yep, I’m coming to that realisation now. And feeling like a bit of an idiot for taking 7 years to realise maybe this is an actual problem"]}