{"id": 18591, "submission_id": "13w7rne", "title": "AITA For refusing to go by another name and refusing to address people who do not call me by my name even though it is technically a slur?", "selftext": "I recently started an internship with a non profit that I am really excited about, after the first day my supervisor came to me and said that some of the other interns were uncomfortable using my name and asked if I could go by my middle name or another nickname. \n\nI won't share what my first name is, but it is technically a racial slur. My parents didn't know it at the time when they named me. It wasn't used that way in my country and it is just a pretty sounding name. My mom said she actually named me after my grandma's favorite song. \n\nThe thing is, that I really LOVE my first name. I *hate* my middle name and I have never gone by a nickname in my life. My name is a major part of my identity. \n\nSo I told the supervisor I wasn't comfortable using another name. The people in our group who were initially bothered by it escalated things to HR and HR basically came back saying that since it is my legal name they can't force me to go by anything else. \n\nAfter HR basically told them nothing could be done, it became really apparent which of the other girls are the ones who took issue with my name. They started referring to me by my last name alone. My last name is stupidly common, there is another person on our team who shares it, and a 2nd person who shares a name very similar to it (literally 1 letter off). They do not refer to any of the other people in our group by last name alone. \n\nSo I started ignoring them. They'll go \"Lastname. LASTNAME. HEY LASTNAME\" and I just calmly look at them and say \"My name is X. If you need my attention, you will need to refer to me by my name\"\n\nI know it is causing problems in the group and that they are mad at me about it. But, like, it's my actual name. It feels like shitty bullying being singled out with this last name crap.\n\nAITA for insisting on being called my name if it makes people uncomfortable?\n\nETA: We are all American and native english speakers\n\nEDIT 2: For clarification, most people in the US do not realize my name is a slur. It is more commonly used as a slur in european countries. It's censored on sites like pinterest but there have been celebrities with the same first name, it is used commonly in songs and pop culture here as well.", "created_utc": 1685494815, "permalink": "/r/AmItheAsshole/comments/13w7rne/aita_for_refusing_to_go_by_another_name_and/", "score": 589, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > My name is a slur and I guess by refusing to use a different one I am making people say it. I guess that could make me the AH\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Based on your comments, I'm gonna assume it's something like Gypsy or Ginger. Which are technical slurs and outdated but also have been and can be used as a name in the US without the offensive meaning attached. \n\nIf it's worse than those two possibilities, YTA. If it's either of those possibilities or something similar then NAH and the other people are a bit too sensitive.", "A little long-term perspective: If you plan to continue to work in regions where your first name is considered a racial slur, you'll not only encounter this but, worse, decision makers excluding you from opportunities or advancements to avoid their own discomfort.\n\nName-driven bias is well-document in research (refs below).\n\nThough I do not think you are the asshole for wanting to use your first name, if it is commonly used as a slur I think that using it will be to your detriment. \n\nNAH.\n\n\\----\n\nBertrand, Marianne, and Sendhil Mullainathan. 2004. ‘‘Are Emily and Greg More Employable Than Lakisha and Jamal? A Field Experiment on Labor Market Discrimination.’’ American Economic Review 94:991–1013.\n\nQuillian, Lincoln, Devah Pager, Ole Hexel, and Arnfinn Midtbøen. 2017. ‘‘Meta-analysis of Field Experiments Shows No Change in Racial Discrimination in Hiring over Time.’’ Proceedings of the National Academy of Sciences 114(41):10870–75.\n\nWidner, Daniel, and Stephen Chicoine. 2011. ‘‘It’s All in the Name: Employment Discrimination Against Arab Americans.’’ Sociological Forum 26(4):806–23.", "NTA I know exactly which name is yours and it's been a name for a long time. They're being needlessly offended when it's not being used as a slur at all, it's your name!", "NAH. Keeping in mind I'm white, and thus I don't actually have a Romani perspective in whether or not someone's name gets a \"pass\" despite it being a slur. \n\nIt is your name. Your parents didn't know any better. It's something you've grown up with and a big part of your identity, and I can see why people's refusal to call you by it is infuriating, especially if they're just calling you by your last name like a drill sergeant and not even Ms. Lastname or something more along those lines.\n\nHowever. You also can't force people to say a slur when they don't feel comfortable doing so, even if it is your name. I 100% understand why your coworkers are reluctant to use it - I don't like saying the word myself, I will say it for people's names but doing so makes me cringe a little bit, I won't lie. I don't think it's fair to say that your coworkers not wanting to say a slur is them bullying you, though I can see why you'd feel that way.\n\nY'all are in a tricky situation. If you'd find a nickname like Gi or even Ms Lastname acceptable it'd be an easy solution, but I understand not wanting that. There's no easy answer here.", "NAH. Even though it's your name and things can mean different things in different cultures, you have to understand that not everyone is going to be comfortable with your name.", "Okay, So at first I was N A H, as I figured your name is G*psy, and it's not uncommon for people to be deliberately stubborn and name somebody what they want versus cultural appropriation/long historic issues across the globe/basically anything outside their own community. So I get the shock you would be experiencing finally going through the repercussions of what your parents did. \n\nBut, holy hell, after reading your comments, especially comparing what your experiencing to \"Christian conservatives\" actively misgendering people, you have to be taking the piss. \n\nG*psy has been a slur for a long time. And even putting aside how your parents could have just, You know, researched the actual foreign name they were giving their child, do you walk around using the r word? The n-word? \n\nBecause the r word, especially, has only recently been considered a slur. Or do you understand the nuances that things change? That you can't behave any way you want because your parents did something inappropriate even for their time? \n\nAnd the biggest difference here is G*psy has been a slur since you were named it. You have no leg to stand on here. Your parents deliberately named you something negative, and now instead of just going by your last name, You're being very... Problematic.\n\nThe way you're doubling down is going to make it impossible for people to see you as a team player at your job. And at the end of the day HR isn't going to want to risk a discrimination lawsuit by forcing people to say a slur if someone of that cultural background works for them. (Even future jobs screen names. I saw someone posted research showing how your name can make a break employment).\n\nYTA and just go by your last name. There are plenty of people at my old jobs who shared common first names and some people went by their last names or initials. You being unwilling to even do this, when your name is in fact a SLUR, is not doing you any favors other than feeding your pride.", "NTA for refusing to go by another name. But then again, not letting you to be addressed as  <honorific> <Last name> would make you TA.  That said, simply <Last name> is rather rude.", "NAH it’s technically your name and you have a right to go by your name. However, just because it isn’t considered a slur really in the US doesn’t mean it isn’t one. Romani people are targeted, discriminated against, and insulted using this word. For centuries. THEY have asked us non Romani people to stop using that word. It’s your name so you do you but be aware that just because you don’t consider it a big deal doesn’t mean it isn’t one. No one is completely in the wrong here really.", ">AITA for insisting on being called my name if it makes people uncomfortable?\n\nIsn’t your last name also your name?", "NAH. I've had a student im summer school whose name was a misspelling of a term \"we no longer use\" to refer to people of color. As a basic white lady, it made me uncomfortable to call her name. So I just stopped saying it. I still talked to her, and called on her, but used proximity or extra eye contact to make it clear who I was talking to. I'm not sure this was the best approach, but it's the best I could do for that summer, trying my best to not let racism/my discomfort affect her education.", "NTA since it's your name, but also, NTA to your  co-workers, who don't want to repeat a racial slur in their own language. Can't blame them for that.\n\nCalling you by your last name sounds like the best solution for everyone involved.", "ESH you know it’s a slur and it makes people uncomfortable. Have you ever educated yourself about why people find it so bad? I don’t want to assume the coworkers are making up their offendedness. What would be the purpose? What if it’s all genuine? Does it matter to you? I think names are important but if your name is a slur that I have a genuine problem with, I’d probably just avoid addressing you all together. Everyone just seems like their getting petty about it.", "Look, I get that you love being named Gypsy, but you can't expect everyone to be okay with having to say a literal slur at work multiple times per day, and it really does suck that you're choosing to not offer up the alternative of Mr/Ms/Mrs/Mx Lastname or something along those lines. \n\nAnd it's not \"technically\" a racial slur. It is a racial slur against Romani people. It's not the literal worst slur out there, but that doesn't make it not a slur. If you're going to stand your ground on this then do that, but don't try to soften the fact that your name is a slur by saying \"oh, it's only technically a slur.\"", "You have every right to go by your name. They have every right not to say a word that is a recognized slur in a lot of places, including the US.\n\nYour last name is your name. Period. You do not have to respond to that, but I feel like this can either be NAH or ESH. At this point, everyone has both created a hostile work environment and just tried to be reasonably comfortable at work.", "Here’s my personal rule:  I don’t use words when the people they describe tell me they don’t want them used. I’ve seen Romani ask that the word not be used. It would make me uncomfortable to use it even if it was your name. I don’t understand why you refuse to answer to your last name or ‘G’ or something. It seems like YOU are offended that your name is a slur and people don’t want to use it. But that’s not their fault. Or your fault either. But why is the only solution here for these people to use the word they don’t want to use?", "NTA even though I am very curious what the name could be.\n\nI know a ton of people especially from other countries at my work do use nicknames instead, but if you like your name and HR already agreed with you then you should have the full right to do what you want.\n\nI will say though, depending on the name and the field you’re working in in this non profit it could cause some issues down the line so it might be good to have a nickname as a backup for future work reasons.\n\nEdit: I also agree with the other commenter that the other coworkers are also NTA/NAH, people might not be comfortable with using a racial slur to call your name every time", "NTA your name is yours.  And nobody has any say in what you answer to. Correct them. Every. Time. You do not exist for anyone's comfort.", "YTA, I would not be comfortable saying your name either. Also, it was still a slur 40 years ago when that song was made, people just cared less. You can like your name, but my honest recommendation would be to find some sort of compromise by being called Mx.(Lastname). Or you can just refuse and know you probably won’t be getting any good references from this job.", "depends on how bad it is. When I worked at a theme park there was this girl who's name was very close to the N-word but had an a instead of an e. Didn't have a nickname, we walked a very fine line that summer as she didn't want to go by a nickname.", "NTA, it's your name. I'm surprised you haven't encountered this to this extreme before.", "YTA.  If someone's uncomfortable using a racial slur, it's perfectly reasonable for them to refer to you by your last name.  It's not bullying, it's them not wanting to make themselves and/or their peers uncomfortable.", "Really had to give this some thought, but I think I gotta go with YTA. I get that it can be annoying to be called something other than your name if you prefer your name, but you can’t force people to say a slur to get your attention. I think the right thing to do is tell people you prefer <first name>, but that you get some people are justifiably uncomfortable saying it and those can call you <whatever> instead. But honestly your parents are the real AH here, what a shit situation to put your kid in.", "YTA. You won't change your first name, that's fine. No one can force you.\n\nBut refusing to acknowledge being called by your last name is very childish. They have a legitimate reason for not using your first name and have respected your wishes to not use a nickname.\n\nYou can't help that your name is a slur, but you are a complete asshole for trying to force people that aren't comfortable with it to use it.\n\nIf you were named the \"n\" Word, would you be so adamant? Banking on people being ignorant is making you an even bigger ah", "NAH, I understand that you want to continue using  it but some other people might not want to use that word. Even if a white person is called N. (which is black in some languages) you cannot expect people to start yelling that name in and out of the office. Let them go with the first letter if someone is uncomfortable.", "YTA for forcing your coworkers to use a slur they are uncomfortable with. They offered up a very reasonable compromise. They aren't being disrespectful by using your last name. The meaning you attach to your name doesn't erase the negative and offensive feeling it causes in others.", "YTA. To yourself. To others a bit, but my god what are you doing? Do you think you'll be getting a good recommendation for this internship? Or will everyone just remember you a slur name McAsshole? Yes, g*psy isn't as big of a slur in the US as in the UK, but that doesn't matter. You're making everyone uncomfortable. You're in your first professional networking role and you're making everyone hate you. The non-profit sphere isn't as big as you might think and you're tanking yourself for no reason.", "NTA. It's your name.\n\nYou 100% aren't going to get hired here full time after the internship.", "YTA", "NAH. I have a good idea what your name is and if it is that name, you're right, not many people in the US realize it's a slur. My uncle had a dog with the same name. My dad straight up didn't believe me when I told him it was considered a slur.\n\nIt's *your legal name*, you have every right to want to be called that. Not respecting someone's name is pretty messed up. On the other hand, I can understand being uncomfortable with saying a slur, even if it is someone's name. I don't think I'd be able to get over that mental block without effort, though I would try.", "Gentle YTA. I get it, I didn't even know it was a slur until I was in my 20s. But it is, and it's perfectly understandable for people to not want to use it. They could also potentially be mistaken for bigots themselves if someone who doesn't know you hears them say \"hey, (your name)\"!  I'm sorry that calling you by name puts people in an uncomfortable position, but that's reality. Of course they shouldn't just bark your last name like a drill sergeant, but \"Ms/Mr So and so\" should be fine.", "Gentle YTA because you seem to know and fully understand it’s a racial slur in the country and language that are most prevalent wherever you are, so it seems like you’re being petty by not being happy with the compromise your colleagues came up with so they don’t have to say a racial slur. I’m curious what your name is and how it’s viewed in the US, where I am. But either way, I’m glad you have a first name you love and are proud of but I feel like you need to be more accepting of your colleagues desire to not say your name which is also a racial slur.", "NTA", "Idk. I kind of think, like, isn’t your last name also your name? Why not just go with that? It’s your name.", "NTA, but you could get more creative in dealing. Call them by their last names, but don't be snide about it. If they kick up any fuss, ask them kindly, \"What would you like to be called?\"\n\n10 years older? You can weaponize that. I mean, in a positive way. \"Oh, I remember when I was your age...\"", "Nah. I understand you want to go by your given name. But if it's a slur, then I'm not using it. Ever. Your last name is part of your name, and it's pretty common to call people by their last names. Are you gonna complain about that, too?", "Idk I feel like this leans toward E.S.H\nIt sucks that you don't wanna go by anything else and they're forcing you to basically, but it's also really unfair to expect people to be totally fine with saying a racial slur when they're aware it's a racial slur. If I were there I would probably just avoid referring to you as much as possible tho\n\nEdit: no actually YTA both for not caring that your name is a slur and throwing trans people under the bus to make a point in your comments", "NAH but I think you might want to seriously consider going by a different name in professional settings. This isn’t going to be the last time this is a problem. You are just starting your career. People get held back all the time for having ethnic sounded names, let alone slurs.", "YTA - your name is not “technically” a racial slur, it IS a racial slur. You need to learn that people will be uncomfortable using your name because of it. You will also lose opportunities because of it. \n\nThis is for you to get over, not people who are not willing to use a racial slur in everyday conversation.", "YTA\n\n\"They call us Gypsies, Tramps, and Thieves\"\n\nFrom the chorus of the Cher song. It's *also* used as a slur in the US, but hippy dippy types get somewhat off on romanticizing ~the way of life, or whatever, which just means they pick and choose the parts they think are cool, edgy, and \"sexy\" and ignore the rest of the ugly stereotypes and connotations applied *to actual people*.\n\nYour name is a slur and you're in a place where that slur isn't acceptable parlance anymore. Suck it up.", "NAH. For better or for worse, that’s your name (and not an awfully uncommon one) and names are an undeniably important part of someone’s identity. You shouldn’t be made to go by a nickname if that’s not something you’re comfortable with. In that same vein, your coworkers can’t be forced to refer to you as a word they feel uncomfortable saying. If they don’t want to say it, they just shouldn’t use it. A polite, ‘excuse me, Miss’ never hurt anybody", "might get pushback but YTA sorry. you keep saying it’s not widely understood as a slur where we live (I’m also in the states), yet it’s widely understood enough that several people at your workplace understand it in that context - to the point that they are going out of their way trying to find alternatives and even asking HR how they can avoid saying it at work. i’m willing to bet other people in your workplace also recognize it as a slur but don’t want to stick their neck out by speaking up and stirring the pot. have you considered you might be underestimating how many people today think of it as a slur since the people who raised you don’t seem to see it that way?\n\ni get that it’s your name and you love it and that you’ve grown up with it as a part of your identity, but you don’t exist in a vacuum. i’m glad you think it’s a pretty name from a your grandma’s favorite song, but what the name means to *you* and *your* family doesn’t magically make its prolific historical and cultural context disappear. your individual experience with it as your name does not outweigh the experiences of countless people who have been oppressed while having that word spat at them.\n\nit’s your name that you’ve had your whole life - you have a right to go by your own name. i won’t fault you for going by it. but i find it unreasonable that you claim to understand that it is “*technically* a slur” yet are still this upset when people want to avoid saying it.", "YTA, just because I’d bet a lot of money your name is Gypsy based on piecing together everything from your comments, and as you’re very obviously not of Romani heritage, you don’t get to decide it’s not offensive just because your parents (knowingly or not) named you a slur. Personally I’d avoid making known slurs a major part of my identity, but that’s just me.\n\nYour coworkers are doing the politest possible thing they can by calling you your last name, I’d be calling you a lot worse if you insisted I only call you by that specific first name :)\n\nSource: Romani heritage and when people call me a gypsy, it’s definitely a fucking slur", "YTA, because you're forcing people to use language they are uncomfortable with when your last name is still your name. How are you being disrespected by being called by your last name when it's literally your name?", "Go back to hr and say that she is causing a hostile work environment for her refusal to use your legal name.   Fix it or I will with a lawyer\n\n\nNTA", "Oh, NTA, and this is sad. It’s nice that they don’t want to cause offence to others, but they seem to be oblivious to the fact that they’re being very offensive to you.\n\nIt’s too bad you’re an intern, and have to make a good impression. If I were in this situation, and not an intern, I’d announce cheerfully that as they couldn’t bring themselves to use my real actual name, I didn’t feel I had to do the same for them. I’m thinking “Grumpy,” “Sneezy,” “Dopey” and “Doc” for a start.", "Political correctness gone too far yet again. Here there is a cheese factory that has been a certain name since it was built. It uses  the owner’s last name. Relatives of this man still own shares in that factory. They were told to change their brand because it was offensive. Ummm no it is a LEGITIMATE surname. The cheese was renamed and the family heritage gets wiped out, because it’s an offensive term to describe someone. People need to grow up. Do their research and leave others alone.", "YTA.\n\nYou keep saying that it's not a slur in the USA or is only newly a slur.\n\nRomani have ALWAYS considered it a slur. Your repeatedly denying that is why yta.", "NTA.   \nNow you need to talk to HR, because this is abuse and harassment.", "NTA especially since you clarified it was a name that some celebrities have and, it's a relatively known name.", "I'm dying of curiosity to know the name - did anyone figure it out?", "YTA, if you're actively ignoring people calling you mr/mrs/whatever. LAST NAME, you're being purposefully vindictive and obtuse.", "Nta similarly I worked with someone whose  name was inappropriate slang in America but a common name in their home country.  I interally giggled and then moved on.", "NTA Context is everything. If I describe my female dog as a bitch, that's fine. If I call you a bitch because I am mad at you, that's nasty. These people are being ridiculous.", "YTA, it’s your name, but it’s also a slur that makes people very uncomfortable to use it and you are TA for not being understanding of this.", "YTA\n\nA last name is a name. You're being an asshole about people not wanting to say a slur. Whatever it is.\n\nId actually go to HR and complain about your professional behavior at work.", "Are any of your coworkers or the group it can be offensive to? It doesn’t change they don’t get to pick your name but I’d have more empathy. NTA", "NTA at all it's your name.\n\nI'd suggest a pay rise with the nickname", "https://www.google.com/amp/s/abcnews.go.com/amp/Nightline/story%3fid=128696&page=1", "Any chance you could go by your initials?  Or ask everyone to go by last names in your department, like Gibbs and company on NCIS.  You are being singled out as the only person addressed by a last name because a few grown adults where you work are uncomfortable using a commonly occurring word which may or may not be a slur depending on where you live, personal experience, use in context, or social norms of other countries.  My last name is not very common in the states, but a very common first name in certain other countries, and even a slur in a few places far from where I live.  I do not use it as a first name.  I do not use it as a slur.  Context is king when it comes to word usage.  If a professional person cannot see the difference between a slur and a fairly common name that is on them and they need to deal with their baggage, not dump it on you.", "I’m trying to process this and I’m American and the first slur I could think of is the N word. I’m white and I absolutely wouldn’t feel comfortable with calling someone that even if that was their name and they preferred it.", "Nta it's your name. I'd go back to hr and tell them you consider it harassment and bullying that this is occurring and you are being singled out because of your name; which you are.", "NTA. Other languages and cultures exist. You said your name isn't a slur in your home country, so clearly the intent of you and your family had nothing to do with racial slurs. You have every right to be addressed by a name that makes you comfortable.", "NTA", "NTA \n\nThis is the perfect woke PC mindfuck philosophical debate though.  The modern day ‘would you steal bread to feed your family’ \nShould be taught as a case study in philosophy 101, lots of good arguments on both sides. \n\nThoughts and prayers for your conundrum of a name!", "NTA. Incredibly soft and overly sensitive American college students. Shocking. Don't you know that the world is their safe space and that you're supposed to do everything they tell you to maintain that? You're a literal terrorist.", "NTA. You should go back to HR and report what's happening.", "NTA .  Stand firm.  This country needs to learn.  Words in and of themselves are not evil.  It is all about how they are used.  One of the biggest insults in the south is to say “bless his heart”.  The words are fine, but, the context is everything.", "Jesus just tell us the name", "NTA\n\nI'm guessing with your name (from the comments, Gypsy?) is that your coworkers don't want to get in trouble with HR especially if someone new who comes in and doesn't know. They may have thought that they should protect themselves from workplace from racial discrimination.", "I’m reading responses and I’m surprised at how many people say TAH… They’re so woke that they’re shaming telling op is wrong for using their name.", "NTA. Start calling them by their last names too.", "NTA. The first name that popped into my head was Isis (beautiful name, imo, before it was ruined).", "NTA: Use their last names when talking to them. You should be able to go by your name.", "So it is your legal name and them making things difficult for you is discriminatory. I would go to HR and make a complaint against them.", "I was pretty sure that you were Persian until the updates", "Its a slur and people being uncomfortable with it is  normal, your lack of flexability makes YTA", "It's a slur. Sorry but people are going to be uncomfortable saying your name. No one can make you change your name but you also can not force people to use slurs.", "YTA. Your name is a slur and that sucks for you. But refusing to bend at all and refusing to answer to anything other than a slur is just being an AH. You’ve made it clear in your comments you don’t care, so I guess get comfortable with people thinking you’re an AH 🤷‍♀️", "NTA.  I almost was going to say YTA cuz why cause drama if your name is truly offensive.   \n\nBut once I saw what it really is from one of the other responses, definitely not.  If Cher can have a hit song with that name in its title, then there’s nothing wrong with it. \n\nHowever, I’d just answer them when they use your last name.  Chances are they’ll never use your first name.   How else will work get done?   Just know they are idiots and you’re in the right.", "NTA\n\ngo to HR about whatever snowflake is upset about using your legal name Ginger/Gypsy", "Gypsy's a cool name, the only problem (not mine) I could see with it would be it does sound slightly stripperish no offense but screw them I wouldn't answer either", "I recall the actions of two of my co-workers last century in the midst of a very nasty breakup.  ( This was in the 80's, when computers were just being introduced, but did not have a lot of checks in place )\n\nShe had been screwing his best friend, and then left him and moved in with the friend.  I really don't blame her, for he was a real loser, but she could have done it a little more gracefully.\n\nShe didn't file a change of address form, so he kept receiving her mail.   She kept expecting it to hold it for him until he picked it up.\n\nHe finally filed for a name change, claiming to be her.  He signed the papers for her, pretending that he was her.  Some clerk must have seen it, but let it go through anyway.\n\nHe legally changed her name to 'Cumslut'.\n\nHe eventually did time for it.  In the face of stiffer charges, he pled guilty to petty forgery or some such charge, and served six months in the county jail.\n\nFor some reason, the state troopers could not find him at home, so they arrested him at work.  That is how we found out about it.\n\nIMHO, if the parties involved could cope with that, then nobody should have a problem with your name.\n\nNTA.", "NTA, I’m sorry your name is Gypsy but I also think the I’m named for a song line should work on pretty much everyone as it’s a well known song. I know like 2 Gypsys and 3 Rihannons because Fleetwood Mac is just that powerful. Also know a few Stevies for what it’s worth.", "NTA\n\nI am Romani. While I know that some of my people are offended by the word gypsy, and I am as well when it is used in the context of a slur... \n\nI, nor do anyone one in my community that I know personally, have an issue with it being used as a first name. \n\nI'm more in the reclaim it and take away its power camp. \n\nPeace and love to you Ms. Gypsy.", "Maybe get a tee shirt printed. \n“I was named after a \n             Song \n         Get over it !! “", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI recently started an internship with a non profit that I am really excited about, after the first day my supervisor came to me and said that some of the other interns were uncomfortable using my name and asked if I could go by my middle name or another nickname. \n\nI won't share what my first name is, but it is technically a racial slur. My parents didn't know it at the time when they named me. It wasn't used that way in my country and it is just a pretty sounding name. My mom said she actually named me after my grandma's favorite song. \n\nThe thing is, that I really LOVE my first name. I *hate* my middle name and I have never gone by a nickname in my life. My name is a major part of my identity. \n\nSo I told the supervisor I wasn't comfortable using another name. The people in our group who were initially bothered by it escalated things to HR and HR basically came back saying that since it is my legal name they can't force me to go by anything else. \n\nAfter HR basically told them nothing could be done, it became really apparent which of the other girls are the ones who took issue with my name. They started referring to me by my last name alone. My last name is stupidly common, there is another person on our team who shares it, and a 2nd person who shares a name very similar to it (literally 1 letter off). They do not refer to any of the other people in our group by last name alone. \n\nSo I started ignoring them. They'll go \"Lastname. LASTNAME. HEY LASTNAME\" and I just calmly look at them and say \"My name is X. If you need my attention, you will need to refer to me by my name\"\n\nI know it is causing problems in the group and that they are mad at me about it. But, like, it's my actual name. It feels like shitty bullying being singled out with this last name crap.\n\nAITA for insisting on being called my name if it makes people uncomfortable?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "[removed]", "NTA start calling them by their last name.  Or go to HR as what they are doing is bullying and they can and should be disciplined and or fired.", "You didn't choose your name, and there's no reason for you to be ashamed of it.\n\nNTA.", "NTA. It's your name and you should be able to use it.", "Unfair Owl I realize it was escalating. Makes it worse", "Unless your name is something like the N word or something equally degrading then NTA…", "NTA. Absolutely no Americans (in the midwest) I know actually know that Gypsy is a slur. People here think they’re like pretty travelers. (Think belly dancers)", "NTA it's literally your birth name. What's the point in telling someone saying their name makes you uncomfortable when they can't change it. You also didn't pick it and you don't seem to be a person that goes out of their way to use slurs or be offensive. You can call someone whose name is Gypsy (I'm just guessing that's what it is or something like it sorry if I'm being too presumptuous) by their name and  not use it in a derogatory way against a Romani person(?)  at the same time. What do they want you to do, get a time machine? Expecting every person named that to change their name is asinine.", "NTA!!! I am inspired by your strength for standing up for yourself and your name!!!", "NTA - its your name, people really dont care about the context to things and i personally would balk at anyone trying to influence or control me because their feeling got hurt, just typing it out makes me further appreciate how absurd and frankly pathetic it is.", "NTA.\n\nOne of my high school teachers was named Ms Paki (she was not from India or Pakistan, she was from the Pacific islands) and a few people complained about it because p**i is a pretty serious slur, but the same thing that applied in that situation applies here:\n\nIt’s a different context, and you do not have a right to dictate another person’s name.\n\nIf that was your nickname, sure, I’d say use something else. But it’s your name.", "To be clear, just because you like your name, and think people around you don’t consider it a slur, that doesn’t make it not a slur. You keep trying to say it’s not a thing in your country, it’s in Europe, etc. but it IS a slur in your country, or we wouldn’t even be having this conversation. Odds are pretty good that a lot of people around you know this, and just haven’t said anything to you because they don’t want to offend you, or don’t know how to deal with the fact that your name is a literal slur. Is it your fault? No. Times change, and the meaning of words change, too. But you have a choice to make in how you deal with it going forward, especially if you intend to continue working in non-profit organizations (or any client facing companies), which often deal with marginalized individuals. You can either come up with a substitute nickname that you are comfortable with to introduce yourself by (and use on resumes, business cards, and the like), or you can continue to insist on using your given name, which you know many find offensive, and both hurt others and limit your future opportunities. \n\nThe other thing to keep in mind is that G*psy has *always* been a slur to Romani folks - it was only ever “acceptable” to non-Romani (and mostly white) people. And to those who are insisting that the word is ok because they know “nomadic” folks who claim it, that called cultural appropriation, and it’s gross. Imagine a group of people deciding to live by Indigenous cultural traditions, and not only calling themselves Indigenous slurs, but claiming that people can’t be upset about it because they’ve claimed it? GTFOH. The only people who have the right to reclaim a slur in such a way are the *people who are actually affected by it,* not a bunch of pretenders who want to glorify their lifestyle without having to deal with the actual oppression and discrimination that come with it.", "YTA, but barely.\n\nI disagree that American's don't know it's a slur or that it's not an unusual name. I get that it's yours. I guess I'm having a hard time understanding why you're resistant to a nickname or Ms. X. I admit that is my own bias, as I have gone by several nicknames over the course of my life and liked trying on those different names.\n\nI can absolutely understand why others would be uncomfortable. You seem to be arrogantly proud of your name (and in denial about people not knowing it's a slur) to the point of not being willing to communicate with those who tried to work around it. They tried, you don't like their solution - fair enough. Tell them why you don't like it and work together to come up with a solution you can all live with.\n\nAt the end of the day, as HR said, it's your name, you can insist on it. I also advocate for not changing something about you just to please people. Having said that, sometimes you can make your life a lot easier by giving a little here and there. If it's that important to you, fine, die on that hill. Just know that you're not immune to the consequences of making your stand - even if they are as small as having three women in your office not like working with you.", "NAH. Oddly enough I was just considering this exact scenario the other day, in a purely hypothetical sense.\nI grew up using that word and no longer do.\nThe word is a slur. It’s unfortunate that your name is spelled and pronounced the same as the word. You are not obligated to change it. I think the coworkers should address you as an honorific and your surname (and not bellow it at you).\nAt some point you may end up choosing to adopt another name (such as Gigi) just because things might be too difficult for you socially with your given name. And I am sorry about that. It’s an unfair complication in your life.", "Just start going by Psy, like the Gangnam Style guy.  Problem solved!", "NTA, your name is your name, if it doesn't bother you it shouldn't bother anyone else. Sounds like your co-worker is just looking for any excuse to be offended. These are the type of people who get offended by a stop sign", "Just adding this to the conversation without a vote - I am from the south in the USA and even I know this is a slur. I do think OP is underestimating how many people know this word is a slur. They may not say they know it or may not speak up but I have to believe most people here (if this is the country in which OP is working - couldn’t get clarity on that) DO actually know. Again, no judgement, because this is a difficult situation, just food for thought.", "NAH. Start calling your coworkers by their last names too.", "NTA, and if you love your name, stick to your convictions. It is your right. This is as bad as, for example, one of my brothers-in-law. His name is common think \"Daniel\", he prefers to go by the full name. But people insist on calling him \"Dan\".", "“Gypsy” is not a slur in the U.K. or Netherlands at least.  Though deliberate variations of the word are. I can’t think of anywhere in Europe it is, but happy to be corrected.", "Soft YTA. If your name was the n word we wouldn't even be having this discussion. But there is no difference. Slurs don't come with degrees of badness.\n\nI get wanting to be called by your actual name. I'm sympathetic to that. But if your name was the n word we wouldn't even be having this discussion. It would be obvious to everyone.\n\nI would be uncomfortable using your name, and I'm 42 years old. Not exactly a youngster who's \"offended by everything.\"", "Me and my (red-headed) partner have a ginger colored dog named Ginger (she came to us with that name), and one time my partner came back from a walk telling me how they were doing an outdoor test with our puppy to come back (she does like being randomly tested on walks) and kept on going “ginger, come!”….turns out, another redhead in the complex was turning the corner at the same time and the rage turned into an “o” of understanding that went through that persons face was apparently like an emotional wave haha", "*ding ding ding*", "Is Ginger a slur? My redhead daughter refers to herself as a ginger…", "I didn't realize Ginger was a slur. Can you tell me more?", "Ginger is a slur??????? Why?", "I’m going to go with Fanny.  In European countries, it’s slang for “vagina.”   Knew a girls who’s last name was (American) Fanny, who went overseas and they insisted that she pronounce it as Fah-neh.”  NTA.", "Gypsy is what a lot of people self identify as and they *hate* when people try to tell them it's a slur. There are some groups that consider it a slur because they don't want to be associated with them but in relation to the people who will generally be called a gypsy, they are gypsies and proud. Definitely respect what people wish to be referred as.\n\nOP is NTA, it is their name and they should escalate the issue to HR.", "You should edit your comment to give a final vote. You are top comment at the moment.", "This comment is currently the most upvoted and will get OP labeled TA if it is not edited.", "TIL the second example is a slur. I really thought Tim Minchin was just making a joke.", "While I don’t find the name offensive. Ever heard of the TLC series “My Big Fat American Gypsy Wedding “?  They are proud to call themselves gypsies. But if someone tells me that they’re offended. I will take it seriously. \nPeople keep complaining about how sensitive people are nowadays by being offended over everything. Trust and believe people where offended back then too. They just didn’t have a voice. If you have one voice who says that their offended against 50 who calls you too sensitive, that one voice gets drowned out. But if you have 100 voices who are offended against the same 50. People are starting to pay attention.", "I worked with a Gypsy (both social workers) and no one ever took issue with her name. Her mother was a hippy so 'Gypsy' meant nomadic, free-spirited etc.", "I'm going to assume it's not Ginger because I don't think people are that sensitive about redheads. Since OP said it's one of the two I think we now know it's Gypsy. That's not actually a slur though. Now saying that somebody \"gyped\" you is a slur because it's using that word as a pejorative. The way I see it is that Gypsy is both an ethnic group and used in ways that is not associated with that ethnic group also. Just like Africans are often referred to as Blacks but black is used in tons of ways that have nothing to do with the racial group.\n\nOh I almost forgot the point of this. NTA.", "OP YTA. It doesn't matter that your parents didn't know it was a slur, they learned it was. They named you a word from another culture without doing any research because they're willfully ignorant. You are worse though, you know it's offensive and you continue to need to be called by it and find no compromise because you don't care about the negative attachments. Romani people are regularly dismissed by western cultures for finding offense to a word created to degrade and dehumanize us. Do research on why it's offensive. My culture is not your cute quirky name. You aren't special, you don't get a pass. YTA and so are people who think like you.", "Ginger is a slur?", "Wait, ginger is a slur?? Isn't this how people red of hair are called, just like people black of hair are called brunette and people with fair hair are called blonde? Or am I making some confusion?", "NTA, but you may need to use a nickname anyway.\n\nJust hopping onto this comment to add my family's own experience with our perfectly reasonable Chinese family name that, when spelt phonetically in English, becomes the name of a water filled device used to smoke drugs.\n\nMy dad had to legally change his entire name, not just his given name, to be able to even get a job interview.", "> A little long-term perspective: If you plan to continue to work in regions where your first name is considered a racial slur\n\nIt is not commonly thought of as a racial slur in my country. I mean it is, but it is not used as one in common vernacular here", "This. You have to realize this will always be an issue. I’m going soft YTA bc you’re being unfair. It’s not your fault this is your name but you have to realize this puts folks in a terrible situation. What if they say your name in public and someone takes it wrong? There are real world consequences to these things now especially with everyone having a camera.\n\nEDIT: I’ll take the downvotes. This is unfortunate but I agree with the above comment. This could hurt OP’s career advancement. It’s unfair but such is life!", "That's how I feel about it.\n\nLike I get that it can be a slur. But it is not commonly used as a slur in my country. It's my name. I'm named after a dang Fleetwood Mac song ffs.", "Totally agree. I don’t think it’s reasonable to force other people to call you by your name (Gypsy is absolutely a slur) because you “love your name.” If you don’t like middle or last names maybe work on a nickname with those 3 colleagues who’s re uncomfortable. \n\nPeople go by nicknames all the time at work when there’s someone with the same name.", "Ms. Last name is definitely the polite way for her coworkers to solve their personal problems when referring to her.", "I mean I knew it was a mean word when I was a child 20+ years ago, and I've lived in the US my whole life. It being an offensive term is not as new as a lot of people are making it out to be. I'd be willing to bet it was pretty common knowledge even before I was born.", "OP’s issue with people calling her by her last name is that they are barking it out like she’s in the military or in high school by a coach. They aren’t offering her the respect of using an appropriate honorific before her let name. It’s different being called Smith vs Ms. Smith and when there is someone with the same last name around too.", "I also use the various methods of \"addressing without naming\". But my reason for using them is because I forgot the other person's name and I don't feel comfortable asking for it again. 😳", "Genuine question, was it actually a misspelling, or was it a Persian name that unfortunately sounds very like a slur beginning with N in English?", "If you believe not one is an asshole the judgement is NAH", "> who don't want to repeat a racial slur in their own language\n\nMy name is in the same language that their native language is.\n\nIt's more along the lines of it is used as a slur more commonly in other countries than our countries, which is why my parents never realized it could be \"problematic\"", "What you're looking for is NAH", "Exactly this. “*Technically* a slur” what does that even mean ??", "> it’s not the literal worst slur \n\nLet’s not rank slurs now", "Thank you so much for this. I really don’t know what I would do in her colleagues’ situation because I really don’t think I’d be comfortable saying that word everyday. I cringe every time I have to hear someone say they “got gy*ped” even tho I know they are unaware of the origin of the saying.", "I'm amazed at so many people here saying that they shouldn't worry about other peoples comfort. My stomach would turn if I had to say/hear a slur all day", "Yeah also from a professional standpoint I'm imagining try to have someone with this name sending emails from the company or going to conferences with her name on a nametag... like, it's going to be an issue. It's not her fault but it also isn't the fault of other people who don't want to say an insulting or offensive word.", "My name is a major part of my identity. I don't see how my wanting to be referred to my name even though it offends some people is any different than anyone else wanting to be referred to their identity markers. Is it OK for conservative christians to refuse to use someone's preferred pronouns because they find it offensive?\n\nI refuse to answer to the way they bark out my last name because it is disrespectful. They use just my last name, like they are running a boot camp or coaching HS sports.", "We are all from the same country and are native english speakers.\n\nMy name is unique but not suuuuuper unusual. There have been celebrities with the same first name.\n\nIt's a name that's probably more common for dogs and horses than people. But it is mine and I adore it.", "But they exist for her comfort? Ok", "It's used as a slur in the song! The chorus of the song lists the cruel names that were thrown at the character and her family! I was about five when the song was released but I am still embarrassed that it took me as long as it did to register that it's not a good thing to call someone.", "That is literally their name though. Like I'm sorry but thats just damn rude on you part.", "> I'm surprised you haven't encountered this to this extreme before.\n\nProbably because most people don't even know the name is technically a slur.", "In no way, shape, or form is the OP T A.", "> But honestly your parents are the real AH here, what a shit situation to put your kid in.\n\nThey most certainly are not. \n\nI was named after a very popular song that was in the top 10 of the charts back in the 1980s when it was first released. \n\nMy name was *not* considered a slur in my country at the time I was named. They are *not* assholes for choosing this name.", "OP, you can't live your life controlled by the feelings of others.\n\nYour name is your name, and if they can't cope with it, then they are overly sensitive.", "> You're making everyone uncomfortable.\n\nMy immediate supervisors, HR, people from other departments and 27/30 of the people in my immediate work group have zero problem with me.\n\nIt is a group of 3 girls who have a problem. \n\nThere are multiple members of the group who have offered their support to me in regards to this.\n\n>You're in your first professional networking role and you're making everyone hate you. The non-profit sphere isn't as big as you might think and you're tanking yourself for no reason.\n\nThis is not my first professional networking role, nor do I plan to work in the non-profit sector after the end of this internship so that is a non-issue for me.", "No worries about that. I never planned to work in the non-profit sector.", "> it’s a racial slur in the country and language that are most prevalent wherever you are\n\nIt's not prevalent as a slur here. Most people here don't even realize it is a slur\n\nIt is more commonly considered a slur in European countries. \n\nIt is not seen as a slur as commonly as it is here in the US until recent years", ">10 years older? You can weaponize that. I mean, in a positive way. \"Oh, I remember when I was your age...\"\n\nHmmm...", "> You are just starting your career. \n\nI'm not.\n\nI'm a non traditional student.", ">How are you being disrespected by being called by your last name when it's literally your name?\n\nBecause they are not my drill sergeant, basketball coach, or supervisor. We all have the same title. \n\nAnd I have specifically told them I do not wish to be addressed by my last name alone.", "> It’s too bad you’re an intern, and have to make a good impression. If I were in this situation, and not an intern, I’d announce cheerfully that as they couldn’t bring themselves to use my real actual name, I didn’t feel I had to do the same for them. I’m thinking “Grumpy,” “Sneezy,” “Dopey” and “Doc” for a start.\n\nLMAO\n\nOh that is something to consider! Maybe I will\n\nI don't actually *need* this internship. I have my own established business that supports me. I went back to school and took on the internship for personal reasons. It would have very little impact on my life overall to engage in shenanigans LOL", "I have considered this but don't want to make a big deal out of it either.", "Oh yeah. Definitely. LOL\n\nIt's Gypsy.", "They are *not* calling me Ms. Lastname\n\nThey are barking out ONLY my last name like a highschool basketball coach on a power trip yelling at the JV players", "OP owes nobody their comfort. They were named at birth. End of story. That's where OP needs to push back. OP is entitled to live with their name, and to correct ANYONE who calls her something else.", "> Id actually go to HR and complain about your professional behavior at work.\n\nThey have gone to HR.\n\nHR said they can't force me to go by another name if I don't agree to it", "I couldn't tell you for sure as we have never discussed personal ethnicities, but the 3 that have a problem with it are all very white-passing at the minimum. \n\nThe handful of people who it could apply to get on very well with me and have no problem saying my name. But that could just be because I am also not white and we tend to stick together LOL", "Nice username ;)", "but it is though. otherwise the coworkers would not be uncomfortable", "LOL \n\nThank you! \n\nI feel your comment so hard <3", "that the OP is called by their last name? what HR is going to do about that? it is also their legal name. I guess they can start calling everyone by their last names.", "People guessed it very quickly", "Same, I fully expected this to be a Negar situation since I've seen that upfold a couple of times before 😬", "Uh, you do realize that Cher was saying people called them that as an insult, right??", ">Peace and love to you Ms. Gypsy.\n\nThank you. That was very sweet <3", "I love this.", "OP's mental gymnastics, compares not wanting to say a slur at work with being transphobic:  \n\"I don't see how my wanting to be referred to my name even though it offends some people is any different than anyone else wanting to be referred to their identity markers. Is it OK for conservative christians to refuse to use someone's preferred pronouns because they find it offensive?\"", "The mental image of that is hilarious to me", "You know the majority of Redditors are very very young. They have no clue about amazing Cher songs and are only offended by things they are told to be offended about out of context on social media.\n\nNTA for using your beautiful name. At least 50% of all women born before 1985 wore a costume that we called by the same \"slur\" too. It was a favorite for when you wanted to look cool and glamorous. Heck, Disney made a film using the same word in a song in the 1990s-are people going to want that movie \"cancelled\" soon?\n\n YT silly for asking for feedback here :) It's a bunch of 14 year olds with a handful of trolls and a pinch of normal adults who are wasting time because we're bored. The pinch is all on your side here. Your coworkers are awful brats.", "As someone who is Romani- I would not be able to work with you. I would be extremely uncomfortable being around someone who uses a violent slur towards my people as their name.\n\nThat's just the facts.", "NTA. u/ilikemynameaita There's nothing wrong with your name. I assume from reading some comments your name is Gyxxy. (Sensoring it incase its a banned word 🙈) I understand how some people have used your name to refer to a group of travelling people, and it can be used as a negative name for them, but there are also people proud to have that name for their heritage etc. \n\nThe fact it is your BIRTH NAME they have NO reason to be offended by it as its not being used in a malicious phrase with any maliscious intent, and they have no right to try to refer to you by another name or your surname. They are effectively bullying you now. So they are trying to claim YOUR BIRTH NAME is offensive to them, and complained to HR, and they've been told they have to call you by your name. The fact they are going out their way to now call you by your surname singling you out in that way, after you've asked to be called by your 1st name, is now classed as harassment and bullying and possibly even a form of racism in itself. \n\nAdvice going forward. Either....\n1) make it clearly known to people in the office, by sending an email to everyone, stating that there has clearly been an issues with some people regarding your BIRTH NAME being Gyxxy. Say that it is what you have been called all your life. It is not meant in anyway racist. You were named after your mums favourite film/song (I think I read a comment where you said something like that as the inspiration to your name.) That you like your name, and choose to see it in a positive way, after some of the old films or songs etc. There is no racism involved in your name. You love your name, and it is a part of who you are. And for that reason, you don't wish to be referred to by another name. Everyone in the office is referred to by their 1st name, and you should be no different. That you hope this clears up any confusion or question regarding your name or what you should be called, and that going forward you expect to be addressed as Gyxxy. \nThank you for your understanding. \n\nOr...\n2) just go straight to HR and make a complaint of harassment and bulling and possibly even racism in the work place as you are now being singled out by being the only person referred to by their surname when you've already stated you want to be called by your 1st name just like everyone else is. \n\nSo it's up to you whether you want to just go straight to HR now anyway, or whether you send the email first, so it's a clear message (and you've got written evidence you've made it clear to everyone should you need evidence for a future complaint) and then if people don't comply and still try calling you by your surname then go to HR. But I'd give it a week maybe after the email just so you can see who out of all of them are going to try to continue calling you by your surname. If you complain straight away after the 1st person does it, you don't get to report others that would have continued. So I'd give it a week or so, to make sure they've all had plenty of time to read the email, and just keep a note of who has continued to refer to you by your surname during that week, with a date and time roughly etc. Then go to Hr with the list of bullies names. If they confront you about your name again, and say anything rude or unkind about you wanting to be called by your name, write down everything they said / what you said and where you were when the conversation took place etc. (You may have cameras in your workplace that they can check and listen to depending on your company). But it also shows clear evidence of when and where it happened, if the confrontation was just spur of the moment or whether they came to you to talk about a work thing, but called you by your surname, and that provoked the conversation etc. \nEvidence can make all the difference. \n\nBut don't let this slide, and don't be manipulated or bullied into accepting being called something else other than your given legal name. It's your name for God sake. I'd never think someone was being racist if they had that name.", "The only nickname I can think of for that is Gyp, which isn't exactly better. Maybe Gigi? But if you don't like your name being shortened, you shouldn't have to. A friend of mine named his dog that and got some flack over it. But honestly, I think as long as you're not using it the way that makes it a slur, ie; calling a band of Romani people Gypsies, then it's not the same thing. It's a name.", "NTA\n\nEither of those names is lovely.", "Love the song, and love the name. \nThis is their problem. Fuck them.", "While I'm not personally bothered by your name, I think this is a clear NAH\n\nI wouldn't want to call someone \"n-word\" even if it was their legal name.", "It’s a lovely name OP. Like someone else said, all the adults here agree with you.", "In Australia redheads get called ‘rangas’ short for orangutans. I’m a redhead and was so damn offended. But now ….. I’m just used to it. I don’t call myself one, but it’s like water off a duck’s back.", "In the US ginger is not a slur. It is a synonym for redhead, can be used in an endearing way, or can be a proper noun. However, in the UK it is considered offensive to call someone a ginger.", "My husband changed his name to Ginge, as that was all he was ever called.", "Your daughter is a redhead, she can use it to describe herself if she wants. But it is used as an insult, particularly in the UK. Some people are more sensitive to it than others.", "My uncle is a redhead. He goes by \"Red\" lol", "My husband occasionally refers to himself as ginger, but growing up was bullied a lot for his hair colour. So yes, in the UK it is used as a slur.", "It's not", "Cartman said they don't have souls, so there's that.", "Whole lot of people weren't/aren't fans of the Irish, and red hair has kind of always been known as an identifying trait. It can be considered a racial slur depending on where you're at, some people *really* don't like the Irish.", "It isn't. Someone pulled that out of their arsehole.", "Why do I need to edit? OP said I'm right, her name is either Ginger or Gypsy.", "Those people are literally paid to pretend to be travellers. None of them are Romani, or even irish travellers. Lmao.", "Eh, I wouldn't be so sure, awareness of that word is definitely changing in the US. Ten years ago I wouldn't have thought twice about using it in any company, today I would actively consider my audience before doing so. I'm in my 30s and I can think of a handful of words that were used without consequence when I was a child that would get you called a bigot today, because both language and social mores can change quickly. I wouldn't bank my career on it not being widely considered a slur in 20 years.", "There are plenty of people who do consider it a slur in the US, especially among millennial and younger folks who are increasingly moving into management and hiring positions. \n\nI have a quite a few friends in the rural Midwest who would unfortunately rather not talk to you than say a word that they feel denigrates their heritage. That motivation, right or wrong, will also exist in professional settings. Do consider if it’s really worth sidelining yourself in terms of career advancement to stick with a name that, even if you love it, does make quite a few people uncomfortable *where you work.*", "Right there!! If you work in regions where your first name is considered a slur. Just how far do you think that you would get in business if they find your name offensive?", "NTA to me, but to piggyback off what they've said, fair or not, some people are judgmental about names. I don't see the issue since it is your legal name, but I also know a woman who didn't get hired for a job because her name was Sunshine. The woman doing the hiring thought it was too strange to call a person. \n\nIt's definitely not fair but absolutely can happen. This specific example is because we both interviewed for the position, but since we were both the strongest candidates, the only drawback was really her name. I didn't find out for a while, but it eventually came out when discussing hiring for other positions.", "It's definitely known as a racial slur here.", "I think her name is Gypsy. She lives and works in the US. It's not a slur here", "When used to as a pejorative to describe specific group of people, then yes it is a slur. When used as a proper noun, like in your name, it is not.", "I’m American and in my 30s and know it as a slur, and gently correct people who use it to refer to those people — even not as a pejorative. And like, get a little uncomfortable with how it’s appropriated in popular culture/how that ethnicity is fetishized.\n\nBut it’s your name. And it’s been a name for a while. And calling you by your name isn’t offensive.\n\nIf it was your nickname and you weren’t from that culture, I’d say you were an asshole (like that celebrity using it for his lifestyle brand — can we not profit off a people who are frequent victims of genocide???) but it’s YOUR ACTUAL GIVEN NAME, and it was given at a time when using it was NOT at all problematic in America. NTA.", ">I'm named after a dang Fleetwood Mac song ffs.\n\nAnd a damn great song it is, too. *nods sagely*", "You said in a later comment that you’re from the US. It’s absolutely commonly used as a slur here.", "I’m in North America and I knew it was a slur, being ignorant to it isn’t the best defence.", "American here, literally have a friend whose nickname is Gypsy Fingers. She has Gypsy heritage and absolutely loves the nickname. We also have dark humor though as I have cancer and my nickname is Chemo Fingers, so we may be off balls, but in America I wouldn't say it's a slur, especially when it's literally your name. BTW awesome song to be named after.", "I never knew that people could be named Gypsy. That makes more sense than the name I had in mind (which was Ginger).", "I would have been more open to this. \n\nBut the shouting out my last name like they are my HS basket ball coach or running a boot camp really rubs me the wrong way and feels vindictive because I didn't immediately give in when asked to go by another name.", "Yeah that just sounds like an excuse to me", "Oh Jesus. If we called op the gentle lady of the dawning sun would that be respectful enough?", "They’re in the same position in the company, I don’t use honorifics with my direct coworkers, do you?  I think it’s a little demeaning to demand honorifics from people on the same level as you", "OP stated they only escalate to “barking” her last name when she’s being petty and ignoring them on purpose.", "When you were born. Doesn’t mean that’s the case anymore. Again not your fault or fair but it’s also not your co-workers fault that the word is problematic now.", "I don’t know why you keep using quotation marks around problematic(because it is) or saying it’s technically a slur (because it is).", "Oh, I see. Sorry, I didn't understand your original post correctly.\n\nIn that case... NTA! They need to respect your name.", "I have a coworker whose name is pronounced exactly like a rather rude slur in the language we all speak as a first language. It makes me uncomfortable to use it. But I don’t think they’re the AH for insisting on using it.", "It's means it's definitely a slur, they just don't care.", "I genuinely don't understand this comment, some slurs are worse than others, the ranking may depend on country and region to some extent but some literally are just harsher.", "It's a slur. That's why people are offended. Real people whose culture and identity have been systematically attacked and denigrated for centuries. You realize that apart from Jews, Romani were treated and destroyed with the same disgust, like vermin. The racism is still well alive today. Maybe think about that next time you have a little power trip.  \n  \nRomani people originated from India, but Europeans didn't know much about India compared to Egypt. So quickly, they got called Egyptians, and a racial slur to refer to Egyptians is Gypsy. So there you go. That's the origin. It's not just about Romani people.", "Ma'am, I am trans. \n\nPeople refusing to use my pronouns (they're not \"preferred\", they're just my pronouns) and my name *because they're transphobic* are being transphobic. \n\nIf they didn't want to use my name because I named myself a racial slur (which the G-word is, yes, even in America) and they refused to use my name *because they don't want to utter racial slurs* then that is not transphobia. \n\nContext matters, and we trans people don't exist as your shield when you're trying to force people to say a racial slur just to interact with you.", "a conservative christian refusing to use a trans person’s pronouns because they’re bigoted is not remotely comparable to someone not wanting to say your name that is a racial slur", "YTA for this comment. These two things are so not comparable.", "Honestly anyone I’ve ever met who says “their name is a huge part of their identity” is usually obnoxious.", "The difference is that using non-preferred pronouns is actually offensive, and that using a slur is also actually offensive, while using someone's last name is not*.  If the problem is that they're just shouting 'JONES' at you, would it be acceptable to you for them to address you by 'Ms. Jones'?  or 'G'?  \n\nAlthough if the real problem is that they're using a mean tone of voice....that can happen no matter what name they are using.\n\n*literally offensive, because it is meant to offend.  If someone misgenders someone on purpose, they are trying to hurt that person.  If someone directs a slur at someone, they are intending to offend that person.  If someone uses someone else's last name, they are not, usually, doing so in order to offend that person.", "I so feel you. I know it’s not the same circumstances, but my name is Christian and people always do the “Well are you a Christian?” And when I say no they act so offended, like “Well why not?!” Like, because that’s my name I have to be of that religion. It’s caused many an awkward situation, but I won’t apologize for it or lie and say I am just to appease them.", "You can search the Social Security database, and you gave your name away in other comments. Your name has not been in the top 1000 names for even a single year since 1920. It’s a pretty unusual name. Guido actually shows up every year for more than a decade. That doesn’t mean everyone should have to be comfortable calling someone else that just because it’s on their birth certificate.", "Hey OP, would you feel the same if it was someone named after the 'N' word? Would you feel comfortable calling them by that name?", "[deleted]", "They have the names given to them, no less than OP. They are no more entitled to use their given LEGAL names than OP.", "Well at this point, HR has said that they cannot NOT call you your name. If they continue to isolate you by refusing to address you properly, submit a complaint with HR yourself. You're still NTA. They need to get off their high horses.", "It’s not a technicality it is a racist slur that’s why all animals with it as an identification are being renamed. Part of evolving is learning better and doing better. \n\nYou’re upset that your coworkers don’t want to use a racial slur and refuse to compromise even though you know it’s a slur and they know it’s a slur. They are trying to be better people and you are refusing to let them. You don’t want a nickname that’s absolutely ok. \n\nYou refuse to answer to your actual last name so that ppl who are uncomfortable using a racist slur cannot address you without using a racial slur YTA.", "They weren’t an A H until they refused to answer to their literal last name and are fixing others to use racial language they are not comfortable using.", "Okay.  What's your solution then? That their peers grow a thicker skin and use a slur? I maintain my stance that referring to someone by their last name isn't disrespectful nor bullying", "Look i love Fleetwood Mac too but People did a lot of shit in the 80’s that isn’t appropriate now. (it wasn’t than either but society was OK with it)\n\nThere were many laws criminalizing gay people, the f work was still regularly used. The fact that it was OK in the 80s isn’t really that defense that you think it is.", "Romani have ALWAYS considered it a slur. Just because the general public didn't listen doesn't mean it wasn't a slur", "Hard to say without knowing the slur, but I’m willing to bet it was offensive in the 80s and it’s just that nobody gave a shit about whatever group was being put down. That’s how things were for a lot of marginalized groups 50-70 years ago. But I get where you’re coming from, times change and it’s not on them to predict what the world will and won’t care about. \n\nStill think YTA though. There is valid reason to not be comfortable saying your name, that’s the hand you’ve been dealt.", "False. Cher very clearly made this point in her song that predates the Fleetwood Mac song.", "They aren't calling them another name. They are just using their last name. People call me by my last name all the time. It is not disrespectful.", "Ohhhh it’s Gypsy isn’t it? Assuming it is… that’s rough… because it’s not like a coincidental homophone but it’s literally a word borrowed from the language in which it is in fact a slur.\n\nHave to say NAH, it’s fair to want to be referred to as your birth name but it’s also fair that your coworkers don’t want to say that word.", "It wasn’t a slur when we were young but it very much is now. It sucks for you but I suggest finding an alternative because this isn’t going to be the last time this happens, and it’s not going to go away.", "Ahh sorry, the mention of an internship made me think that. As a non traditional student myself, I should know better.", "You all have the same title but only one has a slur for a first name. Why is your right to be called by your first name more important than their right to not want to say a slur?", "Kinds already make it a big deal lol", "Oh how fast I would be going to HR over this. Your name is a non-issue, what they are doing is beyond disrepectful. Insist on an apology and a commitment that this will cease immediately. Your comfort is as important as anyone else's. If they will use only your last name then fine...so long as it applies equally to everyone.", "What if they called you GiGi or something? Lol.", "Thank you!", "Isn't that OP just prioritizing their own comfort over that of other people?", "So then everyone needs to ignore you and stop talking to you.\n\nEdit: ignoring someone isn't bullying.", "So they’re likely just woke and needing everyone to see that? Ugh, sorry they’re making a toxic work environment for you.", "Yikes. If your mentality on this issue is that it’s “woke PC mindfuck” then I can only imagine that this is likely not the only problem your coworkers have with you. You don’t seem like a very open minded or understanding person.", "OP has stated her preferred name. HR told them to use her preferred name. Instead, they are apparently screaming her last name at her, creating a scene and possibly a hostile work environment.", "Yeah I didn’t keep reading long enough. But the original post is super annoying for not just saying the name.", "It’s a song about the life of a girl in a traveling show.   And Cher is the girl.  I don’t see the insults you do cuz there are no judgements or condemnation in the lyrics.  Just the description of her everyday life in the culture.  Gypsy is/was the word to describe that lifestyle. \n\nI personally don’t find the name offensive.  But if you do, that’s your prerogative", "I mean we also used to dress up as homeless people and Indian Princesses. It wasn’t great.", "Saying people wore it as a costume really doesn’t support your argument when people would also wear fake Native American war bonnets. You can think that OP is NTA without dismissing the fact that the word *is* a slur and Romani people have made that clear. I even personally knew Romani people who were very upset with that word.", "I don't think it's silly to avoid using that word since it is, in fact, a slur -- so it's not just kids and social media.\n\nBut in this case, it's not putting down a group of people.  It's a name here.  While I wouldn't endorse a baby being named that now, that's past and moot for OP.\n\n(And I still love the musical by the same name)", "Confession... I'm *at least* a decade older than my fellow interns. (Didn't go to college directly out of HS. Took me like 11 years to afford it)\n\nAmazing how fast things change I guess. \n\nAnd I loved that movie as a kid. Probably a huge reason I love my name so much. What I would give to dance like her!", "All I can think of is Monet X Change singing as Cher: Cultural appropriation wasn't even a word\n\nWe don't have to cancel, but we also don't have to repeat. When the people referred to as a whole asked for it to stop, it's usually nice to listen.", "What's interesting is, the word is absolutely used as a slur in the Cher song.", "I agree OP is NTA but dressing up as an extremely offensive and, almost always historically incorrect ( wrt the gypsy fortune teller stereotype, ‘Indian’ princess, etc ) which was always offensive, people just didn’t care, is kinda ignorant in my opinion…", "Hey, actual Romani here- it's a god damn slur and people were not dressing up respectfully. People were dressing as a magical exotic woman who was banned from cities because they were seen as thieves.\n\nStop talking as if you have any right to declare the word a slur.", "Ah yes, damn kids learning the bigoted meaning behind common words and actually listening, learning, and changing their language. I was born before 85, I’ve seen Cher live a few times, I wore the same costume, and now I understand why that wasn’t great and I won’t do it again. \n\nIt’s not hard babe.", "What about the Sinti and Roma? Does anyone bother to think about how they feel? What if one of her coworkers is from that background?", "Everyone gets so angry when you go to work in blackface nowadays. And you should have seen the dirty looks I got when I dressed up in my hook nose and hessian sack with a big dollar sign on it.", "Blergh. I hate everything about this attitude. Young people are offended by different things because they’ve learned and thought about different perspectives. Apparently you’re too cynical to be willing to do that, but the failing here is with you, not the kids.", "back in my day people were racist all the time and no one complained! now its those gosh darn teenagers getting all upset when i scream slurs at people for existing that are the problem!\n\ngo back to bed buddy", "It could be for the Fleetwood Mac song.", ">It's a bunch of 14 year olds with a handful of trolls and a pinch of normal adults who are wasting time because we're bored.\n\nLook man it's either post on reddit or look out my office window becuese out of my 8 hour shift at work I have like 30 minutes of actual work.\n\nAnd the other 7 hours and 30 minutes is just for reddit/shitposting!", "And you'd be well within your rights to quit a job where the environment wasn't good for your mental health or esteem, such as having to hear that word all day.", "Since it's OPs legal name, that would be a you problem. She shouldn't be forced to go by a different name just like a trans person shouldn't be forced to be identified as they're birth gender.", "Gyp is significantly worse.", "Cece?", "Haha. No it isn't.", "It's not a slur though, it can be used as an insult, but let's not act like it's the same as slurs for racial groups", "I never knew this, I guess that's what I get for being an American. Also, I had a teacher in high school call me that because my actual name is Mary Ann and he liked Gilligan's Island.", "Depends. My dad’s ginger and proudly so", "I have about ten other redhead friends and we all call each other Ging 😂", "This is verifiable bollocks.", "damn I didn't realise this was a slur in the UK but makes sense in the context of anti-irish racism", "Huh. Now that I think about it, I do have a vague memory of Catherine Tate mentioning it in an interview.", "Because if you don't put dots/spaces/dashes the bot will just read the first answer you put which is y t a instead of the 2nd answer and when new people come look at the post it might have an asshole tag on it", "I assume it’s because you use the magic letters Y T A and the algorithm sees that but not the context", "If you leave your comment as is the judgement bot will declare it as a YTA vote since that was the first one you wrote. \n\nIf you want the vote to reflect your judgement of NAH since OP confirmed the name, you'll need to edit it.", "Yeah I am in the midwest and grew up near some Romani people and new it was a slur. I am in my mid 30s", "> Just how far do you think that you would get in business \n\nWell, I actually own my own business (a restaurant and catering company) that I took a sabbatical from because I wanted to go back to school.\n\nMy business is well established, paid for my school, is still currently paying my mortgage and monthly living expenses, and is unlikely to be any more effected by my name in the future than it has been in the last decade I have spent building it. \n\nI have zero concerns about my name effecting my future financial prospects.", "It is considered a slur here now. The US also adopted Romani instead at least in the blue states. Where I live it is a slur. Not as shocking as others but still. Why not go by Gigi or something.", "Thank you. I'm so stealing this <3", "I *almost* looked up 'Rhiannon slur'", "It is. *nods in agreement*", "Then why not suggest the honorific? Explain that you're open to Ms Last Name if they're uncomfortable using your first name - your coworkers will probably be glad you came up with a win-win compromise.", ">But the shouting out my last name like they are my HS basket ball coach or running a boot camp really rubs me the wrong way\n\nMaybe it's time for them to learn how to communicate with people without yelling their names.", "Exactly! For every person who doesn’t have a problem with it there IS someone who would. Unfortunately we currently live in a very offended society and everything is offensive to someone. Also, unfortunately, those who are offended yell the loudest and the detriment is always to the party who isn’t offended. Cancel culture is still a thing and peoples lives have been ruined due to it.\n\nFind some middle ground.\n\nNAH", "Just for future reference, if you're going for \"NTA for OP, but also NTA for the opposing party\" then you should use NAH (No Assholes Here).\n\nI know, I know, it's really not clear that \"Not The Asshole\" includes the meaning \"the opposing party is/are TA\". At least it seems you settled on using NTA as it is meant to be used. 👍\n\nFor when both OP and opposing party are assholes, use ESH (Everyone Sucks Here).", "OP is just... Wow. They are being so deliberately obtuse over the fact their name is a slur. And has been a slur longer than they've been alive. Just because their parents chose to be ignorant to its cultural background (if you're going to name your child a foreign name, maybe learn its meaning?).\n\nTheir comparison really shows that they think they're being persecuted against. Like just go by your freaking last name and accept that even in America the name is a slur.", "context matters in op's case, too. her name is her name. when it's being used as a slur, it's a slur. when its being used to refer to someone who wishes to be called by their own name, it's not.", "Actually, it was a pretty good comparison. While one is \"use\" and the other is \"not-use\" it gets at the basic idea of whether we consider it culturally more morally correct to refer to someone as the personal identity they're comfortable with rather than to refer to them as the identity we're more comfortable with. Logically, you can't have it both ways. So either you're with OP and trans identity, or you're being hypocritical because you are still picking and choosing which identities you get to invalidate based on your sense of comfort.", "> would it be acceptable to you for them to address you by 'Ms. Jones'? or 'G'?\n\nIf they had done this to begin with, it would have been fine. \n\nBut I won't have people barking my last name at me so offensively. They refer to everyone else by their first name in a *polite* voice. \n\nBut the way they use my last name is certainly and intentionally offensive.", "There *are* names close to the N word in some countries considering the slur came from the translation of the word ‘black’ from Latin to many other languages. If you look up names in certain languages that mean black/dark you can find a few that are pronounced quite similarly to that word.", "That’s not really a fair comparison since Gypsy, while an uncommon name, is used as a first name, whereas the N-word is not. When was the last time you heard of a person with the N-word as their name?", "It is not.", "> that’s why all animals with it as an identification are being renamed. \n\nHuh? \n\nWhat are you talking about?", "Barking out \"Hey! Lastname!\" is not a polite or professional form of addressing a colleague in the workplace (unless maybe you're a stevedore) I wouldn't answer to that either. Ms. Lastname, ok.", "The OP stated they are not comfortable getting called that name. Why does their comfort not matter?", "It is literally her first name. She shouldn't have to compromise over her own name.", "Quite frankly, yes.", "It is disrespectful if op has constantly asked you not too after so long and after this discussion", "Exactly… just because it wasn’t recognized as a slur widely doesn’t mean the group offend didn’t always consider it a slur.", "Is it just your last name or do they call you with an honorific before it?", "If OP is male it could also be Buck.", "It's always been a slur. It's a disparaging way to refer to Egyptians. Romani used to be assumed to be Egyptian due to their dark skin. They actually originate from India.", "Why is anyone's right to be addressed in the way they identify with more important than other people's comfort?", "It's OP owning the name they were born to. Only OP has a say in their identity. Anyone demanding OP go by something other than their given name is automatically the AH. \n\nWhen it comes to one's own identity, theirs is the only comfort that matters. The coworkers will have to grow up, or leave. OP should consider documenting everything that happens with this, in case OP needs to file a grievance.", "So, like, what about conservative christians who are uncomfortable calling people by their preferred pronouns? They claim that they are uncomfortable using preferred pronouns because they go against their beliefs and make them uncomfortable\n\nThat's kinda where I am coming from. My name is part of my *identity* ya know?\n\nI'm willing to consider that this is something I need to reconsider but that's where my headspace is rn", "Op isn’t adjusting the thermostat they are literally asking for basic respect", "How does that work exactly in a professional environment where we have legitimate work to do?", "You’re encouraging her coworkers to bully her (an illegal action) rather than comply with using her name. Wtf.", "preferred name, but not the only name. How could the HR argue that they should  use her birth name if the last name is also her birth name? The solution that HR can take here is that everyone has to go by last name no exceptions. problem solved. That will make the entire work environment hostile, but at least the OP is not singled out, yay.", "I wasn't trying to be annoying, it was more along the lines that I didn't want people to dismiss my coworker's concerns because \"Oh. That's not even a slur\" type of thing. Since some people really do not consider it to be one.", "Ah, yes. A bandanna tied as a pouch at the end of a stick.", "Pretty sure I was all three at some point", "Correction, people STILL wear fake war bonnets and sexy ‘Indian’ costumes. This is still a very real issue that affects us Natives. But I agree with the rest of what you’re saying.", "The problem is that’s not all Romani. I was married to someone who was part Romani, they loved that part of themselves and that part of the family. The ones in the US actually like being called Gypsy and would refer to themselves as American-Gypsies. I’m not saying all like it, but not all dislike it either.", "My (adopted) sister is not Romani, but is a Gypsy, and she's incredibly offended to be called Romani. There are still groups who prefer to be called Gypsies but it is very community-specific and folks should never assume!! If you're around someone who identifies with a nomad-based culture, please ask them what term they use to identify.", "...and blackface.\n\nJust because it was a word that was once acceptable does not mean it is now. Language evolves.  The \"R\" word for intellectual disability,  for example. \n\nHowever,  it *is* the OP's name, and she should be called by her preferred name.\n\nAlso, I'm OAF and I know the Cher song, and even in that song, the word was used as a slur.", "Your name IS pretty! It’s offensiveness depends on context. The context of your name is NOT offensive. Your coworkers who refuse to use your name are AH. They need to get over it. Stand your ground.", "Yes, but backtracking on a name that wasn't offensive and telling someone her literal id is racist is OTT ridiculous.\n\nAlso, here in America, many Romani proudly refer to themselves  by this \"slur\" still. Just as many older native Americans will call themselves \"Indian\". Telling a group of people that their own preferred moniker is racist because people of the same ethnicity on a different continent don't like it is nuts. Insisting the word is erased from common useage because people an ocean away used it as an insult years ago is nuts.\n\nI'm a big fat person. I've always been fat, I've always referred to myself as fat. I can't tell you how many times someone else has tried to correct me because in THEIR mind, \"fat\" is derogatory. That's not my issue. Now \"fat acceptance \" is in-ok, fine, whatever. I don't care either way. We are changing common terms so often and insisting that the \"new\" terms are the only acceptable useage because \"some\" people have found an old term offensive that it's become ridiculous.", "So who is defending doing that, in the current time? (As in, “is kinda ignorant…”)", "It is hard when it's your first name. \n\nIt's that simple.\n\nMany people would object to you calling me babe just now and say that it's a sexist insult and is reflective of your internalized misogyny.\n\nWe both know that's not the case at all though, right girly?\n\nRe-examine your own thought process here, because you literally used what many people consider a sexist slur to try and school me on why my position on a supposed ethnic slur is wrong. And you didn't do so ironically.", "People don’t have to stop going by their name because of other people’s feelings babe.", "I know everyone would be telling her to change her name or go by a nickname if her name was the n word.", "What about it? No, I don't care how someone else interprets *my* name. It wasn't intended to be a slur when given to me and has been my name since birth. If you want to manufacture outrage over something so ridiculous, be my guest.", "So…let me understand.  OP (a real, live person actually in this workplace) shouldn’t be allowed the basic (!) right to her own NAME, because someone from a specific ethnic background MIGHT/maybe sometime show up; feel offended, and demand the right to a safe space; meaning OP has to go by a different name, in order to be allowed to exist….?  And what exactly, are we trying to achieve here? Something about appreciating the dignity of people, or something?", "It's still her fucking name.\n\nSome people feel uncomfortable about trans people, but we don't purposely ignore pre op trans people and insist that they're a gender that they don't feel they are.\n\nThere's no reason not to just respect someone's fucking name. It's what they want to go by, it's there legal name, it's not a big deal.", "There is a difference between dressing up in blackface or any other offensive racial or cultural costumes and wanting to be called by your legal name.", "It's not a slur in the UK.", "Well, sure hope you weren’t planning on getting anything positive out of this internship at a nonprofit you were really excited about, because your actions and your attitude are surely not doing you any favors. It’s really not your name that is the problem at this point.", "Really? Strange my friend Gypsy has never had an issue.", "There are many nomadic cultures besides Romani. And if you refer to just anyone who is part of one of those groups as Romani but they aren’t they will be offended. And I live in the bluest state in this country and Romani has not replaced Gypsy. Asking people how they prefer to identify their culture is what has replaced just throwing the term gypsy out there. Some prefer gypsy, some travelers, some Romani and many, many other identifying terms.", "Have they ever watched Gilmore Girls? There's a recurring character named Gypsy.", "Absolutely use that. Context matters.", "On the one hand, I can see OP's logic of \"it's just my name and I love it and this is fine in my country.\" \n\nOn the other hand, in the US you can really ruin your life (or at least there's potential to if enough people find out you did it) if someone hears you saying a racial slur of any kind. Even if you're singing along to your favorite rapper. Even if you're using a word that sounds like a racial slur but is really referring to someone being stingy (I'm not going to spell out that word, but years ago someone got in trouble for using it for being \\*close\\* to a slur). Honestly, no way in heck would I let anyone hear me calling OP by her given name in case they don't know the situation, take offense, film me, get me harassed on social media, call me a racist in public, whatever. It's way too easy to get in trouble now. \n\nOP, I apologize for saying this because I know you absolutely don't agree, but I think your coworkers have a big concern here and regardless of THAT'S MY NAME, PLEASE USE IT, socially it just may not be a good idea for them to do so. No matter what the logic is for you or your parents, most people (especially random strangers overhearing) are not going to react well. I don't think that saying, \"But that's my name and I want you to use it!\" is going to fix that social dilemma.", "Replace OP’s name with any other slur. Would this comment still make sense to you??????? Be fr", "It is a racial slur *and* it is a name her parents chose to apply to her. The latter fact does not negate the former. OP is YTA for forcing people to utter a racial slur (one that might even apply to them! There are Romani Americans, you know!) before she will acknowledge them.", "I mean you did some nice mental gymnastics to try to justify a false equivalency but it’s still false. \n\nPeople not wanting to say a slur out of respect for a marginalized group of people is not remotely the same as people who refuse to use correct pronouns in an attempt to disrespect a marginalized group of people.", "I don’t think the comparison works. In the instance of a conservative Christian not wanting to use a person’s pronouns, there is no harm that would come from them overcoming their personal discomfort and using the person’s preferred pronouns (in fact, it would benefit the wellbeing of the trans person). The discomfort comes from a place of close-mindedness. With a name that is also a slur, there is the potential to bring about harm (namely, to the people to whom the slur applies) that isn’t just due to close-mindedness or arbitrary personal discomfort, like the conservative Christian. \n\nI’m not totally sure where I stand on the whole name thing, because it’s hard having to have your name/identity revoked. I also see why others would be uncomfortable saying it. I don’t have a ‘side’ but just wanted to address that comparison", "Ha the  next time someone barks your last name just look down your nose at them and say ‘you may refer to me as Ms. Jones’.", "That's nice. But I'm speaking hypothetically about someone being called the *actual* word, in OPs country not just 'similar' names. You can go ahead and pretend you and OP wouldn't feel uncomfortable using it though.", "Can you immediately hear Stevie Nicks and Cher singing it?", "The common name for *Lymantria dispar* used to be Gypsy Moth. It has been renamed to spongy moth.", "\"Words matter, and what we call something matters. And by using the former name for Lymantria dispar, it really was very hurtful to the Romani people,\" says Chris Stelzig, the executive director of the organization.\n\nThey’re literally renaming and reclassifying insects so that the racial slur is no longer used because words have meaning and the meaning of this word is hateful and offensive", "https://www.nytimes.com/2022/03/03/science/spongy-moth-romani.html?smid=url-share", "Yeah ignoring context clues that “hey! Lastname!” Was an escalation in tone and volume due to being purposefully ignored. And yeah sure a prefix would be a wonderful compromise but not one OP is willing to do it seems.", "Neither is a slur.", "Their comfort does matter but so do their coworkers. Forcing someone to use a racial slur is not the solution. They also didn’t say they weren’t comfortable using their last name just that they don’t want to because it’s common. That’s not about comfort.", "It’s really common in certain industries to just use the last name. In my company, we use last names for people with the same first name.", "My brother's friends just call him by last name no honorific just because there were 2 people with the his first name in the group.\n\nIt's not that deep. OP is just making a big deal about it because they can't handle the fact that people won't use their slur name", "No. The formality would be very awkward for a coworker setting.", "That is not a Fleetwood Mac song\n\nTG", "TIL! Wow, I had no idea. That… super sucks. :/", "I literally never knew this until right now. Phonetically, I'm seeing the connection now. I can't believe I never knew the etymology before.", "Oh, ok, I get it. You think you're clever, that you're somehow special, better then everybody else, it's why you dance around simple questions posed to you. Some career advise, being insufferable and obtuse creates a hostile work environment and isn't going to get you anywhere. This isn't good networking. This isn't  being a team player. It's likely you won't get a good reference, or hired on full time or asked you back. All because you don't want to be called by your last name that is your name.", "That's not how the professional world or a society works. My point is, that people on this subreddit can't just place the individual's boundaries or identity over that other other people automatically. That's chaos and a hyper individualistic and selfish view of how to interact with other people in a society. \n\nOP says it's a slur. Some people may find it genuinely offensive and uncomfortable to use. There's a middle ground. Find it. That's how civilized society works.", "\nI wouldn’t spend too much time distinguishing myself from them. Your name is literally a slur against a group of persecuted people, and you don’t seem to understand that or care about them.", "That's your problem not mine. Hopefully eventually upper management sees what kind of problems you are creating at work and does something about it.\n\nI've already had to ignore toxic people in the past. You sound like one of them. You are refusing to respond to people who use your last name even when you know your first name is making people uncomfortable.\n\nYou're the one in the wrong.", "Or, everyone respects others by calling them what they want to be called. No exceptions. Problem solved.", "You mean like YOU keep doing?", "That's technically a hobo.", "You mean a homeless Indian princess named Gypsy?\n\nETA:  It sounds like the makings of a kickass heroine story arc.", "You’re absolutely right and I should’ve specified that’s still a modern issue. It’s incredibly fucked up that’s still a thing.", "Atlanta Braves I'm side-eying you.", "In many cases its white people who are most offended and the rigid enforcers of correct language.", "Absolutely this. It IS a name. It isn't being used to deride a group of people, or even one person, so her coworkers are just being AHs.", "Yeah, but there a huge difference between a group of people proudly referring to themselves as something that can be considered a slur, and those who don't represent those groups using it. A skinny person making fun of a fat person has never been 'cool' outside of kids at school. Gabriel Iglesias makes the jokes as a representative of that community.", "An actual fucking 'gypsy' here, do you know how many roma and travellers are fucking sterilized, raped, abused and kicked out of their homes while being called Gypsys, racoon eaters, etc?\n\nEven to this god damn day???", "OP is not a Traveller/Romani/Gypsy.", "I was specifically addressing your argument that everyone on Reddit is a child who is constantly offended without context for what they’re actually offended by. According to you, because something was ok in 1985 its fine today. I disagree. \n\nI actually don’t think OP should change her name, bc it’s her actual name, but I do think as awareness of her name’s use as a slur becomes more widespread she may need to think through how she wants to handle situations like this in the future. \n\nI’ve actually never heard babe used as a sexist slur. I was using it in a cheeky way, the same way I might say “friend” or “pal.” I’m sorry for offending, and thanks for pointing out that my intent could be misinterpreted. Have a great night!", "You tell 'em honey!", "That’s not what she said, at all.", "That word has always been a slur, it's just that most people wouldn't admit it for a long time, and some still won't. \n\nThe Sinti and Roma have historically been treated horribly. I'm not manufacturing outrage. As a member of this community you don't seem to give a fig about, I'm telling you your name is offensive and I wouldn't call you by it either. Just as I wouldn't call someone by their name if it was the n word.", "So a member of one of those communities should be forced to call her a racial slur, a slur that refers to them?", "I find that hard to believe and I’ve never met anyone with that name. Ginger? Yes but not the other name. However to be fair I live in NYC and it was politically correct b4 that was a thing.", "Amy Sherman-Palladino isn't known for her deft writing around diversity.", "it's not any other slur though, it's this one, which is only newly understood to be a slur in some parts of the us and has been a name for longer than it has popularly been considered a slur. do i think people should continue to use it as a name today? no. do i think op should have to change her identity decades into her life? also no. again: context matters. i think op should be open to using an honorific and her last name as a compromise, which she says she is, but it's fair to not want to have people refer to you by just your last name when no one else around you is referred to that way.", "Context matters. If I wasn’t using it as a slur, and it was someone’s actual legal name that I it only had permission to call them but was being told they wouldn’t go by anything else? Yes, I would call them by their name.", "Oh yeah <3\n\nNamed for a Fleetwood Mac song", "I am a descendant of gypsies.  None of my family give a fuck about the word gypsy,  context matter calling a scammer a gypsy and a person working with the name gypsy are 2 very different things. The only power words have is the power people give them, never using it means that word will always be consider a negative using as a positive taking the word back is much better then adding to the list of taboo words.", "Unfortunately, I am not an insect and my name is a major part of my idenity", "Op said she's fine with being Ms/Mrs lastname, but just being referred to as lastname felt like she was being yelled at by a coach", "No, their coworkers comfort does not matter in this situation.", "Considering the OP states their supervisor doesn’t care and has a good relationship with them, not sure your career advice is any good.", "Bruh this is her own name,why do you think you're more entitled to how she feels on her own birth name? Do I agree the parents should have nsmed her that? No. But y'all are not more entitled to anything more here", "In the \"professional world\" once it is clear that it is their LEGAL name, that's the end of it.", "> Hopefully eventually upper management sees what kind of problems you are creating at work and does something about it.\n\nConsidering that upper management has already been informed of the issue, and said they can't make me go by another name, I doubt they are going to do anything about it. \n\nMy immediate supervisor loves me and offers nothing but praise. He also has no issue with my name.", "Would you like her to change her name by deed poll? She has no responsibility over others comfortability around her name.", "that is not a solution. people cannot be forced to say a slur if they do not want to. people have more names so the HR can go with all last names. Everyone is equal.", "I'm picturing an epic video game that's a cross between Prince of Persia: Sands of Time and Far Cry 4.", "Nah, you’re good. Just wanted to clarify for anyone who might want to make it seem like these issues are unimportant", "FWIW the 3 ladies that have an issue with this are most definitely *extremely* white passing if they are not 100% (we've never spoken about ethnicity so I couldn't tell you for sure)\n\nThe other POC (I am not white) in our group have zero problem with it and have offered me support in the matter (including backing me if I wanted to escalate this to our supervisors or HR)", "No, OP actually has even more of a claim/right/say over having herself called that, because it is her actual name.  Good grief.", "Rather she is or not is irrelevant if her literal legal government name is gypsy.\n\nWe don't say this to pre op trans people right? We don't say \"well so and so isn't actually a woman so\" no but they'd like to be one, they want to be called that, and you respect that.\n\nOP wants to go by her literal fucking name. It shouldn't be that hard.", "I feel like this could be used as an example as to why the co-workers might feel uncomfortable using the name.\n\nAssuming it's a open office situation and you goign to have customers, strangers or guests coming and going it could cause misunderstandings.\n\nEven if all the co-workers know it's OP's first name, to other people they might misinterpret it as a slur and it might reflect badly on the company. etc.", "Wow. I know a few misogyny experts who love to use \"babe\".  I'm honestly shocked that you don't know this.  I was born before 1965 ... More time in the trenches, I guess.  I'm genuinely shocked. It's been common, in my life, usually in a negative way.  My husband doesn't use it. He has another, kind of old fashioned one, for me that, if anyone else used it, I'd probably smack'em.  ;)", "Except they're not using a slur. A slur is an adjective about a noun.\n\nThey're using her name. Which is a noun.", "I didn’t know about it being a racial slur until I moved to NYC. I think awareness is regional for this one. \n\nI also noticed New Yorkers are generally pretty good about avoiding a lot of common slurs but I was surprised at the frequency with which I heard the “r” word (as in, original meaning pertaining to development issues) being used here.", "I find it hard to believe it's a racial slur in the us", "It is not \"only newly understood\" to be a slur. I'm older than OP and I've known the g-word is a slur for her entire adult life. The fact that her parents didn't do research into a word that they picked *from a Cher song* does not mean everyone else has to pretend that Nobody Knew. This is historical revisionism.", "“It’s this one” so it’s not that bad?? Do you hear yourself????? “Context matters” the context is that this name is now widely considered to be a slur and it’s only fair that people not feel comfortable referring to someone or using a slur in their daily vocabulary. You’re jumping through major hurdles to defend the indefensible here", "Are you in the UK?", "I don't understand why you're replying to me since I never took any stance on OP's name.\n\n I was just explaining to OP what a previous poster meant when they said \"animals are being renamed\" since OP seemed confused by that.", "But you're also not Romani, and *that matters*. \n\nWould you seriously think this was ok if your parents had named you literally any other racial slur, or is it just the ones sung by Cher that are ok?", "Yeah I’m sticking with Y T A. No one is saying you’re an insect, but if you can’t get that, the fact they are changing the name of (“lowly”) insects, then it makes sense that no new generation will use that name anymore for (top of the food chain) humans. You can die on this hill but you’ll only be alienating yourself. This isn’t fair on the whole but can’t you see how this affects others as well?", "And your surname is a part of your name is that not also a part of your identity ? \n\nNo one is asking you to change your first name they’re literally just asking you to please not make them say it. You can say it and use it all you want and so can everyone else that’s comfortable using a word rooted in hatred and oppression but it’s really fcked up to force others to use it. \n\nAgain you’re not the A H for not wanting a nickname but you absolutely are for forcing others to use a literal racial slur by being unprofessional and ignoring them calling you by your surname as a compromise.", "HR will disagree they cannot be forced to use racist language they are uncomfortable with", "There is no limitations to legal names. Anyone can name themselves or their children something offensive. Again. You're missing the point. \n\nThere shouldn't be a full stop at the end of your sentence. Meanings of words change. There's a middle ground. This sub can't blindly support the individual over the comfort of others every time without nuance.", "Don't feed the trolls.", "Don't worry, it'll happen. People like you often just take awhile to be gotten rid of.", "So, again, they should go to HR, which can act as a mediator. None of this yelling across the office nonsense.", "Tomb Raider?", "I'd play it", "This I want to play!", "Take my money.", "Not trying to insinuate that the issue is unimportant, but you're definitely the first and only native American I've heard have a problem with costumes.", "The R word is also a no no word but I’ll admit I’m shocked at the folks who still say it. However I call them out! That being said what if OP’s name was close to the n slur or the k slur and they got a job in Israel. Are they really gonna wear that name loud and proud and risk every interaction being a fight? Not fair all around. I would say N A H except for OP’s insistence that they won’t budge or even try to understand the other side. Remember more than one person at work feels strongly about this and they admit it is a slur where they are but not that big of a slur. That’s nonsense. A slur is a slur.", "The Romani people who are the folks who were called that for generations say it is. I’m not Romani so I’m no expert. I will follow their lead on what they feel is a slur or not.", "It takes like two seconds to Google and find out:\n\nhttps://www.google.com/search?q=is+gypsy+considered+slur&ie=UTF-8&oe=UTF-8&hl=en-us&client=safari\n\nFrom Merriam Webster:\n\nThough still frequently encountered in English, use of the term Gypsy to refer to Roma people or their language is increasingly regarded as offensive because of negative stereotypes associated with that term. Although Gypsy is sometimes used as a neutral or positive self-descriptor, it is recommended that those for whom it is not a self-descriptor use Roma or Romani/Romany instead. Other uses of gypsy are also increasingly understood as offensive, including the general \"wanderer\" meaning of the noun and the related meaning of the verb gypsy, as well as compound terms, such as gypsy moth and gypsy cab.", "I'm also increasingly of the opinion that this post is rage-bait and next week there will be a gender swapped version about a certain Tim McGraw song. 🙄", "it is absolutely only newly understood to be a slur in many, many places in the us. people are saying it all over this thread. some people were educated it about it earlier, certainly, but that doesn't change the reality for op or op's family. and she's named after the fleetwood mac song--it was used normally in multiple hit songs in the 70s", "USA", "Lol sorry think I clicked reply on the wrong comment in the list using my phone so accidentally clicks happen sometimes 😅", "> then it makes sense that no new generation will use that name anymore for\n\nAnd that's fine. If no child is ever given my name again, that's awesome.\n\nBut I have literally had my name for decades.", "> And your surname is a part of your name is that not also a part of your identity ?\n\nMy surname does not hold the significance to me that my first name does. So no.\n\nBut my issue with the use of it is that they are using it in ways I consider disrespectful coming from peers. They are barking out my last name like they are an army sgt running boot camp or a HS basketball coach yelling at players. \n\nThey are singling me out and bullying me for my unwillingness to go by another first name. \n\nNo one else in our group is referred by last name alone.", "actually HR did agree and told OP since it’s their legal name they can’t refuse to use it", "> There is no limitations to legal names. Anyone can name themselves or their children something offensive.\n\nThat's not true where I live. Our clerk of register has the legal right to refuse names deemed offensive or otherwise inappropriate.", "When it comes to someone's name, that's where I stand. I cringe with some of my callers, because so many have surnames that are slurs. Some that make me very uncomfortable. But I'm an adult, and I remember that their name is theirs, and it's not my place to involve my feelings about their names. Regardless of how utterly distasteful and offensive I find them.", "You sound sort of unhinged, fyi.", "so do people like you, unfortunately. :(", "Oof. You need to be exposed to more Native American/Indigenous authors, creators, activists and artists, maybe. Or just live near a tribal community and pay attention. This has been an issue both recently and historically.", "how many indigenous peoples do you know? i’m indigenous, grew up on a reserve (and even now in the city i’m surrounded by indigenous peoples) and almost every indigenous person i’ve met (that knows our history) is extremely bothered by these racist costumes, by Pocahontas and by shitty corporations still taking aspects of our culture, making cheap versions and selling them as their own ideas.", "Ok then, another Native here! I, my family, and my Native friends have a problem with costumes mocking us (as opposed to people respectfully learning about and appreciating Indigenous cultures). I can’t speak for all other Natives, but now you’ve heard from two of us.", "No, I agree with you. You had to inform them further down in another thread that actions are being taken to rename animals with this name, so 1) clearly enough Romani people find it offensive that they’ve bothered to speak up about it, pretty extensively, and 2) the fact that OP didn’t know that means that they likely haven’t even bothered to do any research on why people find it offensive.\n\nThis isn’t just a case where the person happened to have a name that unfortunately sounds like something offensive in another language; this person’s parents felt it was okay to name their child after someone’s cultural heritage that they have no part in. I do believe that they didn’t realize that this was an insensitive thing to do at the time, but its still pretty cringey to have to use it at your workplace in modern times.\n\nThey were literally putting these people in concentration camps less than a century ago, maybe don’t name your child after an ethnic group that’s been relentlessly persecuted for centuries if *you’re not a member of that group*.", "In Romania, I was referring to the US.", "The fact of the matter is that the information was available and her parents chose not to educate themselves about a name they chose for their baby. \n\nThat does NOT make the word only slur-lite, as you seem to be insisting, and it does NOT mean that she gets to demand that her co-workers use (and be forced to hear) a racial slur multiple times a day as part of their job.", "You do understand that “use” in this context doesn’t mean “give it to a new baby,” right?\n\nIt means they won’t want to say your name bc it *is* a slur in the US.", "Again it’s not your fault but why can’t you understand that you’re asking folks to do something they are morally against. It’s also not their fault that your parents chose this name and it’s not their fault that now it’s a slur. I would call you Ms. Last name. Sorry but that’s the only option for me.", "I’m sorry that you feel an ethnic slur is so central to your identity, despite not actually sharing that ethnic identity but it’s weird that you won’t let people just call you ‘G’ or your last name or anything neutral. Is your personality based on making others uncomfortable?\nJust feels like a weird power play on your end.", "They’re singling you out cause you’re the ONE with a racist name. \n\nThey’re not calling anyone else by their surname alone because no one else has a racist name.", "If they’re bullying you it’s because you’re trying to make them use racist language. If this is such an issue leave your job. Find one with ppl who don’t mind being racist.", "Because no one else has a racist first name!! I’m starting to think this post is fake. No one can be this stuck in their ways.", "No, they said they can't do anything about OP ignoring them.  They didn't say that OP could force them to use the slur. And because HR's purpose is to make sure the company is liable for as little as possible, they'll continue to sit on that non-position as long as they can", "No they said they could force her to use another name bc it’s her legal name. I didn’t see anythjng about them making the coworkers use it bc that would also open them up to hella lawsuits. \n\nThis whole situation is exactly why people aren’t going to want to hire OP just by seeing her name at the top of a resume.", "I feel like this response seals it. \n\n>Our clerk of register has the legal right to refuse names deemed offensive or otherwise inappropriate.\n\nYou are absolutely  NTA", "I'm married to a native American. Her entire family is native American. My best friend since I was 12 yo is native American his entire family was native American. I've literally spent time on reserves with these people.", "Thank you lol. I don't know why the other person got so defensive about it. I was just shocked as I'm married to a native, so I'm spent a fair amount of time around them.", "Seriously?? Dude. Romani people aren’t from or related in any way to Romania. \n\nHalf those links were from American newspapers about Americans finding it offensive. So yes, it is considered offensive here.\n\nRomani people have been persecuted for centuries. They put them in death camps, ffs.\n\nhttps://en.m.wikipedia.org/wiki/Romani_Holocaust", ">and it’s not their fault that now it’s a slur. \n\nEven before it was a slur, so gross to name someone Gypsy when they're not Romani.🤢", "> If this is such an issue leave your job.\n\nI'm not going anywhere.", "they also said they couldn’t force OP to go by another name so"]}