{"id": 18601, "submission_id": "13w971a", "title": "AITA for refusing to change my girlfriend’s dog’s diapers?", "selftext": "My girlfriend (24) and I(23) are both dog owners, I have a pretty young puppy while she has an 18 year old beagle. Needless to say her dog, due to the incredibly advanced age, has some serious health problems. He is blind in one eye, near deaf, can barely see or smell his food, she has to bottle feed him water and sometimes hand feed him food. He is also incontinent. \n\nHe would just go to the bathroom all over our house because he couldn’t control it, and it was destroying our carpets, until my girlfriend decided to put him in diapers. This is better for our carpets but he needs to be changed 3 times a day.\n\nAs you can tell, I’m not happy about this. I think that he has lived a full long life, and my girlfriend is prolonging the inevitable for her sake not his.  Which I understand as she’s had him since she was a little kid, however, at some point this isn’t good for him. More selfishly, the lease is in my name and it’s bad on me if he shits himself in our carpet. \n\nRecently, I made the suggestion that science he had lived such a full life, maybe it’s better that we let him rest. She exploded. She said that I was heartless for suggesting this and that she will not do that. We got into an argument about whether or not it was good for anyone except her to keep him in this state. Eventually I told her that if this is the case, I will not be helping her take care of him anymore. This includes, feeding “walking” and especially cleaning up after him after he uses his diaper.\n\nShe got mad. I work from home and she doesn’t so I have a much easier time taking care of the dogs than she does. She told me I was cruel and I refused to budge. \n\nAITA?", "created_utc": 1685498679, "permalink": "/r/AmItheAsshole/comments/13w971a/aita_for_refusing_to_change_my_girlfriends_dogs/", "score": 621, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I could be the asshole for essentially issuing an ultimatum. I know she may feel like I completely disregarded her feelings. I also could be the asshole for making her come to terms with her dogs life and introducing to her the idea of euthanizing him.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA, but you’re likely not going to change her mind. I would suggest she take her dog to the vet for a quality of life evaluation. That way, it’s a professional giving her an expert opinion. That’s what we did before deciding to let our elderly cat go.", "NTA. She is being cruel. This dog is no longer living as a dog. Left to his own devices, he would have long ago found himself a quiet spot and crossed the rainbow bridge. I have seen supposed animal lovers do this to their animals many times. We owe them more than this. She needs to end his suffering already. He can't drink, eat, control his bodily functions, see, or hear. She's being quite awful.", "NTA. It sounds like the dog doesn’t have much of a life at this stage if he is deaf almost blind and can’t smell and has no control over its bodily functions. \n\nWhat does the dogs vet recommend? I think this might help your case if they agree with you.", "NTA. I'm pretty much a misanthropic hermit who only hangs out with animals and doesn't eat meat, and I'd let that poor old guy sleep at this stage, too. It absolutely is selfish of your SO to keep him suffering such a poor QoL, and I am sure you're right that she's doing it for herself, not for him. You're NTA. Stand your ground. Consider your position, too. Do you really want to be with someone who'll allow someone she claims to love to suffer for years just for the sake of her own comfort? I wouldn't.", "NTA. Your girlfriend is being incredibly selfish, her dog is suffering and needs to be put to rest. It blows my minds that people claim to love their pets and will watch them go through this kind of agony knowing they have a better choice.", "This poor dog, I know pets are family and it’s really hard to make the tough decisions, but his quality of life is so low. Poor dog. Sounds like he needs to be put out of his misery and allowed to cross the rainbow bridge", "As someone who had to put down a childhood dog within the last year, I get it. I understand how hard that decision is to make, it literally destroys you. My family hoped that our pup would pass peacefully in the night but she was one stubborn dog and just wouldn’t let go. Her mind appeared to be completely there but her body just did not work anymore. Made the decision all the more difficult but her quality of life just wasn’t worth continuing. \n\nI don’t know how you worded it, but I would bring up the subject again as tactfully as you can. It’s so hard. You have to show her you’re empathetic, tell her you understand, but remind her that this dog is not living how a dog is meant to live anymore. Don’t blackmail her into making the hardest choice she will ever have to make, she will resent you and never forgive you for that. NAH.", "NTA let the dog go, that’s inhumane and unsanitary for the both of you. 18 years is a long friendship let the dog keep what dignity he has and pass away with her present. Rather he expire while one of you is sleeping or away from home.", "NAH. This is a hard situation. I'm curious what the dog's vet says about this. Do they feel the dog still has a good-enough quality of life? If the vet recommends putting him to rest, I would be more on your side. I wonder if she just cannot let him go. I wouldn't want to have to constantly change doggy diapers either. It's ruff for both of you", "NTA but you need to get her and the dog to the vet fir an assessment.\n\nAlso if the vet says it isn't time, or he still has joy, have someone from Rover or some other service come change him. Otherwise that's just cruel. I'd be changing the diaper EVERY time he went ffs. I don't think she understands how much this poor ol guy deserves rest.\n\nI take my senior cat in to the vet monthly. I've bluntly told him (and freaked him out with it) that when it's time, it's time. He feels like if the cat has a chance to get better we gotta give him that. I mean he's generally right but man... I'm terrified of making my cat suffer at all because -I- want companionship. Because I loved him and needed his company. And that ain't okay.", "I feel bad for the dog. He sounds like he's suffering. I can't give a judgment. I'm now confused.", "NTA.  If he has to have water, bottle fed to him, then he's past comfortable living.", "Nta i feel horrible for the dog 🐕", "NTA you have already gone above and beyond as much as any reasonable bf would have at this point.", "NTA.  It's never an easy decision to make.  Your SO is keeping her dog alive for their sake,  not the dogs.\n\nThe only tangible link I had to my father, was our dog. My dad passed when I was 5.  She lived 18 years.  We had put her down because she became like you SOs dog.\n\nOne of the few things I remember about my dad is how much he loved the dog, and me.  We were his girls.\n\nIt was devastating to put her down.  It was worse watching her suffer and deteriorate.", "NTA.  It is time.\n~~https://vet.osu.edu/vmc/sites/default/files/import/assets/pdf/hospital/companionAnimals/HonoringtheBond/HowDoIKnowWhen.pdf~~", "NTA.\n\nThis dog must be suffering horribly, maybe not in pain but in a confusion and helplessness that makes every day a nightmare for him. He should be allowed to pass on.\n\nIf the lease is in your name, you have the power to effect a change in the way the household is run. GF is being selfish, even tyrannical about this dog. Maybe she and her pet should move out if she doesn't budge on this matter.", "NAH\n\nI had originally said ur ta but the more I think about it the more I can't see a solution here. It's a tough situation. You're not an a-hole for setting boundaries, but your gf isn't an a-hole for being emotional about this - it's tough seeing a loved pet go through this.\n\nIt sucks, basically! I hope things start to look up soon", "NTA. And i'm a vet. She should have a discussion with her vet, she needs to begin to work herself on that. She's making her dog suffers because she's afraid of suffering. Time to exchange the pain has come.\n\nthis is such an hard decision to take, she'll need you by her side.", "YTA  \n\n\nWhile it does sound like it's time to let the poor dog go, refusing to care for him while he is here is cruel. I'd say it's fine to not do any of the duties while your girlfriend is home, but when she isn't it's awful to let the poor thing hang out in a wet puppy diaper.", "NTA. Has a vet seen her dog? This just sounds cruel and unfair to the poor dog to live the rest of his days like this.", "YTA. \n\nIs the dog in pain?  or is he just deaf and blind and old? \n\nit sounds like you see this old dog, whom your partner loves, is an inconvenience for you and therefore you want to get rid of him.  because of your carpets and because he is old and not fun, and not easy.  \n\ni would leave you in a heartbeat with an ultimatum like that.   in all honesty, if i were her i would be planning my exit.   \n\nLet me repeat this, your partner loves her dog, she is never going to get over her love of that dog.  no matter how old, how inconvenient, if that dog is not in pain she will do her best by that dog. if you aren't going to support her and her dog you are showing her exactly who you are and what type of partner you will continue to become.\n\nshe can absolutely get over you.", "ESH except the dog, her for making him linger and you for ignoring his discomfort when you can help him.", "YTA. Obviously. \n\nYou don't seem to want him euthanized because you think he is suffering, its untreatable i.e pain cannot be managed, quality of life is gone, and death is imminent. You truly seem like you want him dead to reduce your own inconvieniece. Fuck your carpets. If you actually care about your partner, help her care for the dog or approach the conversation from a place of compassion. I'm not surprised she exploded. What's your plan? If shes not home and you are, are you just going to leave this elderly dog in his own soil? That's sick. You come across as an undesirable partner.\n\nIf this was my dog I would let go for the dogs best interest after having a quality of life assessment done with the vet and a discussion of whether we can improve his life. All the reasons OP listed to want to euthanize were self centered.", "NTA", "NTA", "YTA dogwise, but NTA girlfriendwise. \n\nIt's not the dogs fault the situation is what it is. Also.. even the diapers are an infection risk, not to mention not changing and cleaning.\n\nBut you are absolutely right, loving human thing would be to let the dog go.", "YTA. Is he enjoying food and company still? Is he free of unmanageable pain? Are you capable of caring for him collectively? If so, you’d be putting him down out of sheer convenience to yourself, not for him in any way. \n\nI sure hope you don’t lose any function as you age, sheesh. You sound remarkably selfish and like you’re one of those young people who think that they’re immortal and that anyone (or anything) that ages does so through moral flaws.", "yath. you asked your partner to euthanize her dog. it’s one thing if the dog is suffering but the thing is that animals get old and sometimes need help. if the vets says he should keep living then you trust the vet. i understand that this isn’t your dog but dating someone, living with that person is supposed to be a partnership. if this inconvenience is too much for you then it seems like this relationship is not a partnership you can commit to. the issue at hand isn’t about your partner and her dog-parenting skills, the issue is whether or not you decide to support her with a creature she clearly cares deeply about.", "Do you want her to kill you when you're old and need to wear diapers? YTA. The fact you argued that she needed to kill her dog and threw the lease in her face is pretty fucked up. I assume you two decided to move in together so why make it seem like it's just your place? You're making her a guest in her own home. \n\nThe fact that you argue the dog is suffering which is why you want to put the dog down and then go on to mention you won't help out with the dog shows you didn't want to help in the first place. If you really cared about the dog suffering you'd want to reduce that suffering until it died instead of ignoring it. That really shows that you don't want to take care of the dog and suffering has nothing to do with it.", "NAH", "NTA. At some point, we do have to let our beloved animals go. It is absolutely hard. But his quality of life isn’t great either.", "She is testing your commitment level. Do as you please but if you care for her. Care for the dog or both are gone.", "ESH - your girlfriend is putting her feelings above the health of her dog and she needs to come to terms with the fact that her dog has reached his end of life. This can be really heartbreaking and difficult. I've seen this happen with my own family and it's really hard to see an animal suffering when a person just isn't ready to let go. It needs to be approached with caution and  sensitivity and you should encourage her maybe to have a real conversation with her vet about his quality of life.  But it seems like you care more about your apartment then the actual suffering of the dog which makes you an asshole.", "NTA time for her beagle to sleep.\n\nIf you have a spare 50k you could get viagen to clone her beagle.", "You're selfish... you don't want to clean up after someone else's pet. That's not cruel, that's simply being human.\n\nI think you're projecting your dislike of cleaning up after the dog to the dog itself. If he can wag his tail and wiggle into his owner's arms, then he is unlikely to be suffering. When my dog was suffering and I had to have her euthanized, she didn't wag her tail or wiggle in my arms even though she knew it was me holding her.\n\nTell her that you genuinely believe it would be better for him BUT he is her dog, not yours. However, you will not be doing these things for her. Possible suggest crating him until she is home since he doesn't really move around much but insist on a pet deposit from her to cover whatever your landlord will want due to the damage. \\[Crating is not cruel.\\]\n\nEquivalent judgement - either both or neither of you are A H.", "ESH", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy girlfriend (24) and I(23) are both dog owners, I have a pretty young puppy while she has an 18 year old beagle. Needless to say her dog, due to the incredibly advanced age, has some serious health problems. He is blind in one eye, near deaf, can barely see or smell his food, she has to bottle feed him water and sometimes hand feed him food. He is also incontinent. \n\nHe would just go to the bathroom all over our house because he couldn’t control it, and it was destroying our carpets, until my girlfriend decided to put him in diapers. This is better for our carpets but he needs to be changed 3 times a day.\n\nAs you can tell, I’m not happy about this. I think that he has lived a full long life, and my girlfriend is prolonging the inevitable for her sake not his.  Which I understand as she’s had him since she was a little kid, however, at some point this isn’t good for him. More selfishly, the lease is in my name and it’s bad on me if he shits himself in our carpet. \n\nRecently, I made the suggestion that science he had lived such a full life, maybe it’s better that we let him rest. She exploded. She said that I was heartless for suggesting this and that she will not do that. We got into an argument about whether or not it was good for anyone except her to keep him in this state. Eventually I told her that if this is the case, I will not be helping her take care of him anymore. This includes, feeding “walking” and especially cleaning up after him after he uses his diaper.\n\nShe got mad. I work from home and she doesn’t so I have a much easier time taking care of the dogs than she does. She told me I was cruel and I refused to budge. \n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA but please care for this poor doggo and change him when it's needed. I had to put my nearly 19 year old doggy down, I owed him a good death for the faithful love he'd given me and my family.", "NTA\n\nThe dog is not living its best life anymore. I get that she loves him and genuinely wants the best for him. But he's 18 and can't even manage to go to the bathroom by himself anymore. He also can't eat, hear or see \n\nAs someone said earlier if left to his own devices he would've crossed the rainbow bridge by now.\n\nYes it's very devastating to loose a pet because they're family and  you love them a lot but the kindest thing she can do for him is to let him cross bridge", "NTA but your girlfriend is. She is keeping an animal with a low quality of life alive for selfish reasons. I get it, it's a hard choice to make but it needs to be done. It's heartless to let that poor animal suffer because she can't let go.", "NTA. While I absolutely understand the impulse to keep your pet as long as possible, she’s being cruel. This isn’t for the dog’s benefit, it’s for hers. \n\nWhen we bring these animals to live with us, we take away their ability to do what they’d do naturally in the wild and make the decision to go off quietly to die. So it’s our responsibility to be aware of their situation and to make the choice at the right time. Often, they’ll tell us when that is, but we have to be listening. \n\nA peaceful end is the last gift we can give to the animals we love. It sounds like it’s well past time for this dog.", "NTA. if a dog can't do what makes dog happy are even living? \nNo, merely surviving. \nThat's no way for a dog or any animal to live.", "NTA. This dog is just suffering. This is not a life for him anymore. \n\nI love animals but they shouldn't be forced to surviving day by day instead of living. One of our cats is 15+ years old. He still has a good life with minor health issues. If his issues become worse, we let him go for his sake. \n\nI don't understand ppl who can say they love their animal but ignoring it's pain.", "NTA. Join the pet vet group on Facebook and get professional opinions and show her.", "I’d go with her to the next vet appointment so she can get an honest unbiased opinion from them.  In our family we’ve always said once the bowels and kidneys go, that’s it. Poor little dog and I understand it’s hard for your girlfriend.\n\nNTA", "When I was young, my parents had a dog. They always had the mindset that \"When the dog can no longer hold his pee/shit, life is no longer humane\". So when he did start to shit in the house, with no apparent reason (he was almost 15, I think), they had him put down.\n\nIt was devastating, especially for mom (SAHM), but I always thought that was a very good way of looking at it. When the dog can no longer live a respectable life, maybe it is time to let him go... What does the dog still get out of living his life?\n\nETA: NTA!", "After rereading am changing from Y T A to NTA...she is not ready to let him go. Period. Guide ger towards you think is best, not force her. She loves that creature with all her heart.", "You are NTA. Be prepared for this to affect your relationship, its hard to get over the knowledge that a person is ok with allowing someone else to suffer in order to maintain their own happiness.", "NTA this is literally the condition my grandparents dog was in when he was recently put down. Ask yourself “would I want to live like this?” If the answer is no you probably shouldn’t make your dog live like that either", "Wait till one day you'll have to make a decision like that about your dog.... it's not that easy\n\nYTA for not helping poor old creature, who is totally dependent on people", "Absolutely agree— I’ve had three dogs who lived over 15. After a while they’re not themselves anymore, and the incontinence is a big sign that it’s time to put them to rest soon. It’s sad but true. Also, it’s her dog, not OP’s, so it shouldn’t be his responsibility. NTA", "Agreed. I have helped many of my rescues (I rescue seniors a lot) and have helped many cross over. It is the last gift of kindness you can give them. She is being incredibly selfish. Poor doggie.", "You do realize some people actually care about animals, right, and don't just kill them off when they're inconvenient. How do you know the dog wants to die? Old people who can barely walk and can't control their bowels/bladder don't just want to get killed off. My grandma was one of them and she wanted to live till 100+.", "The dog is deaf, going blind, and has no sense of smell, the dog also cannot eat on his own or go to the bathroom on his own… What kind of quality of life is that?\n\nEdit: personally I feel like the girlfriend is a massive AH for keeping a dog alive with barely a quality of life", "Honestly, as much as I get she loves her dog, 18 years old, deaf, blind, unable to eat or drink on its own, and even unable to control anymore how to pee... Do you really believe after that point it may not be in pain? Really? If that were a person, how do you think they would feel? Imagine all the difficulty the dog has, but with a person, I say the time for him has come, and to just let him have his due rest.", ">or is he just deaf and blind and old?\n\ndog cant eat or drink by himself, and has zero control over his body, id say its a pretty good sign he's not *just* old, he's *too* old. he's not living a good life anymore. and if she wants to hold on to him like this, but doesnt want to bring the work that it demands, then she is selfish and he is right, it is serving no one else than her. *she* decided to have this dog, *she* is deciding to keep him alive at all cost even of his own comfort, why should OP have to take the responsibility to take care of him? Its *her* decisions, *her* pet, *her* responsibilities. If you cant or wont take care of an animal, you should not have one. Because OP has his own puppy doesnt mean it gives him the responsibility to take care of her overaged dog.", "I understand your reaction, but how many doggy diapers are *you* going to change?  How many carpet accidents?  How long are you going to see this beagle barely move and when he does, he bumps into things?  At some point it is time to let go, it is the right thing to do.  Is it really as bad as OP says?  I don't know, but if it is, I think it is *at least* time to have a conversation about when it is appropriate to say enough is enough of the doggy's suffering.", "She has to hand feed the dog and it doesn't drink on its own, ffs. Blind, deaf, incontinent.", "Most people I know would choose to go before this stage of suffering if they could.", "exactly. OP is saying he doesn't feel like dealing with the dog's life as if it animals should only be used as play things and not be cared for. Can't believe people are arguing nta.", "[deleted]", "Dogs don't have elaborate internal lives. All this poor dog has is suffering. He doesn't know why. His life has just turned into a nightmare.", "I plan to be dead by 70.\n\nBut yeah, If I was in the state the dog is in id want to be put down", "I work in a nursing home and have literally seen many elderly beg to be let go. One case: a woman with two fake hips, a fake knee, multiple spine surgeries, etc. Her sons refused to let her leave and she spent the last years of her life being forced to live, all the while she was begging to be allowed to die with dignity. When we finally convinced her sons to sign the release for palliative care (comfort measures only, no more curative treatment), she fell asleep and stayed that way until she passed five days later. Another: a man with severely advanced Parkinson's. His wife refused to let him have strong pain killers or to put him in a proper care facility where he could be looked after 24/7 by trained professionals, but was too old to care for him herself. He had an open, necrotized pressure ulcer that was so deep you could see his spine, and three more just about to open. She forced him to hold on and live even though he only got changed and turned twice a day when caretakers came to his house (they had plenty of money for proper care btw). He passed a few days ago and all his caretakers and kids acknowledge that he was ready and his wife had forced him to go on for too long. He no longer feels pain and doesnt have to suffer the indignity of some nurses gagging at the smell coming from his wound.\n\n It is hard to let the ones we love go, and although your grandma was fine with it, many elderly in conditions like this dog would prefer to go than be at the mercy of caretakers and have their dignity taken from them. Even if the caregivers are the sweetest and their actions are only done with the gentlest touch, it is humiliating to live in such circumstances. \n\nAs a second note, I had a very old dog I let go in September. She has Cushings (her tumor was on the pituitary gland) and had begun stroking. After what I assume was stroke number three, I let her go. I would have done it after the first but didnt recognize what was happening. Had a final day full of cuddles, ice cream, and lazing by the river where the grass smelled strong. It nearly killed me to let her go, and I still cry about it when I let myself think of her final days, but I made the right choice. That is no way for a dog to live. \n\nFinally, I do agree that the bf should help with the dog, as it isn't fair to leave him sitting in filth all day. But he should only do the bare minimum (diapers and water) and leave the rest to his gf to do before and after work. The dog doesn't need to be walked every few hours anyway, and eating twice a day is reasonable. If she really loves the dog, she will either accept responsibility for the majority of care or will let him go.", "People who care about animals don't want them to suffer. It's not about being an inconvenience. The dog does not have a good quality of life, and it's actually cruel to allow them to continue to suffer. I've been a vet tech for 20+ years, and thankfully most people understand this and decide to give their pets a peaceful passing. \n\nAlso, I will 100% take myself out before I get to a point where I'm in diapers. Fuck that shit. I'm already in a lot of pain in my 40's and I can't imagine how bad it'll be in my 80's, no thank you, let me die.", "Blow it out your ear. I’m not going to watch my pets barely be able to move because I’m a selfish jerk. I also have a disability that guarantees I will have dementia and I will fight for right to die laws. LOTS of don’t want to live through just to make other people happy.", "None of that indicates suffering on the dog’s part necessarily, though obviously it could. Does he still wag his tail and move his body into pets? This is a decision to be made by the one who loves him, not because OP is worried about possibly needing to clean a carpet.", "The dog may still get excited and find things thrilling. It's not like you or I know or see the dog.", "You sound like you already lack the will to live.", "do none of those elderly people want to live? Maybe those people do say they want to die but as I said my grandma wanted to live so... Maybe some people do want to die at some point, but not all, and my point is just because your body starts shutting down doesn't mean you have a desire to die. You don't know if the dog wants to die. The people you're describing are begging to die, but it's apparent the dog owner feels the dog still has life to live so why let someone kill it over a carpet that can be replaced?", ">Blow it out your ear.\n\nNever heard that one before.\n\nI will fight for animals' right to live. You can die when you want, but the dog can't tell you when it's ready to go. I'm sorry that you're guaranteed to get dementia, honestly, that really sucks. Cards don't look too good for me healthy wise either, but I'm not going to advocate for legalized killing or killing pets or anything/anyone else though wanting to die due to your reasons are a bit different.", "That is suffering. It has no quality of life. It no longer engages the world as a dog does. It is an 18 year old beagle. It's past time. Selfish delusional animal owners will always find a sign that their dog is fine.", "It can't find the water bowl of the food dish. It struggles to perceive the world. There are no thrills here.", "I think maybe you haven't seen any of these issues first hand and it sounds like you are quite young hence the concept that death is not necessarily the worst thing might not be familiar to you. I have watched 1 grandparent, 1 great grandparent and am in the process of watching another grandparent die. I will tell you if I ever get diagnosed with dementia I will be fighting for my right to die with dignity, if I get terminal cancer, same thing. I already have rheumatoid arthritis at 26 and dont know what the future will hold for me. At this stage life us worth living but im not going to continue on if it gets tot he point where i am in extreme pain every single day. There is a point where living is just not worthwhile anymore. For this dog, the blindness, deafness and inability to smell are less of a concern but the inability to eat/ drink and incontinence is a very good indicator something is majorly wrong, the point where a dog stops eating and drinking on its own is a very clear point where QOL has severely declined and euthanasia is on the table, same for any animal really, it really is the animals way of saying it is time. I know when any of my rats get to that point, it will be straight to the vet, I will not let them suffer which is inevitably what the gf is doing. You may think the dog can't say but for all those GI issues to be present, there is something majorly wrong (cancer, severe pain etc.). Nobody is advocating for people to put the dog down as soon as it became an inconvenience but c'mon, objectively looking at the issues and why they might be present shows this dog is suffering majorly", "Im starting to knock on a bit, when i was younger i used to think it was all about numbers and wanted to get to a very old age.\n\nI realise now that it is not a number game, its just about quality.\n\nI will not live through dementia, i will not live stuck in  a room. \n\nNot only for myself but i really dont want to give my family the trauma of dealing with it/me in those instances.", "The dog is deaf, going blind, can’t eat or use the bathroom without assistance, and has no sense of smell. The dog is *eighteen* \n\nIf you as a human we’re experiencing all of this, plus other health issues, what would you want? Would you want family to keep you alive for their sake or let you go for yours? \n\nNTA", "As someone who has sadly needed to make the decision to put nearly a dozen pets to sleep (and one died in her sleep after 22 years), in my experience, they let you know pretty clearly when they’re done. It’s not always based on mobility or senses, especially when they’re very old and have gradually added those limitations and adapted to them. \n\nOP is not an AH for suggesting it might be time. He is an AH for demanding it happen when the owner doesn’t feel it’s time yet.", "because the dog has difficulty eating? I'm sure the dog still like belly rubs and resting with the owner. Not sure how often the dog plays but maybe it still does. Even if the dog doesn't maybe it's a lazy dog and likes lounging. You can't say the dog isn't enjoying the little bit of life it has.", "I probably would want to live. Life isn't defined by those things and I see why life wouldn't be as good as it used to but don't get why that means you should want to die. All people are describing is being old and I won't throw myself away when I'm old nor will I throw away animals.", "Owners can't always be trusted to make the right decision for their animals. I've had to make this decision with my beloved creatures. I've also witnessed friends, family, and neighbors needlessly torture their animals. This guy lives with this animal all day everyday. The dog has to be hydrated by bottle all of the time and hand fed much of the time. That isn't adaptation.", "It’s not just difficulty eating it’s eating, drinking, smelling, seeing, hearing, using the bathroom.", "You’d really want to live your life not being able to see or hear your loved ones ever again and having to heavily rely on others, you’d really want to live life without ever smelling food or the things around you while also not being able to taste much as well since the two go hand in hand, you’d also be willing to spend the rest of your life in diapers possibly contacting infections? \n\nNot to mention you’d have to have a feeding tube and an IV inserted to get nutrients back into your body.", "I know no one will respect my opinion, but I'm pretty sure I'll be deaf and blind when I'm old. I already can't see very well at 20 and I think I have tinnitus. Smelling things is nice, but I'm not sure how much I'd miss it compared to seeing and hearing. Obviously, I'd rather not eat through a tube or use diapers, but would I be willing to live with all that yes? It's called not wanting to die. The only way I can see myself wanting to die is If I'm completely bedridden with all those things. Like I can't enjoy anything about my day because I'm just in bed or maybe in a coma that I'm not coming out of. If my body is just not at its peak then yes I want to still live.", "This dogs body isn’t at its peak, it’s far beyond it and I’m going to be honest, she’s not taking care of him as well as she should be if she wants to keep him alive. \n\nShe needs to take him to a veterinarian to get their *professional* opinion, especially since he’s so old. Beagles lifespan are the same as most dogs, 15 years is pretty old, but *eighteen* is borderline ancient for him. How does she know he’s not having any internal issues going on why he isn’t eating or drinking as he should be? For all she knows he could have a flipped stomach, organ failure or other ailments that are causing him not to eat or drink. \n\nThere’s a LOT of things OPs girlfriend NEEDS to get checked rather than figuring things out on her own.", "Of course not, your opinion is ridiculous.", "My opinion on whether or not I'd want to live or die is ridiculous? That paragraph wasn't even about the dog, it was about what I'd want for my life.", "Nta. Wow why is she  letting that dog suffer thats abusive she's the heartless one .she's keeping that dog alive for her  well it suffers smh", "NTA letting go is hard but necessary", "NTA. We are currently dealing with a dying dog 18 yr old shitzu. You are not being cruel. Ours is blind deaf and in diapers as well. We should have had her put down already but covid, surgery, and a few other things came up. She is suffering it's time as it is with your GFs dog.", "It's time to go have a serious talk with the vet about quality of life. She probably isn't in a place where she can hear it from you, which is fair, but a vet will give a no BS answer about what is best for the dog. \n\nNAH", "NTA, I have absolutely no time for people who allow their pets to suffer while they could do the right thing and send them off peacefully. We just put our old dog down as she became incontinent and her dignity and comfort was gone. She had her put to sleep at home, in her bed while someone held and cuddled her. She drifted off, didn't move and was gone.   \nIt's heartbreaking but the right thing to do.", "NTA. All I hear is that that dog's quality of life sounds extremely low and he deserves peace.", "NTA\n\nI grew up with dogs and my parents had the rule that if a dog was no longer eating on their own, it was time to go.\n\nIn the wild, sick animals who know their number is up stop eating so their share can sustain the healthy. It's a hint.", "Just because you don’t agree with your girlfriends ethical decision to not say goodbye yet. It’s very hard for people to say goodbye so yes your are an arsehole\n\nThat’s very childish ‘I won’t feed him’ or change his diaper. Because you don’t agree your being selfish and stubborn and not considering a dog who can’t feed itself and relies on humans. So yes it’s cruel of you \n\nYou don’t sound like a boyfriend who support through thick and thin. You have your views and you aren’t being flexible at all. Hope she gets rid of you", "This conversation deserved a lot more thought and compassion than you seemed to put into it. YTA.", "ESH- You're right, but I think you're further separating yourself from her emotionally at a time when she's going to need you with the way you're going about it and that might cause a rift as the dog passes. She needs to get the dog's QoL evaluated- but she's not going to be willing to accept that if she's in this stage of her grieving still and I think treating it how you are is pushing her more into that state.", "ESH - This is so sad. I had to put my dog down a couple of years back and I was absolutely devastated. I suggest booking a consult with a vet to get a professional opinion. I can see both your points, but we don't think rationally with our loved ones.", "YTA and so are people validating your disgusting opinion.\n\nA dog is not a convenience. If someone -like your girlfriend- sees their dog as family then apply your opinion to an elderly relative and see how it sounds. Its gross. It is an appropriate comparison because let's are a part of the family. Thats why she is mad, because thats what you are ignoring. It is her family- a part of her- and you are tired of caring for it and want to end it for your own sake. You care more about carpet than a significant part of who she is- a girl who loves her dog. \n\nIt is appalling to read peoples delusional justification for killing a pet as 'good for the pet'. It isnt. The dog isnt suffering- its old. Your girlfriend is not *forcing it to suffer* in any way. She dealing with the reality of caring for an elderly pet. You frame the situation as absurd but it isnt. She is doing everything right. She isnt keeping it alive for her own selfishness, shes putting in effort to manage its needs. That dog sounds like hes still getting on- hes eating and going out and ***living*** out the end of his life. You didn't say anything about the dog being in pain. Its not on an IV or respirator- this is not withdrawing medical intervention to allow a natural death- its euthanasia. The dog isnt struggling, you are. You need to admit to yourself (because she knows) that you dont want to provide adequate care \"changing diapers\" and want to euthanize it so you dont have to be in the situation. \n\nThe implication this thread has for disability is abhorent and unethical. Is incontinence a reason to end life?  Blindness?  Which age-related disabilities are too inconvenient to tolerate? \n\nMost important issue here- its her dog and she made the (right) choice and you are trying to push her into something she doesn't believe in or want to do, and you dont care about the emotional impact it will have on her. You would rather let the dog suffer in shit while you watch, so that she knows its being neglected while shes at work, so she'll be forced to do what you want. You want to make her feel guilty when she isnt at fault, like many of the responses here. That is what makes YTA- You are heartless.\n\nI really hope your girlfriend sees what was important to you during this time in her life and dumps you for having so little respect for her. If you dont want that you'll figure out a way to see it from her perspective and show you care about her by caring about the dog. Youll do it without making her feel guilty or gaslight her that shes being cruel to the pet she obviously loves deeply.\n\nMy partner was with me, for everything, caring for my 18 year old dog in his final years. My partner helped me carry the dog in a baby sling on walks. He helped me clean every accidental mess and he bought a carpet cleaner so we could prevent the loss of our rental deposit. He agreed when I wanted to quit working so I could spend as much time as possible at home with my dog. My partner even slept on the floor next to me when the dog was in his final weeks and it wasn't safe for him to be on the bed. Never once did he suggest what you did, because he listened to me and actually empathized with me. He respected me and gave nothing but support. Your girlfriend deserves a partner like that.", "YTA, big one. This is not your place to tell her to end the life of her best friend of 18 years. You want to kill her dog so you aren't put out. It's pretty disgusting", "YTA - What’s his quality of life outside of being an inconvenience to you?   What’s his habit?  Does he wag his tail?  Cuddle with your girlfriend?  \n\nIf he has problems smelling, he probably doesn’t know what is safe to consume and is trusting your girlfriend to help him out.", "Hahahaha haven’t read it yet, but the title alone made me have to hold in the biggest laughter as I pictured a puppy with a diaper on 😭", "Yes, YTA.  If the dog isn't suffering you're disgusting to suggest killing it.  Man up and change the diapers dude wtf", "NTA\n\nThe only person being cruel is your wife. This poor dog cannot possibly be happy, and she is selfishly prolonging his misery just to defer her own grief.", "NTA. Ask her if she wanted to live if she couldn't hear, smell, was going blind to boot. Ontop of that would be stuck in diapers and can't eat or drink by herself?", "nta", "How is the dogs behavior? Is he aware of his surroundings? Happy? \n\nIf the dog is still happy and acting like himself than I won’t judge her for keeping him alive. But if he is miserable or doesn’t appear aware, than I think it’s best to put him down. No dog owner wants to do it and I can sympathize with her, but if he’s suffering it’s not moral to prolong it.", "NTA\n\nThis is not \"Life\" it is existence. I know that your GF loves her dog, but this is cruel.... true love would be letting go for her dog to be at peace.", "NTA/NHA. This is wrong. That dog is probably in a great deal of pain, and is no longer living any kind of life. He should be peacefully allowed to move on. \n\nBut I get where your girlfriend is coming from, letting our baby’s go is heartbreaking but it is what we sign on for when being pets into our life. He has had a good long life, it’s time to let him rest.", "NTA.\n\nI can't blame your girlfriend, but she's prolonging her dog's life for her benefit, not his. I'm not a dog person, but I faced a similar situation last year with my much loved 19 year old cat. When they have to be helped to eat and drink, and they lose control of bodily functions, their quality of life is rapidly decreasing.", "NTA. Your gf is being selfish by prolonging his suffering", "YTA for the WAY you said what you said. Yes the dog may need to be put down soon but you could still be compassionate and assist with its care in the meantime. It’s not the dog’s fault that his owner isn’t ready to let him go and he’s aging badly.", "it's been her lifelong friend, she probably can't think beyond \"i won't murder my dog\".\n\nHave her take he dog in for a vet ealuation. We can't let them hurt for our own selfishness.", "Came to say this.", "Solid take, but have you ever seen an elderly human?", "I agree. My old babysitter had a boxer. By 14 she could barely walk or eat. Despite that dog being like her baby, she knew it was her time and brought her to meet her peace", "NTA you have already gone above and beyond as much as any reasonable bf would have at this point.", "I wouldn’t go as far to say she’s a bad person. Emotional attachment, especially if it’s a childhood pet, is a very understandable thing. But she does need to realize it’s time to move on, and that’s a very hard thing to do.\n\nReddit is so quick to recommend breaking up over literally anything.", "The dog has literally no quality of life and the owner is prolonging it’s suffering selfishly. Loving someone (or pet) is also knowing when it’s best to let them go, in any sense of the word. OP is not the owner of the dog, and doesn’t agree with the life it’s being forced to live (I’ve never heard of a dog being bottle fed water because it can’t drink), so why should he enable it further? The dog is suffering and needs a vet to bluntly speak to the actual owner. If she wants to keep her heavily dependant dog alive then it’s selfish of her to demand OP handle it. She can hire someone to do all the natural functions of living, besides breathing, that this poor dog is unable to do itself.", "He isn't the asshole the gf is the true asshole for letting the dog suffer like it is", "The dogs owner is the AH for prolonging a life with absolutely no quality, and OP shouldn’t be held responsible for this. It’s her choice to keep her dog alive when it’s not really living at all, and heavily dependant on humans to do every damn thing to keep it alive besides breathe for it, and so she should be the one caring for it.", "👏👏👏👏👏👆👏👏👏👏👏", "It's deaf, blind, unable to smell, eat or drink by itself, and incontinent. I'd bet money that poor animal can barely move itself. Animals can't tell you when they're in pain and that animal is DEFINITELY in a lot of pain.\n\nAny vet anywhere would recommend sending that poor thing off softly to dreamland.", "Thank you for putting into words what I was thinking. Thank you for your empathy and understanding that being blind, deaf, incontinent, needing help to eat, and being old does not mean you are suffering. \n\nMy dog is 15 and has been deaf and blind for a few years now. He has accidents in the house occasionally.  He is a happy old boy and follows me everywhere, albeit a little slower these days. \n\n He loves his life. His kitty friends, the other dogs , his slow walks or rides to the river, smelling the flowers in the garden, chewing a Bully stick and sleeping in the sunlight.\n\nAnd I and my husband will care for him to the end just as we have for all the other dogs and kitties we've had during our life. Just as we did for our parents .", "Exactly!  All these disgusting people saying to just kill it like it's an inconvenience are ridiculous.  Nothing anywhere said the dog is in pain or suffering.", "Letting it suffer the way it is is what's truly disgusting he isn't the ah the gf is", "It can’t see, hear, smell - it’s world is black. Everything a dog uses to experience it’s surroundings is gone. It can’t drink, it can’t eat, it can’t control its bowels, it likely doesn’t move around much at that age either. Where is the quality in that sort of life? How is this anything but causing an animal to suffer for fear of the pain of losing it? It’s selfish and cruel.", "It can’t see, smell, hear, eat or drink, and can’t control its bowels. How is that not suffering??", "My Soxie was put to sleep last year for this reason. Her hearing and sight had been going for a few years but she still loved to play with her ball and cuddle. It was when she started having accidents while asleep without even realising that we knew it was time. That dog was my world for 18 years out of my 25 and I couldn't imagine prolonging her suffering any longer than we already had just to make myself feel better. One of the hardest responsibilities of a pet owner but probably one of the more important ones. NTA", "Yeah. The dog's probably thinking \"Please unalive me\". That's the best thing to do if the dog is really as bad as OP described", "My mom is getting older, she told me and my brothers many times that she would rather die than end up like this.", "We can put our pets to sleep but we can't even choose to put ourselves to sleep with consent...", "Suffer?  The dog isn't suffering by living. He didn't say anything about being in pain.", "No ***it isnt***, youre assuming that because it would make you miserable. Its a dog- and its owner cares about its needs and there is zero indication that the animal is in pain. If *she* thought that it was in pain *she* would address that. OP makes zero mention of the animal being in pain and thats telling.\n\nMy dog had a number of health problems and he was still derpy and enjoyed a lot, despite the age related loss of ability. He didn't have many teeth so needed help eating but he still ate on his own! Its not being tube fed. Making sure the dog can get enough water to stay healthy **is care.**", "A dog can't tell you if it wants to die, but it also can't tell you if it is in chronic pain. The animal is blind, deaf, incontinent, unable to smell and unable to feed itself or even drink water. It is definitely in chronic pain and has a very low quality of life. Ask any vet and they will recommend easing that pain.", "You think not being able to eat, drink, see, hear, smell, move much without 100% assistance isn’t suffering???", "Where does it say the dog is suffering?", "My partner and I have said that if for any reason we are no longer in control of our faculties in the future whether that's age, illness or an accident that we'd want to be put to sleep. I've always struggled to understand why euthanasia is a kindness for animals but cruel for humans?", "You don’t need to be in pain to suffer. Not being able to see, smell, hear, eat or even drink unassisted is very much suffering.", "You can ease chronic pain with medication and pain killers and massage or other methods.\n\nYou are assuming the animal is in chronic pain to justify your opinion.\n\n***OP says nothing about the dog being in pain.***", "The dog can’t see, hear, smell, drink, eat, hardly move, and no bowel control, and you think that doesn’t constitute suffering? What quality of life is that?", "My gran had dementia and wanted to live - or rather she was terrified of dying. She was in a home and was kept alive as long as possible, but man... that last year or so... She had no quality. Like none. \n\nShe wanted to live not because she treasured being alive and what that gave her, but because she was so afraid of dying. \n\nPersonally I do not want to end up like her. For me quality is much more important than quantity and I do hope we have sensible laws in my country when I get to that age. \n\nAs for the dog - it's impossible to know what the dog wants. Though I am wondering how much joy the dog is getting out of it's current situation.", "So if a dog gets mauled to the brink, you want it to suffer rather than go through the kindness of ending the pain? \n\n\nA lot of vets advocate for quality of life for this very purpose. Yes dogs can't tell us with their voice but vets are trained to see beyond their voice to their body language and their health.", "This is why they need a vet's opinion. Often animals will hang on for their owners, even if they're basically suffering non stop. This is not at all a kindness to the dog. If a vet says the condition is too advanced for the dog to have any actual quality of life, that would be a way more solid assessment than a bunch of internet strangers who have never seen the animal in question. But arguing that as long as the animal is not in constant pain it can be happy, is simply not true.", "Life isn’t defined by eating? Maybe not for all living beings in the universe, but pretty sure for most living things on Earth need to eat something whether it’s animals, plants, sugars, photosynthesis, etc. I know at least humans, dogs, and cats need to eat to live.\n\nEdit: No eating isn’t the only thing or way to define life, but people and most animals do need it to live.", "At 20, I thought the same. I'm only 36 and I hope I have many years ahead, but I no longer think that because I had to watch my grandparents and other older family members go through it and have also had health issues myself - I got a real wee taste of what it's like to be \"helpless\" and it was enough for me to change my mind. If you don't have at least some quality of life and are constantly humiliated by the level of care you need, I wouldn't blame you for checking out and I would probably do so myself.", "There are worse fates than death. You won't realise how much losing those senses and abilities will affect you until you have them. Qhat if you get them and you then change your mind?", "I'm two ways about this and my answer is NTA about the dog but YTA for how you responded to your GF's refusal to put her beloved dog to sleep. Idk if this answer will even be seen, but here's my two cents. \n\nYou, sir, and the others who suggested the same are correct that at this stage of the dog's life, it should be put to sleep, if only to be kind to the poor creature. \n\nHOWEVER, immediately reacting with you will no longer help with the dog after her refusal was a bad choice, imho. To me, and maybe to your GF, it sounds like you're revealing to her that your suggestion was malicious, rooted in not wanting the responsibility of caring for the elderly dog AND the possibility of financial loss *because* of the dog. To me, an outsider, it sounds like you want to be *done* with the dog already, who cares. I can only imagine how your GF feels. \n\nI'm perhaps assuming too much but you think and feel more kindly to that dog than you do your GF in this situation. \n\nOP, did you consider that maybe she's realised that she *must* put the dog to sleep but she's not ready for that loss yet? Is this her first dog? is this the dog she grew up with? *Clearly* she's very attached to her dog, taking care of it despite all those problems. Maybe she knows but doesn't know *HOW* to be ready for that loss.\n\nOr maybe she really believes that it's her responsibility to take care of the dog until it naturally dies instead of it being induced. Maybe she thinks that's a good way for the pup to go.\n\nIf you believe she's wrong, maybe you could *empathise* with your GF, explain yourself and your suggestion, and slowly work her up to it. Help her do little things to keep the dog comfortable and happy, help her find ways to have keepsakes of the dog-- paw print statues, a thing made from the dog's shed fur, etcetc, so its end and the future without that dog (always sooner than she wants!) might be easier to bear. \n\nAnd not, \"Oh you dont want to do what i think is best? well get f'd, you can deal with it on your own.\" God.\n\nedited for punctuation.", "ESH. \n\nYou're NTA where your girlfriend's concerned; if the dog's old, in pain, incapable of living properly, he should probably be put down, even though it'll be horrible for her. \n\nYTA, however, by refusing to help with the dog; the dog is not able to take care of himself and depends on you and your gf to take care of him. If you're at home while your gf isn't, you should be taking care of him, because everything else borders on animal cruelty. As soon as she's at home, it'll be her job.", "Yes YTA. What's best for the dog might be euthanasia, but that needs to be assessed by a vet at this point.\n\nHowever, you seem to be more concerned with how inconvenient this dog's existence is for you. Your lack of sensitivity in how you talk about it with your gf, and the fact that as blackmail, you're just not taking any care of the dog anymore, suggest that you're not taking this stance because of how much you care for the dog's wellbeing. You just wanna get rid of the nuisance.\n\nI do think it's a realistic thought that the dog's quality of life may be very bad at this point. That would be tragic, and it'll be a difficult process for your gf. But she needs to decide on this together with a vet's expertise. It's not up to you to make this decision by blackmailing your gf with neglect of the dog.", "Yes, it is probably time for euthanasia. But the way you talk about the dog you show not even a sliver of compassion. You don't care about the dog and you don't care about your GF either. For you this dog is nothing more than a broken object that needs to be thrown into the trash. You don't show any empathy. The only thing that matters to you is your fucking carpet. And to get your way you will neglect the dog (making its life even more miserable than it already is) and use emotional blackmail on your girlfriend. \n\nAnd for that alone YTA.", "ESH.  Yes, she is being cruel and selfish keeping doggo going in such a poor condition.  On the other hand you're being unsupportive and insensitive and may well be damaging your long term relationship by planting the seed of question as to how supportive of a partner you might be in the future when difficulties in life arise.", "YTA you don’t give a shit about that dog or it’s quality of life, you just don’t want to have to care for something that’s elderly and disabled. Good luck getting out of that for life.", "INFO: is the dog living in pain (arthritis for example)?\n\nIf it is merely an inconvenience and the dog is happy then YTA for suggesting this.", "ESH. You’re not going to change her mind. But you’re also damaging the dog by not helping.", "ESH, you are completely right logically.\n\nBut this is a highly emotional/sensitive topic and you need to approach it much more gently imo.\n\nFocus on honoring its last days, and convincing your girlfriend that it is time for her beloved dog to be at peace. Hopefully if done with love and gentle guidance the right choices can be made.", "I have an 18 year old beagle. While she is not incontinent yet, I know it is likely something coming. And when we get to that stage, letting her go will be a topic of discussion. \n\nThe idea of putting a much loved family member down is horrifically painful, and intensely scary. It triggers the grief of losing them, before it even happens. Your girlfriend is scared of losing her pet. She hasn’t come to terms with how her life will be, after he is gone. Letting go is awful.\n\nGiving her ultimatums on caring for her dog will not help matters though, and she will remember this from you and will resent you for the force you are using to try and get your way. The best you can do is apologize first for how you handled it, but gently ask if she thinks her dog is still enjoying life. Is he happy? Is he eating/drinking? Is he still able to dog? There are quality of life scales on the internet that are eye-opening.\n\nYTA for the ultimatum, though I think your heart is in the right place with respect to the dog.  But, ultimatums usually end relationships.", "NTA, there is no good way to suggest euthanasia.", "NTA that poor dog is suffering", "NTA. I have a 19 year old chihuahua who was never completely house broken (I got her at 12 and was never able to get her to stop while her daughter caught on quickly). Yes, she wears diapers at night to contain the mess, but she is still alert and functional. Eye sight and hearing are questionable, but she is still able to function as a mostly normal dog. Definitely not suffering. If she were to get as bad as your girlfriend’s dog, I would definitely be considering making that final vet visit. It’s a hard decision to come to though.", "OH GOD I LOVE DOGS BUT SHES GOT TO LET GO \n\nNTA OP\n\nTHATS WICKEDLY CRUEL THE DOG NEEDS TO REST HES SO TIRED", "Your not the ah I agree with you I don’t think the dog would like to live like this anymore and it is inhumane.  I think you need to do what’s best for the dog even if it means putting it down because that would be the humane thing to do .", "NTA\n\n&#x200B;\n\nyou are right, because of this: \"my girlfriend is prolonging the inevitable for her sake not his. Which I understand as she’s had him since she was a little kid, however, at some point this isn’t good for him. \"", "NTA. She is being unkind to her pet. Show her the responses here.", "NTA, this dog has a very low quality of life, and is likely suffering a lot just so that your girlfriend can squeeze a few more months out of him (sorry for the wording). I don’t like dogs, but I never understand how people who so often claim to love their dogs do this to them, just makes me sad.", "NTA-but as some others have said you shouldn’t try to convince her alone. She’ll likely need to hear it from multiple people if possible to come to that decision on her own. And if you’re the only one pushing for it she could grow to resent you.", "NTA. He can’t even eat and drink on his own anymore. Go with her to the vet so they can tell her what you already know. Maybe she’ll finally see reason, and I wouldn’t be shocked if she’s been avoiding vet visits because she knows too.", "NTA - this animal needs to go to God. Bless his heart but she needs to let him rest.", "NTA", "It’s down to quality of life and it’s questionable if your GF’s dog still has any\n\nMaybe get a professional opinion on the dog and be prepared to have abuse and give love", "ESH\n\nI have an older dog (13) who has so many health issues and requires constant care and monitoring due to being blind and some incontinence. However, I am watching her currently chasing a ball around the place, barking and wagging her tail. if your g/f dog isn't enjoying life then perhaps introducing the idea isn't a bad thing, but know that it will *not go down well, and might end your relationship.* If the dog is able to enjoy some playtime despite his issues, can you use puppy toilet training pads? I use them all the time and its easy clean up, no ruined carpets. \n\nYour g/f is doing everything she can to help her dog, I know, and letting go won't be easy but there comes a time when it has to be done for the sake of the dog.", "Imma go NAH. I was actually in a very similar situation to your girlfriend. I had these 2 cats that were family cats. They were the first pets me and my brother got and I remember going to collect them. I can't describe what they meant to me. \n\nThey were both, 18, incontinent and couldn't do the things that they used to enjoy and were hardly eating. At the time when I lived with them, their decline was so gradual and had become such a part of my life, I couldn't actually really notice how bad it had got.\n\nPeople would tell me that I needed to have them put down because of their quality of life but honestly in my head I couldn't get past those incredibly rare (and distant) memories of times we'd had a cuddle or they'd laid in the sun that I'd took as signs of them being contented and happy. When I was in it, I couldn't get away from thinking that if I was to put them down, it would have been because I was being selfish because I didn't want to have to clean up after them twice a day. \n\nThis was then compounded by them being very much not travelling cats. I had took them to the vets around 2 years before they died, when they first started properly declining and it was such a stressful experience for them (they hid under the bed for 3 weeks after) that I couldn't put them through it again.\n\nI completely appreciate what everyone is saying about putting down this dog being the kindest thing to do. I feel guilty now that I selfishly made the cats stay with me for so long and that was for my benefit not theirs but honestly I have so much empathy for OPs girlfriend. It is so hard to think rationally when I pet who has been with you for so long is deteriorating. \n\nPersonally, I wouldn't stop supporting girlfriend with caring for this dog (that is just going to make his suffering (and hers) worse) you are in a horrible situation but what helped me was my mum going with me to the vets and the vet was able to explain to me what was going on and what the best thing was for my pets. I know other people had told me but it was easier for me to accept that the vet was telling the truth and telling me what was best for the cats and not just a family member who didn't care about my poor cats and just wanted me to live in a house not covered in cat wee and poo....", "My beagle was 15. When she could no longer support her rear to potty we made the choice. Does it suck? Absolutely. But you have to think about the quality of life for the dog. And when she dies make the decision, please make sure she is there for her fur baby. No animal should go to sleep thinking their owner abandoned them. NTA", "NTA. My dad's dog had end stage renal disease, heart failure, and seizures at 15 years. He had him on meds that didn't work, and he was at work when the dog would have seizures, so he never dealt with them. I had to put my foot down and tell him, \"You're playing God, and it isn't working, your dog is in constant distress, and avoiding death won't stop it from happening.\" He finally put him down long after the vet suggested it. She's soothing her guilt, and it's a lie that her dog pays for.", "YTA ending another creatures life is sometimes the right thing to do but your GF needs to talk to the vet about this and not you. You not changing your dogs diaper is a separate issue and if it’s a shared dog then it’s a shared responsibility and you’ll get used to it", "How can that dog possibly have any good quality of life? Blind, deaf, can’t walk, can’t eat, can’t DRINK!? My dogs all felt so terrible when they had accidents on the carpet… oh man this IS cruel. NTA oh boy I can’t stand to see or hear about animals suffering because their selfish human doesn’t do the right thing…", "NTA, if dogs could speak, they would beg us to be strong, when they no longer are. It is our most important task, to let them go, when their time has come.", "YTA. It's not your choice to make, and it sounds like you only care because her beloved pet is an inconvenience to you. It's her life-long friend, not yours.", "NTA. She is choosing to let her dog suffer with you as an unwilling caregiver.", "Feeling for the dog here.  You're NTA.  \nHad something very similar with my brothers dog earlier this year.  My brother died in 2009 and my parents 'adopted' his 4 year old Yorkie.  Poor thing was blind, deaf, had arthritis and dementia in the end.  He would just stand in the middle of the room or just facing a wall for 30-40 mins.  I had been saying since early last year that he was 'on his way out', my parents were bathing him 3-4 times a day as he wasn't cleaning himself.  With the connection he gave them to my brother, they point blank refused to let the vet 'put him to sleep'.  \nIt was heart breaking at the end, he shouldn't have had to suffer for near on a year because they couldn't let go.  He's buried in the garden, parents are happy and well, yet that poor fecker didn't get 'an easy way out'.  \nI'm not an animal person, but nothing should have to suffer like that and when there is a legal option to ease it for them, I'm all for it.", "NTA, let the poor creature die with the little dignity it has left.", "NTA, once an animal’s quality of life has deteriorated to the point where they can no longer clean themselves, eat for themselves, or be mobile  we are not keeping them alive for their own good. We are keeping them around because we don’t want to say goodbye which is extremely selfish sometimes to the point of cruelty. It sucks I had to say goodbye to the best dog I’ve ever had last year. I cried like a baby and I still miss her all the time, but I know I did the right thing because with all her health issues she was suffering.", "NTA she’s cruel nothing more nothing less. We’ve had 4 dogs in our 23 years together. Devastating as it is their comfort and quality of life has been the only priorities. It is painful but sometimes necessary. Unfortunately the only one here being hurt is the dog.", "NTA you are right, she is selfish and the doggy is miserable.\n\nWe've had similar situation in the family.\nOur dog was old, had back and leg problems. Was in pain whenever he had to get up or lay down.\n\nWe decided to put him to rest but sister(30) wouldn't hear of it.\nHe continued to suffer for a full year because of her selfishness.", "You will lose this argument. No matter what you do, you will be seen as the enemy. Also, you can't NOT take care of the dog. That is cruel as well. \n\nHonestly, I would do right by the dog, and since you work from home, I would make an appointment with a vet and get a professional opinion. Let the vet be the bad guy and support the heck out your GF (only if you see this long term) bc she is going to lose her shit if she has to put down the dog. Which she should. But hearing it from a professional and couching this as what's best for the dog is the only option you have. You have to keep reframing this as what is best for the puppers. If you continue to complain about changing diapers, then she will see you as a monster that doesn't love her dog, therefore an extension of her. You will not win the irrational argument. Continously reframe to what is best for her baby, not what is best for you. \n\nYou can't put down the dog on your own as tempting as it is. The dog deserves to be with her mom while she crosses over. I would also find a good service that will come to the house so it is the best space for the animal. Warm and snuggly in moms arms for her last breath.", "NTA.  Most of my friends and I have a general rule (shared with others) that when pets are no longer able to drink and eat on their own, and especially eat and enjoy it like most dogs do for favorite treats or people food, it's time to visit the vet for a final eval and consultation.  \n\nShe's the one being cruel prolonging the poor dog's suffering in old age.   He's lived an amazing life, let him rest across the rainbow bridge.", "NAH - You are right. That being said it shouldn't be a surprise that she is upset about the idea of putting her dog of 18 years down.\n\nUltimately yes that dog probably should be put down as that is not a nice life, but it is also understandable that she doesn't want that to happen. She should definitely be the one cleaning up all the mess though.", "This. Most vet practices are more than happy to do this. We understand this is a very, very herd decision to make and it can bring a lot of comfort to have a medical professional tell you you are making the right decision for you beloved pet. That they're not giving up on or betraying their family member.", "That's a great tiebreaker. I suspect if she doesn't wanna go for that, it would show she knows OP has a better chance of being correct", "When I knew my dog was near the end I took him to the vet for this reason. The vet knew I just wanted someone to tell me I was doing the right thing. She said “if you are looking for someone to tell you this is the right thing to do, I am here to tell you that. This is not the moose (dogs name) I know. It’s time.” And it just made me feel better to have a professional confirm what I already knew.", "100% this. My 10yr old husky mix fell very ill last august so I took her to the vet. She was refusing food which was very worrying as she was a very food motivated dog. When I brought her in they did X-rays and bloodwork and it turned out she had a huge tumor on her liver that burst. They told me If I wanted to take her home, she would have a week before she had to be put down. The fact that she couldn’t eat when she loved food her whole life was enough for me to make the call. There was no sense In prolonging her life so I could spend more time with her before the inevitable, when she was suffering. Quality of life is more important than quantity.", "I wonder if the dog is living in pain or if it is just old but still happy, we would need to see the dog in action.", "I'm curious about the vet too. It's interesting here that a lot of people have already decided the vet would agree with op. Yes, op tells us the dog is blind, deaf, and incontinent but not much about health otherwise. And nothing about whether the dog still plays or enjoys walks, or whether the dog shows its suffering (though they don't always show it)", ">It's ruff for both of you\n\nI see what you did there.", "You're a vet and you posted about your German shepherd's ears not standing up 3 months ago?  And you said you wouldn't do SURGERY on them to make them stand?!  You don't know that has never in the history of Alsatians has that ever ever ever been done???  YOU DON'T KNOW BASIC CARTILAGE DEVELOPMENT ON PRICK-EARED DOGS LMAO???  *You don't know about posting?!*\n\n***BULLSHIT***\n\nYou are 100 percent not a DVM.  That's a gross thing to lie about.  And actually, I hope you are lying.  Because if you're telling the truth, I have some questions about where you graduated.", "She's a raging asshole for keeping a suffering pet alive like that. There's zero quality of life there. I get it's hard, but she's being completely selfish, and her dog is paying for it.", "This is my precise view too", "Agree 100%", "It’s literally a dogs mind stuck in a broken body. It can’t do anything. Many vets here agree it’s likely time for the dog to move on. Yes it’s sad, yes it’s up to the girlfriend, but suffering doesn’t necessarily mean pain. You’re not keeping the dog alive for the dogs sake, you’re doing it for your own selfish sake. That is a true lack of empathy.", "Suffering does not necessarily mean pain. The dog literally can’t do anything besides exist. It can’t hear, it can’t see, it can’t smell, it can’t do anything. Their is no joy left. The dog is literally just a mind in a broken body at this point. It time, and many vets here agree that it’s time.", "*lose", "Yeah, only women *checks notes* don't change a dog'd diaper!", "That’s a nice sentiment, but when does the love become selfish and prolonging a life a suffering? This dog can’t see, smell, or hear. It’s just a mind stuck in a body that hardly moves. Dogs aren’t know for complex internal lives. So it just lays there, doing nothing.\n\nThat is beyond sad. She’s keeping the dog alive for her own benefit, not the dogs.", "The dog literally is just a mind trapped in a broken body. It’s suffering.\n\nSuffering doesn’t necessarily mean pain. It literally can’t do anything, what kind of life is that? \n\nMany vets here have said it’s time for the dog to move on. And I’m not saying that it’s an easy situation. I’m not saying it’s not hard, but it is the right thing to do.", "The dog cannot eat or drink on its own. That’s when it’s time to put the dog down.", "> Do you want her to kill you when you're old and need to wear diapers?\n\nIf i'm blind, deaf and shitting myself while people hand feed me, then yes put me down.", "Are you 12?", "Came to this.", "NTA letting go is hard but necessary", "That's why I support medical assistance in dying", "I wish we had the right to die universally. Why do our pets get more rights than we do here? Probably religion has a lot to do with it.", "I am honestly not sure what point you're making here.", "I agree this isn't breakup material, but it is concerning behavior that should be addressed. If OP suddenly got very ill or wound up in a coma and they absolutely did not want to be kept alive in that state, could they trust her to follow their wishes and let them go? It's definitely something worth evaluating because it can have severe ramifications on OPs life should the absolute worst happen down the line.", "I worked at a vet. It’s very clear this is either ragebait, or you’ve never seen a dog in that state. I’m not even sure if you know what euthanasia entails, how is works and how vets decide it’s the best option.\n\nThe dog cannot eat or drink without assistance. That’s not just a senile dog. That is an animal who is suffering. An 18 year old beagle *would* be in quite a bit of pain. Their hips are shit as is. I can’t *imagine* how awful it would be at that age. You have to keep in mind that, instead of taking this dog to the vet when it started shitting itself, she just put a diaper on it. Plenty of old dogs *can* get pain meds etc. and what is essentially end-of-life care, but she’d rather let him sit in his own shit for several hours a day because, at that age, something probably is wrong.", "It's 18 years old and can't even eat or drink without assistance. It reminds me of patient's families who demand we keep meemaw alive when she's 96, doesn't want to eat anything, has a laundry list of medical diagnoses, is clearly trying to die, and wants to go in peace. There's zero quality of life.", "Wow what is your problem? This is an anonymous forum and this advice is correct. Should we just take your word for it that you are a vet tech? Have you never asked a question? People in the vet industry need to be kinder to each other. Clients are mean enough. Yeeesh.", "I understand that but there are kinder and better conversations you can have around that instead of saying something more hurtful and refusing to be support until the GF has had more time to come to terms with and process it", "I'm not defending her, I'm just stating the fact that it's a very difficult decision to make, don't be so quick to judge", "Does the dog not have access to pain medications if they are needed?", "Can' he eat and drink on his own? Does your dog have to sit in it's filth until someone changes it?", "This thread explains why there is so much elder abuse and why disability rights are so important... some of these responses are utterly despicable. I'm surprised they dont violate any of the rules for disability descrimination.\n\nI'm so glad you and your partner are loving, responsible pet owners. It is good to know some do exist. Its been a while since we lost my little old man and we've rescued a kitten since then and that helps the house feel less empty. I wish your family all the good memories together.\n\nI feel bad for OPs partner if she is being gaslit to think her empathy is unhealthy.", "but that is not your choice. \n\nmaybe she is selfish. but i doubt she is as selfish as he is making her out to be.  i have an elderly dog. i know what it can be like and how hard that decision will be if/when the time comes. \n\none thing i can say from his story, she sure as fuck loves her dog. \n\n and her partner is an asshole.", "he never stated what the vet said. \n\nhe never mentioned the vet at all. only how old he thinks this dog is  how its half blind, how she feeds it, or gives him water, how it makes messes.  \n\nlet me ask you this, if you had a dog for 18 years, you would have a vet.  she is probably paying out the ass for that dog, they probably go every few months because of something. The dog is 18 years old.  I mean all the people on here saying she should have a vet look at it.. you honestly think she doesnt have a vet?  i mean, come on. \n\nyou think she hasn't had conversations with a decent vet about end of life care?  you think that a responsible vet wouldn't let her know... why didn't he mention it?\n\nhow he as an adult male has refused to help his partner and has given her an ultimatum.  \n\ntake the dog out of this scenario.  people get triggered af about dogs, because most of us have lost one in our lives and it is heart wrenching. Actually look at his argument, how he is putting his foot down and demanding his partner do something.\n\nHe is an asshole.", "That's doesn't mean he's in pain.  And didn't say it can't hear or see at all.  Would you do the same to a senile relative?  Just do them in becsuse they have to be taken care of?", "Ok reread it...the fact that she is bottlefeeding and bottle drinking is now sinking in. That is a lot indeed. And one should ask now: isn't it time. From a dog owners perspective I can feel her pain and see she is not ready, but sometimes we indeed need to make these hard decisions for our loved ones.", "Yeah the issue I take with it is that OP didn't say he wanted the dog euthanized because he is suffering, it was because of OPs precious carpets and because changing diapers isn't fun. That's how he approached the conversation with his partner. It wasn't best interest for dog with empathy, it was selfish.\n\nIf there was any individual incontigent and incapable of changing themselves under my roof, I'd change as many diapers as need be.", "1. Vets can't diagnose over the internet\n\n2. It probably is time but every keeps sliding past my point that OPs intentions are self centered rather than best interest for the dog and compassion in how he communicates that to the partner", "It can’t see, eat, smell, hear, or even drink water - it has a black world without sound smell or sight. It cannot do basic things like keep itself fed or hydrated. It barely moves and has no control. How is that not suffering?", "gross", "My grandma is 93 and basically all the family I have. She talks about death like it's right around the corner for her and honestly at this point I think it's more hopeful thinking than anything. Meeting a new soon-to-be in law for my cousin I told her about my grandma and when I said her age she told me \"oh that poor woman\" I told her she would agree with you. Lol", "This is so wild to me. I have a 12-year-old border collie/greyhound mix. She's got a fair amount of life left in her, but she's definitely aging. I adore that dog beyond description. When she stops enjoying life and loses control of her bladder, then it'll be time for her to cross the rainbow bridge. It's going to destroy me. But I can't imagine putting my sweet mutt through what's being described here.", "[A majority ](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2797361/#:~:text=Syringomyelia%20(SM)%20is%20defined%20as,the%20foramen%20magnum%20(1).) of purebred King Charles Spaniels have a genetic condition where their brain is too large for their malformed skulls, so it is squeezed into the spinal cavity, causing chronic pain. No spaniel will ever look up to their owner, Babe style, and say \"master, my head is in debilitating constant pain!\" \n\nI'm assuming it is in pain based on what the horrifically low quality of life OP describes the dog being in.", "Dog diapers are a whole thing- many people make female dogs wear them in heat and male dogs who mark territory even have special \"belly bands\" and none of that is a reason to euthanise an animal.\n\nDo infants have to sit in their own filth until someone changes it? Yes. Thats what a diaper is. If its not changed, thats neglect.\n\nThe issue here is OP being an asshole for refusing to provide care for the dog *so that it suffers*. He threatened to **neglect** his partners dog to force her to euthanise it *because he doesn't want to care for it* and NOT because its in pain and hes concerned for it.\n\nThats big YTA energy.", "This is typical of reddit imo. Lots of “child free” people and people in favour of euthanising elder pets but if you call them out on how ableist and close to eugenics it all is then they just block you rather than face their bigotry.", "I’m sure the vet has told her as much and she has refused. They will continue to care for the dog if she doesn’t go through with it, as that’s their job.", "He literally describes what the does is suffering from. Suffering doesn’t necessarily mean pain.", "Try living a life in which you can't see, hear, eat, drink, or broadly do anything for yourself, and say that isn't suffering.", "The poor creature can't eat or drink on its own even if you take out the loss of bodily functions.\n\nThere is a big difference between care and the natural end of life, if the animal was not being cared for by people purposely extending its life then it sounds like it'd have passed some time ago.\n\nThe fact of the matter is many humans in that same situation are given \"pain management\" if they get that bad and hopefully pass peacefully. I certainly hope if I got that bad someone would do it for me.\n\nThe other factor is that at the end of the day it's not his dog.\nIt may not be the nicest thing in the world but he has no obligation to care for someone else's animal.", "I disagree that it’s out of selfishness. \n\nPlus, while a vet can’t officially diagnose over the internet, based on the given description it’s not hard to come to an educated conclusion. OP and the girlfriend should take the dog to it’s vet and ask them.", "So when my elderly childhood cat was in so much pain she could no longer stand up, couldn't stomach food or drink, we should have let her suffer? When she no longer had circulation in her feet to the point her pads went cold, we should have let her \"live her life\"? \n\n\n\nWhen my cousins FIL was in tremendous pain that was irreversible, he chose the option to pass on. When you're at the point where the only thing you feel is pain and it's not getting better and won't get better, it's cruel to prolong it. \n\n\n\n\nYou say pets don't get a choice but guess what? As the owner, it's your job to advocate for them. And if they no longer have the ability to be a dog/cat/etc. Then the humane thing to do is put them down so they aren't suffering. It's human selfishness that says otherwise.", "I have a 15 year old greyhound and we absolutely adore her. The thing is, she has arthritis and anxiety, but the vet gave her meds for it. If a dog has problems like that, including straight-up incontinence and inability to eat, you *need* to see a vet, even if they’re probably going to recommend euthanasia. I don’t understand how OP’s GF’s first thought was to buy diapers instead, and how what she’s doing isn’t considered cruel by that commenter’s standards. Sometimes vets DO have solutions, but in this case (the beagle) it seems unlikely.\n\nThere are guidelines regarding quality of life for animals and how to go about euthanasia. If it gets to a point where a vet recommends an animal gets put down, it means there’s almost no helping that animal, and even if there is it’s not worth the risk and pain that animal is going through. For example, elderly dogs don’t usually get surgery that late in life because they’re unlikely to survive anaesthesia. If it’s either “surgery they won’t survive” or “passing away peacefully among family” a vet would recommend the latter.", "Why can't it walk, feed itself, find the water bowl etc. Why aren't it's legs working like they used to? It's in a lot of pain. Of course OP says nothing about being in pain. Dogs can't tell you when they are.\n\n [A majority](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2797361/#:~:text=Syringomyelia%20(SM)%20is%20defined%20as,the%20foramen%20magnum%20(1).) of King Charles Cocker Spaniels have a debilitating genetic condition that causes chronic pain. Do dog owners care? No, because their adorable pup can't tell them that their brain is too large for their malformed skull.", "Needing help isnt a justification for euthanasia. Bodily functions haven't been lost- the control of them it what's missing due to age. Its not on a feeding tube. Its not being artificially kept alive, its being cared for during a natural process. It just needs help getting food & drink into its mouth- to maintain a decent quality of life- and not making a mess indoors, which is just what pets do at any age.\n\nThere is a big difference between providing care and allowing a natural end, and choosing to inject a heart stopping drug when its most convenient.\n\nIf pets weren't care for by people they'd be wild animals, not domesticated pets. Humans bred animals into domestication and that created an obligation. 'Nature' is cruel, humans dont have to be.\n\nThe other factor is its not his dog but hes trying to force the owner of the dog to do what he wants through blackmail and animal neglect. He doesn't have an obligation to care for anyone else's animal but if he wants to be in a relationship with his GF then he should care because she has no obligation to stay with him.", "I agree.\n\nIt may have been a misinterpretation, but I felt when reading it that OPs concern was his rug and annoyance with changing diapers.", "how young do you think I am? One of my grandparents died before I was born, one of my grandmothers died the day after I turned 16 (messed me up actually), her mother died about eight months after her (she had dementia), and my other grandmother died about two months after the last time I saw her. I was a wreck when she died because I lived with her for a portion of my life. I could tell the last time I saw her she didn't have as much energy as she used to. Can't remember seeing her able to get around without a wheel chair or not needing adult diapers. She wasn't blind or deaf but was always in pain. I wasn't surprised when she died. The only time I remember seeing my great-grandmother aware was when I was really young and then all I saw her do was sit on the couch not doing anything.\n\nI do understand death and I do understand growing old sucks. I think about all the people I've seen who are just gone now. It's a lot. Not just my grandparents but teachers and other adults I knew as a kid who are gone. I still get afraid to answer the phone because I'm scared the news will be death again. So many of them seemed like they had more to do or wanted to do and death stopped them. This is probably why I say I want to live even when things stop working and I want the dog to live. I get that the dog is old and there's more things wrong with the dog than right, but just from what I've seen in my life people hang on until the end and that's what I think the dog should do.\n\nEdit: after writing all this I ended up crying for a few minutes from reliving all that and realized that I'm not actually arguing about the dog. I still personally don't think the dog should be killed, but that's not what all this has become. Seems I'm relating this to my inability to cope with the death of my grandparents and others. I think I'm done with this topic now and I want icecream. ngl it hurt when you said i haven't seen these issues first hand because it's really not true.", "My dog also has arthritis. We give her supplements and CBD oil and she still gets around ok. She still loves to play fetch and seems to be pretty with it mentally for the most part. She still has a good quality of life and I've discussed all this with her vet. I don't understand letting an animal deteriorate to this point and refusing to really address what's going on.", "\"Its in a lot of pain\"  **is a straight up assumption** You dont know that, OP doesn't say it and theres no indication its suffering. Needing help is not inherently suffering.\n\n\"Dogs can't tell you when they are.\" *Not according to the majority of other people here who say they can.* Behavioral changes and other signs are how animals communicate, which us why observation and awareness are important skills for pet owners. Cats are notorious for hiding health issues, doesn't stop people from keeping them as pets.\n\nAnd most purebreds have health issues. Bulldogs, labradors, boston terriers... some are worse than others but humans have done weird things to dogs, yeah. Thats an issue with breeding and selection for trait over health, not about elderly pet care. I agree people should care about breeding healthy animals, but I'm not going to kill every flat-faced pet that currently exists. Id adopt one and love it if that was the situation. I can have empathy and advocate for stopping irresponsible people breeding them.", "I hope you have someone you can talk to about all this, it's not healthy to keep these things bottled up. Get yourself some ice cream, get help from a friend or a professional, and believe me when I say things will get better.", "There are a lot of self help books about grief, end of life care, and all the emotions about this. There's also books and other media about health issues near end of life and quality of life as a whole.\n\n\nIt seems that your view of death makes death the worst thing in life. Whereas for most people, there are plenty of things worse than death. Dealing with death and illness isn't necessarily something kids and young people are really helped through, since typically the parents are mourning too. \n\n\nIt might be good for you to read these and discuss your past and what you've gleaned from these books in therapy. It seems you've got a lot to come to terms with and your past is potentially clouding your view on more topics that you were previously aware of.\n\n\nBUT you have started to realise this. And that's the first step! This is HUGE! I really hope you find the care and help you need to deal with the past, I think more of us have these things in our brains than we realise. I wish you luck!"]}