{"id": 1863, "submission_id": "yqae6u", "title": "AITA for being a “bad influence” at dinner with my boyfriend’s family?", "selftext": "My boyfriend is pretty mad at his parents over this, but some of his siblings and his parents think I was the jerk so here we are.\n\nI (29F) am a pro boxer, though probably in my last year or two of active competing now.  My boyfriend (35M) is really supportive of my career and he’s a total gem.  We live on the opposite coast from his family and he has had a pretty sour relationship with his dad for years, so I’ve never met them.  Over the last year, though, his parents have been making efforts to patch things up so when he mentioned that we were going to be in a nearby city to them for one of my matches, they wanted to get together for a family dinner.  I was actually kind of excited about it.  I don’t have family and his family is huge, so I always wondered what that was like.\n\nWe originally tried to schedule the dinner for before the match because I look a mess for a couple of days after a match sometimes, but they had a conflict so we set it up for a couple days after before we flew out to give me some recovery time.  I actually didn’t get that badly banged up, but there’s just no hiding face bruises and cuts. My boyfriend already gave the parents a heads up about what to expect but I don’t think they took it seriously. \n\nWe get there and his mom looks really uncomfortable and his dad is just like staring at me.  Some of his siblings and their families were there and I get mobbed by the nieces and nephews who all had about a million questions and that’s where I might have messed up. I told them about boxing and showed them a video on my phone of part of my fight so they would understand why I looked hurt and assured them I was fine. It evidently impressed the hell out of a couple of the nieces because they spent the entire dinner asking me questions and were kind of amazed that girls can do stuff like that.\n\nHis dad tried to shift the conversation several times and got pretty annoyed about it, and then said it was good I was thinking about retiring and getting on with a real life soon and I would have time to get a household together and start a family with Boyfriend. I told him that at most I would shift into being a trainer and I’ve already got the life I want.  His mom made a comment about it being a shame I was bruising up my pretty face and I joked that this was my winner face, she should have seen the other woman.\n\nThe whole thing was just uncomfortable and weird, except for the kids and one of his sisters. When we got home, Boyfriend checked his texts and immediately called and yelled at his parents. I found out later that his mom told him I was really inappropriate and a bad influence on the kids. One of his brothers asked if he was going to bring “Barbarian Barbie” back to Christmas because his kids were bouncing off the walls.  But, his cool sister told him their daughter was already asking when Auntie OP was coming back.\n\nIt really has caused a major problem between my boyfriend and his parents and I’m wondering if I should have just kept the boxing stuff to myself.", "created_utc": 1667974107, "permalink": "/r/AmItheAsshole/comments/yqae6u/aita_for_being_a_bad_influence_at_dinner_with_my/", "score": 1499, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I did kind of get the kids riled up and I showed them a video that might have been above their level even though I made sure it was an early part of the fight to avoid them seeing the rougher parts.  Also, I clearly made most of his family uncomfortable.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "“Barbarian Barbie” sounds like a pretty great name to me. \n\nIn any case, NTA. Your boyfriend gave the family a heads up, and still decided to move the dinner from before your fight to after. You have nothing to be ashamed about. I feel bad for some of those kids though. It must suck having such narrow minded, stifling parents/grandparents.", "NTA.  Yours is an unusual profession so lots of questions are to be expected.   But you certainly were not a bad influence; just the opposite you are a good role model imo.", "NTA. Boyfriend and the niblings sound okay, major side eye to the rest of the family.", "You gave his parents a heads up about the natural consequences of your profession. They had ample opportunity to talk about it with their kids ahead of time had they wanted to. Assuming you are correct and they didn't take your warning seriously, they still had an opportunity once you were at the dinner to explain it in a kid-friendly fashion. \n\nIn the absence of explicit guidance from them, you did a very natural and reasonable thing: you gave a simple and straightforward explanation of your visible injuries, complete with video evidence of where they came from.\n\nI'll admit, I was both surprised and impressed with how you describe your explanation, and then I realized that, like any other profession, you've probably had ample practice in responding to common questions about it. So I'm no longer surprised, but I am still quite impressed.\n\nNTA\n\nThe funny thing is that the family is completely overreacting. While it is very cool that girls can be boxers, most girls (and most boys for that matter) don't really want to be... Which means, like many other things kids get excited about, their excitement about this will fade.", "You're an athlete. And a winner. How does this make you a bad influence on little girls? I'm proud as hell of you. You have a career and a real life right now and you don't need to meet any absurd expectations about feminine grace, poise and beauty. (Has your BF's mom ever seen photos of Laila Ali in the ring? Bad azzed chicks are all girl. Period.)\n\nAt any rate, NTA. Why hide your light under some prehistoric bushel? That's silly to me. Live your life and enjoy the life you're living.", "NTA\n\nYou are showing everyone that women can be both badass and beautiful. The younger kids are so pure that they right through the \"sex\" aspect of the sport and saw an athlete boxing and enjoyed it very much.  His parents are so old fashioned they should be living in the 1930's. Keep doing you and keep that supportive partner of yours. He is a keeper.", "NTA, I can see why he's not close to his family.", "NTA. Your boyfriend's parents have been messing up his family life for years- you're just the latest excuse for rudeness and drama. Time to start taking your coaching from your boyfriend - watch how he sets limits with them, stays low contact and distances himself. Do that.", "NTA. I can't find fault with a single thing you described doing or saying. Sounds like your BF's family's reactions are their own problem to deal with, not yours.", "NTA Boxing is a respectable profession. You are an athlete, and practice a sport. Now if you were a drug dealer entertaining the young folks with your escapades I would agree with his parents. They might have been more accepting if you were male. So you did nothing wrong. They are just narrow minded.", "NTA \n\nBoxing is a job.... they wouldn't complain if you were a dude. They shouldn't complain now. \n\nFurther and this is almost irrelevant, children aren't that impressionable. If they are worried about their kids. Don't worry about the female boxer they see maybe twice a year. Worry about influencers on tiktok and instagram trying to sell them stuff every minute of every day. You know the good Christian girls with psalms in their bio marketing supplements and make up.", "NTA \n\nEven from the post you can kinda get the feel what type of people his parents (and his brother) are. The whole women should be house makers and nothing else. They even said that to your face. You did good, especially for those little girls who didn’t even know girls could do stuff like that. They were warned before hand, they were the ones asking the nosy questions and you answered truthfully 🤷‍♀️ they hurt their own feelings 😂", "NTA.", "NTA\n\nAs someone who wasn't allowed to even try out for football because I'd \"just cry as soon as I was shoved over\", I wish I had an auntie like you growing up. \n\nWhat is it about \"exposing\" young girls to sports that's so dang threatening to people like bf's family? It sounds like there's good reason he's been LC. Like, did they expect you to look runway-ready after a match? \n\nBarbarian Barbie would be a dope stage name, tbh. Maybe convince the niblings to sneak-watch MMA matches on the sly. Nothing makes something already cool become *more* cool than a bit of rebellion.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy boyfriend is pretty mad at his parents over this, but some of his siblings and his parents think I was the jerk so here we are.\n\nI (29F) am a pro boxer, though probably in my last year or two of active competing now.  My boyfriend (35M) is really supportive of my career and he’s a total gem.  We live on the opposite coast from his family and he has had a pretty sour relationship with his dad for years, so I’ve never met them.  Over the last year, though, his parents have been making efforts to patch things up so when he mentioned that we were going to be in a nearby city to them for one of my matches, they wanted to get together for a family dinner.  I was actually kind of excited about it.  I don’t have family and his family is huge, so I always wondered what that was like.\n\nWe originally tried to schedule the dinner for before the match because I look a mess for a couple of days after a match sometimes, but they had a conflict so we set it up for a couple days after before we flew out to give me some recovery time.  I actually didn’t get that badly banged up, but there’s just no hiding face bruises and cuts. My boyfriend already gave the parents a heads up about what to expect but I don’t think they took it seriously. \n\nWe get there and his mom looks really uncomfortable and his dad is just like staring at me.  Some of his siblings and their families were there and I get mobbed by the nieces and nephews who all had about a million questions and that’s where I might have messed up. I told them about boxing and showed them a video on my phone of part of my fight so they would understand why I looked hurt and assured them I was fine. It evidently impressed the hell out of a couple of the nieces because they spent the entire dinner asking me questions and were kind of amazed that girls can do stuff like that.\n\nHis dad tried to shift the conversation several times and got pretty annoyed about it, and then said it was good I was thinking about retiring and getting on with a real life soon and I would have time to get a household together and start a family with Boyfriend. I told him that at most I would shift into being a trainer and I’ve already got the life I want.  His mom made a comment about it being a shame I was bruising up my pretty face and I joked that this was my winner face, she should have seen the other woman.\n\nThe whole thing was just uncomfortable and weird, except for the kids and one of his sisters. When we got home, Boyfriend checked his texts and immediately called and yelled at his parents. I found out later that his mom told him I was really inappropriate and a bad influence on the kids. One of his brothers asked if he was going to bring “Barbarian Barbie” back to Christmas because his kids were bouncing off the walls.  But, his cool sister told him their daughter was already asking when Auntie OP was coming back.\n\nIt really has caused a major problem between my boyfriend and his parents and I’m wondering if I should have just kept the boxing stuff to myself.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. I can understand why his relationship with his parents hasn’t been a good one. They sound like a bunch of AH’s. Your answers were PERFECT. I LOVE Barbarian Barbie, or to stick with the original cartoon (and later movie) character, Barbie the Barbarian. 😃 You did everything right. Don’t give them another thought, as you sound like you are quite the opposite of an AH.", "Nope.  No reason for shame and your boyfriend certainly isn't.  There were reasons he was NC before and there may be reasons to go back to that.  And as for the kids, you got some new fans :)\n\n&#x200B;\n\nNTA", "NTA. Boxing is a huge part of your life and who you are. It sounds like you don't fit the image of what his parents want in a possible match for him and they're using the kids reactions to try and make their bogus point. If anything, their latest comments about you show exactly who the rude people are in this scenario.", "<<90]", "NTA. Go for Christmas and get the kids t shirts that say Barbarian Barbie. \n\nShowing girls they have options is not being a bad influence. That would be someone telling you to settle down when you’re pretty settled.", "NTA and his dad's comment about retiring and \"getting on with real life\" meaning setting up a household for a man and bearing children is just such a limited idea of gender roles it makes me gag. \n\nOf course you had to get into the boxing stuff. They wanted to know, and the kids were fascinated. Unless your BF was going to say he was responsible for your face, but that would have more than it's own drawbacks.", "NTA so what you taught kids that girls can be tough too hows that being a bad influence? Oh sorry girls should be pretty n pop babies out I forgot 🙄", "totally NTA. you aren't doing anything wrong to be called a \"bad influence\". that description is just being thrown around these days by people to others who don't qualify to their standards.", "NTA  They have some issues they could work on though.  The audacity of them basically telling you that you have to be a housewife.  They are calling you a bad influence because you don’t fit into their idea of what a woman should be.  They sound terribly close minded.  Your boyfriend sounds awesome, though.   Hopefully you can have a good relationship with the cool sister and not have to deal with the parents very much. It’s not your fault they can’t handle your career and you shouldn’t have to hide who you are, which is a boxer. And that is pretty cool!", "NTA They didn’t take you seriously because the concept of a woman fighting is foreign to them. When the kids asked you questions it was only logical to show them why you had marks on you. Kids are inquisitive. What if they began to wonder if their uncle did it? \n\nThe fact they think you being a pro boxer is somehow a shameful thing to let kids know says a lot about them and why your bf was not close to them. It would be interesting to ask if your boyfriend or his brothers ever came home bloody from a fight and how their parents reacted.", "NTA\n\nIf they think that this is a bad influence, well, boohoo. \nI hope the girls in your BF's family take an example out of you and remember that it's OK to be fierce. \n\nI've started boxing late in life (around 30, 4 years ago) and while I'll never be in a ring, it's people like you I look up to and keep me motivated. \n\nYou rock and congrats on winning the match! \n\nBtw, I low key love the name Barbarian Barbie 😂", "As a kid, my favorite relatives/parents of friends were my friend’s dad who got electrocuted so badly that he got lifetime worker’s comp, and my aunt who raised snakes and routinely spent weeks in the hospital after being bitten. \n\nKids like people who do stupid shit, especially if that stupid shit results in fun stories. \n\nGettting punched in the face for a living is a sure fire way to guarantee all the kids in your family love you.", "Agreed, and if you are feeling petty have Barbarian Barbie added to your intro next time", "Like they've never seen a female athlete before? Good grief.", "Great new name for OP", "> “Barbarian Barbie” \n\nOwn it. Be the Barbie we all wished we had growing up. Be the Barbie we all secretly wish we were now as adults.\n\nBIL may think this is an insult. It so is not!", "NTA. Never apologize for being who you are, when who you is strong, independent and powerful. His family are the ones with the problem - not you. They can take their backwards gender stereotypes and stew on them while you go and keep living your best life.", "Can you make Barbarian Barbie your professional name? I can see why your boyfriend doesn’t have a great relationship with some of his family. NTA", "This is all the proof anyone needs that it's not always the parents or family that influence the way a person ends up. \n\nYour bf should be hugely proud that he somehow escaped his family upbringing with a decent personality and values.\n\n&#x200B;\n\nYou should definitely not have kept the boxing stuff to yourself - if they were dumb enough to invite you at that point while knowing you'd been in a match a couple of days previously,  the consequences are on them.\n\nDid they really not expect the kids to ask questions?   did they expect them to somehow not notice any bruises?\n\n&#x200B;\n\nAlso -  you may just have saved at least one little girl in that family from assuming that all she can do in life is have kids and look pretty.\n\nNTA.", "NTA.  You have an unusual job but they were warned.  And for the nieces.... well it is kind of cool and it's important they learn that they have options. Your FIL was out of line about you retiring and starting a household. Ita not the 1950s you know?", "I agree. I love Barbarian Barbie... the woman who can do it all!!", "I would change my reddit name to that if were her.\n\nNTA and lolz at the pearl clutchers.", "That is such a badass title. OP if you have some sort of stage name/nickname for when you're fighting that would be the coolest petty compliance to start going by \"Barbarian Barbie.\" NTA though I'm glad your BF has your back too.", "A friend of mine runs a boxing gym. Most kids absolutely love it and then drop it (or at least don't go competitive) when they find out that they don't enjoy getting punched in the face. That doesn't happen until much later on so until then it's just a fun way to get exercise in and work on coordination. No harm done. \n\nSame is true for most contact sports. If a trainer is actually letting kids properly hurt each other then that's a bad trainer.", ">They might have been more accepting if you were male.\n\nI feel like this could be said for any sport. Or any job really that isn't traditionally female.\n\nOf course, if OP was male and dating their son, they'd probably just have other issues.", "NTA you did good. Boxing is you and if course you want to talk about it. Don't overthink this", "Your greatest achievement at this dinner was making your partner's nieces realise that their future did not have to be that of 'walking incubator' unless they wanted it to be.\n\nEven if they don't want to be boxers, maybe it may open their eyes to the possibility of working in professions not usually (can't believe I'm saying this in the twenty-first century) associated with being 'women's' professions.\n\nNTA and you must be so happy to have a partner that is so immensely supportive of you.\n\nGood luck with your relationship and good luck with your career as a trainer.\n\nBTW, if you don't call your new gym the \"Barbarian Barbie Boxing Academy\", there's no justice in the world", "No, you weren't TA for being honestly, openly, unashamedly yourself.", "OP, you absolutely ROCK! It must have been amazing having all the kids hero worship (heroine worship?) you at dinner, and it's such a shame their stuffy parents couldn't buy into the whole 'cool girl-boxer' thing.\n\nShould you start your coaching career at the end of your professional boxing life, you really should call it 'Barbarian Barbie's Boxing Coaching Valhalla' or something.\n\nFor the rest of your life, make sure any greetings cards you send your wonderful BF's awful family are signed 'with love from Barbarian Barbie'\n\nNTA. You're a knock-out. Good luck with your future bouts, and your potential coaching career.", "NTA I love the name Barbarian Barbie. You could use it if you ever segue into champion wrestling.", "NTA\n\nCome on, you and I know they wouldn't be upset if you were a male boxer.\n\nThe kids and boyfriend's sister are cool. Focus on them", "NTA your boyfriends family is sexist, that's where the real issue is. You just made their girls enthousiastic about \"something meant for boys\". You weren't an asshole, in fact you did something meaningful for their kids. It's good for kids to get some interactions with a worldview different from their parents, all in all it makes better adults. But the parents aren't always too happy about it.\nRegardless you're NTA", "You rock, Barbarian Barbie. We, humble Internet strangers, are proud of you. Now you know why bf is not close to his judgy parents. Keep kicking ass. NTA EVER", "Um, you're cooler than I could ever hope to be, and quick with the wits, too. That winner gave comment is gold. NTA and I'm glad your boyfriend gets why his family is so wildly inappropriate and off base.", "NTA. The kids loved you for a reason, and you opened their eyes to new possibilities. I absolutely love the 'Winner Face'  comment, what a boss comeback! You are officially 'the Cool Aunt' now, and the sibs know it.\n\nYou know what your next Halloween costume has to be now, don't you? Barbarian Barbie gonna bring the house down.", "NTA.", "NTA you have met them all now and because of your fight you have a really good opportunity to pick the best of the bunch to develop relationships with. Like a selection box of chocolates you can pick and choose.", "NTA. But barbarian barbie is a bad ass name. Fuck that family. They jealous.", "I think \"Barbarian Barbie\" sounds pretty rad!", "I have daughters and would be super happy for them to meet you (bruises and all). You did absolutely nothing wrong and, because the children were excited, all you did was answer some questions and be proud of what you do. NTA\n\nEdit a word", "Never hide your passions and your strengths. You sound incredible! Screw his judgemental, awful family. It was AH behaviour of them to be so judgemental and rude about such an important part of your life - particularly as they knew all about it in advance. I think it's fantastic you managed to widen those young kids' horizons in just a few short hours. So enjoy your lovely relationship with bf, bond with cool sis, and don't think twice about the Neanderthal parents. NTA", "Why should you feel the need to keep your profession to yourself? I'm pretty sure the kids and the one sister aren't signing up for boxing lessons just because you do it.  \nMaybe you should go to Christmas with that family and punch brother in the face a few times?\n\nNTA", "NTA and where can we find Barbarian Barbie for Christmas gifts for the small ones in our lives?", "NTA \n\nHis parents and brother are sexist AH. You were a great influence IMO!", "NTA. Your BF family sounds like they think they live in leave it to beaver. Eff that noise.", "NTA I wouldn't let my kids to boxing male or female but their reasons were sexist.", "NTA I can see why your BF and his parents don’t get along…sheesh what a bunch of narrow minded idiots.  You’re a great role-model and you did nothing wrong! Too bad they can’t see it through their sick twisted holly homemaker fantasy of a life they think their kids and grandkids should emulate.", "Perhaps your BF needs to pull back from his family again (except the one sister) because they are very clearly sexist", "NTA\n\nI'd get an entire jacket with that on the back. \n\nParents were idiots for not thinking the kids would be hyperfocused on OP's career. It's like telling kids someone is an astronaut or dinosaur wrangler, and then getting upset when they have a million questions. \n\nIt's up to OP and boyfriend how to manage. Personally, separate event with cool sister sounds least stressful", ">“Barbarian Barbie” sounds like a pretty great name to me.\n\nOP should totally own it! It's fantastic!", "Agree. This nickname is badass.\n\nI also love the \"winner face\" comment. Mom's probably mad you punched her in the face with that snappy comeback. \n\nPlease keep being a *good* influence on those kids. It sounds like they need it.", "Yeah, it’s clear to see why bf has such a strained relationship with his parents. They think women should sit still and be pretty until it’s time to have babies and clean up after their men. \n\nOP, don’t ever hide parts of yourself, you sound awesome. However, THIS is what it’s like to have a big family: a lot of dumb opinions and judgments, usually from the olds. You gotta take them with a grain of salt and do you, because that’s what makes those other family members love you so much. NTA.", "I don't know that BIL meant it as an insult, it read to me as good natured sibling banter? But either way, what a badass new nickname for OP, who's already a total badass.", "Oh God, the football thing.  My dad never let me play because it wasn't feminine enough and then got upset that I didn't want to watch games with him.\n\nWhile I personally am not a fan of boxing (MMA is more my thing) I am still thrilled to find that OP can make her living off of it.\n\nAlso, OP, I would have LOVED to see someone like you at my family gatherings, most in my family love it when women defy the norms (my dad being the big exception)", "...Was she raising venomous snakes? What species? WHY??\n\nDid she have a king cobra", "Including 'Death by snu-snu'", "Yep, lots of fun to hit people, not much fun to get hit back.\n\nMy kid's martial arts class is like that.  The white belts \"spar\" from way out of reach of each other, and they gradually move closer as they advance.  Which is good, because yellow belt is when they start training with bo staves and nunchucks, and it's bad enough when you hit yourself with one of those.", "Lots of people have venomous snakes... One of my favorite college professors has a collection of cobras and vipers. The bulk of them are rescue animals that were taken in by animal control, as he is one of the only people in our area who is qualified to take care of them.", "Anti venom is a reason to raise snakes, selling because there’s people who want to buy venomous snakes for some reason, or breeding to help wild populations. Rattlesnakes are endangered in a ton of eastern states", "NTA and you sound amazing! Edited to add you need to have “Barbarian Barbie” embroidered on your warm up clothes!!", "NTA, you be you.  Sounds like BF is awesome.  Give the haters some grace, it might take some time for them to come around, and if the don’t, they’re on the other side of the country.", "NTA. \n\nYou were having polite conversation with the majority of the family. Just because his parents and a couple of siblings are sexist doesn’t mean you did something wrong.", "Nta. His family sounds exhausting. I would get a t-shirt with Barbarian Barbie on it and wear it to all family events till forever.", "I would've just left that dinner how it was I know what to expect moving forward with his family so i can figure out how to deal with them. I didnt really see the need to call and argue about what they said unless they were intentionally being rude at dinner.", "NTA. Keep on living!", "NTA and here’s why he’s been low contact with his family. They’re entitled and have massive sticks up their \n\nDinner rolls", "NTA.  Go hang out with cool sister and her daughter.", "Boxing is an olympic sport so definitely part of real life. Just bc his parents/uncle's mindsets are stuck in the 20th century is no reason for you to downplay what you do. Besides, if it wasn't for your match, you wouldn't have been near enough to visit them so  you couldn't 'keep the boxing stuff to yourself'.\n\nNTA", "NTA. You are true to yourself and proud of your accomplishments and so you should be.BTW, I would rather be Barbarian Barbie.   ;0)", "NTA, you sound like an awesome aunt. I love that those little girls have a role model who will demonstrate that there are so many valid options for how to live their lives! What a great antidote to g-ma and g-pa’s old fashioned, sexist ideas about a woman’s proper place.", "You are NTA and you are awesome! Please keep showing up at holidays for those nieces and nephews.", "NTA not even a little.  OP, stop doubting yourself!!!!  YOU were delightful.  They were/are pushing some weird-ass old-fashioned gender stereotypes on you that have no place today.  You are an inspiration to loads of girls, even if it’s just to take up self defense.  Ignore them - they don’t deserve you.", "NTA. You sound amazing and an inspiration to those kids! They knew what they were in for and had ample warning. You’ve just upset their narrow ideas of a woman’s “place”. Good on you for being yourself and standing up for yourself in that scenario and kudos to your bf for being so supportive. Seriously, I want to be friends because you’re a great role model, imo, to even adults who have a hard time accepting themselves.", "i wish someday i was cool enough to be called \"barbarian barbie\"", "For the love of god, please start using Barbarian Barbie as your boxer name. Get it embroidered on everything. It’s fantastic lol \n\nNTA. His family is sexist and shitty.", "NTA Your bf isn’t close to them and they find you odd. That’s perfect. Looks like a strong future for you two. Just keep being you, that’s who your bf loves and it doesn’t seem like their approval or lack thereof is weighting on his feelings. Not to mention, girls SHOULD know that girls can do and be whatever they WANT! Good for you, God may have even orchestrated it to intentionally expose those girls to a woman like you.", "NTA.\n\nHon, you've got yourself a winner of a boyfriend. He was no/very low contact for a good reason before you came into his life. His parents are sexist and have strict gender roles for everyone in the family.\n\nCongratulations on your win, btw!", "NTA.  You did NOTHING wrong.  Lather, rinse, repeat.  It is abundantly clear why your BF is distanced from his family.  They are total AHs.  He is right to mad at them and the best both of you can do is go NC.", "Barbarian barbie is such a badass name since people call beautiful women Barbies I’d take that as a compliment tbh and when barbarian is in front of it id think of some hot woman that’s badass as hell so I don’t know if the brother was insulting u or no but NTA obviously", "NTA - At least on the siblings sounds cool. Auntie going to teach niece to be badass. (if you all get married of course)", "NTA what would they rather have wanted as an explanation of your face? Honestly, what would have been a better or more age appropriate explanation of visible bruises/cuts/swelling on your face? They sound very misogynistic, I can see why your boyfriend doesn't talk to them much.", "This. Also kind of hard to keep the boxing stuff to yourself with your face banged up. Imagine if you didn't tell them & they thought your BF was beating you up? Or you were attacked on the street? How much more awkward would that have been? BTW, being proud of your achievements is a good thing. NTA", "Yeah I think I've found the name of my next D&D character. Barbarian, Barbie for short lol.", "Barbarian barbie is a compliment.\n\nThe nieces will probably not really want to get their faces smashed up BUT\n\nThey came away with the information that strong women can do anything they want. There is no such things as: That's not for girls.\n\nAnd that is a really good lesson!", ">Barbarian Barbie\n\nI agree! That sounds kind of bad ass, I hope you had a good laugh, but also co-opt that 'insult' for your own use.", "Barbarian Barie vs gender roles in the ring, she would win in a heartbeat. yeah!\n\n\nNTA OP.", "owh. I went through the whole “i want to do gymnastics/acro” and mom “you’ll break your bones, it’s too hard. if you’re so flexible just do ballet”.\nI only started working out as an adult to find a pretty major aptitude for this stuff. *sigh*\n\nNTA OP. It’s lovely to see how easily kids see through sexist BS.", "Skate name OP ever tries roller derby", "We did boxing in my special ed wellness class, it was everyone's favorite because we got to hit our teachers (their padded hands, but still) and not get in trouble for it. And it was a great. safe way to get my aggressive energy out.", "NTA, \"Barbarian Barbie\" is a sick nickname tho.", "NTA, but PLEASE consider being announced as the Barbarian Barbie at least a couple times that’s one of the best titles I’ve heard in a long time", "I think that you handled the entire situation like a genuine lady: with grace, poise, humor and care. The way you handled the children's fears and concerns was beautiful! And perfect! \n\nYou have an \"unusual\" career for a woman. Not long ago, being a doctor, lawyer or engineer was \"unusual\" for a woman. You are a part of a select group of women who \"break the glass ceilings\". Be proud of that. You are making history. \n\nI think you should own \"Barbarian Barbie\" with all the pride, grace, poise and humor that you have *(which is a lot)*. \n\nYou may want to add a little snarkiness too.... \n\nBack in the 90s, there was a show \"Xena Warrior Princess\"... A \"Barbarian Barbie\" basically that was pretty badass. With Christmas coming up, I think that the children would enjoy getting an action figure of her from their real-life badass aunt. I checked, they are still available at good prices. \n\nhttps://www.google.com/search?q=xena+warrior+princess+dolls&oq=xena+warrior+princess+dolls&aqs=chrome..69i57j0i22i30j0i390l4.24036j0j4&client=ms-android-tmus-us-revc&sourceid=chrome-mobile&ie=UTF-8\n\nBlessed be", "NTA   you could be known as the Barbarian Barbie if you get into training", "NTA I love the idea of barbarian barbie,  You presented an image of a strong capable independent woman who is in control if her life.  Your boyfriends Dad's comments  makes it sound like ge only sees women as baby machines and the brothers were likely intimidated.  Personally I would say you likely had a great influence on the kids and showed them they can have a life outside typical gender roles.", "NTA\n\nI always find that people that blame others for being a bad influence don't really have the conviction for their own lifestyle for why it's better.\n\nThe world is a big bad place full of a whole spectrum of people.\n\nBottom line is, if you can't back up your values and explain them to your kids, you have no right to rail against somebody else's.", "NTA and I adore how one sister said her kids already called you auntie ♡♡♡ so cute", "NTA- they just sound like uptight jerks which is probably why your bf doesn’t have a good relationship with them before.   \n\nMy husband has a big family. If you came to a family gathering there, they’d be all excited and asking you questions in awe of your dedication and tenacity.", "NTA, that is your career, and you shouldn't have to hide it or feel weird about it. He was quick to call and yell at them because they are 100% wrong, you did not do anything to deserve that.", "Your boyfriend's parents seem to think women need chaining to the kitchen sink. What a relief it must have been to the kids (girls) of the family to realise they can actually be something else. You sound like someone who would be fascinating as a dinner guest but the old stuffies couldn't see it. Their loss. NTA.", "NTA", "Nta-wow they really are outdated.", "#NTA\n• You were yourself, OP. That’s not wrong. Great to see the boyfriend standing up to his silly-ass parents, though. Love each other, keep living.", "NTA, but my advice here is to roll with the Barbarian Barbie nickname. That's pretty sweet", "NTA. I bet the dad and brother are just threatened because you can totally kick their ass 😂\n\nAlso Barbarian Barbie sounds super cool and fierce. I asked my 6 year old and she said \"I want tk be Barbarian Barbie!\"", "NTA you don’t need to be in here lol your boyfriend obviously is ok with it. So if y’all good all is good.", "NTA.  The parents were given full disclosure and they did NOT set any ground rules.  There is no mention of the parents having an intellectual disability so why they act like they had no idea that dinner conversation topics (with children present) might veer to your career is insane.  Pretty much anyone could have predicted that.  \n\nSorry they behaved this way to you, and congratulations on your success.", "NTA let the conservative trash inlaws to be deal with it.", "NTA.  You'd didn't have any idea of the responses you would get from his family, and showing up with cuts and bruises without talking about what you do would have created another set of problems.\n\nI think the issues are that his adult relatives are uncomfortable with a woman in what in the past would be considered a man's world, and that the young relatives thought it was cool.  IMHO, the adults can go pound sand, and the kids will get over it (though ya gotta admit, is it kinda cool).", "NTA. Show up to Christmas with a Barbarian Barbie sweater on though!!!!", "NTA.  It is your profession and it is reasonable to talk about at a family dinner where you are meeting his parents.  If you were a doctor or something it would not have been bad to talk about and this is the same.  His family has a misogynistic view of life and it is good that those young girls know that they can do the same things as men.", "This is a funny story.  And no you are not the ass hole.", "NTA. Barbarian Barbie sounds bad*ss.\n\nI vote all the kids get boxing gloves for Christmas.", "Wait what? **\" caused a major problem between my boyfriend and his parents \"**\n\nPSSSST remember they were always there. You're just another layer to bitch about. NTA", "NTA but 'Barbarian Barbie' is an excellent nickname LOL.  How would you explain the bruises and cuts without talking about your job?  His parents and siblings just are ready to accept that women can do any job a man can do and you are living proof.", "INFO: What was happening in the video you showed them? Was there blood/gore?", "NTA The kids sound really sweet, but the adults sound like they want incubators rather than daughters-in-law.", "I want to buy my daughter Barbarian Barbie! I live when she sees women in non-stereotypical roles!!\n\nI did buy her Firefighter Barbie since I’m a FF!\n\nSo NTA!!!", "Barbarian Barbie sounds like a name for a pro-wrestler.", "I know.  I would love OP to hang out with my kids!", "Yeah if \"Barbarian Barbie\" was supposed to be an insult, didn't work.", "I'm 90% sure that's why the parents are mad. How *dare* OP teach kids that they don't have to follow traditional gender roles? /s", "I would love it if OP went as ‘Barbarian Barbie’ for Halloween (or the next costume party she attends).", "\"Just do ballet\" as if ballet doesn't put a massive amount of strain on the body as well.\n\nSexism is so dumb.", "oh, but it’s pretty and would make sure I don’t get bulky!\n\ntrue story.", "Sure, a lot of people do, but I want to know why she did specifically. Fun? Rehab? Education? Supplying zoos?", "Hell, copperhead venom is being studied for potential cancer treatment.", "Everyone who keeps venomous reptiles has a reason why, and I want to know, not guess. Antivenin? Conservation? The thrill of petting an eyelash viper?", "Well you see the British would pay out for vobras that were killed so people just started raising them to get the payout /s", "They're pretty, they like them, the snakes need advocates and help rebuilding", "\"Barbarian Barbie\" my god that's an awesome name. Should market yourself with that name like Rocky was the Italian Stallion.\n\nNTA. You shouldn't have to hide your true self. They just showed their true colors.", "NTA  you literally just told them about your life", "NTA what exactly were you supposed to say about your face? I don't see anything  with what you did", "NTA. Please stay in touch with them, you're actually a great influence on those kids. Do it for their sakes. Please.", "Ummm… I’m 37 f but would honestly love a Barbarian Barbie in my family.   Any chance your looking to be adopted or interested in a adopting an older couple?", "NTA and PLEASE get memorabilia that says Barbarian Barbie, because it's legitimately one of the best athletic nicknames I've ever heard!", "NTA. His family is stupid, but it sounds like BF has your back. He's a keeper.", "NTA but OP, please take care of your brain! Any time I read about someone in a contact sport like boxing I’m reminded of [this post](https://www.reddit.com/r/BestofRedditorUpdates/comments/v44v74/ops_husband_starts_acting_extremely_differently/?utm_source=share&utm_medium=ios_app&utm_name=iossmf). Be warned, it’s a bit depressing.", "YTBA. You're the badass, and that's awesome. Good for you for expanding their world view.", "Please show up to Christmas dinner with a barbarian Barbie themed Christmas sweater. NTA. You sound badass.", "NTA- my 14 year old daughter would love to have an auntie Barbarian Barbie. I suggest you sign any and all cards send to your BFs family this way.", "NTA those kids need exposure to wider life experiences. That many pigeonholing adults are just going to stunt their growth and intentionally limit their choices. Buy the girls gloves for Christmas and find a good local gym to recommend to them. MIL and FIL can suck it.", "NTA. Boxing requires strength, discipline, intelligence, stamina, courage and skill. \n\nBad influence?  Nonsense.", "NTA\nSeriously, you would be the coolest and most badass aunt in the world!!! No wonder the kids loved you. Don’t let the parents get to you and if possible go see the cool sister again, you can be a great example for her kid.", "Well!\n\n.... I've found my next D&D character.\nGoliath Barbie. Voiced like The Barbie ofc. Yessss", "It was the first part of the first round, so no one had had time to get bloody yet.  I definitely wouldn’t show them the last round of a pro fight, that can get a little difficult to watch even for some adults.", "That’s one reason why I’m going to end my active career a few years early.  I could probably physically fight into my late 30s but I’ve already had more pro fights than most people my age and that gets risky.  I don’t want to be one of those people that fights until their body is totally trashed and I don’t want Boyfriend to have to deal with all the CTE stuff, so I’m going to make a little bit more money to round out my savings and then bow out while I’m still healthy.  Thanks for the concern, though, it’s a problem a lot of people don’t think about until it’s too late.", "Haha! I just replied something v similar before scrolling to your comment \n\nXxx love it. Will you also try voice them like the doll?", "I think the problem was showing them a video of the fight, not talking about it.", "Ehh calling a woman barbie is not necessarily a compliment. Atleast I have never heard it as such. If she owns the name then that is her choice. But the connotation is still she is a toy for accessorising and made of plastic. Atleast that is what is implied in my country.", "Okay, so what was happening during the first round? Did they see your face get slammed? Do they think hitting people is cool now? Did you stress how safe it was because it's professional?\n\nI understand parents not wanting their children to watch boxing matches. I wouldn't be surprised if all those kids ended up with bruises later that night lol", "I want to buy that barbie 😁", "Absolutely not lol I can't do a voice that high", "They did see me get in a few shots on the other fighter and take one, but nothing shock and awe, that first round was pretty tame and more of a wear down game.  I did show them that I do wear some protection because people can get hurt and I told them it’s only ok to hit people like that in a real boxing ring with real gloves and when the ref says so - even I would get in trouble if I just went around hitting people.", "My Dad had a hard time when my sister wore pink eyeshadow. ( because it looked a bit like a bruise).  It was worse after I played paintball.\n\nYou are NTA.\n\nFamily find it gut wrenching to think that someone they care for, or want to protect, gets hurt by another, for any reason.   I would feel like this for my 20 y.o. son, too.\n\nThat \"son's girlfriend is hurt\" thought sat side by side with the thought that you are accomplished at your profession, and it was hard to fully ignore.   It goes against so many instincts to ignore it,  and this was their first time experiencing it.\n\nThey made mistakes, and hopefully are trying to do better.", "NTA that name is pretty funny though", "Nta", "NTA if you were a guy and it was his nephews there wouldn’t have been a problem. These people are all misogynists except his cool sister.", "NTA. Sounds like his family sucks.", "NTA. You are not a bad influence, you are a genuine person with an unusual profession - not many people can hack it as a boxer, male or female.  Your BF warned them and they didn't take him seriously.\n\nBe yourself and tell the truth and stay close to your BF during the trip.", "NTA. You were a hero to the kids and  love that you showed them that women can be whatever they want to be. My kiddos have been in MMA since the age of 4. Totally not something I ever thought my family would be part of but my oldest wanted to be a ninja when he was little, so here we are.  You boyfriend's parents sound like conservative misogynistic jerks. The brother is a toss up - possible he thought \"Barbarian Barbie\" was a compliment?", "NTA.  If I were you I would sign all of the greeting cards I sent to  his family over the year \"Barbarian Barbie!\"", "NTA, you rock.  They'll come around or they won't.  In neither event is that on you.", "[deleted]", "My dad didn’t let me do horse riding as a kid cuz I’m a girl. Now he’s all like why don’t you enjoy watching your brother do horse riding?! \n \nOP is a queen. I wish she could beat sexism to death.", "Yeah OP, if you don't really have a good ringname that would definitely look good at the bottom seam of a pair of trunks.", "Eh, I disagree. There’s plenty of violent things in todays media. Heck, when I was 7-12 years old the school yard brawls were no laughing matter! Showing the kids a few clips of her boxing event just drives home the athleticism of it instead of focusing on the busted up face aftermath. It’s a matter of sport vs violence.\n\nTo each their own, really. But the parents and grandparents were well aware of what they signed up for, so them being judgmental and salty toward OP is an asshole move.", "Oh shit I have two nieces and a nephew and would 100% be buying 3 of them this Christmas", "Good, I'm glad you explained that well.\n\nI feel silly, I just realized I don't know how old the kids are. How old?", "If you want to know and get a real answer, I can’t say what reason the person above has, but snake discovery on YouTube has some videos on it or has friends who do. Sorry you’re getting shamed for your curiosity.", "There are a bunch of them, so I don’t know all the ages, but the ones that were talking to me looked to be scattered around the 7-12 range maybe.", "Oof. 7? That's a second or third grader. \n\nY T A for showing a violent sport to a second grader. \n\nN T A for having bruises and explaining the concept of boxing. \n\nThey are TA for their reactions being shitty.\n\nOverall, ESH", "Pretty sure kids of that age have seen much worse than the start of a boxing match carefully explained as the OP did. \n\nViolence is all over these days - without context. Cartoons. Two spring to minds Simpsons - Itchy and Scratchy, Tom and Jerry\nGuessing the nieces/nephews will have watched various Marvel and DC films as well… and not the cartoon sort where a Wham, Bash or Pow covers the lunch. \n\nTo OP. Definitely NTA here.", "You tried to schedule it so this wouldn't happen, but they wouldn't let you. Then it became a conversation piece, obviously. Not your fault. Maybe next time they will listen to your advice, if you see them again.\n\nThe parents made some provocative comments and you responded in a good humoured fashion. Of course the kids were interested, what were you supposed to do, tell them you couldn't talk about it?\nWhy?\n\nYou can see why he has a frosty relationship with his dad. The kids liked you, anyway. \n\nNTA", "NTA\nAnd no, you shouldn't have hidden it. This is your life, who has a right to shame you for it?!?!?\n\nYour sweetie *already* didn't like his parents and now you know why.\n\nHis sister is a keeper, tho. Send her and her daughters a picture of you guys, bruises and all, with big hugs and grins...  and tell them how much you loved getting to know them, and feeling welcome. The rest of them can choke on their judgmental outrage.", "NTA. Absolutely do not keep to yourself what you do with your life!", "Lol NTA, if anything you're a positive influence for the nieces/nephews. Shows that there are all kinds of jobs out there and women can hold their own in a male-dominated field.", "NTA\n\nYou taught the nieces that there are other options besides being a homemaker and a baby maker.  Their minds were expanded just by talking to you for a short while. Good for you!", "NTA.\n\nWomen can box.\n\nDon't doubt yourself.  You are  NOT a bad influence. \n\nThe only bad influence is the parents due to their sexism.", "'Barbarian Barbie' is a good ring name.\n\nNTA. you tried to prevent it, kids are curious beings(it's their job), and you took everything with good humor. Screw them for being judgmental.", "NTA! You are an incredible woman, in a career that you love, and living life on your terms. That's not being a bad influence.", "I was gonna say, INCREDIBLE stage name potential there", "Lol is niblings like collective nieces and nephews?", "I see it used like that a lot for sure, but in this context it kinda sounds like she's just badass and pretty. I don't think bil was saying she was vapid or anything.", "If you clutch those pearls any harder you’re gonna break ‘em."]}