{"id": 18650, "submission_id": "13wuwtv", "title": "AITA for refusing to pay for my brother's fiance's wedding dress that I stained?", "selftext": "My brother's fiance, Emma (25) and my brother, Jonathan (27) were getting married. My brother's fiance has 2 kids (6 and 7) and they're both boys. Emma bought a wedding dress that was very expensive and wanted to brag it to the whole family. So she decides to display it in the middle of the kitchen where kids are horseplaying. Honestly, just by the sound of that, it already is a disaster. Well, everyone was socializing and drinking. I was holding a glass of wine while talking to a childhood friend when suddenly one of her kid runs into me causing the wine to fling and it got all over the wedding dress. Her kid got up and started to cry. Emma was furious and she cried. Everyone looked at me like I was at fault. My brother told me to leave.\n\nThat night I was contemplating what had happened when I get a call from my brother. He sounded upset and was talking aggressively demanding for me to pay for the damages I had caused. I told him why he's not blaming the kid. His excuse was \"He's just a kid. Don't bring him into this. You did the damage and should take responsibility for it.\" I was shook and told him that he ran into me and asked him why I was getting all the blame. He then ended the call with \"I don't care, just pay for the damage.\" \n\nLong story short, I called him back and explained to him that I will not be paying for the dress. He was angry and started shouting on the phone saying I'm the biggest asshole he had ever met for not taking responsibility for my actions. I then asked him what actions I caused, but he kept repeating himself saying just to pay for the dress and we can forget about everything. I told him I will not be paying thousands of dollars because a kid was running around and ran into me causing the wine to fling and stain the dress.\n\nLater that night his wife called me and was angry calling me names like \"coward, bastard, bitch, asshole, etc.\" I was upset but didn't let my emotions take over me. I stopped her midway talking and asked where the idea of displaying a expensive white dress in the middle of the kitchen came from. She didn't answer the question and started to call me names again. I hung up and blocked her.\n\nAfter that everyone in my family started contacting me. Mom, sister, brother, etc. They were sending my text messages calling my a bad person. To end the conflict, I paid them $2500. I regret doing it but it's whatever now. The only thing that got me upset was that I don't understand why her child didn't get any part of the blame.\n\nAITA?\n\nTLDR; I refused to pay for my brothers fiance's wedding dress after her son ran into me causing the dress to be stained.", "created_utc": 1685559890, "permalink": "/r/AmItheAsshole/comments/13wuwtv/aita_for_refusing_to_pay_for_my_brothers_fiances/", "score": 2273, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I accidentally spilled wine on my brother's fiance wedding dress. The action that might've made me an asshole is spilling wine in her dress and refusing to pay for it. They called my an asshole because I refused to pay for the dress that I didn't even damage.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. Who displays their wedding dress like that? Mine was locked in a closet in the garment bag until the very last minute. It's a dress that costs thousands of dollars and you're just going to hang it out in a room that is known to have food and drinks passing around? This is 100% on you future SIL. And that's even discounting the fact that it was their kid that ran into you, causing you to spill the drink\n\nYou were an absolute doormat to pay the money", "NTA\n\nI would have died on that hill. Lady puts on wedding dress in her kitchen, with her kids running around, wine flowing, and this is your fault? No, absolutely not.\n\nI'm the last person in the world to tell others to cut contact, on the contrary, I'm a Kumbaya person. But NO ONE gets to blame me for what was not my fault. Here the line must be drawn.\n\nIf your family loves you, they'd forget all about it and consider it a minor accident. Shit happens kind of thing. Not life or death situation. \n\n$2500 to clean a dress? So don't wear it in a kitchen! People's stupidity should never demand access to your wallet.", "NTA and you shouldn’t have paid dude. Play stupid games, win stupid prizes.", "Hey everyone sorry for the typo, it's $1500 not $2500.I made a mistake, but if you wonder if I cut contact with everyone with my family including her side of the family, yes...yes I did. I paid them $1500 and they still weren't content because after they cleaned the dress, the dress was apparently not \"perfect\" like it was before. That was Emma's words. To this day, my brother still probably hates me and also his wife and probably the rest of the family. But it's fine, I'm living life and I love it. I can't wait to read y'all's opinions when I get home.\n\nEDIT: I just didn't hand them the money because I felt like it y'all. I was guilt tripped and was forced into paying them. Everyone wouldn't leave me alone unless I paid. They still wouldn't. I try to ignore them as much as I can, but it's like the whole world thinks I'm the villain of the story. Well, my brother tried to contact me and reconcile, but I refused. I told him that he didn't even think about the hurtful stuff he said to me before letting them out. He's my brother and I love him and will always will. I forgive him, but that doesn't mean I'll ever talk to him or his wife. All the things they said will always leave a mark behind. I don't hold grudges and will never hold grudges, but that doesn't mean I'll forget the things they said. Even my own mother was on their side. Anyways, all of those are in the past now. I'm gonna keep living life happily. Additionally if something happens, I'll try to update y'all. Thanks for the feedbacks.", "NTA. Your only wrong action was to pay them $2500. \n\nYou basically admitted guilt when you know you didn't do anything, let them get away with insulting you and scamming you, to keep... what peace? With whom? Do you even care to still have a relationship with those two? \n\nIt's done now, but you should've stood your ground.", "Obvious setup. She'd changed her mind on the dress and needed someone to pay for a replacement. Think about it.\n\nNTA", "What? You just handed over $2500? On the back of that scenario? Seriously? Something smells fishy here.\n\nIf you're not a bot or a troll, then you don't need anyone to tell you you're NTA, obviously - no reasonable person would say you are 100% culpable or even mostly culpable here. You already know this. But if you did hand over that money, you're a chump. And if you did, wtf are you here? What do you have to lose or gain now?", "NTA.   But it wasn’t her child’s fault either.   It was your brother’s fiancé’s fault for putting an expensive white dress on display in a kitchen around kids, food and beverages.", "NTA. The dress would be fine had her kid not knocked the wine out of your hands. She needs to get it cleaned and keep it in her closet like a normal person.", "NTA\n\nAt most, I would have paid ONE THIRD of what they were asking. ONE third from idiot who decided to bring something delicate INTO THE FUCKING KITCHEN where people cook, wash dishes, clean, eat, etc.\n\nOne third from parent who could not train their fucking kid not to run in the kitchen where people wield sharp objects, and fragile items. \n\nThat leaves a third and if you felt like paying it, fine. I wouldn't have, but I know I'm kind of a witch, so there it is.", "My kids are the same age and no way in hell would I let them in a room with a wedding dress. \n\nNTA and I wish you hadn’t paid.", "That kid's parents should be the ones paying up. NTA", "NTA. You really shouldn't have paid that money. That's a ridiculous amount to pay for something you aren't responsible for and I don't think it was worth the relationships you saved (for now). You don't bring something that delicate and expensive around children, full stop. It was her stupid decision and I highly encourage you to not take the blame anymore. The next time they try to foist consequences for their own dumb antics onto you, refuse to engage and stick to it.", "Display the dress in the kitchen? You’re not even supposed to see it until the wedding day or else it’s bad luck…? \n\n\nWelp, Talk about bad luck! \n\nNTA", "NTA and I'm bummed you even paid the $2500. Do you have a nice car? Perhaps you could park it under their children's swing set to show it off to the family at the next gathering.", "NTA\n\n\nHad she shown everyone the dress then put it SAFELY away, this wouldn't have happened. Her carelessness is the reason it's stained. \n\n\n\n\"I'm going to leave this in the kitchen where everyone is eating and drinking and there are kids running around playing, but it's not my fault you ruined it!\"\n\n\n\n\n\nLOLOLOLOL!!!!!!", "Info:  why does your WHOLE family blame you for this?  Are you entirely sure you didn’t take the kid bumping into you as an opportunity to actually FLING the wine onto her dress?  Because that’s what it sounds like.  Did you like her and have a good relationship before this?", "NTA But $2500 to keep the peace as absolute foolishness maybe it’s time to put some distance between you and your family or at least your soon to be sister-in-law, she sounds like a basket case.", "NTA.\n\nI was prepared to go in a totally different direction than this, but she willingly brought it into a ktichen and had it displayed around food and drink. An accident was very much a possibility and she was accepting that risk by doing so.", "NTA. So these morons just had a $2500 dress (I sure hope you saw a receipt before you gave them that much for it) sitting out in a room where people are drinking wine and children are running around rough-housing, and when their child that they for some reason are allowing to roughhouse during this event slammed into you and spilled your wine it's your fault?\n\nNot sure what difference it makes now since you paid them anyway, but it was her own dumb fault for letting that happen and she just doesn't want to take the blame or, more to the point, have to pay to replace the dress she ruined by letting her son roughhouse while it was on display. What if he'd knocked a bottle of wine off a table onto it, instead of knocking it out of a person's hands? Would she be blaming the table? Her kid ruined her dress, not you.", "NTA. Her decision to display the dress in that environment, and her child running around caused the accident. You do hold a slight responsibility because you saw the disaster in the making yet still stood beside it holding a glass of wine.", "NTA, because I like the new wrinkle you developed in the ole red-wine-thrown-on-the-wedding-dress story!", "I need more or a video. Obviously, taking OP's side they're NTA. But you have multiple family members who were around wanting them to pay. Something else happened or there was a warning about wine or something. This is too simple for this to be such a big deal.", "NTA First, it was sister-in-law’s idea to display her wedding dress in the kitchen. Next, it was her kid that bumped into you. If you had accidentally tripped and spilt your wine on the dress, I could understand but you didn’t. Their kid caused the damage, they should pay for it. Also, I would go NC or at least LC with your family because they sound ridiculous.", "YTA for paying the money anyway. Have a spine and stand up for yourself. At the very least wait to see what us internet strangers say before making the move. Obviously it was 100% the kid’s fault and also the adult who should’ve been watching him’s. You shouldn’t have had to pay a penny.", "NTA. Your (soon to be) SIL made a stupid decision to show off a wedding dress in an area that has tons of food and drinks all over it. The child ran into you, it's not like you told the child to run into you. All of this could have been avoided if your SIL showed the dress in a better environment like a bedroom with no kids. That's like showing off and demonstrating a toaster in the middle of a pool, she was begging for something bad to happen.", "NTA and honestly I get the vibes that this was a setup. You sure the dress cost that much? Was SIL just trying to get more $$$?", "YTA for giving them any money at all", "NTA (mostly)\n\nYour brother married a major AH and he is an AH for backing her no matter how ridiculous she is. Your family are also AHs for supporting it.\n\nIn your place, to get peace with all the complainers, I may have asked the rest of the family to join in to pay for the dress since it could have happened to anyone in the kitchen.\n\nWhat you could have done better: don't blame kids for being kids. They aren't the dumb asses displaying a wedding dress in the middle of a kitchen full of people socializing and drinking. THAT was a DA move.", "NTA\n\nIf you wanted to show it off, you take it out for a little while, show it off nad put it back in it's protective zip up? Who leaves an expensive wedding gown just out? and in the kitchen with food and drinks no less?", "NTA. They were unhappy with the dress being stained, and did not want to pay for it. They threw a tantrum and got everyone involved until they got the money out of you. They will probably continue behaving like this as it is being rewarded. Keep your distance.", "NTA\n\nYou realise you just paid for somebody else’s mistake don’t you?\nYou’ll end up paying for that for years now, every time a finger gets pointed it will be at you and suddenly your wallet will be lighter.", "Info: you say the kid running into you caused the wine to fling. Fling is rarely a word used for someone bumping into you causing you to spill something. Did you embellish when the kid bumped into you? Your use of the passive voice in that sentence makes me think you did.", "YTA for paying for the dress", "ESH \n\n\nYea, she shouldn't have been displaying it near food. Yea, the kids were running around.\n\n\nBut you were standing two feet from a wedding dress with a glass of red wine?", "Please tell me you are skipping the wedding.  \n\nTo be fair, I don't blame the child - I blame the bride for allowing the situation.\n\nNTA", "NTA the kid didn't get blamed because they didn't have $2500. You got taken advantage of to fix their mistake.", "YTA to yourself for paying 2500$.", "Your whole family sucks. NTA. I'm so sorry you gave them $2500.", "You sound so petty and jealous that I'm fairly sure you did it on purpose ngl", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy brother's fiance, Emma (25) and my brother, Jonathan (27) were getting married. My brother's fiance has 2 kids (6 and 7) and they're both boys. Emma bought a wedding dress that was very expensive and wanted to brag it to the whole family. So she decides to display it in the middle of the kitchen where kids are horseplaying. Honestly, just by the sound of that, it already is a disaster. Well, everyone was socializing and drinking. I was holding a glass of wine while talking to a childhood friend when suddenly one of her kid runs into me causing the wine to fling and it got all over the wedding dress. Her kid got up and started to cry. Emma was furious and she cried. Everyone looked at me like I was at fault. My brother told me to leave.\n\nThat night I was contemplating what had happened when I get a call from my brother. He sounded upset and was talking aggressively demanding for me to pay for the damages I had caused. I told him why he's not blaming the kid. His excuse was \"He's just a kid. Don't bring him into this. You did the damage and should take responsibility for it.\" I was shook and told him that he ran into me and asked him why I was getting all the blame. He then ended the call with \"I don't care, just pay for the damage.\" \n\nLong story short, I called him back and explained to him that I will not be paying for the dress. He was angry and started shouting on the phone saying I'm the biggest asshole he had ever met for not taking responsibility for my actions. I then asked him what actions I caused, but he kept repeating himself saying just to pay for the dress and we can forget about everything. I told him I will not be paying thousands of dollars because a kid was running around and ran into me causing the wine to fling and stain the dress.\n\nLater that night his wife called me and was angry calling me names like \"coward, bastard, bitch, asshole, etc.\" I was upset but didn't let my emotions take over me. I stopped her midway talking and asked where the idea of displaying a expensive white dress in the middle of the kitchen came from. She didn't answer the question and started to call me names again. I hung up and blocked her.\n\nAfter that everyone in my family started contacting me. Mom, sister, brother, etc. They were sending my text messages calling my a bad person. To end the conflict, I paid them $2500. I regret doing it but it's whatever now. The only thing that got me upset was that I don't understand why her child didn't get any part of the blame.\n\nAITA?\n\nTLDR; I refused to pay for my brothers fiance's wedding dress after her son ran into me causing the dress to be stained.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA but you were wrong to give them any money. Block everyone who harassed you on everything and don’t go to the wedding.", "NTA and if it were me I’d see about any legal course of action to get my $2500 back but I guess that depends if you want to blow up the family even more. Personally, this is a hill I would die on. They sound like nasty people any ways.", "NTA. Also didnt cost $2500 to clean or fix. SIL owns a wedding shop and I've seen her do magic. You got ripped off.", "Nta\n\n\nThe bride is not the sharpest tool in the shed. Is she?\n\n\nTell your family they can cover the cost for her stupidity and her bratty children's behavior. \n\n\nStand your ground.  Is on her to pay for her mistake.\n\n\nAlso, the rest of the family can cover that cost since they feel so strong on it.\n\n\nShe made a big mistake, take ownership of it. And take responsibility.", "Nta. You should of had to pay", "NTA - \n\n>\"He's just a kid. Don't bring him into this. You did the damage and should take responsibility for it.\"\n\nThat is the most AH comment I have seen.  You are so in the right here.", "NTA, you shouldnt have paid for it", "\nNTA for not (wanting to be) paying for that dress.\n\nYou better not be giving them or that kid any gifts for the next ten years.. \n\nWho wears a wedding dress, in a kitchen, with uncontrolled children running around?? And then bully the ONLY victim into paying? \n\nI almost wanted to go y-t-a because you actually paid...  They didn't want to pay themselves, so they kept blaming you until you did. NEVER fall for that again, because they for sure will try again, as it worked for them", "INFO: Whose wife called you in paragraph 4?", "NTA\n\n&#x200B;\n\n\"The only thing that got me upset was that I don't understand why her child didn't get any part of the blame.\"\n\n&#x200B;\n\nThis is easy: If the kid would have gotten some blame, they could not have extorted you for the money to pay for the damage the kid caused.\n\n&#x200B;\n\nYou should not have paid.\n\n&#x200B;\n\nGo no contact with all of htese AHs.", "Her child didn't get any part of the blame because her child couldn't pay them for the dress.....", "NTA but an idiot for giving any money. They now now they can bully you into getting their way and you’ll just do whatever they say to avoid conflict.", "NTA And you should never have paid. She played a stupid game.", "It was not your fault . You shouldn't have paid it", "NTA.", "Nta - are you sure you don’t want to go NC to with this “family” who are awful to you and blamed you for something that was not your fault? Your future SIL is an Ahole, your brother is, your whole family. You are the only innocent one here. Don’t go to the wedding, don’t invite them to your events. You don’t need negative people like that in your life.", "NTA. What kind of bride-to-be displays their expensive dress in the middle of a kitchen, where children are running, in the same room where people are drinking wine? This is totally on her for brining her dress into that environment. Dumb.", "Funny how nobody else has offered to pay for it but have a lot to say telling you to do so…", "NTA you handled beautifully", "NTA. Your SIL FAFO by choosing to display a very expensive in the kitchen no less, with kids around.", "Her child didn't get any blame because he doesn't have his own bank account contrary to you. That's it. You shouldn't have paid specially after they insulted you.", "Nta. This is highly suspicious. She wanted a new dress for some reason. Maybe she grew out of it.", "NTA- you could offer to clean it to smooth things over but no way responsible for replacement.  Also, who puts a wedding gown in a kitchen anywhere near children.  Lol", "NTA. They need to control their kids.", "NTA You weren't the asshole and I would have refused.", "NTA don't pay them a cent. who decides to have young children around and red wine near an expensive and sentimental white dress anyway? play stupid games, win stupid prizes.", "NTA. She and your brother deserve each other. Yeesh.", "$2500 to get it cleaned?!? How expensive was this dress? I can't believe you paid. NTA though. She did something dumb by bringing the dress to the kitchen, especially knowing people were drinking wine and her kids were being rambunctious. It's much more her fault than the kid's fault.", "You paid them, you suck. If the wedding isn't over, spill wine over the new dress. It's the least you can do for your own sanity. NTA", "NTA and I suspect the dress was already damaged, and they wanted someone else to pay for it.", "Damn, if I was forced to pay for that dress, then in my mind, it's mine, and I could do whatever I'd like with it...Like \"accidentally\" tripping at the wedding reception, and spilling wine on her dress again.\n\nEdit: Oh yeah, NTA. You shouldn't have paid.", "NTA - I really hope you haven't paid them yet. I wouldn't be paying for an accident someone else's stupidity caused. This squarely falls on your sister in law as a) she brought the dress out into a busy area with food and drinks and b) that was her kid that was running about and bumped into you. What if she was in your position and the kid bumped into her with the wine? I seriously doubt she'd be blaming herself.", "Dude- you can pay a dry cleaning bill but you would NOT be on the hook for anything beyond that. ESH.", "I wouldn’t go to the wedding or talk to them anymore.", "You should have stuck to your word and not paid, now from now on when something happens and you are indirectly at fault you will fold", "NTA - they just don't want to pay for it themselves or blame themselves for putting the dress stupidly at risk in the first place. Not your fault.", "NTA - it’s 10000000% the brides fault for bringing a wedding dress into the kitchen in the first place. Demanding that you pay the money to fix something that wasn’t your fault is an asshole move and they sound like dreadful people. They just showed their kid who caused the accident that you can throw a fit and bully people to get your way and have no accountability. I wouldn’t have paid a cent. That’s some serious toxic family shit right there.", "NTA.  How foolish to display an expensive wedding dress in the middle of a crowded kitchen!  There's TA.", "Wow NTA.  Do not go to that wedding!  What a bunch of AH's", "NTA!  Why'd you cave?  She was the one flaunting it in a KITCHEN, of all freaking places and it was HER kid that bumped into you causing the spill!  It was an accident caused by her child.  It was not on you to fix it.", "YTA.  For paying for the dress.", "YTA\n\nFor giving in to their demands", "NTA. One of her kids ran into you. Therefore, as their mother it’s her responsibility. Also, who even displays their uber expensive wedding dress in a kitchen?", "YTA for paying the money", "NTA, bro. I would have never paid that. At most I would have split it to be the biggest person. But absolutely not after those arguments.", "NTA but I would probably go NC with every single person that expected me to pay.", "This feels planned on their part. Definitely avoid them in the future, they seem to want to use people to fund their choices/lifestyle.\n\nKind of want an update to see if they get the same dress...", "NTA \n\nSounds like you were set up", "NTA \n\nYou should not have paid them. Made yourself a doormat. But that money's gone. Think about if you want to bother with a family like yours. You got conned out of $2500.\n\nEdit- saw your comment and good for you.", "You're NTA for drinking a glass of wine. That's literally all you did. She displayed the dress in the kitchen and wasn't watching her kids. \n\nYou're kinda the AH to yourself for paying, but I understand the whole \"keeping the peace\" thing.", "NTA. This is a great idea to get your dream dress for free. Buy used dress, tell everyone it is expensive!! Invite family over and give kids some sugar. Serve red wine. Display dress in kitchen. Wether it was you or someone else that dress was going to die.\n\n\nHowever, let this be a lesson about being anywhere near a wedding dress with a drink.", "Those people are major AH. I’m sorry OP. You’re NTA at all.", "I hope you got the stained dress to keep for yourself. Or the fabric that was removed and swapped out.\nYou paid for it, it’s yours!", "NTA. I wouldn’t have sent anything and would not have allowed them to speak to me that way. They did this to themselves and had the audacity to disrespect you. ALL of them. Including your family!! I’m sorry this happened to you. You can’t feel too good now.", "NTA and I still would have said that if you didn’t pay. I wouldn’t have paid in that situation.", "NTA. For all the reasons everyone has already stated. And also, isn’t it bad luck for the groom to see the dress before the wedding?", "OP sounds like the family scapegoat", "You shouldn’t have paid it.", "YTA.\n\nFor paying for the dress. Now they can walk all over you.", "Or you bring adults upstairs to see it, if you really have to show it off.", "Guarantee it already had some form of damage. They were hoping something would happen so they could get money out of someone\n\n\nThat or the kids always cause havoc and the blame is always placed on anyone else", "The problem is most “families” are very image oriented, so he may get shit from them FOREVER regarding this issue.", "$1500, $2500. Still absurd amounts to have to pay for something that was ultimately their own fault from poor judgement and poor parenting, to say nothing of the self-centeredness of even feeling the need to show off the dress before the wedding like that.\n\nPlus, I have to wonder if you got taken to the cleaners on the cost of cleaning that dress. Looking online, I'm seeing estimates of $200 - $500+ for cleaning a wedding dress. Sure the top end says \"+\" but $1500 is triple that top end estimate. I'd have wanted to see the final bill before I paid anything.\n\nChoosing to cut contact is not surprising. I wouldn't even blame you if you did that before the wedding.\n\nNTA.", "Send them a fresh turd in the mail every year. Those AH deserve it.", "Send them this post so they know the internet thinks they’re assholes.", "Please don’t go to the wedding!\n\nNTA\n\nif you do go wear white, apparently, according to Reddit, that is a mortal sin…", "NTA.  You were kind to pay that.  I keep a copy of that processed check anytime you think of talking to them look at it and realize how screwed up they are.", "I dare you to get out of babysitting for them by saying “I’m not safe to watch your kids, you’ve seen the carnage I’m capable of!”\n\nThey can both go fuck themselves for SURE", "Whilst I may have felt bad for carrying a wine glass near the dress, I would have offered a 1/3 of the wedding dress at the most. She had it somewhere stupid, I had a glass of wine, her kid ran into me.\n\nBUT the moment she's ringing to call me names etc, she's not getting a cent, I'm mad on your behalf for paying", "Your family sounds like a bunch of assholes. I’m sorry", "I was thinking something likewise. I have a feeling that dress wasn't event 'mint' to begin with. I would have died on this hill.", "THIS 👆", "My thoughts...  why on earth would someone fork over $2500 to end a dispute that they aren't responsible for?", "This is exactly right.  Kids run around, and expensive stuff on display is at risk if you let it happen.  \n\nYour SIL is definitely the AH for setting up a disaster then blaming you when it struck.", "The kid's parent was the owner of the wedding dress, which makes it 10× worse 🤦‍♀️", "It’s more likely there’s a heck of a lot more to the story that’s being left out.", "That’s what I’m wondering? Anyone with consideration would not go near the dress with food or drink in hand.", "What about OP's post implies they are remotely jealous?", "Found OP's brother", "I’m so confused as to why she was displaying it at all?? Like don’t most people keep the dress private until the day of? This is all so weird to me. OP defs NTA and shouldn’t have paid for the damages", "That’s the vibe I’m getting. Something else is already damaged.", "Yup, this was totally planned. Either that, or their complete morons. OP shouldn't have paid.", "Ooooooh my god, that's totally what happened.... it explains *everything*. \n\n(Edit to remove a few paragraphs after reading comment by OP--yes, they went NC with that side of the family! What miserable tits.)", "I've never been in such a situation or anywhere near. \n\nI only know that I DO NOT ACCEPT to be blamed for something I didn't do. How the family deals with it is outside my control.", "Then you don't have to contact them. If they give you shit for something you aren't responsible for, it's on them. If that was to keep contact, they still shut up. If they don't want to keep contact, let them go", "NTA!!\n\nNow that you've paid for the arrangement, go to the wedding and premeditatedly throw a large glass of wine on the dress… PLEASE", "Whatever OP wears will be whiter than SIL’s wedding dress.", "They just wouldn't, unless they were rolling in it, and even then...\n\nTo keep the peace? Why would anyone be bothered about keeping the peace with a bunch of moronic assholes anyway?", "Yeah, I think she did this on purpose.  It’s the only thing that makes sense.", "Or SIL", "Fair enuf", "Agreed.", "From the way OP phrases things, I have a feeling this actually happened a while ago and the wedding is long past.\n\nHe talks about the SIL as his brother's wife, and used a \"to this day\" about his brother and family in his comment here that suggests that more than just a couple months have gone by since the incident.", "Wear a dress the color of the stain and then go, “Oh look, how cute! We match!”", "not sure how old you are but it's a life skill (worth learning) to develop a thick skin when entitled people trying to get anything from you because they totally don't understand reasoning and what they are saying aren't logical at all.  So just don't waste time explaining to them cuz it will just wear you out.\n\nTo other people harassing you:\n\n\"oh too bad so sad, me so broke, no money to pay.  Maybe you should chip in since you are so concerned in this that has nothing to do with you.  What, you think it's my problem. oh too bad so sad, me so broke no money to pay.  Maybe you should chip in since you are so concerned in this that has nothing to do with you.\"  Just keep repeating and when you got tired of it, just hang up the phone.  It's not a crime nor rude to hang up if people are harassing you or saying things you don't want to hear.\n\nTo bro and SIL:\n\n\"Oh, I suffered psychological injury when your kid bumped into me.  When you pay for my therapy session for this trauma up front, I will pay for the cleaning fee of the dress.  What you are not paying??!!, okay, bye\" and hang up the phone each time they refuse to pay. Every time they call you, you cut them off first by asking when they going to pay.", "NTA. If you want to be an AH, here is what you do. For every circumstance where you get your brother, SIL or their kid a gift. Get them a card and include a note with:   \nMoney already paid: $2,500  \nGift: $XX.XX  \nBalance owing: $XX.XX (whatever is left from the $2,500).\n\nSo they can't claim you never give them gifts for bdays, xmas etc. And keep doing this until the $2,500 is paid off before you give any of them a gift again. \n\n(Putting the kid in this is a bit evil, but definitely do the parents.)", "NTA. \n\nI’m angry at you for sending the money. Kid’s mom should have paid for it. It was her kid who caused the accident. SIL just didn’t want to piss off her friend so she decided you were the scapegoat she could sacrifice.", "No gifts. You gave yours. Skip the wedding. NTA", "YTA Emma wanted to brag to the whole family. You’re jealous. Glad you paid.", "ESH- them for obvious reasons.\n\nYou for caving in and paying for something that wasn't your fault.", "NTA. If it actually happened like you say it did, it's her fault. Although, it would be an awesome gesture on your part if you did at least help pay for it. Money comes and goes, but family is forever", "ESH only because you actually gave them money otherwise NTA. Not your fault you shouldnt pay money because that idiot wanted to brag her dress.", "You’re a doormat! You’re the AH because you paid.", "You're a bot", "YTA for being stupid enough to pay them for it. Way to encourage them to continue acting this way, since clearly it works!", "NAH, 1: having the dress in the kitchen/open when food and wine are around, recipe for disaster. \n2: children shouldn't be running around the house, go outside! 3: I wouldn't have paid anything for the cleaning of the dress. Maybe 50$ to replace the wine that was spilled...", "YTA for paying. Holy shit. “Doormat” isn’t a strong enough word. That’s pathetic, I’m sorry. It was not your fault. Grow a spine.", "YTA for giving them the money. They're a crazy bunch of fuckers and your life would be better with less of them", "YTA for giving in and paying for the dress when it was not your fault", "NTA. You were VERY generous to pay for it -- I don't think I would have, but no one in my family would display an expensive dress in the kitchen. That should count as their wedding present; do not spend another penny on them. Also, did they even check if their homeowner's insurance might cover it? Or at least, part of it?", "You fucked up big time by paying.", "NTA. I spent $2,000 on my dress and veil. That's not very expensive these days. I'd NEVER let anyone around it. Not even my fiance's brother. He's a grown man, but he's also disabled and can be clumsy. Forget that noise. It's good that you wanted to resolve the conflict with your brother, but you didn't owe them anything.", "INFO - Is this the whole story? Was a bump from a kid the full reason the wine spilled? And is there other hostility in your family aside from this situation?", "NTA but this is the kind of thing I’d take to social media “My sister in law decided to display her wedding dress in the kitchen while serving wine and one of her unruly children ran into me causing the wine to spill on the dress. She demanded that I pay for it but I don’t understand how an accident caused by her neglectful parenting and bad display area choices is my fault. I have given her $1500 for the dress but they are still not happy, I will not be giving them any more money for a problem of their making that was completely avoidable.”", "NTA. You should have never paid anything. But because you already did, what I would do next is call up your mother and tell her you feel like you will always be blamed for this and because no one took your side I would go no contact with the entire family. Then I would send a text to your brother and SIL and say because you made me look like a fool in what happened you will no longer communicate with them, until they pay you back and apologize. I would leave it at that. And block everyone.", "NTA\n\nThat’s why you don’t display your wedding dress in the kitchen. FAFO", "NTA you should have had them take you to court", "NTA and I would not have paid even 1 cent.  It was the actions of their her child that cause it so it’s all responsibility on her.  It was also non if the rest of the families business to butt in.  Personally I would go no/low contact with the lot of them.", "NTA. She should not have brought the dress out in the kitchen no less. I would not have paid at all.", "Nta, now go stain up the new dress to get your monies worth! Your family sounds kinda exhausting", "NTA, she was being irresponsible af with the dress. Why display it openly like that around people drinking/eating/kids playing? I'd chip in for cleaning but that's all.", "They paid $100 to clean the dress and used the rest of the money for honeymoon. Were hoping for more to stay away from children longer. The whole situation is very suspicious but I think it was planned including children running and bumping into people. You were the unfortunate victim. Enjoy life without these people ( who are probably planning the next accident) in your life.", "I am so angry that you paid them anything.  The only way that money was well spent is if you never speak to any of them again.", "NTA, but maybe TI (the idiot) for paying for that dress. I could even see paying for a cleaners visit or stain remover but an ENTIRE dress? These people are absolutely crazy.", "NTA That is a lot of money to be extorted for. I cannot believe you paid. \n\nYou didn't do anything wrong. Your family is full of AHs", "That dress was displayed to get damaged u just happened to be the unlucky one pure scam of u ask me", "NTA don't give them a wedding present. I get that your brother's wife was upset, but with the name calling she has shown what a truly nasty person she is. You do not need her in your life. Plus it sounds like they had not even tried washing or drycleaning the dress - they will probably do that and keep the money. Ask for a receipt for the replacement dress.", "ABSOLUTE BS. He’s right that a kid might not be able to be held responsible, they’re just kids. The idiot parents sure as hell can though. Hard to buy family out sometimes but I’d be done with the whole lot of them NTA", "NTA You didn’t ruin the dress. The careless kid and the careless bride to be ruined it.", "NTA. Every step of this was their fault. Not yours. Not the kids. She brought the dress into a kitchen where people had food and drinks. She displayed it around said food and drinks. They both were failing to supervise their children when a very expensive thing was in the room. The kid did what kids do and ran into you. They created the situation and passed on the blame. A big part of defending against things like this with kids is managing the situation so that the kid doesn’t have a chance for something to go wrong. The only way you’re the A H is to yourself in that you caved and gave them money they didn’t deserve.", "I hope you aren't buying them a wedding gift, or Christmas, or birthdays for the foreseeable future. Yikes!", "NTA - You paid, now block, don't engage with them and don't go to the wedding....exit all of it forever.   They all need professional help.", "Nta. You were very kind and a little foolish to pay for it but I also understand family can pack on the pressure. You know what normal people do with important items? We put them away out of danger. She sounds like a jerk and so does your family for trying to pin it on you", "NTA... But you've proven you're a doormat! Can you stop payment on the check?", "never interact with them again until they admit it was their child’s fault and pay you your money back that you had no reason to pay in the first place. i wouldnt even go to the wedding at that point", "… want to bet that the dress that got stained didn’t fit the bride to be? Or something else was wrong with it and they hoped someone who could be bullied into paying for a new one would do something to ruin it?", "NTA. I would have paid nothing, not gone to the wedding, and considered myself fortunate not to deal with them anymore.", "I hope you cut contact with them. This is one toxic family. The bride pulls a bonehead move and HER kid spills the wine but bro and family blame you? Yeah that would be me never speaking to them again. NTA but they are.", "Well, they do say it's bad luck for the groom to see the dress before he sees her at the alter(/officiant/dont know other terms for it) lol", "NTA look up it’s always sunny in Philadelphia the Reynolds vs Reynolds cereal defense", "Why did you pay that? It was clearly her and her unruly kids fault. At best I would have bought some red fabric dye and sent it to them to match the wine", "NTA, but I wouldn’t attend the wedding. Your whole family are idiots for expecting you to pay for it, and I’m sorry you did.", "NTA - first of all, if I paid that much for a dress it would be locked away far far far away from any harm that could possibly come to it, not hang it in the KITCHEN of all places! Also, I would not pay for an issue her ill-behaved brat caused. I would also never speak to any of them again, until they apologize, and refund you that money.", "NTA, the only part of this you are the AH for is paying them $2500.    \n    \nNow, you should take a timeout, block them and plan a nice vacation for whenever their wedding would be.   \n    \nOh, and when they ask you in the future to babysit, remember the magic word \"NO\".", "All I have to say is I NEVER would have paid the $2,500. I also would have blocked everyone and put my phone on silence unknown callers. \nWho the hell displays an expensive dress let alone a wedding dress in a kitchen with kids around? \n\nNOT THE ASSHOLE", "You were blamed because you have the ability to pay and the children do not. Hence, bro and SIL wanted to keep the blame spotlight on you. Pretty calculated. Fuck those two.", "NTA\n\nThe plan was to make sure somebody, anybody paid for that dress that wasn’t them:", "NTA. You weren't at fault at all.", "NTA. The real asshole of this story is Emma, who was foolish enough to bring her gown into the kitchen where there was wine and kids running around. She is the one who is responsible.", "NTA. \n\nThis was a combination of her irresponsibility + a child being a child aka having zero special awareness.", "NTA", "NTA", "Accidents happen.\n\nNo wedding dress should ever be displayed as described.  If so, so liquids should ever be near it.  You have said that other were drinking too.\n\nYou did not fall or slip.  A child ran into you.  It was an accident and family was stupid for openly displaying the dress that way.\n\nThe child could not be blamed as it is HER son.\n\nNTA.", "Who the f shows off their bazillion dollar wedding dress in the KITCHEN???? Either the elevator doesn't go all the way up or this was on purpose. NTA", "NTA but YTA for giving in. You did actually pay so this story is moot.", "You paid so I don’t see the point of the question. I personally would not have paid….it wasn’t your fault…the dress shouldn’t have been anywhere near people eating and drinking and kids running around. It’s the brides fault. But again….you didn’t refuse to pay….you buckled to pressure from your family.", "NTA. \n\nIt makes me sad for you that you felt you ultimately had to pay to get them off your back. Your family sounds really entitled and abusive and a situation like this would quite honestly be enough for me to cut off contact with anyone who dared contribute to the harassment before I paid a cent. \nHonestly, even after the situation has blown over, I would consider cutting off contact with your family.", "NTA  It's disappointing that you gave in & paid the money, but definitely good that you moved away & gone LC.", "NTA. You shouldn’t have paid. You didn’t cause the issue. The dumbass kid did.", "I hope you're not getting them any wedding present after that. If you did, take it back and get your money back, cause these folks just fleeced you out of $2500.", "See this is why I don’t believe 99.9% of these stories are real. This person is posting on a 5 hr account and judging by the story and way people are acting, I just don’t believe it.", "NTA your just an idiot for paying them. This sounds like a scam.", "Did she not have insurance? Her own kid ruined her dress. I would not have paid, and explained myself to some ppl in the family. Then gone no contact if they didn't drop it. \n\nI hope there's an update, where OP is asked to babysit so she can say she can't afford to. What if the kids damage something else, and OP gets bullied into paying again.  \n\nNTA\n\nMaybe a little, but only to herself, because she did pay.", "Nta. Honestly I wouldn't pursue a future relationship with any of them. And then id wait for them to need a favor some day so i could say $2500 or f off because I still hate them", "NTA. I would have let them hate me forever. No way would I pay a cent in that situation.", "YTA - for caving in and paying for it. You have successfully allowed them to redirect the blame for something her kid did. This will continue.", "If this would be me, the $2,500 payment would be the last time I ever spoke to any of them. Showing a dress like that with people holding drinks is just irresponsible and stupid. This is a “Bring people to the bedroom with no drinks , no kids and no touching allowed”\n situation  and it almost feels like this was planned and you were targeted. I would have wanted a written estimate from a dress shop or a cleaner before I paid for anything.", "Sorry but why would you pay it? Like seriously?", "NTA. I would have split the cost. It was her kid that caused the problem.", "I would go NC at this point because they will pin the blame on you for something else.", "NTA. The children didn’t get blamed because they didn’t have money. They blamed you because you do have money. They also guessed that you’d cave. \n\nThis is all very strange. Who displays a dress at a family gathering in the kitchen before a wedding?  Shouldn’t it be a surprise on the actual wedding day?", "YTA for paying the $2500 to them. You should’ve stuck to your guns and told everyone in the family that their kid ran into you.", "She took the dress out at a busy event and it was clearly the kid's fault. You didn't hurl the wine at her.\n\nNTA", "NTA", "Why did you pay them anything...", "Kid was 50% liable...you end should have been 1250.00.  Agree with other comment something must have already been wrong with it.  Good luck in that family", "NTA. \nIt’s a freakin kitchen with kids running around.\nI’m sorry you had to pay for that. But NTA.", "NTA. It’s no one’s fault. If blame had to be assigned it would be to the fiancé for creating a situation that put the dress in unnecessary danger. They just didn’t wanna pay for their stupid decisions.", "Ohh hellll nooooo. NTA everybody else is including the kid. #BoycottWedding", "NTA\n\nUnfortunately, i doubt you're going to hear the end of this for a very long time. You're going to be that relative \"who almost ruined the wedding.\"\n\nPersonally, I would make a point of not going to the wedding, especially after the insults and what not but I'm also a pretty petty asshole when i think it's justified.", "ESH, you absolutely need to chip in to pay for it since you were the one who spilled, even with the help of a kid running around. To be honest just your wording makes plain how little you care for the finace so if she's gotten this vibe as well I can see her thinking this is more intentional that it was!", "NTA \n\nI wouldn’t have paid a dime", "NTA, and you definitely should not have paid a penny after they insulted you for them being idiots.", "YTA for not taking responsibility. Go ahead and color code your wine glasses next time.", "NTA", "Was about to say you were TA by the title. But in reality, you're NTA. It wasn't your fault. It was their fault for having an expensive wedding dress out there.", "NTA\n\nBut you should grow a spine.", "As u/CarterPFly already said, it sounds suspiciously like a setup.     They were hoping someone would spill something so they could claim damages.     Not only that but if you had a kid who did that they would assuredly have demanded you pay for it then too, rather than suddenly bearing no responsibility for their own children.  \n\nI would have died on that hill, especially when their logic for you owing it all was to not blame their own kid for being a kid.", "NTA.  But you gave them the money???  You're a better person than me.", "YTA, for paying in the end.  Best you should have done is say half and they take responsibility for the other half as the kid ran into you. If the kid took a hammer and ran into the neighbors park car the parents would be responsible and would have to pay for the damages. Being a kid doesn't excuse the responsibility.", "NTA\n\nWedding dresses do not belong in the kitchen. Even less so when there are children running around and alcohol being served. \n\nWTF happened to the wedding dress not even being seen before the wedding?!", "NTA  \n\n\nAfter paying 2500 dollars, i would have asked to keep the dress, and then wore it to their wedding. haha.", "NTA your family sounds high key toxic", "NTA- did she hang the dress up on purpose hoping some one would ruin it so she could get her money back?  Was this before or after the wedding?", "YTA you spilled your wine on her dress, you pay the damage. Yes it was stupid for the dress to be out, but you are still the one who stained the dress", "You shouldn't have paid.  At all.  You should've at least asked for the bill for the cleaning, rather than just giving them money.  I'm tempted to say ESH, because you just caved instead of standing up for yourself, when you knew you weren't in the wrong.\n\nIf they're expecting a present from you, simply tell everyone that you've paid for the dress, and that's your wedding present.  Do not spend ANY more money on them.  Tell everyone you know what happened, especially anyone going to the wedding.  Spread your story around before they can start telling lies.  Also make sure to get it in writing that you've paid them $2500, in case they try to squeeze more money out of you.  And if you find out how much it actually cost to get cleaned - which should be less than that - ask them to repay you the difference.  Bring the receipts.  Don't let them get away with this.", "Why the fuck would you pay? \nI don't think OP is telling the whole story. \nNobody watches a child run into a adult holding wine and proceeds to blame the adult. \n\nCan't give a judgement since I don't believe the story is being 100% told", "Op you need a backbone.", "Did they give you the dress? Wine stains are not permanent, especially when fresh. I would demand the dress. NTA", "NTa. Are your family like, do you have more money than them and they all know it and often ask for money?\n\nAny reasonable people see a kid run into an adult with a drink while moronically displaying a dress and they are demanding thousands of dollars before even washing it?\n\nDamaged dress, or cheap dress they lied about being expensive and scammed you out of a few grand for?\n\nShouldn't have paid, you'll regret it feel resentment against them all over it for life anyway and you could have had the same but kept hte money. \n\nAlso the kid isn't to blame, your brother and his to be wife are. They put the dress up, threw a party, gave everyone drinks and let their kids run around.", "Why you paid them???? Ahhhh...OP, just cut them off, they're being ridiculous, it's her and her child's fault. NTA, BTW", "Longtime bartender, you can get red wine stains out by flooding the area with white wine and blotting.\n\nAfter that, dry cleaning. I would not have given several thousand dollars to a foolish mother who brought the Titanic disaster on her own head.", "I thought the groom wasn’t supposed to see the dress??", "NTA. I wouldn’t even attend their wedding. No gift. No future babysitting. Zilch.", "NTA. I’m sorry that your entire family bullied you like that. I wouldn’t have paid. What’s done is done and I probably would be low to no contact with all of them after this.", "..yunno..you paid for the dress..that means its YOUR dress now.\n\nNTA", "Is it too late to stop payment on a check?\n\nNTA", "Uhhh this totally sounds like a set-up from the fiancé. Get a cheap dress that can pass as “expensive”, give her kids a bunch of juice to get hyped up with, open a bottle of red and hand you a glass. Extortion set-up complete. \n\n$2500??? YTDA (you’re the dumb-ass, fiancé is TA)", "NTA, kid's responsability is on his parents.", "NTA!! Who display a dress in the kitchen and a crowded one with kids running around, accidents r bound to happen", "NTA. She displayed the dress in the kitchen with her children racing around, with predictable results. That’s all on her.", "Nta- we accidentally spilt red wine on a dress pre wedding.  We pretreated it and and sent it to the cleaners.  No stain at all.", "I wouldn’t have given them a cent but since you have you might want to consider spilling wine on her at the actual wedding. Nah just kidding! \n\nNTA", "Esh. I’ve spilled a lot of wine and have never flung it all over anything. But have also never paraded a wedding dress all over so go figure.", "Next they are going to complain about your small gift if you give one at all.", "NTA kid ran into you, you didn't deliberately fling the glass of wine onto the dress. Dont discipline your kids face the consequences.\n\n\"My kid released the handbrake while I was at home, my car drove into my neighbours car. Of course its my neighbours fault for having his car there as its just a kid! He didn't know any better!\"\n\nWtf OP you should explain to your brother that siblings should always have their backs and maybe its time to sit the kid down and explain some manners.", "YTA only because you caved in and paid for the dress", "The child didn't get the blame because the child didn't have any money! Was obviously the kid's fault, but OP was the only one with a wallet.", "You should buy a replacement dress and wear it to the wedding. NTA.", "Did you get the ruined dress back off her. A trip to the drycleaners it might be reparable and then sell it. \n\nThis is a mess, you should not have paid and your family sucks.", "I would've gone to the wedding and ruined it again lol", "Absolutely not the kid's fault. His parents, on the other hand have full responsibility.\nThey made the decision when and where to present the dress and accepted the risk.\nThey did not controlled their children to try to minimize the risk.\nNTA, but personally, I wouldn't pay the damages. The relationship will be ruined anyway as I can't see how you can maintain these after you paid the damages that their reckless behaviour caused and them turning the family against you.", "NTA for staining a dress that never should have been where it was in the first place. If you hadn't done the damage someone else would have. I can understand why you caved to the pressure, nobody wants to be the bad guy, BUT, your family and especially your brother and wife are complete AHs. Obviously nobody taught them about consequences.", "Not only food and drinks, kids too, she had it coming, shes mad because it was her stupidity and she needs someone else to blame, shes the idiot.", "I only spent $2,000 on mine, and you'd never catch me pulling it out when anyone is around.", "Agree, YTA for paying (should never have done that).\nPlease boycot the wedding.", ">You were an absolute doormat to pay the money\n\nThis.\nPeople need to learn to stand up for themselves. I'd say you are borderline an AH, not for the dress, but for enabling entitled pricks who like to blame everyone else.", "This. I would not have paid a dime of that money.", "INFO: It cost $2500 to clean a dress?", "Mine was only 800 and I did the same as you until the wedding!", "Tbf they seem to have been the target of a vicious harrassment campaign before they paid the money. They still shouldn't have had to obviously, but I dunno if I'd call them a doormat just because they're not iron-willed enough to withstand that past a certain point, just bullied and victimised to a breaking point. They'd have been a doormat for paying up when the brother brought it up the first time.", "You should be proud of yourself for protecting your dignity. $1500 is a small price to pay to be rid of that level of toxicity. Congratulations.", "Think of it as you paid 1,500 to never have to deal with these assholes ever again.", "Cleaning does not cost $1500.", "You’re a much bigger person than I am because they wouldn’t have received a penny.", "Good riddance, those type of people don’t belong in your life.\n\nAnnoyingly snobby people who want to front like they have money (buying expensive wedding dress and showing it off) but then when push comes to shove they beg for money because they can’t afford the clean up of a mistake their kid caused.  Honestly the petty in me would probably request that money back when they started acting out even after you paid to clean it", "Why tf would you pay if you’re going nc anyway.", "Ive heard it’s bad luck for the groom to see the dress before the wedding… NTA", "Wow. They suck. $1500 is still a lot of money, but I’m glad you don’t have that negativity in your life anymore!", "YTA for paying them any money", "Based, as the kids would say!", "I mean this as disrespectfully as I can, fuck all of them. The fact that you caved and paid and they’re STILL being like this is just stupid. While I’m not jazzed you paid them a cent, I think you’re right in cutting contact. These people do not care about you and they’ve shown their true colors.\n\nI wish you the best and hope you are well :)", "> hates me and also his \n\nYour B and SIL are the A H and you caved to their pressure. Now that you know about >them< (e.g. spinless brother and b\\*\\*\\* of a wife) you will at least go LC with them. You are NTA and were pressured into paying for their mistake.", "I’m so glad you went NC.  You brother and his wife was toxic.  If you ever reconnect, please send them a gift basket with  laundry stain removers, and aprons. \n\nOP is NTA.", "I’m glad you cut them off. They all suck. They can stay mad.", "who in their right mind, with an ounce of sanity, logic, and reason, displays an effing wedding dress, in a room KNOWN to be a disaster area, with all manner of cooking mishaps taking place...\n\nadd to it, the complete apparent lack of supervision of the child(ren) and you're the one who cops the heat, simply by virtue of having a wine glass in hand..\n\nNTA.", "$1500 is still too much for that scam artist. Hopefully that was emotionally freeing for you though!", "They all suck and I’m sorry you had to deal with that. I hope you are able to live your best life.", "I don’t normally think NC is the answer, but under these circumstances, it absolutely was. I too wish you had not paid or had demanded to get a cost estimate from a cleaners because I agree that this sounds like they scammed you for some other damage her kids caused. They’re jerks and I hope they eventually get exposed.", "Found OP's brother", "Her fault either way. X% for showing off with food around, x% because she is responsible for her minor children. OP 0%", "My ma refused to dress me or my siblings in light colours. Everything was ruined in a heartbeat, I wouldn't even wear a white top now because I know for a fact I'd ruin it and I'm 29. \n\nNTA and I agree, shouldn't have paid but with everyone whinging I can understand why she did.", "I was surprised I had to scroll so long to see this response. OP sounds like they’re full of distain for this person. Like, there’s a lot of judgment for her spending $1500 on a wedding dress… when that’s actually pretty typical cost-wise?", "Mmm, could be, but I was thinking the opposite - maybe SIL told the kid to go run into OP in hopes of the dress getting damaged.  OP didn't say anything about there being issues between the two of them but it's possible.", "I have a 7 year old grandson & believe me, when he's wound up & ramming around the house, he definitely could crash into someone & cause a drink or food to be flung! And a house full of people partying will absolutely make 2 kids that age blast around like rockets.", "[deleted]", "lmao no, maybe the dumbass bride shouldn’t have put her wedding dress on display in a KITCHEN with KIDS around 🤷🏻‍♀️", "not if your family is awful like OPs", "please explain how she did it on purpose?", "if it wasnt her fault how would be be the asshole", "She’ll go to the wedding. Jello.", "And since you already paid the 2.5k if it was me, I would do it and refuse to speak to any of the \"family\" that were telling me to pay \n\nTake the money and fuck off", "[removed]", "Yea I agree that would have been a safer option. But wouldn't most of the people that were at that house have been with her picking out the dress? So I mean really who is she gonna be showing it off to anyway right?", "I was thinking, 'dress probably cost $500, and they just talked it up' - same idea though.", "Shoot I haven't thought of that and it does sound possible. \nI was even puzzled cause where I live there is a superstition that the groom seeing the dress before the wedding is bad luck, and even if it wasn't why would anyone display it like that... and this answers it.", "It feels like this was planned before hand and OP was set up. It just seems so….intentional. Especially with how everybody absolved the child of absolutely any blame because he’s “ just a kid”  Guaranteed if I did something like that, I would’ve gotten my ass beat and go grounded", "I spent less than $200 on mine - and exactly the same, I kept it away and still keep it away. (Low cost because we eloped to a national park instead of doing a wedding wedding.)", "Or send them super concentrated dark grape juice, the kind the Amish make. Say it’s a special treat from grandma and grandpa. The kids won’t be able to resist and EVERYTHING WILL BE PURPLE.", "Or a Bag of D*cks, chocolate ones.  And include a card full of glitter.  Address it to the \"Family of Brother, SIL, & Kids names\" so they open it all together. Those little beasties will be getting it everywhere!", "still overpaid, could have done it for free", "Yep.", "The entire family is outraged at her.  She’s responsible somehow.  And I don’t like how she said she wanted to “brag on it.”", "Real", "I showed people pictures of my dress before the actual wedding day, but I didn't hang it up for all to see at a party with kids and red wine! It stayed in the dress bag until I needed to put it on.", "For sure, because why else would they go straight to pressuring OP into replacing it without taking it to the dry cleaners first?!", "The future bride is.", "My vote is on brother and Emma being total morons, because I hate to believe that they would try to make sister pay for an already damaged dress. \n\nPerhaps a skirt of material could be sewn over the damage if it can't be cleaned? I would discuss this with the bridal shop where it was purchased.", "That's great! Dresses are so expensive. Our total cost will still be under $10,000 if you include my dress, though. After the wedding, I'll do the same. It'll stay in the bag.", "I borrowed my mom's dress and she wanted it back before I left the reception hall that night lmao", "Family that they cut contact with right after paying up. All smells fishy to me", "Yea like pictures totally makes sense! But to bring it out and parade it around in the kitchen? Like what?", "I would have demanded a estimate from a cleaners or the dressmaker. Even then still wouldn’t pay", "A lot of drycleaners won't work on wedding dresses because of the high risk fabrics and embellishments. Obviously we don't know what this wedding dress was made of, and we don't know that she even bothered to check, but it is possible that the cleaning had to be specialized", "They really are so expensive!! It seems like everything for weddings is so expensive just because it can be, which is incredibly frustrating (and was also another reason why we eloped, we wanted to save money for a house and starting our family).", "Yeah, and why post now? If this happened it has a \"long ago\" vibe", "Lol yeah that's weird. But I also do my best to not have guests over, so there wouldn't be many people to parade it around to 😂", "That being said, there are shops that specialize in cleaning wedding dresses. I know I took mine to one after the wedding (no wine or anything exciting, just the dirt and sweat you'd expect from a satin dress worn all in summer and an outdoor photo session) and it cost a couple of hundred to be cleaned.", "Yep! It's amazing how much more expensive anything is when you mention just the word \"wedding.\" Hair, makeup, clothing, food. Congrats, though!", "NTA  \n\n\nI see you already paid $2500.00\n\n&#x200B;\n\nThe bride to be did set the dress up for disaster and that is exactly what happened. It would be one thing if you tripped and spilled the wine but you were startled by there kid.   \n\n\nAlso the dress should NOT have been in the kitchen at ANY point.   \n\n\nAt the most a split of the bill to clean the dress is the most I would have done since I feel I was not the sole reason the dress was stained.", "NTA.  I know people are saying to cut contact, but the villain in me says you should go to the wedding and \"slip and fall\" into their damn wedding cake.", "No way, you're NTA. So this idiot decides to flaunt her dress IN A KITCHEN? WITH KIDS AND WINE AROUND? This is unbelievable, the nerve honestly.", "NTA. Just better hope they don't expect any wedding gifts, birthday, or Christmas gifts until you feel like you've been paid back.", "NTA\n\nThere is a much bigger issue here. \n\nFirst, I'm sorry you paid, you should not have. That's ridiculous.  They blamed you for \"your\" actions? When it was the child's actions that did the damage? \n\nThis tells the kid they can get away with anything and they will never have to pay the consequences.  Even worse SOMEONE ELSE will. \n\nThat's scary. What kind of trouble are those kids going to get into and how far will it go? \n\nI would stay far FAR away least you be sucked in again. \n \nThose kids will grow up to be insufferable, miserable humans who blame all their problems on others and worse make the other people pay in one way or another be it financially or worse. \n\nI am so so sorry this happened. The idea it was you fault is ludicrous.  I really hope you show your family this post and the answers because everyone else clearly sees who the Ahole is, and it isn't you!!", "NTA for the situation but you're definitely the asshole for paying the money. Get a backbone!", "Since you paid for the dress, I wouldn’t go to the wedding. I wouldn’t really keep up contact at all after this.", "My shoes are dirty can I wipe them on you like your family", "YTA to yourself for being so spineless and paying $2500. Should have held your ground. The fiance was the idiot who decided to display the expensive dress in the kitchen with her undisciplined children running amok. It's entirely her fault.", "NTA, even though this sounds like a sitcom episode, plus in all my 40 years of knowing dozens of people getting married, I have never once seen any of them display an expensive wedding dress in a crowded location known for grease, food, drinks, and grubby hands.", "NTA. I’m sorry about your family being so shitty.", ">The only thing that got me upset was that I don't understand why her child didn't get any part of the blame.\n\nBecause that would make them responsible for thier kids actions. They could have told them to go in the other room. They pawned the fault off on you.", "Let me get this straight.\n\n🌑The bride has 2 kids.\n🌑The bride wanted to show off her dress...in a kitchen \n🌑The brides kids were fucking about,as kids do\n🌑The bride did not tell her own children to take their Tom foolery outside \n🌑the brides rambunctious offspring bumped into you and spilled your drink on the aforementioned wedding dress, in the also aforementioned KITCHEN\n🌑they wanted you to pay for damages to the dress displayed in the kitchen,ruined by the brides rambunctious kids because the bride didn't tell her kids to tone it down\n🌑they CALLED YOU NAMEZ FOR REFUSING \n🌑you paid them to shut them up\n\nOnly thing you did wrong was that last bullet point.\n\nNTA", "Nta. Your brother and partner are dicks.  They are taking no responsibility.  The reason the kid didn't get any repercussions is cause he ain't got no money. They are selfish.  Not your fault at all.", "NTA- But WHY did you pay? You could have just blocked all the abusive texts and calls and skipped the wedding.", "NTA. You should not have caved and paid for anything.", "NTA if you can afford to pay it. I wouldn’t go to the wedding and go LC with everyone. She asked for this to happen. No one in their right mind displays a dress like that and then gets upset when something bad happens. She wanted to brag. She played around and found out. You don’t deserve this abuse over an accident.", "NTA. The kitchen, where she knew her kids were horseplaying, where red wine was being served, was not the place to display the dress.\n\nThe correct move would be to block rhem for trying to get money out of you for foreseeable actions of her son. \n\nNow you know what your whole family thinks of you and it wasn't worth $2500 to remain in their good graces", "NTA. I hope your brother or his fiance have reddit so they can see how they are the absolute Assholes in this scenario. I'm sorry you got bullied to pay. I'm angry for you!", "Gahhhhh I’m so sad I paid 2500 honestly block them all they’re all assholes god I’d be livid NTA", "NTA at all! Bride is the AH for not keeping the dress in a safe place especially when there are children around. Brother and the rest of your family AH for speaking to you like that and putting blame on you when it isn’t your fault a child ran into you, and not just any child, THEIR child!!! The way your brother and his fiancée talked to you is disgusting, I would not have given them anything, I would also cut all contact and not attend their wedding. F them!", "YTA. For paying money!!! You need to grow a spine.", "NTA and shouldn't have paid. They are all assholes. I understand being upset about it but you gotta own your part and OP had no part in this really. SIL was a dumbass putting the dress in a room where food and drink live and it was her poorly parented child running in the house and running into guests. Whole lotta NTA", "NTA even disregarding the childish behavior of the adults. A kid who is not yours is at fault. You had nothing to do with it. If you had just spilt it or if the child was yours yes maybe then I could see you paying for it. But no not in this situation", "Emma definitely isn't the smartest corn in the turd.\n\nFuck that. I wouldn't have paid and id have cut off the spineless brother and anyone that agreed with him and Emma. Fuck them.", "NTA.  You shouldn’t have folded like that.  The blame should be on the idiot displaying the dress in the kitchen with the kids running around.", "NTA Good paid for and now cut them all out, toxic as hell and it seems like she maybe didn’t want the dress and hoped it would happen", "NTA, sucks you actually paid them the 1500. Definitely not your fault that there kid made you spill your wine on a expensive dress they had displayed in a kitchen. Also since it's was in a kitchen they Definitely should have left a plastic cover over it just in case. Very petty thing to throw away a relationship for. Glad your living happy regardless.", "NTA, but probably a good use of $2500. A small price to pay to learn to never to go that house again. That’s too much chaos", "NTA and to make it easier for you maybe show your family the comments on here since everyone seems to be in agreement. Make them really think about how nobody is agreeing with them.", "YTA for giving them 2500$", "NTA it was an abvuous set up and everyone else was on it.\nFirst, who displayes their very (supposedly) expensive wedding dress they absolutely love in the kitchen of all places.\n\nSecond, her kid bumped into you, so she can take away the blame, because she can't make herself to pay for the dress her own kid ruined. So she made the other person do it.\n*bonus point, you were holding wine. You were the perfect person to take the fall\n\nThey way EVERYONE was ganging up on you, I'm assuming the were all in on it. Your SIL probably didn't like the dress as much as she said she did, and wanted a new one. Or they simply spent the difference from the money you gave them and the money for cleaning.", "This title is misleading because you did, in fact, cave in and pay... which is insane. \n\nYou have proven to your family, yourself, and all of us that you are a pushover with no integrity or self-worth.\n\nSince you paid them $$ they did not deserve and gave in to the bullies, you should refuse to go to the wedding on principle. \n\nGood luck living this down...", "NTA", "NTA\n\nI don’t understand why they didn’t just get it professionally cleaned. It is possible to save clothing from wine stains. No need to buy a completely separate dress.\n\nAlso, it was absolutely ridiculous that she had it out in that environment.", "You paid? Definitely the bigger person but not your fault at all", "They aren’t blaming HER kid because the kid doesn’t have the resources to pay for a new dress - and apparently neither does your brother and SIL.", "Jfc 2500 to get a stain out of a white dress? NTA. Of course.", "NTA. dawg your entire family is crazy. it’s also on SIL for putting an expensive ass wedding dress in the kitchen, like who in the right mind does that? i get that they’re angry but dawg it was jus an accident, there was no need for them to get all angry and scream insults at you. go NC with everyone here OP.", "You didn't stain the dress; your SIL's kid did. Also, the dress should never have been there in the first place. NTA - but your family certainly is.", "Nta, but did you keep the dress. You did pay for it. I would exposed it in my home", "WHY DID YOU PAY", "You're only the asshole because you caved and paid them. Stick to your gut next time. I was so on your side up until that. Now I'm just disappointed I even wasted my time reading this.", "YTA for ultimately paying.", "You really shouldn't have given them shit. I wouldn't go to the wedding...or go and spill wine on her again \n\nNTA", "NTA - borrow the kid’s soppy cup next time.", "[removed]", "NTA and you have a family of monsters.", "NTA.\n\nYou got played by your own shitty family. I'm sorry but the truth doesn't care about emotions.", "NTA but you should’ve NEVER paid for it. She’s an idiot and shouldn’t be justified (monetarily) into bullying you for HER (and your BIL) lack of parenting in the moment and idiotic display of an expensive dress.", "ESH — I’d be on your side, but I think it’s weird that you’re trying to get them to blame the kid. Like, their a kid doing kid things. Obviously not your fault if someone bumps into you and you spill, but also I wouldn’t be drinking red wine close to an expensive wedding dress? Yes obviously everyone else sucks for their reactions as well, and for putting the dress in the kitchen with kids running around. What a dummy.", "NTA you owe them NOTHING", "NTA, also it’a hard but not impossible to remove a wine stain. I did many times.", "This was NOT your fault. I can’t believe they held you accountable for something you did not do…and you still paid for it. But whyyyyyyy???\n\nNTA….", ">The only thing that got me upset was that I don't understand why her child didn't get any part of the blame.\n\nHer kids shouldn't be blamed - they're 6 and 7 - but what happened was an entirely forseeable thing for an adult so your brother & future SIL should 100% be blaming themselves for being so stupid to bring a wedding dress into where people were eating & drinking.\n\nNTA", "NTA. She chose a really, really stupid time to show the dress off and the inevitable happened.\n\nWhen I got married the first time, my now-ex and I had a really chill Great Dane. Like, you might think he was drugged type of chill. I put him in the backyard and double-checked the door before trying on that dress for my now-ex-MIL and MOH.  If you pay a lot of money for something, you should take reasonable precautions and your brother's fiance did not do that.", "What? That’s ridiculous. The kid is to blame, but so is the fiancée for showing off a dress in a kitchen where there are drinks (and possibly food?) being consumed. \n\nThe fiancée sounds like a piece of work calling you names like that. NTA. I’m sorry you ended up paying. Now you know what kind of people they truly are", "Her son didn’t get blamed because he doesn’t have any money.", "NTA. First, putting the wedding dress in the KITCHEN of all places is such a terrible idea. Like who does that? Secondly, someone bumped into you and it was an accident, no is at fault and they have no right to demand payment from you.", "Just keep in mind when karma day arrives and they need something from you. You have every right to tell them they have already been paid. They are the assholes.", "NTA- but all paying did was reinforce their entitled and bullying behavior", "has anyone heard of trying the dry cleaners first? NTA massively. Who in the hell brings their wedding dress into the middle of kitchen? This was entirely preventable BY THE BRIDE. Sorry you had to deal with this, you handled it like a pro. I'm sorry you're out the money.", "The problem is that you paying won't earn you their respect back.", "NTA for standing your ground. They shouldn't have shown off the dress in a super common and very high traffic area in the first place, and if they do, it's their job to make sure any and all children are being tended to and being careful. You're a real tool to buckle under the pressure after fighting so long and paying anyway though.", "NTA. The fiancé should be the one who has to pay for it! She made the stupid decision to display it in the kitchen where kids were running around instead of somewhere safe! You shouldn’t have had to pay for it!", "I'll bet this was a scam to get a better dress. I hope tlyou retro hex that money.", "NTA but “we never negotiate with terrorists”", "NTA your bro and his future wife are super wack for that. Remember this moment when other bs comes up like this. And for your family to also take their side is NUTS. Like I get it she’s joining the family but that doesn’t mean she gets spoiled. I’m sorry OP I hope that money comes back to you!", "NTA she should've known better than to bring the expensive WHITE dress into a kitchen full of people with kids running around. It was basically a recipe for a disaster waiting to happen.\nShe should've just taken you guys out of the kitchen to show you if she really wanted to do badly. And even the the dress could still be ruined by the kids if nobody had a drink in hand.\nPlus those kids shouldn't really have been in the kitchen in the first place (I don't know if any hoy application was on) but regardless they should've been in a room playing.", "NTA most people I know keep the wedding dress away for safe keeping (if it's not at the tailors). \n\nYou know why? So stupid shit like kids running into people causing wine to fly across the room and ruin the dress doesn't happen. \n\nI can't believe NO ONE saw this. Like WTF?", "Nta. You realize they probably did this on purpose right?   It's not a bad plan tbh, place expensive dress where it can be stained, let kids do the hard work for them, voila, got the dress on someone else's dime.  Wine stains can come out if handled properly, depending on the material.  See if she wears it to the wedding, then you'll have a better guess if it was on purpose or not.", "NTA and I’m sorry your family didn’t back you. I wish you hadn’t paid and held your ground but I understand why. Good luck in life and stand by for his eventual divorce", "NTA.  Parent of the kid is the responsible party.", "NTA - but I can’t believe you actually gave them $2500. Your brother and SIL are nasty and absolutely out of line.", "But you didn't refuse to pay. You paid $2500.", "NTA. You got bullied and verbally abused by your brother and family to pay for the fiancee's mistake of displaying an expensive dress in a kitchen.", "I'd be going NC with these assholes. Every single one of them\n\n\nNTA", "YTA for paying for the dress that was ruined by their child. This would have been a hill I died on!", "NTA. \n\nAnybody else feel like she intentionally displayed the dress, hoping it would be ruined and someone else would be guilt tripped into financially contributing to their poor financial decision of a wedding dress.", "I’m sorry you were bullied into paying for something that was not your fault. NTA", "yta for paying for it you made yourself look weak and spineless to literally everyone hearing this story lol", "You need to CONFISCATE that dress. Don’t let her take your money and keep it.  NTA", "NTA, OP. I am so sorry you were harassed into paying so much for something that's not your fault. If I were you, I would go NC with everyone who did that.", "NTA. Sad to see that your family chose $1500 over a relationship with you. You did nothing wrong.", "NTA. You shouldn’t have payed because it’s not your fault, but since you already have them money you can spill anything you want because it’s your money that was used.", "NTA, I'm sorry you got fleeced for $2500. They shouldn't have displayed a wedding dress in a place where it's honestly quite common for messes big and small to happen. What did she really expect?", "Are you sure you're being honest with yourself in this post or are you just trying to get people that didn't see what actually happened to side with you? You are taking zero accountability within the narative, which makes the entire thing suspicious. \n\nY(might be)TA.", "NTA. Honestly this is all on her own. She was showing off. She played a stupid game and won a stupid prize. You shouldn’t have paid but I understand what it is like to be bullied into doing something. Honestly sounds like it’s time for some petty revenge. Im of the mind that if your going to be accused of something, made to pay for it, then you should actually do it. Just saying.", "> The only thing that got me upset was that I don't understand why her child didn't get any part of the blame.\n\nBecause they child can't pay for it. \n\nAnd asking the adults responsible for said child was clearly out of the question.", "But you DID pay so maybe change the title? I wouldn't have gave a dime.", "You are indeed a coward if you ended up paying. But otherwise NTA", "NTA, you shouldn’t have paid a dime", "NTA. Except you are TA for actually paying them. You are not responsible for a genuine accident beyond your control. I don't think the child should have been blamed either. Accidents like this don't have one person who is at fault, it's poor circumstance. However, if anyone had any responsibility of this, it's the fiance for wearing the dress in an area that was obviously begging for a disaster. She made a poor choice and she should have to live with it.", "INFO: How close were you to the dress? And how hard did the kid hit you?If I’m sitting at a red light, and someone rear ends me, and as a result, I hit the person in front of me, I’m responsible for the damage to the front of my car and the person I hit. While it wouldn’t have happened if I hadn’t been hit, it also wouldn’t have happened if I’d kept a reasonable distance from the car in front of me. I think the same principal applies here. \n\nIf you were standing directly in front of the dress, a foot or two away, holding a glass of red wine, and I think they are somewhat justified to ask you for some money towards the cleaning and/or the replacement cost. \n\nDon’t get me wrong, they’re still more at fault than you are here, and I don’t like how they handled this at all, so I’m heavily leaning towards NTA, but just as they were dumb to think it was a good idea to have a wedding dress on display in a crowded kitchen with bottles open and people moving around, I also think it’s kinda dumb to stand right beside or in front of a wedding dress on display in a crowded room while holding a glass of red wine. \n\nIf the kid lightly bumped you while you were standing right near the dress, you guys should have split cleaning costs, and gone from there. If you were nowhere near the dress, and the kid full on barrelled into you, and you dropped/threw your glass while trying to regain balance… then that’s 100% on Emma.", "You're NTA but an actual idiot for paying them. Grow a damn backbone.", "YTA - pay for the dress that you responsibly ruined", "Sorry for stating the obvious, but why don't they have the dress professionally cleaned? That would cost a lot less than completely replacing the dress. \n\nAs for judgment: ESA. No, she should't have brought it out, but I can understand being excited about it (the insults are out of line, though). There shouldn't have been any food or drink around it, meaning OP should not have been near it with a glass on wine in their hand. And OP's brother for asking the full value of the dress rather than try to have it cleaned.", "YTA for not dumping the entire bottle of wine on the dress after they faulted you and scammed you for free money.", "NTA. Your family sounds awful.  This is not something to let go.", "YTA because you lost your spine somewhere, maybe that kid ran into you super hard.\n\n&#x200B;\n\nWhy the hell would you pay them for the dress!", "NTA, now that you paid, get a refund for everything you booked relating to the wedding and write them off until they're willing to be reasonable.", "I can’t believe that you paid for the dress!  I understand that you did it to smooth things over for everyone, and you did, except for yourself. Hopefully, as you age, you will learn not to do that.  The dress display and the foreseeable accident with unruly kids in a kitchen wasn’t your plan or fault and, trust me, everyone knows it. They just needed you to be the fall guy. \nWhat’s done is done but consider that you have paid, not for the dress, but for your easy conscious and emotional freedom. Do you want to attend this wedding? If you don’t, do not go!  Don’t announce or discuss it. That is just a chance for more coercion, to make you accept fault and humble yourself. Just don’t go and when asked, even if it is the night before the ceremony or two weeks before or a week after, tell whoever brings it up that you didn’t/don’t feel comfortable going and you are quiet sure that the two most important people were there. Refuse to get upset. Smile because you know that what they think and/or say doesn’t have to effect you anymore. \nBest of luck.", "Noooo, I can’t believe you paid them $2500 :( NTA", "When I read the headline, I assumed it must have been at the reception! Wtf was the dress doing in the kitchen before the wedding?! Nta.", "NTA, but you shouldn't have given them money. Your entire family and SIL are AHs for blaming you when you had nothing to do with the accident. You will forever be a scapegoat when something goes wrong and you are present. Now is as good of a time as ever to go LC with your family and not speak to them until they apologize.", "Displayed it out of the bag, in the KITCHEN, with food/ drink and kids running around; the bride is an idiot.", "Only problem in a story like this is that everyone in the story seems to think OP is at fault, not just the brother and SIL which makes me wonder if this version of events is accurate. But assuming everything is true: NTA.", "NTA - this sounds like a scam but you were there and maybe the boys really did run into you by accident. Did you get a look at this magical dress? Did it look... cheap?\n\nEither way, not your fault and don't pay a dime.", "You did absolutely nothing wrong! Wasn’t even your kid! Your family manipulated you and forced to think about the situation rationally. They were just not wanting to accept the fact their kid was solely at fault. NTA", "NTA but you’re an idiot for paying them.", "NTA\n\nThey scammed you out of $2500", "You're an asshole for caving to them. that is the thing you did wrong. because now they know they can do that whenever they want to get more money out of you when they fuck up.", "ESH.  It was stupid to display a dress like that, but it was also stupid to stand near said dress with a glass of wine.  Instead of just waiting for disaster, I would have asked my brother if he thinks the dress should be moved since the kids are running through there.  I’m not sure if you should have paid, but you aren’t innocent either.  I know if someone had a wedding dress hung up in the kitchen, my wine glass would stay far away.", "I was gonna say YTA, but they just immediately placed the fault on you. I mean you could have helped a little bit, but after how they treated you, I wouldn’t pay them a cent. Return the wedding gift. What do they mean “don’t bring the kid into it”? The kid literally caused it. Yes you had wine, but you were in the KITCHEN. Where did they want you to stand? On a rug?", "YTA for paying", "NTA - what kind of idiot puts a wedding dress on display, especially in a kitchen?  Does she think she is a member of the royal family and people are lining up to view it?", "NTA\n\nWhy the hell dis you pay them?", "Yeah that would have been a hill I’d die on. You did not ruin her dress. Her child ruined her dress. Honestly I don’t know how you’ll continue to have a relationship with any of these people in the future. Every single person in your family bullied you over something she caused.", "NTA except to yourself.  You shouldn’t have paid them.  Are you sure she didn’t intentionally leave her dress up to get ruined so she could buy a new one?  It’s bizarre to display a wedding dress before wedding, especially in the kitchen.", "NTA and she's not the brightest bulb in the chandelier, is she?", "NTA.  But since you did pay for the dress I would go NC.  It's clear that the dress means more than the relationship.  But I only give one chance and then I am done.", "OP was a massive asshole to themselves for paying for that dress.", "And out of all the drinks to have around her dress she was fine with him drinking wine around her wedding dress!!!", "Just hopping on the top comment: the brother should have filed a claim with homeowners/renters insurance. That’s what it’s there for.", "Someone who has made a shrine to their wedding. There are people who consider their wedding to be the best day of their life and think everyone else should care equally.", "I don’t remember the exact price of mine but I think it was under the 1k mark, it was however, purchased from a store that went out of business a week or two after I bought it. So it was irreplaceable (so glad we didn’t leave it there for alterations, the news interviewed ladies who were getting married and had no access to their dress because they’d left it to be altered). It was safely in a garment bag, in a closet at my moms house (fiancé and I lived together and I wanted it to be a surprise for him). Zero reason to put it on display for the whole family.", "reading the title i immediately thought, bah, its an open and shut case. OP YTA. but no\n\nOP, you should really stand up for yourself. you DID NOT STAIN IT. their kids stained it. NOT YOU", "At this point OP should just discount from the rest of the family until it reaches the value they paid now, on mothers birthday give a card saying that this would $50 if they had not forced them to pay for a dress they had no fault at it. On the nephews birthdays and x-mas do the same.And for wedding gift, do that to all relatives that forced them to give out the money until is paid out.", "_\"If your family loves you, they'd forget all about it and consider it a minor accident.\"_\n\nI think in this scenario, OP holds some accountability (but there is alot to go around). In her shoes, I would have offered a third or half of the money. It was an accident - yes. But, OP was still the one drinking wine near the dress and said wine still ended up on the dress. OP is putting all of the blame on the kid/the bride, but I think most of us would not be drinking wine near someone's wedding dress. \n\nEven if they love OP, that doesn't negate the fact that the dress was ruined and OP (at least partially) helped contribute to that. And, by the same token, if I love someone, I would try to make a situation right if I played some part in it.", "Your only mistake was not going scorched earth before giving them the money. Then blocking all parties", "Man I'm so angry you caved in and paid- ofc not at you but at your asshole brother and SIL, wtf?? Karma will get them good, and they're not even happy with the 1500 smh, I hope on her wedding day her kid runs into her and her dress gets ruined again lol.", "Find out what the wine was that you were drinking and send them a bottle of it every year on their anniversary. You are definitely NTA and I’d love to see people get stuck into your brother if he put a post up saying “AITA for forcing my sister to pay for damages on my fiancée’s wedding when it was clearly our own dumb fault”.", "You paid 1500 bucks to make assholes disappear - that's quite a bargain.", "Not only that but if OP was drinking wine there that means that brother and his fiancé served wine to guests in front of there wedding dress with children running around. So even there being something that really stains white fabric being out around the dress was also their fault.", "Why did I have to scroll so far for this?  \nAbsolutely set up, the kids happened to make wine go flying and it’s not on them?  \nThe dress hanging in the KITCHEN??  \nIt’s so clear they wanted a new dress and found a way to get it without paying. The one hanging was probably one from Wish for $7", "u/Jack1885 did they use the same or identical dress for the wedding? If it was a different dress then this is definitely the reasoning.", "That’s what I was thinking. She said she was showing the dress to the whole family - and that same whole family who witnessed the events first hand believe that OP was fully in the wrong? Thinking OP is leaving out some key info.\n\nEdit: especially since OP’s family is taking the side of the non blood related fiancé over OP. Just super fishy.", "Exactly.", "I have a kid with ADHD and one who is just kind of an asshole. They hit your arm when they're running, and shits gonna get flung.\n\n\nAlso the tone of this is probably impacted by the actual fleecing OP received. I'd kinda hate them too if it was me", "Seriously!", "This is what I think too, they wanted it to happen", "That's why I disagree with people saying it makes him TA but Im sure that at this point, OP also wishes he had just refused to pay since he ended up going NC anyway", "The audacity to drink wine in a kitchen", "Poopsenders.com", "Glitter bombs.", "I wouldn't feel bad for having a drink in the **kitchen**", "How? They’re telling her she should not have paid and the family was wrong. Why would this be OPs brother?", "The fuck are you on about? I literally said OP shouldn't have paid them anything. How could I be their brother?", "Did you even read the comment?", "My cousin’s wife kept it at his mom’s house, and she hid it in the closet so he wouldn’t be able to accidentally find it because they already lived together. We live next door, and my aunt and cousin's wife called  me, my mom, and my sister over to come look at it, after she dropped it off\n\nEdit: when originally writing this comment, I used Grammarly to fix it but did not proofread it after having Grammarly fix it. they lived together on purpose, but she didn’t want him finding the dress on accident", "Nobody except my mom and my maid of honor knew what my wedding dress looked like until I walked down the aisle.", "This has to be that, or it was a scam. Dress really \"cost\" $500 or $100 at the thrift store. They scam $2500 out of sister. Boom, she gets a free nicer dress. \n\nNO ONE hangs a wedding dress in the kitchen where people are cooking, drinking and kids are running around. NO ONE.", "Oh this one is EVIL. I wonder who they'd pin blame on next, without poor OP there to be the family punching bag! \n\nJK they'd still find a way to blame OP.", "That's a real /r/oddlyspecific comment lol", "Very very fine craft glitter. Like, the really powdery stuff. They will be properly fucked for the rest of eternity, they'd have to take the house down to the studs to get all of it out and even then it's not a guarantee. \n\nI know this for certain. I once threw my bestie a party with multiple bags of star confetti as part of the decor. I still occasionally find a little star, it's been fifteen years and four moves.", "Buy the brats glitter sand art kits and drums every Christmas.", "How does someone live together *\"accidentally*\"? \nLike oops, she tripped and herself and all her shit *accidentally landed in my place*, so we're just going to keep it here... Did they actually use that line with people? Did they actually think people bought it?!", "I almost choked🤣", "It's almost as if she wanted something to happen to it!", "NTA.\n\nThey were trying to make an accident happen so they can get their money back that they regret spending on the dress. \n\nAnd then magically they will have Oxiclean or a dry cleaner friend saves the day. So they get their dress for free.\n\nWhy display it in a kitchen around people drinking wine with kids around? Probably told the kid to bump you the way they don't blame him", "You should never have paid that. NTA. They are hypocrites for not taking responsibility for the part they played in the damage.", "YTA, this whole post has all sorts of shade in it and I'd imagine we'd get a wildly different story from your brother.", "Hopping on to say - OP the lace and fabrics in the soiled dress are still valuable. I bought lace ti have my wedding dress made and French lace for instance is valuable. If you paid for the entirety of a new dress, you should get the old one so you can sell it", "I'm tempted to say the $1500 was worth it for getting them out of your life. NTA, OP, and I'm sorry your family suck.", "The only way he could mend that fence is to give you $1500+ all the groveling", "“My brother tried to call me and reconcile, but I refused”. “I won’t ever talk to him or his wife.” \n\nMy man. You *do* hold grudges. Like a pro. \n\nI don’t *blame* you, but be real with yourself. \n\nNTA", "$1,500 is still $1,500 too much. It's really messed up that your family is ganging up on you when your brother and SIL are 100% to blame. Do not give them another chance, they have scammed you and continue to disrespect you for something they have done. Don't reconnect with them and any family that is on their side. They don't give a shit about you and you do not need to have them in your life. They showed you who they are, 100% AH. Good riddance!", "Send them a glitter b*mb in the mail. Let those evil knuckleheads live in glittery hell.", "Ok, I commented before. However, the more I think about it…is there any chance that maybe SHE soiled the dress somehow PRIOR to it being displayed in the kitchen. Was she HOPING someone else could take the blame?? Makes you wonder! I just can’t for the life of me come to any other reasonable reason to bring out your fucking wedding dress before the wedding?!?! Seriously? Who does that?", "your in the best position now.  You paid 1500 to find out how much your family will bullshit you.  \n\nI would calmly tell them your paid 1500 to clean up the mess the kids made, not go to the wedding and cut everyone out. \n\nIts understandable that people would be upset but to hound you and harass and turn family against you shows you theyre all assholes.", "Will you maybe send this post to them in some way? I feel like they should know their actions are unacceptable.", "Forgiveness does not equal forgetting. You have forgiven, but are smart enough to remember for self preservation. I’m still confused as to why she put a white dress out around red wine (I’m assuming it’s red).", "Please don't take this as me trying to attack you OP, but some of your statements like, \"I don't hold grudges,\" \"I forgive [my brother],\" and, \"It's in the past, I'm happy now,\" aren't totally adding up to me given the situation. The fact that you've gone no contact with so much (all?) of your family over this, even the fact that you brought it up here after it was \"resolved,\" and there are hints in your writing this happened a significant time ago, indicate that it's maybe more painful than you've let on. Maybe do some reflection on how this is affecting you and think about if a professional could help you work through some of your feelings about being singled out by family to the point that it's caused this level of disruption. \n\nBest of luck to you! Sounds like a very difficult position to be in.", "Yea she told her kid to run around and knock OP over for sure. What a vile woman", "Yeah the whole thing smells either fake or an intentional act.", "I'm under the impression that English isn't OP's first language.", "And definitely no gift - ever!", "She orchestrated an accident to happen so she gets her money back for the dress she regrets spending so much on. I'll bet a friend who is a dry cleaner will come in the save the day too after she paid.", "Have the purple juice come with a little baggy of matching purple glitter.  Today's glitter is superfine plastic and you cannot get rid of it!", "Hah absolutely true, but it’s one of those moments of clarity that just don’t come free without some form of guilt.", "Seriously! What stupid idiot brings their wedding dress into a kitchen where wine is being drank and children are allowed to behave like animals? Oh, wait! The kind of idiot that blames and verbally assaults an innocent bystander.\n\nGlad Op cut these people off. They’re the kind of stupid that makes me wonder how we have come so far as a species…", "iirc there is a company who you can have a glitter “bomb” sent to people", "I think they mean \"find it accidentally, because they already lived together.\"\n\nBut I love the idea of a couple living together accidentally. Like one evening the door got stuck and he just couldn't leave.", "I thought the same thing and had to ponder it for a minute 😆 \n\nNow I'm thinking it's a syntax issue and they meant, \"so he wouldn't see it accidentally, because they already lived together.\" I'm very curious to know which it is!", "My MIL worked at a dry cleaner for about 15 years and she told me that with the Wedding Dresses they got in to clean, (even ones with sequins or other embellishments) regardless of the fabric, they turned them inside out and ran them through a regular washing mashine on delicate. Then line dried and steamed them.", "Technically my Husbunny and I lived together for 10 years \"accidentally\". My apartment lease was up and we were 4 months from the wedding so I moved into what's now our house and lived in a separate bedroom. Then stuff happened and the wedding was called off. I had quit my job and had no income so we just went with status quo while i was job hunting. Then I was dx'd with uterine cancer, still no job so I took over the housework in exchange for room and board. We finally married 3 years after my treatment and, 15 years later, we're more in love than ever.", "I laughed so loud on that last sentence I woke my husband up. OP is NTA btw lol", "they lived together on purpose, but she didn’t want him finding the dress on accident. After typing the original comment I used Grammarly to fix it but did not proofread it after having Grammarly fix it.", "They lived together on purpose but she didn’t want him to find the dress on accident", "Yep. My Mom makes gowns for stillborn babies and infants out of donated wedding gowns. This is exactly what she does to wash the dresses before cutting and sewing.", "I love this! So glad your treatment was a success, and I wish you many more years of happiness together.", "Thank you! 😊 I'm 17 years post-treatment and my oncologist told me the surgeon, after she opened me up, \"she won't see 40\" (it was my 36th birthday) Well, I'll be 54 this October. 😁"]}