{"id": 18720, "submission_id": "13xlke9", "title": "AITA for Refusing to Have a Hospital Wedding for my Brides Dying Mother?", "selftext": "So I(31M) am engaged to the love of my life(33F) we met in college and started dating 6 years ago. I proposed to her about 5 months ago. We have the wedding planned for early September. We’ve basically planned everything out by now and payed for a lot of things.\n\nMy fiancé has never had a good relationship with her mother. Her moms very racist to me and cut her off after she introduced us. She hadn’t spoken to her mom in nearly 6 years until she found out from an aunt that her mom was in multi organ failure(from drug and alcohol addiction) she isn’t eligible for any transplants but can’t leave the hospital. She’s on like a hospice care plan in the hospital. My fiancé  has been spending more time with her and since she’s heavily sedated she’s calmer and nicer than usual.\n\nMy fiancé is now saying that she doesn’t want to get married without her mom and she saw some clips of hospital weddings online. She really wants us to get married inside her moms hospital room. Her mom will still barely talk to me and there’s no way she’d be okay with the Hindu preist we’ve hired.\n\nAlso, we were both so excited for this wedding. My family has always treated her well and Indian weddings are very traditional and important. My mom and her planned this whole wedding together(and my mom helped pay) and although she’d probably understand, I don’t want to just cancel the wedding on her. And most of the things we’ve purchased are non refundable.\n\nI’ve said to my fiancé that I think it’s a bad idea, maybe we could have a ceremony in her room or something like that but still also have the wedding. But she says she doesn’t want her mother to die before she’s married and she wants her mom to really be there to make up for lost time. I feel like she’s not thinking clearly because of how much she’s grieving right now and she’ll regret it later. Also her mom said that if we do get married in her room my 8YO daughter can’t be there (because she’s half black)\n\nI just don’t want to give up my whole wedding with my family for someone who wasn’t even going to be invited. I’m still willing to compromise but I feel like an AH for not just doing it since she’s going through so much. So AITA here?", "created_utc": 1685635623, "permalink": "/r/AmItheAsshole/comments/13xlke9/aita_for_refusing_to_have_a_hospital_wedding_for/", "score": 763, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I could be TA because my fiancés mother is dying and she wants to see her daughter get married before she passes but I still want to have a real wedding.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. Exclude your daughter? Your fiance is delusional to even request this.", ">Also her mom said that if we do get married in her room my 8YO daughter can’t be there (because she’s half black)\n\nNTA. That's just...wow. I don't care if she's dying that's despicable.\n\nYour wife is clearly grieving and your solution to have a small ceremony in the hospital room is completely appropriate (in addition to the big family ceremony).  If your wife is okay with not allowing your daughter to be there that's a whole other problem. A big one.\n\nI know she's trying to appease her mother but she's doing so at the expense of your daughter. She's not thinking how this one act will effect your daughter now and in the future. This is not okay. I really hope she is able to see clearly how wrong this is.\n\nIt's not just your wife's wedding, it is yours also. You shouldn't have to give up everything, you can do both. I would definitely force the issue with the hospital room ceremony though - if daughter can't be there then it's an absolute no.", "NTA\n\nThankfully, this is one of those problems where you can just procrastinate and it will solve itself.", "NTA:  I'm never one to say end a relationship but seriously consider if this would be the only time she would just want to deal with being discriminated against. Not only yourself but your daughter, she is saying her racist mother has more of a right to be at the wedding than your child.", "I'm sure your fiancée is going through a lot right now. That said, she's asking you to have a ceremony with her racist mom and have it supersede the one you had planned. That's really not cool. NTA", "NTA, specifically because of the racism and that even in her calmer, nicer, sedated state your fiancee's mother is still a racist jerk. \n\nI do feel for your fiancee though and understand her position *to an extent*. She's trying to make the most of the time she has left with her mother, and is probably already grieving. ASIDE from the racism (lol but who can put racism aside?), doing this would not mean you need to cancel the wedding you've already planned. This would more akin, perhaps, to a small ceremony relating to the marriage license as some people do at town hall, before the 'big' event. Still though, I think your fiancee will have to sadly accept that despite her strongest wishes, her mother is VERY unaccepting of you, and it's not practical, reasonable, or fair for her to expect you to participate in that.", "You could have a commitment ceremony at the hospital? Its a reasonable compromise IMO because its words without the music and should fulfill your GF's desires to reach out to her mom?\n\nNTA. I would never look at that woman again. Being near horrible people and bending the knee to them never makes them better people. The woman will die as she has a lived - a racist, nasty woman.", "NTA. Exclude your daughter? Your fiance is delusional to even request this.", "**NTA**. It is unfortunate that her mother is dieing, but that doesn't mean your fiancee has the final say on the wedding. You have provided more than enough reasons as to why you don't want to bend over backwards for this woman. The wedding should be about what both of you want - there needs to be compromise.", "NTA.\n\nI think that if after a serious talk, your fiancée still wants this plan...\nHer awful, racist mother, accidentally did you a favour. \n\nA cancelled wedding is easier and cheaper than a divorce, and permanent damage to your mixed race child.\n\nI'd be worried that she's a closet racist, and her estrangement from her mother was causing her to be nice out of spite. ** my mum is racist trash, so I'll be in a mixed relationship, with a mixed race step daughter, to show I'm NOT LIKE HER!!**\n\nI hope that it's just her flailing around in grief, but it deeply concerns me.", "NTA, I get maybe you could factor a few hours into your day to visit her and have some\nBlessing whilst she’s present but your NTA.\n\nIt’s your wedding too, one of the biggest days of your live and practically as you said you’ve already forked out for it. \n\nYeah I could go on but your been reasonable", "NTA I felt some empathy for your s/o until I read the part about your daughter being excluded because of HER SKIN COLOR?!?!?!?! \n\nIf this is important to your fiance then doing a fake wedding ceremony or an additional party in the hospital is fine. It sounds like she has a complicated relationship with her sorry excuse for a mother. It's still her mother and it can be difficult to navigate feelings like this at milestone events.\n\nBut canceling your actual wedding and EXCLUDING your daughter shouldn't even be an _option_. I am appalled that your s/o would even _entertain_ excluding her. This wedding isn't just about you and your s/o- your daughter is too. Yall are becoming a _family_ and the big wedding you're planning is to celebrate that. \n\nTalking as a step parent please for the love of all things holy _do not marry this woman if she thinks it's okay to exclude your daughter BECAUSE OF HER SKIN COLOR_. \n\nYou and your daughter deserve more. I hope your S/O comes to her senses.", "NTA! I am not understanding why your fiance is against your offer of having a ceremony in the hospital and a real wedding. Why should all wedding activities solely be focused on one woman, and everyone else who is effected by the marriage be ignored---particularly for a  woman who has treated you badly (and has treated her daughter badly as well)?\n\nI don't like ultimatums in general. But when I got to the lines where you say that if you do a marriage in the hospital you can not have a Hindu priest and worse, that your daughter will be excluded you need to take a stand. If your fiance is okay with her mother including those conditions then maybe it's time to put the wedding on hold in favor of doing some serious couples counseling.\n\nGood luck and let us know how it goes.", "NTA.  This is rough.  She's torn between the new feeling of being connected to her mother on a more normal level (probably for the first time in her life), knowing their time is very limited and wanting to include her in her wedding before she dies.  Can you have two ceremonies, one in her hospital room with very very limited attendees and your traditional wedding?", "NTA.\n\nDoesn't sound like the wife is thinking correctly. She could be dealing with a tremendous amount of guilt, even if it isn't warranted. Your offer of a bedside ceremony and still having your planned wedding in September was a completely fair, even an exceedingly generous, compromise, especially considering you'd be going to this extra effort to accommodate someone who has been openly bigoted to you *and* your child.\n\nI strongly suggest therapy for your wife. As soon as possible. Grief can start well before a death actually occurs. And considering the history, your wife is probably going through things she can't even grasp at the moment.", "NTA \nShe doesn't respects you and is racist about you and your daughter\nYour fiance should also consider her choices tbh she is just going through the pool of emotions NGL she is acting bit impulsive", ">I just don’t want to give up my whole wedding with my family for someone who wasn’t even going to be invited\n\nThen don't.  Have the wedding as originally planned and do a small ceremony for your future MIL.  Or, just put off the wedding until after her passing.  NTA to not want a Hospital wedding for someone that treated your SO like crap her whole life.", "NTA, it's not just being racist to you, but for your daughter. That's hurtful that your fiance would even consider excluding her in that way.", "You don’t have to give up the whole wedding, you can get married in the hospital room and still have the big wedding. \n\nOverall you’re NTA because of the feelings you have towards your dying MIL. But, I honestly don’t see your marriage lasting. It seems like this is important to your fiancée and her grieving process. She is going to end up regretting not getting married with her dying mother and she will resent you for it.", "NTA. You’ve given her a compromise and that isn’t enough for her. You have legitimate reasons to not want to do this, not only because her mother is insanely racist, but you have specific cultural practices you want to experience in your wedding! Something a lot of people only experience once.", "NTA and the like that really sticks out to me is “my daughter wouldn’t be allowed in the room because she is half black”\n\nAt this point it’s a very easy solution. Tell your partner there’s no way in hell you’re getting married without your daughter’s presence, and that you think it’s best to postpone the wedding, potentially indefinitely if your partner won’t stick up for your daughter", "YTA for marrying someone so disrespectful and awful.  You have a child to protect from people like her.", "*<I feel like she’s not thinking clearly because of how much she’s grieving right now and she’ll regret it later.>* \n\nYou're probably dead right.\n\n<*Also her mom said that if we do get married in her room my 8YO daughter can’t be there (because she’s half black)>*\n\nDoes your fiancé really want to get married WITHOUT your daughter / her future STEPDAUGHTER present?\n\nYour fiancé is under a lot of mental stress, about to lose her mother, no matter how shitty a person she is/was. She wants to do the right thing, as she can't get a do-over if she made the wrong decision. And that will cause her to live with guilt. Which makes her very vulnerable to let her mother talk her into this hospital-wedding.\n\nIt might help her to talk with a professional about this situation who can make her see what SHE really wants.\n\nNAH", "NTA. Exclude your daughter? Your fiance is delusional to even request this.", "NTA you’re right in that she’s probably grieving and she has my condolences because this is all around a shitty situation and very hurtful. But your daughter can’t be there, you would lose a lot of money, your mom poured a lot of effort into this as well as you and her did and you don’t like the mother (understandably) and she despises you. \nYou offered a very nice compromise with the ceremony and she declined that. You need to talk this out with her in a calm minute and should really stand up for yourself for the reasons I named above. It is also your wedding and it sucks that she would let a racist person dictate it rather than her fiancé.", "NTA\n\nIt seems like your suggestion of having a ceremony at the hospital then still having the real wedding as planned would solve everyone's problems.  Why does she not want to just do both?", "NTA, I think the middle ground approach of having a small ceremony in the hospital room and  then having the actual planned wedding is the best option.", "NTA. And right now your fiancee sucks, but it seems like she sucks because she’s going through it and the grief is making her really stupid and really selfish (unless you’ve noticed issues with racism in the past?).\nIt’s a really rough position for your fiancée to be in, but it’s also incredibly rough for you having to deal with racist family. If you’re willing to do it, i think a compromise in this instance would be a generous and kind thing for you to do (going ahead with your planned wedding and having a ceremony and celebration at the hospital too, maybe even having the hospital ceremony first to appease her) - provided that your daughter is not only allowed to be present but also made to feel welcome by your fiancées mother. That has to be a non-negotiable. But also, i don’t really think it’s necessary for you to compromise here if you don’t want to. ESH except you, and I think your fiancée and her mother are asking too much of you. Good luck.", "NTA- your fiancé willing to exclude your daughter from something as big as you getting married to\nappease her mother’s racism should be a wake up call to you.\n\nLet this be a blessing in disguise before you marry someone like this.\n\nShe’s showing you her true colors.\n\nHer mother is dying and knows dam well she’ll do anything to make her happy.\n\nThis is her mother’s last “Fuck You” to you . \n\nAnd your fiancé is fully on board with it.\n\nDon’t marry this girl OP.", "NTA\n\nFacts presented by you:\n\nYour fiancée's mother (FMIL) wants to exclude your daughter.  \nShe will most likely not be ok with the Hindu priest you've hired.\n\nQuestions:\n\nHow many people can be squished into her hospital room?  \nWho will celebrate, if FMIL doesn't accept the priest?   \nHow does she feel about your mother, OP? Or other family members of yours?\n\nBig Emergent Question:\n\nHow many people are you and your fiancée willing to cut off from your wedding to appease a dying racist bigot?", "NTA\n\n1. Your fiancé doesn’t have a great relationship with her mom to start with. Not exactly a dealbreaker but not great. \n\n2. Your fiancé’s mom is very racist. Imo - a potential dealbreaker.\n\n3. Your fiancé’s mom cut her off - kinda feel like this is similar to point 1.\n\n4. Your fiancé’s mom barely talks to you - possible dealbreaker- sure you could be civil for the remaining time left but is it really worth it?\n\n5. Your fiancé’s mom wouldn’t be okay w the Hindu priest - dealbreaker. You & your fiancé should be on a united team.\n\n6. Refundable - losing money isn’t great. Obviously, if it’s unavoidable, whatever. But I don’t see a reason why you can’t still have the Indian wedding even if you did decide to do a hospital wedding.\n\n7. Your 8-year old daughter is being actively excluded. Are you seriously going to let your fiancé exclude your child!? It’s one thing for you to choose to suck it up, deal w the racism and do a hospital ceremony but to subject your child to the blatant racism is another. \n\nYou seem willing to compromise (something that I don’t think I would even do considering the circumstances).\nYour fiancé seems to be willing to sacrifice everything to appease one women who clearly isn’t very pleasant. \n\nYou need to think hard about this decision and what this will entail for your marriage and relationship with your daughter.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSo I(31M) am engaged to the love of my life(33F) we met in college and started dating 6 years ago. I proposed to her about 5 months ago. We have the wedding planned for early September. We’ve basically planned everything out by now and payed for a lot of things.\n\nMy fiancé has never had a good relationship with her mother. Her moms very racist to me and cut her off after she introduced us. She hadn’t spoken to her mom in nearly 6 years until she found out from an aunt that her mom was in multi organ failure(from drug and alcohol addiction) she isn’t eligible for any transplants but can’t leave the hospital. She’s on like a hospice care plan in the hospital. My fiancé  has been spending more time with her and since she’s heavily sedated she’s calmer and nicer than usual.\n\nMy fiancé is now saying that she doesn’t want to get married without her mom and she saw some clips of hospital weddings online. She really wants us to get married inside her moms hospital room. Her mom will still barely talk to me and there’s no way she’d be okay with the Hindu preist we’ve hired.\n\nAlso, we were both so excited for this wedding. My family has always treated her well and Indian weddings are very traditional and important. My mom and her planned this whole wedding together(and my mom helped pay) and although she’d probably understand, I don’t want to just cancel the wedding on her. And most of the things we’ve purchased are non refundable.\n\nI’ve said to my fiancé that I think it’s a bad idea, maybe we could have a ceremony in her room or something like that but still also have the wedding. But she says she doesn’t want her mother to die before she’s married and she wants her mom to really be there to make up for lost time. I feel like she’s not thinking clearly because of how much she’s grieving right now and she’ll regret it later. Also her mom said that if we do get married in her room my 8YO daughter can’t be there (because she’s half black)\n\nI just don’t want to give up my whole wedding with my family for someone who wasn’t even going to be invited. I’m still willing to compromise but I feel like an AH for not just doing it since she’s going through so much. So AITA here?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "I don't think you're the asshole, but it seems to me, you should do both.  Have your traditional wedding, and have a second ceremony in the hospital.  I get that the mother is a racist ass, but she's also your fiance's dying mother.   I don't think you want to punish your fiance for the crimes of her mother.    If the mother doesn't want the daughter there, too bad, she can get over it.", "NTA\n\nwhile i understand it's her mother and she is grieving, the woman has done nothing for you guys and wasnt even going to be invited due to multiple reasons. \n\nperhaps you can livestream the ceremony for her mother. it's unfair for you to sacrifice what you want regarding your wedding for her mother, and the fact that it's potentially even being considered to leave your daughter out because of her racism is ridiculous.", "NTA\n\nIt’s your wedding too. Is there a compromise? Maybe a different ceremony or blessing that happens prior to the wedding? \n\nBottom line, if you choose not to get married at the hospital, she will never have a wedding with her mother. It’s not like she’s going to find someone else in the next few weeks to marry.   \n\n\nBoth of you will have to decide which sacrifices to makes for the marriage to work; the wedding is only one day.", "You're right that she is grieving and not thinking clearly. But your compromise is perfectly reasonable: have a small ceremony in her mom's room, but still have the originally-planned wedding of your dreams. \n\nMy answer would be different if MIL weren't racist and anti-Hinduism. But MIL doesn't want to celebrate YOU and your wedding anyway. I don't even know if MIL wants to have the small ceremony so much as your fiancee wants to have her mum there. \n\nYour daughter deserves to be at the wedding more than your future MIL does, so if it's picking between them, choose your child.\n\nNTA.", "INFO: why would you have to cancel everything? Can't you do a small Civil thing at the hospital now and also do the big wedding that was planned?", "NAH, except the mother for the racism. Under normal circumstances I’d call your fiancé TA for not calling her mom out on not allowing your daughter there (because truly, that was absolutely awful), but grief makes us not see clearly.\n\nYou’re not obligated to have a wedding in a hospital with a racist dying woman, and you shouldn’t have a wedding without your daughter there. That’s not a good way to start your lives together.\n\nBut your fiancé is grieving and probably panicking a little because she has no time to think things through right now, so she may need grace if she’s not thinking clearly.\n\nI’d suggest talking with her specifically about your daughter, and the fact that you understand her wanting to honor her mom’s wishes because family is important, but you two are starting a family together and it wouldn’t be right to do it without your daughter.\n\nI’d also suggest maybe compromising on something like just spending more time with her awful mom for her sake.\n\nFinally, just prepare yourself for the fact that the next few months might be rough, and build a support system for yourself. Losing a parent is rough, and living with someone dealing with that kind of grief is rough. It can be impractical and mean and the emotions can be hard to control, and support people need support sometimes too.\n\nSorry to you both that you’re going through this.", "I will likely get downvoted for this, but NTA.\n\nShe's asking for a huge change, to include someone who disrespected you and your relationship. Yes it is her mom, but changing the wedding plans last minute,  would be insulting to *your* mother, as she helped plan the whole wedding and already paid for non-refundable things. \n\nI think the best way to make everyone happy is do a ceremony in the hospital separate from the traditional Indian wedding you already have planned. Your fiance has to consider how this affects everyone else aside from her mom. \n\nYou're willing to compromise. She should too.", "YTA fire going on and on about your mom and wedding, and barely mentioning that your fiance is exciting your half-black daughter.  Zip up your pants, and move along. ANY person putting a mixed race child in that position showing be in they child's life. Your didn't mention how YOUR OWN CHILD feels about this. Bet you didn't mention it to her, because you are worried about a one day party, and comforting your fiance.  How could you even consider any of this?", "[deleted]", "NAH and of course your fiance isn't thinking clearly right now. That's okay. \n\nYou can have a tiny ceremony in the hospital room and not even tell anyone else, much less have to invite them. Think of it as a commitment ceremony, no marriage license needed. It would be for your fiance's peace of mind, not her mother's. That day would not be your anniversary. \n\nThen, enjoy your big, awesome Indian wedding on the fall, without her mother casting a shadow over it. If this is a compromise you can both agree to, everyone gets what they need.", "YTA. You have no compassion for your fiancee or her situation, just want to stick it to her mom or pander to your family's desires for a big, showy Hindu wedding.\n\nI hope she rethink this marriage to you.", "NTA", "NTA \nBut I don't understand why a small ceremony with just the two of you  at the hospital (I wouldn't take an 8yo to that place even if she were welcome) would mean you have to cancel the wedding planned for September. \nThe mother deserves nothing from you and certainly not to be included in your life, but if it would make your fiance happy, I'd consider agreeing to her request (as long as it doesn't come instead of the real wedding). I mean,  the mother will be dead soon. Your fiance will be your wife hopefully forever. Do you really want her to resent you for this for the rest of your life together?", "NTA", "NTA, a couple of alternatives are \none) you could have a live feed of the ceremony for the mother to view, \ntwo) you could have an officiant “Marry“ you and your fiancé in your mom’s room,\n three) you could hire a nurse to package up her mom and put her in a wheelchair and bring her to the ceremony unless you think she won’t make it that long. \nEven though the mother sounds like a rotten person, she’s still the mother and your fiancé is dealing with the feelings of loss which can be complicated. I don’t think you should cancel your big wedding, but there must be some compromise that can be reached", "Yikes this is a rough situation. I think your theory about your fiancée's grief is right and that's why she's pushing the issue. You offered a good compromise and she turned it down. Also all the stuff you said about her mom being racist and awful would put me off to ever wanting to see her whether she's dying or not. Honestly NAH, but you guys needs to figure this out somehow or it might blow up the whole marriage. Good luck", "NTA if her racist mother is more important to her than you then you have your answer.", "NTA I would tell her the wedding is on hold until she decides if she wants to comfort a racist or get married. You cannot have a ceremony without your daughter that is so messed up and would make you a massive ah.", "The nail in the NTA coffin was the child. Until the child came up, an argument could be made that getting married in the hospital room would be a gift for your wife, not for her mother. Once it excluded your child, that was irretrievable.", "Absolutely NTA! I hope she not thinking clearly because you’ve got major problems if she thinks it’s okay to exclude your daughter to please her nasty racist mother! \n\nIt’s outrageous for her to even contemplate this let alone push for it to happen. Not to mention hugely disrespectful to you and your family. \nYou’ve got some serious thinking to do!", "NTA the fact she doesn’t want your daughter there is enough for me to agree 100 percent with you.", "NTA. Maybe you can sway your fiancé by saying it would be a bad omen to do this in the hospital. If not just it give it space. Your fiancé is obviously going through a lot with the wedding planning and this family issue. This cannot be what she really wants and must be a need to make amends with mom.", "NTA. Your future MIL is not a nice person and on her deathbed is still trying to dictate her daughter's life. \n\nFrom your comments,  it doesn't sound like they have ever been close or had a good relationship. Likely your bride-to-be is grieving the relationship she never had (and never will).", "NTA. I think you and your wife should talk to a therapist or a grief counselor. This is a really complicated situation and I bet she’s experiencing all kinds of strong, conflicting emotions about her mother and their relationship and the relationship she wishes they’d had. Your wedding and your marriage have unfortunately gotten tangled up in that. \n\nIt’s perfectly understandable that you wouldn’t want to give up celebrating with your family to have a hospital room wedding for a woman who doesn’t accept you or your child. But if you refuse and her mother dies and doesn’t get to see her married and she hasn’t had someone to help her process it all, she might take out some of that grief and guilt on you. I think having a professional, neutral party to help you both work through it would be really helpful.", "NTA \n\nTell her if you guys don’t have the wedding you planned, there won’t be one. Your daughter not being allowed because she’s half black?? WTAF is wrong with your fiancée? We need to make up for lost time by being with her as much as possible, so she can emotionally abuse us until she dies. Jfc!", "NTA. I feel sorry for your fiancé but this is insane. Forbid your CHILD from the ceremony? I would refuse under any circumstances. May she burn in hell.", "NTA. You haven't interfered with her spending these last days with her mother, despite the mother continuing to be a racist asshole. You have simply drawn the line at catering to the racist yourself. That's fair.\n\nBut I think you really need to think harder about whether this is the person to spend the rest of your life with, and force your child to spend years with. Someone who is willing to indulge the remainder of her childhood with. Someone who is willing to indulge a racist? Someone who is willing to exclude her future stepdaughter who is a WoC? That's your Ms. Right?\n\nI think she has revealed something important about herself, and it would be imprudent to sweep this new knowledge under the carpet. The wedding is where the three of you become one family. It should be beyond unthinkable to exclude your daughter from it. If your financee is willing to throw your daughter under the bus on such an important day, don't you think she'll be untroubled about doing it again in the future?  This isn't about where a wedding is held, it's about what kind of person your financee is when push comes to shove. You deserve better. Your daughter deserves better.", "Hold on\nYour fiancé is okay with excluding your daughter to appease her racist mother ? And you still want to marry her?\nGrief or no grief, that is unacceptable that your wife is willing to do that. I would let your daughter or yourself in her moms presence. Your fiancé is deluded. So how is she going to treat your daughter in the future when she wants to appease a racist person at the detriment of your poor daughter.\nNta but I would reconsider this marriage and a hard no on getting married for your wife’s racist mom. Its a hill to die on", "NTA. Tell her its the original planned wedding or no wedding at all. You should not be forced to cater to a racist regardless of extenuating circumstances.", "Nta. If people can't come cause they are half black would be a big hell no to me. She cut her off cause she's racist and now she's making demands? Sorry but you're are getting married too, you have a say.", "NTA. The mum is racist and unkind, your wife is grieving but it’s madness to indulge this", "Your child can't be there because she's half black...and your fiancee is okay with that.... \nI get that this is a hard and difficult time for her, but wow! Okay... I have nothing, sorry. \n\nNTA", "Nta so racist grandma doesn't want fiancé's soon to be child there and that's not enough to wake her up?\n\nAt the *very* most, and I mean it as a 'I am doing this favor for you bc dieing or not your mother is an absolute ahole' you could have a second western style ceremony there.", "NTA. What a shitshow.", "NTA- because -\n\"Also her mom said that if we do get married in her room my 8YO daughter can’t be there (because she’s half black)\"\n\nYour daughter not being there isn't optional", "NTA\nShe is grieving \nIt's really sad hw your wedding has been planned by her and your mum, her own mum not involved.\n\nShe's going to lose her mum. And she is going to lose any hope of having the mother daughter relationship she wants - that's likely what she is trying to salvage a piece of now, because soon there will never be a chance of repairing it.", "NTA\n\n&#x200B;\n\nYou are fine to refuse.", "NTA.  For the racism alone.  Excluding your daughter -- again racism.  A wedding is about both parties. the compromise of a ceremony in the room and then going forward with your wedding is the best idea, honestly.", "NTA. Seriously? She’s on her death bed & still trying to be racist & exclude your kid? Honestly, if your fiancé can’t understand why you’re not up for that, I wouldn’t marry her.", "I don’t feel like I can judge this…… but I will say this: even if you officially marry in the hospital room, it doesn’t mean you can’t have the wedding… my fiancé and I are getting married in 3 months, we’ll be traveling across the country to get married in my Home state. His grandfather is unable to travel because of his health. So we got “married” in his living room, so that he could be there. Granted the official/legal wedding isn’t for three months, but his grandfather got see him get “married”. And that’s all that mattered. There are ways to accommodate your situation if you want to.. although I totally get it if you don’t want to, she’s racist, and she brought your child into it… that’s messed up. Good luck is all i can say.", "NTA But you will be the asshole if you go through with this marriage!\n\nYour daughter is half-black, how do you expect a women who is currently comfortable with her being discriminating against because of the colour of her skin, to love and support her through the discrimination & racism that she will surley face?!\n\nHow do you expect your soon-to-be wife to do the same for you?!", "Nta I'd do both a ceremony with her mother. But keep your wedding your traditions are a part of you and I wouldn't give that up", "NTA\n\nSooo let me get this straight… you fiancé is okay canceling your planned wedding, and excluding you daughter so you can have the ceremony in her racist mom’s hospital room??\n\nHard pass.\n\nEverything else aside, I can’t imagine being with anybody who would find it appropriate to exclude your child from your wedding.\n\nThere are no circumstances where that is OK. \n\nAre you sure she’s the one for you?", "INFO: why can’t you do both? Why can’t you have something small at the hospital and still continue with the 1-3 day Hindu wedding?", "NTA", "INFO:  Why does she think her racist mom wants to be witness to a marriage she doesn't approve of?  What about when racist mom says something shitty and racist during the hospital wedding?", "NAH\n\nDo a zoom wedding. And on your way out of the ballroom, stop by the hospital so she can see you all dressed up. That's more than enough accommodation for a woman who refuses for your kid to be there because of her race.", "NTA. with the comment about your daughter, your  future MIL seems to be getting what’s deserved. bigots can get fucked. don’t let her ruin you special day", "NTA. Would your fiancé be open to have a non-denominational ceremony at the hospital with her mom there and you guys still have the planned wedding. While it really sucks about the racist mom, I understand your fiancé connecting with mom while she’s palliative. I’m also brown, so I completely understand your reluctance to cater to the racist mom. Would you consider doing it for your fiancé? Having 2 weddings would help your fiancé deal with her grief. The mother clearly sucks as a human being, but she’s still her mother and death changes things.\n\nEdited to add: I just read the thing about your kid. I take back my advice. In that case, f*** the racist mom. Death can’t come soon enough and I would  reconsider the fiancé as well to entertain sick bullsh** from the mother, even if she is dying. F that lady.", "[removed]", "Out for blood 💀", "[removed]", "And reassess the marriage.", "Underrated comment", "As much as this is true, this is a period of grieving for the fiancé. While this may show somewhat concerning tendencies, it is unreasonable to end a relationship based on someone’s actions during such grieving. The part where it becomes “end the relationship” is if she will not back down and refuses to do anything else. It is a very tough situation and I really hope everything works out for both OP and the fiancé. NTA, obviously", "At that point I’d tell my partner “I’m getting cold feet about the whole wedding because of this, I think we should postpone everything until this issue is resolved”", "That would be a perfect solution if it wasn’t for the fact the mother is so racist she want to leave out op’s daughter.\n\nI would not compromise leaving out a child because you don’t like their skin color is beyond disgusting. The fact op’s fiancé is agreeing would be enough for me to rethink this whole relationship.\n\nBeing on your death bed does not give you a pass for being racist toward anyone.", "I know the type and she’s not like that. She didn’t even really know her mom was racist, she has to live with her dad full time after age 7, she knew her mom was very conservative but not the full extent until she introduced us in her 20’s.", "I also cant blame you for not wanting to have a woman who is horrible to you to, hijack your wedding.", "The mother will not allow his child in the room because of her skin color. \n\nThis is one time op needs to stand his ground.", "Honestly, I'm don't think he should marry someone who is okay with people being virulently racist towards her own stepdaughter.", "Because the 8 year old will eventually ask why she isn't in the pictures and eventually will piece it all together.", "I may sound like a jerk, but I don't think the fiancée deserves grace. \n\nIf my partner were to ask me to have my wedding day be all about someone who doesn't see me as a real human being because of their racist beliefs I would question my partner love for me. Because it is also my wedding and they think it's ok to ask me to fake a smile to benefit someone who hates me. And let's throw in they also request my daughter get banned from the wedding. \n\nShe may be grieving but her reaction is one of putting a racist on a pedestal", "Sorry, but if asked you to ubject yourself to racism and allow your daughter to be banned from your wedding because she's black that person is an asshole because they're allowing and rewarding racism", "Oh really? So it’s okay to cater to a racist who still makes it obvious she doesn’t like OP? And exclude his CHILD from the wedding because mom is a racist? Absolutely not.", "That's the laziest bot yet. Lord there's a ton of them out today.", ">That's hurtful that your fiance would even consider excluding her in that way.\n\nThat shows that she doesn't care that she is excluding her future step-daughter. Very bad way to start a life together. I'd consider postponing the wedding till after your fiance has been to intense therapy.", "There are limits to how much grace someone gets for grieving and I wouldn't blame anyone for whom this is beyond those limits.", "yeah, i think she is not herself right now. nta.", "Agreed.", "SHE KNOWS NOW. Her unwillingness to confront it even to protect a child makes your fiancé a racist.", "She wanted to exclude your daughter based on the color of her skin. This is the stepmom you want for your kids? Wake up dude.", "u/Dear-specific1248\n\nThe fact that your future wife, your partner, wants to exclude your daughter due to her RACIST mother to appease her, should speak VOLUMES of what is in store for their relationship for years to come. DO NOT MARRY THIS WOMAN. YTA to your own daughter if you do.", "I agree 100 percent with you. The fact is the fiancé is going to be this little girls stepmom. How does op trust her to do what is right for his daughter if she can’t see how wrong her mom is now.\n\nBeing on your death bed does not give you a pass to be racist. Grief does not give you a pass to let your mother be racist to the person your suppose to love forever and his child that you are agreeing to help raise.", "She is putting a racist on a pedestal, and under any other circumstances that would be a dealbreaker for me. But grieving a parent isn’t logical and she probably isn’t thinking clearly.\n\nShe can love her partner and abhor racism and still be upset that her mom is dying. Life isn’t always black and white, and grief can turn things very gray.", "[deleted]", "Again, OP lacks compassion toward fiancee situation and wants the big Hindu wedding, not something that would include his MIL. \n\nHe really needed to end the relationship when he learned her mother was racist; this isn't going to be a good marriage if he gets what he wants and fiancee gets nothing. \n\nHaving a blessing in the hospital is different than a wedding, which is what he wants.", "My fiancé didn’t but her mom did. My fiancé is kinda ignoring the things she said because she’s being nicer than she used to be.", "That's not why I think she's an asshole. \n\nI think she's an asshole because she's asking her fiancée to make his wedding about someone who hates him. Someone who think he's less than a human due to his race. I think she's an asshole because she tells him your daughter can't be in the wedding because my racist mom won't let her in the room. Just thinking that's ok and asking that makes her an asshole because she's literally defending racism", "OP also clearly states he wants his own child at the wedding. His child takes precedent over a woman who hates him and his child because of their skin colour.", "Nicer to who?  \n\n\nHer? Her and her alone.", "NONE OF THIS IS OK.", "[deleted]", "Yes, I saw that but I think the greater issue is his fiancée relationship with her mother, who is dying, who she won't get another chance to see.\n\nThere's nothing to stop them telling the mother that the hospital wedding proceeds only with the daughter present; OP doesn't want the wedding at the hospital either way. He wants the big Hindu wedding no matter what.", "I'll just ask this, so because the fiance mom is dying she's is justified in asking OP daughter not to be in the wedding because she's half black? \n\nBecause that's what she's doing. She didn't tell get mom no his daughter has to be there. She doubled down and said she wants her mom at her wedding at all cost, even if that means discriminating against a child. \n\nI get she's grieving but that's not ok.", "He offered to have a ceremony in the hospital and have a second wedding too so that they both get what they want. Fiancé said no.", "[deleted]", "But not the wedding. She wants to get married with her mom present. He's willing to do a ceremony but not the actual wedding, which is what she wants. He wants thr big Hindu wedding", "Could because I'm black but to me yea the conversation is over", "But a compromise could be made. Fiancé wants no compromise. She wants him to leave his daughter out and get nothing he wants from the wedding. That’s not fair or right. Again, for a woman who hates him and fiancé had no relationship with for the last 6 years.", "He's just as bad though. Fiancée mom is dying and won't be there for any other event.\n\nBut he wants her not to have her mom at her wedding. She can tell her mom that the child will be present or no hospital wedding; he doesn't want the wedding at the hospital either way, he's offering a ceremony but holding out for the big Hindu wedding. \n\nThis is complicated because of the lack of relationship and racism but it's her only opportunity to spend time with her mother; hospice care means she's dying soon.\n\nThey're best calling it off; Fiancée will remember not being able to have her mother at the wedding and OP already resents her involvement with her mother's end if life.", "\n>maybe we could have a ceremony in her room or something like that but still also have the wedding. But she says she doesn’t want her mother to die before she’s married and she wants her mom to really be there to make up for lost time.\n\nAre you sure she understood what you meant? Because the first \"solemnization\" could be the official ceremony, and the latter big party just a second celebration. All it takes is a marriage license and the right witnesses for your state's laws.", "[deleted]", "NAH\n\nYou shouldn't have to get married in your fiance's shitty mother's hospice room. It's an unreasonable expectation. But your fiance is dealing with some very heavy and very complex shit right now and making decisions based on unresolved trauma.\n\nGiven the situation, you might be TA if you don't recognize that you can't just separate what's happening in her life right now from your planned festivities. Do you want her to be partially present and trying to put on a good show for your family's sake on your wedding day, or can you pump the brakes and recognize that ignoring your fiance's immediate needs right now so you don't lose deposits isn't going to help her? \n\nEvaluate your priorities, identify what's actually most important to you (your partner's well-being, hopefully) and what's just very inconvenient (changing your plans, postponing the wedding?), and reconsider whether your wedding ceremony is the real issue here.", "NTA -Your fiancees racist mother wants to exclude your daughter. That alone should be a show-stopper.", "Oof. NTA. I mean, I understand she is struggling and grieving, but I think you made a very reasonable suggestion in having a small ceremony and then having the big wedding later. I'm not sure why that doesn't work for her? I mean, it's not like your mom will know if you have the big wedding, because she will likely have passed, right? Not to be mean or crass. I just don't understand why she would give up the big celebration that is paid for. I mean, that makes no sense. You can do the small ceremony and still the big one. I think you need to dig  a little deeper on that. It sounds like her mom has been horrible to her in the past (and you), so I don't know, maybe mom is trying to make up for lost time and guilting her?? But the fact that your daughter can't be there because of her race, that is very concerning to me. I mean, for the rest of you life, will there be other places your daughter can't be because of any of her other family members?? If you were my future husband and my mom asked this of me, I can't imagine I would cave to that demand.", "This is something that you guys need professionals to work out as the situation is untenable.", "NTA but you will be if you go through with it and exclude your daughter.", "NTA\n\nTell your fiance, \"If we do it this way, you're teaching my daughter - the daughter that you're supposed to embrace as your own - that *the comfort of a racist is more important than she is.* Is that really the message you want to send before entering into this family?\"", "You can do both, you know?", "NTA. Delay the wedding or do the wedding sooner. But whatever you do, don't do it in the hospital room. I can't even imagine the quantity of racist crap that her mother would say if she said anything at all. Remember, future MIL *cut off your fiancee* for dating you.", "NTA.\n\nDude, your fiancé is going to help raise your daughter. If she is okay with this, even if grieving, there is just no way you can trust her to help raise your daughter.  I'm not saying or suggesting that your wife is racist, but if she can't see how this decision to exclude your daughter is going to traumatize your daughter and characterize her as completely unfit to help you parent, then you need to choose between this woman and your daughter.  The decision should be easy. You'll have chances in the future with other women, you will never have a chance to fix something like this with your daughter.\n\nI would tell your fiancé something like the following:\n\nI understand you are grieving, but based on how your mother has treated me and my daughter, under no conditions will I cancel the wedding we planned to marry you in your mother's hospital room.  This is a dealbreaker for the ceremony and also our marriage.  Again, I understand you are grieving, but your mother has not only offended me multiple times but she has insisted my daughter can not be present.  I'm not getting married to someone without my daughter there, and I am not marrying someone who could ever slight my daughter - her future daughter - like that.", "Do not get married to this woman if she is ok with excluding your daughter because her mother is racist.  \n\nChoose your 8 year old daughter above all.", "NTA. You offered her a compromise with the ceremony but she didn’t want it. Good for her having the opportunity to say goodbye to her mom. However a wedding without your child and literally everything else would suck so hard… it’s not something she can expect no matter how much she grieves", "NTA.  \n\n\na marriage is supposed to be about 2 families coming together.\n\nthe whole day is supposed to be a celebration of that.\n\nthis woman wont even let your own daughter attend because of her race.\n\nsure...your fiancee can be sad that her mom cant be there...but that's entirely the fault of the mother...both in her racism and how she's chosen to treat her body.\n\nSure, she wants her mom to be there...but has she stopped to ask what YOU want?\n\nI think it is beyond generous to even offer the 2nd ceremony.\n\nI dont understand why it has to be such a big dramatic choice for her. you can have both.\n\nIts not just her wedding day, it's yours too. You are valid in your feelings of wanting your daughter and family present. Is this really how she wants to START the marriage? with resentment?\n\nWHY IS THERE NO COMPROMISE? THAT's THE WHOLE FOUNDATION OF A SOLID MARRIAGE.\n\nand for what? to placate an old racist?\n\ngiven how youve described the woman...best case scenario, she's too drugged out to notice it's even happening. otherwise... im genuinely concerned that, in the midst of your vows, she'll say something racist.... insult the preacher, insult you and your family. If she's awake enough to get anything out of it, she'll probably find a way to ruin it.\n\n&#x200B;\n\nfor me, the only happy ending possible here is to have a ceremony in the room, then the wedding you already planned for.\n\notherwise, she's choosing to start the marriage by explicitly excluding your daughter, and insulting your extended family by throwing away what sounds like months of planning.\n\n&#x200B;\n\nI hate to suggest it, and im sure you dont want to be that guy who leaves a woman while her mother is dying..but for me this would definitely be grounds to end the relationship.\n\nespecially with her continued insistence after several serious conversations about it.\n\n&#x200B;\n\n\"waa, but it's my mom\"  \n\n\n\"okay? what about my mother? my daughter? you arent the only person for whom it is important that their family is involved in the wedding. I am asking for **both**...frankly if we cant do that, then you'll get **neither** \"", "NTA. Idk I feel like for me personally I wouldn’t have immediately disagreed. But the moment I was asked to abandon the huge plans we made AND uninvite my own child from my wedding to satiate the requests of a vile racist your fiancée went no contact with 6 years ago, I’d put my foot down.\n\nI will put up with things I can tolerate. I would never EVER put my child through the things I would tolerate.", "...okay, so my first instinct is to tell you to RUN. RUN from this excuse-making woman and protect yourself and your daughter.\n\nHowever. She's clearly going through a lot. She didn't have much of her mom in her life and now she's dying and medicated so appears less of an asshole.\n\nYou need to sit down and have a conversation, unrushed, about everything. Try to get her to see it from an outside prospective. Remind her this will hurt no matter what happens. She should be in therapy if she is not already.\n\nDon't have a ceremony without your daughter. Do not do this.\n\nNTA", "Nta but I’m so sorry", "Nta", "NTA This is a bigger issue than an additional ceremony for the benefit of the mom. Your future wife is willing to not only tolerate, but approve of racism against your daughter. This should be a relationship breaking action. Protecting your kid needs to come before your heart.", "NTA. If you get married in front of that racist the internet will be mad at you. Im the internet. Have your traditional wedding with your black daughter. If your fiancé has an issue with that you need to rethink the fiancé.", "INFO- Would a Zoom call be a fair compromise? MIL stays in hospice and you get your wedding.", "NTA — you offered a ceremony in her room and that is a good compromise.  Everyone is looking forward to this wedding and to cancel and not have your family, especially your daughter, is too much to ask.", "NTA.  Don't bother going through with any wedding then.  If your fiancée is okay excluding your daughter because of her racist mother, you've got more issues than where the wedding is held.  You and your daughter come first if this is the life she plans on signing up for.  Her racist mother should not be attending.", "I don't think you should marry this girl sorry. But if she is close to her mother and her mother has these views and says things like that around her and she doesn't say anything about it to her then she must have similar views or at the very least doesn't see anything wrong with her mothers behaviour. She also doesn't care about your daughter which is a HUGE NO NO. She's not the one my dude", "NTA. We don't accommodate racist people who want to exclude the groom's child.  No.", "Could you do both? A little ceremony for her mom and then the official wedding with your family.", "NTA… that old racist B* doesnt deserve that from either of you. Have your dream wedding and day.. this wont even make her happy - so who is this show for?", "NTA. Tell your fiancé, you are not willing to exclude your daughter from your wedding and you’re also not willing to place her in the same room as a racist, who had the audacity to ask that she not attend because her very existence offends her.", "NTA - if your fiance is cool with pandering to her racist ass mother and excluding your child, then I don't think you should marry this person at all.\n\nI have some amount of sympathy for your fiance. The grief of losing her mother soon (both the real and actual version of her and the version of her that she deserves and will never get because her mother sucks) is clouding her judgement. \n\nUnfortunately, it seems her mother is going to die the way she lived - badly and while hurting her kid.", "Seriously, OP.  This moves your fiancee from \"grieving daughter\" to \"complete asshole.\" I can't believe that you just glossed over that???", "Omg I missed that part.. oh no way in hell..", "“Why is it more important for your estranged mother to attend the wedding than my daughter?”", "She’s desperate to have her dying mother love her & be proud of her. He needs to show her by doing this she’s doing to his daughter exactly what her mother has done to her her whole life. She’ll never forget her choosing a dying racist over her. \n\nI understand she’s sad and I can understand wanting to be by her side as she dies, but I’m so use to manipulative bs I’m thinking this is her final evil act on earth. Ruining her daughters relationship.", "Yeah I was teetering on the fence until this part. Just no. NTA", "It'll still leave him marrying someone who is ok with racism towards her husband and stepdaughter.", "Ouch man that’s some harsh words, but true!", "Omg lol", "You’re wrong for that lol", "It’s possible that there may be no wedding in the future 🤔", "yeah, this whole thing is very concerning. I mean if mom is like this, are there other family members like this?? Is he supposed to avoid bringing his daughter around them too to make them happy? I just don't like this one bit.", "His fiance is acting so irrationally I'd be willing to bet if op doesn't agree to marry her in the hospital, she'll break up with him and find some white boy that will. He's nta but there's grieving and then there's selling your soul to the devil grieving like she wants him to do. Super sketchy.", "No, the fiancé is absolutely an asshole.\n\nGrief can explain the actions if/when she apologizes, and make being an asshole forgivable.  She's completely an asshole though, and her actions are that of an asshole.", "i think you missed something.\n\nthe big wedding is already planned.\n\nOP is still offering to do the hospital ceremony, but also not cancel the big wedding. he's offering both.\n\nshe's saying 'hospital only, no big wedding'\n\nthats a huge difference. \n\nhe's offering both. frankly if she cant do that, then she should get neither, and OP should move on.", "> Do you want her to be partially present and trying to put on a good show for your family's sake on your wedding day, \n\nI wonder why you expect him to be fine doing the same.\n\ndo you think he'll be fully present and happy without his daughter? do you think this isnt just putting on a good show for her mother's sake?\n\nwhy is it fine to make him exclude his family, but not her, i wonder?  \n\n\nI understand its some heavy shit she's dealing with right now...but everyone dies. \n\nhe's offering to do BOTH, and she says only the hospital.\n\nfrankly, I think if she cant do both, then she should get neither. It's not fair to OP. his feelings are valid. It's his wedding day too, not just hers, after all", "Bot", "While that is a good idea, OP and his Fiance have already paid for a bunch of it, how much money are they gonna lose here ya know? \n\nIt's a tough spot, I'm sorry this happened OP. Navigate it smartly is my only advice.", "You’re excusing all the racism now too?", "You should ask why fiance thinks it's ok for your daughter to miss your wedding because of the colour of her skin, but her now dying, mostly absent mother, absolutely can't miss it.", "Oh, I see. Yeah, that makes sense.", "It’s better to lose money on a failed engagement, than it is to lose money and possibly years of your life to someone who is okay with you being treated as less than because you’re not white.", "Not as much as a divorce. I'd say it would be money well spent considering what could be lost after the fact.", "Would pre-marital counseling help to make sure this is just a response to grief?  Excluding the daughter is so incredibly hurtful to both the daughter and OOP.  I'm having a difficult time understanding how she would allow that if she was all into being a wife and mother of someone of a different race.\n\nI date outside my race.  I know the difficulties involved in that type of relationship.  Being a stepmother is next level.  Will she be able to stand up for her stepdaughter?", "I was speaking specifically to the idea of postponing it, but I get what you're saying.", "You need to sit her down and be very clear with her about what you are and aren't willing to accept. I know you don't want to hear this, but this moment is a make it or break it for your relationship. Your gf is most likely going to resent you if you don't go through with the wedding she wants and you're most likely going to resent her if you give in and allow this racist to dictate the terms of your wedding. \n\nI would be straight with your gf and aak if she's really okay with your daughter not being there at your wedding, bc frankly, that's unacceptable to me. You do realise that your gf wants you to start off your marriage with an act of hate, right? Why does your gf get to have a loved on at your wedding but you don't? I'd ask her that, and if I were you, get ready for some uncomfortable truths to come out that could potentially end this relationship.", "Your fiancée may not have brought it up, but she’s not shooting it down either. You know the saying “if you have 10 people sitting at a table with a Nazi, you have 11 Nazis?” Your fiancée is choosing to condone her mother’s racism. That is in itself racist. Grief is not an excuse. Do you really want to permanently tie yourself to someone who is entirely okay with excluding your daughter because of her race? Who will side with the racists over you and your family in the face of their racism?", "She's being nicer because she's on respite and on alot of pain relieving drugs and they are literally keeping her pain free as her body is dying. And yet, despite all those drugs, she is still being a huge racist and excluding your daughter.", "If excluding a child for having a black parent is what counts as \"nice,\" I'd hate to see what this woman was like on a regular day.\n\nIt's admirable that you want to support your fiancée. But she is not the only person in your life who deserves your support. You have a responsibility to your daughter to be her fiercest advocate and model anti-racist behavior.\n\nYour fiancée's request is not even worth discussing because it's based explicitly in hurting a child out of racist malice. What is worth discussing is how morally flexible grief has apparently made some people. Your fiancée had the opportunity to show up as an advocate for a child whose life she will be in regularly. She has chosen instead to show that when things are stressful, she's an unsafe person to your daughter.\n\nWhat will you do with that information? And what are you showing your daughter about the contents of *your* character?", "Why isn't she defending her possible future husband?  Are you in denial?", "If you go ahead and cancel your family wedding and instead have only a hospital ceremony, without your daughter, then, a few years down the line, your daughter get older and will realize how messed up this was. The racist mother will be long dead, but your daughter will still be there, and it will have a lifelong impact on her and also on your relationship. \n\nAlso, wouldn't canceling the family ceremony be hurtful to your family, who also don't deserve to be suddenly shut out of your wedding like that? \n\nI know your fiance is grieving and not thinking straight right now, but you still need to find a way to navigate through this difficult time without doing things that are unacceptable to you and that will cause major and permanent regrets later. Hopefully you can keep talking it through, or get her some therapy, or something. Don't just jump to the idea that doing it her way is the only option.", "She's agreeing to go along with it though. That should be completely unacceptable. Ignoring it is accepting it, and that in itself is racist. \n\nYour first duty is to your daughter here, and you shouldn't be bringing someone who is racist towards her, including accepting of racism by others towards her, into her life.", "Isn't your fiance supposed to be your child's step-mom? You think this is how a step-mom should act? Like your child is something that can be shut away when needed? You're okay with that?", "Yeah the guy doesn't know this girl as much as he thinks he does. Because if she even thought about entertaining her mom's wishes which would exclude his mixed raced daughter then she probably has some of the same views as her mother and that is a divorce waiting to happen. But then again I'm just some dude on the Internet wtf do I know lol.", "She’s been much nicer to me and everyone. She was seriously one of the nastiest people I’ve met. She yelled at me for polluting her child the first time I met her. Her not saying much to me makes her look like a whole new person.", "Isn’t she sedated and on painkillers? Of course she’s not saying much to you. She’s dying. That doesn’t mean that she’s changed, and the fact that she won’t let your daughter be there proves that.", "This woman still doesn't want your daughter to attend this wedding. She's playing nice because she's dying and wants company from her daughter and to pretend she was a good mother/person. She hasn't changed, she just doesn't have the choice to be her awful self. She's still being cruel and discluding your daughter. You need to have a serious talk with your fiance why this isn't ok.", "Try asking her: Do you think it’s more important for your racist mother to be at your wedding than for my daughter to be there?", "Mil being nice upon heavy sedatives and the onset of 'end if life', means nothing. Be supportive, love your fiancé. But at the end of the day, if she isnt willing to compromise or wait till after, this is gona be a deal breaker. Not because the wedding itself, or even the racism (tho, that alone are grounds tk break it off) \n\nYour fiance is well aware that her mom is not going to be here long. She also is well aware of everything her mom put her through her entire life. All of the abuse, trauma and awful memories. \n\nIf she is really willing to give up all those years of healing, just to forgive on Moms deathbed? I duno if I could marry someone who hasnt properly worked through the pain yet. \n\nIm just arm-chair person over here. But it sounds like she *mostly* believed what others told her about her mom. *Mostly* agreed what she went through was traumatic and wrong. But with mom dying, she feels she has to 'make amends' last minute for moms sake, because shes 'finally being nice'. \n\nYour fiance thinks shes doing this for her own sake. Truth is shes still a vicitm of Mils abuse, and once Mil dies, fiance is gona be a wreck. \n\nI hope ya'll are on stand by with a proper therapist 😬\n\nDef curious if theres an update at some point. Best of luck Op.", "Yeah sounds like you haven't experienced a whole lot of racism.", "They BOTH didn't want to invite her to the actual wedding. Fiancée should get some therapy to deal with her grief, instead of honouring a monster that gave birth to her, but didn't even raise her.", "NTA\n\nYour fiancée needs the help of a professional therapist. She sounds like she’s struggling to try to resolve a lot of issues & allowing her abusive mother to manipulate her. Definitely put off the wedding if possible until after her mother has passed because the hospital wedding will be a disaster. Even though she’s near death, it sounds like your fiancée’s mother is determined to ruin your wedding.", "NTA. There are some people who have a change of heart at the deathbed, and if that were the case here, I would have a commitment ceremony in the hospital, but still wouldn't hold the actual ceremony there. The day should be yours, and any parent should understand that.\n\nBut she doesn't seem to have had a change of heart at all, and is trying to impose her racism with one foot in the grave. Dying ought to be a time when people reconcile, not an excuse to try to establish dominance at the end.", "Nope. I thought this might be a bit nuanced until I read, “8YO can’t be there because she’s half black.” To hell with the mom, dying or not. And though this may sound harsh about someone in difficult circumstances, if your wife is for one second considering honoring the rule about your daughter, to hell with her too. NTA.", "NTA!!! You seem very nice.", "NTA - I honestly would be rethinking the entire wedding if your fiancé is ok with excluding your 8yr old daughter because of her race.", "NTA", "NTA (but Y T A if you allow this to happen/your fiancée is TA if she continues pressing this).\n\nAs a Hindu in an interracial relationship with someone from a very conservative background, I made it clear early on that I would not allow anyone, including his parents, to ever make my future children feel othered or less than within their family or home. His parents took this very seriously and have since educated themselves on Hinduism, my native language, and the general heritage their future grandkids will have. The entire world will other them, but I want them to always feel equal and secure in their own family. \n\nIf this has even been brought up in the presence of your daughter, she’s already been othered and made to feel less-than in her own home and family. That will sit with her for the rest of her life. Despite grieving, if your fiancée (and you, by tolerating it) is even remotely willing to allow this to happen to her future family, I think you need to have a serious conversation with about what she’s really saying about her morals/ethics and how easily they can be compromised. And I think you need to have a serious conversation with yourself about what you’re willing to tolerate around your child. \n\nYour daughter is innocent. Your fiancée’s mother is not. Why is the abuser coming ahead of the victims?", "wtf is wrong with your fiancee that she would subject you and your daughter to this racist?\n\nyou need to rethink this whole thing, man.\n\nyou are NTA.", "NAH (except MIL of course)\n\nThis is a hard situation and there is no right answer. I have experience from your wife's side of things to a point, but I made very different choices-- my mother didn't get a seventieth chance at my expense and my partner's. But I empathize with how hard that choice is, especially when palliative care and the threat of impending death seems to be mellowing things out.\n\nThe fact remains that you and your daughter would not be welcome to your own wedding, and that isn't fair to you or to her. Imagine how that family dynamic would play out after MIL's death-- your daughter's introduction to her new step mother would be that she thought it more important to have her drugged up, hateful, blatantly racist mother at the wedding than the little girl she's going to be a mother to herself. \n\nAnd your religion (assuming you're practicing to some extent, given that you were planning to include a Hindu priest) would also be disregarded. If your MIL doesn't actively object to his inclusion, she would likely still be disrespectful in some way. Then of course there's the rest of your family, who you didn't say would be actively excluded but I imagine wouldn't be able to fit into a hospital room regardless.\n\nThe of course there's you and your comfort level. You are half of the wedding. You are the person she is choosing as her partner for the rest of your lives, and her mother once cut her off just for loving you. Now she wants the ceremony representing the ultimate expression and consecration of that love to be upended and replanned around the inclusion of someone who, at least up until the morphine and deathbed experience, was so violently against it that she was willing to disown her own child in protest? \n\nI know how your wife feels. I know what it's like to desperately want a mother with a history of cruelty to finally apologize and love you and be a mom. Because of that, I know how tempting it is to take a sliver of kindness and love and believe that it's a sign that it's finally happening, because deep down we all believe that family ruptures inevitably come to happy endings-- especially on a deathbed. We can't help but think that every conflict is destined to fade at the deathbed, dwarfed by the reality of mortality and permanent separation. And the scariest thing of all about familial estrangement is having to accept that there is a (good) chance that your parent will die without ever giving you that closure, and you'll be left with the aching feeling of having never been loved or parented or protected with no way to resolve the hurt. I understand that. I am still working through that following my mother's death.\n\nBut as attractive as the promise of deathbed healing is, even the perfect wedding in her mother's hospital room-- where she is sweet and loving to you and respectful of your faith and consistently, unconditionally kind to her daughter-- will not heal the damage she did to your wife OR YOU up to that point. Even if everything goes exactly as your wife is dreaming it will, the damage won't be undone. It's a bandaid. One nice memory that she hopes will cover up all of the painful memories underneath it but that will ultimately just keep them just barely out of sight.\n\nAnd the price for that one nice memory is teaching her stepdaughter that her safety, personhood, and inclusion in the family you're building are less important to her new stepmother than the whims of an old woman who refused even on her deathbed chose bigotry over her daughter. Your marriage will be founded on the memory that your beliefs, family, daughter, comfort, and emotional safety were less important than the lure of an emotional bandaid. \n\nDelusion sounds like a strong word, but that's what this is. I say that as someone who has had the same delusion. Deathbed reconciliations are a delusion, a lie that everyone participates in to avoid addressing the true cause of the estrangement and then clings to after the fact. The family and life that your wife has the opportunity to build with you and your daughter is REAL, and that's where real healing will come from. She's not being rational right now and it's very good of you to understand and hold space for that, but this is not a reasonable thing for her to ask or expect and it will have consequences for your marriage down the line if she does.\n\nThat said, I know a gay couple-- one Mexican Catholic and one Indian Hindu-- who had three weddings to avoid this kind of issue. One as soon as gay marriage was legalized at the courthouse to make it official just in case the tides turned again, one in the Mexican Catholic style, and one traditional Indian wedding. Would something like that be possible? I know she said no to the ceremony, but maybe do the legal marriage there and the religious/spiritual/ceremonial full wedding as planned?", "[removed]", "NTA", "NTA", "I'm going to be unpopular here and go with NAH.\n\nIf I were you, I'd feel exactly the same way.  \n\nI think your fiancee is grieving the relationship she never had with her mother,  and will now never have. I think having her wedding at the hospital is giving her the chance to feel like she's doing something a normal loving mother/daughter would do.\n\nIf her mom is in hospice care, they can likely help your fiancée access counseling services to help her work through her feelings.", "NAH (except the mom). Don’t cancel your wedding, you can still have the ceremony and celebration that you guys have been planning. \n\nIf your wife really wants “her mom to be there when she gets married,” you should try to make it happen. She’s grieving and this is something that matters to her. Plan a ceremony ASAP for the hospital room, let your wife set up whatever she wants to do for her mom, you pretty much just show up. The part about your mixed daughter not being there is bullshit, so you can obviously push for some of your input to be included, but for the most part try to think of it as a ceremony specifically for her mom. If your family feels left out, just make it clear that this is specifically a bedside ceremony for her dying mother, and the hospital limits the number of visitors. \n\nThe two of you can take photos, etc at both. You can decide which ceremony you want to submit paperwork for (make official). Especially with Covid these past few years there have been tons of people who had a tiny ceremony or a courthouse wedding, and then threw their dream wedding for friends/family after they were legally married.", "I don’t understand how mom forbidding your eight year old daughter from attending isn’t an absolute deal breaker for your fiancé. That’s so fucked up (all of it is). I’m sorry you have to deal with this\n\nI was going to say I think doing both is a good compromise and I’m sure you and your fiancé can get there if you talk about it, but oh man that is a red flag. At the minimum, stand your ground on your daughter being in the room, and you’d be well within reason to reconsider all together.\n\nYou are definitely NTA here. I get that she’s grieving but fiancé is exhibiting ridiculously self centered behavior right now.", "NTA \n\nIt's your wedding just as much as it's hers. A hospital wedding sounds terrible.", "NTA. Her mom can Skype in on your wedding you have already planned and paid for. Bonus is that she won't be able to say shit to anyone.", "NTA…the part where you stated your daughter is not allowed was it for me.   You are getting married to be a family and I would tell your fiancé you are not willing to do so without your family there as well.  I really do not have an easy answer for you but I wish you the best.", "I mean just get married twice.\n\nNTA\n\nBut ... half my extended family have eloped and then when they came home had a ceremony for family/friends.\n\nMake the thing in the hospital just be like a civil service or something? I dunno, if she won't compromise too there isn't any point in my advice.", "NTA, your fiancé is choosing her racist mother over you. Are you sure this is the person you want to marry?  Are you sure she’s a suitable stepmother for your child if she’s okay with her racist mother causing your child to be excluded?  The only way she’d put her mother this far in control with racist choices is if she’s racist herself. Run dude.", "NTA. You should ask yourself why she’s willing to let her mom be so racist. Dying doesn’t give you a pass", "NTA she's the nicest she's ever been and still being racist to a literal child", "NTA. You proposed a ceremony in her room, if your fiancée cannot agree to that then it is a problem.", "Do not marry into a family that treats your daughter so poorly.  Just don't.   Your child must be prioritized far above everyone else.", "Nta", "NTA.\n\nDon't do it. This is a hill to die on. If your partner wants you to cater to this racist, hateful  old woman, who is going to CUT OUT your daughter out of racial hatred while you bend over backwards for her-- oh HELL no. Put your foot down. \n\nIf your fiancee really wants this, she is not in your corner and will never be a good wife. Her values are fucked. She also clearly has absolutely no regard for the well being of your daughter, who is old enough to understand being excluded. \n\nBest you settle this once and for all before you are married to her.", "Nta\n\nCompromise. \n\nDo a small civil ceremony in the hospital room. Have this conditional upon her mother being civil to you. If not - refuse.\n\nThen have wedding you want that you already planned.", "I had the same situation with my mom. Had been no contact for three years because she abused me verbally and financially, yada yada. I got a call from my dad that she had stage 4 cancer. The thing is, I always wanted my mom to love me and here was my chance! I got a tattoo that said \"mom\" in a heart. I showed it to her. Yeah, she didn't care, she passed away and I found out when I cleaned her house out that she ALWAYS hated me. Thankfully, I could cover-up the tattoo. There's no \"cover-up\" for your dream wedding. \n\nNTA, OP. Remind your fiance of why she went no contact.", ">Also her mom said that if we do get married in her room my 8YO daughter can’t be there (because she’s half black)\n\nLook, I get that your fiancee is basically grieving, but the fact that she seems not only ok, but enthusiastic about this demand would make me question the whole relationship, let alone the marriage.", "Easily the best comment I've ever seen on Reddit.", "I’m wheezing and NTA because that’s just ridiculous", "I don't see the marriage because of the fiancee's attitude toward his daughter.", "Because the mother is excluding his daughter!", "Many Europeans are married in civil ceremony before the religious one. I had a cousin who married 5 days before his 'wedding' in order to meet NY Times regulations! LOL", "Both ceremonies WITH his daughter!", "The hospital ceremony MUST include his daughter.", "Hw doesn't owe any compassion to a racist", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Well it’s partly that my future MIL is racist and partly that kids under 12 aren’t allowed in the ICU even during visiting hours unless they have a direct relation to a patient.", "Exactly. OP is NTA but Fiance likely has very complicated grief that is beyond Reddit's paygrade.", "A dying racist who’s dying because of her own bad choices and behavior. Sorry but to me the living are always more important than the dead.", "NTA 100% I can see you love your fiancé very much, or you would not be even considering any of this for a second. You need to sit your fiancé down and try to find a compromise. Explain how you want your daughter at your wedding just as much as she wants her mother there, that you want to celebrate that meets your wishes too, that your future MIL was basically awful to you in the past, and you want to have everyone as happy as possible. Good luck.", "The point is that it isn't rational, though. She is literally and actually disabled by what's happening neurochemically. Grief coupled with systematic and unaddressed childhood abuse means she's probably completely on autopilot-- adult brain is OFF, and the little girl who just wanted her mom to love her was put in charge after having been told \"your mom does love you now! Surprise! She's gonna die and you have X time to get as much love as you can!\"\n\nThe fear of losing the only opportunity to heal and to resolve those issues and receive that love has driven out any rational thought. There is only pain and panic and the pre-programmed structure of obedience in fear of having your mom's love withdrawn. \n\nPeople can't be rational about buying a big-ticket item when put on a clock. Being irrational is expected, and human. But that doesn't change the fact that her actions will affect others for a long time after her mom is dead and gone, and giving her grace doesn't negate the damage she does while she's grieving and behaving irrationally. She is still responsible for making the right or wrong choice and living with the consequences of those actions in the end. But OP is understanding enough to recognize that her actions right now don't reflect her core values and to give her the chance to apologize and make things right when she does come back to herself.", "I don't think he should be fine with any of this, or that they should get married right now. I'm saying that her request is not rational because it sounds like  she is currently dealing with all of her childhood trauma, triggered by her mother dying, in an irrational way and needs help. She is clearly not ok, and focusing on planning a wedding while she unravels in front of him seems a little obtuse. If excluding his daughter is normal for her, that's different. But if it's not, because none of this is normal behavior for her, this issue is much bigger than the wedding.", "That's actually easier.  \"I'm not getting married without my daughter there\".  Full stop - no arguments.  Stand your ground and the hospital wedding can't go anywhere.", "you need to include this in the post", "I like the saying \"if 10 people sit down to dinner with a racist, then 11 racists are having dinner together\". Its all well and good to call FMIL a racist, but if your fiancee wants to go along with her \"exclude the half-black daughter\" plan, then sorry, she's also racist.", "Oh I agree completely, just saying that I can see why she’s acting this way and I feel for her very much in this scenario. The correct choice is very obvious, but she might not be able to see it on her own right now. Proper discussion and counselling needs to occur in order to actually determine what the next steps are.", "Here's the thing, and maybe I'm taking this personally due to experiencing racism in the past .\n\nBut I can never imagine telling my fiancée the person I love. \"Your daughter can't come to our wedding because she's half black and my mom won't allow it\"\n\nNo matter the circumstances I can't give someone a pass on that and say well she's not thinking clearly", "Typical shit a racist would say", "Right? Like it must be grief talking that makes fiancee think her mother HAS to attend by OP's minor daughter doesn't. At least, I hope it is grief.", "I absolutely get that. I've been where his fiance is, and haven't experienced racism directed at me. In my case I couldn't go through with letting my abusive mom make the person I'm going to spend my life with feel like less than a person-- on any day, let alone a wedding day. She died alone and I gave up on the fantasy of closure because I love my partner and couldn't watch my mom abuse someone I love.\n\nBut I was not sane during that time. I made the right choice in the end, but leading up to that I was basically a fucked up three-year-old just crying because there were no right answers. This woman literally tried to kill me when I was a child and even the terror of that experience didn't seem real next to the delusional hope that maybe she loved me now and maybe I would get closure.\n\nIt wasn't until I'd thought through what it would be like if we visited her and imagined how much she could hurt someone I loved-- really pictured it-- that I realized how insane I was being. OP seems to be taking this very stoically and generously, and unfortunately that insulates his fiance from the reality of the damage she is permitting. She is being allowed to not think about how much it hurts him or could hurt his daughter, and she's not thinking beyond her own pain enough to realize it.\n\nOP did add in a comment that kids under 12 aren't allowed in the ICU (which I had assumed was the case when I first read it) and I would want more info on how that is being handled by the fiance. It does help clarify why the fiance isn't drawing a line there and saying \"no she has to be included\" if hospital rules wouldn't permit it.\n\nI am in no way excusing her. She is being an asshole, and she is going to do serious damage (and has already done it). But I genuinely put this kind of situation on par with a psychotic break, especially given what sounds like a deep history of abuse. For a while before my mom died, I would actually lose time when I saw her name come up on my caller ID. I was so afraid of her that my brain actually shut down when faced with the prospect of dealing with her even over the phone, but apparently I was the perfect daughter when I did answer-- I just don't remember. It wasn't until she hurt someone I loved that I snapped out of it and cut her off. \n\nGranted, I am absolutely projecting all over this. Hardcore. But the physical changes that childhood abuse can cause in the brain are fucking wild, and as long as she doesn't go through with this in the end I think it means she needs some hardcore therapy.", "Yes", "Yeah I agree, but my fiancé is having a hard time seeing that since it’s the first time in her life her mom has been nice to her.", "She needs a wake up call, and to be confronted with reality. This should be a deal breaker. It's nice she's getting to have a few last moments with her mom that she never had, but she should 1000000% not be apart of your marriage. At. ALL. No part of the wedding, she's not around it at all. This is a step you cannot take for your daughter, and yourself. If she cannot handle that, maybe this whole marriage needs to be rethought", "I mean, what is the problem of marrying twice?", "NTA and please please don’t go through with a hospital wedding. It’s your big day too, and the people who ACTUALLY support you and your relationship should be there. Your fiancé should realize that this is not only selfish but condoning racism and segregation.", "I was on the fence until the added detail about your daughter. NTA.\n\nI say this as someone whose dad died only a couple of months ago: there is NO acceptable reason for your fiancée to gloss over her mother's racism. Not towards you, and absolutely not towards your daughter.", "NTA. Your fiancé is going through a lot. As such, postpone the wedding until she comes to her senses. I hate to say it, but you need to buy time before you marry this woman.  Let the ever gentle hand of Lucifer take her mother peacefully pass to the depths of hell. Then get married.", "NTA. Please please update us.", "NTA\n\nThe is a quote from the Lorax that comes to mind.................", "NTA.  Is your future wife ok with racism against you or your daughter?  That Is concerning.", "Im back.  I read and read and became angrier and angrier on your behalf.  What is wrong with you?! Snap out of this trance your under. Your fiancé is coddling a racist, dying, alcoholic and drug addict, and placing you and your family aside.  Why in the Hindu Gods name are you putting up with this and not showing any anger or frustration?  I would never marry someone acting this way, especially after excluding your daughter who is half-black!!! \nThis post is just offensive and triggering!", "NTA have your wedding as planned and then she can wear her wedding dress to the hospital and show her. I’ve seen this before too it’s nice", "NTA. The racist MIL is circling the drain and will be dead soon if she has multiple organ failure in the ICU. Unless the original wedding is planned for the next couple weeks, she ain’t making it. \n\nI normally don’t recommend compromise with shitty parents who are in the Finding Out stage of FAFO, but she’s so out of it she won’t know nor care if the wedding really happened. Have an unofficial ceremony in her room to shut everyone up. \n\nRemember the end of Lethal Weapon 4? No. Well Riggs and his girlfriend did a last-minute unofficial wedding because she didn’t want to give birth without being married, so they just grabbed a Rabbi (closest religious person around) and did a quickie ceremony. \n\nDo that, but maybe have a friend dress as a priest or explain the situation to the hospital Chaplain. Remember, it’s not official until the marriage license is signed.", "NTA", "NTA. Honestly the fact that she has been racist to you in the past, won't speak to you now and won't allow your daughter in the hospital room for this due to her being half black is enough reason to say no. Ask her if she is really okay with you being treated badly and her step daughter being left out.", "> Also her mom said that if we do get married in her room my 8YO daughter can’t be there (because she’s half black)\n\nDo you actually intend to go forward with marrying a woman who would agree to such a thing? \n\nNTA for not getting married in the hospital, but a huge, HUGE asshole, and a bad father, for keeping your fiancee in your daughter's life in any way.", "My take is your fiancee sees getting married to the man her mother is racist about is rubbing her marrying you in mom’d dying face.  Of all the things that mom might welcome, your wedding isn’t one of them.\n\nSo consider presenting that to your wife.  Does she really want to aggravate mom?\n\nSorry this is happening to you.", "Wait, so you're expected to cancel a whole awesome wedding full of all the people you love so that you can have a hospital wedding with your fiance's racist Mom because she \"doesn't want to get married without her Mom there\" even though doing so *requires you to get married without your daughter there*??? HELL NAW.\n\nNTA.", "Nta. Your compromise of doing a ceremony in MIL’s room is perfectly acceptable. I do feel sad for your fiancé tho, and I’ll explain why. My dads dad was horribly abusive, to both my dad and his mother (and then to my mom and us kids, whenever we’d visit). My dad still spent his whole life trying to make my grandpa proud, and when that man died, I think it really tore my dad up inside knowing that he would never heal that hurt. I think that may be what your fiancé is going through. I think it’s really easy to say “that person is awful, why do you even want their approval” when you don’t have the kind of strained relationship with your mom that she has with hers. Idk I don’t think you’re wrong at all for wanting your wedding and for resenting your fiancés mom, but also this is going to be a really difficult time for her, and it might be even worse given that she hasn’t had a relationship with her mom for a while. When her mom was in good health, your fiancé likely thought she had decades to repair the relationship, and now she is realizing that she doesn’t. And that’s a really hard thing to cope with.", "She… would willingly exclude your daughter because she’s half-black?!?\n\nOP, please don’t marry this person. You and especially your daughter deserve better. \n\nThis will not be the only time she will let cruel and racist people harm your family.", "INFO\n\n1. How exactly did your fiancee react whenever her mother said racist things to you?Quietly mumbled an apology to you?  Passive silence?  A half-assed \"Don't say that?\"\n2. What does your fiancee say about excluding your daughter?", "You need more awards but idk the award system of Reddit xD", "Like the saying goes, the trash will take itself out. In this case, multiple organ failure.", "Fiancée wants mom there. \n\nMom doesn’t want OP, his religion, or his child. \n\nThis is a time where a hard line gets to be drawn. The wedding they planned or no wedding at all", ">and have it supersede the one you had planned\n\n...and also exclude his daughter.", "I think a serious talk and some therapy is called for.", "Its ok, MIL will be cold blooded too", "If the fiance has been 6 years no contact with the mother, she's grieving the idea of a mother she will never have. She need therapy and learnt how to refocus this type of grief.\n\nIn OPs position I would ask fiance what is the difference with the proyected wedding, he didn't say what was the plan, but is easy to assume that after 6 years with no relationship the mother was not invited, so why change the whole wedding for somebody you weren't planing to invite  before just because she is in her deathbed (he said the mother hasn't apologised or changed her ways towards him)?", "She's had six years to come to terms with the consequences of her mother's racism. Yes it's really difficult; my father was an alcoholic who drank himself into a stroke, lingered on for years, and then finally died this March. It was very hard to wade through the love I have for him vs the destruction he caused. But she had Six. Years. Surely she must have thought about it at some point.", "She did. She was NC during that time and it was only end-stage organ failure that reconnected them. I'm guessing it wasn't just the racism but the cumulative effects of her behavior. This is potentially a daughter who grew up being mistreated by her mother, who is now dying and playing nice, hoping for the fantasy of what a mother is supposed to be in her last days.", "You need to run friend. She is grieving. However, if she can not see your perspective in this matter, I would not marry her because:\n\n1. She wants you to commit your life to her, with the only witness being the mother who despises your existence. \n\n2. She wants you to do it without your kid! That her mother has made comments about!  \n\nDo not inflict this family on your kid. Even if the one you know is evil happens to be headed out anyway.", "Consider having mother \"attend\" via Zoom...", "NTA. You realize what she's asking of you? And you still want to marry her knowing all this?", "\"her mom said that if we do get married in her room my 8YO daughter can’t be there (because she’s half black)\"\n\n...\n\n\nWhat?\nWhat did I just read?\n\nI don't even care about the rest. At least she's honest. In no world should you appease this woman. Obviously your fiancee is going through a lot emotionally. I really don't know how to help her. But ditching all your wonderful plans for a woman who is like this? Absolutely not.", "NTA.\n\nIs your fiancée ok with your daughter being left out of her own father's wedding because fiancée's dying mum (who made no effort to reconcile) is racist?\n\nThat's a red flag. Is it a sign of things to come?", "NTA but your focusing on the wrong thing. Her mom is a racist and you should in no way get married until you talk to your fiancé of why the racism is okay now? Your fiancé is willing to hurt your daughter for her mom? Push has come to shove and you are in the cold with your daughter because your fiancé is choosing her racist mother over you. Pause the wedding and get into therapy to see if you guys should even get married. Do not have a hospital wedding for a racist.", "NTA. \n\nFrom the heading, it sounded like you were going to be the AH, but with every word you said, your MIL got worse and worse. Then you got to the line where you said she won't allow your daughter to be there and I thought, \"Hell, no!!!\n\nIf your fiance could not live with that decision, I would have a simple hospital wedding and later the real one as planned. It doesn't even have to be a legal wedding in the hospital, more of a commitment ceremony. \n\nNo way would I want a wedding for the sake of someone who barely speaks to me.", "NTA. BUT- but, if it makes your grieving fiancé happy you can do 2 weddings. A small one at the hospital so fiancé can see mom, maybe get a picture that will be special to her since mom is on the way out, and then another bigger wedding with everyone. Up to you guys on the order of which ceremony comes first.", "NTA Why not have a “dress rehearsal” in the hospital for the dying mother and have the real wedding as planned? Everyone gets what they wanted.", "NTA her mother wants to exclude your daughter from her dad's wedding because of the child's race.  That right there is a deal killer.\n\nHold the line OP.  I feel badly for your fiancee, losing your mom is hard, but she can't unilaterally hijack the wedding that belongs to BOTH of you.  Her mom isn't the only family member who matters, and she should not be insisting on prioritizing the person who has been racist against her groom and her soon-to-be stepdaughter.", "OP please keep us posted 🙏🏽\nAlso you’re NTA, that’s my TLDR.", "NTA", "NTA. This woman has done nothing to earn this kind of special treatment. The fact that she’s dying from slow motion suicide doesn’t change that. Everybody dies - it doesn’t make her special.", "NTA she can attend virtually and it doesnt sound like your fiance’s mother is someone who would really appreciate that you guys did that to the extent that she should", "NAH.   \nThere’s no right answer to this one… you want a Hindu respecting service, with traditions that your fiancé’s mother won’t be comfortable with… Both people should get what they want.   \n\n\nHave you considered doing a registry wedding at the hospital bed… and still doing the Hindi service at the agreed time? Why not do both!", "Why are you marring someone who is letting her mother treat you and your child like this?? NTA, and I would not marry her at all. She’d have lots of free time being single to spend with her racist dying A H of a mother.", "Gently remind your wife that she is also going to be a stepmother and maybe it’s time to break the cycle her own mother perpetuated", "This! Deadbeat,  estranged mother is at the end of her life after decades of addiction and is now dictating how the wedding should be?  Sadly,  it sounds like the fiancee is in la la land, pretending this is the caring,  loving mom she never had and desperately wants some kind of final special memories. Ain't going to happen. \n\nSomeone still so racist and controlling while in hospice care will make this occasion and everyone around as miserable as possible.", "I don’t think grieving is a good enough reason to exclude the step daughter from the wedding. This is concerning. I think it points to a character flaw. I wouldn’t be able to trust that woman to now be the step mother to my child she was so willing to cast away.", "In case you see this OP - the hospital will often make allowances for more visitors/kids under 12 for patients who are terminal. I would ask a nurse to get you the hospice staff assigned to your future mils case. If you explained you were doing a short wedding ceremony, they'd absolutely find a way to make it happen.", "I went NC with my mother about two years before she was murdered in a trap house while purchasing her dope. I drove 1,000 miles to sign the papers to end her life. I asked them to please make her comfortable and give her as many drugs as they could to make sure. They knew she was lifelong addict and l didn’t want her to feel any pain. I figured l could literally give her brain stem the ride of it’s life as she exited out. And it felt good to have that control, that power. Because she damn sure made my life a living hell. I was more pissed off and angry because her dumb ass ruined any chance of a reconciliation, even though I’m 99.99% sure nothing of the sort would happen. I get your wife’s pain, l truly do. But she isn’t thinking with her logic right now, she’s thinking with her emotions and the issues with her mother, and that she might be able to have this happy, bright ending with mom. From what you’ve said that’s not gonna happen. Mom is playing her last self centred control card. NTA, OP. Do what you have to do for your family.", "That was cruel", "Trust someone like MIL that to make her daughters wedding all about herself.", "All these languages and you chose facts. Amen", "You need to protect your daughter. NTA for this situation, but you will be if you keep excusing the way your fiancée is mistreating your child, grief or no."]}