{"id": 18833, "submission_id": "13z0k1x", "title": "AITA for storming off when my father and sister refused to turn on subtitles", "selftext": "I, (15F), have cognitive problems and am slightly hard of hearing. Because of this I have trouble processing audio in movies and require subtitles.\n\nHowever, a few days ago when I went downstairs to eat dinner and watch a movie with my family and I was having trouble understanding the dialogue. I asked if I could turn on the subtitles but in response I basically just got screamed at and called 'selfish'.\n\nI tried explaining to them that I couldn't understand the dialogue because of my cognitive and hearing problems but they weren't having it. They said they shouldn't have to 'pander to my needs while trying to relax and watch a movie.\n\nWhen I finished my meal I decided to head back upstairs and watch the movie in my room with subtitles. I thought this wouldn't be a big deal considering I couldn't watch the movie without them and it wouldn't hurt for me not to be there.\n\nMy father then decided to go on a whole rant about how he wanted to have family time and that my sister shouldn't have to have the inconvenience of the subtitles because she has the SATs tomorrow.\n\nI didn't listen to him and instead went up to my room but now I am grounded for a week. I tried calling my mother to see if she would agree with me but instead she decided to side with my father and sister and said I 'shouldn't be so selfish all the time'.\n\nI've been muling the whole situation over but haven't been able to think about it from their perspective so I decided to come on here. I alsc able to talk to my phycologist about it and she agrees with me. Am I the asshole?", "created_utc": 1685766112, "permalink": "/r/AmItheAsshole/comments/13z0k1x/aita_for_storming_off_when_my_father_and_sister/", "score": 32, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I’m being called an asshole for needing subtitles to be turned on while watching a movie with family because of cognitive and hearing issues. Most of my family say I’m the asshole but I don’t think so and neither does my phycologist. I wanted to post on here to hear other people’s opinions on the matter.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. \n\nThis isn't about the subtitles. This is about them being ableist jerks. I'll say this once, and I'll say it loud. \n\n*IT IS NOT SELFISH FOR DISABLED PEOPLE TO NEED THEIR ACCOMMODATIONS.* \n\nYour father and sister are MAJORLY TA.", "NTA. You should not be required to sit through a movie you cannot hear for “family time”. Family should accommodate *you*, if they request your presence. \n\nYou shouldn’t be punished for this, and what a stupid excuse-“your sister has SATs tomorrow”, okay? She can ignore the subtitles or go to bed early and get a good nights rest before such a rigorous test.", "NTA, I am partially deaf due to birth defect.  I watch everything with subtitles.  My wife with great hearing has been ok with it helping her when sound balance is off in a movie/show as well.  (Venom 2 was a perfect example, we could not make out what venom was saying half the time)  Growing up watching subtitled anime, subtitled english is just natural.  My BIL sometimes grumbles about it though, but the rest of my family is ok with it.  \n\nImo it is selfish to expect someone to watch something \"as a family\" when they can not enjoy it the same as everyone else if there is an easy way to make it so the hard of hearing can enjoy the movie and the normals can still enjoy it.", "NTA. And What does the SATs have to do with subtitles?", "NTA. Have they ever tried ignoring the subtitles? You are far from selfish and your family sucks", "From what I’m reading NTA. I have the same issue and use subtitles more often than not. \n\nIt wasn’t a bad ask and I don’t know how it inconveniences anyone but not being able to hear the show is an inconvenience.", "Absolutely NTA-I’m so sorry your family are so horrible to you. I’m disabled and being deaf is part of that. Movies either have to be a bit louder or subtitles in use for me. I stopped watching movies with my family for this exact reason. It’s not selfish at all to want to enjoy a movie fully even if that means subtitles. If your sister taking the SAT can be affected by you turning on subtitled she’s got far bigger problems than a movie.", "NTA. You came up with a solution that works for you (watching in your room to not \"bother\" them) and... they still got mad. Sounds like no-win for you regardless of the option you went with.\nI started watching TV with subtitles because of a friend and find it really helpful for myself. Plus, it's funny AF when the subtitle and dialog are just a little different. Or it is to me.\n\nI don't get how it's work for others to watch with them. It's not like you asked to watch a foreign film with English only in subtitles.", "NTA. You are asking for a very reasonable accommodation to take part in a family activity.", "NTA, you're not asking something crazy, just for them to accommodate a disability. Your family sounds toxic. And how would it possibly affect her SATs to have subtitles on a movie? That's ridiculous.\n\nI'm not a person who likes subtitles as I find them distracting, but I'm still gonna turn them on if I'm watching something with my mom, who's hard of hearing.", "NTA. I'm sorry your family sucks.\n\nEDIT: autocorrect sucks too.", "My kids always have subtitles on.  I have grown quite fond of them \n\nNTA", "If you can't understand the movie audio how are you having these conversations with your family?", "lol all this because of subtitles? YTA", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI, (15F), have cognitive problems and am slightly hard of hearing. Because of this I have trouble processing audio in movies and require subtitles.\n\nHowever, a few days ago when I went downstairs to eat dinner and watch a movie with my family and I was having trouble understanding the dialogue. I asked if I could turn on the subtitles but in response I basically just got screamed at and called 'selfish'.\n\nI tried explaining to them that I couldn't understand the dialogue because of my cognitive and hearing problems but they weren't having it. They said they shouldn't have to 'pander to my needs while trying to relax and watch a movie.\n\nWhen I finished my meal I decided to head back upstairs and watch the movie in my room with subtitles. I thought this wouldn't be a big deal considering I couldn't watch the movie without them and it wouldn't hurt for me not to be there.\n\nMy father then decided to go on a whole rant about how he wanted to have family time and that my sister shouldn't have to have the inconvenience of the subtitles because she has the SATs tomorrow.\n\nI didn't listen to him and instead went up to my room but now I am grounded for a week. I tried calling my mother to see if she would agree with me but instead she decided to side with my father and sister and said I 'shouldn't be so selfish all the time'.\n\nI've been muling the whole situation over but haven't been able to think about it from their perspective so I decided to come on here. I alsc able to talk to my phycologist about it and she agrees with me. Am I the asshole?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. Unless you're leaving out some major detail, like you screamed curse words at everyone and slammed your door, or you don't need subtitles at all, but just like them. But now if you have any trouble hearing or processing at all and the subtitles help but your family resists, that's not cool, and if you were at work instead of home, it would be illegal. Reasonable accommodations have to be provided.", "NTA. What the fuck? What’s wrong with subtitles? Is it just my house where we always have subtitles on regardless of who’s watching? A lot of ours have two language sets of subtitles at once. Honestly, what’s wrong with subtitles?\n\nNot selfish for not wanting to sit watching a movie that doesn’t make sense in a room full of ableist twaddles.", "NTA.    \nThey, on the other hand, are.\n\nI am fluent in English, and often use subtitles because too often actors talk too fast, or over each other, and it’s the best way to know what’s going on.", "NTA - next time you guys watch a movie turn the volume down or mute it and let them see for themselves how difficult it is for you.", "You're 15 now, so you have less than 3 years before you are out of there. I know it feels long, but it really isn't. Start planning now so that you can say farewell to their abelism the day you turn 18. NTA", "nta. i would tell them whats selfish is wanting you to sit there when you cant watch the movie because your dad wants family time. its not family time if someone is excluded. not turning on the subtitles was excluding you.", "NTA. I prefer subtitles and always have them on. It’s actually kind of weird now to watch something somewhere else without them! I understand that not everyone likes them or can ignore, but if that’s true in your family, then watching stuff needs to be off the table for family time.", "Definitely NTA, I watch everything with subtitles, and my husband has never said anything awful to me about it. Your parents sound like major assholes to me because having subtitles on the screen isn't hurting anyone.", "Inconvenience of subtitles???????\n\nIt's selfish to want to able to watch the movie with them, but it's not selfish to not want subtitles because reasons, then get upset when you leave because you can't watch the movie? \n\nWhat hell is wrong by with your parents. NTA", "I think I have misunderstood the concept \"family time\". It might be because English is not my first language.\n\nI thought \"family time\" was when a family hangs oit together and does something they all can be a part of. Like playing a board game, or a movie that they watch together.\n\nFamily time at OP.s house seems to lack the \"together\" part. If OP was not able to understand the movie but still was required to sit there, then \"family time\" means only \"presence of the family in one room\". Is this the true meaning of \"family time\", or is it only OP.s father who is a strange man?\n\nPlease enlighten me.", "NTA.\n\nAs someone with ADHD sometimes I need captions to understand what’s going on. However whenever a family member sees it they start asking questions and I never feel like dealing with it. So I just keep it off. But talk about this with them and if they keep calling you selfish then keep being selfish. It’s not about the subtitles, it’s about the fact that they’re being ableist denying accommodations to you.", "NTA - the subtitles should be the rule not the exception in your house.", "Wtf? How in the seven hells does your sister having SATs tomorrow have _anything whatsoever_ to do with having subtitles on? NTA. Your dad, however, is a massive AH. Subtitles are not an inconvenience. If you need them, you need them; if you don’t need them, ignore them. It’s not hard.", "A movie without subtitles is gibberish if there’s any other sound (a fan, people breathing.) idk why, not hard of hearing. Just was a thing one day and ever since. \n\nWhy watch a movie you can’t even understand? May as well watch a foreign movie without subtitles. Im not understanding where selfish even comes in tbh.", "Thank, it’s been really affirming reading these comments", "I don’t know about you but I can’t stop from reading subtitles if they are on. If sister was trying to have some mindless movie chill time before the biggest test of her life thus far, I can see it being too much that particular time while needing brain in low power mode.", "I mean, I *cannot* ignore the subtitles. Like, ever. That being said, I absolutely would not deny a family member the right to be able to comprehend what we were watching together. \n\nOP, NTA.", "Agree \n\nAs a person that needs subtitles. \n\nF*** them. It’s not “family time” when they are watching something you can’t follow. You are just sitting in the same room, watching them, watch TV. \n\nCan you get a hearing test or doctor’s note? I would put it on the table at the next family dinner and state:\n\nFamily, this note says I cannot hear the TV and need subtitles. This is a no-kidding disability that you are deliberately ignoring. \n\nFamily you have 5 choices:\n\n1. Turn on the subtitles \n(Really what the big deal? My family was like wow I never realized how much I was missing until subtitles)\n2. Buy a Bluetooth(?) tv that allows you to wear headphones \n3. Buy you “the in ear” hearing aids\n4. Let you watch the show on your computer with AirPods and subtitles in the same room with them. \n5. Let you leave.", "It’s a lot easier to understand what someone is saying if I’m in the room with them because their voice is clearer and I can read their lips. It’s hard to read lips with someone being on a screen. Not to mention that the movie was animated so I couldn’t read lips at all.", "I can hear just fine but need subtitles or miss a lot of dialogue.", "Can I ask you to please explain your reasoning? I don't understand how OP is the AH", "Random unsolicited advice: if you mean that you used to be able to hear with background noise but no longer can/have trouble distinguishing sounds, that actually is indicative of certain types of hearing loss. So if it ever becomes an issue, don’t hesitate to ask your pcp to refer you for a hearing test.\n\nIf I misunderstood your comment, please ignore me haha.", "You're nta at all!!\nSeriously some people seem to have this weird vendetta against subtitles for no reason.", "That is such bullshit. Subtitles aren't a big inconvenience at all.\nSurely you're being sarcastic?", "I’m like that too. But of course if somebody else needed the subtitles I wouldn’t complain.\n\n(Omg isn’t it the worst when the subs and dialogue don’t match? That makes me lose my mind lol.)", "I live in a non-English speaking country, so EVERYTHING we watch has subtitles. \n\nPeople still graduate.", "It depends on the person. I have an easier time understanding movies with subtitles, but I have family members who struggle to not focus on the words. In our case, it's the fun, different flavors of adhd.\n\nHowever, OP is definitely NTA. They can't scream at OP for wanting subtitles, then demand they hang out with the family and call them selfish for not. (well they can, they obviously did, but they're not in the right about it)."]}