{"id": 18885, "submission_id": "13zmpkm", "title": "AITA for telling one of my best friends that she was absolutely not my ex-bf’s type", "selftext": "My(f32) ex-bf (m35) and I broke up about 5 months ago after 4 years together. He is the most amazing guy and I love him so much. These past months have been the worst in my life. He is very handsome and successful and rich (relevant). I’m sure he will not have any problems getting into a new relationship.  He broke up with me because we don’t want the same things. He wants children and a family and I don’t. I think we stayed together for so long even though we knew we wanted different, we probably kind of thought we would change or change each other and that love is all it matters. I still love him but I don’t know if he still loves me. When we broke up I asked for a clean break. It means no contact because I needed to get over him. \n\nMy friends know all this and they know how much I love him. One of my best friends, f28, jokingly said that he was up for grabs a month after we broke up. I ignored her. I thought it was a bad joke. She is very beautiful and she basically can get whoever she wants (she always said that she never been rejected before and I believe her). I know my ex didn’t really like her because she  wants a rich guy and because she had done a lot of plastic surgeries. \n\nLast time we had dinner she brought up wanting to date him and one other friend said that we didn’t do that to each other. She laughed it off and I said well you can try. But you are not his type. She said that she never been rejected before and this is where I might have been an AH. I told her he didn’t like greedy girls with lip injections and fake breasts. She started crying telling me now she won’t feel sorry taking him because I’m a b and an ah. My friends sided with her on this.\n\nI waited until I was in my car to start crying. I don’t think I’m the AH. She knows I still love him and not over him. Couldn’t she wait at least? I know she is panicking because she kept saying that he won’t be single for long. I don’t know. Tell me if I should apologize", "created_utc": 1685820272, "permalink": "/r/AmItheAsshole/comments/13zmpkm/aita_for_telling_one_of_my_best_friends_that_she/", "score": 125, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I told my best friend she wasn’t my ex bfs type\n\n\nI embarrassed her amongst friends and attacked her appearance and love for money\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. She was disrespectful for those comments. Don't apologize because she isn't your friend.", "NTA\nShe knew how you felt and still decided to act upon it. You were hurt and told some harsh truths. Not all truths need to be voiced, however you did. \nYou should apologise for the hurt feelings you have caused. But ultimately NTA.", "Obviously it was a mean thing to say but she deserves the hate. She’s the worst kind of friend you can have and you need to dump her. NTA", "NTA - She’s the typical completely insecure type. Cut her out.", "ESH. Her WAY more than you. The way she dismissed 1. The fact that you still love him 2. The unwritten rule that you don’t date your friends ex and 3. Your polite and tactful comment that she wasn’t his type just shows her true colors. \n\nIf she’s full of herself enough to say that she’s never been rejected, she can stand to be knocked down a couple notches.", "You told her she wasn’t his type (which you shouldn’t ever have had to be in the position to have to tell her that if she was really your friend). She responded that she’s never been rejected before- insinuating that she thinks she is his type, in a very braggedocious way and pointed way- you then clarified what about her makes her not his type since she clearly didn’t get it. Truth hurts. Don’t put yourself on such a high pedestal if you don’t want to come crashing down! You may have been a little bit of TA in the way you delivered the truth, but it wasn’t uncalled for!", "You should keep in mind your friend might be able to get anyone she wants but that doesnt mean they will take her seriously or that she can retain them. Its always funny and slightly sad when i see tik toks of women showing themselves off and confused about how they are so beautiful but still single. Most Men, especially those past 30 value more than just beauty in a relationship.", "ESH. You two don’t even sound like you like each other.", "ESH \n\nShe sucks for openly trying to go for someone you’re clearly not over. \n\nYou suck because you insulted her appearance when you could have just left it at “you’re not his type”", "NTA. She sounds like a piece of work", "NTA. Oh did it hurt her feelings to have her greed called out? \n\nIf she didn’t know that her hunt for someone to exploit was morally wrong she wouldn’t have been hurt.\n\nIf she were truly satisfied with the work she’d have done she’d have like been able to just shrugs it of, perhaps with a comment about it looking good no matter originality.  She’s clearly got some problems with her body. \n\nPossibly because her personality and morality sucks so all she has is looks and she knows it.", "ESH\n\nYou sound extremely superficial in the way you described your ex and you and your \"friends\" seem more like frenemies than actual friends who care about each other. \n\nIf it's true that she's not his type, she'll finally get find out what it's like to be rejected so I'm not sure why you're so worried. However, the way she showed no respect for you makes me wonder why you bother spending time with people like this.", "ESH, you both sound like shitty people. Just stop being around each other.", "ESH. She should know not to even think about dating a friend's ex but you got downright nasty. How can you possibly think you don't owe her an apology? You could have taken the high road and simply told her it was important to you that she not go after him.", "ESH You say this is your friend?  Friends don’t break girl code.  Friends don’t hit below the belt.", "ESH. Yea, she's being a shitty friend. Friends shouldn't go after friend's exes and she is being inconsiderate and tactless here. But you're being a shit friend too; friends also shouldn't try to hurt each other by criticising appearances. That was you aiming to hurt her.", "NTA cut her out of your life. A friend would never want to date your recent ex.", "YTA and should apologize. It's perfectly fine to be upset with your friend for making insensitive comments. It is never okay to make reference to a friend's appearance and history of cosmetic surgery. You also assassinated her character by calling her a gold digger in front of other people. Unacceptable.", "NTA. She knew the context of your relationship with him and was weird for joking about getting with him to begin with. Furthermore, she set herself up to be checked when she kept pressing the fact that she had never been rejected before. I think that you were speaking from a place of frustration and anger when you read her for filth, but she shouldn’t have crossed that boundary if she really cared for you as a friend. I would only say apologize for insulting her choices to do plastic surgery only if you can see yourself rekindling the friendship. otherwise, I firmly believe that she’s not a person that would be good to keep in your circle.", "I mean, if everything else is fake about her, then I'm not sure why you thought she would be a real friend. NTA, but you should find some real friends.", "YTA.  You don't have a claim to him.  He wanted something that you don't and he ended things.  \n\nYour friend is a stuck up snob.  Send her my way, I'll gladly reject her and it will hurt because I'm not someone she would ever want, but for someone that far beneath her to reject her would deflate her fake boobs.  She sounds like a trainwreck, but you shouldn't have insulted her.  Let her take her shot and sit back and watch her either get rejected or have the life you refused to accept.", "You sound bitter. Either call your ex and work on getting back together or move on. You were cruel. She doesn't have to wait or get your permission to date your ex.", "ESH- what you said was absolutely mean spirited. \n\n“Go ahead and try your not his type” would be not the ah\n\nYours was a personal attack.", "Yes, YTA. You should apologize. That was a horrible thing to say. Besides, your relationship with him is over. Your ex and your friend are free to date if they want to.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy(f32) ex-bf (m35) and I broke up about 5 months ago after 4 years together. He is the most amazing guy and I love him so much. These past months have been the worst in my life. He is very handsome and successful and rich (relevant). I’m sure he will not have any problems getting into a new relationship.  He broke up with me because we don’t want the same things. He wants children and a family and I don’t. I think we stayed together for so long even though we knew we wanted different, we probably kind of thought we would change or change each other and that love is all it matters. I still love him but I don’t know if he still loves me. When we broke up I asked for a clean break. It means no contact because I needed to get over him. \n\nMy friends know all this and they know how much I love him. One of my best friends, f28, jokingly said that he was up for grabs a month after we broke up. I ignored her. I thought it was a bad joke. She is very beautiful and she basically can get whoever she wants (she always said that she never been rejected before and I believe her). I know my ex didn’t really like her because she  wants a rich guy and because she had done a lot of plastic surgeries. \n\nLast time we had dinner she brought up wanting to date him and one other friend said that we didn’t do that to each other. She laughed it off and I said well you can try. But you are not his type. She said that she never been rejected before and this is where I might have been an AH. I told her he didn’t like greedy girls with lip injections and fake breasts. She started crying telling me now she won’t feel sorry taking him because I’m a b and an ah. My friends sided with her on this.\n\nI waited until I was in my car to start crying. I don’t think I’m the AH. She knows I still love him and not over him. Couldn’t she wait at least? I know she is panicking because she kept saying that he won’t be single for long. I don’t know. Tell me if I should apologize\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "[removed]", "NTA she was trying to hurt you in the worst way saying she was going to date him *more than once*\n\nShe can dish it out but not take it 🤷‍♀️", "NTA she knew what she was saying and she most likely is making moves. Your friends immediately jumped on her bandwagon after saying oh we don't so that do each other. Clearly they do.", "I just can’t believe the ages I’m seeing", "NTA, but your friend is. She needs to be booted from your life.", "NTA but kinda ESH despite me liking what you said to her.", "I don’t think she wants me as a friend anymore if she ends up with him she will probably not want to be friends anymore and if they don’t she will always think of my comment as the reason", "I didn’t want to say it but something came over me when I told her that she wasn’t his type and she started laughing and said she has never been rejected before. I blurted out everything \n\nShe knows he was the one dumping me. I felt like she was saying that in a way", "I never thought she would do this, especially when she knows I still love him. I would never have done this to her.", "She typically has the best confidence so I was a bit surprised she wouldn’t just laugh at me. But it was something that made me feel that she maybe serious about him and didn’t like my comment", "Until she made remarks about dating my ex I loved this girl. Now I’m not so sure I like her.", "Or she could have said “wow what a great friend you are trying to date my ex but you’re not his type - he told me this himself while we were dating” or whatever", "I don’t think it is obvious in my post. I think she is very beautiful and I don’t think plastic surgeries are wrong. Just that it’s not his type.", "I think she is very beautiful I didn’t criticize her. I told her what he didn’t like. Is it criticism to tell someone they’re not someone’s type? Would my ex be the ah if he told her she wasn’t his type because of this and this", "I disagree, when somebody is heartbroken over a guy, the last thing to do is to say that you will try and date him to their face as they are trying tk get over him. All OP did was mention the guys preferences which was not her. If he doesn't want a phony women who wasn't comfortable enough in her own skin then he won't be with her. She wants a rich guy and so calling her a golddigger isn't out of the question anyway. She is definitely NTA", "I don’t think that OP assassinated the girl’s character if she is notorious for approaching men that are rich for the purpose of taking the backseat financially in a relationship. Her friend shouldn’t have made jokes or even insinuated going for her ex knowing that they broke up because of different wants, not because they fell out of love. I think that she might have taken it too far in how she addressed her after the fact, but if you cross a boundary in a friendship you cannot expect people to lie there and take it. OP is NTA", "if they end up together that speaks more to both his character as well as hers, she’s very shady. im sorry that you were disrespected.", "Would being a stuck up snob not make it as ESH?", "Well yeah but I'm not sure if you realise but you shouldn't date your friends ex. And also I doubt he would even date her", "Why is it a horrible thing to say? It sounds like she has lip injections and fake boobs, and OP knows her ex boyfriend isn’t into that. I guess calling her greedy would have been a bad thing to add if she’s not greedy… but going after a man you friend isn’t over does strike me as a bit greedy, so that was also probably a truthful, not horrible, thing to say to her.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "She doesn't sound like a friend since she's been waiting to date him.\n\nIf anything she had been staying close to you just to have access to him.\n\nYou need to make a clean break from her too.\n\nAnd how shallow is she that she thinks that her looks alone will be an equivalent to everything that you meant/still mean to your ex.\n\nAlso you need to make sure that you truly want a clean break with your ex. You can't go back and forth calling dibs on him.", "Nta. She doesn't sound like she ever was a friend to you. A real friend wouldn't be wanting to date another friends ex. She's ridiculous to think her behavior was ok. Don't apologize to her. If anything she owes you one.", "Most girlfriend groups have a rule that you don't date your friend's ex, especially if they were together in a serious long-time monogamous relationship. She is betraying you by trying to get with him and your other friends aren't much better by siding with her. I'm sorry this is happening to you, op, you deserve better friends.", "Don't even think about apologising to someone like that. How awful of a person is she to pursue the ex of a friend, especially when you still have feelings for the x. People like that don't deserve any type of apology.", "This type of person fakes having confidence. Which is why she also needs to fake so much of her body.", "A lot of people with \"confidence\" are just \"fake it till you make it\"\n\nIf she needs to brag about the success her beauty has snared her, she's in that group.", "y’all are both adults. she’s wrong for trying to after your ex and your wrong for coming at her for her cosmetic surgeries. y’all really could have just had an adult conversation about it.", "Oh no there is nothing wrong with plastic surgery. Everyone is free to do what they want imo.\n\nHeck you hate your nose? Go for it get a new one if you want. Go live that life be the you that you want with the body you want. More power to everyone for having the bravery to do what makes them happy and all that.\n\nBut I honestly can’t help reading between the lines and getting that she’s not completely satisfied.", "you called her greedy. you absolutely criticized her and stop pretending that you didn’t. ESH", "But that is generally how the friend is.  She didn't do anything special in this interaction to earn ESH for me.", "Yes whether I need to apologize for my comment or not, I don’t think I can be friends with her. I would never have done this to a friend", "Or at least wait until your best friend doesn’t start crying the second he is mentioned. I would never have hurt her like that", "Seriously! I can’t even FATHOM dating one of my friends’ exes, and my friends would lose their mind if anyone else in our circle even hinted at trying to.", "She was rude and selfish first on multiple occasions s. You responded with rudeness, but justifiable. Don’t apologize, just stop seeing her. Your friends were right when they first said “we don’t do that.”", "Just apologize to yourself for trusting her ass for too long.", "She sounds like a selfish gold digger. She definitely isn’t a true friend. She was very disrespectful to you. You may have been harsh, but she had it coming in my mind. It’s basically tit for tat. She was being cruel by talking about going after the ex you are still trying to get over. She’s probably the type that would pop out a kid even if she didn’t want one just to keep her meal ticket. Hopefully your ex isn’t stupid enough to go for someone like her.", "Warn your ex. You kinda created a situation that now your friend is gonna do it just to prove you wrong. If he ends up with her fine. We dont control who people date after we break up. But anyone who condones that gets moved to my outer circle of friends and does not get the privilege of being in the know about my life. NTA.", "She loves children so in that they’re compatible. He never fully criticized her around me out of respect but he had made some remarks about her wanting other people’s money. He himself has been a target for people out to get money and it hurt him. \n\nAbout her appearance, he never said he didn’t like her surgeries but he is very outspoken when it comes to plastic surgery. Not her in person", "I can’t warn him. I asked him for space to get over him and tbh, if he chooses her, who am I to stop them?", "You asked for space, but you didn’t travel to another planet. Send him an email. Tell him you appreciate him respecting your request for space, and you are temporarily breaking that space because you want to show him the same respect and earn him that the vulture bf is coming for him. \n\nNTA", "You are right here. If she goes after him and he falls for it, then he'd have done that with someone else like her. My money is on him not falling for it.", "If he’s a decent person he will be disgusted by her approaching him when he knows you were friends and she’s just after men’s money.", "Write a letter, there's enough distance in letter writing that you can keep your space.\n\nI think anyone would want to know that someone is targeting them both as a gold digger and for revenge."]}