{"id": 18881, "submission_id": "13zl43t", "title": "AITA for not letting my sister move in with me after she got evicted", "selftext": "After college, my sister told me I could live with her rent free, and I’d basically be free childcare for her, as well as I had my own job at a landscaping company. I lived there for 3 years, paid for the internet bill, took care of my nephews, who were 2 and 3 at the time, and did the lawn care. I had met my now husband during this time, who had basically moved in with us afterwards for about a year before we bought our house. He took over lawn care, did general maintenance around the house, helped me care for my nephews, helped with the groceries etc. all while my sister worked, and paid the other bills. When we moved out, my sister had had her boyfriend of a few months move in and I assumed everybody would be okay, bills were getting paid, and my nephews were getting taken care of. \n\nAfter my wedding in 2022, my sister messaged me and said she, her boyfriend, and my two nephews needed to move in bc they were getting evicted. She had told me the entire time I lived with her, she was always behind on a bill/rent and her landlord was finally over it and kicked them out. Now, had she told me she was behind on anything when we lived together, OBVIOUSLY I would’ve helped her. Every time I asked if she was okay, if there was anyway I could help her financially, she said she was fine, or if she asked for money, I’d send it to her. \n\nI told her we didn’t have the room for them. Our house is small, beside a busy road, and we have two giant Saint Bernards that my nephews are afraid of and have a tendency to run away if they get out of the fence gate. We are very protective over them and our cats bc we don’t have kids of our own, and would be devastated if anything happened to them. Our spare bedroom isn’t big enough for 4 extra people living in it, along with all their stuff. She lived in a 3 bedroom apartment with a finished attic that I lived it. We don’t even have room to host more than 2 extra people bc our house is so small. I calmly tried to explain this to her, just to have her call me a bitch, selfish etc. Mind you, she also quit her job, as the suggestion of her boyfriend, who is also jobless, to do doordash/Uber, and get her Etsy shop up and running, with no backup plan if that didn’t work out. \n\nI, and the rest of my family have given her several other options to try and help, but she was dead set on just living with me and my husband for an undetermined amount of time. Had it been just her and my nephews, it would’ve been fine. But I’m also not a fan of her boyfriend, who is a bum. Sometimes I still feel like just giving in for the sake of my nephews, but I have boundaries that. Feel like she’s not respecting, and just wants to play a victims bc we’re not throwing money at her to get her back on her feet.\n\nAdditionally: her boyfriend, after we moved out, had his sister, her kids, his kids, his grandkid, all move in. And NOBODY contributed. There were upwards of maybe 12 people living in their house after we left.\n\nEdit: since people are unaware what helping with my nephews meant, I picked them up and dropped them off at daycare during the week so i could go to my every day job. Made breakfast and dinner. Helped buy clothes. Helped with bedtime. Basically was their 2nd parent since the father was hardly in the picture. The only things I didn’t do was take them to doctors appointments.", "created_utc": 1685816766, "permalink": "/r/AmItheAsshole/comments/13zl43t/aita_for_not_letting_my_sister_move_in_with_me/", "score": 839, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I didn’t let my sister move in with me after she got evicted\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. You weren't a grifter or bum when you lived with her. Childcare is expensive AF and you did that plus some bills and the lawn care. So if she's suggesting that you didn't contribute when you lived with her and you coasted, that's a lie. If that was an issue at the time, it was her job to bring it up. Obviously you didn't know she was struggling so how is any of that your fault?\n\nYou also made valid reasons why this won't work. The biggest reasons being I don't think you would ever be able to evict them and they won't contribute anything. They are gig workers and want to make money on Etsy. Both can happen but if for 1+ year they haven't been able to stay afloat on their own and make rent payments, what's to say they're even trying and aren't just looking to mooch?\n\nIf you have the finances to comfortably do so, you can offer her some money to stay afloat and beg the landlord to keep them. Also, people are giving her options, she just doesn't like them and is deadset on your home.", "NTA the circumstances of you staying with her are very different to her circumstances. You have no room to take in four people. It’s not that you and the family haven’t offered support and options, she just doesn’t want to stick to them. You’re doing nothing wrong.", "NTA. I get it, you want to help family but space is a commodity and there are times when there isn't enough to go around. Why does it \\*have\\* to be you, given there are other options on the table?\n\nI am perplexed as to why she thought it was a good idea to quit her job if she was already struggling with rent/bills - something you had volunteered to help out with - at the behest of her unemployed boyfriend, who sounds like a freeloader.", "NTA, dont let your boundaries be crossed by guilt tripping.", "NTA. Don’t let her guilt trip you, you’ve already acknowledged you don’t have the space and their not working. You will be stuck with them for years. How long before they start telling you to get rid of the dogs because the children are scared and you need to prioritise the kids over dogs? Do not allow this.", "NTA.  She clearly had boundaries and terms set for when you lived with her, but she can’t respect that in turn?", "NTA  \nShe has been given options for help, but she's set on coming to live with you? Yeah, she did let you live with her rent-free, but the house you and your husband bought is too small for 4 extra people...", "NTA. Nannies get paid as well as get free housing. If you let her move in, she'll never leave.", "Info: how long ago did you move out? Also was the new boyfriend helping her financially or no? I feel like it’s suspicious that as soon as this guy shows up she gets evicted.", "What ended up happening to them? Do they live in their car?", "NTA. You literally don't have the space to put her. Never mind that both her & her boyfriend were totally irresponsible with their finances. She has other options. Your sister is an adult & you are not her keeper. Don't give in. \n\nYou would never get rid of her once they got in the door. Never mind having to support the whole family because the adults are deadbeats. Circling back to...where the hell would you even put them in your small house.", "NTA she has numerous options but wants to live with you to get free childcare and lawn service again", "NTA", "NTA, Don't be guilted, she isn't wanting to help herself.", "NTA. You shouldn't have to bring her boyfriend into your house.", "NTA. I feel like you \"paid\" for living with your sister by providing child care, lawn care etc. That made you even at this point. Aside from the logistics of her entire family moving into your home, it's unfair for her to call you selfish when you provided services for your previous living situation.", "NTA - however: she let you live there rent free for 3 years. Is it possible for you to take in your nephews, so they can have some stability in their life? Or set a boundary of your sister and nephews but not the boyfriend?", "Changed to NTA:   YTA.  She let you live with her for 3 YEARS RENT FREE so you could save up for your own place.   She let your now husband live there rent free for A YEAR. Now the two of you can't be bothered to help her out for any period of time?  I get saying the boyfriend can't move in.  He had nothing to do with helping you, but your sister?  That's cold.\n\nEDIT:  Based on OP's later comments that they offered to allow sis and kids to move in without boyfriend and sis declined, I'm changing my vote to NTA.  Wish that was included in original post.", "You lived there for 3 years and clearly didn't pay your share of expenses.  I understand not wanting them to live with you (6 people in a space you got for 2 people is overwhelming).  Perhaps you could help her out with some money instead.  She's family and even if you don't like her boyfriend, she does.", "[deleted]", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nAfter college, my sister told me I could live with her rent free, and I’d basically be free childcare for her, as well as I had my own job at a landscaping company. I lived there for 3 years, paid for the internet bill, took care of my nephews, who were 2 and 3 at the time, and did the lawn care. I had met my now husband during this time, who had basically moved in with us afterwards for about a year before we bought our house. He took over lawn care, did general maintenance around the house, helped me care for my nephews, helped with the groceries etc. all while my sister worked, and paid the other bills. When we moved out, my sister had had her boyfriend of a few months move in and I assumed everybody would be okay, bills were getting paid, and my nephews were getting taken care of. \n\nAfter my wedding in 2022, my sister messaged me and said she, her boyfriend, and my two nephews needed to move in bc they were getting evicted. She had told me the entire time I lived with her, she was always behind on a bill/rent and her landlord was finally over it and kicked them out. Now, had she told me she was behind on anything when we lived together, OBVIOUSLY I would’ve helped her. Every time I asked if she was okay, if there was anyway I could help her financially, she said she was fine, or if she asked for money, I’d send it to her. \n\nI told her we didn’t have the room for them. Our house is small, beside a busy road, and we have two giant Saint Bernards that my nephews are afraid of and have a tendency to run away if they get out of the fence gate. We are very protective over them and our cats bc we don’t have kids of our own, and would be devastated if anything happened to them. Our spare bedroom isn’t big enough for 4 extra people living in it, along with all their stuff. She lived in a 3 bedroom apartment with a finished attic that I lived it. We don’t even have room to host more than 2 extra people bc our house is so small. I calmly tried to explain this to her, just to have her call me a bitch, selfish etc. Mind you, she also quit her job, as the suggestion of her boyfriend, who is also jobless, to do doordash/Uber, and get her Etsy shop up and running, with no backup plan if that didn’t work out. \n\nI, and the rest of my family have given her several other options to try and help, but she was dead set on just living with me and my husband for an undetermined amount of time. Had it been just her and my nephews, it would’ve been fine. But I’m also not a fan of her boyfriend, who is a bum. Sometimes I still feel like just giving in for the sake of my nephews, but I have boundaries that. Feel like she’s not respecting, and just wants to play a victims bc we’re not throwing money at her to get her back on her feet.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "I'd bet money that the loser bf has convinced her that sis owes a rent-free life the equal amount of time that she stayed, so 3+ years. Of course, he's conveniently skipping over the value of the live-in daycare, free lawncare, groceries, maintenance from bf the year he lived there, etc. That's why nothing else will do...NTA, OP\n\nedit: to add judgement", "We bought our home January of 2021. She got evicted December of 2022. He apparently took over making sure the bills were paid. She told me at the time this was very good for her mental health bc she didn’t have to worry about them and could focus on her and her boys.", "They’re with a friend as far as I know.", "I offered that but she didn’t want to do it. It was either all four of them or nothing. Obviously I don’t want my nephews being homeless. Everyone keeps saying my sister “has to hit rock bottom” before realizing she’s just screwing her life up staying with her boyfriend. But at the expense of my nephews livelihood, I don’t like.", "Rent free in exchange for taking care of her nephews. And doing other chores.", "Agree.", "Sister got three years of FREE child care, lawn work and one year of FREE maintenance work out of the deal. And OP would let her and the nephews move in but not the bum boyfriend. Sister doesn't want that.", ">clearly didn't pay your share of expenses.\n\nDo you know how expensive childcare is? Lawn services?", "Like I said, my entire family gave her other options. She just doesn’t want to accept them. My dad has plenty of space for them, but she refuses. I also offered to have just her and my nephews, but her boyfriend was not part of that deal bc I wasn’t going to have someone who refused to get a job live in my home. \n\nAlso, this man is known for stealing. I would never feel comfortable with him in the house. But she won’t separate from him.", "Ahhh yeah I’d dig deeper if I were you cause it sounds like he screwed her over somehow. You’re definitely not the reason she got evicted. I think the fact that she’s blaming you and trying to guilt you into letting them all stay with you for an unknown amount of time is all reason to put your foot down and say no.", "Your point?  Mine is that OP and partner were given a total of 4 years to get themselves financially stable.  They won't even give sister back 1 night.", "Yes, I've paid for both.  It sounds like she moved in with her sister and was justifying why it was okay.  I'm sure she did help out with those things, but is that the REASON she moved in and was it at the request of her sister?  I sense that it wasn't.", "NTA\n\nYou contributed when you lived there.  Now, she wants to mooch off you.    \nAs you said, if she and her kids need a place, it is one thing, but her BF is a looser and moved in his loser family?  No way.", "Easy NTA.", "NTA\n\nYou contributed to her household and owe her nothing. Your home isn’t conducive to having any long term guests. Stay strong. Don’t cave. Continue to try and give her suggestions to help her out.", ">Additionally: her boyfriend, after we moved out, had his sister, her kids, his kids, his grandkid, all move in. And NOBODY contributed. There were upwards of maybe 12 people living in their house after we left.\n\nWTF. NTA, she has made this bed herself.", "NTA. If she continues to give you a hard time, calculate roughly what the service you provided cost and then look at the price of renting. If there is a difference, send her some money.", "Guess what? Your sister is a bum too, not just the BF. She has been given multiple optio0ns and doesn't like any of them? Sorry. Your home is not the place for them. I'm sorry for your nephews, but sister is their mom. She decided her BF was more important than security for her children. You can't fix stupid. Sister has to come to her own conclusions on that. Her not taking money when you offered seems like a ploy to get evicted and not have to take BF's family along with her.", "Wow.\n\nNTA, Sister and BF family needs to get it together, all 12 of them.", "Another story about evicted relatives do to their own bad financial decisions. Definitely NTA. You don't have the space. Even if you did it will not end well and cost you emotionally, physically and financially.", "NTA.", "NTA you had no idea she was struggling. You have already done so much for her already and it’s on her that her rent wasn’t paid. You done enough, but if you really want to help maybe try and help her find a place. If she refuses that then she’s on her own.", "NTA. Gross", "NTA. Don't let them move in", "NTA. I could see if it was just her and the kids, but you'd probably never get that dude and his hangers-on out of your house.", "[deleted]", "[deleted]", "Nta cuz she lied😡", "NTA", "NTA. Sounds like the 12 people that moved in after you moved out caused her financial difficulties as well as a bf that does not work", "From OP's additional info:\n\nher boyfriend, after we moved out, had his sister, her kids, his kids, his grandkid, all move in. There were upwards of maybe 12 people living in their house after we left.\n\n12 fucking people in a 3 bedroom house with only 1 on the lease? If I'm the landlord, there is no fucking way in hell that I'd let sister and her family continue staying. \n\nAnd how old is sister's boyfriend that he has a grandkid living with them? I could be wrong, but sounds like OP is in the 25 year old range.", "[removed]", ">*dont let your boundaries be crossed by guilt tripping*\n\nYou did more than necessary to support the household when you lived with her.  You owe her nothing.\n\nYou don't actually know if she is telling you the truth, either.  \n\nIt seems like the problems started with the boyfriend that you describe as a *bum*.  How did they expect to pay the rent when they don't have jobs?  \n\nI'm sure that the landlord didn't want so many people living there either, depreciating his property.  Don't most rentals also have limits according to fire regulations?  Even for a large apartment, 12 people is quite a group.\n\nFor her to change so much makes me fear that the bum boyfriend could have gotten her into drugs, too.\n\nNTA", "I was going to suggest this as well…", "it wasn't 'rent free'. op paid bills, she did child care, she did home maintenance. she paid rent, even if it wasn't in the form of cash, and beyond that, her reasons for refuseal are valid. there is a difference when letting two people move in when you have the space and letting four people move in when you don't", "it being the nice thing to do is irrelevant when it's not practical. four people cannot move into a single bedroom for an indefinite amount of time, especially when two of them have no jobs and will not be able to contribute in any way.", ">According to Nanny Questions, a website created by Canadian parents for parents, you can expect to pay a live-in nanny a net salary between $1,000 and $1,200 per month, based on a 40-hour work week. This is based on guidelines established by Canada's live-in caregiver program. The net salary is calculated after deductions for room and board, income tax, EI and CPP. (Check out this Canada Revenue Agency website for a calculator that allows you to back in to a net salary after taxes.)  \n>  \n>There is no set wage for a live-out nanny, as they don't fall under the live-in caregiver program. While wages are open to negotiation, the net salary is typically between $400 and $500 per week.\n\n[https://www.theglobeandmail.com/globe-investor/personal-finance/household-finances/the-costs-and-benefits-of-a-nanny/article793063/](https://www.theglobeandmail.com/globe-investor/personal-finance/household-finances/the-costs-and-benefits-of-a-nanny/article793063/)\n\nNow that's from 2009 so costs would obviously have gone up significantly.\n\nShe 'paid' plenty.", "Did you actually read how the arrangement worked when OP lived with her sister?  And the extra things her now husband did when he moved in for a year?  As far as OP knew, her sister was good for money while she lived there and she did check that she could manage all the bills. It's not her fault that her sister didn't tell her the truth.  And again, if you read it properly, OP doesn't physically have the room in her house for 4 more people.  So where exactly is she meant to put them?", "Found the one who didn't read the post 🙄", "🤯 /#?')$)#!$/!_)#)?_?$ then this is an even bigger hell no", "Sounds like the best you can do is watch from afar and be there for the kids when they need it. You’re NTA at all. Not even close.", "I feel like you weren't that happy or comfortable while living with her... but since she's family and did take you in, you'd like to try telling her that she can move in with the kids for six months tops, no bf and strict rules about the pets. Except you don't trust her not to get too comfortable and demanding, nor not to bring the deadbeat boyfriend in your house.\n\nI'd definitely check the laws in my state and figure out what rights I have if I let her in, in case the situation gets dire enough in the future that she's willing to drop the extra weight that is her moocher boyfriend. Cover all bases.\n\nNTA.", "I’m sorry all of you are going thru this. Sounds like the best you can do is watch from afar and be there for the kids when they need it. You’re NTA at all. Not even close.", "I posted before the addition from OP that allowing sis and kids was offered.  It changes my answer to NTA since OP did offer.  Initial writing came across as an instant no.", "[deleted]", "Lol.  Helping with the kids isn't being a nanny.  Good try though.", "she isn't asking for 'one night' and you're out of your mind if you think otherwise", "My bad. I mean I agree that they should give them like a few weeks to figure out living situations. But I meant I was more concerned that they didn’t want to even consider any of the other alternatives offered, which seemed a little odd to me. Especially considering they wanted to stay for “an undetermined” length of time. Which is why I was saying OP was NTA.", ">i think its reasonable to put a time frame together\n\nNot to be judgemental but I seriously doubt that the sister and her bf would respect any agreement that was made.", "it's irrelevant. op paid for her postion there  regardless of whether you agree with it or not. and you're also ignoring the fact that ops sister had the room to house them. op does not.", "you have no idea what op did while 'helping with the kids' or how long each day she helped. for all you know, she was playing the role of nanny, especially if she was the one watching them all day while sister was at work.", "It's equivalent work, nice try at dismissing and devaluing OP's contribution though.", "No, i understand, and thats why i would implore a legal document that they couldn't abuse. Jeez im not sure why people are downvoting so much i never said she was an AH. Lol im just saying there are solutions and i think we should be able to help family out when we can.", "That's not how I interpret what she posted.  It sounds more like she moved in and didn't pay rent but helped around the house some.", "I have no more idea than you do, except the word she used.  Her sister said she could live there (which sounds like she invited herself).  It doesn't say she watched the kids while the sister was at work.  She said \"took care of my nephews, who were 2 and 3 at the time\".  This could mean that she watched the kids for an hour a week while mom went on a walk.  She also moved her damned boyfriend into her sister's place.  \n\nThe words OP used makes it sound like she was trying to justify mooching off her sister.", "It's not equivalent work.  It feels like she was mooching off her sister and making excuses for it.", "I picked and dropped them off at daycare before going to my every day job. Made them dinner. Helped with bed time routine. And watched them on the weekends when my sister had to work.", "NTA - she has picked you because she thinks you owe her so she can take over your house for as long as she wants (other family may want her to pay rent and have a time limit).\n\nYour home is already full and inappropriate for their use. Stick to your guns.", "NTA \n\nGet cameras as I think it’s safe to say sister is blaming you and hubby for all her problems.  You have zero responsibility for her.\n\nIf you let them move in they will be like leeches and you will never get rid of them.", "NTA. Good for you for telling her no. Stick to it and never give in for any reason. If I were you I definitely wouldn’t give her money. You did a lot for your sister when you lived with her but, from the sounds of it, all her and her bf want to do is mooch off of you and your husband. Your sister is unfortunately making poor choices and is letting her lazy bf bring her down with him. It’s her own fault. You can only help people who want to better themselves.", "NTA. Don’t let them in. You will never get them out. Different if she looses the boyfriend and is just her and the kids.. still not obligated to - you both benefitted from the previous arrangement", "NTA", "NTA. If they move in they’ll probably never move out. Don’t do it!!", "NTA. \n\nShe doesn’t want help.  She wants a crutch.", "NTA, if you had free space and decided to not accept her then yes you would be, but not only do you have no space, you gave her help in your own she just didn't accept it, with animals it's better to not just invite peoples even family especially with dogs.\n\nI feel like it shouldn't even be a question.", "NTA\n\nYour sister wasn’t behind when you lived there. She got behind when she was duped into running a bed and breakfast. The 12 ppl not on the lease is why she is being evicted. Dont let her con you", "Life is too short, family is family help them out!", "your door should always be open to family especially to female family memebers who are more vulnerable in this world and especially being she has kids. Make the most of the cramped space, suck it up and one day it will be a great family story to laugh about. Yes you are an asshole there is NO excuse for not helping your sister. Be fortunate you have any extra space at all some countries live up to four or five families with the space you have without indoor plumbing. Get over it and help!!", "and quit clapping yourself on the back for what you did in the past, yea it was nice of you and you didn't have to do any of it but a good brother would and not use what they did in the past  as an excuse to not help today. Even God would be like- \"that was nice what you did yesterday but what did you do today?\"", "NTA", "NTA", "NTA\n\nShe isn't in this situation because you shared the place with her. She's in it because of her deadbeat BF and several of his family moving in then quitting her job. No landlord is going to tolerate a dozen extra people being in their place. They did this to themselves.", "NTA", "NTA….your sister wants someone to take care of her, her kids and her boyfriend.   You do not want them living with you.", "NTA", "NTA, as long as you did offer for her to stay at your house with her kids but no BF.  So if she's smart she will take you up on that.", "NTA", "NTA.  Stand FIRM.", "This is not your mess.  If you let her move in, she'll never leave.\n\nNTA OP.", "NTA... if your sister put you and your husband up for an indeterminate amount of time (as they did) and you refused her in a time of need, you would be the asshole. But the boyfriend part of it, and human hoarding situation you described, makes this way more understandable. I feel like you could return home one day to find your place completely trashed or robbed by the sounds of that kinda company.", "NTA  your sister has been given options, if she continues tell her you're sorry she feels that way but she is only allowed to stay if her boyfriend leaves, period.", "NTA\n\nYou don't have the room for that many (jobless) people. It's no wonder she got evicted if she wouldn't stand up to her boyfriend moving all those people in and didn't have her finances together.", "NTA, if you don't have space then you don't have space. I also feel like your sister is lying to you about why she got evicted tbh. Probably had something to do with having 12 people living in her apartment.", "NTA. She can dress it up however she likes but she didn’t let you live with her out of the goodness of her heart but because she wanted to use you. You can’t let that kind of behavior continue it’s not on you to parent her", "NTA. She can dress it up however she likes but she didn’t let you live with her out of the goodness of her heart but because she wanted to use you. You can’t let that kind of behavior continue it’s not on you to parent her", "Nta", "NTA! Take care of yourselves AND those sweet pets! If they moved in it would be a disaster on every level.", "NTA. If you let them move in, they will take advantage of you and you won't be able to evict them because they'll fain tenants rights after a certain amount of time.", "OP literally can't even accommodate all of them. What do you expect them to do?", "Good thing I don’t believe in God then.", "Yeah, there's no way in hell they weren't kicked out because of that. The \"being a payment behind for years and the landlord is fed up with it *now*\" story sounds concocted to guilt trip OP given that context.", "If he was a teen dad and his kid repeated the cycle, he could be mid-30s.", "Also, 12 people in that house and they couldn't pay rent?", ">I'd bet money that the loser bf has convinced her that sis owes a rent-free life the equal amount of time that she stayed, so 3+ years.\n\nBingo. Sis is going to have to drop this useless  sack of crap before she manages to completely torpedo her entire life. You would think being homeless  with her kids would be a wake up call.", "He screwed her over. She needs to loose this joker", "What a good job he did.", "In the future, CPS may be in charge of your nephews' welfare, and that would be an appropriate time to revisit the children living with you. In California, I think (folks, please correct me) there may be two levels of placement with family, one that is more informal and the other where CPS is proactively managing the situation (not leaving it to your sister and you).   CPS organizes appropriate social services, therapeutic, and financial support - and CPS is the ones saying \"no\" to your sister when she's  crossing boundaries.  I'd hold out for that if I were you.  Those children need stability and predictability.", "With the myriad of bad decisions she's made since she's met the man are you sure there isn't drugs involved in the situation.? Because these are choices that people who take drugs or abuse substances often make.\n\nNTA protect yourself and the family you're creating.", "NTA other more viable options were given and she has once again show her poor decision making abilities by refusing those options.", "I'm kind of getting that feeling. \n\nLet's see... Unemployed, middle aged man who needs to move in (along with his whole family) with his g/f, tells her to quit her job so she can doordash and do etsy, says he can manage the household accounts without contributing anything financially, and screws it up so badly that they're getting evicted? Yeah, smart decisions don't seem to be this guy's forte.", "My uncle was a GREAT-GRANDFATHER in his 50s.", "This guy also used my address to get health benefits from the state after we told them they couldn’t. We started getting his mail, and that was the final straw for me.", "They smoke weed but idk about anything else. Only medically legal in our state. Neither have medical cards.", "Mississippi or Alabama?", "I hope you reported it as fraud as you may be deemed complicit if not", "Yeah... No...\n\nImagine what he'll do when he has access to your personal records when he goes into whatever box you keep your personal documents in. \n\n😬", "Did you report that to social services?? Because that's fraud for sure.", "Depending on their personalities and mental health status over consumption can be a problem. Just like the over consumption of alcohol but a little less dramatic. 😔"]}