{"id": 18895, "submission_id": "13zpqqz", "title": "AITA for not wanting to split the bill?", "selftext": "I am out on a vacation with a friend.. It was supposed to be a 3 day trip. I usually eat only once a day and survive on coffee because of this new diet I'm trying. \nHe likes to eat in fancy places and everytime we go to a breakfast or lunch place he orders whatever he wants and I just get coffee. When the times comes for bill he gets one bill and makes me transfer him half the account. \nIt really pissed me off when he ordered almost 30$ worth of food and I just got coffee and had to send him 17$. I called him out on this today and he called me petty for keeping tabs on small things despite of making 6 figure salary.", "created_utc": 1685826685, "permalink": "/r/AmItheAsshole/comments/13zpqqz/aita_for_not_wanting_to_split_the_bill/", "score": 1417, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I think i might be TAH because it's just 3 days and I could have adjusted for him\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nThat’s not how bill splitting should work and he has to know he is taking advantage.", "NTA. He's taking advantage of you.\n\n>He likes to eat in fancy places and everytime we go to a breakfast or lunch place he orders whatever he wants and I just get coffee.\n\nHe only likes to eat in fancy places because you're paying for him.", "You should’ve stopped him the first time. Why did you pay?", "NTA - you should only pay for what you ate.", "Lol, NTA. Dude knows you’re just getting coffee, he’s trying to get his trip subsidized by you.", "NTA - You play for what you order and half the tax and tip.  From now on tell the server you'll be needing two checks, then there is no argument.  Just because you have enough money doesn't mean you need to spend it on him, and he's not being a good friend by assuming you'd be okay with this.\n\nAlso, please talk to your doctor or a certified nutritionist before starting a new diet.  Only eating once a day and drinking lots of coffee isn't healthy.", "NTA. Next time don't get the coffee when he's with you; pick it up elsewhere. He doesn't sound very nice. No wonder he needs a fancy breakfast every day—when it's half price, it tastes better!", "NTA for not wanting to split it like that.  Makes no sense.", "NTA it’s ok to set the boundary that you want separate checks when you eat out. If he’s unable to respect that then this may not be a friendship worth your time", "NTA\n\nAsk the restaurants to split the bill when you first arrive.", "NTA. This is something that needs to talked about and agreed on before hand. I presume by your post that you didn't agree to this.", "I pay for what I ordered. That's it.", "...NTA, I would be pissed and I would have ended the entire friendship then and there, and made the \"friend\" pay for their own shit from the beginning.   \n\n\nYOU are making a 6 figure salary. That doesn't mean HE gets to have a cut of it.   \nIf you wanna get back at him, next time order something insanely expensive and then split the bill and tell him he's just being petty for keeping tabs on small things.", "This guy tries to get you to pay for half his food, then calls you names when you don't want to.\n\nListen, he's the \"petty\" one. And it isn't \"small things\" if he's trying to cheat you.\n\nTell him so when you break up with him.\n\nNTA.", "Do this: as soon as a wait person shows up to take your order, ask \"Is is possible for us to get separate checks?\"  *(for 2 people, I've never had anyone say \"No*.\")\n\nCheap people do what your friend is doing b/c it costs them HALF-or less-than what they actually owe.\n\nIt's not you being cheap or petty...it's him being cheap and manipulative, TBH.", "NTA. My friends tried to do the same thing. Pay for what you ordered. It was unfair if you only ordered one thing", "NTA I don't mind paying for friends someone's but I'm not going to split the bill and still pay part of theirs . And just assuming someone is going to pay for your stuff makes your friend sucks", "NTA\n\nYou should both just pay your own orders. Doing it this way you're paying way more and sharing the bill is something that needs to be agreed before.", "Nta- say I will pay for what I had. Please diet carefully though, your body needs more than coffee", "NTA, you want fancy, YOU pay for fancy.", "NTA. Yeah no. Don’t pay for his food. Pay for your coffee and that’s it.", "NTA he’s trying to mooch off you. It’s perhaps fine if it’s small amounts like $1 but a whole $30 split in half is really taking the piss. The audacity of him to call you petty. Please don’t ever travel with him anymore", "Info, are you staying at a friend's house for free or both paying market rate for lodging? Trying to figure out if there is some value you out are getting and the food is just a way to pay some of that back.", "NTA", "NTA. He’s the petty one. Tell the server that you will be paying separately from now on", "NTA. Your friend knows what he's doing.", "He ”makes” you transfer money to his account? How? \n\nYTA for doing this and whining about it on social media later.\n\nJUST SAY NO.", "Edit to NTA\n\n\nDid you tell him you were on this diet before the trip? Because honestly, being like \"well I only do one meal and you can do whatever\" is also kind of shitty. Having the other person sitting there with simply a coffee because they are on a diet and feeling like a bother.", "INFO: Did he then proceed to pay for his purchases and not give you any grief about it and move on from there?   \n\n\nIf so, then it's a N A H -- because he's just sharing an opinion and not such an outrageous one as to be ridiculous. Oh I think he's wrong, dont get me wrong, but $100,000 a year can afford to not worry about the $10-20 purchase here or there and who owes who a couple bucks. Its a believable position for him to hold and to say \"worrying about a little petty cash\"\n\nBut he doesn't get to tell you what you are allowed to be worried or not worried about. And nobody gets to unilaterally dictate how \"group purchases\" are made. So when you stated how you wanted bills being split if he argued against it or disrespected that in any way then it's **NTA.**", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI am out on a vacation with a friend.. It was supposed to be a 3 day trip. I usually eat only once a day and survive on coffee because of this new diet I'm trying. \nHe likes to eat in fancy places and everytime we go to a breakfast or lunch place he orders whatever he wants and I just get coffee. When the times comes for bill he gets one bill and makes me transfer him half the account. \nIt really pissed me off when he ordered almost 30$ worth of food and I just got coffee and had to send him 17$. I called him out on this today and he called me petty for keeping tabs on small things despite of making 6 figure salary.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Lol what a loser. Nta", "Is this a parody of all the split the bill posts?  😂", "NTA -- (really y.ta) -- Just say No....it is a complete sentence. You control the amount you transfer; why do you find this difficult?  No is a reasonable boundary.", "Order $100 worth of food and take it home with you. See if he still wants to split the bill. \n\nNTA", "NTA. Splitting the bill makes sense when each person has partaken in all of the food, or each persons share is about the same.  Not for situations where one person barely ate, and the other has ordered multiple courses that were then enjoyed alone.", "NTA that’s not normal. Just say separate checks as soon as you sit down", "Bill splitting (to me) means you would have each gotten somewhat comparable entrees and drinks…it’s just mean to simplify a transaction not enrich another’s wallet. NTA.", "WTF?? NTA\nHe is the petty one for expecting you to pay for food you are NOT eating. \nPay your coffee and nothing more. You don't have to split the bill.", "NTA\n\nStop letting him mooch", "Umm, can I go on vacation with you next?\n\nNTA, he's just wanting a free ride, he's not an actual friend.  A real friend would have just paid for your coffee on the bill.", "NTA.\nTell the Waitress/Waiter you want separate checks.", "NTA, the answer should have been, I know it's really petty not to treat your friend to a coffee while they keep you company for a meal.", "What do you mean your friend \"makes\" you pay half his large bill when you only drink coffee?  Does he brandish lethal weapons?\n\nObviously you shouldn't be paying for half this A's food.  That's absurd.  I don't care how much money you earn, you aren't his daddy.\n\nHere is a sentence for you to say to the waitperson every time at the beginning of the meal: \"We'd like separate checks.\"  Your so-called friend can bitch and moan all he likes.  Smile and pay for your coffee.  Then go on future vacations with someone who doesn't want a friend-ATM relationship with you.\n\nNTA", "Yes you are you are not even dating so it no world can you justify it but if you don't like him as a fried anymore you could have just paid foe the coffee and left", "NTA\n\nUnless the food is shared (like a pizza or something), modern technology means there is zero reason to split bills anymore, and it's a pretty rare and a dying occurrence.\n\nHe is 100% mooch cheapskate, knows it, and is doing this on purpose because you e let him get away with it for so long.", "He's going to those fancy places partly because he expects you to help pay for it. Stop splitting the bill. Only pay for your coffee. Freeloaders like him think that your big salary means you should share it. NTA", "Nta. I’ve never really understood just splitting the bill like that.", "NTA… it is shitty of him", "NTA this guy's a joke....I'd be picking up your coffee on top of my $30 breakfast", "A lot of times it’s the ones who make the most that are the cheapest. \n\nTell him he can pay for what he orders and you can pay for what you order. It won’t be you “keeping tabs,” it’ll be the server. \n\nNTA don’t put up with that. It would be one thing to bite your tongue for ONE meal… but since it’s happening multiple days in a row, that’s just not fair and he’s upset you called him out on it.", "I thought it was a one time thing but it kept happening", "He could be doing intermittent fasting it's relatively popular, also depending on how many calories that meal is it might be fine.", "We're splitting the cost for a rental home. Paying equally for everything and that's the issue.\nFor somethings it's equal split like accommodation, gas and stuff and its unreasonable in just this aspect", "Yes like I said he is my friend. He knows that way before the trip.", "How is OP eating when and what they want shitty, when they haven't been demanding any money from the friend? Where in the book of made up rules is this paragraph for \"You have to eat when someone else eats even if you don't want to eat\" ?", "Ask for separate checks. Like, don’t even wait until the check comes. Before the wait staff asks for your order, be clear that you want your own bill.", "And you kept paying", "But why did you keep doing it…? NTA", "If social norms are different where you live, than thats fine, but you honestly don't need to be this hostile just because you disagree with me lol\n\n\n\"The book of made up rules\" ... you realise that every single rule is made up right?", "I wasn't trying to be overly hostile, just make it sound funnier than it is.   \nI have never even heard of these social norms, lol. Then again, I'm finnish, our social norm is \"fuck off\".", "Eating alone while not being alone is very uncommon where I live. Like if there had been 3 people, op would be fine to not eat anything. But as they were just the two of them, the polite thing would've been to compromise and order something small to nibble on. Again, in my culture.", "That's a weird concept to me. Around here, people just sort of get worried and think you're starving yourself /broke.", "YTA. stop paying for him", "My friend group solved that by asking the server for separate bills before we order.", "NTA. He’s not your friend. He’s a mooch who wants to wine and dine on your dime.", "That's how the rich stay rich. If he ever asks you to cover something for him, please make sure you request it back ASAP. Excuses I've heard were, you're killing the mood, I'll send it to you after the trip, or next time I'll cover you.", "If you are going to just order coffee, why join him to restaurant? Order to go and pay that upfront.", "Nta, I hate that \"splitting the bill evenly\" shit. Pay for what you get. If someone orders the most expensive thing on the menu, the person who ordered a plate of chicken tenders shouldn't be paying for it.", "Start asking for separate checks, you don’t make someone split checks like that unless it is agreed upon.NTA", "YTA for letting someone do this to you.", "NTA. He isn’t forcing you to do anything tho. You allowed it to happen over and over. I’m glad you stepped up and said something. This is a hill I would die on.", "NTA, and when you go out ask the waiter for separate checks upfront.", "Nope. NTA. In this situation I’d pay for my friend’s coffee and not think a bit of it. He’s taking advantage of you then gaslighting you when you called him out.", "NTA, get your coffee to go and talk a nice stroll while he eats.", "NTA. Start specifying “separate bill, please” as part of your coffee order.", "From now on, when you order your coffee, you say “and one coffee on a separate bill please”", "Just pay him for your coffee plus a dollar in tax and 2 dollars for a tip. NTA", "NTA start speaking up and say one bill when asked.  Actually as soon as you are handed the menu tell the waitress this will be to separate bills please", "He’s keeping tabs too if he’s asking you for half instead of just paying for himself. NTA", "NTA. Next time just tell wait staff to put your coffee on a separate bill.\n\nAnd you should call him out for freeloading off you.", "NTA I would have separate tickets. No way is your coffee $17.", "Ya he playing you boo. NTA and stand up for yourself. Send him exactly what is owed.", "You are NTA and honestly, just stop giving him the money. Just pay for your coffee.\n\nIf he makes a mountain out of this molehill it is a bit of a red flag, and I don't say that often.", "NTA. Why are you paying him in the first place!? Stop enabling him. You only have yourself to blame if you continue to go along with it without saying anything.", "NTA stop doing that. If you only get coffee then only pay for coffee he is an AH", "You know his pattern but you keep sewing. \nBefore he orders say, you know your paying for wot you order right & I’ll be paying only for my coffee, watch him pick a $5-10 meal. Question, how does he MAKE you transfer money ? You can’t refuse, say no ?  Guess that’s why your on here asking for advice. Your too nice. I know a few people that have that one scummy friend & they stay friends with that person. Your friend has a champagne appetite on a water diet.", "You should’ve never paid 17.00 after buying only a cup of coffee. Y T A for doing that to yourself. Other than that, NTA.", "The person ordering the cheapest meal should be the only one to suggest splitting equally. Your \"friend\" is scamming you to get free food.", "Lol yes, in this situation, splitting a bill is far pettier and more of a faff than the OP just paying for the single coffee they drank.", "I fully agree.  If the OP was with me, and all he had was the coffee I would pay the whole thing.  \n\n\nNext time, separate checks.", "Why would OP pay half the tax and tip? I would only pay the tax and tip for my coffee.", "NTA, but YWBTA if you continue to enable your friend's habit of treating you like his own free ATM.", "How many times have you paid?", "Just because he requests half doesn’t mean that you have to pay half. Pay what you spent plus a generous tip if a tip was given. Frankly, I would Venmo request him back for what I’d actually fair or just let him pay a really large dinner bill and then say “I’m sure you’ve got this since I’ve paid X extra for your breakfasts and lunches so far”. But do sit down ahead of time and come armed with the exact figures on what you’ve overpaid him.", "NTA\n\nhe thinks you're petty! LOL\n\nSeparate bills please, and tell him you're going to absolutely OWN being petty. Petty superstar!", "Only Venmo the amount you owe! NTA", "Nta but please tell me you talked to your Dr about this diet", "This is not how bill splitting works", "Guy is definitely staying in the friend zone.. or ex-friend zone.", "NTA. WTF?", "NTA you absolutely should not pay for half his food.", "Separate checks, please?", "NTA this shit is weird. As someone who doesn’t drink and intermittent fasts, I often order a tea while everyone orders drinks and eats. Generally someone just pays for my tea. And then I buy for the group once in a while.  \n\nSplitting is just wild in this circumstance. I’d suggest just bringing change to pay for yourself and doing so (I’ve done this when suspicious that some asshole is trying to stick me with a steak and wine when I’ve just had a coke).", "NTA\n\nAsk for separate checks.", "Wow. I can't imagine being such a douchetwizzle as this guy. I also can't imagine how this has happened more than one time. Op, you can only be taken advantage of to the extent that you allow it.", "Drop the delusional cheapskate", "NTA.  and he is NOT your friend.", "tell them separate checks and insist NTA", "What do you mean you had to send him half? Who is making you? Just look at the price of coffee, add a couple bucks for tax and tip, and send them that. NTA, but he can’t make you cover part of his bill.", "He's not your friend🤣", "Start ordering lobster, steak and crab legs for your one meal...", "NTA Petty is a six figure income asshole nickel and diming a friend for a free meal.", "There’s no way.  You should not have paid.  Don’t let people walk all over you like that.  NTA", "NTA - Splitting or sharing the bill only makes sense when you are getting a shared meal. You should never evenly split when you are getting individual dishes.", "Why do you do it?  You actually have control over this.  Transfer the amount you owe and tell him your paying for your coffee. NTA", "NTA. I pay for me, you pay for you in this situation.", "NTA, but you should have nipped this in the bud the first time. Simply should have said, no, I'm sending you the $5 my coffee cost, not half of your meal. End of discussion.", "NTA - Why don’t you just say ‘no’?", "NTA. Request separate checks right away when your server comes to take your order and put an end to it.", "NTA next time order more than he does and only pay half and if he complains uno reverse this crap on him", "I'd be worried that your friend is going broke since he can't even afford his own meals", "Separate checks sound even easier than trying to split it after. Even if you had similar meals, there is no reason to split evenly when you can easily request separate checks.", "1. Your diet isn't healthy. \n2. NTA. The \"friend\" is", "NTA he’s taking the Mickey", "If we go out to dinner and I only order a Sprite and a spinach artichoke dip, then I’m only paying for my Sprite and my spinach artichoke dip. If I must be Grace with the name Broke Batch bc I refuse to split the bill on your 72oz porterhouse, your baked potato with butter, sour cream, upcharge cheese, bacon and chives, add on upcharge shrimp skewer, add on upcharge lobster tail and your 2 margaritas, then a broke batch I will be! Here’s my $20 for my Sprite and my spinach artichoke dip. You didn’t *split* your steak with me but you wanna *split* the bill. I’m bout to *split* these fingers goodbye ✌️\n\n[Sauce](https://www.facebook.com/reel/756274862598275?fs=e&s=TIeQ9V&mibextid=xO1PvT)\n\nTLDR: NTA", "NTA what a fucking bozo.", "NTA. He knows what he is doing is trying to shame you you into staying quiet about his shittiness.", "He makes you transfer funds. I had to send him $17.  You are required to send me $5000. You have to do this.  I said so.  F Y is a complete sentence.", "NTA why are you friends with this thief?  You are silly for sending money. Stand your ground!", "NTA.  Demand separate checks.  The fact your friend had to comment on your income makes me think they're feeling a bit entitled to make you pay for some of their food.", "NTA he is not your friend.  Always ask for separate checks when with him. Ask at the restaurant before you sit down to make sure that is possible. Most places will honor that. I get not wanting to be confrontational, but definitely work on standing up for yourself.", "Why have you been doing that? Ask the waiter for separate bills. If your friend pays the full bill and demands repayment, you ask for the receipt, calculate how much you owe him, and pay him that amount.\n\nThere isn't necessarily anything to \"call\" your friend \"out\" on. You have been doing this as much as he has been doing it. He doesn't \"make\" you transfer him half the bill - you've been doing that willingly. Use your words at time of bill payment and take responsibility for defining your own debt.", "Nta. Don't sit with him. Go by yourself. Problem solved.", "Next time, out-order him and insist on splitting. Say he shouldn’t fuss over small bills like that", "That’s really stupid. Definitely call him out on it.", "NTA. He’s using you for cheap food.", "Also, that diet sounds incredibly stupid and more likely to slow down your metabolism than anything. Unprocessed food and follow the Mediterranean diet + exercise. \n\nFasting daily and overdosing on caffeine is not good for your health or weight loss. You may lose weight in the short term but you’ll gain weight in the long term", "It sounds like your friends vacation budget was taking advantage of you", "Definitely Not!! First of all unless discussed no splitting should happen as it’s common mannerism and everyone should be able to fund their own habits especially if it’s not equal", "NTA but PLEASE talk to a nutritionist and do some research on diets. There’s a lot of research showing that restrictive diets actually only make people gain weight over time and encourage disordered eating", "NTA, if he wants to pay and have you send him money, then you should really only be sending him enough to cover your own food/drinks, not split 50/50, that makes no sense.", "NTA - Sounds like a shitty friend. Unless everyone agrees in my friends group we just pay for what we ordered. Total up everything you ordered and multiply by 1.(tax + tip) for your total portion.  \n\n\nLegit though, if I went to breakfast with you and you just ordered coffee and I wanted a single bill I'd just pay for your coffee.   \n\n\nI'd ditch that friend or at least stop going out with them.", "Lol YTA to yourself for just... Going along with it. That's weird.", "Nope. He gets coffer amount plus tip on coffee amount. ☕️  NTA", "When we go for family meals at the end everyone says we might as well just split it x ways I wouldn’t mind but my husband doesn’t drink and most meals I’ll only have a glass of wine sometimes not even every time while others have pints of beer, bottles of wine, starters and desserts. I have just started going up and paying our part of the bill before everyone asks for it so that was I just say “oh we’ve already paid ours so just split it between you lot” it works quite well.", "Bahahahaha THIS", "Splitting the bill equally only makes sense in specific situations and this def isn’t one of em. Like say a bunch of ppl go out to a family style place or a Chinese place and order a bunch of dishes that everyone shares. That would make sense. Or if you all split a bunch of appetizers. Also logical. This tho is just nonsense", "Second this.  I was tempted to make my judgment ESH for this exact reason.", "And OP \"called him out\" on the thing OP has been doing with the guy. You called a friend out for *you* willingly paying for half the bill? Knock it off, OP.", "I’m surprised OP would go along with this even once.  Seems like some serious self esteem problems or something.", "It didn’t keep happening.  You kept paying.  Stop paying, for chrissakes.", "I don't know US tax law very well (assuming OP in in the US) but I've heard that it can work really weirdly and isn't necessarily a flat charge (eg. like VAT in the UK or GST in Australia). The friend might have ordered food that has some weird loophole where it is taxed at a much lower rate, or there's some \"dine in tax\" that is basically just a surcharge based on the number of people rather than what's actually ordered.\n\nI do agree though if it's a place where tipping is customary, you should just be tipping on your own order. Not reasonable to order a $5 coffee and then have to tip based on the $100 lobster someone else got.", "Intermittent fasting does not involve eating one meal.", "You, my unknown friend, are awesome.", "Better yet, if possible, just go to the bathroom before they are done eating and pay for your coffee at the till.", "The problem w/ sending the price of what he ate + a generous tip is the MOOCH  probably won’t leave a generous tip. He’ll balance the excess &  leave a minimal or non-existent tip. This makes coffee friend look cheap- which is a problem if they eat at places repeatedly outside of vacay. \n\nSeparate checks is the way to go!!! Especially in cases when it us a party if 2-3 people so it is not an undue burden (like a 14 person group might be)  \n\nTbf- I agree w/ the commenter above. If my friend only ordered a single coffee, I’d probably cover the bills completely under the assumption my friend would cover me in a future situation (ex. A movie ticket or outing.) If a friend only had coffee, I ALWAYS paid and that friend never did anything to reciprocate (ex. Buy me an occasional meal or drink or whatever)  then I’d question things. It has to be fair overall- even if it is not 100% equal each outing.", "This is definitely not a thing. US taxes simply % of the total. We have no sliding scale", "Some fancy restaurants will include a mandatory typing amount for large party's but that abt the extent of how tipping can vary. Op should only pay for the tip on the 5$  they spent.", "It can, there’s different types of intermittent fasting one of them being OMAD (one meal a day)", "That depends on the type of intermittent fasting.", "**NTA for not wanting to split the bill.**\n\nI always thought that's only fair if both people ate around the same amount of food, or food that costs around the same amount. I don't see how this has to do with the fact that you make a 6-figure salary, unless your friend knows that and is deliberately taking advantage of you. Either way, he should pay for what he got - all the more since it's more expensive than what you got. It's just manners, unless you're OK with splitting the bill.\n\n_On a separate note, maybe this is not what you asked and probably don't want to hear either. If you somehow manage to find this in the sea of comments:_ \n\n**YOUR DIET DOESN'T SOUND HEALTHY.** It's great that you want to try out diets for whatever reason, but PLEASE seek help from a nutritionist/doctor before doing so. All diets are not meant for everyone. There are so many diets out there for different people/different reasons. But this one you currently are doing doesn't sound like it's providing you any nutritional value. The most part of your diet is coffee, with just one meal a day. \n\nSurviving on one meal a day is bad enough by itself and will screw up your system, plus you're drinking loads of coffee. You can't \"survive\" on caffeine, that's not what our bodies are meant to do. It's not an alternative to your other two meals, if it were a good alternative everyone would be doing it. This \"diet\" can lead to acidity issues, gas, and you might develop other stomach problems like ulcers. It can even ruin your bowel movements or create other problems in the long run. Not trying to be rude, just a little alarmed though. This doesn't sound like a normal way of eating. Please be careful and take care of your health :)", "Learn the phrase..... Seperate bills please.", "I honestly don’t get how this even happened once. I would laugh and laugh and laugh, then put down a couple bucks for my drink and walk away. NTA", "Why don’t you just tell the waitress or waiter up front for separate bills?", "Dude is a user.", "NTA \n\nSounds like he views you as an atm because you make 6 figs rather than a friend who values you as a person.", "Ask for separate checks. Pay yours. I’ve never heard of someone so entitled 🙄", "YTA for doing it. Speak up.  And stand up for yourself.", "NTA. But find your voice. Ask for 2 bills.", "Just pay for what you ordered. It's that simple.", "Just pay your own bills like adults. Done easy.", "NTA, but just tell the waiter at the time of order that you'd like your own bill. Intercept it before the single bill reaches his hand.", "Geesh. Just pay your own tabs.", "NTA. I don't know why this is so difficult. Just transfer him the price of the coffee.", "Nta… Are you fucking kidding me. The nerve of this guy. He’s taking advantage of you", "NTA\nhe’s not your friend, stop eating with him", "I’m lost, how is this even happening if you’re “close” enough to go on a multi day trip with this person. \n\nThis is just bizarre, if this were my “friend” it would have been discussed and dealt with the first time they tried. If they want to claim that them trying to manipulate me or extort me to pay for their lunches, is “petty” then I guess I’m petty and we can call it a day. I guess I don’t understand why you even let this slide over multiple days/outings before you finally said something.", "NTA. I'm a big fan of just splitting the bill because I hate when a large bill comes in a group and people spend ages itemising exactly what they got down the the penny and then someone miscalculates the service charge and someone ends up paying less than they should - puts a dampener on the whole evening for me. BUT if someone is getting just a drink and I'm getting a meal, either I pay the whole thing or that person pays for just their drink. It's not rocket science.", "NTA.\n\nPetty is reminding your friend to send the money for half of the meal you ate. If things are so chill and money’s not an issue between friends… he should be buying your coffee.", "NTA. They should be treating you on the coffee if they’re making you go out for a meal you’re not eating. \n\nDragging you along and splitting the bill is just inefficient robbery.", "NTA - he's not a friend, and I honestly would cut someone like that out of my life if someone tried to scam me like that.", "NTA at all. I’d order so many damn coffees that it surpassed whatever he got and made him split it down the middle. I hate when people try to take advantage of people in this type of way. It’s grimey to me", "NTA. Cmon now, your friend is the AH", "NTA - at the beginning of your meal/service just ask for a separate tab.", "This person isn’t your friend if they take advantage of you like this and then gaslight you. NTA.", "NTA but also tell him BEFORE you go out that you’ll be getting separate checks \n\n‘Hey George I am happy to go with you to eat but I prefer doing separate checks and in the future I’ll just pay for my own bill thanks.” If he doesn’t want to spend $30 on food he can pick a different restaurant now that he has full information. But also just don’t go on vacation or out to eat with this mooch anymore", "I would laugh in his face and transfer for the coffee. Seriously wth!", "NTA.  \n\nJust tell the server \"separate checks\".   You pay for your order, they pay for theirs.", "NTA. You don’t “have to” send him anything except enough to cover what you ordered plus a tip for the server.", "“Makes” you. YTA for being a doormat. Stand up for yourself! Of course you’re NTA here and you don’t need a bunch of people to tell you that. This is pretty standard, simple, and straight forward. You got this.", "NTA Why are you allowing yourself to be exploited?", "Next time ask for separate checks.", "Definitely NTA but OP should’ve brought this up right away, now it can come off as petty depending on how the issue was handled.", "I mean I guess this is an option that doesn't involve standing up for yourself at all.", "agreed op stay hydrated", "There's a thing called intermittent fasting, and it's not unhealthy, if done right.  \n\n\nIt does come down to one meal a day for some versions. It's not a \"fad\" thing - it's been shown to have real health benefits in addition to weight loss.", "Thank you so much for your comment. I've been following intermittent fasting because it worked for a few friends but like you said not every diet is for everyone.\nI'm going to consult a professional on this and going to stop the diet for the time being. Thank you so much once again", "Every time ask for separate checks!", "He \"made you\"... your friend sounds like an idiot and you need to grow a pair and speak up. Can't believe you made a post on reddit about this rather than saying no that isn't right I'm paying for what I ordered then and there at the table.", "Yep, it can be a wonder for people with gut issues too because the system gets a chance to recover between inputs. A rest for the inflamed digestive tract. I know this from personal experience.", "No worries! My dad was doing intermittent fasting for a while (with the intention of loosing weight) and it worked pretty good for him. Of course, he did this under the guidance of a doctor. My mom however has stomach issues, she cannot afford to go hungry for long and has a very strict eating schedule + she can't eat certain foods. So she would never be able to do what my dad did. It's true, not everyone can do the same diet. I guess you must have been tempted, seeing your friends; but intermittent fasting is _possibly_ not for you.\n\n I'm glad you're putting this diet on hold right now, I appreciate that you actually saw my comment lmao, they usually get buried. But I just feel like I had to tell you this. It's good that you're considering seeing a doc first. All the best!", "I go along sometimes when I might owe them for driving or our friendship is based on mutual trust that things will balance either monetarily or some other type of contribution but when it's that obvious no OP is paying for company", "Yeah, respectfully you are extremely wrong. Tax on a meal at a restaurant in the US is going to be a set %, not based on what you order. There may be differences in dining in vs take out, but that's not linked to the number of people eating", "You can usually just ask for separate checks and then it’s all handled appropriately", "There are different forms/time periods of IF, and people do it as they see fit. \n\nAs Ling as OP is happy with it and is functioning fine, I don't think it is anyone's business. I also only eat one meal a day, because eating makes me tired and I usually just simply forget to eat most of the day. Then I do, chill out for a while, then go to bed. I'm healthy, I have a healthy BMI, and my doctor says it is fine. OP doesn't need people on reddit telling them how they need to eat.", "It can. I've done it - with doctor supervision, too.", "Not all states are just a flat tax. Typically at sit-down restaurants everything will be taxed the same, but not necessarily at places like a deli counter. It can be really weird. In my state if you go to a Walmart and just shop, you likely will deal with 3 different tax rates.", ">In my state if you go to a Walmart and just shop, you likely will deal with 3 different tax rates.\n\nWhich sounds awful to deal with, but it's much better than the way my state does it, where a single parent trying to buy a bag of chicken nuggets so their kids have something to eat tonight pays the exact same tax rate as someone buying a $1000+ cell phone because they decided they don't like the color of the one they bought last month. (How much depends on city/county, but runs between 9% and 11%.)", "Are you talking about sales tax? Because sales tax doesn’t change based on how wealthy you are. Everyone pays the same % of sales tax.", "In some places prepared food, like restaurant food or meals from a grocery store, are taxed at a higher rate than groceries.", "Why did you let him start shaking you down for cash in the first place? No, you shouldn't be paying $17 for a cup of coffee. And he should not be asking you to! Your salary is irrelevant.", "NTA he knows what he's doing pay for what you've had if you're not eating", "“He makes me transfer…” \n\n“I had to send him $17” \n\nIf he is forcing you to do these things, that’s extremely problematic. Otherwise, the language you use to describe what was happening might show you viewing yourself in a submissive role in the relationship. \n\nIf he’s forcing you to do anything, he’s being abusive. \n\nIf you see yourself as a passive partner in the relationship, you might want to learn how to be more assertive and find your voice.", "He’s a petty ass taking advantage of you. And he knows he’s doing it. Why doesn’t he feel like an ass for not paying for a cup of coffee? His cheap ass is gaslighting you because you make decent money? How much you make isn’t the point of the restaurant bill.", "Can you ask for separate bills when you order, rather than waiting until the end? The guy is clearly using you. I would never ask or expect to split a bill if I was eating and the other person only had a drink", "NTA. Not your friend.", "Wut the wut🥴", "NTA - however an eating disorder is not a diet please consider getting actual medical help with your diet eating once a day is not recommended by anyone.", "NTA so he wanted you to take him on vacation and pay for some of his food.  Nope.", "**NTA** and your friend is taking advantage of you.", "NTA.", "Nta. He was abusing your kindness", "There are two of you? And despite the uneven consumption, you’re splitting bills? Why is this on Reddit…?\n\nSurviving on one meal a day, and lots of coffee will make you unwell, and is not an efficient method of weight loss. Talk to a dietician about what you can eat to maintain your health, whilst a personal trainer helps you lose weight. Cutting out food is not the healthiest way to achieve your preferred weight.\n\nIt doesn’t matter what you earn; asking someone to pay their own bill (since there’s only the two of you) is perfectly reasonable. And you shouldn’t need validation from us to tell your friend there unkind manipulation of the feedback you offered is not friendly.", "YTA for giving him $17 for a coffee.", "He can't make you transfer anything. After he pays for the bill, transfer him exactly the amount that your coffee cost. NTA", "He got upset bc you called out his BS. Ask for separate checks now on. I only ever do a even split is if we got close to the same amount. I won’t argue over a buck or two but he is clearly taking advantage and not a good friend NTA", "NYA. Next time i suggest you pay your share right away. You accepted to pay half the moment the bill went on the common book. Indeed that looks petty to complain days after (but legitimate)", "This is completely ridiculous. There is no reason in which you should cover part of his bill. He is your friend so each one of you covers what they ordered and decides individually on a tip. NTA", "NTA. I wouldn’t have transferred him half even one time - why did you? A simple “I’ll send you the $X for my coffee” would have done the trick? What on earth actually made you stay silent when he said something about sending him half, and what made you send that amount instead of just sending him the amount for coffee? Baffling.\n\nWhen he says you’re keeping tabs on small things, a response such as “look dude, if we both got similar things then I wouldn’t mind paying half. The fact is I got a $5 coffee. Why do you expect me to pay for your food?” . Just because someone says something doesn’t mean you have to go along with it.", "NTA. So if he spends $200, and the bill is 220, he wants $110 from you? Put it that way, and maybe he’ll see how ridiculous he is being, trying to take advantage of you.", "NTA. I don't understand why you would even question his greed. How does he think you paying half the bill for a meal he 100% consumes is morally sound? Pick better friends.", "Two more things.\n\nI am astonished at how many comments do NOT mention the unhealthy eating regime. One meal a day, and lots of coffee will put someone in an early grave.\n\nThe ‘tipping’ thing appears to be an ‘unavoidable’ thing, alongside the sales tax. Outside the US, in my experience, nobody cares or notices, but it seems to be a hyper focus of posts about money. \n\nTips are for good service, and should be payable to the people who provide that service. ‘We’ (outside the US) don’t tip by default, and will always be quietly resentful of the expectation - especially if the service was perfunctory. That doesn’t mean I’m suggesting rebellion, nor am I a one man protest everywhere I go. If employers are not paying decent hourly rates, then don’t eat in those establishments. Tips should be a bonus to the employees, not the employer. Nor should they be a column in an accountant’s spreadsheet. If tips are listed on bill, they become tax deductible, right. That’s why they shouldn’t be on the bill.\n\nBut for the purposes of a Reddit query about the ‘politeness’ or ‘etiquette’ error of an individual, I don’t care what extras were paid for, over & above your food or beverage. If the bill costs $45, call it $45. If tax & tips add $6.75, then call it $51.75. If I am an accountant, I might feign vague interest, but only if you need me to process your taxes. Otherwise, round it up. If you paid $52, that’s what you breakfast or lunch cost you. \n\nIf the tip is optional, and you offer it in good faith, it’s not part of your bill.", "NTA. Fuck splitting the check in half.  You pay for what you order.", "The fact that you can easily afford it doesn’t mean that you should be tipping in on his expenses every time. Once, maybe, if you suggest it. Or if it’s a thing you literally always do. But it’s ludicrous to keep splitting the bill when you just keep getting coffee or a light, inexpensive meal. You’re NTA, you were just standing up to someone that was exploiting you, either consciously or unconsciously.", "He's the AH for expecting you to subsidize his lifestyle. From now on, insist on separate checks or state in advance that you will pay your portion of the bill. If he has a problem with it, stop dining with him.", "When the server comes to take an order just say “my bill is going to be separate.” Then your friend can’t complain", "Order the coffee. Then quickly after tell your friend you need to use the bath right before but actually go to cancel the coffeeand watch your friend try to split the bill again. Then tell them that you actually didn’t get anything so they’ll have to pay fully.", "NTA - This person is trying to get you to pay for them to eat whatever...  and even revealed as much by citing your income. That's jacked. How good of a friend is this person?", "NTA", "When you have your one meal are you eating more than half the value of that bill and are you splitting it in half?", "Split the bill. Everyone should pay for themselves", "Just ask for a separate bill. There should be no question about it. In my country, we'd pay for your coffee in this situation but maybe, it's different where you are.", "NTA \n\nI’m usually not one to split hairs over a split bill. But this is ridiculous and he knows it.", "NTA, however this new diet does not sound healthy. Why are you on this? Are there not other safer diets you could do?", "NTA. Personally I'd never make it a big deal about splitting evenly if I'm out with close friends and we all order different things that might not be of the same value, assuming that we *did* all eat and drink. But if someone doesn't eat at all or doesn't drink at all, that makes their total more than just a little different! It's not penny pinching to not want to pay half of a big meal when you only had a coffee.", "Someone is in need of a shiny spine. \n\"No\" is a complete sentence. \nNTA", "That's not your friend. Stop going out with them. If you can't find it in you to stop going out to restaurants with them atleast get separate checks. NTA", "Not necessarily unhealthy at all. Anything has the potential to be unhealthy of course -including eating 3 meals a day- but just the notion of eating one meal a day is not inherently unhealthy. It can actually be incredibly good for a person.", "Same. Why would anyone tolerate disrespectful behavior like this? Need nicer friends.", "Fool me once, shame on you\nFool me twice, shame on me", "More adults need to figure this stuff out. I'm shocked at how many split bill questions we get here.", "What dine in food can you order that doesn't attract VAT in the UK? As I understand it, dine in automatically means VAT.", "There's a number of exclusions to Aust GST as well\n\nhttps://www.ato.gov.au/business/gst/in-detail/your-industry/food/gst-and-food/?anchor=GSTfreefood", "Yeah, that's the case, it's just I've heard about some US states having mixed tax rates for different products, like bottled water or corn might have a lower tax rate than say, bacon.", "He is highlighting that luxury goods have the same tax rate as basic food staples in some areas.", "No one is being petty. Someone is playing stupid and being cheap and that is HIM.  Sounds like he’s thinking you’re a great travel buddy because your income allows for you to treat him.  Make the best of what’s left and lose this cheapo when you get back.", ">despite of making 6 figure salary.\n\nOnly moocher will use this excuses.. So what if op make 6 figure or 12 figure salary, he work hard for it and the friend is not entitled to any money or how op spend it.\n\nNta op", "NTA he’s not a good friend", "Nta this is how most people with money get to keep their money by doing shit like this", "NTA, you have a shit friend. A true friend would just pay for your coffee if that's all you ordered. At times, I'll even just pay for my friends Starbucks as it's just more convenient than two separate orders.\n\nYou need a new friend...", "NTA. What?!?!?! He's literally making you pay for HIS food.", "To be honest one day you should have a cheat day and over order and insist on splitting.", "NTA, separate checks send the way to go here.", "NTA but always ask the server for separate bills when they seat you, that way he can't make you pay for his food ever again.", "NTA", " NTA\n\nIt's more logical for the friend to just simply take the whole check and pay for your coffee too.\n\nHell.  I wouldn't be surprised if your coffee isn't even on the bill at times.", "NTA The kind of people who want to spilt the bill always spend the most…", "Knock him off his high horse by saying “I didn’t know you were in need of food. I would’ve gladly helped you out and brought you some groceries until you were back up on your feet”", "NTA\nDon't eat with him", "Nta why don't you do the same and see if he likes it", "He’s stiffing you, the Asshole!", "NTA. Absolutely not. He's taking the p1ss. Big time. Refuse next time and don't holiday with him again.", "INFO:  why the fuck are you doing everything this dude wants?  Why go to fancy meals if you're only going to get coffee?  Why let him decide to get one bill?  Why let him decide how it should be divided?  Why transfer him money you don't owe him?  Why not call  him petty for trying to profit off every meal?  NTA but I'd let him eat at those fancy places all by himself.", "NTA at all.         \nHe likes to est in fancy places and makes comments about your salary?          \nHe's using you for your money.", "NTA\n\nIf you literally just had coffee, then he knows he's being the asshole here.", "I almost want to say you’re the AH just because it was dumb enough to even agree to splitting the check evenly once 😂 But you are NTA because your friend is delusional.", "NTA. \n\nWhy the hell didn’t you shut this shit down the first time it happened? Fuck being nice, he was taking advantage of you from the get go.", "NTA. Friend should feel embarrassed for trying it on there.", "NTA splitting isn't as bad when you do it a lot and you both order roughly the same amount but with only a coffee I feel people know what they're doing in this situation and don't like being called out.", "NTA, unless he has taken on other financial or planning costs for this trip. If he planned it all or paid for the  rental car or something like that it's probably splitting even in his mind. In that case I still think you aren't an AH for questioning the bill situation but it is something that should have been discussed at the start.\n\nHe's a super AH if he's just assuming you will cover more of his food costs because you earn a higher amount. While yes it would be nice of you to do that here and there, especially if you know this trip is harder on his wallet, it shouldn't be an expectation", "why did you send him the $17 knowing that you shouldn’t have? he’s trying to make you feel like you should pay more because you make more when that’s not how that works. he needs to pay for what he buys especially when it’s in excess. NTA", "NTA.  Imbalance of income and expectations.\n\nBut;\n\nYour ‘diet’ does not seem healthy, or sustainable, or an actual ‘diet’.\n\nThe currency symbol goes before the value.\n\nHolidays are meant to be enjoyed, not endured.", "In all fairness, something should have been said pre trip. Establish ground rules. Later is worse", "You all have low standards for your friends. I mean you are perfectly fine having friends who actively try to FUCK YOU OVER. (Do you know why this says about you?)", "Explain your expertise on this issue please.", "So? You are fine with being taken advantage of if it only happens once? IMO you need to rethink this.", "Does he earn less and seem to resent your higher pay?", "Why does it seem like serious self esteem problems?", "I would just ignore the request. I’d either pay for my bill separately or only send enough to cover my coffee.", "Yeah, tell him he is being petty over the price of a coffee.", "It can. My friend does this and has a 1 hour eating window.", "The joke is that you are supposed to see a doctor but no doctors actually understand fasting in the least. You give hollow advice at best."]}