{"id": 18900, "submission_id": "13zpqko", "title": "AITA for being rude to a man asking for my number?", "selftext": "I’ve started to learn French recently. My friend recommended we go to this language Exchange place where you choose your target language and chat with new people. I had a lot of fun, met a lot of people and really felt my French is getting better. Anyway, my friend had to leave a bit earlier so I stayed by myself. I was approached by an older man (in his late 40’s-early 50’s) and we started to talk a bit until the session ended not long after. I took my bag and said au revoir to everyone but he stopped me and asked “oh you’re leaving already?” I said yes as the session is over. He took out his phone and said “you should give me your number, so we can meet outside of this (for a date)”. I was shocked as I told him I’m in my 20’s. I told him he’s way older than me to which he replied “it doesn’t bother me”. I turned my back and walked away. I felt so disgusted and angry. He’s my dad’s age! He looked like a predator in my eyes and now I don’t want to come back because of this.\n\nMy friend group is split, some say I was right but others think I was an AH and way too harsh on him, that he just “shot his shot” with me. So AITA?\n\n*sorry for my English, it’s not my native language.\n*also I’m usually really nice when people ask for my number as I know it takes a lot of courage. Just not when the person is twice my age.", "created_utc": 1685826676, "permalink": "/r/AmItheAsshole/comments/13zpqko/aita_for_being_rude_to_a_man_asking_for_my_number/", "score": 1143, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1. For being rude for an older man who asked for my number.\n2. I could’ve politely decline his efforts without humiliating him\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nWhen a stranger who seems double your age says you \"should give\" them your number, they deserve what they get. He took a big risk, hoping you were naive/dumb/whatever. He discovered you weren't.\n\nGood for you.", "Fuck politeness.\n\nNTA", "nta, he was being creepy as hell.", "NTA, I wouldn't have been this polite. You just walked away, that's not rude, you already said to him he's too old for you.\n\nHe should have walked away after that.", "NTA\n\nYou're not obligated to entertain the dude", "NTA. No need to point out the age difference; he's pretty aware of the age difference and it didn't deter him asking (demanding, almost) your phone number. No (or \"non,\" in this case) is a complete sentence.", "NTA. He asked, you said no. That should have been the end. It doesn't matter if the age difference bothers him; what matters is that it bothers YOU. If he'd simply said, \"okay, have a good night\" when his request was denied, this wouldn't be an issue at all. You don't owe anyone an explanation for not giving them your number. The next time it happens, give them the number of your friend who thought you were harsh.", "Lol, you should have said, “well, it bothers me.” NTA", "NTA, I don't understand how could your friends think that you're TA when there is literally a man with similliar age to your father asking you on a date. That guy is a creep, I could never imagine asking someone that is around 2 times younger than me on a date. If you're friends think that he was just \"shoting his shot\" and that you were to harsh on him then I don't think those are good friends.", "okay I'm confused? where the fuck is the bit where you were rude? I think you handled it well.\n\nNTA", "NTA walking away after telling someone “no” isn’t rude!", "NAH.\n\nHe shot his shot. He wasn't being \"rude\" or \"overly pushy\" about it and he took 'no' for an answer.\n\nYou didn't much care for the shot, so you shot his shot down. And you took a shot at his shot for being a shady shitty shot.\n\nShoot, I'd shoot down that shady shitty shot if I'd had a shot at shooting down that shit.\n\n.\n\nSo I'm 100% on your side in terms of how you felt and how you found his advance creepy. But there's nothing inherently wrong about askign and being told no and that's all he did. So NAH.", "NTA, if he approaches you again report him to those that run the group.", "NTA.\n\nYou were brusque, but that is the risk an older man takes when he asks for a young woman's number.\n\nHe knew the risk, believe me. He won't care. To a bon vivant, getting shot down is all part of the game. They're basically annoying but dauntless.", "NTA. He's such a creep lmao. I'll say you weren't rude ENOUGH to him, should've insulted him on his face.", "NTA. He shot his shot and got shot down. You don't owe anyone politeness,  especially if they make you feel uncomfortable.", "Not the jerk. He asked for your number. You politely said no. He pushed. You walked away. Nothing wrong at all.", "NTA just because a bro shoots his shot doesn't mean shit.", "NTA you were honest and didn't lead him on", "NTA. You set a boundary, good for you 💖", "NTA. You don’t owe this putain anything", "NTA. \nYou were very nice. My daughter would have probably said something about the lines like “ sorry, but I don’t have daddy issues” or “are you effing serious? You are older than my dad” \nSo a nice no was more than he deserved.", "Ew. NTA. \"It doesn't bother me.\"... \"Well it DOES bother ME.\" Or you could you with what I said to people when they asked if I was my dad's date to a wedding once. (I was 19) \"Do you really think that I (gesturing to myself) would have anything to do with that?(Gesturing to my dad.)\" Dad didn't mind because a. I'm his daughter. B. I'm too young for him, you know, young enough to be his daughter. You don't owe men who dismiss your rejections politeness.", "When men have nothing else they have the audacity.", "NTA for obvious reasons.\n\nFirst off, “you SHOULD” from my understanding he was demanding you give your number to him.\n\nSecondly, you hardly know him. He could be a serial killer for all you guys know. Doesn’t matter if you gave him your number and you guys just talked he could still take advantage of you.", "NTA - you're not obligated to make a creep feel better.", "NTA old pervs deserve to be treated like old pervs.", "NTA, though maybe you could have just said “no thank you” instead of pointing out the age difference. Like obviously that’s a factor, but that wasn’t gonna change his mind, he’d already asked you out. Just say no and walk away, he isn’t owed your number.", "OP is NTA. It's okay to say no to his request.\n\nHowever, all the idiots here (who are about to downvote me) labeling this guy a creep simply for asking are the AH's.", "NAH.\n\nHe was just shooting his shot. He knew that you were younger than him, so he should be prepared for the worst. The way you handled it was a little bad, but he understands that he looks like a predator, so nobody is in the wrong here.", "NTA.\n\nYou were not interested in dating him or giving him your number and let him know, then walked away. That's not rude at all. Dating advances & pua style cold approaches come at a 50% risk of rejection and everyone who decides to gamble in a 'shoot your shot' context knows this fact. \n\nBut all the anger and disgust connected solely with his age is a bit OTT, assuming that you are an adult or older teen who could easily pass for an adult. If he gave the impression of being an entitled weirdo, pestering jerk who was very rude, tried anything criminal or made vulgar comments to you- that would be different. \n\nI'm only attracted to guys that are older than me and date with a minimum 15 year age gap.  I'm not interested in any dating/sexual involvement with guys in their 20s or teens and never have been. But I don't take it personally or get enraged when they politely approach me. Nor even worse try persuading me to change my dealbreakers for them because they are 'different from all the others'. Just make it clear that I'm not interested and walk away.", "NAH for the interaction. Are you aware of the age gap in the French President's relationship? They don't see it as anything inappropriate. He asked you out, you shot him down. There's nothing wrong with that.\n\nHowever, YTA for coming here and calling him a predator for...being middle-aged? Get over yourself.", "YTA. I hate the world has become so fragile that flirting has become \"predatory\". Get over yourself, say No and get on with life. \n\nThe dude shot his shot. That's what happened all the time back before everyone needed to lighten the F up.", "Well, if he was presenting himself as he did, you could have just said \"No thank you.\" nicely.   \nStill, NAH, because you're an adult, not some child. An older guy finding you attractive isn't wrong, and you have a right to turn him down too, and you didn't call him names or anything... Right?", "Not rude. If he was really into you and had game, he would've been able to spend more time with you, the age wouldn't have mattered and you probably would've stuck around to spend time with him, but you weren't really interested, had any expectations like that and probably knew his interest anyway.\n\nSo that's all on him. You owe him nothing.\n\nI'm 34, look early mid 20, have no hang ups about age, take all the rejections in stride as it's a part of life and know everything is putting yourself out there and opening yourself up to that rejection from the start, which he didn't because his intentions caught you off guard. Maybe if he said something earlier or gave noticeable and gave you time to adjust and warm up things might have been different but in doing that it opens things up to earlier rejection and potentially being seen as creep for even trying then.\n\nHe was likely trying to gauge interest and build up something before asking but in the moment, especially when it's not at all your intention to meet someone like that, let alone an older man, that's usually the hardest part.\n\nNo harm in him trying just as much as there's no harm in you rejecting him.  So long as he respected your boundaries and you were safe, there shouldn't be much to worry about. If he's anything like me, rejection can occur on a near daily basis so he may be totally used to it.", "NTA It was creepy.", "NTA. Creepy dudes count on us being taught to be \"polite\". Pffft. You don't owe anyone your phone number. He's a predator counting on your youth.  \n\nBTW, do go back to your class. If he is there do not feel awkward. He's the one who deserves to feel uncomfortable. If he tries again, tell him \"for the second time, I am not interested in dating you. My dad is younger than you! Please stop\". Don't yell, but say it loud enough for others to hear. \nF politeness.", "NTA\n\nWell Done you! Predators use social contacts, such as manners, to guilt trip their victims into extending contact, thereby giving them more opportunities to close with their victims.", "Yta. Not for saying no, but for coming on here and your description of the situation. You’re an adult calling another adult a predator. Id say you’re the creep. Say no if it isn’t your thing, but don’t go shaming other people because of your own insecurities.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI’ve started to learn French recently. My friend recommended we go to this language Exchange place where you choose your target language and chat with new people. I had a lot of fun, met a lot of people and really felt my French is getting better. Anyway, my friend had to leave a bit earlier so I stayed by myself. I was approached by an older man (in his late 40’s-early 50’s) and we started to talk a bit until the session ended not long after. I took my bag and said au revoir to everyone but he stopped me and asked “oh you’re leaving already?” I said yes as the session is over. He took out his phone and said “you should give me your number, so we can meet outside of this (for a date)”. I was shocked as I told him I’m in my 20’s. I told him he’s way older than me to which he replied “it doesn’t bother me”. I turned my back and walked away. I felt so disgusted and angry. He’s my dad’s age! He looked like a predator in my eyes and now I don’t want to come back because of this.\n\nMy friend group is split, some say I was right but others think I was an AH and way too harsh on him, that he just “shot his shot” with me. So AITA?\n\n*sorry for my English, it’s not my native language.\n*also I’m usually really nice when people ask for my number as I know it takes a lot of courage. Just not when the person is twice my age.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA.\n\nSorry he ruined the night for you. I hope you and your friend will go back again. Hopefully, he won't be there.", "YTA. Grow up. You’re an adult and it’s perfectly reasonable to be approached by other adults while out in public. Nothing he said seemed rude so there was no need for you to respond rudely.", "Yeah, do NTA. He should’ve shot his shot at a woman in her 20s when he was in his 20s too. It doesn’t bother me indeed. Lol. Good comeback though. NTA.", "He didn't even get anything but ignored, which is pretty diplomatic all things considered. Since when is walking away from someone a bad thing?", "NTA ! and well said !", "He wasn't necessarily hoping she was naïve or dumb, he was more likely just hoping she liked him enough to go out with him. She's \"in her twenties\" so she's an adult, and it's even possible he's not as old as she thinks he is, just looks older. She didn't even say he was a stranger, he was someone who participated in the same activity she does and may even have spoken with her as part of the activity. I'm in agreement with the friends who think she was too harsh.", "And stay away from creepy old men", "Exactly what was \"creepy\"?\n\nAre you too immature to deal with one adult asking another adult on a date?", "Uh, no, please don’t give anyone some one else’s number without their consent. That’s an AH thing to do. Everything else, yes, 💯. \n\nNTA", "How about, 'Oh it doesn't bother to you to date someone as old as your parents. Hmm, why don't you go find a 90 year old to proposition, then?'", "Yes. And it didn’t sound like he was asking. Telling someone they should give him their number is more of a command. I bet it had worked for him in the past to shock someone into meeting with him again. Total creep.", "That made me “lol” 😂 thanks!", "Man do I love this😂", "Nah, finding someone younger than your child attractive IS wrong, and he didn’t accept her first no.", "[removed]", "I’m assuming his age because he told me he has a son who’s 28. \n\nTo me he’s a stranger, we didn’t even exchange names (pun intended).", "Women are always being given this riff and then, when something bad happens, are told they \"should have been more careful/should have known better\".  \n\n\nAnd letting guys down gently? He's an adult, too and he was pushy. She knew instinctively that shutting down hard was the only way to make herself clear on this.", "I could buy that he wasn't being creepy until he said \"it doesn't matter to me\" when she said their age difference bothers her. He should have said \"okay, good night\" when she didn't want to give him her number. She doesn't owe him an explanation or being concerned about letting him down gently. He asked, she said no, that should have been the end.", "Spotted the predator. Justify it all you want. Never in your comment did I see concern.", "Hey. Not all of us are creeps.", "He was too inmature to take her first no", "Too wordy.", "No it isn’t. It’s creepy, but not a predator.", "OK, so something like I thought. You’d had some kind of conversation in the course of the activity but it didn’t include *”je m’appelle.”*\n\nI probably wouldn’t want to go back either, because I’d think it would be awkward. But I still don’t think the age difference is creepy. I dated a guy in his forties when I was 25 or so, somebody I met at work. Didn’t last long, but I didn’t feel creepy.", "k", "No, he offered a counter point. \n\nYou act like she ended up duct taped in his trunk.", "It's creepy because it's predatory.", "Your experience isn't the be-all and end-all though, everyone is entitled to having different boundaries and feelings towards age difference in dating. \n\nDude was clearly a stranger who approached her shortly before the end of the meet, whether they exchanged names or not is so irrelevant. She's also entitled to rejecting anyone she wants, stranger or not. I don't understand how anyone could view her behaviour as harsh or problematic in any way.", "FYI- if someone expresses they are not interested the first time you ask, there is no \"counterpoint.\" A \"counterpoint\" is creepy. No means no. She obviously expressed discomfort at the whole thing and that should have been the end of it. Men who can't take no for an answer are why women are scared of men. She's not some hysterical woman inventing wild scenarios that never happen.", "Saying he doesn't care is not a counter point.\n\nIf she brought it up it's because she cares.", "☝🏻", "FYI. The very recent influx of fragile personalities is not going to change the bulk of social interactions. \n\nIf a 20 yr old can't handle an innocent flirt by a 50 year old, it's best to stay indoors. \n\nThe \"wild scenario\" was the guy said age don't matter. OH MY LORD!! AHHH !!! RUN AWAY!! RUN AWAY!!", "Yeah, that's how hitting on someone works.", "No hitting on someone implies understanding \"no\" .", "You miss 100% of the shots you don't take.", "NTA I had to go back and reread and see where you were “being rude” because I didn’t detect any rudeness there. You simply walked away.", "Ugh the whole \"just shooting his shot\" is stupid and gross. NTA", "NTA\n\nYou are not owed strangers politeness when they are trying to pursue sexual/romantic contact with you.\n\nHowever, you are in your 20s, he’s in his late 40s. He is not a predator. I am also a woman in my 20s and would not date someone that old, but he’s not some kind of perv for politely asking for your number after you had a nice conversation.", "NTA\nHe’s a creep", "NTA!! The fucking audacity of men, I swear to god. Women get killed for trying to be nice or being afraid of saying no. Whoever told you you were rude is so, so wrong.", "Nta. Ewwwwww doesn’t bother him", "NTA but maybe you overreacted some", "NTA and I don’t even think you were that rude. “It doesn’t bother me”; some nerve on that guy.", "NTA. It’s supposed to be a place to practice language, not pick up dates. This sounds like dude is there to try to take advantage of people. Gross.", "YTA for age shaming. You are both adults; it infantilises women to see older men as inherently predatory. Would you have felt so disgusted if a black or disabled man had asked for your number? You've got to work on your issues if you felt disgusted and angry about being asked for your number.", "If was pleasant and nice when he asked and you were just ride to him. I would say yes. \n\nAll you have to say is thank you, but I am not interested.   Now if he didn’t take no for answer. You would be justified on being rude to the guy. \n\nWith that said, I am a guy and my perspective is based on my experiences.", "[deleted]", "Why is asking for a number still a thing? Wouldn't it be more polite to offer the other person your number? Then the other person might offer her (or his) number in return, or would be able to decide about contacting you later.", "'way too harsh on him, that he just “shot his shot” with me'\n\nYour 'friends' need a reality check. \n\nHe can shoot his shot, sure. But there is a time and a place, and this wasn't it. You were there to practice French, not to pick up old dudes.\n\nYou don't owe him politeness if he tries it on even though a) it's not appropriate and b) you didn't give him signals that you were interested.", "NTA. You said no, the guy pushed, you left. What exactly do your friends think was harsh about the way you handled it? You were way more civil than a lot of my friends would be. \n\nIs there an instructor or assistant at this language exchange who you can tell about your experience? You shouldn’t have to give up a learning aid in order to avoid a creepy guy. See if there’s anyone overseeing the program who can help.", "NTA, just reading that made me uncomfortable", "#YTA but if you felt unsafe, who cares? \n\nSometimes enforcing your boundaries makes you the AH someone else story. \n\nLet's break this down\n\nNot everyone is comfortable with large age gaps that's completely fine. He wouldn't have known where you stood on it unless you said something before \n\nYou felt like you were in danger so you reacted to it. I'm not going to blame you for that. It is what it is.\nHowever, It seems illogical to me to paint this as violence perpetrated against you, I've seen very disrespectful attempts to ask women out. The way you describe it seems like a normal respectful conversation.\n\nBased off what you're telling us, it sounds like it was in general a respectful interaction until he asked you out. There was a dialogue about it. To me It would have made more sense if you said any of the following. \n\n\"Well, it bothers me\"\n\"No\"\n\"Absolutely not\"\n\"No thank you\"\n\nYou literally just walked away. Honestly it's not the end of the world. But yes it was rude. Especially if he wasn't being rude to you.\n\nI see lots of people trying to communicate this but being bombarded with downvotes. It's reddit so I'm expecting no effort for understanding.", "How so?", "OP said she responded with “I’m in my 20s” making me think she’s like 26-29 (if she were like 22, she would have said “I’m 22 instead of I’m in my 20s). Some are disgusted with large age differences, but late 20s is a fully formed adult imo, fully capable of making their own decisions and difficult to take advantage of. from this perspective, you can find his actions as gross or creepy, but not predatory. Early 20s is a different story.", "it’s not the asking that makes him a creep, it’s the asking twice after being shot down. wasn’t his place to convince her to be cool w an age difference after she already expressed discomfort, THATS a lil creepy imo", "I’m not gonna say he *is* a creep, because I don’t know. But his actions were a bit bizarre and were creepy. I’d say “icky,” really. It was demanding.", "So you see flirting as continuing to harass women who turn you down? Interesting.\n\nI think how upset you seem about this says more about the fragility of the masculine ego than the world’s supposed fragility.", "How about for ignoring her first attempt to turn him down? He kept pushing after she told him why it bothered her. He was acting like a predator after that, so why not call him out for it?", "He kept pursuing her after she let him know it bothered her. That’s predatory. Dude didn’t take her first no, he deserves to be shamed.", "[deleted]", "Exactly, we all know of women who haven't (or couldn't) walk away from an overly persistent man and it ended badly. You don't owe anyone an explanation for why you are saying no.", "Yes 💯 NTA", "From her first response she indicated she wasn’t interested. But he kept going, forcing her to turn him down outright. I hate this shit so much.\n\nLike, dudes refuse to take a hint and *make* you tell them no explicitly, so they can call you “rude” or “uppity” and turn you into a bad guy so they can save face.\n\nNTA, OP. This guy’s a jerk.", "Half a decade ago, this sort of age difference was more normalized. It is not as acceptable anymore. A fifty year old man should not be asking out women who are younger than his own children. They know that, and now so do most young women.", "I agree, I think he just shot his shot. I wonder if it's the age difference that makes everyone in this sub suspect he thinks she is dumb/naive? I don't see how he acted in a way that he perceives her as dumb/naive.", "That’s the thing though, he didn’t politely say “would you like to go on a date with me,” to which she could have politely responded “no, thank you, I’m not interested.” he said “you should give me your number” ick", "Because she is literally younger than his son. That's creepy.", "I have to admit you are entertaining. You are either a troll, or a creep. Maybe you watch too many redpillers. But in case you aren't a 13 year old, if a woman says no and starts to leave, that indicates they aren't interested.\n\nI mean, even asking in this case feels like the kind of thing a pick-up artist does, just ask everyone around you until you get a yes. And if they say no, try and argue with them. Because coercing someone into dating you is a great way to start a relationship.", "Well this is telling af", "refused to take no for an answer, was like 30 years older", "A simple 'I'm not interested in older men' would suffice.", "Maybe he will, u don’t know what he’s into.", ">Telling someone they should give him their number is more of a command.\n\nYou might be reading too much into this. It's a common figure of speech. \"We should try that new burger place,\" \"you like Jane Austen? You should read Cold Comfort Farm,\" \"you're going to Florence? You should visit the Uffizi!\" Unless it's coming from an authority figure, it's a suggestion.", "She could always give him the number to the local pizza place she never goes to. That way she’s got a number ready to give away, and there’s no possibility of giving out a number that could endanger anyone.", "Your definition of \"continuing\" needs work. Sounds like their entire conversation was under 5 seconds.", "Ah yes, the classic predatory threat of \"it doesn't bother me.\" This guy was an absolute gentlemen.", "Was he overly persistent though? He just asked for her number for a date, and then sounds like didn’t say anything when she walked away. No trickery or deception involved.", "That's why they used the adjective \"creepy\" and not \"all\"", "Then this doesn’t apply to you, does it?", "Don't be ageist you biggot.", "Where in her story do you see him insisting after she walks away (says no)? Sounds like he made his perhaps poorly chosen advance and that was that NAH", "She showed she wasn’t interested, he kept trying to persuade her, thus continuing the interaction. Which should have stopped after she indicated she didn’t welcome his attention.\n\nAlso, I didn’t realize calling behavior “inappropriate” came with a time requirement. How long does a man have to engage a woman who clearly isn’t interested in him and is actively trying to leave his presence before he can officially be called predatory?", "Interesting that you see a man continuing to push a woman who’s shown her discomfort with the situation as a “gentleman”.\n\nSays a lot about you, honestly.", "Duct taped in a trunk is your threshold for \"creepy\"? Tell me you're an oven without telling me.", "No means no?\n\nI hope every gay man you meet for the next 30 years hits on you and never takes your first no. \n\nThen come back and tell me how a gay man never taking your no and giving counter points is perfectly fine and acceptable. \n\n\nI bet you'd act like they shoved a dildo in your ass or whatever.", "There *is* no counterpoint. She said no. End of story. Also his “counterpoint” completely disregarded her feelings on the age matter, which gets another point in the creep column", "Uh, 1) he doesn't get a \"counter point,\" it's not a hostage negotiation. She said no thanks, she's not interested.\n\n2) \"It's not a problem for me\" isn't even a counter point, because it's a problem for her so it's irrelevant. Why would she care if some saggy-balled middle aged creep sees no problem with trying to fuck girls younger than his kids? Of course he doesn't, he's gross.", "By his 40s he should know her pointing it out was her saying it was an issue.", "6 seconds.", "Calm down, OP won't sleep with you", "Exactly. Some people find it creepy and it is. Find someone  your own age unless you were widowed and you want more children, other than that stick to people pretty much as close as possible to your own age.", "What are you even talking about? The thread is a man being creepy to a woman. \n\nAnd yes, no. Means. Fucking. No. Wether you like it or not.", "Fun fact. I'm hit on quite often by gay men. I tell them thanks, but literally not my type.\n\nDo you know what 99% of gay men do when they hear that? \n\nThey give it one more shot. Something harmless like \"well, if you ever want to try something new\", or words to that effect.\n\nThen, like a normal person, I say No Thanks again. We usually laugh. And on occasion, I tell them I'll still accept that drink if that was part of the proposal. \n\nSee how grown up and well adjusted these things can be? And used to be for years and years?", "Ah, now I see why you identify with the creepy old man so much.", "It stopped being innocent when she said no and he kept pushing. He disregarded her boundaries in their first interaction. That's not innocent, it's creepy, gross and predatory", "She did handle it. You're the one being fragile here.", "She handled it. You're the one whose delicate feelings are hurt despite (presumably) not being the rejected creep.", "If you’re wondering why you’ve earned negative 1000+ karma in this thread it’s because you’re wrong", "“Innocent” lmfao", "No, that’s how harassing someone who’s shown they aren’t interested in you works.", "\"well if you want to\" is a lot different than \"i don't care\"", "Keep tipping that fedora", "And no fucks were given that day.\n\nBy either side! (Get it?)", "Cool. You should be her atty and file a big lawsuit.", "I've heard the whole gambit. Do you not know gay guys come in all flavors of attitude? \n\nHave even been called ugly after pointing out I'm straight. \n\nWhat ever their reply, I know I'm looking good that day. Tell the wife I'm \"gay guy hot\" that day.", "LoL! So calling out creepy people for creepy behavior is “fedora tipping”? Lol, okay.", "Gosh, how jolly hilarious; I’m splitting my sides with laughter. /s", "He took a shot, she said no he said he didn't care that she said no....", "and if you miss the shot you should probably stop shooting- unless you wanna get called a creep🤷🏼‍♀️", "No is a complete sentence. Asked and answered. He should have shut up and not bothered her again.", "Why, is a lawsuit what it will take to educate you on the difference between “hitting on someone” and harassment? \n\nBecause I think you could probably figure that out on your own with a little bit of research and soul searching.", "Expect that is not what you said initially.", "That sounds correct. Good job skippy!", "Or, keep trying as dating is a numbers game.", "I'm really happy you are so bothered by this.", "Me? I'm not the 50 yr old in question. You gotta sue him.\n\nI thought you internet atty's knew this stuff? But def go forth with the harrassment suit. It has legs.", "NAH   \n\nFor future reference:  867-5309", "Let me guess, your friends who said you are an AH are all men? Lol\n\nNTA, OP.  You don't owe any man anything, let alone your number.", "NTA I’m proud of you for not being “nice”. \n\nI’m in my early 50’s and yes, these old dudes are predators.", "nta. your age doesn’t bother him bc he wants someone naive & unassuming. probably easy to manipulate. that’s creepy af. especially to use the word “should” 😖 ick", "NTA.  Don’t worry about being polite to a creep.", "NTA sorry such a great experience ended on a sour note.  Men like this are quite difficult to deter so IMO rude is the way to go. If they can't take it they can just stop doing this bs.", "NTA\n\nThat's self defense not being rude", "NTA. You are there to cultivate languages of interest. He was super gross, both to fathom anyone young enough to be his daughter would welcome that kind of attention, and for bringing that into a space dedicated to an entirely different purpose.", "Well, yeah, men who chase women half their age gross me out. However, you are not a child, so he's not a predator if he asks you out. At the same time, you don't have to coddle a man's ego when he asks you out. Especially if he's being rude and presumptive about it.", "Just be careful in these situations. Women have been hurt for saying no. Not saying this guy would have hurt you but there are a lot of people who can't take rejection. NTA", "How were u being rude? Don't feel bad for being honest and straight forward.", "NTA\n\nI wouldn't even call you rude. When you pointed out the age gap it clearly meant you weren't interested. He pushed back even if gently so walking away wasn't rude.", "I don’t think your TA. The exchange was fairly straightforward. Don’t let one horny old bloke destroy your fun. Keep going and enjoy yourself", "If her gut didn't feel right then to shut him down like she did is a thing. If he gave off \"creeper vibes\" and she felt uncomfortable that is your intuition kicking in. That is a survival thing. Get the hell out of there right quick. Hurt feelings be damned. Last year I had this guy at our city bus depot tried to lure me into his car. I was waiting on Uber to arrive. \n\n*I just got dropped off from my company's charter bus. My company paid for a charter bus to shuttle us up and down the hill to get to work for the 2nd &3rd shifts. I had just done with the 3rd shift. \n\nThis gave off some serious creeper vibes and I felt very uncomfortable so i stepped back and got my bear spray out (my boyfriend got for me when i had too wait @ night fro my work bus).  I warned him to step back mind you others were watching. I just let him have it. He learned the hard way. Play stupid games win stupid prizes. \n\nI am glad OP stood her ground and not give into the man's request. High 5to you.", "You’re NTA.\n\nYou did the right thing by declining this man’s advances. It’s good that you stood up for yourself in this situation.\n\nAs for your friends, don’t listen to them. Nothing you did is what I’d consider rude, so don’t worry!\n\nPS - your English is great!", "NTA. Your friends saying he’s just shooting his shot must have missed when he forgot to ask nicely for your number, instead of ordering it, and then didn’t take you pointing out the age difference as a big fat fucking hint. Instead saying it doesn’t bother HIM. Like??? It obviously bothers you? Your response was perfect", "NTA. You basically told him no and he refused to accept that answer. He is a creep.", "NTA\n\nIt's gross and honestly insulting when someone like that tries to make moves. Just nasty.", "No, be rude. Be an asshole. That's the risk you take when you try to hit on people.", "> I was shocked as I told him I’m in my 20’s. I told him he’s way older than me ...\n\nIt's probably better to just say \"No\".  He might ask why and you could tell him if you want to, but you don't owe him an explanation.\n\nThat said, this guy is probably a creep who goes to this language exchange group for the purpose of meeting much younger women and asking them out.  I don't think that should stop you from going, just be prepared and know what you'll say if he asks you again.\n\nNTA", "Yea it does take a lot of courage but he should’ve left it as that once you said he’s twice your age. At least he was upfront with his intentions and said the date part. Next time just add oh I’m not available and walk away. Or even a thanks for your interest bye. Lol", "NTA. \n\nThis sounds like a socialization event, not a speed dating event. No is a complete sentence and if your red flags were going off, you were right to question it and walk away.", "NTA, when I was in my 20s (now in my 40s), I was polite to way too many guys that I wasn’t interested in, who were persistent, and I felt like I had to give them a shot.  So I applaud you for setting your boundaries and staying firm.", "Wow. A man hitting on a woman above the legal age. That is not a predator. A simple no thank you, im not interested is enough. But to call him a predator? That’s an AH move.", "NTA.\n\nHowever whether his behaviour is acceptable or not depends on the details.  A 45 year old is absolutely OK asking out a 29 year old.  No judgement at all.\n\nA 21 uear old is a different story", "NTA.", "NTA", "NTA.\n\n“It doesn’t bother me”. Mf, clearly it does bother the one who said you’re too old", "NTA. You’re not required to give your phone number to any random creep who asks for it.", "NTA.", "NTA.  You weren't harsh.  Don't let him ruin this resource for you.  He overstepped.  His bad.  He's a big boy and I'm sure he is used to being rejected much more harshly all the time.  If he tries to guilt you, remind him it's not a dating event, not a night club, not his hunting ground, et cetera and he ruined a pleasant interaction.  Or ignore him.  Your guy friends that said he was just shooting his shot?  Think twice about them.", "NTA I don't think you were rude at all. You stated a basic fact, that he is way older than you.  You did not owe him a conversation about it. Turning and walking away was probably the politer thing than what would have been said had you stayed lol", "Nta.  Yuck.", "NTA. I've been way ruder than this lol", "NTA. He sounds incredibly arrogant. You mentioned your age and he said it didn’t bother him. The guy can’t read the room. No wonder he’s unattached or looking for dates.", "NTA. Not by a mile.", "NTA and look out for other signs of misogyny from your friends that thought you were too harsh. That mindset is toxic and easy to look past, because of the patriarchal world we live in.", "NTA.  Regardless of whether his intentions were good or brave or whatever, your time, attention, and energy are not a prize to be won.  He doesn't \"deserve\" your number because he tried.  The \"friends\" who are saying you're the AH aren't good friends.  Watch out.", "Yea, it doesn’t bother HIM.   🙄", "Doesn't really sound like anyone was an asshole here, people, of any age, can express interest, and people are free to turn them down. Some may be ok with an age difference, some aren't.", "I feel like that answer was both diplomatic and relatively polite.  Idk what your friends are calling harsh.  Nta", "They do this with young women on purpose. Your friends aren’t quite up to speed yet. NTA", "Because of the sub id say YTA only because you could have handled it better. He gave you an out \"it doesn't bother me\" you reply \"well...it bothers me, but thank you\"", "NTA", "NAH.\n\nHe asked you out in a social setting. You said no, and walked away. He didn't hassle you on social media, or cuss you out, or pursue you after you said no.\n\nPeople say \"NTA, you go girl!\" so quickly, but forget that \"NTA\" means that the guy is therefore an AH. I don't think that's fair in this scenario.\n\nI don't think we should be calling guys AHs for asking a woman out (providing of course both are of an appropriate age, and the setting/context is not inappropriate.)\n\nOK, yeah, he's older than you and it's a bit weird. But it's not illegal. I don't think he's an AH for trying! I think you're being a bit judgy-wudgy, if I'm honest.", "I mean, NTA really, but \"you're twice my age\" is always a terrible response.  Just say you're not interested. The response you gave is why he responded the way he did, you left him an opening. Next time, just (politely) shut it down.  If the dude continues to pester then yeah, get rude as you want.\n\nImo it is weird for a guy in his 40s to go with a woman half his age and all, but also some ppl are into that, in both age groups.", "NTA!", "NTA. you owe him nothing", "I agree with your premise, but do think the term “creep” I used too liberally here. Rapists are creeps, stalkers are creeps…", "Apparently women turning down creepy men is considered rude.", "Exactly. And also, as an asexual person, I hate the way any given social situation can be made uncomfortable and uninviting by men who just want to \"shoot their shot\".  She's at a language meet up. This is the first time she's met any of there people and now it will be the last because some dude couldn't realize it's not the time or place.", "Disagree, she said “You’re too old for me.” and he tried to argue that he didn’t care, implying she wasn’t allowed to care either. Ignoring a no is creep behavior.", "I agree, he asked for her number and she said no and he let it go.  I'm not sure what the controversy is lol.  It's not like she screamed at the top of her lungs and cursed him out.", "I bet he goes there to pick up dates rather than to practice language.  He knows there will be much younger women like OP there.", "> but that wasn’t gonna change his mind...\n\nChances are he goes to this group in the first place for the purpose of meeting much younger women to ask out.  This is definitely a thing that some creepy older men do.", "Fortunately for OP, this guy sounds like a garden-variety creep who found a place to meet much younger women and try to pick them up.  He probably isn't dangerous, but of course OP should always be careful that he isn't following her home or some such thing.", "bro, if you are trying to date women younger than your own kid, you're basically a predator. the fact thats she's an adult just means he's not dumb enough to actually go after a minor.", "Right?  This wasnt even remotely harsh.  This was a no with a good reason, and walking away once the answer was given. Pretty straightforward.", "It's kinda rude lmao", "😂😂😂", "Noticing someone is a creep before they rape or stalk is kinda the point of ayong someone is creepy. Unwanted advances w follow up is creep behavior.  If you think the line for creepy is at criminal behavior 🫣😬", "Exactly!! My husband and I have an age gap, he’s not a predator. She could have just said no and left it at that. But she’s acting like he’s hitting on minors. Seems like drama causing and looking for attention.", "Me too! \"shady shitty shot\" I even checked the Username to see if it said \"Ted Geisel\".", "Him telling her he didn’t care about why she wasn’t interested was probably a step too far", "Omg I had “friends” give my number to random guys. UGH. needless to say, they did not remain my friends.", "If you are hitting on girls half your age, ur a creep.", "Hey. You’re one of two things.\n\nAn older person who got offended for the wrong reasons. They aren’t referring to anyone who is old in a blanket statement. \n\nOr. Creeper.", "Positive buzz out for gum jobs", "Also considering OP said english isn't her first language, it's possible it wasn't the man's first language either and he didn't phrase it well is all.", "I agree, but there has to be a spectrum.\n\nInappropriately asking out a woman and not taking no for an answer? Inappropriate sure, but creepy? Creepy is when you’re doing shit on the sly… this dude was pretty forward, if wrong .", "You see to me this is where the grey area and nuance comes into play.  I can't really say yes or no based on the information given.  When it comes to asking someone out, flirting, etc all the little details matter when labelling someone.\n\nIf she says \"no you're way too old from please go away\" and he's like \"age ain't nothing but a number, baby\" then yeah absolutely I agree. \n\nBut if she's  just like \"do you how old I am?\" And he's like \"yeah, it's fine.\"  That's not a step too far in my book, that's just continuing the conversation in which she said no and walked away and if he doesn't pursue any further, that's just regular \"shooting your shot\" as this commenter said.", "He didn't ask though - he said \"you should give me your number\". He demanded it. Stop making excuses for bad behaving men like they are little toddlers who don't understand human interaction. Such bullshit.", "No, but walking away is a better move than lingering at all and giving him the opportunity to keep going.", "He did not just ask though. He told her what she \"should\" do.", "responding that it 'doesn't bother him' after he received a pretty clear rejection at ops obvious disgust at him being twice her age was pretty persistent", "When she told him he was twice her age, he told her “it doesn’t bother me” when it was obvious it was not about him being bothered by it.", "He told her what she should do. He didn't ask. Telling her is pushy", "calling creepy old men what they are isn't ageist", "A no is the end, not the start of a negotiation", "'it doesn't bother me' after a clear rejection based on the age gap is not 'a counter point'.", "1- she did handle it\n\n2- “a 20 years old”, “innocent flirt by a 50 years old”.  A 50 years old flirting with a 20 years old IS the creepy part."]}