{"id": 18921, "submission_id": "14006wf", "title": "WIBTA if I spoke to my in laws directly about wanting their help more with our kids?", "selftext": "My husband (32M) and I (34F) have two children ages almost 2 (21 months) and 4 months. Naturally, this is a difficult and challenging season of our life. Any parent would understand that we are surviving, not necessarily thriving. \n\nMy in laws sold their home 3.5 hours away and purchased a home 1.5 hours away under the veil of being closer to us to be more actively involved grandparents to our 2 children. Since they have moved, we do not see them any more than we did when they lived 3.5 hours away. This breaks my husbands heart. \n\nI encourage him to ask them directly to come visit, to come over XYX days we are free, and encourage him to setup a plan with them so they know we are wanting some help. \n\nTwo under two has certainly been taxing, and especially the last few weeks (toddler tantrums 🙃). I have asked my husband to be more direct and tell his parents we need some help and a break. He instead takes the passive approach of saying ‘if you’re free and wanna come visit we’d love to see you!’ Instead of a direct ‘WE NEED HELP, can you come over?’ \n\nThe In Laws have not taken him up on his offers  to come visit. My husband is of the opinion that ‘if they wanted to come see their grandkids, they would’ so he will not beg or nag… which I don’t disagree with. However, we are all at the end of our ropes and some extra hands to help with the baby and entertain the toddler would be really wonderful. \n\nWIBTA if I spoke to my in laws directly about us wanting their help more? \n\n——\nAdditional context: we have both had several mental breakdowns in the last few weeks from over stress, frustration, and exhaustion. My family lives 1500 miles away. We could hire a sitter, or a doula. But this is enmeshed with my husbands desire for his parents to be more actively involved in our kids lives.\n\nEdited to add: we are certainly not hoping for someone else to raise our kids. We are also not asking them to come over and babysit. We are asking them to come spend time and maybe feed the baby for us while we tackle some chores or play cars with the toddler so he gets some more 1:1 attention.", "created_utc": 1685850958, "permalink": "/r/AmItheAsshole/comments/14006wf/wibta_if_i_spoke_to_my_in_laws_directly_about/", "score": 153, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I feel like I would be the asshole for intervening between my husband and his parents. That I may be crossing a line. I also feel that I may be opening a can of worms by creating confrontation with them and putting us further than we already are with getting help but upsetting them.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "He’s right, they would be more involved if they wanted to. Time to hire help if you need it and focus on finding ways to spend time with the family outside of the help", "Can you ask for help, certainly. That said it sounds like you expect or demand help so YTA.", "YTA. You and your husband chose to have these kids; they are your responsibility. Your husband's approach with his parents is fine - if they want to help, they will initiate it. You are not entitled to anything from them, whatever your husband \"desires.\"\n\nAs you said, YOU CAN HIRE A SITTER/ Nanny/ or whatever.", "Yes, YWBTA. Your in-laws aren’t obligated to help you with your kids. If you need help, hire some help. You even say in the post that you are able to do so. It’s sad that they don’t want to come visit more, but I think your husband is taking the right approach. I don’t see how making it clear that what you actually want them to do is work, not just visit, is going to make visiting any more appealing to them than it seems to be now.", "In your husband's family they speak in subtext. He already asked and they said no. So if you ask more directly then you will be creating a wedge in the relationship. What he can do is ask them why they don't want to visit after moving closer. There may be some problem or issue they have not shared \n\nIf you confront them YWBTA.", "YWBTA. You and your spouse chose to have 2 children so close in age. This is your responsibility to figure this out. Your in laws raised their children. They cant be expected or demanded to help raise anyone else's. Hire a babysitter once or twice a week, that is their job for stuff like this. 3 hours round trip is still not something people want to do several times a month.", "YTA\n\nThey moved and shortened the commute by *4 hours* so that visits are less taxing on everyone.  It sounds like you wanted them to move all the way over to set up shop as your free babysitters, telling them to completely abandon their friends/family/lives in their previous location.\n\nYes, parenting is very hard and taxing with two young ones.  Other parents out there are sure to sympathize with you.  But that can’t come as a shock or surprise.  Unless everyone specifically said “help with child care,” not just making visits easier, then you’re being an assuming AH by demanding they help with the kids.  Sucks but don’t target the grandparents when you misdirect your exhaustion and frustration over new parenthood. It’s kind of what you signed up for :\\", "I'm pretty sure you have posted this question already a little while ago.\n\nAt the end of the day, you had children with your partner - not your partner and your in-laws.\n\nWe had children, our in-laws were 1000's of km away so we had no support.\n\nOrganise child care so you can have some time out - you shouldn't have expectations that people are going to want to hang out with your kids.\n\nPerhaps your husband needs to move on from having his parents more involved.\n\nI/my partner and I looked after my children, and while I'd be happy to have the grandchildren once we get have some - the expectation that I am a babysitting service would p\\_ss me off.\n\nGood luck.\n\nEDIT: Due to not having support around, we organised child care one day a week so we could enjoy being partners - have lunch, go to a movie, go for a bike ride, talk, not change nappies, focus on the relationship - I think a lot of people forget to do this.", "\"The In-Laws have not taken him up on his offers to come visit.\"  Gee, maybe because you don't seem to want to spend time with them or consider their \"desires\" but just use them for free labor?", "YWBTA, but first, let me clarify you are NTA for feeling overwhelmed, nor are you for wanting some help. However, you stated you had already discussed this with your husband, and he does not want to take that approach. Being that they are his parents, I would assume he is aware of what their boundaries are. If you would like to continue to have a good relationship with your in-laws (and presumably with your husband), please consider an alternative. If you have the means, hire a babysitter and take a night with your husband so you can decompress and have a night of child free enjoyment.", "YWBTA because asking for their help would put an expectation or burden on them that your husband is not comfortable with. You should respect his wishes on the matter. I don't think you would be the A H if, when you're speaking with them, you let them know that you both are overwhelmed. But they should decide if they want to offer their services or not. In the meantime, if you're drowning, don't wait around and wait for help to volunteer itself. Help yourself and hire a sitter or nanny (or a house cleaner or whatever service that can lighten your load).", "As a single parent of 4 for the last 3years all I can do is roll my eyes while reading this \nI'm sorry I know being a parent isn't easy but that's parenting", "YTA. \n\nIt's your husband's job to manage his parents. If he doesn't want to reach out more directly for help from them, ultimately, that's his decision to make. \n\nThat being said, you know, I think it's fair to insist that he's more direct. If you guys are drowning, yes, he needs to ask for a them to throw him a rope, even if it's uncomfortable or dings his pride or something.", "They moved only two hours closer, still ninety minutes away. They did not move to be closer to their grandkids. Be sure that’s clear to you and your husband. NTA for wanting help, but it’s not coming from your in laws. Hire someone two days a week.", "[deleted]", "I think that if you and your husband need help,  you have to b day what you mean. Don't hide it behind the,  so you want to spend time with the kids? Help is help and sometimes ppl just need to hear you actually say it.  \n\nif my family invited me over to see the kids and then asked me to watch them while I do X,Y,Z, I wouldn't mind but I'd rather then genuinely ask for help.  \n\nMaybe just saying,  no obligation but we really could use your help with the kids, if you are free and able.  They may be waiting for this invite or maybe they are not. You won't know until you ask.", "YWBTA \nbut get yourself some help so you can breathe again. Some alone time for the parents,  some 1:1 with your older child or some help cleaning while doing something fun with the kids. \n\nMaybe plan something fun as a family and invite you ILs along if you want them to have a bond with your kids.\n\nIt'll get better,  I promise.  Just hang in there!", "Info: What is your relationship like with them? My mother in law would be upset if I needed help and didn’t tell her that directly.", "YTA - they’re YOUR kids.        \nNobody else is responsible for them.          \nNobody else is obligated to help you with them.          \nHas it occurred to you that they don’t come over because they know you only want them to visit so they can look after YOUR children ?        \nWhy have 2 kids that close if you can’t handle it ?         \nI’m tired of people getting shitty because others won’t do their work for them when it comes to their kids", "YTA. You think your in laws don’t realize you need help but I guarantee that they do. They’re also parents so they know it’s not easy raising little ones especially when they’re so close in age. They have made the choice whether consciously or unconsciously to not be a resource for you and your husband. They moved to be closer to your family so it would be easier to visit. There’s a huge difference between visiting your grandkids and taking care of them. Clearly they just want to be the grandparents who visit. You need to accept that.", "YTA it's his family so let him take the lead on how y'all interact with them.\n\nHonestly you messed up by having the kids so close together. Completely y'all's choice and on you to figure it out and get breaks from your kids. Your husband has repeatedly extended invitations for them to come visit. They've declined invitations for just visits so what makes you think they'll come for having to actually babysit?\n\nHire a sitter or put them in daycare to get your child free moments to decompress.", "Soft YWBTA. It’s simply a matter of different familial expectations that you don’t really know you have until they aren’t met. (Gottman, I think) \n\nFor example, this is totally normal for his family, he probably thinks you’re being weird or pushy about it (because he has expectations that he may not have thought about as well) \n\nIf your family were close by, they’d be helping out, and their help would feel helpful to you. It would probably feel totally natural for you to ask your mom to watch the kids for an afternoon and she’d be happy to do it if she here close.", "YWNBTA, but don't be surprised when his parents tell you that they don't want to be free childcare for you.  They have raised their children, they may not want to raise yours.", "YTA. Put them in daycare.", "Of course YTA", "Never hurts to ask for help but don’t be surprised or hurt if they say no. It appears they may not be super interested in hands on help with the kids. If your husband isn’t comfortable asking for help, then maybe it’s easier if it comes from you. \n\nHiring a babysitter to help while you get other things done at home or so you can go to the store alone or go with you to take the kids to the park helps! We did a lot of divide & conquer with our kids. Grocery shopping at night was my favorite solo activity. Thankfully we also have a big family & amazing friends & neighbors. Sometimes you just need to wave the white flag & call in reinforcements.\n\nHaving 4 under 4 (now 25,25,27,29) I truly understand & empathize with your struggles right now. It does get easier ... I promise!\n\nYWNBTA", "YTA. I don’t know why your IL’s moved closer if they don’t really want more time with the grandchildren, but, in any case, they don’t owe you help. It would be wonderful if they offered, but you’re not entitled to it.\n\nI have a good friend whose 2 oldest kids are 15 months apart. She had mother’s helpers from the local university when they were very little specifically so she could either get something else done or have more 1:1 time with each kid. If you can afford it, I’d suggest that instead of wasting energy angsting over your IL’s lack of interest in helping.", "Hmm I think it depends on how good your relationship is with your in laws. I think you would be NTA for asking as long as you’re polite about it and not demanding. but also be prepared for their honest response whatever that is. good luck!", "I'll get down voted probs but nta. \n\nIt doesn't seem like you're asking for them to move in and take over raising your children. Just some help during this early, really difficult phase. This is a really hard age gap in the beginning and you for sure should ask your support network for help. \n\nBut don't expect it. Definitely find and hire a good reliable sitter. Don't wait!", "Just to give you a break here:  I do think it would be okay to call them and have an open and frank discussion with them about needing help.  That’s okay.  \n\nWhat’s not okay is to lure them there under the pretense of a “visit” when you really want help.\n\nThere’s nothing wrong with asking for help when you are struggling.  And I think right now you need to be upfront with them about it, and give them the opportunity to choose if they want to offer help. \n\nSo I’m going with NTA (yet.)", "Those are absentee grandparents. In other words, they will say the right words, but not do what they say. If you say anything you will either be ignored or complained about and badmouthed. Both my and my husbands parents are this way, and both are boomers pretending to relive their childhood. Nothing will change. \nYta if you talk to them. It will cause more harm than good for your children.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy husband (32M) and I (34F) have two children ages almost 2 (21 months) and 4 months. Naturally, this is a difficult and challenging season of our life. Any parent would understand that we are surviving, not necessarily thriving. \n\nMy in laws sold their home 3.5 hours away and purchased a home 1.5 hours away under the veil of being closer to us to be more actively involved grandparents to our 2 children. Since they have moved, we do not see them any more than we did when they lived 3.5 hours away. This breaks my husbands heart. \n\nI encourage him to ask them directly to come visit, to come over XYX days we are free, and encourage him to setup a plan with them so they know we are wanting some help. \n\nTwo under two has certainly been taxing, and especially the last few weeks (toddler tantrums 🙃). I have asked my husband to be more direct and tell his parents we need some help and a break. He instead takes the passive approach of saying ‘if you’re free and wanna come visit we’d love to see you!’ Instead of a direct ‘WE NEED HELP, can you come over?’ \n\nThe In Laws have not taken him up on his offers  to come visit. My husband is of the opinion that ‘if they wanted to come see their grandkids, they would’ so he will not beg or nag… which I don’t disagree with. However, we are all at the end of our ropes and some extra hands to help with the baby and entertain the toddler would be really wonderful. \n\nWIBTA if I spoke to my in laws directly about us wanting their help more? \n\n——\nAdditional context: we have both had several mental breakdowns in the last few weeks from over stress, frustration, and exhaustion. My family lives 1500 miles away. We could hire a sitter, or a doula. But this is enmeshed with my husbands desire for his parents to be more actively involved in our kids lives.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA if you would just ask. Asking is nearly always okay, but don't EXPECT them to do it.\n\nYour husband on the other side need to get hos shot together. He doesn't want to ask his parents for help, bit he also doesn't let you hire a nanny? Set an ultimatum. He has X days to ask for help, if he doesn't do it by then, you are allowed to get a nanny without him, if he doesn't want to be involved in it.", "Me and my husband have 5 kids ages 5 - 12 we do it alone you'll survive, your husband is correct in thinking if they wanted to they would.", "Could you FaceTime with your in laws so they can get to know your babies?   \nDo you think that they would be good sources of advice, and good people to talk to about feeling overwhelmed? \n\nYou’re NTA for acknowledging that you need some help and support. You referred to mental breakdowns so that sounds serious.  Are you getting enough sleep? \n\nYou could find a baby and mothers group to meet other mothers. Also, you could take the little ones to the park to meet other kids and parents.\n\nBest wishes to you.", "YTA - asking your in-laws to come and give you a break does not address the underlying problem. You two need to regroup. If you are overwhelmed, then start thinking how to address this - and asking his parents who live 1.5 hours away is not an option. \n\nIf you really would like them to visit then ask, but this is completely separate from needing help. Your husband is resistant to getting a sitter because he wants his parents to help? You both know this isn’t realistic. \n\nCheck in with neighbors or parent groups about reliable local sitters. Schedule them regularly (maybe one afternoon a week) to give you a moment to get other things done. absolutely get a sitter for an evening or afternoon so you and your husband can spend together.", "Eh WTH! they have no obligation to look after your kids and you are acting as if you are the first couple to ever raise a couple of kids. I have 3, I’ve never had help. My family live overseas and his family an hour and a half away which isn’t exactly close enough to pop in whenever. We also work full time and all of that was our choice, no one else’s!!! Mayb your exhausting to be around if you are as demanding and entitled as you sound!", "YWBTA.\nI know when I was a kid, my grandparents opinion that they had only just had their youngest leave the nest and did not want to be looking after us kids on a schedule. This changed over time and our younger cousins got a lot more time with our grandparents then we did but now I'm older, I underway they needed a while to catch their breath after raising their own 4 kids (without assistance).\n\nHire the babysitter/doula, hire a gardener to do the mowing or a cleaner to clean the house once a week.\nYou and your husband will be feeling better with less workload and either of your parents will be able to spend time with your whole family anytime they want to visit with no jobs to do.", "Nta - ask for help. I never did and my now almost adult kids have very little relationship with their grandparents because they just didn’t care for them or get close to them.\n\nI don’t know why people are saying otherwise. Yes they have no obligation to help out but I think people have forgotten what family is supposed to be.", "I think it would all depend on how you ask and how you respond IF you get a no, honestly. Like if you desperately need a break as it sounds you do (I get you, my eldest was like 19 months when her sister was born) then asking politely for some assistance for a few hours one day isn’t too big a deal but you need to phrase it in a way that is clear they can say no, then accept the answer if it is a no, regardless of why. At the end of the day you aren’t entitled to their help BUT they also aren’t mind readers and if you need help you need to ask.", "I think it’s ok to let people know you need help - if they don’t follow through at least you know you have to get help elsewhere. It seems like your husband is resisting asking outright.  Does he know more than he is telling you.   If that is just how his family talks, I think it is ok to let them know you are struggling.    I know if my son was in need I would rather know.   NTA.", "Thank you for validating that. I think you’re right. Hiring someone may just be the easiest path overall and absolves anyone from resentment.", "> it sounds like you expect or demand help so YTA.\n\nThis!", "Awh, yeah I can understand the desperation of needing help as coming off as demanding. That’s a fair assessment! Thank you! We certainly are not demanding but definitely at a point of being desperate for a little relief some days…", "Why do people with ‘two under two’ think they are heroes we owe our time to? It’s maths. YTA", "I don’t really disagree with what you’re saying, but I don’t think OP asking for the in laws help has to *necessarily* come from entitlement. It all depends on the delivery.", "Oh they certainly are my responsibility. I’m bummed that openly asking for a break or needing some help is seen so negatively but i think that helps me understand their perspective alot more. Thank you for validating that I think this may be an asshole move !", "OHHH that is solid perspective. I didn’t even think about that. Thank you!!! I’m glad I asked!", "Oh! Thank you. This is great feedback. Maybe there is some other issue to unearth. It felt uncomfortable for me to intervene so I thank you for validating my gut feeling that this would be the AH move !", "That is true!!! I didn’t really think about the drive for them being a lot once a month but everyone feels differently about that. Thank you!!\n\nI don’t understand why asking for help once or twice a month means I am looking for someone to raise my kids LOL that seems to be a common theme with a number of these comments!", ">Yes, parenting is very hard and taxing with two young ones.  Other parents out there are sure to sympathize with you.  But that can’t come as a shock or surprise.\n\nThis is the part that gets to me. They made the choice to have more than one child. Everyone talks about how hard it is to be a parent. How you get no sleep and it's stressful. So OP and her husband are drowning now because of the choice they made to have more than one child. How and why should that be anyone else responsibility to help them out. It would be great for OP if her in laws offered help but her post comes across as her expecting them to help simply because they are the grandparents. Fun fact grandparents have raised their kids. They have done their time. It's not on them to help OP and her husband raise the two kids they chose to have so close together in age.", "Awh! No, we did not ever ask or suggest them to move. They did it on their own decision! \n\nParenting is tough. We totally signed up for it! You’re totally right it’s just a deflection of our frustrations…. Thank you for that insight!", "I love that idea! No, I have never posted. This is my first time and I truly regret it sitting here in tears at the shame I feel for being overwhelmed by my kiddos who I love dearly. Maybe it’s PPD.  I agree with resetting expectations. Thank you for your feedback!", "Thank you!! Yes, it felt very AH like so I’m really glad I asked before I did anything. Thanks for validating my gut that I should stay in my lane.", "This is great feedback !! Thank you!!! I appreciate it. I love the ‘don’t wait around for help to volunteer itself’ that’s gold advice!!!", "I like this idea of OP mentioning they are stressed and overwhelmed, if this can be done without seeming to hint or pressure the in-laws. Then they can decide whether to offer help.", "Thanks, this is really great feedback. I really feel uncomfortable getting in the middle so thank you for validating that this would be an asshole move!", "Thank you!!! I just need to let it go!", "Our relationship is very good!!! And maybe this is what I’m getting at…. I’m not sure his parents really know that he could use some extra support!", "Oh! It seems like you didn’t read my full post.\n\nWe aren’t looking for childcare. We not looking for someone to raise our kids. And they haven’t even came to visit on any of these occasions to know what it would (or wouldn’t). \n\nThere are tons of things in life people think they can handle going into it. Most days I feel like a champ! Some days, I feel overwhelmed. I think we can all relate to that. \n\nI hope we all try to be more kind to parents when they have a hard day. We all have hard days, not just parents. But it seems like parents aren’t allowed them.", "I love the way you laid this out. Thank you! I am feeling acceptance creeping in with every comment haha!", "Awh! I’m sorry it came across like I was asking them to raise my kids. Certainty not my intent! We are just asking for them to come over so we can have an additional 4 hands to help once in a while. Now I’m bummed my post came across that way …. Sigh", "You are so sweet and going to make me cry! \n\nI feel so much shame from this post for having some struggles. I feel shame for thinking that waving the white flag was an OK thing to do but I’m starting to regret doing so. Thank you for seeing me. I love the idea of hiring someone to come with us places. An extra set of hands is so invaluable and I guess we had hoped that would be filled by family but i like your assessment that they may not be interested in being hands on with the kids… that’s a great observation. Thank you again", "Thank you for the constructive feedback!! We’re also a little confused why they moved closer if they didn’t want more time. Maybe that is what shifted our expectations a little. We had been told for 6+ months before the move how excited they were to be closer and how they were doing it to be in our kids lives more. Maybe that’s where things went sideways with everyone’s intentions! Thank you for your time\n\nEdit: spelling", "Thank you!! We do have a really good relationship. I appreciate it!", "Thank you for seeing me and our hearts. I think I am definitely going to get a sitter lined up asap!", "THIS! I love this. Yes. That is a great distinction in the communication and expectations. Thank you for this observation and feedback!", "I had 2 under 2 with minimal help from family. I get you, it is so hard not to feel frustrated at the lack of help but it is not their responsibility so I'm afraid I agree with others that the husbands approach is right. \n\nIt gets easier in a lot of ways. I promise! Mine are 4 and 2 now. When baby is napping, prioritise your eldest. Wear baby in a carrier when you go out so you can be more hands on with a tantrumming toddler. Good luck, I have every faith in you and your husband. You've got this! Message me if you need to chat.", "If your husband wanted to, he would. If his parents wanted to help, they would. You can want more help but you can’t go behind his back. Why can’t your family help for a short break, or don’t you feel able to ask? If not that kind of tells you something", ">i'm bummed that openly asking for a break or needing some help is seen so negatively \n\noh please. stop with the \"woe is me.\" no one is saying you needing a break is bad. your attitude of \"we need help, come give it to us\" is what makes you an asshole. if you need help, hire it.", "It's not the \"needing help\" part that makes you sound like an AH. It's more the tone in which you wrote the post, I think. It seems like you want to have your in-laws visit so you can tackle chores, etc. \n\nI get how tired you must be. That said, I suggest you just hire help - that way, no one's feelings get hurt. \n\nYour husband can talk to his parents when he's in a better state of mind. And I think his approach is way better because he's not obligating his parents to visit or help; he's just keeping the door open. \n\nI wish you all the best, OP. 💗", "I suspect a lot of that is coming from people who don't have kids, don't like kids, and wouldn't want to help. It's completely normal for parents of small children to ask their families for some help and most grandparents actively want to help. You're not an asshole for wanting help, but they're your husband's parents so I'd let him decide how to handle it.", "Completely fair! We did make the choice. You are right in that. I guess everything points to that we should just ride the rough waters for now and let it be! Thank you for validating my gut feeling that this would be an AH move.", "I assumed this was the case.  As the days/weeks/months grow long, only natural to need to vent somewhere.  To be fair, hitting up reddit to complain is probably the best option of all as you still get that release but don’t directly dump on the grandparents.  Good on ya for not attacking anyone IRL put of sleep deprivation! Good luck out there <3", "Yes, focus on you, your partner and your family unit.\n\nOrganise paid care and enjoy each other's company.\n\nGood luck, parenting is hard.", "Please don’t feel shame! It’s so hard to be a parent to a young child, let alone two. It doesn’t mean you don’t love them or don’t value your time with them. It’s just mentally and physically exhausting at the same time.\n\nI don’t know what’s up with your in laws but I will say that even if they did come babysit, having family babysit can often be more complicated than it seems if the relationship there is already strained in some way. It actually might be to your benefit to hire someone even if your in-laws were willing to help, because it’s easier to set clear boundaries and get an actual break. Boundary setting is huge if you’re trying to protect your mental health.\n\nAnd - if you suspect you might have PPD, have you talked to anyone about it? I had terrible PPA and getting help was life saving. I hope you have someone trusted you can ask for help - a doctor, therapist, etc.\n\nPlease don’t let a bunch of internet strangers psych you out. You love your kids. You need a break. Both can be true. I hope you find the childcare you need to have some breathing room. And this too shall pass - like someone else said, as they get older, it’ll get easier! ❤️", "Great feedback!", "If it’s to the point that you are both having mental health struggles I’d 100% tell them what’s going on and ask if they are able to help out on a schedule for a couple months while you find a suitable nanny. You are still at risk for PPD, do not suffer in silence!", "Take care of yourself & never be shy or ashamed to ask for help. They’re your kids 24/7. You’re not trying to give them away you just need an extra set of hands to help & to take a break occasionally. Parents are no use to their kids if they are totally burnt out. \n\nAlso, your kids can never have too many people in their lives who love & care for them.... so the more the merrier for everyone! \n\nWish you all the best!", "I'm so surprised by the responses here. I remember how hard I found those early days so please don't let the Internet make you feel like a bad person for looking for a lifeline. I wouldnt recommend going around your husband but maybe encourage him to tell his parents how you are feeling and that you would really welcome some support. I know my in laws were always cautious not to step on my toes as a new mum so they might be holding off because they don't want to imposition you, by staying or being in your space. Best to make it really clear.", "I agree NTA. They could be giving you some “space” to settle in with your youngest, or having issues with driving etc but they clearly don’t understand that you have been struggling because your husband hasn’t told them. \nIf they won’t come to visit you then go to them. This worked pretty well with my in laws, the journey was horrible but having two extra pairs of eyes to watch the eldest and someone else to engage with them was helpful. And, get a babysitter or swap time off with your husband so you can do something on your own occasionally even if it just going to the supermarket.", "I hope you give it a try.  It may work out well for everyone.", "You are so so sweet! Thank you for these tips. I will try some of them for sure. \n\nCan’t wait for our kids to be 4 and 2!!!!", "It’s not about ‘not having or liking kids’, it’s that she’d be going behind her partner’s back. They clearly don’t want to help, or they would. It’s natural to want help, but it isn’t coming. If you can afford help, it’s just churlish to expect his parents to come instead when they won’t.", "Thank you for your feedback! It sounds like a part time nanny or sitter is going to be the best option for us.", "Thank you! Yes, the little one is only 4 months. Thank you for your feedback! We will totally look into a part time nanny!", "It's the best! My eldest calls his brother his best friend. Sure they fight sometimes, but they genuinely get on so well 80% of the time. We're starting to get out of toddler boot camp, and I feel more sane now 😅", "Nta, they are your family too and it is ok to ask for help. It is also ok for them to say no.", "I think it depends on your relationship with your in laws. I know this is in the context of patently, but it ultimately seems like a communication/family culture issue more than anything else.\n\nMy husbands family is also not super direct and their communication style seems similar to how you describe your husbands family. My MIL went away and wanted to ask if my FIL could come to my house for dinner after dropping her at the airport, and it was 5 minutes until I understood what she was asking me. A few days later a similar thing happened with my FIL until he finally said \"I am actually asking if you could make the birthday cake\". \n\nOn the other hand, I have asked for things directly (can I take these lemons home?/can you help us move house this day?/can you drop that thing off tomorrow?) To varying degrees of success. Now I just ask my husband if I can ask something directly or if there is a better way, since I just don't know their communication and family culture intuitively.  For example, some things are better coming from him because their son and some things are better coming from me because of how they perceive gender roles. \n\nSo I think if you ask your husband whether you can ask directly first, you're NTA. That goes for anything, not just parenting stuff. \n\nP.s. I don't think you are entitled asking your family for help with your kids. That seems like a very normal thing to ask for help with. It would only be wrong to demand it.", "YTA.\n\nYou chose to have kids. Raising them is your responsibility.", "Nta, they are your family too and it is ok to ask for help. It is also on for them to say no.", "NTA, it's upsetting, but I wouldn't do it. \n\nIt's not your battle to fight, it's your husband's. It will not go down well coming from you, and I call BS on them moving 90 minutes away to \"help\". If they had moved 5 minutes down the road, of course. 90 minutes, nonsense. Maybe your husband knows it and is processing the fact his parents don't care. It's a hard one to swallow.\n\nYou have two separate problems. Tackle one at the time. What I would do is ask a good friend or hire a babysitter and get some much needed respite. Or a cleaner. Or both, just for a month or two. Money might be tight but your mental health is more important than savings right now for a few weeks. \n\nTHEN when you're in a better place mentally and more rested, invite the in laws over and casually say \"Don't worry, we're not asking you to be free babysitters, we've hired/asked someone to help us with that already as we understand that's not something you want to do\". They can't really argue that fact, and if they don't take that hint you can put this to bed. \n\nYour husband (and yourself to a degree) are mourning for the idea of involved grandparents and some practical help (that they created when they said they wanted to move closer). If you intervene, you'll be calling them out on it, and they'll almost certainly react negatively.", "NTA. \n\nBut I suggest you start by asking them over for a weekend afternoon + dinner, or something. Don't start this conversation by framing it as a long-term comittment. Ask for a few hours. Thank them and stress how much this has helped you. Next time, ask for a few hours again. If all goes well, they will soon realise how important those hours of help means, and start offering more.\n\nThis sounds like your husband doesn't want to ask, because he doesn't want to come across as demanding. And his parents dont want to \"invite themselves\" for fear of intruding. \n\nMaybe they are even waiting for an invitation? \"Can you come this Saturday at 2?\" is perhaps what they need to hear? \n\nI know my inlaws were like this, very careful not to make me feel intruded upon. They really, really wanted to come over but they wanted us to initiate it.", "YTA. You chose to have these kids so close together, it is not up to anyone else to come and give you a break. Your in-laws have already done their parenting. Many, many, parents have gone before you and survived, you will too.", "NTA for asking but accept their answer whatever it may be. \nYou’re struggling - asking for help isn’t wrong whatever people on here seem to think. Maybe your in laws don’t realise because of how it’s been worded to them before. Nothing wrong with “hey would you be free on x day to give us a hand with xyz” (be specific).  If they say no then you know where you stand and that’s fine. \n\nIt does sound like you might need to look in to more regular help like a day or two of daycare for the older one just to give you a break", "Why have kids if your stressed and unable to care for them? It’s not your in-laws responsibilities to take care of your kids. Hope you got your tubes tied.", "You wouldn't be an AH for asking.\n\nI am not surprised by the responses you're getting seeing how most of reddit is childless.\n\nI would just ask them more directly and be ok with them saying no if they don't want to or can't. I also would look into a nanny and care for your kids if you can afford it. Baby sitters in your neighborhood can be a great option too!", "NAH. Am so sorry that you are having a hard time, OP. All the very best wishes.", "NTA youre free to ask and they're free to say no.", "YWNBTA I’m shocked people think you would be. Good luck with your kids!", "I can see from your other comments that you want some help and a break, which is perfectly understandable.\n\nBut your tone in this comes across as entitled - they moved closer under the veil of wanting to be near the kids etc. I think that's what some commenters are finding off putting. \n\nI think telling your in-laws you are overwhelmed and could do with some help is absolutely fine. I accept that your husband's way of wording it does not explain that you need help. But I think you need to word it very carefully and be clear you are not expecting anything and won't hold it against them if they choose not to help. \n\nAt the moment, it feels like you and your husband are not being open that you're struggling and are expecting the in laws to take the hint, and are resentful that they are not. \n\nNAH provided you accept it if they choose not to help.", "Several mental breakdowns? This isn’t normal. Please get professional help.", "YWBTA, both because I think each member of a couple gets to handle their own parents and because these folks have made it obvious they aren't willing to get more involved with your kids. If they won't even come over just to hang with them, they aren't going to help around the house or do anything more intensive. I don't think you're an AH at all for needing or wanting help, but realistically, you'll need to go somewhere else for it.", "The fact that they want to SEE their grandkids more does not mean they want to babysit or help you.  It’s nice if they offer but clearly they do not want to. \n\nHire a babysitter or mommy’s helper. The grandparents want to see the kids on their own terms. They don’t owe you their time so stop trying to force the issue. YTA. Having two kids under 2 is a choice you made and yeah, it’s pretty rough.\n\nAnd stop overlooking the fact that they don’t live next door, it’s still a 1.5 hour trip to drive to your house, which is 3 hours round trip.  That’s a huge ask to haul themselves to your house to help watch your kids.", "YTA. You chose to have two kids back to back. And now you’re overwhelmed, so you tell the grandparents to come over and spend time with them, but only so you can have a break. That’s a babysitter. \nYou want them to babysit, but you won’t be honest about it with them. If you’re that overwhelmed, hiring someone might be the best solution.", "\"My husband is of the opinion that ‘if they wanted to come see their grandkids, they would\" - and he's right. They don't want to. The grandchildren are either not a priority to them or they have the feeling they would have to provide childcare and don't want to.\n\nIt is a hard stage in child raising but it doesn't last forever. I would hire a sitter and take some time for yourselves if you are struggling.", "YTA. You would be for asking them to help more. You decided to have 2 children that close of age, not them. However, you wouldn’t be the AH for asking why they don’t want to come over more often. Expressing a desire to spend time with them is way nicer than the desire to have their help. It will make them feel appreciated more and will most likely end in help too", "YWNBTA if you spoke to them. This hits me hard, as I 39M am in a similar situation. Here is what I can tell you thats been a benefit to me. My Inlaws have a fractured relationship with my SIL/BIL. They live 5 states away. I call my MIL and SFIL periodically and talk to them, and tell them how much we would love for them to visit. I go out of my way so they know their presence is wanted — and its worked. My MIL has flown out this year and I showed my gratitude for the visit. \n\nIf you are worried it would be taken the wrong way, do it under the guise that you would love them out Friday/Saturday night so you can take your husband on a date. While they are present, tell them how you would love for them to visit more, or ask them if it would be possible to make this a regular thing. Having your spouse mad at you for a day is worth getting your kids some grandparent interaction and you a small break. Risk is low, reward potential is high.", "I think instead of asking for help I would just tell them that I am struggling and see if they offer to help. Have you tried that? They might have no idea how much you are struggling and maybe they would be happy to help.", "YTA, if you're at the point of nervous breakdowns hire some help. You went them to drive 3 hours round trip to help feed a child, that's ridiculous.", "You’re gonna get torn apart on here… also a mom, also have in laws that couldn’t care less. I’d honestly suggest you and your husband come to terms with the fact they don’t care and not even you directly asking for help will change that. You WNBTA but expect them to say no or (my personal fav) completely agree to plans and cancel last minute", "YWBTA but only because you’re going behind your husbands back and he clearly doesn’t want to and thinks the method he uses is okay but also just want to say you’re not the ahole because you want help, some of these comments are WILD, like i get my parents to help with my puppy when i’m overwhelmed and that’s… a puppy… i hope everything works out for you guys and the tantrums stop soon!! xo", "Two people raising two small children is certainly stressful for anyone. But, it’s hardly heroic. My parents raised 5 kids (with an age gap of 12 years from the youngest to oldest) without any outside help and we’re all doing fine. You didn’t mention any incredibly taxing or stressful careers in addition to the two kids. . If you are serious about having had breakdowns with the modest responsibilities that you have, you should seriously consider getting some mental/emotional support. Something’s not right.", "YWBTA \n\nLiterally just saw a post yesterday on FB of a couple looking for someone to sit in the gym and just monitor their brand new LO so the parents could work out together. I kinda scoffed like who would actually sign up but surprisingly there was like 10 comments from people willing to get paid to sit with a baby for 1-2 hours in a gym 3x a week.  If you have the resources to hire help do so. There are tons of certified sitters/resources. Instead of grocery shopping? Order for pickup/delivery. Hire a mother's helper to distract toddler 1, while you are taking care of baby 2. Hire a house cleaner 1x a week -basically make a list of everything that needs to be done to manage your life and then figure out a way to take all the things off your plate that it's required that you PERSONALLY do, and then slowly add them back in as you can. \n\nYour inlaws have their own life and put in their time raising their kids you are not entitled to help just because you decided to have 2 kids under 2. That was your choice not theirs. \n\nNow would it be nice? Sure. I see My cousin and her husband work full time and their parents take the 2 soon to be 3 kids 2x-4x a week while they are at work but it's very clearly because it's what both sides of grandparents want - they are choosing that lifestyle and changed their schedule to do that.  My husband and I, on the other hand  are not counting on this kind of assistance we will have to hire help - his dad is on the older side my parents are 2 hours away.", "YTA. Why did you have these kids?!", "YTA, and I am saying this as someone who has kids with the same exact age difference as yours. Does it suck? Absolutely, and it’s not going to let up for years. I understand that you and your spouse are overwhelmed, but it is on you and no one else to figure out how to resolve the issue. Your husband’s parents obviously don’t want to raise your kids and being direct is only going to cause more conflict. Leave them alone and hire help.", "NTA. Contrary to comments, I don’t think you’re being irrational. My immediate family (actually extended also, and friends) were popping by round the clock, without being asked. As they say, it takes a village.", "Sounds like already dropped the hints. Grandparents want to spoil and pamper the kids, not deal with the meltdowns.\n\nYTA. They're YOUR kids, pay an actual babysitter", "Hire a sitter and get couples counseling.", "YTA You fucked around and found out - how difficult it is having kids. Your parents owe you nothing - they should be enjoying their retirement and spilling your kids on their own terms", "NTA\nYour in laws aren’t mind readers. Passively asking your parents to come over isn’t an invitation to come over. What if they feel like they are overstepping? I feel like it doesn’t hurt to ask them directly for help. As someone with parents who would love nothing more in the world then for me to give them grandbabies to fuss over, I don’t understand why everyone is saying you would be the AH. I wouldn’t go behind his back but maybe try talking to him again or just flat out tell him you’ll speak with them. They’re his parents yes but they’re yours too now. Having kids is hard. Maybe it’s just my Spanish culture, but having kids is a village type deal. They put to much pressure on parents to do it alone in the US.", "NTA. It a really dumb aproach to expect others to know you need help and offer it by themself. All of us have our own issue in life so we might not pay as much attention to other peoples issues as they like. You can be hurt and disapointed by that or you can clear up communication and ask for help.\n\nAnd proposing a \"holiday/visit\", when you need a babysitter is just plain wrong in so many ways. It's false advertising. Are they supposed to be thankfull, for beeing given the chance to help you??\n\nThey are no clairvoyant. They don't know how much help is needed. What's good and what would be overstepping bounderies (because let's be honest here, there a many complains about over bearing in laws here, too.) \n\nYour husband either don't want to asked because he \n\n- is afraid of rejection and that they wouldn't help even if he asks, \n\n- that they expect him to be thankfull, if they do (that can be tiring) or \n\n- he is just expecting it as a \"prove of love\", prefering it never to happen before doing something to make it happen himself. \n\nProbably best to clear with him first, why he is not communicating better with his folks.", "Putting the positive glasses on and saying NAH here.\n\nWhat about inviting them over to spend a day? Don’t make it about them helping you, but just spend the day. \n\nMaybe they don’t want to impose, and it’s easier to come if you invite to a specific time. Not everyone is comfortable with ‘come whenever’. \n\nYou need to build a relationship with them as child help, and my guess is that’s easier if you have a relaxed conversation and an established relationship. \n\nDo this without pressuring them and they might be of great help in the future! (If you desperately need help NOW, hire someone if that’s possible)", "[deleted]", "NTA because I think you are crying out for missed opportunith for relationship and less on entitlement. \n\nI think though, instead of asking for help, mention how hubby and the kids have been asking for them. Mention that they miss them and you normally wouldn't say anything but as hubby has been missing them, you think it would be a nice surprise to have them over one Saturday.\n\nAlso people are being extra harsh, people with kids need help. As the grandparents have at this moment shown how they want to enjoy their twilight years, don't rely on them. Instead, ask your friends for help. Ask your community and also get a babysittter. In an ideal world, his parents would be there etc but at this moment, they aren't. Instead of lamenting over they not being there and you both have mental breakdowns, look around at what you have and see what you can do. Even if you have to temporarily hire a cleaner so you are more present, do it. Your sanity is crying out, so please get the necessary help. Your kids need you both.", "Sheesh, some of the responses you've gotten so far have been so harsh and unnecessarily mean! Yes, you chose to have children, but nothing really truly prepares you for what an unrelenting task it is. You are definitely not TA for wanting or needing help. You are also not TA for expecting your ILs to help out or come visit, when THEY explicitly said that's why they were moving closer.\n\nYWBTA (although I think AH is a little strong in this instance) if you talked to them about it without your husband. His parents = his decision on how to deal with them, so I feel like you would be overstepping.\n\nIt's sad they don't want to be more involved. Kids are only little for such a short amount of time, and it sounds like they're missing out on a lot. Having said that, little kids can also be exhausting for grandparents to handle too... perhaps they may be more involved when the kids are a little older and they don't need to be as physically active with them.", "NTA. This sub is notoriously anti-kids so I’m sure you get lots of Y T A’s because of that, but I don’t think anyone should be discouraged from asking for help. If my children were struggling, I would want to know.. if *anyone* I loved was struggling I’d want to know how I could help, but *especially* if it were one of my children. \n\nReach out.", "Hire someone to help. The grandparents have no obligation to help and obviously don't want to - at least for now. Even though they moved closer, 1.5 hours of driving each way is a lot and perhaps more than they thought it would be when they moved. Maybe invite them for a weekend so they can settle in a little and not have 3 hours of driving in one day. They can enjoy time with you and the children and, hopefully lend a hand here and there. My mom had 4 kids under 5 with no help during the day. I have no idea how she did it and stayed sane. She did have a great figure from all that running after us, though.", "YTA Your husband is right, if they wanted to come see the kids they would. He has opened the door to have them visit and they won’t. You need to hire a babysitter and have some date nights. Or what we call in the south “a mother’s helper” Usually a 13-15 year old who hangs out in the house while the mom is still home to do exactly what you are wanting the grand parents to do. Play with the kids while you get chores done .", "Yes. YWBTA.\n\nYour husband needs to be in charge of that relationship.\n\nHowever, this does not stop you from making your needs known through other means. You could randomly post on IG or FB that X or Y has happened as these things happen. If you do this as a random request for help in certain situations, then you may find that your family, friends and neighbors may have solutions that have never occurred to you.", "NTA for asking directly once or twice. It’s perfectly fine to reach out for help.\n\nYou’d only step into arsehole territory if they said no and you kept asking.", "I don't get the YTA parts. Just be honest with them, hey mil, fil, we're having a bit of a rough time ( which is normal ) would you mind watching our 2 kids for 2 hours next weekend so we can destress a bit?\n\nNot telling people you are struggling is why they think everything is fine and you do not need help and that's why so many parents 'drown' and have mental breaks. \n\nWould it be nice to have the babysitting offered without having to ask? Sure, but not everyone wants to ask directly if they can watch your kids.\n\nMy aunt who is a sort off grandma pretty much dropped a 'let the eldest stay for an afternoon or a sleepover' on us when we wanted to know what she wanted for her birthday, which is after us carrying all the load for nearly 2 years.", "You chose to have children that close in age, you get to take on all the responsibilities.  His parents already raised their children, they aren’t there to raise their grandkids.  If they just moved, they are probably exhausted from the move and getting everything set up.  You do not tell other people that they need to come help you.  You ask them nicely.  If you don’t have a relationship with them, then don’t ask them.  Do you have any friends that can bring you dinner for a couple of days, like a short meal train?  Maybe get some help with something “unrelated” to the kids, like dinner or a house cleaner one a week.  Just those little things can help so much.  Then you won’t stress as much and your in laws can come enjoy time with the grandkids and you guys", "So against trend I’m going to say NTA but with many caveats. There’s nothing wrong with asking for help when you know you need it, but:\n\n1) you need to phrase it the right way, and have the right attitude. You’re in-laws are not actually obligated to help you with the kids. You could sit down and have a frank discussion, say that you’re both struggling and if they’re willing to help out for a little while - with a *fixed* time frame - then it would be appreciated. You can’t really say “we need help, come over now and do it”. You shouldn’t be guilting them into it\n\n2) you need to be willing to accept it with grace if they say no. Quite apart from them not being obligated, they’ve clearly had the opportunity to become more involved and have chosen not to, chances are they will choose not to again. Reacting aggressively or negatively will simply reinforce this already distant behaviour\n\n3) your husband needs to be in agreement before you go ahead with it. They’re *his* parents. His relationship with them is more complex and nuanced than yours. You’ve already said he’s upset about them not being more involved of their own choice. Read between the lines: it’s not just about not wanting to beg them into seeing your kid, he’s saying he shouldn’t have to beg them to have an on-going relationship with *him*. And he’s right, he shouldn’t have to do that. If you push despite his reticence then you are just one more person who hasn’t got his back in this situation.\n\nI don’t know your in-laws. You don’t know them as well as your husband does. There’s every chance that they’re the kind of people who wild demand gratitude beyond what your husband is willing to give for the sake of doing favours.", "Seems like a you problem mate. You knew what you were getting into with kids.\n\nYTA", "NTA, if my husband and I needed to go out (birthday, wedding etc) or one of our kids is sick and can't go to school/daycare (but we're both working) we ask the grandparents to help out. Luckily they live around the corner and adore their grandkids so it's no problem and we try to treat them to dinner, flowers etc every so often to say thanks. Asking for help now and again (obviously not a lot) is fine. Them saying no is also fine. I don't see the harm in asking in a nice way & not expecting too much especially as an hour and a half away is still quite far. The fact that they don't seem to want to visit though is a bit telling 😬.", "YWBTA. I think your husband is right, he already asked and they still haven’t come. While I don’t think it’s wrong to ask for help, this is something that has been asked a few times with no success, they clearly don’t want to, for some reason or another the answer as of now is still no. And TBH might be for the best, I personally wouldn’t want someone watching my kids when I already know that’s not something they want to do. I’m glad you’re in the position to hire a nanny, definitely do that.", "YTA you and your husband. His parents aren’t. 1.5 hours is still a long way to travel. A three hour round trip to work as a nanny for you is a big ask. They did their child rearing and while I agree some help would be nice, they are in no way obligated to do any of it.\n\nYou’d like a closer relationship, that’s understandable. You’d like more people pitching in with the kids you’ve brought into the world. Also understandable. You are not entitled to it however. \n\nYour failure to cope is not their problem to solve. You have to do that yourself. Put your foot down and hire help. Right now you are letting your husbands desire for a different relationship with his parents actively hurt your ability to care for your kids. He’s prioritising an imaginary relationship over his own kid’s needs. And you are letting him. That’s what makes you both assholes here. \n\nYou are both party to hurting your kids in the long run if you can’t cope. Just get outside help given you’ve suggested you can afford it.", "YWBTA if you asked, yes. I'm sorry but it doesn't seem like they want to be involved in that way, at the moment. \n\nI dont care if people have \"done it themselves\" it doesn't mean others should have to do it tough if there is help, but sadly, it doesn't appear that way with your in-laws.\n\nWhatever their reasons, I hope you and your husband are able to get through this and thrive. Hopefully your kids will want you around if they go on to have families.\n\nCongratulations on the new addition, and I love that you are mindful of spending time with your toddler.", "It would be more appealing to me. When my family are struggling I go straight over to help. That’s what families do. It might not be very appealing to go and sit in a chaotic house for a ‘social’ visit, but to have your child say they need support because they’re struggling? I don’t get the issue", "Since when is asking for help an asshole move?  The in laws probably aren’t aware of how difficult things are for op and partner if they never express it. Isn’t this why we have friends and family? To help each other?", "I think you could frame it as \"hey! Just wanted to reach out and ask if you guys have any free time / afternoon , and would like to take kids or older kid to beach/woods/playground no problem if you aren't available of course!\" It is no joke having children and , I personally love when people ask me to watch their kids,  it is a huge compliment. However, you WBTA if you were upset when they say no. \nI have been at that stage. It is hard. You need a village. If the village doesn't come , hire it ! \nI have no-one around me that will take the kids to allow me a break, so I have a nanny and a cleaner & work a part time job to pay for it", "Yes it's like they are doing the in laws a favour for offering to come and help them with the kids they chose to have.\n\nSorry OP but YTA", "Nobody helped you at all? Fantastic you were able to do that. Doesn’t make it wrong to need help sometimes, and reach out to family.", "I have the world's most dysfunctional in-laws, so this may just be a \"me\" thing, but I always let my husband deal with his family and stayed out of it. He understood their messed up dynamic and the history behind it.  My family has its own dysfunctions and its own history, so likewise, my family was my responsibility. \n\nMy advice would be that your husband knows how to speak to his parents. If he says it's a bad idea, listen to him.", "This is maybe not the right sub for this topic. People here will always call parents the asshole, especially parents who feel “entitled” to ask for help. \n\nPerhaps try one of the parenting advice subs like r/beyondthebump. You’re not the first parents to go through this experience, and it’s good to see how others have coped (either successfully or unsuccessfully).\n\nIn case you need to hear it: you’re not an asshole for needing help. Don’t be afraid to ask for it. (But also don’t expect it and don’t get upset if someone says no)", "I guess I am coming from a single mum’s perspective but there are two of you. Why not take turns giving each other a break?  If the in-laws wanted to be there, they would be. I mean, NTA but you do have a husband to juggle the load with.", "My mother wants grandchildren so much I’ve joked to her that I’ll have to go into witness protection to keep her away from my baby 😂, my mother in law is active and always has been with her current grandchildren too, this I’m afraid are just two grandparents who simply don’t have the baby bug and may be far more interested in enjoying older life, child free. I can truly appreciate how shit it must feel for your husband but if they wanted to be there, they would although I find it a bit cringe they sold their house move on a lie about wanting to be closer to the kids, I mean why lie in the first place?\n\nEdit: I think you the worst case scenario you do let them know you could do with some help and that you’ve been struggling a little and they say no, so long as you accept that and leave it at that, I don’t think you’d be the asshole", "Also, they chose to have the kids so close together, why should anyone else care?", "🏆", "People cant take care of one kid and they decide to have a second one while the first one is still a toddler.🤦 and then they ask for help from parents under the guise of visiting who unless they have forced them to have kids, have no responsibility. You reap what you sow", "It's completely fine and understandable to want a break. I had my own kids with much larger age gaps because I knew I couldn't handle 2 under 2.\n\nHowever other people are not obligated to help. I do agree it's a bit weird your husband can't ask directly about them babysitting for a couple of hours if you are so overwhelmed. Asking is fine if you accept no for an answer. However, as it seems your PIL are not willing to help/your H is not willing to ask I'd hire a babysitter if possible. If not, take turns taking breaks?", "Sweets. Don't beat yourself up. This is HARD. Crazy hard. It's OK to feel overwhelmed. It's ok to wish your kids would just STFU. No one can blame you for seeking help. In fact, it's healthy to do that. \n\nYou've identified that you and your partner need a break. Sounds like this is a 'throw money at the problem' situation. Do it!", "OP, this sub is probably not the right place for most posters to empathise with you. The \"your kids your problems\" brigade is strong here. \n\nI was where you are when I had my second. And went to counselling for PPD, and after 5 sessions the lady said \"you don't have PPD, you are in need of a full night sleep, a brunch with your partner and a back massage\". Sleep deprivation and going from 1 to 2 was absolutely the toughest time in my life, but if you can hire help, absolutely do that. \n\nAnother thing, with hired help, you will get no judgement. No \"I didn't struggle when I had my kids\", no resentment, no comments on the state of your house, no huffing. Maybe invite them for the little one's 6 months as a mini \"half year\" celebration, or to the 2 years old's birthday. No pressure. And hire the rest out. \n\nThere is also the fact your children are super young and your in laws may be completely freaked out by the thought of being put in charge of under2s. My parents definitely were. I could step away for a shower, but absolutely not anything longer than that.", "No one at all my youngest was a month old when the father left and the pendamic and lock down happend ..\nYes i agree but it doesn't give her any right to expect the grandparents to take responsibility while they visit just because they live closer", "🙄 Oh please. Plenty of people read you full post, and came to the same conclusion. You chose to have children. Why is it anyone else's responsibility, to look after them? For free none the less... If you need a break, hire help. Of course parents are allowed to have hard days, but parents like you, sound extremely entitled. You're in-laws are not your free babysitters. You shouldn't expect help, which I feel is what you're doing. These are your children, your responsibility! Your 'oh, poor me' attitude, is not a good look.", "I did read your post.        \nYou obviously didn’t read my response.      \nI said that they probably don’t visit you because they know you want them to ‘help’ with the kids.          \nNobody said you can’t have a hard day.     \nWe are simply saying your hard day is your responsibility not you ILs", "I wonder if they already get the drift that the invites have all been for them to provide support, rather than genuine invitations to say come over for dinner etc as a family or to go somewhere together?\n\nI'm of the opinion, as a mother, that my child is my responsibility and that yes, you chose to have 2 under 2. You should have thought through the logistics long before dtd and conceiving!\n\nI do find it bizarre that you'd need so much additional support when there is clearly two involved parents tbh. Perhaps rather than immediately go to employing someone, maybe look at how and what it is that's the issue. Try reframing. Eg. Is the toddler napping - if so what do you do during that time? Can you coincide some of the meal times so that toddler is eating and baby can be fed at that time at the dinner table? Do you have a routine - not necessarily one that's restrictive, but am obvious pattern? Toddler can certainly be involved with housework etc.", "Let’s be honest, they moved 1.5 hours away.  They didn’t want to be more involved, they just wanted a shorter drive for when they were already planning on coming (say birthdays or Christmas).", "I think her question is more , she wants to let them know that they would like help. OH isn't communicating so she wants to discuss it with them? I think it is OK to be open with in laws here. They did move to come closer , maybe they don't want to intrude and are waiting for the invite OH isn't extending.", "Standing ovation.", "She’s doing the opposite of expecting, she wants to ask for help which seems totally reasonable if they moved closer to see them more", "Where is your grace? OP isn’t perfect, fine. They’ve not been rude or hectoring or mean, they’re just stressed out and asking if this would be appropriate. No “extreme entitlement”, but I guess something about parenting posts brings out all the misanthropic teens.", "I did specifically say that she should not go behind her parents' back, but I think there's a high proportion of people on this sub who can't imagine that ANYONE would want to help out with small children, and that's not been my experience.", "except he is? op literally states that he tells them “come over *if you want*.” op isn’t satisfied and rather he’d say “we need help *can you come over*.” while the statement includes “can,” that phrase is still a demand.", "You could also bite a cleaner a couple  times a week and that will take the pressure off and allow you to enjoy stress free time with your kids."]}