{"id": 18982, "submission_id": "140rnfs", "title": "AITA for refusing to let my parents put a tracker on my (28F) phone?", "selftext": "Context \nMy (28F) life has not turned out the way I wanted it to. I still live at home with my parents, who are extremely controlling. \n\nAll my friends have left the country and so I am on my own a lot. Most of my time is spent at home, at work or going on solo walks. I don't drink. I don't go to the gym or play sports anymore. I don't have hobbies outside the house. I haven't dated anyone for 7 years. All and all a very uninteresting life. My one solace is being outdoors in nature and walking. \n\nMy parents aren't happy with this. They think women should not go on walks by themselves as it is dangerous (in their words). I know it would be better to ease their concerns if I had someone to go on walks with but I don't. \n\nMy mum has been trying to get me to put \"Share My Location\" on my phone with her for years. I understand that she worries about my safety. However, the big problem for me is I know it is not just about my safety. She will use it to become my full time stalker. I know this because she has my Dad share his location with her and visa versa. She sits and stares at her screen all day and will say things like \"Oh your father has just left tennis\", \"Oh your father has just arrived at work\", \"Oh your father is leaving the pub\". Not that I have anything to hide, but it is the one boundary I have held on to and I have been so proud of myself for not caving. \n\nToday's Events \nToday I decided that I would take a trip up the coast and go for a walk along the sea. I told my parents about my plans (10:30am). My mum asked that I call her and keep in touch. Once I got there (2 pm), I called her and told her where I was. I also told her what walk and route I would be taking. I didn't tell her when I would be home (but she also didn't ask). I also didn't message to say I was on my way home. \n\nMy parents were furious when I arrived back (8pm). My dad told my that I no longer had a say and that it was mandatory for me to have a tracker on my phone. I told him that I had done everything asked of me: I had called, explained where I was going etc. I also said they could have called me if they were concerned about my whereabouts.\n\nSo as a result, I have been punished. The car that I drive is technically my dad's, and so he has taken the keys away. He says that I can buy my own car or grant him and my mum access to my tracking information.They said they would never do this to me, hold the fact they bought the car over my head. Also, it makes no sense for me to buy a new car now. I am at the final stage of a graduate recruitment process and if I am successful, I will be moving to London in September. However, I need to survive between now and then and without a car the little life I have is impossible.\n\nSo, AITA for refusing to let them put a tracker on my phone when their concern is my safety? Any thoughts would be greatly appreciated.", "created_utc": 1685915406, "permalink": "/r/AmItheAsshole/comments/140rnfs/aita_for_refusing_to_let_my_parents_put_a_tracker/", "score": 24, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > (1) I refused to let my parents put a tracker on my phone. \n(2) I may be the AITA because I didn't tell them when I would be home or inform them I was on my way home which made them worry (I was out of contact for 6 hours). The car is also technically not mine and so I don't have any right to drive it -  it is theirs to take away and I have no right to complain.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA, but your parents are toxic as hell. You may need to put up with this until you leave just so you can have some semblance of a life. Once you’re out, turn it off and consider going non-contact with them. It might feel awful, but it could very well be necessary", "NTA, but don't give into your asshole parents. Grit your teeth and wait it out. I'd go low contact once I was gone, too.", "NTA but your parents are huge AHs.  It may be necessary for you to aqueous until you move to London in September.  Once there you can turn off tracker.", "NTA this is a healthy boundary", "NTA! Edit to add:\n\nThis is not an advice sub so this post will probably be deleted.\n\nYour choices:\n\n1. Add the tracking app to your phone, then delete it when you go to school in the September.\n2. Don't add the tracker and have no access to the car.\n3. Buy your own car.\n4. Move in with a friend until you go to school in Sept.\n\nWhile your parents are being ridiculous, there is not else you can do if the car is in your dad's name.\n\nGood luck, I wish you the best.", "NTA.  If there is no other way around it, why not buy another phone and keep the one they're tracking at home most of the time?  Or buy your own car and tell them to get fucked.  \n\nAlso, if you hold out long enough they will probably give in.  They know your life revolves around your ability to travel and they wont keep that from you for long.", "NTA - you are MUCH too old for your parents to have that kind of control over your whereabouts.", "Hold firm. This is clearly not about safety, it's purely control. Move out as soon as you can and let them control each other. NTA.", "NTA. Can you use public transportation to go back and forth to work and school?", "If its a temporary measure, let them track your phone. Leave it at home or in your car, and buy a cheap spare phone.\n\nAlso, get out of their house ASAP. No one that obsessive and controlling is going to comfortable with you going to London.", "Move out", "NTA. You need to move immediately. Find someone to rent a room from.", "NTA. Install the tracker app, then leave it at home and get yourself a cheap burner to use until you move out.", "NTA. \"Absolutely not.\" Don't even discuss is anymore.", "NTA you are a grown adult.", "NTA\n\nYour parents are controlling, you need to find a way to leave asap", "NTA.  Grit your teeth and do what you have to do to get by until September.  You’re an adult and not their little child any longer.", "NTA. I’m not really sure why they’re losing their shit and insisting on a tracker when they could have just called you to see where you were. Maybe sell your phone and get a Samsung where it won’t work with “find my”?", "You would NBTA regardless of what you choose to do, regardless if it is to refuse to be tracked, accept it for now, use a burner phone, or any combination thereof. Do what you must do for your sanity. \n\nHowever, the day you leave I would drop that phone at the edge of the driveway and not give them any information about where you work or live. It wouldn't hurt to notify the police that you are alive and well so they won't waste their time when your parents file a missing person report. \n\nIf and when you choose to resume any contact, let them know exactly what behavior you require from them, and only if they respect your rules should you allow them to maintain any contact. Let them earn the privilege and put them in time out if they don't show you basic courtesy and respect.", "Pending an answer to request for info, ESH.\n\nYou, for being 28 years old, neglecting to build a life of your own and putting up with the controlling BS of your parents for the sake of convenience.\n\nThem, for permitting you to have no life or independence at the age of 28, for failing to guide you into self-sufficient adulthood, and for actively attempting to exceed your set boundaries.\n\nUltimately, you'll probably suck it up and accept the invasion of privacy in exchange for the convenience of continuing to live there. \n\nI'm just going to say that life is short, and time's a-wastin'; I would encourage you to start living it.", "NTA\n\nBut if you don’t want to deal with them tracking you, you will need to get out of their house and stop using their stuff.", "NTA But if your only choice is living with them and using that car for the next three months you don’t really have a choice. That’s their rule for living in their house and using the car. \nYes they are being crazy, but it is what it is. \nIs it dangerous where you live?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nContext \nMy (28F) life has not turned out the way I wanted it to. I still live at home with my parents, who are extremely controlling. \n\nAll my friends have left the country and so I am on my own a lot. Most of my time is spent at home, at work or going on solo walks. I don't drink. I don't go to the gym or play sports anymore. I don't have hobbies outside the house. I haven't dated anyone for 7 years. All and all a very uninteresting life. My one solace is being outdoors in nature and walking. \n\nMy parents aren't happy with this. They think women should not go on walks by themselves as it is dangerous (in their words). I know it would be better to ease their concerns if I had someone to go on walks with but I don't. \n\nMy mum has been trying to get me to put \"Share My Location\" on my phone with her for years. I understand that she worries about my safety. However, the big problem for me is I know it is not just about my safety. She will use it to become my full time stalker. I know this because she has my Dad share his location with her and visa versa. She sits and stares at her screen all day and will say things like \"Oh your father has just left tennis\", \"Oh your father has just arrived at work\", \"Oh your father is leaving the pub\". Not that I have anything to hide, but it is the one boundary I have held on to and I have been so proud of myself for not caving. \n\nToday's Events \nToday I decided that I would take a trip up the coast and go for a walk along the sea. I told my parents about my plans (10:30am). My mum asked that I call her and keep in touch. Once I got there (2 pm), I called her and told her where I was. I also told her what walk and route I would be taking. I didn't tell her when I would be home (but she also didn't ask). I also didn't message to say I was on my way home. \n\nMy parents were furious when I arrived back (8pm). My dad told my that I no longer had a say and that it was mandatory for me to have a tracker on my phone. I told him that I had done everything asked of me: I had called, explained where I was going etc. I also said they could have called me if they were concerned about my whereabouts.\n\nSo as a result, I have been punished. The car that I drive is technically my dad's, and so he has taken the keys away. He says that I can buy my own car or grant him and my mum access to my tracking information.They said they would never do this to me, hold the fact they bought the car over my head. Also, it makes no sense for me to buy a new car now. I am at the final stage of a graduate recruitment process and if I am successful, I will be moving to London in September. However, I need to survive between now and then and without a car the little life I have is impossible.\n\nSo I need advice Reddit. Do I let them track my phone so I have the car back or do I hold firm on my boundary? I really need help so any thoughts would be greatly appreciated.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "INFO: Do you contribute financially to the household, and if so, to what extent?", "NTA. Your parents are very controlling. As long as you live with them, they will act that way. You only have a few more months to go, so let them think you are giving in. Once you leave, fall back and go low contact. Make sure you get your own things. Do not depend on them for a car or money.", "NTA... If i hike out of traditional bounds i text someone where I am hiking.  Usually it's my husband. I also take my phone for emerg.  That should be enough.", "That really sucks, I’m sorry you’re dealing with this. I hate to say it, but the only solution right now may be using the tracker. Then once you’re able to leave to London - you’ll be done. You’ll be so far away they won’t be able to control you anymore. You can finally be free. \n\nLet them have their stupid power play, use their car, and then go no contact (if you wish). NTA. Wishing you the best.", "Do they know about London? If not, don't tell them. Let them track you now and break fully free when you go London. NTA and good luck", "Nta. But you realize you are living in an abusive environment right? You are almost 30 and they treat you like a 12 year old. I had to go back and read your age again. You really need to move out now", "exactly, at 28 this should not be happening and IMO if OP gives in, they'll always want to make demands of her, no matter what it is.", "Aqueous? Do you mean acquiesce? \n\nBut I do agree that OP may need to bite her tongue and put up with this for the next couple of months if she wants a car.", "Another choice, get the tracking app. Put the phone with the tracking app someplace safe-and believable- for a few hours of untracked freedom. Carry a cheap burner phone for safety.", "Yes I can but the public transport system here is not very good. My work is a 10 minute drive away but via public transport it would take me an hour. I do work from home most days though so that is something. I could also go to parks that are within walking distance for some outdoors.", "I think you might be right which breaks my soul. It is not a dangerous place to live but they always cite global news stories of women being kidnapped as examples. The Sarah Everad case particularly shook them.", "I only pay a nominal amount of £200 a month as per my dad's request. I do feel guilty about it as I know people normally give a lot more than that.", "OP needs to be fluid.", "Be water, my friend", "Years ago when I got my first cell phone (1996/7?) w pay per minute & calls only... I was very nice to be out on a ride & the battery would die. Not that anyone calls me, but still.", "Would they be open to some kind of compromise I wonder? Like, turn the tracking app on only when you are out on one of your solo walks and otherwise it's off? Idk \n\nNta and I'm so sorry you have to deal with this. Do whatever you have to do to stay sane through the next few months and then ENJOY YOUR FREEDOM!", "It’s going to be a hard three months but just try to focus on they are like this because they love you and are worried about you.", "Go with the flow, as it were.", ":-)"]}