{"id": 18987, "submission_id": "140vgpz", "title": "AITA for getting upset over onion rings?", "selftext": "I’m very sensitive to smells and I went out with some friends and there was a couple of people who went who was unfamiliar with my autism. One of them ordered onion rings and I absolutely cannot handle the smell of onion or garlic in front of me.  I tried to explain it to them how much it distresses me and they literally blew me off saying “I love onions rings and I’m really starting not to like you” I was upset and I left the restaurant mad. I told my friend I was really hurt and he’s telling me that my hang ups are my own and he’s not policing what everybody eats for my sake because it’s becoming old. If I know the restaurant has things that trigger my sensory it’s probably best that I just don’t go. I don’t have many friends that I feel that understand me and less now. My mom is like I guess they weren’t your friends anyways but my mean sister just told me “I guess you are learning the hard way that not everyone has to deal with your bullshit” I just thought since I was out with my friends I could count on them to give me a safe space.", "created_utc": 1685923432, "permalink": "/r/AmItheAsshole/comments/140vgpz/aita_for_getting_upset_over_onion_rings/", "score": 1996, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Maybe I’m wrong for thinking others should care about my comfort over onions rings or other food I’m sensitive to. I guess that’s not the case for everyone\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YTA \n\nYou explained after they’d already ordered and they weren’t obligated to order something different even if you’d told them beforehand \n\nI’m sure having such common food items be a sensory trigger is difficult for you and honestly I’m not sure how best to navigate it but it seems unrealistic to expect everyone you eat out with to avoid them", "- Why do you feel like you can police what anyone else orders or eats because of your sensory issues? \n- Did your mother ever force your sister to bend to your will? \n- How many friends have you lost over time due to your own personal issues that they refused to cater to? \n- How often do you ask people to not do something because of your sensory issues?", "YTA. \n\n>One of them ordered onion rings and I absolutely cannot handle the smell of onion or garlic in front of me. I tried to explain it to them how much it distresses me and they literally blew me off\n\nI am not sure what you thought should happen here. Was he supposed to change his order? Go eat at a different table? I don't know how old you are, but you sound old enough to understand that the world around you does not adapt to cater to your issues. It's on you to learn how to manage them.\n\nI sympathize to a point, because there are many sounds that irritate the heck out of me. Pens clicking, fingers tapping, gum smacking,  turn indicators, whistling, and loud music to name a few. But I have to avoid those sounds when possible, and put up with them when it's possible. I don't expect anyone else to cease their racket for my comfort.", "YTA, the world does not revolve around you. Life is give and take if you want friends and you need to just get the fuck over it", "Sorry but YTA. You don't get to dictate what others eat at a public restaurant.  What would you say/do if someone at neighboring table got the same thing? \n\nIs the smell/smells something you can actively try to acclimate to so it becomes less of an issue over time? Most smells become more tolerable/less noticeable with exposure. (Not a doc, not super familiar with the sensitivity issues of autism either).", "Yta and your sisters not mean, she's being realistic. You don't get to dictate what other people eat when you go out. If its that big of a deal, stay home. \n\n>I just thought since I was out with my friends I could count on them to give me a safe space.\n\nThe only safe space you have is one you create for yourself and its certainly not going to be in a public restaurant.", "idt yta for getting upset, however yta for trying to control what others eat — this is coming from someone who’s autistic. i have a lot of sensory issues, and i communicate them to friends and they try be accommodating but the reality is i am going to encounter things that make me uncomfortable and i just have to learn to deal with that. i’ve found ways to cope and prepare beforehand, and make sure i have time afterwards to rest. i completely understand it’s difficult, but others shouldn’t have to miss out on simple things for things that we *can* tolerate.", "YTA 100%. You are out in public and are going to have triggers. Learn to deal with them rather than expect the world to cater to your “safe space.”", "YTA.  It’s a public restaurant.  You could’ve moved seats or politely excused yourself.  Stick to smaller known groups in the future.", "YTA, \n\nIt’s unreasonable to ask people you don’t know to what you don’t like to smell and expect them to not order things they might want to order.\nHave you worked on dealing with your triggers?", "YTA, everyone has their own tastes and shouldn't have to police them for one person. If you can't do something, don't put yourself and others in a position to that causes strife all the way around.", "YTA. They are your friends or they wouldn't have gone along with it up till now. You have to show appreciation for their friendship by realizing that friends aren't obligated to cater to you 100% of the time. You owe them an apology.", "YTA I am not going to modify my order in a restaurant because someone else is bothered by the smell of my food. Sorry, not sorry, it's not my problem. Just because your family caters to you doesn't mean everyone else will, that's not how life works.", "What was the solution here? Were they supposed to throw out their onion rings because you didn't like them? What if someone at a nearby table had ordered onion rings? What if the place just smelled like onion and garlic because of the cooking in general?\n\nIt's one thing if you had told them in advance about this or maybe even had offered a compromise such as them ordering something else but you paying for their meal, but realistically your sister is right, even if she is mean. You're not within your rights to stop someone from ordering what they want at a restaurant.\n\nYTA, maybe E S H because they weren't super nice in their response but also it was just not appropriate for you to police what they were ordering at a restaurant because it creates an unpleasant environment for you. That's something you will need to prepare yourself for in advance, whether that is deciding not to go based on what is on the menu or using a coping mechanism to deal with it while you're there.", "YTA and your sister is right.", "Nobody was asking you to eat the onion rings. Somebody else wanted them. \n\nThere are all sorts of food smells in a restaurant.  Some of them can be strong smells-to you. That sucks for you. YTA", "N T A for leaving, but Y T A for expecting everyone to always cater to you. There are ways of managing smells. Doctors and nurses often use odor blocking balms under their noses to avoid unpleasant smells. Maybe you should investigate that", "You can't expect other people to know you don't like certain smells and you really can't expect people not to order what they want to eat.", "YTA... Dont make it all about you. Excuse yourself from the restaurant and go home. \n\nYour sister is right, if everything is about your issues, you wont have many friends.", "Your autism and triggers aren’t your fault but they are your responsibility.  If you’re that triggered by smells it’s best to schedule meet ups that aren’t at restaurants.", "You sound like an entitled jerk and I wouldn’t want to be around you either.", "YTA\n\nYou can't police what other people order and eat. That's not fair. \nI understand you have autism but that doesn't give you a free pass to control what other people do. \n\nYour sister is right and you need to find a way to  cope because everyone shouldn't have to cater to you.", "YTA so what if another table ordered onion rings? Would you expect them not eat them to accommodate you?", "YTA, I’m over seeing people use autism as an excuse to control other people, be an ah and dictate to others… you need to learn how to manage your triggers-not expect everyone else to pander to you. Judging by your friends comment-seems like this is an ongoing situation. You’re autistic-not special, you may be the center of your parents universe but the world does not revolve around you", "YTA. Garlic and onion are basic ingredients. You’re asking people to eat bland ass food to accommodate your own issue. Don’t make everyone’s life’s revolve around your own preferences.", "YTA, the world doesn't revolve around your hang ups. Did you expect them to change their order for you?", "So let me get this straight. If someone goes out to eat with you, they can’t get like garlic fries or onion rings, because you are sensitive to the smell. Really.  Are you paying the bill. You want people to be sensitive to you, but are you being sensitive to them?  \n\nI have a chronic condition that some smells cause a medical condition that can send me to the hospital.  It is not anyone’s responsibility but mine to keep me safe. And receive treatment. What treatment are you receiving for this?", "Of course yta. And your sister is right.", "YTA because your attempts at trying to tell them how much it distresses you was insinuation they shouldn't eat them to make you more comfortable. \n\nYou can't police what other people do to manage your triggers. Wear a face mask and dab a fingertips amount of some kind of fragrance in it if it bothers you. \n\nYour sister is right, despite it not being the best choice of words. \n\nYou have to manage the world around you because it's not going to cater to you. Onion rings aren't something they should need to police around you opposed to other triggers such as delicate subjects of discussion. \n\n\\- Someone who also has autism/adhd/apd.", "YTA. I get it, because I have an autistic sibling, but part of growing and learning how to function in the world in ways that suit you, is learning to be responsible for your own triggers. Your friend is right, they shouldn’t have to police what other people eat on your behalf, nor do you have the right to police other people either. No one is obligated to act/do things a certain way for you. If they do, great, if they don’t, you have to able to cope with that.", "i hate this safe space crap. your room in your parents house is a safe space. when you someday have your own home, that's a safe space. but not everywhere in the world can be an immediate safe space just because you're occupying it. your sister is right, your hangups are your own and not the responsibility of other people around you. you can't dictate what other people can eat in your presence. i suggest you work on your triggers. i feel like these days i see so much of \"i have \\[insert disorder here\\] so i simply CAN'T do/have xyz\" lately that's just begging for the whole world to revolve around how they are without any attempt to modulate their own issues. it's annoying. \n\nYTA", "Soft YTA.  You cannot expect to police peoples food.  Is there another solution perhaps?   Chew gum?  Scented handkerchief?", "YTA \n\ndo not expect the world to conform to your triggers. Your triggers are your responsibility.", "YTA. You can’t dictate what others do in public. Your ASD doesn’t trump everyone else’s behaviour. \n\nYou can strive to mitigate or reduce your triggers. It can take time, but you can learn to at least round the corners", "YTA… get over yourself….", "Yes YTA, this is a life lesson for you.", "YTA, and this is coming from another autistic person with sensitivity to smells. Your friend who said that if you know the restaurant is going to have smells that are an issue for you, you shouldn't go to the restaurant is right. While it would've been better for your friends to choose a restaurant that you could all enjoy - and if you ask for a different restaurant to be chosen beforehand and your friends consistently shut you down then they would be the assholes - sitting there and trying to police someone else's food is not the way to deal with this. You could've said \"hey, sorry, but I'm having a hard time handling the smell of the food in here, I'm going to pop out for a bit, let me know when you're done eating/have moved on to dessert/whatever\".", "YTA", "YTA and it doesn’t sound like this is the first time it has happened if someone said it was “becoming old.”", "YTA - It is a restaurant- they serve onions.  If you can’t deal with it go somewhere that has outdoor seating so the smells are not in an enclosed space or meet for something other than eating.  The rest of the world cannot stop living due to your issues.  There are things I can’t do because of physical limitation, but I don’t expect the world to stop doing those things because I can’t.", ">\tOne of them ordered onion rings and I absolutely cannot handle the smell of onion or garlic in front of me.  I tried to explain it to them how much it distresses me and they literally blew me off saying “I love onions rings and I’m really starting not to like you” I was upset and I left the restaurant mad.\n\nThat dude is my hero. Yta", "I work with people with autism, and fully understand their sensory issues - I know it's nearly impossible to just train yourself out of it, and no one should expect you to. That said, YTA. If you know certain food smells are overwhelming, why on earth would you choose to join people who don't know you well at a restaurant and then expect them to order only foods you are ok with?", "YTA. The world doesn't cater to your autism. People can order what they want to and you can make the decision to leave or stay but don't sit there and whine about your sensitivities.", "YTA", "YTA", "YTA.", "YTA.\n\nYour sister is correct.", "I think your \"mean\" sister says it best: “I guess you are learning the hard way that not everyone has to deal with your bullshit”\n\nSeriously, this.  Now if these onion rings posed a physical threat to you, say some strange dangerous allergic reaction to the smell, you might have a point.  But they don't, so you don't either.\n\nAutism is a real condition, but it sounds like you are using it a little too much to \"get your way\".\n\nYTA - don't be that person.\n\n&#x200B;\n\nEdit: typo", "YTA. The world doesn’t revolve around you and your triggers. Grow up and get over yourself.", "Hard to disagree with “if a restaurant serves things that trigger you dont go”. What if the table next to you ordered onion rings? Would you get mad and leave too? \n\nNot gonna call you an asshole I honestly dont know who is wrong here as I have 0 experience with autism and what ever comes with it.", "YTA\n\nDon't care about your sensitive problems with smells, you can't dictate what other may eat or not in front of you and honestly, if i was your friend, i would start to dislike you too if u complain about this issues a lot every time you go out with friends..\n\nYour sister is right too, the world will not stop only because some smell that you don't stand is on the picture... your options is either to adapt this smells to be less notable or just lock yourself in your room forever... the worlds is full of smells, if u can't handle, not my problem.", "YTA  I’m on the spectrum and I get it, believe me. But this is our problem to solve, not theirs. Switch seats or buy some nose plugs for swimming and don’t use them unless you need them. You can still interact with your friends that way. I have found that the more I try to resolve the issue myself, people are more helpful and understanding.\n\nI have a difficult time with noise, particularly in groups. My family and friends are aware of this and always have a quiet place I can go to decompress. Sometimes I’ll go sit in my car but usually I’ll be on my smartphone. They understand this is a coping mechanism and not meant to be rude. I wear earplugs in public places such as school recitals and such. The important thing is I can still hear the show but the audience chatter gets filtered out and I can be there to support my friends.", "YTA. I'm very sorry that you're sensitive to smells. I am for certain things as well. I'm allergic to peppers. So I don't go to any places that have a heavy pepper presence. It's on you to control where you go, not to control what other people do in a place that allows for it. What if the table next to you has onion rings/garlic? Are you going to be upset about that too? Your friend is right. You're making pretty demanding requests that are within your own control to avoid. Don't like onion rings? Don't go to a place that has them. Your friends are allowed to eat what they want in a place that serves that food. \n\nA restaurant that serves the food you don't like is not your safe spot. I'm sorry. If you really can't stand it that much, then you need to just know that if they're going to a place that allows it, someone who likes them might get it. And they could just be tired of always going without something they like because of you. It's one thing to not want to eat it yourself, but it's something completely different to demand everyone around you cater to you. It's a food sensitivity/smell sensitivity. Not an allergy. That is definitely on you to manage.", "YTA It is ok to ASK people not to get onion or garlic and it is ok for them to refuse. There is a difference between asking for an accommodation (i.e  \"I have an aerosolized anaphylactic allergy to ___, please let me know if your order ____ so I can sit at a different table\") and demanding others cater to your preferences (I hate ____ so YOU cannot eat it).  Your mother seems to have taught you that your are entitled to the latter.", "> “I guess you are learning the hard way that not everyone has to deal with your bullshit”\n\nYTA. Your sister isn't mean. She's telling you the way the world works: when you are out in public, other people get a vote. You can't expect to control what other people at a restaurant order. That's deranged.\n\nIf you can't stand the smell of onion or garlic, maybe it's best to eat at home.", "YTA and your sister is correct.", "I'm very sorry to say it but yes YTA. Handling your triggers is your responsibility, not other people's job. You can't police everyone's food because you don't like this or that and you can't expect your friends to do it for you. I won't stop eating something I like because someone at my table is triggered by my choice of food - it's a restaurant, I'll order what I want to order and I won't let people tell me I can't because \"I don't like the smell\".\n\nMaybe you should find someone to talk to. A specialist could help you and you'll be able work on your triggers to reduce them and prevent them from ruining your life. And  idk why but I think you're young so I just want to add that I'm not judging you at all. You can do it ❤️", "You had me until you said somebody needed to police everybody else for *your* autism. This is bait.", "YTA. You are not the food police. You can't tell people what they can't order just because the smells and textures trigger you\n\nAs others have mentioned what if other tables around you ordered trigger foods? Would you get up and say \"can you get the server to take away and get you something else?\"", "YTA-I'm sorry but if you're aware of something that you're very triggered over, it's kind of your responsibility to deal with it or find coping mechanisms for it, you could've looked ahead at the menu before you went and decided if you wanted to go or not, or you could've figured out a coping mechanism. Either way,  everyone else shouldn't have to avoid things they like.", "It’s tough because I want to be the empath that tells you ‘hey, maybe if they understood you better-‘ but also, realistically speaking, you can’t expect every person to accommodate you. Part of overcoming autism is exposing yourself to stimuli and overcoming the negative emotions. If you’re cognitive enough to be capable of explaining your triggers, then you’re capable enough to overcome them.", "This is a situation that you are going to have to learn how to handle for yourself. Because your sister is correct (though lacking of empathy in delivery), there will come times when a trigger (of any sort) will cross your path that you cannot control.  \n(in this situation it could have been a strangers food at a nearby table for example)\n\nIt is not up to your friend to police what others eat, they may be tired of being the one that has had to and doesn't want to anymore. It was incorrect of him to call it a hang up, when it is truly something that adversely affects you physically & mentally.\n\nLook for support groups, seek counselling, even do some research on the internet to find coping mechanisms when this happens and find one that works for you.  \nIn the meantime changing your seat, choosing to eat outdoors when available or even putting on a hand lotion or sanitizer with a scent that pleases you may help.\n\nHave a talk with your friend & explain this isn't a hangup, but do not expect or require them to be able to control everything for you.\n\nSlight ESH for everyone involved, commination skills seem lacking all over.", "YTA you went out with people who are unfamiliar with your aversion to smells and then tried to police what they ordered. No wonder they got annoyed with you. I understand you have an aversion to smells but that's something you need to manage on your own. It's not your friends responsibility. It's yours. You don't get to tell people what they can or cannot have because you don't like it or it upsets you. You can leave if you're truly unable to manage it, but don't keep using your autism as an excuse to tell people what they should do. Your sister, albeit a bit rude and blunt, has probably been forced to cater to you her whole life and I can understand fer frustration and reaction. Seems like you may have a habit of demanding your friends cater to you. Again this is your issue to deal with. Not theirs. Learn some coping mechanisms: maybe switch seats with someone else in the group so you're farther from the smell, or maybe if you're going to be in  a restaurant, dab a bit of vaseline under your nose. Talk to a therapist about what you can do to manage your autism. Stop putting the onus in your friends to do it for you.", "YTA", "YTA big time!  Your sister is right", "You are no fun to go out with.\n\nYTA.", "Yea YTA and good luck keeping friends if you don’t bend on this. Literally every cuisine in the world uses onion and garlic.", "YTA\n\nI'm on the spectrum too, and I understand sensory sensitivities although mine are different senses. But that isn't an excuse for us to treat other people badly. This was someone else's food choice for themself. \n>My mom is like I guess they weren’t your friends anyways\n\nThey were. But you treated them badly, and it sounds like this has been a pattern, and they stood up for themselves.\n\nYTA\n\n>I could count on them to give me a safe space.\n\nA public space such as a restaurant is never going to be a safe space.", "YTA. \n\nIf eating out is that difficult for you, it would probably be best to find other places to hang out with your friends. Or invite your friends over to your house and cook for them with ingredients you can handle. It's just not realistic to expect that you can go to a restaurant and tell people what they can and can't order.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI’m very sensitive to smells and I went out with some friends and there was a couple of people who went who was unfamiliar with my autism. One of them ordered onion rings and I absolutely cannot handle the smell of onion or garlic in front of me.  I tried to explain it to them how much it distresses me and they literally blew me off saying “I love onions rings and I’m really starting not to like you” I was upset and I left the restaurant mad. I told my friend I was really hurt and he’s telling me that my hang ups are my own and he’s not policing what everybody eats for my sake because it’s becoming old. If I know the restaurant has things that trigger my sensory it’s probably best that I just don’t go. I don’t have many friends that I feel that understand me and less now. My mom is like I guess they weren’t your friends anyways but my mean sister just told me “I guess you are learning the hard way that not everyone has to deal with you bullshit” I just thought since I was out with my friends I could count on them to give me a safe space.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA! No safe space in a restaurant! I respect and understand your condition but the entire world will not cave to your condition! In the future have your friends over to your house where you control the smells", "You need to learn how to deal with this. So many dishes at restaurants have one or both of those in, you can’t demand people don’t eat those in a restaurant.", "Some people don't even have legs, let alone an opportunity to go somewhere to eat and you're whining about a smell you don't like? Seriously????\n\nAutism does not give you a golden ticket to dictate what others do or don't do; eat or don't eat. Stop using it as an excuse and start managing your affliction and your social situations better.\n\nYour expectations of other people are way above what the average person should expect from anyone! No one 'needs' to be familiar with 'your autism'. You need to be familiar with social etiquette. YTA.", "YTA. You need to learn to cope with and/or get over things like that. They have occupational therapy for those sorts of things. It's not up to everyone else to cater to your sensory sensitivities.", "YTA. Autism is not a free pass to make everyone do everything your way.", "Soft YTA. There are many situations in life where you have to suck it up, for whatever reason, even with people that are supposedly your friends. Yes, you are autistic, but that's not a free pass to behave however you want or get whatever you want, or make other people not eat food they enjoy because you can't handle the smell. There are ways to deal with the smell as someone else here stated, so please look into that for everyone's sake. Good luck.", "Soft YTA. I also cannot stand the smell of it them either. It grosses me out. But unfortunately I can’t control what people eat. My parents make egg salad and omg the smell makes me want to barf too. This is such a hard situation. I hope you can find a happy balance.\n\nTip: in medicine when people are working with infectious diseases and the rotting smells like gang green, they dab Vicks vapor rub under their nose. Maybe worth a try?", "YTA. I understand that your sensory issues can cause you some distress but that's something you need to learn to deal with to survive. I strongly suspect from your friend and sister's reactions that this isn't the first time you've tried to police other people in a setting where you shouldn't. I'd put money on them having handled you gently and politely for years on these issues but now they're sick of it.\n\nIf you're at a restaurant and you know full well that there's a common food that'll set you off, let your friends know beforehand so they can think about an alternative if they still want to eat with you. If a friend tells me the smell of fish makes them feel queasy I'll gladly pick something else. If I order fish then they make a fuss of it after it's arrived then there'll be no such understanding.\n\nOnions and garlic are two of the most common smells in just about every cuisine. If you can't learn to handle the very slight smell of them nearby then you need to address that professionally. It's nothing but fussiness, your autism makes handling it harder but it's still just a childish compulsion you can get over.", "ESH. I get that you don’t like certain things but I’d be upset if someone told me can’t order something I enjoy. Your friends could have been less harsh. Your sister for being a b…. and your mom for babying you and not giving you advice in real world situations.", "I hate to call you an asshole but springing this on someone who's just met you and has already ordered  is not the way to handle this. Restaurants use a lot of onion and garlic. Could you work on a coping mechanism ? Maybe try to meet friends at coffee shops or ice cream parlors where onions and garlic wouldn't be present.", "[deleted]", "I'm sorry for how rude people are being on this post, OP. I don't think you're the AH for leaving but I do think you'll have to learn to either avoid or better handle triggers in the future. I also think that your sister and friend were really rude in their responses to you.", "Hmm...I'm going to say YTA, but softly. I understand that you have autism, BUT it is unrealistic for you to expect the world to cater to that. You can't expect someone to not eat something because it bothers you. You know your triggers and should be prepared for them. Your sister sounds like she's at her wits end. It is not OK for anyone to use their disability as an excuse for bad behavior.", "ESH- obviously your friends and your sister are pretty insensitive. But you 100% need a better plan to deal with your sensitivities than telling other people what to do. You can't control the world, but you can control your response to the world. Triggers happen all the time. You need better coping skills. Talk to a therapist, preferably one with some experience in the neurodivergent populations. Keeping something with a soothing, pleasant smell in your bag might be a good start.", "I really don't think that Reddit is the right place to determine whether or not someone manifesting symptoms of a developmental disorder is an \"asshole\"", "ESH, but your sister is an asshole for calling your triggers bullshit. I am also autistic and certain smells set me off as well (the smell of cooking grilled cheese for example). It’s our duty to recognize and manage our triggers though. I would look into the odor blocking balms or even Vicks under the nose. Part of managing our diagnosis is exploring tools. It is unfair to ask others, especially people you don’t really know, to conform to your triggers. Your friends were rude but I also wonder how many times you’ve asked them to shape their experiences around your triggers. After a while, it could really wear on someone.", "NAH. You can’t handle those smells, and people who love garlic and onions (like me!) shouldn’t be asked to avoid foods they love because of your sensory issues.\n\nHonestly, I think you should seriously look into therapy or counseling to learn some coping mechanisms. You might have a difficult time finding people willing to never eat those very common seasonings around you.\n\nIt also might help for you to understand that other people have food issues that you don’t get. They might be recovering from an eating disorder or need to repair their relationship with food. You asking them to order something else might be just as triggering for them as smelling onions is for you. Asking people to change their diet for you is really personal and off-putting.", "Soft YTA\n\nI feel bad you had some kind of reaction to the onion rings but you can’t expect other people to not eat what they want near you unless it’s life threatening.\n\nIf you have a problem with being near onions and garlic I think you shouldn’t go to restaurants that have them since other people you are eating with could order those things.\n\nI do think your sister should have been nicer about how she told you people won’t be okay with your telling them what to eat or not.", "As an autistic person I understand where you’re coming from, however in this case ETA. \n\nI can’t handle smells a lot either, but that just means that I have to have something with a familiar smell that I can rely on: for me I have a toy or a hoodie that I bring with me, and I take breaks outside to regulate the smells. \n\nOn the other hand, it was not okay for your sister to say that, nor your friends. These things aren’t just something we can get rid of easily. In most cases they stick with us and can grow. I used to love the smell of curry and now every window in the house has to be open when it’s around. Autistic people have genuine difficulties and for your sister to say that people “deal with your bullshit” is not ok. She needs to step back and have something that she can’t be around shoved under her nose, and then say that. \n\nBut yes. ETA.", "NTA. You can't help your sensitivities. With that being said, can you think of ways you might be able to deal with a similar situation in the future? Maybe try some role playing exercises with your mom.", "If it was something that’s wasn’t in everything I’d maybe say different but definitely YTA. Onion and garlic are in almost anything .", "The entitlement...gross.\n\n1. Your friends are not responsible for your triggers. They are your own. I have disorders that came with triggers, they are my own to keep under control. Not anybody else's. Policing what other's eat is entitled. I hate the smell of tuna, my family loves it. I leave the room or cover my nose if I smell it. Not that big of a deal.\n2. Your sister's not rude for being realistic. She's right. Not everyone's going to want to walk on eggshells to please you.\n3. Using autism as a way to get what you want is disgusting. \n\nYTA. Majorly.", "YTA. \n\nYou don't get to tell people what they can eat. What you COULD have done is BEFORE everyone ordered, let them know you have issues and you'd be very happy if they accommodated you, but if not, then you are happy to leave and meet them later to socialize somewhere that you don't have issues. What it sounds like you did is make a fuss AFTER the orders were delivered, making you the giant asshole.", "You are the AH, they had no way of knowing this.", "I dated a guy once who would tell me I couldn’t order certain things when we went out to eat because he didn’t like them, didn’t want to see or smell them. YTA. You’re not the center of the universe.", "YTA.  You cannot police what others eat outside of your own home..if something like this is a trigger then restaurant hangouts is probably not a good activity for you to join", "You're the only one responsible for your issues, not the rest of the world.", "I’m sorry but you have been taught a lie. Your issues are *not* actually anyone else’s responsibility. You are responsible for making sure you are okay. If you can’t stand the smell of onion or garlic then do not go to restaurants— you have no right to dictate what anyone else eats.  This is not a life-threatening allergy.\n\nI always feel so sorry for the autistic kids whose parents cater to them to the degree that they expect people in the real world will also do the same. Nope. \n\nYou can extend your capacity by forcing yourself to be exposed to and get used to smells and tastes (it’s not fun but it definitely works) or you can avoid situations that trigger you but you can’t expect the world to cater to your needs just like I can’t.", "YTA and by your friends and sisters response you complain a lot. Definitely a you problem...", "YTA, but my little brother is on the spectrum and has ocd, and I totally understand how distressing certain smells can be, which is why I always accommodate him. The thing is, I do that because he’s family and I love him, and I’m very familiar with what his triggers are so it’s easy for me to know what the expectations are ahead of time.\n\nTry thinking about it from the other persons perspective- maybe they really love the onion rings at this restaurant, and they were super excited to get to order them and were looking forward to it. Then just as they’re ordering, they’re essentially told that if they do, they’re a bad friend. That could feel very frustrating and disappointing.\n\nI know that for a lot of ND people, knowing what to expect going into an interaction is really helpful, but it can be important to NT people too. Especially if you’re looking forward to something. \n\nI think in the future, the best way to handle this would be to talk to everyone ahead of time. You could say something like, hey, I’m really looking forward to seeing everyone and I enjoy getting together for meals. There’s a few things that unfortunately make me feel really sick, to the point where I wouldn’t be able to go if they’re present. Would everyone be able to forego really onion and garlicky things for this meal? \n\nI think that’s a reasonable request, and that way if anyone was unwilling to accommodate you, you could not go, and organize a different meal with the people who *were* willing to accommodate. That way you know everyone is fine with it going in to the get together, and everyone’s expectations are managed \n\nI don’t think you’re an AH at all for having sensory difficulties. It’s really hard, and people genuinely don’t understand how upsetting it feels. I’m sorry you’re going through that. But when we need accommodations, we need to be the ones to communicate and handle that ahead of time, so that we’re making asks and not demands, and so that if our asks won’t be fulfilled, we can decide if we want to participate \n\nGood luck!", "YTA, dinner in a public restaurant does run the risk of people eating things that you aren't comfortable with. Have you tried putting a bit of chapstick you like the smell of just inside your nostrils?", "YTA But in general people who are your friends will accommodate preferences. I have friends who are recovering alcoholics and I don’t drink around them, I have friends who are vegan and I ask first… that kind of thing", "The person who is \"unfamiliar\" with your autism may have done you a huge favor. He told you directly that your behavior was alienating instead of assuming you would pick up on the social cues. Your friend used this opening to try and establish reasonable expectations in a continuing friendship with you. You reacted by accusing them of not providing a safe space for you: what have you done to provide a safe place for them? What have you sacrificed to create a safe space for your sister?\n\nYour mom is trying to help, but is setting you up for a very lonely future. If your expectation for real friends is you will never have an unpleasant experience ever again, I have bad news for you. \n\nYTA", "YTA.  Your sensory issues are real, but you can’t dictate what other people are allowed to eat in a public restaurant.", "As a parent of a child with autism I’m sorry lovely YTA, what you sister said was accurate but she should never of said it to you in this way I’m truely sorry for that, this is a lesson I’m trying to currently teach my own child that the world won’t bend to your sensory issues it’s your job to find a way to work with the world it’s sad but it’s true, part of becoming an adult is learning how to function in the world not having the world function around you, unfortunately as parents we tend to avoid the things that trigger meltdowns or sensory issues with our children and they become reliant on this and think this is normal behaviour for others to work around what’s a trigger for them but at some point you have to stop doing this and teach your children the coping skills they need to be able to move forward in life not make demands around their needs but to know how to calm or regulate themselves around said triggers. \n\nSecond to that if your over 18 your an adult now and responsible for your own behaviour and actions if you don’t like something walk away simple don’t expect others to be your safe zone you create that yourself.", "hello! i have autism as well, and one of the things that are a sensory issue for me is onions as well, which is why i dont order anything with onions or have them take it off my food as the onions touching it makes my brain automatically assume its “tainted” \n\nwith explaining all of that; yes, YTA, because even though they are your friends, they cannot cater to ever single one of your triggers; \n\npeople like onion rings, you cannot expect them to not get them, it is a restaurant, you have to use exposure therapy to at least get used to the smell, because you are going to run into these things a lot\n\nYOU have to regulate YOUR triggers, and not expect others to do so, because these are YOUR triggers, not theirs", "YTA. You have an unreasonable expectation of others. If you’re that triggered you can excuse yourself.", "YTA I'm not going to stop eating something I enjoy in front of others unless they are extremely allergic.", "Yeah YTA. Other people can eat how they like and you can’t control that. As someone with sensory and smell issues so I feel you, but it’s on me (and you) to figure that out for ourselves.", "YTA. Is this a joke? Safe space? Usually that term is reserved for people wanting a safe haven from discrimination, harassment, bodily harm. Not for trivial shit like onion rings. \"If I know the restaurant has things that trigger my sensory it’s probably best that I just don’t go\" WHAT A NOVEL IDEA", "YTA", "I feel for you but, YTA\nYou are aware of your triggers and you need to plan accordingly. If you are going to a restaurant that serves onion rings, anyone around you could be ordering them, let alone the people at your table who don't know you well enough. Either don't go or be prepared.", "YTA  I have types of food that I can't handle the smell of, not to mention texture, but thats nobody else's problem but my own. You can't expect your friends to police other people that are not aware of your issues, they don't owe you anything. \n\nI also get the feeling that your friends are getting tired of being policed over what food they can have as well or maybe you are expecting too much. What happens if someone else in the restaurant, that isn't in your food group orders onion rings? Do you expect them to leave?", "Autistic here, and YTA. That saying, \"It's easier to wear slippers, than to carpet the entire world\" applies here. It's on you to learn to deal with things you don't like. It's not your job to to tell others what to eat or not eat in a restaurant. It's definitely not your job to be rude. I'm not unsympathetic to autism, being autistic myself. I get it. I absolutely can't tolerate the smell of restaurant fajitas. I hate the smell of popcorn too, the microwave kind. But I don't tell people not to eat those things. I find a way to deal with them. I especially don't ruin someone else's meal in a restaurant. I avoid the restaurant so I don't have to deal with smells I hate. \n\nThere's another saying, from the world of autism: \"Don't say autism when you mean asshole.\" So, you didn't act the way you did bc of autism. You were being TA. If it happens again, find a polite way to get away from what you don't like. No need to make people feel like crap for liking what you hate. Leave some cash for the bill, tell them there's a family emergency, and duck out like a boss, not a jerk. Look at the menu and decline if they have items that make you sick. You don't even have to give a reason. You just say, \"no, I hate the food there, maybe next time somewhere else...\"", "What would you have done if the table next to you ordered garlic bread or onion rings? I’m allergic to shellfish. I don’t go to red lobster. Sorry, YTA", "Experiencing and handling things that you don't like is pretty much a requirement if you ever want to do anything with other people in any given capacity.  You can't expect everyone to cater to your needs all the time.\n\nIf smells trigger you, you should learn to block your nose so you don't smell them.  We all have coping strategies, and this would be a time to use yours - YTA", "YTA- Autism doesn’t give you the right to control what other people eat. You went to a restaurant where anyone can order anything. Don’t go if you’ll be triggered that easily 🤷🏻‍♀️", "Sorry but YTA - as an adult your special needs are your own responsibility, not everybody else's. Your parents advocated for you when you couldn't, a family making sure all can be at the table is different from a diverse friend group that has plenty of other opportunities to spend time together but the specific occasion was to enjoy food that can be ordered at a restaurant.\n\nYou could consider stepping out for a bathroom break while they finish their starter, sit on the other end of the table from the people getting those items or see if your aversion is something you can desensitize yourself to in occupational therapy.\n\nAlso, the ingredients in onions causing the smell denature when heated and become less intense - have you made the experience with fresh onions and fixated on its negativity, generalizing it to all onion based dishes, or have you actually tried what level of exposure you can comfortably tolerate if you consciously try not to pay special attention to it?", "YTA. While I sympathize with the fact you are autistic, it is not up to the world to adapt to you, it is up to you to adapt to it. Your friends are not your babysitters and are not responsible for your comfort; you are.", "Im getting upset reading this, please delete this thread.", "Perhaps some time of essential oil, Vicks under your nose when meeting at random restaurants? Anything can help block unpleasant/triggering scents.  Even nt's are faced with unpleasant triggers..its their responsibility to cope not not everyone else's.  Y T A", "NTA for asking or leaving or even getting upset... BUT... Allistics arent gonna cater to our needs any time soon or understand them, so, your sister was correct but not right. Its not bullshit, just people are not willing to sacfrice their comfort for ours 999/1000 times because they dont understand. Your mom was also kinda right, maybe they arent good friends if they dont take your sensitivity into account. You cant count on allistics to give you a safe space though, ever. Heck, you can only count on about half the autistic homies out there to do so. Sorry :( It is, however, your responsibility to try to manage your sensory triggers and I am sorry about that, because there are so few places or people that will accommodate our needs.", "My spouse has issues with sound as well. We have found Flair Audio's Calmer buds help them quite a lot. They are fairly cheap, and might be worth looking in to.", "Please still use a turn indicator when driving even though it bothers you.", "Exactly -- OP doesn't get to dictate what others can order at a restaurant. It sucks if OP has sensitivities, but OP needs to find ways to work around them that doesn't include controlling people.", "Also if you have food sensitivities, it can be really helpful to look at the menu in advance (surely it could be found online). You could also call the restaurant in advance and ask them. It’s not anyone else’s responsibility.", "Also garlic and onion are some of the most popular used ingredients in meals around the world. OP you’re going to have to start working on this if you want to hangout w friends at restaurants OR you’re going to have to forgo restaurants in the meantime. Most places rely on those ingredients for seasoning", "The sister is no-BS and ultimately is correct and has probably said the same things so kindly over and over for so long she’s literally over it.", "> My mom is like I guess they weren’t your friends anyways\n\nThe sister is definitely being realistic.  Mom, on the other hand, is probably where OP gets their sense of entitlement from.  Not your friends?  Just because they ate some onion rings?  As someone on the spectrum, I find OP's entitlement deep in asshole territory.  YTA, OP.", "I'm also autistic and it doesn't really work like that. I can't stand the smell of boiled eggs. my dad eats them a lot. instead of asking him to stop, though, I just walk off until he's done peeling them and then sit away from him.", "Simple, anyone who uses their autism as a “you have to respect my wishes because I’m autistic” excuse is the AH.", "I have autism and this is ridiculous. When I’m in public, it’s my problem. It sucks, but it’s life", "It's a tricky situation that could of been handled better on all sides, I'm autistic and have sensory issues, particularly  sound, it's physically painful, disorienting and incredibly exhausting to deal with but I just stay places that are quiet and don't mix with a large group talking over each other because I know it would hurt but then I can get lonely because I don't want people to cater to me so I don't participate and people take it the wrong way.\n\nI agree OP shouldn't of gone to a restaurant with that particular sensory issue, onions and garlic are the most commonly used things to flavour food however I also think they probably went anyway because they wanted to be social even if it would cause them discomfort. Then OP realised it would be too much when the food was ordered and a friend would be considerate if they knew it was going to cause distress because it wouldn't hurt them not to eat the onions but it would hurt op to have them around so it sounds like they didn't really want op there anyway otherwise they could of socialised a different way or just not had onions. \n\nSo I kinda see all sides, think it was just mismanaged but sensory issues are like everyone else is made out of asbestos and they're all having fun sticking their hand in fire so you try join in but you're not asbestos so you get burned and if you mention it everyone gets mad at you for it calling you selfish, entitled or a whiner when actually you just want to spend time with them and it hurts but it wouldn't hurt them to step outside the fire once in a while.", "I am imagining that the sister has had a lifetime of \"you can't have that because OP doesn't like [whatever]\", so I'm willing to cut her a little slack when OP comes home to her sad tale of woe about how everybody won't just do what she wants.", "Having a sensory sensitivity is not assholish.\n\n Being a jerk to others because you expected their decisions for themselves to revolve around that sensitivity is not a symptom of the developmental disorder, it's just entitlement.", "If you judge no one in the situation to be the AH, then the correct acronym is NAH (No A-holes Here). NTA implies that the other person/people involved in the situation \\**is/are*\\* the AH.", "Oh, I do. I just find the sound annoying, but it's something I have to put up with.", "Looking at menus and calling ahead can be helpful but it doesn’t guarantee you’ll avoid the ingredients you’re sensitive to if they’re not the most commonly accommodated allergens.", "That doesn’t always work: I went to a place for my dads bday where I could only eat three things. I was told that the roti was just plain roti, and then found out I was unable to eat it as it had chickpea on it. It’s difficult to communicate sometimes, as sometimes they don’t outright say as that’s the way they cook it.", "My guess is that he would not like it if the suggestion was for an Italian place . . .", "that was my first thought. onion and or garlic is usually used as base flavors for countless dishes across every culture. it’s impossible to eat at a restaurant that doesn’t use either root.", "I was leaning that way tbh but again I genuinely have 0 experience with autism so didnt wanna be a dick.", "You are probably right, especially with the way the mom answered too, setting OP up for friend failure *I guess they weren’t your friends anyways,* OP will always doubt any friendship where a simple disagreement happens. Mom is also part of the ESH group in my opinion.", "Yes, I know, thanks.", "While that’s definitely true in plenty of cases that it doesn’t always work, it doesn’t sound like OP made the attempt. If they had, they would’ve seen onion rings on the menu and could’ve avoided this whole situation.", "OP would lose their mind at an Indian place", "Nah my nephew’s autistic + i help take care of autistic spectrum kids and many autistic people actually use their disorder to help understand and deal with their triggers and issues as they’re SUPPOSED to. A diagnosis like that is supposed to help you understand your differences and learn to cope with them to function properly. OP, along with so many other people that i’ve seen online recently, just use it to dictate what others can and can’t do around them. \n\nYTA, OP. The world doesn’t revolve around you.", "Agree with all of the above, and had the mom not taken this stance for so many years, she could have instead helped OP develop better coping mechanisms by now, for an issue that is surely going to come up many more times.", "Agreed. I can’t eat garlic or onions and the smell can cause a mild reaction if it’s really strong but I would never police people eating either if I knew they were featured heavily on the menu.", "Or Greek", "Smoked salmon for me. Once I almost puked on someone because of their breathe alone. This is why I don't go to fish places.\n\nI don't eat fish in general, never liked it as well, so easy to avoid for me luckily.\n\nSorry OP, as a person with autism I have to say YTA. I understand it, but you can't dictate what someone else is eating.", "Or Chinese or dozens of other cuisines.", "YTA. \n\nI hate to say this but I find alot of entitlement among alot of people with sensory issues (notice I didn't say all or even most). Although it's uncomfortable for you OP, it's not at all their problem. It's not like you're paying for their food, I'll be damned if I go to a restaurant and spend my own money and can't eat what I want. If you can't handle going out with people then stay home. You're grown, nobody cares about your sensory issues.\n\nYou're also not entitled to a \"safe space\" anywhere. Why? Because the world doesn't revolve around you.", "YTA because they are onion rings.  I need them.", "Your sister isn’t mean, she’s telling you the truth. It’s not fair for other people not to get what they like. I’m deathly allergic to tomatoes but i don’t police what people eat because of it", "He’s right, your hang ups are your own and he is not required to police himself for you. Get over yourself. YTA.", "I hate to say it but YTA. I’m also autistic and experience some pretty serious sensory issues, however you have to accommodate YOURSELF. when I go out and I know smells could bother me I put essential oils on my wrists so I can use that to block it out. I bring mints for taste issues, headphones for sound issues, and communication cards in case I go nonverbal. You can’t expect everyone else to do the work for you, you have to figure out what works for YOU. some things are okay to ask for (not being touched, needing space, etc.) but asking people to heavily go out of their way when you chose to join them is a no go", "YTA\n\nI also have autism and have things I struggle with but I try to not put my struggles onto others. Frankly, you have to learn to put up with things you don't like or not participate. If you have smell sensitivities maybe use some Vicks vapor rub or something you like under your nose to blocks other smells.", "YTA. “The I’m really starting to not like you comment” indicates to me that you’ve tried shit like this with these people before and they’re sick of it. Better change your attitude or I imagine you won’t have any friends soon", "Yea, I gotta vote for YTA.  Sorry.", "I’m dealing with MASSIVE food sensitivity right now literally being in a room that smells like any food I’m not ACTIVELY craving (which changes on a daily basis) triggers my gag reflex when I try to eat. I have never once put that on anyone else or told them they couldn’t eat something. When my husband makes eggs for himself in the morning I either go in my bedroom and close the door, or go outside and get some fresh air. And that’s in my own home. We just went to a steakhouse for my birthday because I thought I was craving steak but when we got there the smell was too much. I ate salad while my family happily ate steak. It’s not comfortable but you make due. Your issues are not anyone else’s problem. YTA.", "I have a lot of compassion for you, sincerely I do.  But in this case, yes, YTA.\n\nYou cannot control the people around you, and that's all there is to it.  The only person you get to control is you.  You can't tell people what to eat around you, that's just not an acceptable behavior as an adult human.\n\nThe world is hard for autistic people, and I get that.  But you have to make accommodations for that fact, you have to become observant of neurotypical behavior and if not match it, then at least predict it.\n\nIf you cannot tolerate the smells of certain foods to the extent that you become angry and stomp away from a social situation, then you need to accommodate for that by not going to those places.  Other people do not need to accommodate for you.  \n\nYour autism is not your fault.  But it is your problem.  Stop trying to make it other people's problem.", "You should listen to your sister.  She is telling you the truth.", "I am with your sister here. If you think a \"safe space\" is a space you get to control other people, then no one is safe in your \"safe space\".", "[removed]", "YTA\n\n“You have to get my approval for your food order” is not a reasonable accommodation.", "YTA \n\n“I love onion rings but I’m really starting to not like you.”\n\nFucking bravo.", "YTA, do you work? Because lots of people eat sandwiches/burgers/salads with onions for lunch. Or leftovers from last night that feature garlic and onions. A lot of the time break rooms are closet size. You bet your ass that your co workers will absolutely laugh in your face if you try to police their eating.", "It's not like you're allergic to them, you just don't like the smell 🙄. YTA.", "YTA. You're responsible for your own triggers. It's kind if people cater to them, but never a requirement, especially if in a public environment. \n\nBring some gum or some mints next time. The smell/taste of the gum may help overpower distressing food odors.\n\nEdited to fix a word", "YTA Even if your friend didn't order the rings, someone else may. It is on you to find a way to manage your condition when in a public place. If it were at the friend's house, I might say a different thing.", "You absolutely cannot not dictate what somebody eats😂", "YTA it’s a restaurant and the world does not revolve around you. The other person liking onion rings is as valid as your not. What would you do if the table next to you ordered them. No onions or garlic is hard to do at a public restaurant and you are asking people to now spend money on food that is not their first choice. Listen to your sister, she is not mean just because she does not coddle you.", "> If I know the restaurant has things that trigger my sensory it’s probably best that I just don’t go.\n\nThis is exactly the case. Maybe on your birthday or some celebration for you, you can ask them not to order stuff but in general you cannot police what people eat around you. \n\nIt's up to you to deal with your sensory issues. That can be therapy/professional help or something to mask the smell or avoiding situations. It sucks, but it is reality. \n\nThese friends probably are real friends - or could be - but are setting their boundaries. Try to meet up with them in situations which won't have food that bothers you. \n\nHowever if you act like you did in this situation you will lose friends over it. They will stop inviting you to meals for sure.", "YTA and your mom is an enabler. They ARE your friends that’s why they’re being honest with you. The world is not going to accommodate you all the time and it’s not ok for you to expect it will.  You’ve spend X amount of years controlling the diets of people around you and now you’re trying to dictate what strangers can eat. That’s not ok!", "YTA. your aversion to Onion and Garlic is not a disability. If you want to succeed in life you will need to get over the B.S. you cannot stand or no one will like you.", "I am autistic as well, and I’m sorry to say it, but I think YTA here. It sucks that you have sensory issues, I understand that. But our sensory issues are something for us to deal with ourselves, not something we can use to make everyone else change the way they live their lives. For example, if I go to a restaurant with live music, I bring my ear plugs and try to tolerate it or I just don’t eat there. I don’t get up and demand that they make the band stop playing. I know how much sensory issues suck, but they’re not other people’s problems.", "Question: what would you have done if the table right next to you had done the same thing and ordered onion rings? Would you also try to police them and tell them they can’t enjoy their food because you don’t like the smell?", "YTA. Friends don't dictate what you can and can't eat or do with their life.", "I hate sauerkraut. All my life, I hated the taste and even more the smell. I’m not autistic, I just really hate sauerkraut.\n\nMy folks love it as does one of my sisters in law. It’s anywhere that hotdogs are sold or German restaurants.\n\nI just put up with it because that’s how life is. No one likes it when someone farts in the elevator, but it happens. You just deal.\n\nYTA\n\nOn a side note, I love Kimchi.", "Sorry, OP, but what happens if you're out and the table next to you orders garlic knots and onion rings? Sadly, today... YTA. I can understand where you are coming from, but it is on you to police yourself when it comes to your problems when adulthood hits. Looks like it hit hard today.", "YTA just because you have food sensitivities doesn’t mean you get to police people and tell them they are not allowed to eat certain foods. You can look menus up online and call the restaurants. Suggest places that are more suitable. Do not go to places where you may be triggered and can’t handle it. Idk if therapy would help. Regardless going to a restaurant someone near you may get something you don’t like it’s not like you can tell them no don’t get that.", "YTA\n\nYour mean sister is right. Not everybody has to deal with your bullshit.", "As someone with strong sensory issues, it’s ours to handle. Maybe don’t go to meals with people you haven’t discussed your needs with yet. Maybe don’t do meals. There are other ways to hang out, and strangers are not going to be willing to change their diets for us.", "YTA princess", "YTA. You don't get to tell people what they can and can't eat around you. People aren't being mean to you. You are incredibly rude and entitled and they're unwilling to accommodate your completely unreasonable requests.", "YTA. Yes its rough but you simply can't dictate what people eat around you. Your autism isn't your fault but it is your responsibility.  \n\n\nTry peppermint oil under the nose?", "YTA.\n\nYou bend to the world, cos the world sure as shit got no obligation to bend to you. if it's too hard, stay home and eat pudding.\n\nbut you got bigger problems. your mum is validating your bullshit, and that can not end well, eg threads like this are just the starter. your sister may have been a dick about things, but she's 100% correct.", "I'm guessing your family (mother) caters to your dislike but we can't dictate what others eat. Even if your friends didn't order onions or garlicky foods, someone at a nearby table probably would and those scents often carry through the air.", "YTA people aren’t obligated to be sensitive to everyone’s triggers. It’s your responsibility to know your triggers and how to deal with them. Maybe you can carry essential oils around and put some under your nose for these occasions.", "Yea sorry YTA. If the smell of certain food bothers you that badly dont go to restaurants.", "People eating onion rings around you is not unsafe.", "YTA. Sounds like your mum's not doing you any favours by just telling you what you want to hear. Believe it or not, your feelings don't matter more than other people's feelings. \n\nI feel sorry for your sister, sounds like she's been having to put up with your feelings coming first for a long time. I hope she gets to experience what she wants sometimes.", "This is possibly the dumbest shit I've ever heard. The guy that said I like onion rings... deserves a medal.", "YTA", "I'm sensitive to some smells also but... just don't go to places in which those smells are present. Like you don't go to a cat cafe when you have cat allergy and demand them get rid of cats. Seems like YTA What would you've done if some strangers next to your table ordered onion rings? Like smells travel quite a distance. That said their comment about not liking you was really rude and out of nowhere... unless you're not telling us something.", "I’m sorry for this upsetting u but YTA. You can’t expect everyone in life to cater to your wants,needs, or conditions ever. People aren’t that reliable, that good, or even obligated to. I have family with autism and I get from an outsider as best I can how hard it is. Yet, even if friends didn’t order u can’t keep the table next to u from ordering it. You can’t expect a restaurant to not serve what u can’t handle bc if they did that for everyone they’d have no menu. You might not like it but it could be the few things the other ppl like, can handle, and so on. If there is no way u can deal don’t go to restaurants or you can work on your triggers through it. This in no way is meant badly bc your born with it and can’t help it and it’s definitely harder on you than anyone. It can also be hard, stressful, and a lot for the ppl trying to help you as well. They can’t change the world or fix everything u dislike for u as much as they may want to. Trying to remember every trigger and then policing everyone from it in public is impossible. All a person can fully do in public that loves u is help you through it. If u get mad still and flip out they can not do anything else. They can’t control everyone.", "YTA. You sound like an entitled AH.\n\nYou're not the main character. You're an adult who can make their own choice to not be a part of something that may cause you to get upset. Being on the spectrum doesn't give you the right to expect others to catter to your triggers.\n\n I also am sensitive to certain smells/tatse/textures, along with having misophonia ( which makes it nearly impossible for me to not become infuriated at a person causing chewing, kissing, or pen clicking noises) but I don't and wont go out of my way to make it known to others, let alone expect people to tip toe around those triggers of mine. \nYou knew the restaurant had your triggers and knew the others weren't aware.  I agree with your sister.", "YTA the world owes you nothing", "1 comments like the one your mom made are manipulative and 2 your “mean sister” is right. Do yourself a favor and give the restaurant a goog next time but no one is expected to change their behaviors over your sensory issues. I have issues with perfumes but it’s not cool of me to yell at every person who needs to douse themselves with scents. My issues are mine to solve. \n\nI feel bad for you because onion and garlic are used everywhere for everything you’re essentially saying “I can only eat like a 5 year old and I expect you too as well” YTA", "YTA. While your friend was hostile, you can’t expect to control what others eat.", "YTA\nIf you are that sensitive to smells, especially common things like onions and garlic, then you probably shouldn’t go to restaurants that use those ingredients. It’s unreasonable to think everyone will cater to you.", "I have the same issue with tomato sauce (or what they call ketchup in US). I cannot be around the smell of it. I don’t know why, I feel ridiculous, it literally makes me gag. \n\nHowever I don’t tell friends not to use it. I just move as far away as possible.", "YTA. Your expectation that everyone must cater to you needs to be adjusted. If you really need to not be around a food, you have to convince people not to order it. You apparently are not convincing.", "YTA. Your triggers are your responsibility, not anyone else’s.  Also, your mom is wrong. Those people were your friends until you wanted to make the world revolve around you. They probably got sick and tired of dealing with you not being able to cope.", "You are indeed learning the hard way. Nobody is gonna adapt to you. You can’t stop a person from getting what they like. You are not the one eating it and it’ll be different if someone bought you onion rings or something like that.", "YTA\n\nThere isn't a single solar system in the whole universe that revolves around a human being, yourself included. It doesn't matter if you're NT or ND; you don't get to force other people to fix your problems.", "YTA.", "As someone with autism and sensory issues, it’s not really other people’s job to accommodate us when it comes to such irrational triggers. YTA, but I understand you’re not coming from a place of malice.", "It’s genuinely possible that you don’t understand this isn’t something you should expect from your friends. You can ask politely and then their response will lead you into if you need to stay or go. If you must leave, do so politely.\nI don’t know if everyone in this comment section read this as I did, that you are genuinely trying to understand. \nIf you have been catered to in this way your entire life, you have an expectation now that everyone will do this for you. If you want friends you should not hold expectations like this. You have to control your own boundaries around your food. Check prior what the eating plan is and if your food aversion will mean you have to bow out. \nIf you find it causes you to not be allowed to be with friends, talk to a therapist and see if exposure therapy or something like it will help.", "YTA. Sorry. I’m weird about certain foods too but I don’t put that onto other people or try to police what they eat. \n\nIf my friends are going somewhere that is likely to be triggering for me, I don’t go. They will do everything to accommodate me and I appreciate that, but I don’t need to be a part of everything they do and I certainly don’t feel like I’m owed constant/limitless accommodation for every little quirk I have.\n\nYour sister said it best. I know it sounded harsh, but it’s the gods honest truth and you’re lucky you have someone who will keep it real with you. She’s preparing you for the real world rather than coddling you which is exactly what you need.", "Yes, YTA. I have severed sensory issues surrounding the smell of all meat (I’m a vegan), but I would never tell someone to stop eating it, even friends. You have to expect that in the world not everyone will accommodate your needs.", "As someone with a similar problem, YTA. Certain noises and smells can make my brain just explode but that doesn’t mean I can dictate how everyone else lives their lives when I’m around", "YTA. And I’m sorry about that, because sensory issues really do suck. However, it is not fair to expect everyone around you to cater to your needs like that, especially in a public setting. What would happen if \nthe person at the table next to you got onion rings? \n\nIs it possible for you to try things that block out the smell? Peppermint oil under the nose does wonders for helping someone ignore all other smells, or if you have any Vick’s Vapo Rub at home. Or you could experiment with other oils (lavender, lemon, etc) and find ways to block the smell of things that you are extra sensitive to so that you can go out and enjoy a dinner with your friend without policing what they can eat", "YTA. They don't have to cater to your specific flavor of neurospicy. That's on you", "Sorry, but YTA. If your sensitivities are so severe that someone else sitting near you with onions will be upsetting, then you need to think and plan more carefully before you go to any restaurants. You either need to study menus to avoid places that serve those foods or you need to get agreement in advance from all the guests that they will choose not to order them. However, it’s inappropriate to wait for that discussion until you are already seated at a restaurant and someone has already ordered onion rings. Someone with a severe peanut allergy can ask their friends ahead of time to not order any nut dishes, but if they waited until someone had already paid for and started to eat a PB&J sandwich at the table, they would be very rude. \n\nI sympathize that having sensory issues you can’t control is inconvenient and frustrating, but it’s your responsibility to manage them, not your friends’. It’s not realistic to expect others to advocate on your behalf to people who don’t know you well. \n\nAlso consider: what would you have done if a stranger at the table behind you or next to you had ordered onion rings and you were close enough to smell them? Would you have had to leave the restaurant? If so, that’s a pretty clear indication that it’s just not realistically possible for you to go to a lot of restaurants right now. You can politely ask your friends to accommodate you but you cannot ask strangers in public to do the same. It might be time to rethink your ability to eat in restaurants and/or speak to a therapist/doctor about medical and coping strategies to mitigate your sensory challenges in ways that can allow you to eat out more.", "I'm sorry, but YTA.\n\nI am giving you here the benefit of the doubt and list this:\n\n1. Unfortunately your friends will no stop their life for you all the time, they are not your caretakers, friendship has to go both ways. Now days autistic ppl have a way to subvert these stimuli triggers (if they are not extreme) with ABA Therapy. I don't know if you have the means to, but it something that can help.\n\n2. By the way you discribe your mother and sister I can point: either your mother doesn't care about your situation and just goes along to whatever you say, or she is overprotective to the point of delusional. That being said, for the context of the situation I can tell you sister is rational, given I see she being mean to you for the same reasons your friends will want to avoid you.\n\n3. I understand that you have your limitations, and since this is the internet, neither will anyone get the full picture of your very limitations, nor properly understand that to rightfully \"judge\". So what I say is that you either deal with (ABA Therapy I said before) or live with your limitations, I'll elaborate:\n\nIn this very situation you could just create a excuse to leave early and explain later to your friends via text, don't force people to acomodate you, regardless of your limitations you'll make enemies unless it's a physical accessibility thing.\n\nAnd as you build relationships, and you become a actually likable person, ppl that know you will accommodate willing in every way they can (they can't control what ppl order in restaurants, but they would be mindful when preparing food themselves)\n\nOP you take ppl for granted, be careful.", "NAH\n\nI am autistic and super sensitive to smells as well. Luckily I do have friends that work around that I can and can't handle, even at restaurants. \n\nHowever I know I can't police what others eat. For example my friend loves seafood, and I can't stand it, so we worked out if she wants seafood she sits in a way I can't see it and the smell isn't as bad. Even it that means putting the menu up over it. \n\nI understand the smells can be overwhelming, I do. Yet in order to have NT friends you have to work with them as much as they work with you. \n\nSo no one is wrong in this situation, but you do have to bend a little and work out a way to eat out without anyone having to change what they eat when you do.", "YTA. You’re not the main character of the world. Everyone will have to see, hear, smell things they don’t like occasionally.", "YTA.  Ok you have sensory quirks.  I get that, we have some of that at our house.  I bet you are picky about what you eat.  Let's say that restaurant only has one item that sounds really good to you.  Suppose your friend said \"no - you can't eat that, I think it's gross\".  Then suppose it was someone at the next table?  Or 3 tables over?\n\nThe thing about this is you can control YOURSELF but you cannot nor should you try to control OTHERS.  You could work on your sensory issues and give your friends a head up you may need to head out if it isn't working for you.  Because this is something you can overcome with practice.  You could just excuse yourself.  You aren't entitled to be mad because someone else is eating a food you don't like to smell.  You can make a choice that public restaurants with friends are maybe not for you, but maybe you watch movies, go for hikes, play board games, etc.  \n\nIf you want to give up a friendship over this, that is your choice.  But that is going to be a tough life because not everyone is going to like the same things and make the same choices as you.", "YTA    what would you expect to happen if someone at the table beside you ordered them?\n\nIt's up to you to avoid your triggers, if that means you don't eat in restaurants, so be it.", "ESH… why does everyone need a “safe space” these days? It’s not like more people are ND now than in the past, it’s just that more people are unable to cope themselves and expect others to cater to their preferences. We need to learn, grow, and get over ourselves. And if you really just can’t get past it, then learn to avoid those situations like you said.", "Soft YTA - not everyone should care about your hate for onions. I do empathize with being blown off like that, theres better ways to say that so I can see why you’re hurt. Similar stuff like that would happen to me before too in high school, I just always thought I was weird but no I was just around the wrong people. I’m 23 now and I met good friends after trying to get along with people from the same country as me (which didn’t go well). I do agree with your mom about them not being your friends since I personally wouldn’t hangout with someone like that but now, knowing what you know, you know to avoid people like that. Everyone has preferences. This person prefers to brush you off and make you look weird in front of everyone and you have a choice whether or not to hangout with these people again. \n\nBut again not everyone will care for or understand your sensitivities and you shouldn’t be obligated to hangout with people that don’t care about something thats part of you.", "gentle YTA. I don’t have autism, but I have a lot of sensory issues and a lot of anxiety issues. I’ve had to learn how to navigate those so that I can cater to myself and my own problems. No one else is obligated to cater to me just because I feel really uncomfortable and scared and shitty. If my friends ask me to go to a fair, I will politely decline because I can’t deal with the sensory overload of all the screams, crowds of people, various food smells, and possibility of seeing someone throw up. If my friends want to go eat somewhere specific and nothing I like is on the menu because I’m a picky eater or will lose my appetite based on the smells, but I want to still go..I just don’t eat and deal with it or don’t go at all. \n\nWe have to be our own advocates, but we cannot dictate what other people do especially in a group situation. We advocate for ourselves by either making the plans ourselves so that we are going somewhere we can be comfortable or by saying no so that we aren’t uncomfortable if we know we can’t deal with it. \n\nI’m not sure how distressing onions and garlic are to you. Do they make you nauseous or send you into a sensory overload spiral? How severe is it really? Because if it’s really bad, you aren’t going to be able to eat at many restaurants since most places always use onion and garlic in some form or another. It’s the base of flavor for a lot of dishes. Maybe stick to other plans with friends instead or going out to eat.", "So many people here don't seem to know a thing about autism and sensory overload.\n\nThat said, and I say this as someone else with autism, you can't control what other people choose to do and you can't deny them the right to enjoy the food they do.  Doing that would mean YTA, which I'm sure you don't want to be.\n\nWhat happens during the overload is key.  If it causes a meltdown, then you are going to have to start being picky about which places you can go (like with any disability).  If it causes a shutdown, then oh flippin' well - have the shutdown.  If people comment on your lack of communication or the fact you can't stay awake, just laugh it off, normalise it, explain that it's just overload.  If they're good friends, they'll look after you.  I can fall asleep in the loudest, busiest pub (embarrassingly) because of it.  I just make sure people know and not to worry about it.", "NTA. If I know you can't handle a smell, I am going to try to help you avoid it. Because that's what friends do. I am not horribly inconvenienced if I have to forego onion rings.", "NTA. You left, and that’s your right. Just know from now on that these people have this limitation, and you have yours.", "ITT nobody understands autism and continues to peddle their ableist bullshit", "I wouldn’t say you’re an asshole but I wouldn’t say you’re in the right. Your friends were a insensitive.\n\nI suggest you uber eats a large serve of onion rings and something garlicky and try some old fashioned exposure therapy\n\nEdit: I’ve just scrolled down to read more comments and it should make you feel better OP seeing so many people with significantly worse autism than you. \n\nYou’re not that bad OP. Your friends were kinda jerks nut just make sure you’re actively trying to improve instead of changing the world around you!", "Going with NAH on this - You sound somewhat young, so I do want to say that counter to what I'm seeing from a lot of people, you can find friends that are willing to help accommodate issues with food. One thing to think about is if there are several people, can you do strategic seating? My friend group has done that for eating at a Thai restaurant (we all love it but I'm allergic to coconut and another friend is allergic to shellfish - we made it work and everyone was able to get what they wanted by making sure we had some space between the allergen and the allergic person).", "YTA, you could have asked to be seated elsewhere or just been a little more polite. “Excuse me but for some reason I can’t handle that smell” and excuse yourself. I can’t do loud rooms sometimes, I don’t tell everyone to be quiet, I excuse myself and create my own peace.", "My goodness, listen to yourself. \"Count on my friends to give me a safe space\" bwahaha and boohoo. Your sister is right and YTA.", "YTA. I am autistic too and feel you on the weird smells. I really hate the smell of lettuce and it makes me want to puke.. that said, if someone orders something with lettuce I just try to power through it by breathing through my mouth or trying to focus on the smell of my own food. You can’t control what people order and eat.", "YTA. It’s not your friends job to constantly create a “safe space” catered to you alone.", "YTA. If the smells bother you that much, then you shouldn't go to a restaurant where you might run into this issue. Asking someone not to order onions or garlic around you is just not right because those are common things that people love. Just like you feel you deserve to get your way, your friends deserve to eat what they want at a public restaurant without being made to feel uncomfortable about it.  If it were me, I just wouldn't go anymore if you can't handle it.", "YTA. You can't expect everyone to cater to your every desire and then call it a \"safe space.\" Sometimes, you just have to buck up and deal with shit you don't like.", "Yta. Listen to your sister.", "Your boundaries cannot control other people.  Your boundaries are how you decide to navigate the world.  That’s why your friend said it’s your responsibility to not go to a restaurant that serves foods you dislike.  \n\nAnother example is misophonia.  Yes I’m autistic and have misophonia, but I can’t control other people nor the sounds that other people make.  I can only take take of myself and do what I need to manage my misophonia.  \n\nYTA", "YTA. You cannot expect friends/family/strangers to cater to your sensitivities in a public setting. The only safe space you are entitled to is your bedroom. The world does not revolve around you.", "Yes people like onion rings. YTA for telling some one they cannot have a food because you do not like the smell of it. Onion and garlic are in most cooking. Your sister is right in that not everyone will cater to you smell aversion to onions.", "YTA. \n\nI'm autistic. You can't dictate what anyone else eats in a public setting.\n\nEdit: based on your sister's reply, is your entire family not allowed to cook with onions or garlic?!? Dude you're holding them hostage and are being completely unfair.", "YTA Do things with your friends that aren’t triggering. In a restaurant I really don’t know what you expected.", "You don’t get to dictate what others eat around you. That is your deal to learn to cope with it. No one has to cater to your triggers. Especially in a public place where people are having their own thing, it’s not yours to decide what people can and cannot eat. And I have autism too but I don’t get upset when someone has someone triggering near me. YTA", "I think YTA and your mother is definitely treating you as the golden child.\n\nYour sister and your friend are correct and I suspect that your friends are getting tired of dealing with your requirments and your entitlement. Be kind or they won't be your (close) friends for much longer. You are pushing them away.", "Unfortunately, you can't decide what other people eat. You can not go. You can move to a different seat... but you can't tell them what to eat. Or not eat. If so, nobody would let anyone reheat fish in work break rooms. Lol", "YTA, if you know you have issues with smells, carry some balm to block the smells. Safe spaces are places that you create, not public restaurants. In your house,  you can totally ban onions and garlic. In a restaurant, you shouldn't be telling your friends not to eat food because you don't like the smell. Your sister sounds like she is over you expecting the world to cater to you.", "INFO when you go out to a restaurant, what do you do when people at nearby tables eat onions and/or garlicky food?", "YTA - You don't get to tell people what they can and can't eat out in a restaurant.\nIf it's that bad, then you need to stop going out to eat in groups. You can meet people after the meal, invite people over for a meal, etc ... But once you're out in a public place, you're more or less bound by public behavior.\n\nMy ex's sister can't stand the smell of fish (but not allergic). She forces people to move seats when they order fish while out, instead of moving herself (But her favorite restaurants are seafood restaurants because she likes shellfish...)\nWhen he and I were planning to get married, she learned we had some fish options for the appetizers and got proper pissy. When I refused to budge, she said \"I guess I'll just spend my brother's wedding puking in a corner\" to which I replied \"I'll bring you a bag\"\n\nIt is absolutely not ok to try and force your issues like that onto others in public places", "YTA how do you know that isn’t their safe food? You don’t. You don’t get to dictate how other people live their lives in a public space.", "YTA", "YTA\n\nYou're sister is right.", "Sorry but YTA. I understand that you have autism but that doesn't mean you can control what others get to eat, I'm sure you wouldn't like it if someone did the same. Maybe try breathing through your mouth or excusing yourself to the restroom if it's too overwhelming next time. Or just see if they'll go to a restaurant that doesn't serve food you're sensitive to, or decline going if they insist.", "YTA. If you can't handle the smell of xyz, you shouldn't be eating in restaurants that serve xyz. I'd maybe give it to you if this was a drive thru situation, there's a difference between being in a restaurant containing a strong smell and a potentially crowded car, but if the smells (or any other stimuli) of an establishment are too much for you you just don't go there. Especially with a restaurant, it's not like this happened somewhere you don't have alternatives to like the DMV.", "YTA, hate to tell you but disliking a popular food’s smell doesn’t give you the right to storm out of the restaraunt because your friend ordered something they enjoy.\n\nConsidering your sister’s response to the even it sounds like this may not be the first time you’ve done something like this…", "YTA. You’re not the center of the universe. Maybe it’s best you buy a plastic bubble and get inside.", "YTA\n\nYou cannot expect people to cater to your needs. You cannot dictate what others eat just because you don’t like it. Needing a “safe space” does not mean people in public must to change their actions just because you’re occupying that space.\n\nYou sound young, perhaps even entitled. How old are you? Have you considered therapy to help processing and navigating these life lessons?", "YTA\n\nYeah no, sorry. You can't expect everyone to cater to you all of the time. It is ultimately up to you to deal with your own sensitivities.", "[removed]", "YTA. I'm ASD too and I know how overwhelming food related sensory issues can be, just as I know that it's absolutely not okay for me to dictate what other people do and do not eat around me. Your mom is well-meaning but wrong with the \"they weren't your real friends anyway\" thing... because you don't like onions and garlic, and they ordered foods with those ingredients at a restaurant? No, friend. These are super, super common things that people around you are GOING TO KEEP EATING. You simply can't screen for friends based on who will agree to only eat blanda$$ food around you. The world is just not going to conform to you and your individual issues this way. This is your issue to work through, not anyone else's.", "Yta. Your sister is right. Tactless maybe but ultimately correct. \n\nYour hang ups, sensory issues or whatnots wont be catered to all tge time. \n\nI have migraines. Smells can trigger it, tempt of foods can trigger it sounds can trigger it. \n\nI dont enforce a dark silent world on everyone. I dont go into a restaurant and get upset that onions, garlic, fish or any number of smelly things are cooked, served and offered or that my tablemates may order it. Those arent rights one gets to have or enforce, even if you have autism or allergies. You set yourself up for failure.", "YTA because you have main character syndrome. The world doesn’t revolve around you. Recognize that you are the one with the problem and you alone are responsible for accommodating it.", "YTA. Your friend is right. Sucks that you have to deal with an aversion to certain smells but you can’t expect everyone else to restrict what they eat to cater for you. Also, anyone in that restaurant sat near you could have ordered onion rings. The world is not going to revolve around you.", "Soft YTA. I’m also autistic so I understand the severe sensory overload you can get with certain smells, but ultimately you’re in a public setting and cannot dictate what others do/eat there. \n\nI’m not sure what to offer as a solution to this because there’s not much to do about it. Unfortunately the world is not tailored to people like us and we kind of have to deal with it. I hope you find some friends who are able to accommodate you without having to sacrifice yummy onion rings!!!", "Your sister rules", "As somebody with several food allergies I have to say YTA.  In the future you should look up menus online and see if you're able to dine there without issues.", "INFO what was the response you were looking for? What did you expect them to do?", "This is a you thing, if you have that much of an issue on a type of food you’ll need to not go places where it can happen", "YTA. You’re in a public setting where people paid for food to eat. Autism or not you have no right to ask people to stop. Your sister isn’t mean, she’s realistic. I’m sorry you have struggles with food sensitivity but the not everyone can mold to you and your wants. Autism can’t be an excuse for being shitty.", "YTA you don’t get to police what other people order and eat. They weren’t making you eat it. If you’re so triggered maybe you shouldn’t go out to eat at all.", "YTA ...and your mean sister is right.", "YTA. I’d also like the onion rings more than you. Your autism isn’t your fault, but managing it is your responsibility.", "You need to find and independent woman. They cook, clean, and NEVER smell like onion rings.", "I’m with mean sister and friend. You do you. YTA.", "YTA. Pro Life Tip: the world does not owe you a ‘safe space’ and you sound exhausting. Not trying to diminish your sensitivities, but the onus is on YOU to provide your own ‘safe space’.", "I'm going to try and deal this message as sofly as possible; as frustrated as you are about your issues, YOU need to do something about it, it's not your friends burden to have to keep up on that, that's YOUR burden. YTA for the way you reacted.\n\nAs the child of an OCD parent who didn't deal with her sh!t, I was subject to my mum's mental hang-ups for my whole childhood. It ached me to see how she couldn't deal with the things she had no control over, but I shouldn't have had to carry that burden when she insisted we had to solve her issues. When my mother got on medication, it helped her to go to therapy. After being in therapy, she was able to stop trying to control the people around her. \n\nYou need to control your issues, not your friends.", "YTA. I understand that it distresses you, but you can’t control what others do, say, eat etc. You might consider trying to find a solution to the problem; if it was a noise you could wear headphones, as it’s a smell perhaps a mask? Spraying something under your nose? \n\nI think this is a time where YOU need to compromise if you’d like to maintain your friendships. \n\nAlso your sister was not being mean, though she could have said it in a less harsh way.", "I’ll answer these\n\n1. Because OP been catered to their whole life even to the obvious detriment of OP’s poor sister by way OP’s mother\n\n2. Yes, every day of her life.\n\n3. Not enough for OP to realize something has to change\n\n4. Every time OP is around someone else", "Tbf sensory sensitivity with autism doesn't really get much better with exposure a lot of the time (sometimes it does, but my personal experience at least is there is like, a lower ceiling to just how tolerable it can get)\n\nThat said still YTA. You can't expect people not to eat off the menu at a restaurant. If you know being in the vicinity of certain smells, or other stimuli, will be too much for you, you either have to try and negotiate a better location if the people are amiable to that, or figure out a way to help you cope, or if all else fails, you either go and put up with it best you can, or you don't go. \n\nYou can't make your sensory issues someone else's problem on the spot like that and complain at them for doing something completely reasonable for the environmental they were in. And as you say, someone at a neighbouring table could have ordered the same thing.", "Just fyi exposure therapy doesn’t work for autism. It’s not a phobia or a fear. It’s physical pain. Unfortunately it does mean a lot of us end up kind of trapped at home. It does suck. No we can’t tell others what to do. But it hurts when others don’t care. Op doesn’t get to tell anyone else what to do. But no, exposure therapy doesn’t make the pain hurt less.", "There really isn't a way to acclimate (at least in my personal experience), but I still think OP needs to realize that they simply cannot tell people what they can and can't eat. I personally tend to do what the friend suggests: look up menus beforehand and prepare myself accordingly.", "If OP were deathly allergic to onions, would you say the same thing to them? No one would tell their friend with a peanut allergy to deal with peanuts at the table.\n\nI'm only making the comparison because people with sensory issues generally can't help them. It's not a choice. You suggesting they acclimate themselves to the smell suggests you really don't understand what it's like to have sensory issues.\n\nIf I had a friend who couldn't tolerate the smell of something, I wouldn't order it in front of them. It's that simple to me. But I have auditory sensory issues so I can relate which is probably why I empathize more.", "They weren't even all OP's friends, the one who ordered onion rings didn't know anything about OP's issues, and at the point of having ordered it's far too late to be explaining your shit to people. \n\nPerhaps the group of closer friends would give OP a \"safe space\", but in that case OP needs to stick to that small group for going out to eat. Not expect wider acquaintance circles to all fall into line.", "Sadly what I’ve witnessed is the mom baby, spoil,  and enable once they hear autism. Which I get to an extent! Then they expect the whole world to do it. Then the mean sibling isn’t mean just real, states facts, and  are tired of being a back burner child. I’ve seen it in my own family. Child has autism or something then baby then, make excuses for bad behavior, do no constructive corrections, and ignore the other kids. In there own words I’ve been told they have it easy they don’t have autism or w/e sibling has. They don’t have it easy  bc they are raising themselves while all the parents focus is completely on another child.", "And the mother is an enabler who coddles them.", "There are no safe spaces. Only safe moments. We are all different people and we can do our best to make an instant safe for someone, but we have to realize that triggers can happen. What we are responsible for is how much we allow it to affect us. \n\nOP, YTA. Only you can control how you will deal with those tastes/smells. You cannot ask someone sitting in the table next to you to return their food, what would you do in that scenario? \n\nIf you can’t handle those tastes and smells, you really need to not join in on plans in places that serve those things. Your safe space will be ensured that way. Even if your friends respected your boundaries at the restaurant, there is nothing keeping literally everyone in the restaurant from ordering copious amounts of onion and garlic.", "Sister is mean for calling their autism \"your bullshit\".", "The only safe space that OP could have was to stay home.\n\nYTA, OP", "My grandpa was on a plane flight from CA to Canada. He was next to two ladies about his age, maybe just a bit older. As they're waiting to take off, there's a baby crying. BOTH of the ladies scoffed & said, ugh, I hope that baby doesn't cry the entire flight! He calmly says, \"you know, there a few things I've learned in my time on this planet. Dogs bark, cars pollute, babies cry & the world does not revolve around me!\" They didn't say a word for the rest of the flight.", "It sounded like the friends have dealt with this kind of thing for awhile. Likely not the first time OP has made demands of them. Sister seems to recognize a pattern (“your bullshit”)", ">What was the solution here? Were they supposed to throw out their onion rings because you didn't like them? \n\nOP ordered their friends to not get onion rings. That was OPs solution.\n\n>YTA, maybe E S H because they weren't super nice in their response ...\n\nIf I go out to eat and the person Im with tries to tell me what food Im eating I do not care why, Im not gonna be super nice either. Keeping in mind that if my friend has a serious allergy we're just not going to eat at a place thats a risk, and also that risk of dying /= \"it smells bad >:(\".\n\nOP is the only A here. But they're a big whiny one.", "Honestly even if they said it before they would be the AH. It would be like Muslims running around telling someone they can’t eat beef - I know the reasoning is different (maybe this is a bad example, I can’t think of a better one - just a dietary thing I’m around sometimes that the Muslim people I know are never like “you can’t have that” and they have an actual reason.) \n\n\n\nUltimately, if OP wants to be out in the world their “dislike of the smell” is just tough shit. People in public don’t like things ALL THE TIME, being a grown up is dealing with it quietly and not throwing a temper tantrum.\n\n\nEdit: pork - muslims can’t eat pork. Sorry y’all! I tried haha.", "Sensory overload is a real thing. I agree YTA, but maybe be slightly more empathetic to other peoples issues. ❤️", "Good ole sheet soaked in spearmint oil being waved around by the OR nurse during a fournier gangrene case or a particularly bad abscess.", "I like this approach", "I agree with this so much.", "It’s autism, not a medical condition. You can’t “treat” it. And sensory triggers can be completely overwhelming and physically painful for autistic people.", "Username checks out. Nicely done finding balance.", "yes yes! hate hate hate, you wonderful little NT!", "I was looking to see if this was on here; it is used in law enforcement as well.  I have also heard a member of law enforcement reference smoking a cigar in \"vicks usable situations\" and wonder if that is an option or if something similarly smokey might help.  Even if not something you smoke, a smokey drink if you are of age, that you wet your lips and use your napkin to wipe under your nose, might help, but I would see if you could test it at home first.  I would also see if your sister has any ideas, while she answered without a lot of empathy, she is going to have a better idea what will likely work with your friend group.", "Stink balm is a brand that is apparently amazing at blocking offensive odours. Seen it recommended on a lot of the nursing Insta pages I follow, only reason I haven’t tried it is I don’t want to pay international shipping!", "It’s not insensitive it’s being realistic.", "Nope. I have autism. My wife has ADHD. Many of our friends are also neurodivergent. So I get what it's like to be in a position where something triggers me. I can either remove it, or myself. I can *ask politely* ahead of time or even in the moment for someone not to do whatever is upsetting me, but if they are a stranger and they choose to say no, I have to fucking deal.\n\nAlso going out to a restaurant as (what I assume is) an adult, you cannot tell other people what they can or cannot order unless it's going to cause a life threatening issue and at that point, why are you there?", "the spectacular hatred is really refreshing, you know? like a splash of cold water to wake you up from a dream of acceptance.", "As a fellow ASD I’d like to counter on your point about screening friends. \n\nThe majority of my friendship group are neurodivergent and we all try to accommodate each other where we can and would actually be really receptive to this request. So I do think it’s a possibility that maybe OP needs to find other friends who are more understanding.", "oof, thats awful. thanks and good luck", "Hi, I’m autistic and have sensory issues- OP is TA and it is not comparable to someone with an allergy, and someone with an allergy would have taken better precautions to avoid this situation.  Yes, there is not an easy way to acclimate, but it is on OP to look at menus and suggest better locations for meetups.  Once you’re at the restaurant, you’re an asshole for preventing other people from eating things on the menu-\n\nAlso the person who ordered the onion rings isn’t OPs friend, it’s their friends friend and thus they had no way of knowing OPs sensitivity.  OP didn’t say anything to them until they *already ordered it*.  \n\nI know sensory issues are difficult to manage in public, but it is absolutely on the person with the issues to make sure plans are sensory friendly or choose not to attend.  I cannot stand the sound or smell of oatmeal- when I go out to brunch, I make sure it’s not on the menu of restaurants my mutuals have suggested.  If it is, I suggest another place, or choose not to go.  I would be an asshole if I went and then made a fuss about someone ordering oatmeal", "Thanks, I will check them out.", "Fr. Especially because it's the law in a ton of places.", "I always joke that I will chop up an onion and some garlic, get it sautéeing in a pan AND THEN decide what I’m gonna make for dinner.", "Am I the only one who thinks onion rings don't even really smell inherently oniony? I'm trying to decide if I just eat so many onions I'm impervious to the smell lol.", "Moms not helping OP to navigate relationships and their many facets.", "My guess is the sister is considered mean because she always complains that everything is always catered to OP and she is so used to OP getting what they want while the sister isn't considered the same.\n\n  \n\n\nThe way the mum said ohh I guess they aren't your friends if they won't cater to every thing you need, tells me the sisters has been told to cater her life to fit OP.\n\n  \n\n\nThat must have been a great feeling for the sister to have reality bite OP in the ass. Nothing better then an I told you so.\n\n  \n\n\nOP be nice to your sister because I'm assuming she has had so sacrifice things she wants to make you happy her whole life. You aren't the centre of everyone's universe and the world will not cater to you. Those new friends are correct and your older friends are getting sick of it. If you don't change now you won't have any of these friends. It's sad to say but is this a trend?? If so you need to look at the common denomator, you!!.", "Traditionally Muslims cannot eat pork.  Traditionally Hindus cannot eat beef.  I think you got them confused.", "Muslims won't eat pork, not beef. \n\nHindus don't eat beef as they believe cows are sacred.", "Not trying to be rude but Muslims can eat beef. Its pork thats not allowed. \n\nIts Hinduism where they may avoid beef, bc cows are sacred. (Not sure if its an actual rule or if its just an in general respect thing where they avoid beef but might i eat it during certain circumstances)", "Vick's vapor rub or Mentholatum applied liberally under the nostrils and above lips works great too.", "Me too. When i read \"safe space\" i wanted to barf.", "It can be “treated” by identifying, teaching, and working through coping mechanisms, establishing well rehearsed scripts for situations if needed to address handling them, and setting yourself up for success (avoid group meetups at restaurants or at restaurants with heavy onion and garlic, checking menus in advance, being prepared to sit elsewhere or leave if needed without blaming others, etc).", "Especially not  with the absolute AH mentality OP brought to it where even in their description it made them clearly an AH for thinking everyone had to bend to their needs. FOH with that, honestly.", "They are not talking about allergies though, which IMO is an entirety different thing. Being sensitive to smells can almost always be overcome if someone wants to. Allergies can not.", "Loop earplugs are a lifesaver for auditory over stimulation too! There are different types that block different decibels of noise.", "Me too. And then the family walk through exclaiming about how good it smells and what am I cooking. ‘Just onion and garlic so far…’", "they smell more fried IMO than anything but the taste of onion can linger in your mouth (imo)", "I used to hate onions with a deep passion, but I liked onion rings. They don't taste or smell onion-y to me at all.", "I agree with you... onion rings simply smell 'batter fried' to me.", "I hate onions and onion rings smell awesome to me, just like yummy fried batter haha.", "We must get to the root of the root problem", "Thanks!", "Thanks! I corrected it", "Hindus don’t eat any meat. Beef is especially frowned upon because cow is considered a god even if they are treated like shit.", "Ah! Haha fuck you’re right.. I’ll edit my correction. Thanks you!", "Hindus avoid every type of meat", "To quote a former special ed teacher I know, a disability is no excuse for poor manners.", "I have worked with autism and I have worked with a growing number of people that have fought to get the diagnosis and then use it to create preferences within their life. True autistic people do have sensory sensitivity but react behaviorally from my experience to reduce the impact. They are very sensitive to what is expected and would more likely just walk out of the restaurant if they smelled it instead of communicating a desired outcome.", "Yup what if the table next to him orders onion rings.", "No that’s not true. Being sensitive to shell is not the same as being autistic. Sigh.", "I mean, a good chunk of them do, but afaik it isnt an actual rule in the religion. According to a quick search, 44% of Hindus identify as vegetarians.", "Excuse me?\n\nI have autism and ADHD, diagnosed since I was 10.\n\nWhat do you mean by 'true autistic'? Autism could be looked at like a scale in terms of ability or severity, but that doesn't mean that people with better capacity are not autistic. I work as an assistant nurse and have to deal with sensory issues in my job. I figured out ways to work around things or I have learned to just put up with them.\n\nFor example, when caring to high needs residents we often have to roll to wash and dress that person. I have sensory issues with my ribs. I can't lie in bed with another person's arm over me, it's too painful. This could be a problem when rolling. \n\nThe best practise for rolling a resident is to ask the resident to their arms crossed over their chest,  but many residents are non compliant.  The solution is a mix of putting up, moving a residents hand gently  to sit on my hip as opposed to them grasping at my rib cage area. Another option with some residents is to place a pillow at the front to they can't dig their fingers in at the front. This is common with people with dementia. \n\nPeople with Autism range and can be very different with skills and issues. You shouldn't assume we are all the same.", "Strictly speaking, Hinduism doesn’t allow meat or alcohol. Atleast that’s what I have learned since I was born. Of course nowadays, like your numbers suggest, many Hindus don’t follow religion that strictly and do eat meat and consume alcohol but it is prohibited in religion.", "I am not….I was not referencing you or anyone who has autism. Your response actually references my point in that people with autism make behavioral adjustments to accommodate with sensory based issues. I do apologize for lack of clarity, I am a behavioral health worker who has had a string of patients that are not diagnosable for autism without any diagnostic tool ever used who are self identifying to both gain attention and justify behaviors. It has gotten overly frequent lately and that was my reference.", "Fair enough...", "I do apologize that my comments made you feel as if I was invalidating your experiences. I am probably overly sensitive to people appropriating mental illness for attention and justifications. I am happy you have found how to manage and excel!", "That okay, I understand. Self diagnosis and using autism as a cover for poor behaviour ( by this mean both those diagnosed and self diagnosed) have become more common in recent years. I imagine working working in mental health this would be quite common.", "OP the onion rings weren’t “in front of (you).” That sentence alone screams entitlement. You’ve been coddled too long; time to grow up or be an AH from here on out.", "Friends are right.\nSister is realistic.\nMom is an enabler. \nYTA.", ">If I know the restaurant has things that trigger my sensory it’s probably best that I just don’t go.\n\nI believe your answer is right there. If you don't know wether the smells of a restaurant you're about to go with company may trigger your sensory issues, you must find out beforehand. YTA.", "YTA. I myself have some pretty bad ocd issues. Especially with stuff getting on my hands. And it especially triggers my ocd when people around me eat messy foods/get their hands dirty. But if I'm in a public restaurant and see stuff like that, I deal with it. Or if I have to look at people at work (tire shop) get their hands really really dirty, I deal with it. I know its not the exact same but its very hard for me to deal with. But I don't put that on others. Your problems are your own. Deal with it like an adult.", "YTA\n\nYou want a \"Safe Space\" and going out in public. \n\nNone of us can have both.\n\nYou can't dictate what others eat and play the autism card.", "YTA. The autism doesn’t mean you get to be nasty, rude and demanding of those around you. People like you are exactly why I don’t tell anyone I have it, lest they think I’m a nightmare.", "NTA buddy but the truth is, people be like that sometimes. actually most of the time. sometimes we have to create our own safe spaces with a lot of boundaries, and it sucks because it makes socializing really freakin hard.", "I'm sorry, this is a rough situation. I also am autistic with extreme sensory issues, especially regarding smell, etc. It makes life difficult! \n\nMy vote is NAH.  It's a difficult situation for all of you.  The person could have been kinder (is it absolutely necessary to eat onion rings at that time?), but also it's probably frustrating to not he able to eat what they want to, and I can understand how your friend might feel embarrassed if they feel like you were rude in front of other people.  None of you is an asshole, you just had different needs and feelings in that moment.  Sometimes that happens! \n\nYou all reacted emotionally, and that's okay. I'd recommend apologising for being loudly upset, just to smooth over the friendship.  It's likely that they're just tired (if they often have to be concerned about avoiding certain things, like being aware to not eat onions) and they might feel that their effort isn't appreciated - maybe they feel like you don't appreciate that they often keep your needs in mind.  I don't know if that *is* the case, but it might be! \n\nI can't handle smells like perfume, and my friend was really considerate and would avoid using strong-smelling lotions, candles, etc. That was very kind! But sometimes she'd use a shampoo that I couldn't handle the smell of, and because I appreciated the effort she went to and didn't want to make a huge deal, I'd try to find ways to work around that, rather than demanding she change it.  If she asked me if the shampoo bothered me, I'd answer honestly (though gently) that it did a bit. But if she didn't, I'd try to make it a situation I could live with.  For the sake of my friendship. Even if I did have to say something, I'd do it very, very carefully, gently, and kindly. \n\nAnd, in general, if I'd reacted to her using a shampoo by being *angry* at her, I think that might have hurt her, bc I wasn't appreciating she'd been going out of her way to be considerate, in a way few people are willing to do.\n\nYou both have valid feelings and emotions about the situation. Neither of you is the asshole; you just both had different needs and both reacted pretty angrily and hurt each other. \n\nAs for the person saying that 'they aren't really your friend, then' - that's nonsense! Being friends doesn't mean you always agree or always go really far out if your way to do what the other person wants (or even needs).  It doesn't mean they don't really like you, or care about you! That they've usually tried to accommodate you shows they *do* care about you and *want* to be your friend.\n\nI'd suggest that you approach them again and say that you appreciate how they've gone out of their way to accommodate your needs before, and that you're sorry for potentially embarrassing them or hurting them.\n\nIt's totally legit to want people to accommodate your needs, and it's not like your needs aren't serious, but also it can be difficult for people to accommodate us sometimes, and both things are true at once. \n\nIn the future (and I know it sucks, and you probably already do stuff like this), I'd recommend trying to find more ways to mitigate the sensory horribleness just in case the situation does happen again (hopefully it won't!).  Like, moving away from the person eating the onion rings, finding ventilation (maybe subtly suggest you go eat outside 💀), maybe even announcing you have a cold and putting on a face mask, lol.\n\nI wish you and your friend both the best.", "Okay I’m gonna say esh, see I understand being out with friends and expecting them to not mind not getting onion rings, but at the same time you can’t go to a restaurant and not expect people to get something. Overall tho the people you were with are also assholes", "Hi, yes, YTA. \n\nI see you haven’t commented, and I suspect you might be feeling overwhelmed with all the comments. \n\nI want to remind you that your sensory issues are doing you a disservice. It sounds like they’re preventing you from going certain places, and it is interfering with life in a way that you’re unable to control. With many sensory issues, there are ways around it, like headphones for loud spaces, different fabrics and tag free clothing, and sunglasses for super bright days. But this is an issue that may be difficult to resolve without some compromise. You may need to wear a mask with some essential oil sprinkled inside (nurses and doctors choose mint!), or you might have to sit out on certain activities due to the issue. \n\nOnions and garlic are incredibly common ingredients, and you’ll smell them in more places than just restaurants. I smell it often in the hallways of apartments  from people cooking, in nursing homes from the kitchen, sometimes even on planes or trains or busses if someone is eating. It wouldn’t surprise me if your family has been avoiding using those ingredients to keep you feeling comfortable, but it just isn’t a realistic way to live life. You’re going to have to find a coping mechanism to deal with this. \n\nThe great thing about this interaction is that you have an opportunity to grow. You can also show how much you’re willing to grow by apologizing to your friends. Good luck op!", "YTA and apparently you've been selfish for so long that you don't even realize it. The world doesn't revolve around you and your wants. The world doesn't give a shit about you. Grow up. Get over it. It's not about you.", "YTA. Onion and garlic are two of the most common ingredients in any meal. You are going to have to learn to deal with it.", "You went about this wrong. If you knew that certain smells were difficult for you, and that you were likely to encounter those smells at the restaurant your friends picked out, you should have clued them in and asked if they wouldn’t mind choosing another restaurant. Instead, you didn’t ask them beforehand - you just sprung it on them while they were ordering, bossed around a bunch of people, and then had a temper tantrum when they didn’t cater to you. YTA. But in the future, this kind of thing could be easily avoided if you just explain your aversions to everyone beforehand and ask if they wouldn’t mind if you picked the restaurant. It may mean you can’t join your friends for every outing, but in most cases, they’d probably be fine letting you pick someplace that works for you. But the key is that you have to let people know beforehand and ask if it’s OK, rather than just telling them what to do and getting mad when they don’t agree.", "I'm on the autism spectrum and I would never tell anyone else, whether in public or private what they can or can't eat simply because I don't like the smell or find it repulsing. Your issues with smells are your own and you need to find a way to deal with them because in life you're not always going to get what you want. The world is full of different scents and smells and you're just going to have to deal with it. YTA.", "Yup AH\n\nMy other half has food sensitivities due to autism. He knows I like variety of foods. He's never complained & even tries some different foods. I do acknowledge that he is extra sensitive to shellfish.\nIf we go out to eat he's aware people may have shellfish.\nIn restaurants garlic & onion is everywhere. \nAutism isn't an excuse to demand the world to cater to your senses.", "Soft YTA. They were harsh when they said your hang ups are your own, but that is true. You need to learn how to be around onions and garlic or find other activities to do with your friends rather than go out to eat. Onions and garlic are basically in every single good, it is a massive ask to have people avoid it.\n\nYou alone are responsible for managing your triggers. Much like boundaries, you cannot control what others do, but you can set your own behaviour in response to these situations and be firm in them.\n\nAn example is something like this:\n\n“I’m sorry, I can’t be around onion rings so I’m going to head out. Let’s catch a movie next week!” \n\nYou leave, but still leave the door open for hang outs that revolve less around food.", "This is your problem not anyone else’s.  You can learn how to desensitize yourself to the food smells. You can choose not to go to a restaurant. You can not dictate what others eat around you! Your mom has enabled you by telling you those people aren’t your friends. She is wrong.  You were wrong for trying to control what they ate.  Your sister is right and has probably suffered with your mom making everyone succumb to your sensory issues.", "YTA - I’m autistic and the smell of beans makes me sick. Migraine and nausea sick. It sucks I know I get what it’s like, but you cannot control what other people eat. I excuse myself if I can smell it. Vicks rub helps too so then I can only smell that.", "Look, YTA. I am also autistic and have sensory issues. But those are my own issues. I don't stop someone from ordering or eating something just because it bothers me.\n\nIt's my job to handle it. If I can't? It's my job to remove MYSELF. I can't control other people, I can only control myself and my own actions.\n\nIt seems like you need to adjust your expectations and start worrying about what you can control within yourself.", "YTA. I wouldn’t like you either.", "YTA\n\nWake up, the world does not revolve around you, once you understand this you will understand how realistic your sister is. Your mother is enabling your behavior.", "I’m also ND with sensory issues and a dangerous perfume allergy. If lights are too bright and over head, I wear a baseball cap. If noises are too loud, I wear noise reducing ear plugs. If perfume is present in a public place, I either don’t go, or I wear a special vapor mask and goggles. It sucks but it is what it is. \n\nDisabilities are hard. People don’t get that it’s not just about the pain itself, but it has to do with all the negotiations you have to have with yourself all the time. I feel for you, but you’re in the wrong here. \n\nHere’s an example of a good boundary: if you wear perfume in a public open space, I will have to keep at least 6 ft away from you. If you would like me to stand closer to you, then you have a way to make that safe for me. \n\nThe exception is in situations you can not decline to be in or escape from. I did have to firmly ask my colleague to stop wearing perfume because it spread through the entire office and I had several medical emergencies from being there, and it was required that I be on-site for my job. So he stopped wearing only the one product that spread everywhere and I moved desks as far away from him as possible. That’s an example of an inescapable situation. \n\nPlease try to imagine what it would be like if someone else told you you were only allowed to eat certain foods that set off your sensory issues. How would you feel? Try to put yourself in your friends shoes here too.", "OP can you give us some more information on how the conversation at the restaurant went and what your usual dynamic is with your friends, mother and sister?\n\nI don’t think there’s enough information to determine that you were being an AH and I think a lot of the comments here are being overly harsh and making assumptions.\n\nI don’t think you’re necessarily an AH for expressing your discomfort about the onion rings. The majority of my friendship group are neurodivergent and we all try to accommodate each other where we can and would actually be really receptive to this request. So I do think it’s a possibility that maybe you need to find other friends who are more understanding.\n\nBut accommodations aren’t always possible so it would be good for you to develop better coping mechanisms for triggers. As a fellow autistic I’m really sympathetic, triggers can be an absolute nightmare and I lot of us don’t get taught how to deal with them effectively but it’s not too late to learn! I’d recommend seeing a therapist that specialises in autism, if not possible there are also lots of online resources and support groups.\n\nI’m also concerned that maybe this subreddit wasn’t the best place to post this, I think going to an autism related subreddit asking for advice would have been better and more constructive for you.", "YTA- your problems are your own. Don’t go out to eat if you can’t handle what people order.", "Wow.  YTA.  I don't get how you can't figure that out.", "YTA - I’m autistic and it’s definitely frustrating when overstimulated. This world isn’t always built for us & our specific needs. You need to prepare ahead of time if you know there is a possibility you will be in compromising situations. Loud? Earbuds. Hot? Handheld fan. Sensitive to certain scents? Bring a face mask. Spray a perfume/essential oil in the mask to drown out the smell of the garlic/onion. Good luck", "Yta. It's not 'bullshit' what you go their,  but your sister is right that its not everyone else's problem.  As you said,  if there were sensory triggers its best you don't go,  so why did you go?  Patrons at other tables are likely to order your trigger - scents  so dictating what your party eats is pretty messed up.", "YTA. Get a grip. Nobody cares if you don't like the smell of onion rings. And you left in a huff like a big baby? I'm sure you were the topic of discussion once you were gone.", "Op, some things you can do with some of your friends, other things you won’t be able to do with all of your friends. I live with a disability where I can’t do everything my family and friends do, at first it was difficult for some to accept and they’d try to downplay it saying it wasn’t as serious as it actually was, and finally as they learned more, realizing it was life-threatening for me, they accommodate me if they can, but sometimes I forgo their activities because it’s better for everyone else to have a good time, as opposed to me stopping them from that…Because it’s not always just about me.", "If you go through life expecting people to always accommodate your autism you will be disappointed. On top of that you will come across as the AH because of your unreasonable expectations. \n\nThere are many people who will think you are just being fussy, difficult or just an AH so you need to manage your expectations of others or just stay home.\n\nIn this case I'm sorry to say YTA.", "YTA- this is your issue and you need to learn how to deal with it. Garlic and onions are used in a ton of food. You may have to stop going out to eat with friends. I’d be annoyed, too.", "YTA a lot of people with autism conflate a strange hangup with \"everyone must adhere to my standards\". You need to find a happy medium otherwise it won't take long for you not to have any friends. You could simply have moved seats or asked them to move the tray away, not leave the restaurant. You made a mountain out of a molehill.", "NTA. I see a whole lot of neurotypicals in this thread not understanding sensory overload. In the eyes of the neurotypicals, autistics will always be the AHs, because they are incapable of understand the sensory issues neurodivergent people have. Unless you have been with one for ages, you just cannot understand. \n\nSource: Mother of four ND kids and a wife of one ND wife. Sensory overload is real, and it's not just a \"trigger\" or an \"opinion.\" Sensory issues can seriously hurt, physically. \n\n*To those saying OP acted unreasonably: What do you think OP should have done? Just smiled and shrugged the (possible) pain off? Let's see you go into a place where it smells like you are going to vomit in the next few seconds and someone telling you to just not be unreasonable if you want to leave.*", "YTA. People get to eat whatever they want. I am vegetarian, I think that eating meat is morally bad. I have enjoyed hundreds of meals with people eating meat at the table. Being unable to be around people eating things they enjoy that make you uncomfortable makes you an asshole. Autism may be the reason for your discomfort, but it's not an excuse for your reaction. You know what is polite and kind and can choose to act that way or learn to.", "Yta if you expect your friend to police what everyone else eats. That's exhausting. It's one thing to ask the other people to not eat it and leave if they do. That doesn't make you an AH. But the follow up with your close friend is majorly AH. You should apologize to them for making them feel like it was their responsibility.", "YTA and you kind of remind me of Sheldon from big bang theory tbh. He grew up with his mom coddling him and thought his sister was mean when she was just not coddling him like his mom did.", "YTA. You can't dictate what people eat or order, etc. Everyone's life doesn't revolve around you...OP you need to realize your sister is right - you aren't entitled to everyone accommodating you in a public space.", "YTA, OP.\n\nIf you have certain needs or requirements in a social setting (regardless of whether it's down to allergies, autism, pregnancy, religious beliefs, etc) - you need to make the other attendees aware **AHEAD** of time. That way, they can switch up their plans to accommodate you, or make conscious decisions not to order certain things, and so on.\n\nIf you don't like strong smells like garlic or onions, that's not your fault. You shouldn't feel bad for it! But those two things are fairly staple ingredients, and you can't avoid them for the rest of your life - unless you plan on cutting out every public/social interaction ever.\n\nIf I can over-simplify it: it's like a vegetarian showing up to a BBQ and being shocked that no one there has prepared them a veggie option. Despite the fact that they didn't tell the BBQ host that they were veggie!", "YTA and what your friend told you is absolutely correct. And your sister is right, too, though obviously she could’ve been nicer in her delivery. Your mom is…. saying Mom things. It’s nice of her, but she’s wrong.", "YTA. Find friends that shares the same issues as you so won’t get triggered. The world won’t adjust because you have personal issues to deal with. That’s the cold truth.", "YTA I know triggers are physically painful. Personally the sound of someone whistling is intolerable to me. It makes me sick to my stomach and immediately angry. However I can't go around expecting ppl not to whistle. My family is mindful but if one of my nieces or nephews are super excited to show me their new skill of whistling I grin and bear it. Sometimes you deal with shit you don't like. We are living in a neurotypical world", "YTA", "i don't know how you could think you are not the asshole honestly. your sister is 100% right. \n\nyou might consider those people not your friends. but i would say that you are not a good friend if you try to force behavior from your friends when they are just trying to have a good time.", "YTA. You don’t get to police what other people eat. Maybe they too suffer from food aversions and onion rings are all they can eat? What should they do? Starve because you need a safe space? You don’t have to eat onions. But you do need to figure out a way to be around others that may be eating them or stay home.", "YTA.  You don’t get to decide someone can’t eat something just bc you have issues with it.", "YTA. you can’t expect others to tiptoe around you and constantly accommodate for you. I understand you have autism and sensory issues, but that doesn’t make everyone entitled to accommodate to your needs.", "Vicks vaporub. Keep some in your pocket if smells bother you. Or something similar that can mask triggering smells.\n\nYTA in this instance.", "YTA and I feel bad for your sister having to grow up in a house without garlic or onions.", "I’m assuming you’re an adult. You need to learn that your triggers are your responsibility. The world doesn’t own you a “safe place” from onion rings.  If you expect everyone to baby you the way your mother does and your mom expects everyone to cater to you, because your autistic you are not really going to have friends.  You sister is right. Just so we are clear you YTA.", "YTA \n\nYour sister is right, maybe a little harsh but right. The world doesn’t revolve around you and can’t expect people to always cater to you. A lot of people aren’t going to like you if you police everything they do.", "You are a special person.  Not all must cater to you.  Yes, total asshole.  If you have these issues, you must deal with them, no one else.", "I'm going to say YTA for your edit.  It's unfortunate that you have this sensitivity, but it's your problem and no one else's, and phrasing it as others \"don't care about your comfort\" is a disingenuous deflection.   You don't get to dictate what other people eat in restaurants, and your autism is not an excuse to blame others for not catering to you.", "You should get yourself into counselling for your issues. You can't expect everyone to change normal behaviors to accommodate you.", "NTA, you can't police other people's behaviour especially in public places. On the other hand if I'm going out with someone, I won't be triggering them on purpose, that's not cool behaviour. People should learn that autistic sensory issues are different than plainly disliking something. What your friend is doing is same level of being asshole as eating raw apples right next to me (I'm severely allergic to apples and just being in proximity of cut open apple is sure way how to get into anaphylaxis).", "People who get pain from sensory cues such as smells, are treated similarly to disabled people whose disability is hidden...\"it's not that big a deal\" or \"you're not that ill\". However, you can't force people to recognize or cater to your disability. It's too bad your disability doesn't involve the gag reflex, that way, your \"friends\" would have a visual and treat you better. It took  me 1 time puking for a friend to realize that no, I can't stand the smell or taste of bratwurst. So, NTA from your perspective, but YTA for expecting others to change. Sorry.", "Yta\n\nBut softly. I sympathize greatly with smells, but I would never tell someone to not eat it or have it jus because I don't like it. Your preferences do not supersede anyone else, no matter what. I'm sorry that you were upset but I think perhaps you need to evaluate how you see yourself versus how the world does.", "NAH. Sure, you have to come to terms with people ordering trigger foods and not getting super mad. However, I do think a level of friendship should exist where your friends actually care about your comfort over an appetizer. If I was out with a friend I care about, I would gladly skip the onion rings if I knew it would bother them. And that's how real friends should feel. It's not unreasonable to expect your real friends to want to accommodate you. It sounds like these people were randos, or at least acting like it, and maybe you should try to only eat out with real friends.", "YTA, what is your problem that makes you think everyone around you NEEDS to cater to you.\n\nNot autistic, but I can't stand fishy foods or smells. I don't think I have once told any of my friends to not order what they want and hey, if everyone wants to go to a fish restaurant and there is nothing for me there. I just let them know I'm giving it a pass.\n\nYou can't use autism as a free pass for everything like your mom has taught you, you need to grow up", "Definitely the asshole", "YTA.", "as another autistic person....YTA. I understand we have sensitivities we can't control at all, but they're right. absolutely nobody has to deal with your bullshit. nobody's gonna garuntee that they'll give you the room to accommodate yourself in a way that disrupts their life. sometimes you just gonna suck it up and get it over with or not go at all", "I feel for you and I’m sorry then godly smell of garlic and onions causes you distress (rip) but YTA. You can’t expect the whole world to accommodate to you. If it’s a you issue you deal with it how you can, that may mean nose plugs or just not going to dinner at a restaurant that has those smells.", "YTA what were you expecting to happen? If it’s that much of a problem for you, don’t go to restaurants that may have food that smells like onions/garlic (that is most restaurants).", "People like you with so much entitlement. Getting upset when no one gives a shit about them . Your sister is not mean she is right ( i am feeling for your sister how many sacrifices she has to make just to accomodate you ) . Pathetic", "YTA, your sister is right. If it was at your home or something fair enough, cmon man. It's not a case of understanding you, and yeah maybe they could've not ordered the onion rings, but if I'm going out for a meal and one of the people there tries to dictate what I order they're getting told no sorry.", "The reason you couldn't count on your friends better is because this wasn't just you and your friends. You knew others outside that immediate group were invited, and while your friends might be happy to help out avoiding your sensory issues, you can't expect them to coach other people that might be going with the group to do the same. Weighing the risks of potentially having to deal with things outside of your comfort zone is something you need to do when making plans that include people you aren't close with.\n\nIt sounds like the group of friends you are close to have been accommodating you for so long that you didn't even consider that other people you don't know well might not. That makes it sound like they've been very good, supportive friends over the years. You should appreciate that rather than being mad that they're not making other people they know accommodate you.\n\nWhat would you do if someone in the adjacent booth got onion rings? If they sat behind you they might well be closer to you than certain people at your own table. My guess is you'd work out seating so you'd maximize your distance wind direction avoidance from the food item, and then push yourself to get through it, even if the smell took some time to die down. You should be willing to do as much for your friend's friends as you would for total strangers.\n\nNo assholes here (well, the comment about not liking you was dickish, but, circumstances, let's let this one go) however I think you need to appreciate other people's perspectives more, especially when it involves an extended friend group, not just the people you're close to.", "YTA- Autistic guy here, autism isn't an excuse to dictate how others eat. It's your own responsibility to learn how to handle your sensory issues, not other people's. Learn from this experience and prepare for how to handle sensory triggers for the future.", "Yta, your friend is correct. You cannot control what others order", "YTA. Life’s a bitch, but you need to choose your battles. Horseradish repulses me to the core, but most of my pals love it. To me, it reeks to high hell, but if that’s what they want to eat, so be it. I like things that gross certain mates out, but they tolerate it, because they’re friends. That’s how life works.", "As someone on the spectrum YTA. They ordered a food they like and I understand that if I have a trigger it is my problem and not theirs. You should have not gone to the restaurant if it would be an issue", "YTA I also have autism and can't stand the scent of seafood but I don't tell the people with me they can't order it.", "YTA SO MUCH YTA", "YTA, the people who ordered didn't even know you. You shouldn't expect them to cater to your needs or try to have your friend police others.", "Mom said \"sounds like they weren't your real friends anyways\" \nSister said \"Learning the hard way that not everyone will deal with your bullshit\"\n\nOP sounds incredibly entitled and with what mom said, she has raised OP to either be entitled to special treatment or to write people off if they don't accommodate. This mindset will leave you friendless. Your sister wasn't being mean, she was pointing out something you refuse to accept. \n\nPeople don't generally care about other people's issues because EVERYONE has issues. This false narrative that we have to be 100% inclusive or we're horrible people is ruining a good chunk of our population. Your shit is your problem. Either sit, eat and deal with it or leave. You sound exhausting, your friend sounds exhausted and your sister said \"I told you so\" because she's right! Your friends are right! Your mom needs to help you, not placate you. I know enough people with autism and/or major allergies or sensitivities to know that your attitude is just that. A ridiculously entitled attitude. The world does not bend and break for you. We revolve around the sun, not the other way round. \n\nWake up and count the ways your friends enrich your life. Stop feeling sorry for yourself because that's just gross. You have friends! You are a hair away from losing them. You need to apologize and tell them you won't police their food again, that you will be responsible for yourself and act accordingly, even if it means taking yourself home if you feel uncomfortable. This is 100% on you. Own it, because your friends clearly won't anymore. \n\nGood luck. I'm honestly rooting for you to wake up and not smell the onion rings. YTA", "Pack some essential oil and cotton into a plastic bag and don't leave the house without it. When necessary, dab a bit of oil onto pieces of cotton and stuff them into your nostrils. Future problems averted. This time, NAH. If you repeat your mistakes, YTA.", "This is exactly how people with autism end up with far fewer friends. How does saying 'its getting old' help anyone? What friends are these? You cant really call them friends can you.", "I grew up with a sister like this. She's been divorced twice, her grown kids have been estranged from her for years, and she has no friends left at all. But she always blames other people for her problems, not even noticing that the common denominator in all of her issues is HER.\n   OP, YTA.  I feel a huge amount of sympathy for your poor sister!", "Sorry but in this case YTA\n\nYou don't get to dictate what people eat at restaurants. You can't tell people sitting at another table not to order onion rings.\n\nI have a sensitivity to certain smells but I don't go around telling people what they can/cannot order at a restaurant. \n\nYou wouldn't even be able to smell the onion rings after a few minutes anyway. So either find a way to move past it or suggest another place to eat that doesn't have onion rings but if they don't want to eat there then you're just going to have to deal with it", "YTA, I’m sorry you have sensory issues with strong odors but you don’t get to control what other people eat at restaurants.  I have a very strong reaction to anything white and runny, like sour cream, mayonnaise, ranch dressing, cottage cheese, etc. (Weird I know but it stems from a childhood trauma). That’s my problem. I have never told anyone they can’t have sour cream on their baked potato.", "YTA\n\nI have issue with many foods for their smells, tastes, and textures. Some I can't stand to even be around to the point I have to leave the room. But that is on ME. No one should have to accommodate my problems to the point that they can't order themselves some god damn onion rings.\n\nYou're expecting way too much. You need to work on your hang-ups so that you can more easily tolerate these things, or you need to be conscious of the fact that no one is going to baby you and make reasonable steps to keep yourself happy.\n\nYou're not entitled to police other people's eating habits just because you have autism.", "I think they told them as soon as they realised what they were ordering, but at the end of the day it doesn’t really matter when they told them. It might sound insensitive but this is very much a “you” problem for OP. Their friends seem to have been supportive up until now with the sensitivities, but now there is a friend who actively loves the food they’re sensitive to. I don’t think it would be fair to try and dictate what someone else eats, and the reaction comes across really dramatic. Going to the original friend again afterwards feels like dragging the issue out and creating more drama when the situation is already over. \n\nAt the end of the day, your triggers are your responsibility. Not everyone is always going to know them, not everybody is even going to care. OP needs to look into whether they can deal with this in some kind of therapy, through exposure, even hypnotism if it’s that bad. There are options out there for sure, but OP is the one that needs to find the solution, not their friend’s friends.", "Also literally everything, everywhere, has onions in it.", "Also, why not just see about moving places so the onion rings would be as far away as possible?\n\nYta, and you didn't even try to find a compromise, it seems", "The old saying “your freedom ends at my nose.” OP is more than welcome to try to explain and give others the opportunity to work around his needs, and if they do that makes them overly kind and considerate friends. But it’s also not their problem at all nor should it be expected.", "As someone with sensory issues, slow exposure can certainly help. It's not fun at first, but it can definitely help in the long run.\n\nAnd OP, sorry, but YTA. You'll need to learn coping mechanisms for things like this. People need to be allowed to eat what they want to eat.", "Your only safe place is your house. That's it.", "This is actually a really good idea. If someone has smells that bother bother (especially something fairly common like onions), carrying around a small balm to use as needed should really help. It’s a lot more practical and realistic than expecting the entire universe to bend to your demands.", "That sounds horrible.", "And your sister is not mean, she is just tired of being put aside because of you and your enabler mother.\n\nAutism is no joke, I have sensory issues too. But this is not acceptable.", "She didn’t call the triggers bullshit or fake, she called having to accommodate her bullshit.  Based on the OP and her moms reaction the sister has been having to follow OP whims.\n\nThat is not fair or realistic, especially with how many things fall into that category.  Had she been using or even trying to use those strategies to accommodate others I doubt her sister reacts that way.", "You’re shocked people side against the person acting like a tyrant and deciding what food is acceptable for everyone?", "It makes me sad, a lot of good comments with solid advice are getting downvoted.", "Yes, sometimes in life people have to smile and shrug off pain. Especially if normal human interaction in a restaurant causes you pain, and you want to be in that restaurant interacting with people. \n\nAnd teen disregarding that, if OP can't smile and shrug off the pain they shouldn't be making it other people's problem. 'I can't do this thing I want to do' shouldn't become 'nobody around me may do a thing they want to do'.", "I think a lot of neurotypicals are projecting because they don’t understand the concept of advocating for yourself and community care which is how we take care of each other in neurodivergent circles.\n\nI’m seeing words like entitled, nasty, rude when nothing in OPs post suggests that’s how they’re behaving. I really hope OP can see some of these lesser voted and downvoted comments with really solid advice.", "[removed]", "Or pick a restaurant where there weren’t those things, or even told everyone in advance *before* they ordered their food.  \n\nOther than Buddhist monastery style vegetarian food, pretty much all cultures have onion and garlic in their cuisines.", "> lower ceiling \n\nI like this new term for floor :)", "Can’t they use the same tricks people with smelly jobs use, the vaporub under the nose or smelly chapstick?", "Looking at menus and calling ahead can be helpful but it doesn’t guarantee you’ll avoid the ingredients you’re sensitive to if they’re not the most commonly accommodated allergens.", "Phobias cause apparent physical pain too. Are you certain there's a difference? All pain is physical (or all pain is in your mind, take your pick), that's how the nervous system works.", "OP can't help how they feel, but they can help how they act. Being uncomfortable and distressed is something one can overcome. Going to hospital or dying because of a peanut allergy is not something you can learn to deal with.", "And the offending onion rings were ordered by a new acquaintance, they weren't even friends to start with", "There’s a name for us! It’s called being a Glass Child. I had experience being one for a different reason but it covers all siblings of those with disabilities or severe illnesses.", "She didn't mean the autism, she meant the entitlement.", "I think she was referring to the sense of entitlement that she's decided came along with it. I know plenty of autistic people that don't think the world revolves around their autism.", "I think if you really look at what OP wrote and the tone of what OP wrote you would/could easily assume that OP's *\"bullshit\"* is not the autism but rather the insistence that everyone else has to bend to OP's will. The whole post reeks of OP being a bully; when someone checks OP on it they retort in a defensive stance and leans on their autism to justify being selfish.", "I mean, I would also hope the baby doesn’t cry the entire time. Sure, things like that happen, but that doesn’t mean you can’t express why you don’t want a ringing headache in an already uncomfortable situation. It’s not like they were going up to the baby or the parents and being rude.", ">be slightly more empathetic to other peoples issues\n\nMy empathy ends where the rights of others begin.\n\nTo use an extreme example; I feel empathy for the 15 year old kid robbing a convenience store because they were born to a single mother in a bad neighborhood with worse schools.\n\nBut my empathy ends with the act of holding a minimum wage clerk at gunpoint for $238, yeah it sucks for the kid to be born into those circumstances but that's not an excuse to steal and terrorize.\n\nYou can emphasize for OP's disability having a negative effect on their ability to lead a normal life while still thinking it doesn't give them the right to police others or use their disability as a cudgel to get their way.\n\nFrom the friend's reaction it also seems this is a recurring isse where OP consistely takes with no give. You can have your struggles with autism, but you don't get to want friendships and a normal life while being an unsociable AH when people don't bend to your will.\n\nThat give and take is expected of everyone and it sucks, even for non ND people; or do you think the mentally healthy don't have issues where someone wants Italian and someone else wants sushi so they settle on Tacos?", ">It’s autism, not a medical condition.\n\nI hate this new narrative that Autism isn't a disability or a medical issue, just a series of weird but absolutely debilitating quirks.\n\nHate to break it to you but autism is 110% a medical condition; it's in the DSM-5 and to be considered autistic for the purposes of legal accommodation you need a diagnosis from a psychiatrist; a literal body-mind doctor who will sit you down and run tests to determine that you are showing results off the baseline in a negative way.\n\nYou can't have your cake and eat it too. If autism isn't a medical condition than absolutely no one should feel bad about not adjusting to an autistic person's particularities; my brother dislikes the smell of bananas, but I'm not giving up banana bread over it because it's just a dislike.\n\nOne does not simply receive medical-condition levels of accommodation because they feel like it. If a sensory trigger is literally physically painful on a debilitating level we've reached into territory where it's a literal health issue, ergo, a medical condition.", "You can be realistic without being insensitive.\n\n“I guess you are learning the hard way that not everyone has to accommodate you”", "Nothing in her post suggests that this is what happened?", "So.. if OP leaving the place was unreasonable, what would have been the correct way? Like... If OP really can't be near X, some people get X, and OP leaves. Isn't that like the best solution? OP didn't just sit there and make everyone feel bad, but OP left the restaurant. I would be mad too, if I was with my friends (who knew my things) and someone else would do something that hurts me, and not ONE of the friends would say anything.", "When did OP say or suggest ‘nobody around me may do a thing they want to do’?", ">I really hope OP can see some of these lesser voted and downvoted comments with really solid advice.\n\nMe too. I was fully prepared to be downvoted to actual hell for me \"transgression\" of not agreeing with neurotypicals. But \\*someone\\* needs to tell OP they aren't the problem. \n\nWith my family, I've spent the last 23 years trying to explain to neurotypicals that ND's don't \"fake\" it, and it's different from their \"eww I don't like this.\" But more and more I'm of the opinion, that most neurotypicals are not able to understand. It's not that they don't try (because some do,) but that their brains are not capable of understanding that someone else's senses work differently. \n\nJust like most seeing people cannot understand that (some) blind people really don't see, they don't see black, they don't see dark. They don't see, like at all. As a seeing person, it's really, really difficult to try to understand, but we, as a society, should do that.", "I’d those aren’t enough, try Loops. I own both and use whichever ones fit the setting/need better. \n\nI’m so with you on the little sounds that others ignore, especially the turn indicator!", "they smell more fried IMO than anything but the taste of onion can linger in your mouth (imo)", "Bot. Stole from [this comment](https://www.reddit.com/r/AmItheAsshole/comments/140vgpz/aita_for_getting_upset_over_onion_rings/jmxfk1z/).", "I *despise* the smell of raw, red onions - they smell like bad BO but cooked onions have a different odor that I really like. I also love onion rings. I think yellow, not red, onions are used but they don’t smell or taste “oniony” - more so just that good, supremely unhealthy fried-food smell.", "It’s the grease. We smell the grease with a hint of batter. We used to have a convenience store that never cleaned their grease traps in their friers and honestly it was the worst smell this side of skunks or death I’ve ever smelled.", "Man, I *love* onions (& garlic)", "I was thinking the same thing when it came to the sister.", "It doesn't matter. She meant to be mean. She could have said it kindly but she chose to be rude and cruel instead.", "That is no excuse for being an AH. She could have expressed herself better but chose to be mean.\n\nAlso, you have no idea what she was referring to.", "I don't care and I find it pathetic that you think being mean to someone is okay.", "The sister was probably not allowed to have things she wanted because the mom babied the OP and made her not upset him. So she’s like look that’s now how the real world works. Just like the friend who said he can’t police what everyone eats", "That isn’t insensitive OP is entitled af and thinks because he doesn’t like something no one can eat it. What happens when the table next to him does that? Is he going to tell them they can’t get that too?", "They told them not to order the food they wanted.  Onion and garlic are staples in many dishes.\n\nHow many dishes does the OP get to veto for the table?", "...I don't think you can will yourself out of getting a migraine if you're sensitive to smells.", "Drug addiction can almost always be overcome if someone wants to. That certainly doesn't make it easy, many others need lots of time, effort and support to do so, and many feel it's a path that never ends. Allergies, for the most part, can be avoided with a $2 OTC pill. \n\nProbably random, point is I'd take the challenge of allergies over sensitivities related to autism any day of the week.", "OP is TA for trying to dictate their friends in a public restaurant, their sensory issues are their responsibility, but YTA for the ableist take. Not comparing this to allergies just to be clear- which can be life threatening. Sensory issues are painful though. \n\n“A person with autism may experience difficulties interpreting and organising input from what they see, taste, touch, hear and smell. Sensory perceptions can become frightening or even painful and can lead to high anxiety and meltdowns.” \n\n“It is widely accepted that children with autism have a heightened sense of smell. In fact, this is backed up by a 2018 study that found that people with autism use different areas of the brain to process scents than those without autism, causing them to experience smells more intensely.”\n\n“Sensory processing disorder (SPD) is a condition that affects how your brain processes sensory information (stimuli). Sensory information includes things you see, hear, smell, taste, or touch. SPD can affect all of your senses, or just one. SPD usually means you're overly sensitive to stimuli that other people are not.” \n\nSPD is a condition that is highly prevalent with neurodivergent people. It’s not really something you can just overcome. Like, no one likes bad smells, but there are plenty of smells I am nose-blind to. Then there are smells that I’ll smell no matter what and those make me feel like I’m in physical pain. For me it’s worse with touch and sound though. Like, nobody likes nails on a chalkboard right? For a lot of people the sound causes people to physically cringe, many also describe pain in their teeth (or just physical pain in general), or migraine inducing. \n\nExcept it’s not *just* nails on chalkboard, for me, a lot of times it’s paper and cardboard. Just to be clear, I graduated high school so obviously I was exposed to paper very regularly. If anything the pain and anxiety is just worse now than when I was younger. I also can’t stand coats (which as a child I was forced to wear), paint, yogurt/pudding, most blankets, most sleep wear, just to name a few, it doesn’t stop there. Even soft things like fluffy pillows and blankets- I’ll have friends stop me in the store and *insist* I pet the blanket, like no, I literally can’t. It will cause me literally pain and stress. It’s really not controllable. \n\nIt can be manageable, like when I do have to touch cardboard boxes I have to wear gloves. Like I understand how insane it probably sounds, but I keep a box of gloves around me 80% of the time if I know I’m going to have to touch something that triggers my sensory issues. Even then it’s not a 100% fix, but it’s gotten me through crappy retail jobs on truck days. I might be lucky too- I probably got the more mild symptoms of SPD than a majority of neurodivergent people.", "Creole and Cajun heavily use garlic and onion. Onion forms one whole third of the trinity that is used in literally everything.", "Hell yeah! We love onions!", "Unless it was Jain Indian.", "As the sister of a special needs brother, instantly recognized her response in juxtaposition to the mom's. I love my brother, and will be his legal guardian once my mom dies, but I definitely don't cater to his every whim like she does. After 32 years, it's gotten old. I've got kids now, and had to tell him he no longer gets to dictate based on his wants. \n\nI know there are things he can't help, like OP. Last minute schedule changes (which happens with toddlers) completely upend his universe. But sometimes it can't be helped. OP can't tell people what they can order, my bro can't tell my 2 year old to not blow out her diaper in her change of clothes making us have to cancel some plans and go home early with poop everywhere. Sometimes there has to be give on your end too. \n\nAnd, please, from another sister. Give yours a break. Your diagnosis has impacted her life just as much as it has yours, just in different ways.", "I'm 100% sure the sister was pushed around by the spoiled entitled sibling for her whole life. It's deserved.", ">Hindus don’t eat any meat\n\n**Brahmin Caste Hindus** don't eat any meat.\n\nMeat eating is discouraged but not explicitly prohibited, the only real restriction is beef; chicken, lamb, pork, venison and other meats have been consumed by Hindus since time immemorial.\n\nDo you seriously think that Indian cuisine only added meat dishes into the mix in 1858 with British colonization?\n\nLet's not mix the heinous system of caste politics with the actual laws of Hinduism; Orthodox jews would tell you that jews don't eat cheeseburgers because they mix dairy and meat, your average American jew would accordingly tell the orthodox one to fuck off.", "We don’t know any information about their family dynamic though (which is why I asked for clarification in my own comment) so to make assumptions about OPs character is silly.\n\nAlso being autistic and having many autistic friends I know that most people in the world are really ableist against autistic people and families can be the worst perpetrators which is why I hold judgement until I know more information.\n\nHer friend is right, she can’t police what people eat but it’s not wrong for her to ask because some people are actually receptive. \n\nThere’s a lot of terrible communication in OPs post - the person who ordered the onion rings could have said “no sorry, I want to eat the onion rings”, OP shouldn’t have left the restaurant mad, the mother should have given proper advice as a parent and taught her child better coping mechanisms, the sister could said what I commented above.\n\nIt doesn’t cost to act with kindness and communicate like adults.", "There’s nothing wrong with her asking though? My friends and I accommodate each other all the time and no one thinks ill of it.\n\nI don’t think it makes her an asshole for asking but she does need to learn coping mechanisms for when accommodations are not possible.\n\nAlso, it’s not that she just doesn’t like it, it’s an autistic trigger which can honestly feel like hell, it’s 1000x more than just simple dislike. I know that it is hard for neurotypical people to understand but you can at least try and be a bit more sympathetic.\n\nAlso sensitivities with autism can be very specific, she did say “in front of me”. It might be that it is the proximity to the onion rings that makes it a trigger so the table next to her ordering it might be fine for her.", "Did OP tell them? Or did OP ask? We don’t know, there’s not enough information in OPs post to determine that she was acting like a tyrant (which is why I asked for clarification in my own comment). \n\nThere’s nothing wrong with asking someone if they are able to accommodate if done kindly, most of my friends and I are neurodivergent and we do it for each other all the time.\n\nSensitivities in autism can be very specific, OP did say “in front of me”. It might be the proximity and the strength of the smell of onion rings that is the problem.\n\nOP can ask, the table can say no. OP needs to learn better coping mechanisms for when she can’t be accommodated. Everyone needs to learn how to communicate like adults, it doesn’t cost to be kinder.", "[removed]", "It’s not even just limited to a migraine either- speaking as someone who practically lives with migraines and sensory issues. Like sensory issues genuinely can be painful on a mental and physical level, if it was just a migraine at this point I’d take that over whatever pain of the sound/texture of paper gives me. As dramatic as it sounds it makes me feel like my brain and body are going to shut down. At least this is my experience. Not comparing it to allergies though, it’s painful but obviously not life threatening. It’s my responsibility to manage it though, I’m not out here banning people from using paper at my job (or anywhere). The person you responded to gave such an ableist take, I wish I could just turn off the bad vibes :,)", "The sister is no-BS and ultimately is correct and has probably said the same things so kindly over and over for so long she’s literally over it.", "You have no idea what she was referring to. NO ONE deserves to be treated that way. She chose to be rude. Two wrongs don't make a right.", "Unless you are allergic too it people need to learn to accommodate to it for themselves. This person didn’t just ask they made it a big deal when the person said no. You cannot police someone to not eat something that’s the big issue and the OP seems entitled to this belief", "100 times this.", "Yeah, I have sensory issues, headaches, and allergies so like I'm seriously side-eyeing that person while also agreeing with you XD", "Sorry, but YTA. I don't think I've ever encountered a restaurant that doesn't use garlic and onions. If they cause you that much distress, you're not in a spot in life to eat out.", "YTA. Very well explained by other comments.", "Not casting judgement on this one. Go to a sewer plant one day. Maybe smelling truly bad stuff can help you with the onions and garlic. Maybe if you’re around it enough you’ll get more accustomed to it.", "YTA. Your sister is correct. The world does not care about your trigger issues. \n\nWe all have to deal with things that make us stressed and irritated constantly in the real world and giving you a safe space isn't high on most people's list.", "Your mommy is wrong - YTA.", "YTA\n\n>I just thought since I was out with my friends I could count on them to give me a safe space.\n\nIt never was unsafe for you, it was only uncomfortable. Your freedom ends when the freedom of others begins.", "Sorry mate, autism isn't an excuse to control people. You can ask him not to order something, but that's it. And him choosing to order it anyway, in a public place, does not make him an asshole, and should not \"really upset\" you to the point that you approach other people to discuss it. \n\nYou need to find ways to manage this issue. I'm sure someone would have changed seats with you so you weren't sitting so close to it. YTA", "I truly loathe the smell of fish.  I also suck it up if someone wants fish.  The most I'll do is request that would someone consider trading seats with me so I don't have to sit next to it.  It is my problem and it isn't my dinner companion's problem.  My family order fish because it is rarely cooked at home and they enjoy fish.  I deal with it.  I usually decline to go to restaurants that serve mainly fish e.g. something like Red Lobster.  \n\n\nThe table next to me might also have fish.    \n\n\nEating out in public means dealing with other people.  Unless it is something dangerous then it is up to you to handle your issues.  \n\n\nYTA", "There are many places I can’t go because I don’t walk well. I can’t force the mountains to allow my walker or make my friends cancel their hike because I can’t go. \n\nYou need to understand and work with your limitations yourself. You must create your own safe places. Yta", "YTA, and it’s not even a close debate. You went out to a bar/restaurant and someone ordered onion rings. 9/10 bars in North America serve onion rings. And even if they don’t they’ll be on every burger or some other item that comes out of the kitchen. Triggers suck, sorry dude, but this is on you to figure it the fuck out.", "YTA. And UGH. \n\nSo annoying. You and the situation at hand.", "YTA. What did you want them to do, throw it away?", "I’m loving the sister", "Friends aren't support workers - they may do some things if you ask them, they may not - it's up to them. You decide if someone is matching your expectations enough to be a friend of yours. It's not like they become friends and then they'll do whatever you want if something feels intense to you.\n\nI'm going to say NTA, because if this was a nut allergy and someone was eating food with nuts in it in front of you it's potentially fatal and anyone saying YTA here would be an AH themselves. Intense dislike isn't the same as potentially fatal, but I'm sure there's plenty of people here who have strong dislikes for various things. It's NTA to get upset at things. But expecting the world to arrange itself around what upsets you, that's a different question.", "NTA. You know, these people you were  out with sound pretty young and not very nice . Any of my friends and my husband's friends wouldn't have ordered that if you’d been with us and said something. Plus, the way they spoke to you was uncessarily rude. That said, you can't prevent people from ordering what they want, and these ingredients are in a ton of recipes. Working on widening your friend circle will be crucial. Also, see if there might be any strategies that can help when around those smells. Hoping you find a friend group that are caring and that you can grow together with.", "It’s soft ESH.\n\nI am also autistic and understand just how bad sensory triggers can be, and if they were your friends then you could have just said, “sorry but onion and garlic triggers my autism” because then you are making sure to mention the reason instead of them thinking it’s you just not liking the smell. However that guy is an massive asshole, and very clearly doesn’t understand autism or sensory triggers or anything of the sort, and neither does your sister. \n\nI understand the struggle with siblings because I have an older brother who diagnosed as ADD around when I was born, and thinks that if it’s not the same then it’s not valid (also racist and homophobic but I digress). What I’m trying to say is that family isn’t always going to understand the severity of autism and how it affects people in their daily lives. It is literally a chemical imbalance in the brain which causes us to think in different ways to neurotypical people.\n\nWhile the guy was wrong for being rude about it and especially as it seemed like he partly did it out of spite, you also can’t control where you are going to encounter triggers in a world of often ignorant people. You were right to leave but the best thing to do is try to ignore the emotional impact of it and stop thinking of it as losing friends, think of it as rude people losing the grace of your company, because they were never your friends if they treat you like this.\n\nAlso if you want to meet people that can more easily understand you, try to meet neurodivergent people, (like people with ADHD or autism, etc) in school as even if they don’t share many experiences interests to you, they will most likely find it easier to understand your behaviour and if you don’t know anyone, there are groups online where you can talk about it and find people who understand you for you. 🙃", "NTA. I don’t have autism but I have bad sensory issues. Certain sounds can cause me physical pain. Especially rubbing hands. I have a small circle and everyone understand this and avoids doing this as I’ve explained my chest starts hurting very bad. You just have to be able to find people who understand. I do recommend just avoiding places you know can mess with your senses.", "I cannot stand the smell of onion rings (I am not autistic, it just makes my skin crawl).  My mom LOVED onion rings.  Not once did I dream of asking her to not order them, it’s just  not the done thing.  \n\nWhen people order onion rings, or something else I can’t deal with, I move to the farthest available seat (that is still *with* my party) and order something that is smelly in a way I *can* manage to distract my brain.", "I have OCD, and it's generally pretty mild but one big issue of mine was cups. I could not drink from the same cup twice, or if I set down some food, depending on what it was, I could not eat it again if it left my eyesight. \n\nI did have to adjust to this because tbh I hate the thought of wasting food/water, and none of my siblings would listen when I told them the special set of cups/plates I bought for myself was off-limits (screw them, btw, I spent money on special cups/plates so I could guarantee nobody touched my stuff and they started eating off my stuff), so I just had to get used to it. With something like smells, though, where there isn't a way around dealing with it, you really do have to face it like I did with cups. And yeah, it still bothers me to eat off a plate/cup if it's left my eyesight. The smell of onions/garlic might still bother you. The goal is to tolerate it.", "Most autistic people can't 'acclimate' to sensory stimulation they find overwhelming. It's like having a really painful ringing in your ears that never goes away, and it's ablelist to say we just need to deal with that and try to get over it - it's not gonna happen! I agree OP can't dictate what others choose to order, but good, supportive friends would have flagged this in advance if inviting others. It's a huge amount of work checking every new place you go will meet your sensory needs, whilst other people are not obliged to support this, many autistic people can struggle to make friends and keep them, so closing off friendships because of something as straightforward as a food order can be really devastating. Many autistic people have 'safe' places or foods where things are familiar and predictable, perhaps OP needs to have a conversation with their friends about establishing this safe space more directly - and their friends need to make reasonable adjustments if they want to keep the friendship.", "This right here. I see so often people saying they're autistic and act like assholes! Including parents of autistic children. Both use it as an excuse for all kinds of things", "As a fellow neurodivergent person with food sensitivities (among others), OP's definitely the asshole.\n\nThe world doesn't cater to us, it never will. The reality is that everyone is free to eat/wear/do whatever they want and you're not entitled to make them cater to your needs on a whim.\n\nVanilla anything really triggers me and that doesn't stop my friends or family to eat/drink stuff with vanilla when I'm around. My roommate used to light a vanilla candle in her room, she was kind enough to keep the door closed, but my way to counter it was by lighting a non-vanilla candle in my room. Everyone was happy and did what they wanted.\n\nOP needs a reality check, and his sister is not mean by pointing it out.", "I do not blame OPs friends at all. Who would want to go out to eat with someone like this? Oh awesome, tons of menu options are off limits even though I myself don’t have restrictions, and I get to pay full price! Eating out is so expensive these days, I’m getting what I want.", "And garlic! There is not a *single* restaurant I know of, or have known of, that has no onion or garlic on their menu or in any recipes. And I've worked in the service industry for 20 years. \n\nAn allergy can be accommodated with *your own food that you eat,* but there is straight up no way OP has been going out to restaurants on the reg that have no onion or garlic smells from the food they make. There is no way.", "Jain restaurants don’t use onion and garlic (and any root vegetables), a few Buddhist restaurants won’t as well.", "Thank you for putting into words what my tired brain was refusing to do. \n\nI have sympathy OP, there's certain scents/fabrics that trigger my sensory issues to the point I vomit. I don't demand or ask people not to consume or wear it because of my sensory issues. With the exception of my home as that's my safe place, but public places or their home is fair game.", "Soft YTA. Austistic here... there are numerous medications to help buffer the effects of sensory sensitivity. It sucks that we have to function in a world that often overwhelms us, but we really have no choice. We cannot police someone else's food or actions. We can ask for things, and sometimes people will accommodate (my sister taught her children very early to never scream around me because of my misophonia), but we can't guarantee it. OP, see your doctor and discuss possible medical assistance to your sensitivities if you want to continue socializing in restaurants.", "There's a difference between \"this could kill me\" and \"this smells appallingly unpleasant\". Yes, I'd act differently.", "Yeah I agree. Also on the spectrum, but this post reads like one of those teens that saw autism on tiktok, and then made it their identity.\n\nOP is definitely TA", "The real clincher is Mom's statement. Coping Strategies are all very important life skills for any person with autism.  As understanding boundaries.  All of these are skills and can take a lot of work.  Seeing how dismissive the Mom was makes one wonder how much work she put into skills with OP.", "There's a massive smell difference between, say, pizza sauce and garlic soup though.", "No I meant ceiling, like the amount that exposure will help is capped", "Just reading this is making my brain hurt and im not even actively smelling the vaporub, no its absolutely not an option, the intensity of those smells are an issue all on their own", "Yes autism sensory aversions are different from phobias.", "I’m allergic to onions. Took me ages to realise they aren’t ‘spicy’ and thus my throat should not itch while cooking them. While wearing gloves and mask like it’s onion surgery not dinner. I can’t touch them, breathe large amounts of onion and obviously eat them in any form. \n\nThey definitely smell most intense in certain settings to me. Caramelised slow cooked ones are like Yankee Candle Store level of you will smell this for weeks in your house. Onion rings are ‘fuck I walked past Lush’ level smell. Deep fried cooled crispy onions like you get in bags in Asian stores? One strong whoa whiff and then nothing. Softened until not coloured and served in dishes? Mild hint of an odour. The person I knew who ate raw onions like an apple? I’m Irish but that level of onion smell is how I imagine skunk permeates everything. It was like the worst skunk as in weed did and going to guess animal too from the onion juice spray. Grated onion is like mustard gas mixed with ‘why the hell is your air freshener just randomly blasting out puffs of chokingly strong Ax Body Spray for the house fragrance at intervals.’ Onion powder is I assume invented as an exorcism tool. \n\nActually just eaten, I rarely notice them on people or at the table. Unless they eat so many and then if you are close to them you can smell it in their sweat or saliva or other bodily fluids. But that’s thankfully rare. People are I think genetically wired to not smell it on them like the asparagus pee thing. It’s not do onions smell but more how sensitive am I to the smell especially on me?", "Parents who set their children up like this are doing them such a disservice for when they enter the \"real world\".\n\nI remember once doing housemate interviews and we picked the guy. Let's call him C. We asked about *everything*. Work, friends, goals, income, allergies then asked is there anything we should know about you? He said nope! \n\n2 weeks later it came out that he had autism. We had a house meeting and asked him what's up cause we could tell that there were a few things around the house that were upsetting him. Like our perfectly good food would be thrown out. Or he would never do the dishes and leave us to clean up after him. He wanted no noise after a particular time. You get this idea. \n\nHe explained that due to his autism had had certain sensitivities/fixations that were bothering him. We asked him WHY he didn't disclose this to us as we would have been happy to accommodate him. He just said he was good at masking and didn't see the issue. \n\nHe was kicked out within 2 months because we just couldn't reasonably accommodate him in our share house. It felt awful to do. But he was always flipping out and everyone was walking on eggshells cause he would not communicate what was triggering him. Oh, my bananas are in the bin because they're a trigger food? Are you gonna pay me to replace them with something else buddy or do you think that's just okay? I just assumed that where he grew up that was okay and if he siblings complained then they were seen as in the wrong. \n\nHe always used to complain about the bad relationship he had with his brothers. I often wondered how much they were forced to accommodate his lifestyle. He quickly moved back in with his parents.", "Clueless, pathologizing nonsense.", "Hanging out with someone who wants to decide what you can and can’t order honestly doesn’t sound fun in the first place. Especially when she doesn’t seem to realize why that’s unreasonable? I have sensory issues myself, but you can’t just impose them onto everyone around you. You just don’t go.", "You're not wrong (and also *bless you for bringing garlic soup into my life*) but I'd also say there's probably a pretty big smell difference between garlic soup and onion rings", "I’ve not allowed my ASD son to dictate everything around us.  That will not help him in the long run.  The world exists, their are people in it.  He has to live in it too.", "So then maybe you should pick a different way to socialize with your friends or make it really clear beforehand \"yes, I'd love to have lunch out, but I have a really strong aversion to onion and garlic, is that a no-go for you?\" \"ok, how about we meet for coffee instead?\"  \n\n\nI detest the smell and taste of fish and seafood, I find it makes me feel nauseated.  If friends were meeting for lunch and wanted to go for sushi, I would most likely decline and say \"can we meet for ice cream after?\" or \"I'll catch you next time, sushi isn't my thing\".", "Yes she does need to learn how to accommodate herself but is it a crime to ask?\n\nHow did she make it a big deal? I do agree that her leaving the restaurant mad wasn’t a good way to handle the situation but the person didn’t just say no they were rude to her. There was no reason for them to react that way they could have just said “no sorry I really want these onion rings”. I don’t blame her for being upset.", "NAH\n\nBut onions and garlic are really common ingredients. I think eating out with people you are not REALLY close to is not for you.", "A little ESH I guess? The onion rings friend and your sister reacted pretty aggressively, but onion and garlic are pretty universal foods. And you don't get to decide what everyone else is allowed to order, the same way they shouldn't just decide what's right for you. Try to come up with a compromise like sitting further away from the onion rings? Or even just do your best to work on your phrasing. Like finding the difference between \"you can't order onion rings because I don't like them\" vs. \"hey would you mind skipping them this time because the smell of them will make me feel sick\" but remember people are not required to say yes!", "As a ND never ask if you are the asshole. This sub will destroy you.", "Hard one mate. Find friends who do care about that extra effort. No ping banging your head against a brick wall of people who think nothing of hurting you.", "Nah.\n\nYou get to feel how you feel and other people do too. They don't have to always change their behaviors to suit you.\n\nThey can still be your friends. You can express your requests for accommodations and they can decide what they are and are not willing to do.\n\nYou removed yourself from the situation instead of having a negative experience and I think that was the right move for you at that time.\n\n You can mention how it made you feel once, but don't keep bringing it up or holding onto a grudge/negative feelings about it if you want to keep friends.\n\nI realize to you, the sensory input of a smell can be intolerable, but for most people it is a very minor thing that they can ignore if unpleasant. So they will react based on their perceived experiences and it will impact how the perceive yours.", "NTA You can request, but they don't have to accommodate you, and if they can't/don't you remove yourself from the situation. Yes, true friends that aren't ableist would try to accommodate you, but it is easier if you let them know ahead of time (before getting to whatever restaurant.) If you had a food allergy (like a lot of people have to peanuts) nobody would call you an AH for requesting people close to you to accommodate it.", "All of this.... \n\nOP, friendship is a two-way road. You ask a lot from your friends, so how great of a friend are you? How do you cater to them? Are you a friend to them? Why should they be your friends?\n\nYour mother's response isn't really helpful for you, it will only help you to grow into a resentful person that doesn't work on themselves.", "Also there's no way OP would respect the same claim coming from someone else about OP's \"safe\" foods. OP seems like they can't stand having someone else tell them that OP can't eat their favorite food because it distresses the other person. OP seems to think it's okay to tell others to change rather than leaving, but would find it preposterous for someone to ask the same thing of OP, especially if it was one of the only comfortable foods OP likes.", "A face mask with a drop of peppermint oil. It's my trick when smells stress me out. I've worn it in my own home too.", "Since I'm already suicidal, I consider this a complete victory.", "I don't think this is very helpful if we are talking about garlic and onions... They are cooking staples", "Or go out for coffee and cake to a pastry shop, those tend to not have onions", "Yeah I have a lot of autistic food sensitivities as well, I struggle with certain smells a lot and also eating sounds but I also would never act like this. Like how do you go about life in general expecting people to cater to you like this? And like others said, people will be ordering onion rings all around the restaurant, if you can’t stand onion why go to a restaurant that sells onion rings?\n\nI don’t even act this way in my own home. When my sister eats something that has a smell I struggle with she always offers to go eat it in her room. I always refuse because it’s my sensitivity, my issue so I have to deal with it, not put it on someone else. I will go in my room while she eats in the living/dining room because it’s my problem not hers.\n\nBased off the Mom’s comment I bet that the sister isn’t allowed to eat things that upset OP and is fed up with it.", "They weren't even OP's friend. They were a friend of a friend. Can't say I disagree with their assessment that they like onion rings more than OP if this is their first time of meeting them and OP is telling them what they can and can't eat. \n\nNot gonna lie I'd be choosing onion rings over OP too lol.", "That's the part that makes me the most annoyed.  The person was \"unfamiliar\" with OP's autism. Does this mean the person didn't KNOW OP had autism or doesn't know the extent of their limits, needs, and sensitivities.\n\n In this case, the two are basically the same thing, but still. You CANNOT expect a person to accommodate you if they have no clue beforehand! Maybe if they knew, they might have avoided the onion rings. But OP put them on the spot AFTER they ordered onion rings. Even if they did tell the person beforehand, though, OP shouldn't expect everyone to not do what they want to accommodate them; that's going to lead to OP no longer getting invited to hang out.  Assuming that their friends will want to hang out with OP again after this situation.", "My sibling bhad mental health issues and the other was the baby if the family by quite a few years. Guess where that left me (big sister just to make it better)? Substitute parent #3.", "My sister had severe migraines as a child. One of the many triggers was chocolate. None of us kids were allowed chocolate because it wouldn't have been 'fair' on my sister. This mostly just made me very angry at my sister.", "No one does. Him included. It's something you can't control. It's called life. No need to be rude over something you can't control.", "A person around them wanted onion rings. OP suggested that it is reasonable to expect that nobody around them may rat onion rings. That is a thing they want to do.", "That's awful. Parents who raise their children without any coping skills are downright negligent. Your ex-housemate will never be able to live with other people. The OP will probably go through life expecting everyone to be his safe space, and never learn how to deal by himself.\n\nNo parents are perfect, and I know I wasn't fully prepared either when I first moved out, but at least I had some experience and didn't expect the world to revolve around me. Life is hard enough without that.", "Then OP being downright rude and entitled is ok in your book?", "It’s only rude if they were saying this in earshot of the baby’s parents. There’s nothing wrong with complaining about day-to-day inconveniences to your friend.", "Yeah, it was a shame because he was genuinely a nice guy. He just couldn't wrap his head around how he was impacting our home. We couldn't be that safe space. It just wasn't going to work and the resentment was too high.", "You don't know that you are going off assumptions. For all you know sister is a bratty little princess.", "Hats off to you! My mom regrets catering to my brother as much as she did. Some things he literally cannot mentally process as he doesn't have the capacity (he has developmental delays, not autism), but I've been working with his job coach and the live in caregiver at his group home to get him more and more adaptable. Sometimes he can't handle things and just stays home. It's a process. But wish it had started when he was younger. Your son will be so much better off.", "If the sister's action was considered rude for you, OP's actions probably were horrendous and caveman-like mannerless. But I think your silence on the natter speaks volume: you just want to defend the shitty a-hole because you are the same.\n\nPeople like you are quick to criticize when good people putting up a boundary and speaking the truth but very lenient to the shitty a-hole party that forced those good people to be defensive in the first place. You are just a bully and an enabler.", "Did you not read my comment? Because I literally did say “It’s my responsibility to manage it though, I am not out here banning people from using paper,” which I was referencing OP banning people from eating onion rings. I know how to socialize with my friends but thank you lmfaoo", "YTA not just because of the onion rings but everyone's comment are clues to your behavior overall. \"I'm really staring not to like you\" isn't something a person would normally say over something trivial. Your friend saying your behavior is getting old and your sister calling your behavior bullshit tells me that you're probably always whining about something and get mad when people don't do what you demand.\n\nBTW your mother is just gaslighting your friends. If they don't do what you demand, they're not your friends? Friends aren't obligated to spoil someone and do everything they want, when they want it. You might take a step back and see if you're being a friend to them. Sounds like you're not even being polite.", "YTA. Both my brother and I are on the spectrum. I DESPISE the smell of peanut butter but I’m not going to keep my friend from eating a snickers bar because I might smell it on his breath. Informing people of your scent triggers is fine, but don’t get pissed off when they don’t bend over backwards to accommodate you. For example, if I’m in a large group and it’s getting way too loud, I don’t demand everyone be quiet. I inform one of my friends that I’m going to take a second to collect myself and I’ll be back in a minute. You don’t storm off like a child. Like it or not, it’s up to us at the end of the day to regulate our triggers because it is unreasonable to ask the world to change for us.", "Public spaces are public. Everyone has to accommodate everyone else to some degree. That means you too, have to make consecions. Unfortunately, most people find zero incentive to have compassion, thus, if you don't want to deal with other people's preferences, you need to make your own safe space and not leave. The real world does not make accomodations for divergence from the norm, sometimes not even when laws are implemented. I'm sorry your parents didn't give you a better grasp of this reality.", "NTA you asked them not to get them. They refused you left. You need to deal with your problems with smells but asking someone to accommodate you does not make you an AH.\n\nEdit I don't get everyone in the comments. All you did is ask and then remove yourself from a situation that caused you distress.", "People are so insensitive, your sister is the worst.I hate when people say things like that My grandson is 5 and he is autistic.I truly sympathize with you over what happened.", "Exactly! Would OP start telling other strangers they can't order certain dishes if they are sitting on neighbouring tables? \n\nI'm sorry OP but YTA. Your mental health isn't a get out of jail free card for having life the way that makes you feel comfortable. It can't always be like that and you can't expect other people to be uncomfortable so that you are unbothered. I have sensory issues myself due to a MH disorder but I never expect people to do what I want to make myself feel better at their detriment. Sometimes you just have to put up with those uncomfortable moments and quietly praise yourself afterwards for getting through it without being a nuisance to other people.", "Menthol lip balm under the nostrils might help", "You can eff off with that. The AH was the \"friend\" who was so demeaning about a distressing sensory issue.\n\nNTA.", "I agree with you.  It's a generation that have never been made to feel challenged or uncomfortable about anything, and expect the world to cater to them.", "It isn't a need", "[removed]", "Your grandpa sounds like a dick. Gotta love the ‘world doesn’t revolve around me’ but I like to give unsolicited advice and act like it’s the gospel bc I’m so smart and important. The irony.", "> they have an actual reason.\n\n  \nLet's be clear here: OP is being an AH over how he handles it but sensory sensitivity is just as much an 'actual reason' as religious reasons- more, really, when it gets to the level of physical discomfort, because he has no choice about the feeling he gets.\n\n&#x200B;\n\nDon't get me wrong he had no right to police what people eat in public, but don't dismiss sensory discomfort like that as just 'dislike of the smell'.", "When I say treat it, I am talking about coping techniques. People hate the smell of things all the time. I hate the smell of guacamole. But that doesn’t mean I am not going to let anyone at my table order it.", "Agreed. Feeling uncomfortable and working through it is a major part of growing up. The whole safe space idea is making people who are ill equipped for the real world or workplace.", "Ah Christ I dunno why I read these. What's with redditors making assumptions and insisting siblings with disabilities are a drag?", "I apply a facial sunscreen I have before I put on my mask for the smell too. 10/10", "If they said it out loud so that other people can hear, then they were being rude. Why did it need to be expressed. Of COURSE they hope it doesn’t last the whole flight; everybody on the place is hoping that, and nobody is hoping for it more than the baby’s guardians, trust me. But baby cries are to be expected on airplanes. You can only try to soothe the baby. You can’t tell it to shut up. So the comments spoken aloud so that strangers could hear is really unnecessary.", "It sounds like those ladies just “can’t handle life.” The irony :(", "Autistic person here- it’s absolutely a medical condition", "Two wrongs don't make a right.", "I used to work in behavior intervention. One of the things I did was help kids learn to cope with the environment. Like using noise canceling headphones.", "Abelist term? Are you f-ing kidding me. If you can’t handle food smells don’t go to a restaurant. People get to live even if you can’t handle life.", "I also have sensory issues and other issues that sometimes cause me to vomit uncontrollably. These combine interestingly. \n\nMy issues are smells and sounds mostly. Fish, onions and gasoline are the worst smells for me, they can easily make me puke. Sounds are awful, especially crowds or drills, and yeah, migraines, panic attacks and  randomly crying are a part of that. It is something you can't expect people to take into account though. The world isn't a safe space and you can't expect people to make it that way for you. If a person can't deal with smells or people, don't be around smells or people. It's too bad, but we live in a society where most people are neurotypical and we have to conform to that to an extent, or be content with isolation. In my opinion, the ableist take is one we really need to take into account.", "Reading comprehension is lacking strongly with y’all here. I said you cannot just fix or turn off sensory issues, never said OP was in the right. Like, I literally said “it’s my responsibility to manage it, I’m not out here banning people from using it.” It’s OP’s responsibility to manage theirs, but yea, it’s ableist to think you can just overcome a literal condition silly goose <3", "[deleted]", "“It’s my responsibility to manage it” like, I never said it was no one’s problem but mine? All I was literally saying was you can’t just turn it off?? That’s not how it works lol? Do y’all just not know how medical conditions work? Like all I was doing was responding to the person who said you can overcome sensory issues like SPD, that you just can’t do that- it’s literally not how it works. Y’all acting like I am out here banning onion rings. For someone who doesn’t care you’re awfully triggered by me literally just explaining it, you chose to engage in conversation with me. That’s your problem. Swear on jah some of y’all just literally cannot read like who let you on Reddit lmfao. I’ve literally even said I don’t agree with OP and y’all still hurt hurt over these mf onion rings like go cry about it <3", "YTA", "NTA.\n\nA lot of people don't understand autism. Especially as it's such a wide spectrum it's difficult for people to tell how much of an issue it is.\n\nIf this is a mild disgust for onions, then u need to suck it up.\n\nBut I knew an autistic guy, really nice chap. Everything seemed normal. Then someone in the room opened a pack of cheese and onion flavoured crisps and he FREAKED THE FUCK OUT! And promptly left.\n\nNewsflash for the other ignorant commenters here. People don't act this way because they \"think the world revolves around them\". I would expect your friends to understand this though.\n\nBut as this is getting in the way of your social life, you have to get past this anti-onion thing somehow. As you just can't control what other people eat.", "This. I doubt the people at the table would be the only ones ordering onion rings at the restaurant, and onions are pretty easy to smell, so would OP have had an issue with everyone else who ordered onion rings in the entire restaurant, or even them being cooked as you would be able to smell that?? Or is it more, I don't like them at my table as I don't like them, so anyone at my table can't eat them, kind of control issue. If OP can get through a meal with others in the vicinity who they don't know, consuming onion and garlic even though they don't like it, then it feels like the issue is a little bit different to how OP thinks it is", "The reverse happens with autistic folks. Bad sensations get worse over time. They don’t fade out.", "Spoken like someone who doesn't deal with sensory issues daily. It is not just hating the smell. It can trigger panic or anxiety, it is all you can think about. In a restaurant setting you kind of understand that other parties will do things that are triggering and you kind of deal with it or leave, but there should be a level of expectation that people who are supposed to care will not do things to cause that trigger. \nIt is annoying to deal with someone else's sensory issues, it's frustrating to be the person that has them. An autistic person should not have to avoid situations 'just in case', they should also not expect everyone to understand automatically. \n\nPerhaps op should have mentioned this before the meal, but that in itself can be a problem, I sat with a coffee I didn't want because I didn't want to interrupt the conversation of the baristas. \n\nAs for the sister... Siblings are often unhelpful as they see the behaviour as attention grabbing or inconveniencing them.\n\nFor clarification I and my son are autistic, my hub and daughter are not. I was undiagnosed until last year and have spent my whole life being told to shut up about spells and sounds that I find overwhelming. \n\nWhile I advocate for NT and ND to try to meet each other in the middle of issues, depending on the level of issues, it is usually the ND that have to bend. Sometimes to a breaking point.\n\nSo OP. NTA.", "I'm not sure about OP but sensory issues for myself and some other autistic people (but not all) isn't just an annoyance, it's physical pain, getting myself to touch velvet even though I know it won't hurt me feels like how allistic (non-autistic) people describe the inability to touch a hot stove so acclimation is possible but scary so it's not as cut and dry as it might seem especially with possible bad communication/inability to put feelings into words. Imo ETA, op should learn to explain why", "that's kind of a reach when it comes to the sister. i think people in this thread are just assuming that all families follow the same pattern when it comes to accommodating neurodivergent kids. she might be being a dick. you're all coming for op, but when someone's experienced rejection (especially with teens, which op seems to be) criticism should be delivered more carefully/kindly, and nobody seems to care about the sister's social blunder.", "Or NT people could meet op half way. Rather than expecting the person with a disability to change?", "I'm glad you said this, because I've read what I can about exposure therapy for sensory issues like this and everything seems to say it doesn't work. I've done ET for other things, like it can be effective for social anxiety (still needs to by the right style for you), but the sensory issues that come with things like misophonia, autism, ADHD, etc, it flat out doesn't work. You just have to avoid the thing. I lose it when I overheat, and it's rare to have a day go by where that doesn't happen at least once; if exposure therapy worked for that I'd be golden.", "i can't have onions, and the shit is in almost everything", "It sounds like she's been allowed to dictate things at home often enough to make her sister super resentful.  Which I always think does kids a certain disservice when it comes to their friends as they go out into the world thinking they can control everything - and that is not how it works at all.", "The way I see it, it's completely fair for OP to politely ask in advance/as they sit down, \"hey I have a sensory thing about onion rings, would it be ok if we avoid ordering them?\", but equally the other people are completely within their right to decline and order what they like.\n\nI think a lot of people would opt to accomodate given the opportunity, if it's brought up early enough that no one's become attached to the idea of eating onion rings. I guess unless they happen to be a massive lover of onion rings and eat them at every opportunity lol. If someone dug their heels in and ordered onion rings on purpose to be contrary *just* because they were asked, that feels like an aggressively odd response from a friend.\n\nTelling someone not to eat something *after* they've already decided they want it/potentially have already ordered is where it gets super rude, as is insisting that they aren't allowed to eat it. But just asking isn't a problem. If OP isn't happy with the answer, they don't have to stay. Ultimately they aren't allowed to dicate to others and be in control over the whole group because of their personal choices.\n\nThough conditionally, I think it depends on how much of a burden OP's sensory issues really are - is it literally just onion rings they don't like, or is it actually a whole laundry list they force their friends to navigate around *every time* they're out to eat? Because that would get tiresome imo. (With OP, I think it's probably the latter, because a lot of things have onion or garlic in them and therefore smell of it, not just onion rings...). There's nuance to this depending on social cues that I imagine someone with autism might have a harder time seeing, especially someone like OP who seems to have been catered to & coddled a lot at home.\n\nI guess it's kind of the difference between, a vegetarian asking if you want to share a vegetarian dish with them when you're eating together, versus them insisting you *have* to do it every time to accomodate them. not a 100% equivalent scenario but still", "Depending on the age of the car, it may be possibly for to adjust the volume level in the manufacturer settings. Certain OBD II adapters may be able to access those settings as well.", "Is there a Q&A I missed or comment history or something you're picking up on here? This dude is pretty obviously spoilt due to his autism and has no clue what the difference is, but I don't see anything suggesting that they have refused similar requests from others.", "When I was a bedside nurse we would sandwich toothpaste between two surgical masks. Essentially the same as this. Having said that, there’s nary a restaurant OP can go too if they can’t stand the smell of garlic.", "This.\n\n“It's easier to put on slippers than to carpet the whole world.”  - Al Franken", "No. That’s just as bad.", "I read it as grandpa calling out two ladies who felt the need to complain aloud about a baby crying. I do not have kids, but I’ve heard people do the same thing on planes and it drives me insane. Like, if I can hear you three rows over, the baby’s family four rows over can hear you. I once overheard a family loudly complain about a person with autism vocally stimming on the plane. It can’t really be helped, so I’ll keep my unhelpful comments to myself and just get through the flight.", "I mean, I've got friends I've had for twenty years that I would probably choose good, handmade onion rings fresh out of the grease over...", "They aren’t making assumptions… they are sharing their personal experiences with their siblings with autism who were a drag because they were forced to subjugate their own existence on behalf of the siblings.", "Oh, god, Greek cuisine is like a competition to see who can eat most onion and tomato. And feta.", "Crescent Dragonwagon (yep, that’s her name!) wrote a great book called Passionate Vegetarian with a great garlic soup recipe!!!", "You are making me so hungry", "Well, it has been easier for us in many ways.  I only work 24 hours a week and my husband was able to give up work to be his carer.  So we can share the demands.  It is so very draining.", "Ykno, it’s super crazy how I even mentioned (50 times now it feels like) that I literally said it’s my responsibility to manage my sensory issues and y’all are still coming for me. “You can’t expect people to take that into account for you,” *that is why I literally said it’s my responsibility.* \n\nLike my whole entire point was literally just, the person who commented doesn’t understand that you can’t just overcome most sensory issues or SPD, and their take was ableist. I never ever said that the world revolves around me or my sensory issues, respectfully, you do not need to lecture me on something I am already aware of and literally said in my comment <3", "I'm frustrated on your behalf. Seems like people are so ready to fight you for saying you can't overcome a sensory issue but you still make an effort to be responsible for it. They really can't read lol.", "\"Giving me a safe space\" really rubs me the wrong way. You are not violated. You are not abused. Stop being the victim. Just stop.\n\nYour triggers are your responsibility. Sorry, but YTA.\n\nHave you even tried to find ways around your trigger? Your friends are right, they can't police normal taste and behaviour around you. Nobody owes you this.", "Try rubbing a little Vicks under your nose. It's what we did in the prep room when an especially smelly body came in. If it could mask the stench of a floater it'll certainly cover up the smell of onion rings.\n\nBTW-YTA.  Who are you to tell people they can't have what they want?", "YTA. My college daughter recently got a diagnosis and I've been very conflicted with how best to help her navigate the world and establish a good life. In order to do that she must find a way to assimilate to \"normal\" expectations when it comes to social situations or work and this situation is a good example. You cannot expect the world to cater to your sensitivities. And as far as those friends go, why would they want to be your friend if you throw a fit when things always don't go your way?  I am trying to help my own daughter learn to \"accommodate herself\".  She has noise-cancelling Airpods to help her regulate overstimulation.  She has a mask for when smells become too much. She has quiet fidget toys to use when anxiety rears its ugly head. Learn to regulate your physical responses and life will be easier for you.", "This sucks and I'm sorry but your 'mean' sister is telling you the truth. I wonder how much of her life has had to revolve around your sensitivities for her to say it like that. \n\nYou mom might also be right, in theory, but she's not doing you any favors by implying that they should have catered to you completely if they were your 'real friends'.\n\nI don't think you're the AH, you sound young and you need perspective.", "with all due respect, you cannot expect your friends to accommodate you 100% of the time. if they're the only ones making compromises, then you are going to find yourself in situations like this eventually, where they reach a point where they won't even invite you because it's just to much of a hassle. your sister is not being mean, she's telling you the truth. YTA", "“I love onions rings and I’m really starting not to like you”. Was enough for me to tell you’re an entitled person and this isn’t the first time you’ve pulled something like this. Same with your sisters reaction. Yta", "YTA. \n\nCarry some peppermint oil with you to put under your nose. You won’t smell tte offending smells. We do this in surgery when working with bowel.\n\nManaging your sensory needs is on you. But others.", "Sorry op but YTA, you could have tried moving to the other side of the table, but everyone is right, you have to work on adapting, your friends do give you a safe space, but they also get to do things they enjoy too. You have to put in some effort too.", "YTA.  Get over yourself.", "NAH\n\nYou have issues, they don't care. Time to find better friends. \n\nAlso, seems like your sister carries a lot of resentment towards you for having had to accomodate you all your life, so maybe give her a conversation, a sorry and a thank you. That kind of treatment is not owed to you. Even if your family was super cool and supportive, not many people are willing to do that.", "NTA BUT\n\nyou cannot expect folks to account for sensory triggers in a public space unless you've discussed it in advance. They didn't handle it WELL, but my guess is they're young and don't have a frame of reference for this, or they would have set that boundary with a little more kindness.\n\nHere's the thing... You really can't expect folks on a casual setting to always accommodate sensory issues. I get them, too, and have to remove myself or at least move myself, because otherwise I'm being rude to someone else.\nAnd in this case, two things... Onion rings don't smell much like onions (you may still find that they trigger you, but it's absolutely reasonable for someone who knew to expect cooked onions wouldn't count. Because they lose the alium pungency, in a way that garlic often doesn't.) AND, if you went to a place that served them, it was almost guaranteed someone around you would be eating them even if the folks at your table didn't... So moving seats to be beside folks who were eating things that smelt safe was always the best you could do, and the furthest you could expect to be from the smell.\n\n(I'm explaining all of this on the assumption that like many autistic folks, it's more helpful to be literal and thorough.)\n\nIt IS your responsibility to handle your own sensetivities. Explain you don't dislike a person if you have to move, so they know it's about smell not people (I don't sit next to my partner when he has fish, and he brushes his teeth before kissing me if he has had foods I can't stand ) but unless you're having dinner at someone's house and everyone is on the same page, don't expect folks to avoid your ick foods.", "ESH. As others have said, you can't dictate what others say or do it public. You would have been in the same situation if someone sitting behind you had ordered onion rings.\n\nA reasonable request would have been to change seats to get away from the smell, not telling them they can't.\n\nThe other people are assholes in how they chose to respond. \"I'm really starting to not like you\" is a really rude thing to say. How hard could it have been to offer to sit far away from you, instead of making you feel ostrasized in what should have been a friend group?", "NAH - just because you have an issue it doesn’t mean that other people will always sculpt their lives around it. Sometimes they will and sometimes they won’t. it doesn’t necessarily mean that they are not your friends - just that  won’t always put your needs ahead of their own wants or needs - that's how people work. If they NEVER agree to go places more suited to you then you know they may not be your real friends   \n\n\nAre there any strong smells you do like that could overpower the onion smell and allow you to be in the same vicinity - such as a vapour rub that police officers sometimes put on their upper lip to disguise unpleasant smells?", "I don’t quite agree with everyone saying that OP was the A here. Sort of, but only for not making more of an attempt to adjust and work around things. Sounds like restaurants aren’t the right place for them to hang with friends. However their sister was a jerk, because autism sensory issues aren’t “bullshit” they are horrible, frustrating and limiting. \n\nAnd as for the friends, they were pretty damn cruel in the way they spoke as well. So either we’re missing some info or they really aren’t good friends. Because if they were they would have talked it over instead of just saying “we’re getting tired of you”. \n\nSomeone who’s autistic definitely has to work hard to get around their limitations to be out around people and things, but true friends would also try to accommodate them within reason. Key being within reason. Almost every type of cuisine has garlic and onion so that isn’t really reasonable to expect to avoid. Now if they had said “I can’t stand seafood” and then the friends only picked seafood restaurants that would be different. \n\nTl:dr need more info, autism is complicated. Possible everyone was the AH here.", "ESH. Your friend's response to your condition was dismissive and wrong. I get that they're probably annoyed with having to monitor what they do/don't do around you, but they could have been more empathetic. Unfortunately, you chose to be in a place where you'd most likely smell something you can't handle. They shouldn't have to not enjoy a meal because of your condition.", "NTA. People seem to be assuming that sensitivity to smells or any other sensory issues in autism is optional. \n\nYou know how security services/army use sound to 'torture', like blaring heavy metal at stand off or whatever. That is what a sensory issue is like. It's all you can think about. \n\nPeople saying OP should get over it are the ah", "It doesn't stop people at nearby tables from ordering onion rings, either? Was OP planning to berate them for it, too?", "Ya like what food doesn’t have garlic or onions? It’s in almost every single thing. If OP doesn’t learn to deal with this, their in for a lifetime of being annoying and fighting with people for eating the foods they want - completely unreasonable. Maybe some kind of exposure therapy or something? This is definitely something OP needs to learn to deal with:", "I wonder whether it was just easier for mom to accommodate the child because it simply made her (mom's) daily life easier? No constant battling/arguing etc. This mom had at least one other child to raise. She can't be spending all day fighting against one child. No shade from me on the mother here. She's trying her best, I bet.", "Where mother prohibits \"mean\" sister from having onions or doing anything else that bothers OP.", "I loathe the smell of onion. I have an allergy (although it’s not airborne) and I think it makes me extra hateful towards the smell. It can kill my appetite. \n\nBut my brother loves onion rings. And as kids we had to sit beside each other because our parents liked to have a little cuddle in the booth seats. \n\nSo I started carrying a hankie, lol. It fit in my purse, had a spritz of whatever strong smelling body spray I was into at the time, and if my brother’s onion rings reeked too bad, I’d cover my nose and mouth and say my allergies were bugging me. \n\nI tried to hit the perfect spray ratio where it could only really be smelled it the hankie was right against my nose, not sure I was successful but it took our parents years to figure out what I was doing. My brother knew though, he’d warn me to grab my hankie before cutting fresh onion at home. \n\nLavender eucalyptus was the bomb for this, btw. The scent doesn’t travel far, but it’s a warm scent that really blocks everything else. Citrus scents are pretty good too, as is White Musk Fantasy although with that you run the risk of permanently associating it with Chili’s. I found actual perfume tended to be hella strong for awhile, and then get kinda musky and old smelling without the strength to block an unpleasant odor. So body spray was the right scenting choice IMO.", "I have a friend who is allergic to garlic, so I can speak with some authority -- it is hard as hell to avoid in modern restaurants.", "Yeah I feel this. I despise the smell of ketchup and have been in situations where people absolutely smother their food in it. Moving and just trying not to focus on it is the only real option. It's not fair to police how someone eats their food.", "Therapy *can* help reduce the aversion but it's not necessarily gonna be curative. There are other non-exposure strategies too to help manage. It's mostly to help folks manage their sensory issues so that folks *don't* wind up just trapped at home as a prisoner of their own sensory struggles. \n\n\nIt's disingenuous to suggest nothing can be done to improve the situation, although OP's mileage may vary. And no, this is not a suggestion to \"just force the kid to eat the thing until they stop reacting\" ABA horror story style either. \n\n\nSource: Neurodivergent with sensory issues", "I'm allergic to onions, so really not keen of the smell, because I associate it with the stomach cramps, I get from eating them, but I don't think, onion rings are very smelly. And either way, it is everyones right to eat, what they want. I would make an exception if someone is so allergic to a specific food, they could die by Just accidently eating the smallest amount. In that case, I wouldn't order that food to be on the save side for that other person.", "Yeah, tbh if I were going out with a friend and I knew they had an aversion to something, I probably would avoid it. Just like me and my friend wouldn't pick a place where I didn't really like anything on the menu.\n\nGoing out with an individual friend is one thing, when you go with a group you have to take things as they come. Some people are going to know you better than others. You might end up in a restaurant that isn't to your taste, but the rest of the group likes. That's just life.", "I also have an aversion to certain fabrics. The feeling of soft silk is similar to the feeling of nails  scratching on a chalk board and can actually feel like pain to me. I’ve had people laugh at me when I said it and I guess it is kind of funny when you think about it. I am in my 40’s and was never diagnosed but both of my kids are diagnosed neurodivergent and through their experiences I’m coming to understand myself. I always felt stupid when I’d almost melt down as a young person if anyone next to me wore silk. It was embarrassing. I do understand OP’s problem but I think they will have to find some coping strategy for next time. I would never tell someone not to wear their favourite shirt just because it was silk.", "what have you tried?", "i 100% agree, especially as someone who also has sensory issues (not towards smells, but sounds and textures.) i’ve also heard that many people gaining back their smell after covid develop sensitivities towards things like coffee, garlic, and onion, and they smell absolutely horrid to them, so i’m surprised at the amount of rude commenters. OP is the AH, but not at all for their sensory issues, just their lack of foresight and rudeness.", "As an autistic adult, I’ll be a dick for you! OP is an overly controlling asshole. Part of being an autistic adult is learning how to manage sensory issues lol", "My god, why on earth would he choose to live in a shared  flat??!", "Reminds me of a kid in college, except it also extended to school. He was never taught to have the slightest filter and would constantly say very inappropriate, sometimes sexual, things in class. Which was weird, because his family is Mormon. Someone I knew was a tutor in the tutoring center and helped him with a few of his classes. When the kid started, he expected the tutors to do his work for him, because that's their job. Somewhere along the line, teachers, parents, or other helpers just started doing work for him and he came to expect that in all classes.", "We used Vick's. Same idea. Eventually I got so used to the smells of gangrene and C-Diff I didn't need to use it anymore.", "It's a fairly common side in most restaurants though, it's going to be hard to avoid them and theres also no guarantee that they'll be ordered even if they are on the menu.", "Do you actually know what autism is?", "I understand that. when it's a lower limit instead of an upper one, it's called a floor. But I also like using words in ways that make sense but aren't expected. I like how my brain interpreted \"lower ceiling\", not trying to tell you you should have used floor.", "Look it's a DBT licensed therapist, here to give us free individualized action plans on how to cope with sensory problems! Everyone line up for a free session", "I wouldn't blame you if they're quality ones lol.\n\nReminds me of that whopper campaign where you'd unfriend 10 people on Facebook and get a free one.", "Challenge accepted!", "You go I have learned to cope I went from biting myself to now having the skills to function in life. There is always a way that works everyone just has to find what works for them.", "At some point when you’re older, you’re going to have an unfortunate moment where you realise that “I don’t care about anyone’s problems” is an attitude that makes you unpleasant to be around, and doesn’t make you sound cool and independent like you think. Maybe it will be when you discover nobody around you cares when you’re really struggling with something, because you’ve only made friends with other people who think being selfish is cool. Maybe you’ll be luckier and it will be when you realise you really do care about someone’s problems, but you’ve never learned how to express that or offer support. Maybe it’ll be when you get dumped or divorced over it. For your own sake, keep an eye out for the signs and try to practice empathy; it will make the “find out” a little easier for you to cope with when it hits.", "Honestly thank you because I was starting to wonder if I’m just going insane or something?? Like I was just trying to tell someone that they are entirely incorrect about how this works- I wasn’t tryna take away nobody’s onion rings. Like, they even keep insisting on telling me that I’m responsible for it and it’s not their problem and I’m just like… yeah that’s literally what I said???"]}