{"id": 19039, "submission_id": "141fkpi", "title": "AITA for increasing my brother's rent?", "selftext": "I (24M) got custody of my younger brothers 3 years ago. They are currently 13, 17, and 19. Around 1.5 years ago we moved from a 3 bedroom to a 4 bedroom house, so that everybody could have their own rooms. Before that the 17 and 19 y.o were sharing the biggest room and the 13 y.o had a little shoebox room.\n\nWhen we moved it was on the condition that the 19 y.o (who was 17 at the time) would help cover part of the rent. He had already dropped out of school and was working full time in an apprenticeship and had another part time job. He agreed to the terms happily. I calculated how much he would pay me towards rent based on his weekly wage for his apprenticeship. He gave me what amounted to roughly 10% of his wage. This 15% excluded what he earned from his second job.\n\nSince I decided the amount he has changed jobs and he's currently earning £24k a year plus money from his second job and other work he picks up. Last week I asked him if he would be willing to pay more towards rent/utilities and paying £350 a month. That figure would be for rent and utilities so very cheap especially for our area. I don't just see this as him paying for his keep but also helping provide for his younger siblings as well.\n\nHe argued a little when I brought it up but I pointed out that his other options were paying for his own rent and utilities for his own place and this was the best deal he was going to get, he agreed to my knew terms. Our sister (23) however, was very unhappy that I would hike up his rent and said I was being cheap and that as I could afford to keep and the same price so I should. She says I'm exploiting him for his money when he still young and that I'm acting like our parents (both deadbeats). Am I being an asshole? If there is 2 adults working fulltime in our home why should I be swallowing 90%+ of the costs?", "created_utc": 1685973755, "permalink": "/r/AmItheAsshole/comments/141fkpi/aita_for_increasing_my_brothers_rent/", "score": 34, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Increasing my brother's rent to make things easier on me. Our sister thinks I'm taking advantage.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "I am intrigued by this 23 yr old sister who suddenly pops into the story at the end of this post giving you a hard time. Is she willing to chip in to cover your younger brothers' living costs, since she seems to have strong opinions on how you do it? At this point, 23 Sis is older than you were when you assumed custody and so much financial burden at such a young age.\n\nAs you say, as time passes, your brother is no longer a minor and is increasingly an adult in the household -- so if he wants to continue to be in the household, it does make sense he would pay rent. Parents with adult children at home charge them rent all the time, so I don't understand why people would  give you (a sibling, still relatively young yourself, trying to support all these brothers!) a hard time for this.\n\nI'm leaning towards NTA.", "NTA if he is earning more it makes sense for him to pay more, especially since it is still less than what he would pay by renting his own place", "INFO: Is your sister just criticizing you, or is she being helpful in some other way?\n\nPersonally, I think you should not increase his rent above the proportion of what the new rent is to the old. But, instead, stipulate he needs to open a retirement investment account that gets monthly contributions.", "NTA - you are supporting 3 younger siblings. What is the sister doing about this? She could help, too.", "NTA - how can you be acting like your “deadbeat” parents and yet raising their other children? Seems like, to act like them, you’d have to pass off the responsibility to your sister.", "NTA cost of living has jumped dramatically in the last few years so asking the other adult in the house to help seems only logical. It's not like you are seeking to profit from him. I don't see why your sister is complaining, it's not like your siblings are your children, sounds like you are doing an admirable job in a bleak situation.", "NTA - And I would say since your brother isn't a minor and can therefore live where he wants, tell your sister that if she can let him move in have him living for free at her own place. I'm guessing her tune will change.", "NTA, he chose to work full time so time to pay his way. If he was going to school full-time then I could understand him not paying full price. Tell your sister if she wants a say then she can contribute to the household.", "Info: how much are you making in comparison to him? And to confirm, he isn’t under you custody anymore, right?", "NTA, if the young man wants to be an adult then he needs to contribute fairly.  Given you have assumed custody of your then minor siblings, that speaks to your character.  Given you are quite young yourself, the burden should not be yours to bear alone.  If your sister has something to say, then she should pony up to help you... clearly she isn't so therefore she has no input into this.", "NTA. You are not his parent. It’s not your job to shelter him from reality. Grownups have to pay rent", "NTA. If your sister has a problem with it she should volunteer to take over the responsibility of your younger siblings. (Edit:typo)", "NTA\n\nIt isn’t like utilities and rent haven’t gone up over the last year. If he wants to live, like everyone else, you need to pay the bills. Why would the increase fall solely on your hands if there is another working adult?", "NTA your brother is 19, not 9 and has been an adult for a year. I'm assuming when brother # 2 turns 18 he too will be picking up part of the rent. Since your sister has shouldered none of the financial responsibility I have no idea why she even has an opinion", "Definitely NTA. It's time for the 19 y.o. to learn how the real world works.", "YTA he doesn’t have custody. YOU have custody, YOU are responsible, not him.\n\nVery clever of you to veil the real reason you want him to pay more in your post. If you want to raise his rent, you can do that as long as it is legal, do look that up, but drop the reasoning that it’s because you want him to help pay for your responsibilities.", "YTA\n\nYou got custody, which in turn means you're the parent of this children. The 19 year is not responsibly for helping provide for his siblings like you're arguing.  Let him save up money so he can move out on his own and grow as an adult. Stop parentyfying your brother into helping care for his siblings.\n\nNow, I want to add that yes, he's and adult with a job. He should be contributing a little to help pay for the apartment/home. However, upping his contribution post-agreement is an AH move. When renting an apartment from someone, and you get a better paying job during the lease, the landlord cannot just decide to up your rent because you can, \"afford to pay more.\" That's not how this works.", "NTA, maybe your sister should help out more, if she is going to be so judgy.", "[deleted]", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (24M) got custody of my younger brothers 3 years ago. They are currently 13, 17, and 19. Around 1.5 years ago we moved from a 3 bedroom to a 4 bedroom house, so that everybody could have their own rooms. Before that the 17 and 19 y.o were sharing the biggest room and the 13 y.o had a little shoebox room.\n\nWhen we moved it was on the condition that the 19 y.o (who was 17 at the time) would help cover part of the rent. He had already dropped out of school and was working full time in an apprenticeship and had another part time job. He agreed to the terms happily. I calculated how much he would pay me towards rent based on his weekly wage for his apprenticeship. He gave me what amounted to roughly 10% of his wage. This 15% excluded what he earned from his second job.\n\nSince I decided the amount he has changed jobs and he's currently earning £24k a year plus money from his second job and other work he picks up. Last week I asked him if he would be willing to pay more towards rent/utilities and paying £350 a month. That figure would be for rent and utilities so very cheap especially for our area. I don't just see this as him paying for his keep but also helping provide for his younger siblings as well.\n\nHe argued a little when I brought it up but I pointed out that his other options were paying for his own rent and utilities for his own place and this was the best deal he was going to get, he agreed to my knew terms. Our sister (23) however, was very unhappy that I would hike up his rent and said I was being cheap and that as I could afford to keep and the same price so I should. She says I'm exploiting him for his money when he still young and that I'm acting like our parents (both deadbeats). Am I being an asshole? If there is 2 adults working fulltime in our home why should I be swallowing 90%+ of the costs?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "INFO: did you receive any support from the state for taking in your minor siblings? Do the parents pay child support, formally or informally?", "NTA. You're being a parent well before your time and need financial support.  This is what teaching financial responsibility looks like. Kia kaha", "NTA \n\nYour brother is now a legal adult. You are not getting money from the government for him anymore. He is an adult and part of that is understanding the responsibilities that come from being one. Your request is not unreasonable it seems and will be much better than the offers around the area it seems. Ultimately you were his guardian until he was 18 everything after was out of compassion. \n\nI'd like to know how your sister would feel about taking your responsibilities and being the only provider for 3 people.", "NTA. I see you framing the rent increase being partially about your younger siblings a little differently than the other posters. The increase isn't you pocketing the money for fun stuff- I can't imagine you're making a lot of money at your age.  If the amount you quoted is on par or lower than market rate, you're being fair if not generous.", "Idk I was going to go with N T A but then in a comment you stated you get money from the state to help with costs. You also had him paying rent as a minor at 17 when you would still have gotten money from the state to help.", "He's no longer under my custody. I earn 35k a year but also have other side jobs.", "The increase would fall solely on OPs hand’s because OP has custody. 19 doesn’t. It’s OP’s responsibility.", "The only reason OP wants the brother to pay more in rent is because he feels that the brother should share responsibility for the younger siblings that OP has full custody of. He’s trying to pawn off his responsibilities on his younger sibling.", "I think OP's prime responsibility is to the minor children he still has under his care. So if that means raising rent or getting a different renter who will pay market value rent for the room, then he can and maybe even should do that in order to suppor the kids under his custody. In the comments he says he's only making 35K, so OP is probably straining pretty hard to actually provide for these youngest two children he's responsible for. At this point, since the other bro and sis are adults, OP just does not have the same responsibility help subsidize them that he does to steward things in such a way to be able to support the two minor custodial brothers.", "If he would raise it to an absurd high level I would agree with you, but a lot of parents expect their adult children to contribute according to their means. 350 of more than 2000 a month is not parentyfying him. \n\n\nA landlord can pretty regularly decide to up the rent- if you earn more or not. Ops approach is a family approach. Do you think he would be able to rent a room for that price? \n\n\nYou lack any empathy for op here. 3 minors at 22/23 is hard core.", "He lived there for 2 years with no rent increase. That is pretty much unheard of.", "So he should be kicked out and pay out the ass to live on his own?", "The guy sacrifices his own young adulthood to care for his siblings and keep his family together, and he’s an asshole when another sibling is expected to contribute, as an adult who is making money and living with them?  Absolutely not.  Bad take.", "He is 19, not a minor, and it was a condition they agreed on when he was a minor.", "It's not ideal, but how was  a 21 yr old supposed to support himself + three brothers? (not sure if OP was ever supporting then 20 yr old sister too). It's crummy all around when parents are out of the picture and you have siblings taking care of siblings. So I'm not sure what you expected him/them to do.", "Well, minor sibling dropped out of school and had 2 jobs. Make adult decisions, have adult responsibilities.", "His minor sibling decided to drop out of school and work full-time. If you want to be an adult then you need to act like one.", "I get around £1500 a month from the government for the 2 youngest. Nothing from our mom or their dads.", "I just wanted to add that I think what you are doing is admirable also.", "NTA, he should be contributing more than 10% now that he has a young adult’s salary and you don’t have to care for him financially. You’re already doing so much for your other siblings which is admirable!", "I don't see how this is an argument against raising rent. If simply considered as a landlord (where OP and 19's relationship to the minor brothers is irrelevant), then any landlord \\*would\\* raise rent/utilities as costs go up.", "Having more money helps reducing the burden- obviously. \n\n\nIt doesn't change the fact that 350 is far below market rate in most places and op probably has rent/morgae to pay too. \n\n\nSibling is an adult and most parents of adult children expect them to contribute within their means. The borther makes more than 2000 a month. 350 is less than 18% of his income. He still should be able to save some money and everything. For most people living is 33% or more of their income.", "That's not the vibe I'm getting. It sounds like OP would be okay with his 19 year old brother moving out and paying his own separate adult life. (Sounds like that's what the adult sister in between is already doing). So it doesn't seem like OP is trapping him there. Presumably OP could rent the room to somebody else who will pay market value, and then OP would have more income to support the rest of his brothers who actually are his custodial responsibility to support.", "19 is old enough to move out and be an adult  or pay rent- OP got the responsibility of raising his siblings and keeping the family together simply because of his age, nothing more. He did his duty above and beyond, supporting his siblings is not an open ended situation and shouldn't be treated as such. If 19 lived with his parents I'm sure everyone wouldn't object to him paying rent to his parents, why is it so wrong for his older brother to ask the same?", "I'm not buying it. OP is literally using the argument that they would be helping to, \"provide for their siblings.\" What OP is doing is guilting their siblings into paying more money to them so their financial situation does not change and forcing them to basically live there so OP can keep siphoning money off them.\n\nI know, because I've been in a situation like this with my parents and it was nearly impossible to move out.", "You cannot tell me that OP is not getting some form of assistance from their government. Like you said, it's \"hard-core.\" \n\nThe reason I say \"parentyfying\" is because of the arguments OP is using to justify this are completely wrong, which is why I believe they are the AH.\n\nAnd a landlord cannot simply raise rent midlease unless it's something like a month-to-month lease.", "Completely irrelevant. OP and the brother agreed on an amount brother would contribute. OP is ONLY bringing this up because brother is now making more money and using the argument that it would \"help provide for their siblings.\"\n\nIf OP wants the brother to contribute more, then OP should get the brother to sign the lease agreement alongside them. After all, they're both adults, right?", "He WAS a minor who should not have been paying rent to his custodial parent/guardian.", "I do not expect someone who agreed to get custody of three minor children to expect any of those minor children to financially support the household.", "Then OP shouldn’t have agreed to be his legal guardian.", "Then you were wrong to charge him rent when he was a minor. It’s okay to charge him rent as an adult but you should only be charging him the cost of his room, not trying to get him to subsidize the cost of the kids.", "It’s not legal for a landlord to raise rent because they want to buy something personal with the money, what court would recognize that?", "How can it not be the vibe you are getting when it is explicitly stated as such in the post?\n\nOP says he wants 19 to help provide for his younger sublings. 19 got a tiny windfall in the form of a better job and that’s the whole reason OP wants more money and OP is using the reasoning that 19 should provide for his siblings. Sister is right. It’s exploitation.", "Maybe I'm missing something. In your case or similar situations, what was preventing you from leaving?\n\nI think 19 yr old brother CAN move out, but evidently he is choosing not to because it's still in his own financial best interest to stay get below-market rent. If he wants and can afford to live independently, presumably he would do so... After all, it sounds like 23 Sister has been doing precisely that.\n\nYes, OP does say that he wants to use the rental income to support his other dependent brothers, but why is that worse than if a landlord had a renter and use the income to buy himself video games, baseball tickets, or anything else? I think most landlords use the rental income as, well, income, that they put towards their own desires or dependents, so that doesn't seem all that surprising or damning to me. I just don't see much evidence that OP is trying to fleece his brother to go hire hookers or something. If he's only making 35K as he says in a comment, then he likely really just trying to cover basics, and it's hardly wrong to use rental income (whether from a relative or a randomn unrelated renter) to do that.", "There is month-to -month and there are yearly renew leases. Both would be up now.\n\n\nThe brother doesn't have a \"you are bound forever because you are my brother\" lease.\n\n\nThe brother doesn't even pay 18% of his income as rent. It is still a great deal for him. Most people pay 33% or more.", "It really isn't irrelevant. OPs expenses have probably increased a lot in the last couple years like they have for most people. Agreements have to update with the times.", "Not just the lease agreement, but the custody agreement as well.", "1) you don’t have enough info to make this judgment and 2) that’s not OP’s question so let’s stick to what is actually being asked of us.", "He dropped out of school, and he can pay rent. It would be different if he stayed in school.", "You have a weird mentality that, in a situation of mostly deadbeat and absent figures, you opt for criticizing the sole person in this family who seems to be trying to take responsibility and care for others.", "What is your beef? On the one hand you want OP to cover his brother's financials even though OP is under serious strain raising all these brothers at such a young age himself. On the other hand, you want OP to have abandoned his 17 yr old brother and you think he should have just dropped the rope rather than be legal guardian? Like, are you trying to sink the raft for these guys?", "We don’t know any of the subtext around how that happened. As I see it (and I told my kids the same thing when they were that age), if they choose to drop out of school, they must have a job and pay part of the bills. And for me, it would have been a percentage relative to how many people lived in the house. (For instance, if there were five people, the one in question would be responsible for 20% of the bills.) \n\nFor me, it disincentivized dropping out of school, and taught a valuable lesson in paying your way. Plus, it was WAY cheaper than renting their own place.", "If he made the decision to drop out of school, then he can get a job and pay rent. It would be a whole different story if he didn't drop out of school.", "Maybe it works differently in differert countries? I'm in the USA and our landlords raise rent all the time for all kinds of reasons, but usually rising costs/property taxes/inflation -- and renters either have to pay the new lease rent or move elsewhere. In your country, do landlords have to get some kind of court approval to raise the rent? I've never heard of that, I admit! But I'm intrigued to know that it could work so differently.", "And there was a whole lot else in the post too about 19 deciding to stay because it was actually to his benefit to get below-market rent. Both at 17 and at 19, this brother seems to have chosen to stay because it was actually in his own best interest to do so.\n\nI guess I am not inclined to use OP's hopes for the income (supporting his brothers) against him. Presumably, a landlord could want and could put renter income towards all kinds of purposes-- to gamble, to go to Disneyland, to buy an Xbox, and it seems not realliy relevant for us to judge 'why' he wants the income for the household. I rented for a long time, and I have no idea what my landlords put my rent payments towards in their lives!! So in the big scheme of things, putting the rent towards support of one's younger brothers seems like not that evil or selfish of a rationale.", "When I turned 18, I was pretty much cut off financially aside from my phone line. I had to pay my own rent for the house, which amounted to $400 a month, my own car insurance, gas, food, etc on top of also going to college.\n\nI was only making around $1000 / month. This made it extremely difficult to move out on my own into an area where the median rent at the time was about $1000 for a single bedroom apartment. It took me 4 years to finally squander enough money to leave and I had to fight my mother for the phone PIN to have my number transferred to my own carrier as my number was tied to many important accounts and recovery methods.", "Then nobody should be making any judgements on the post at all by that logic.", "He’s not trying to take responsibility, he’s trying to pawn responsibility off on someone who doesn’t share that responsibility.", "No beef. I don’t think it’s acceptable to put financial burdens on minors after you have agreed to carry their financial/legal burdens.", "Also, in which comment did I state I wanted literally any of that?", "We absolutely know that OP agreed to take custody, what are you talking about?", "Did the state still include him as a minor child in their calculation of how much support to give you when he dropped out?", "I meant in the US. Your landlord has to have a legal reason to raise your rent, they can’t do it because they want a new xbox.", "Yeah of course there was a whole lot else in the post, OP is trying to make themselves out to be the good guy. Wonder if he’s getting any money from having custody that he’s willing to share with 19.", "It sounds like there are two different kinds of difficulties here:\n\n>I had to fight my mother for the phone PIN to have my number transferred to my own carrier as my number was tied to many important accounts and recovery methods.\n\nThat first difficulty was mother-induced, and was a very problematic and abusive manipulation  on your mother's part. I don't think we have evidence of OP doing this kind of thing to his 19 yr old brother.\n\n>I was only making around $1000 / month. This made it extremely difficult to move out on my own into an area where the median rent at the time was about $1000 for a single bedroom apartment.\n\nThis difficulty was not parentally induced, but was just a function of you not making enough income to survive independently yourself. It sounds like OP's brother may be in this kind of income vs. cost-of-living sitution where \\*he\\* can't afford to move out, but that is not OP's fault.", "No, by that logic, you need to answer if he is TA or not for charging his adult brother rent. It’s really not that hard. You might be the only one who didn’t get it…", "Did you want OP to send his 17 yr old brother to foster care or something?", "Yes, but we don’t know WHY. The details of that might change the tenor of the situation.\n\nEither way, I feel like 10% of the rent, and even a higher amount as the sibling makes more money, is entirely reasonable in my opinion.", "Usually, in the US, if you are not a student (except young children), you do not get those benefits.", "I think we're on the same page then. Landlords raise rent because of stated reasons like rising inflation, property taxes, maintenance costs, etc. And then they take the income and they spend it post-tax on whatever the heck they want (Xbox or supporting minor dependents).", "Question, where does OP say that he wants to raise the rent to afford a new xbox?", "How on earth is this guy taking care of his entire family not a good guy??? If 19 doesn’t want to help he doesn’t have to, but he also doesn’t get to keep living almost rent free. Good grief some people here are really grasping", "Why do you keep implying that I want literally anything in this scenario? It’s weird.", "That doesn’t change the fact that OP agreed which was my entire comment. It’s okay that we disagree.", "Ok, but the question is is OP the asshole, and due to his states reasons, he definitely is.", "It doesn't. OP is actually just trying to support his younger brothers/ legal dependents. But people are judging his reasons, upset because he would dare to use rental income to do that.", "That’s NOT the question! He’s a GREAT guy, but in THIS matter, he’s pushing his responsibilities on another person with whom those responsibilities DO NOT belong. If you can’t understand what the question is you shouldn’t be here.", "Well,it's just mean to criticize somebody (a 20 yr old trying to support three younger siblings) for doing their best, when you have no better workeable solution for them.", "Absolutely! If everyone always agreed, this sub wouldn’t exist, and we would have to find something productive to do with our time.\n\nEDIT: wording", "I really don't see why. With OP's strain to support his remaining dependents, it seems to me like OP's other option is just to kick out this adult brother and get a renter who will pay area-normal market rents, which would make his own life trying to fulfill his fiscal responsibility to his remaining minor dependents a lot easier. And you're calling him an asshole for not doing that?\n\nAnyways, this feels like a stupid conversation with people, like the 23 yr old Sister, who just want to bash OP for trying to do his best in a crummy situation while they offer no better solution or aide to help. Peace!", "I understand the question very well, but to quote your comment “op is trying to make themselves out to be the good guy”, and that’s what I responded to. I also responded that if he doesn’t want to take responsibility he doesn’t have to and he can leave and pay x5 rent if he wishes. Or does asking 19 leave if he doesn’t want to pay up make op a bad guy again?", "It’s not “mean” when OP is literally asking for moral judgement.", "It feels to me like a conversation with people who are gullible and naive. Have a good day.", "Yeah, the good guy IN THE STATED SITUATION.\n\nYeah, I think OP SHOULD ask 19 to leave, so that 19 can find a fair situation wherein he is not being taken advantage of.", "OP is asking for moral judgment on the question of rent NOW (when brother is a 19 yr old adult).\n\nYet you are giving the YTA judgment on the situation of OP charging the brother rent when he was 17 years old. So you seem less interested in answering OP's actual current question for AITA judgment, and more just interested in criticizing him for having asked his brother to chip in for rent while a minor (which btw, according to the post, he happily agreed to) in a situation where OP was clearly in difficult straights but trying to do the right thing by all of his vulnerable brothers. So, yeah, that seems mean to not address the actual question and instead a) criticize somebody for some other issue they didn't ask about while b) having no workeable proposition for how they should have done otherwise in a really crummy absent-parent situation."]}