{"id": 19077, "submission_id": "141tpco", "title": "AITA for refusing to fund my sons wedding after his fiancee broke a photo of mine and denied it?", "selftext": "My son (30M), I'll call him Jack, is getting married to a girl I'll call Vanessa (24F). Jack has been married once before, and I completely covered the cost for his whole wedding. He met Vanessa online on a dating website around a year ago.\r  \n\r  \nThe first time they met in real life, Vanessa met both Jack and me. She was, in my opinion, extremly judgemental the whole time. Didn't eat my food, kept giving me \\*the look\\*, whispering things about me to my son, etc.\r  \n\r  \nEvery single time I met her, she'd be extremely rude to me. She was saying stuff about my weight, and things I don't even want to mention on here.\r  \n\r  \nA few months ago, he proposed to her. He asked me to fund the wedding, as they both needed as much money as they could get because they're going through a tough time financially. I funded his last wedding for the same reason. I agreed, because I'm retired with lots of saved up money.\r  \n\r  \nThis is where things get sour. (A couple of days ago) I wasn't home, but I have camera set up looking into my hallway from my front door. I have a display with a little picture frame of my mom, and I put fresh flowers there every week to honor her. Vanessa has a key to my house, and can enter whenever she'd like.\r  \n\r  \nWhile she was walking, as I could see on the camera, she turned to face the photo of my mom, and threw the photo and the fresh roses I had bought the day prior onto the floor. She continued walking after that.\r  \n\r  \nWhen I got home, I saw the picture shattered on the floor. I went to go check the cameras, and lo and behold, I saw what Vanessa had done. I immediately called her and she started denying it, saying it was an accident.\r  \n\r  \nI would have forgiven her and forgotten the whole situation, if she hadn't started telling my son that I was framing her. He called me and yelled at me for at least 30 minutes straight. That was my last straw.\r  \n\r  \nOn that phone call, I told him I wasn't going to fund their wedding. I hung up, and we haven't spoken since. I've felt so guilty for the past couple of days. I don't know if I should apologize or not. AITA?", "created_utc": 1686002969, "permalink": "/r/AmItheAsshole/comments/141tpco/aita_for_refusing_to_fund_my_sons_wedding_after/", "score": 943, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I stopped funding my son's wedding over his fiancee breaking a photo of mine. She said it was an accident, and I'm starting to think that I fucked up.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "You're absolutely NTA. I don't believe it was an accident, but if it were, why didn't she pick the things up? why didn't she tell you and apologise?\n\nJack can marry this woman if he wants but you don't have to facilitate it. They can pay for their own wedding like grown ups.", "NTA show your son the video so he knows who he's actually marrying.", "Upload the video to YouTube and share it.", "Nta, but have you even had a conversation with your son about he she speaks about me. I can’t even imagine my son choosing to be with someone who would treat me with such disdain unwarrantedly", "NTA\n\nYou have proof on camera. This woman is very manipulative and wanted to cause some sort of rift. \n\nI would change the locks so she doesn't have a key.", "Did you also get yourself punching your daughter in law in the chest on video? And what happened with your other son that you cut off two months before his wedding?\n\nDetails man.\n\nEdit: seems those posts are deleted now.", "Why didn't you just show him the video", "NTA\n\nAlso, this lady is lying to your son. I think he needs to be told so he knows what he's getting in to. It might not be nice and he might not like you for it now, but if you don't she's going to find more and more ways to drive a wedge between you.\n\nEDIT typo", "Nothing to apologize for. Nta", "NTA op show your son the camera footage of its still available. If he still defends her then good riddance to the both of them. Clearly your just an atm to your so if that's how he feels.", "NTA.  Vanessa has been rude to you and then seemingly intentionally destroyed a precious photo of your mother.  Outrageous!   Let these two mooches fund their own wedding.", "NTA, as others have said, send your son the video and change your locks, I wouldn't waste time trying to get the keys back.  \nDon't apologize, you did nothing wrong, your son just has bad taste in women.", "NTA, you should show your son that video. This woman is dangerous.", "NTA\n\nLogic helped you make the right decision. Don’t let guilt manipulate your feelings to where you make the wrong decision.\n\nShe sounds awful. Send him the video if you can. Tell your son you’re saving up to fund the divorce.", "NTA... you have proof of what she did. Send the video. I wouldnt pay for your son to marry a liar.", "NTA\nShe sounds horrible.  They can elope.", "NTA.  Don't give them a penny.  You already very generously paid for one of his weddings.  They can downsize to a wedding they can afford.\n\nBTW, time to change the locks and not give them a key. Don't be a doormat.", ">Didn't eat my food, kept giving me *the look*, whispering things about me to my son, etc.\n\n>Every single time I met her, she'd be extremely rude to me. She was saying stuff about my weight, and things I don't even want to mention on here.\n\n> I could see on the camera, she turned to face the photo of my mom, and threw the photo and the fresh roses I had bought the day prior onto the floor. \n\nNope, NTA. I wouldn't give a single cent to someone who is so blatantly disrespectful.  \n\nThis marriage is doomed, a bad investment all the way around.  Hope your son comes around to that before eloping with her because you refuse to fund his next mistake.\n\nETA:  Get your key back from her immediately and change your locks.", "INFO- Have you ever talked to your son about your feelings? Seems like from your perspective things have always sucked- like from minute #1.  Just curious if you addressed it with him or if you’ve just been ignoring it.", "Was this before, or after, you punched your daughter in law in her chest after a boob job?\n\nETA : Someone's been busy deleting their previous posts!", "What a horrible human!! \nNTA OP!!\nWOW I would take that key and my money back and show your son the evidence of the type of woman he's marrying. \nThat's so horrible, I'm so so sorry 😞", "NTA.  Why in the world would you feel guilty after how rude she's been and what she did??????", "NTA and if your son wants to marry a woman who treats his parent like Vanessa does then he needs to be cut off too", "NTA - where's the bride's family in all this? They should be paying not you! Your son should man up and arrange a wedding he can afford rather than get money from a retired family member! He should have a simple cheap ceremony & be happy. \n\nThe thing is it doesn't matter if you pay or not. His wife to be is obviously manipulative and wants a rift with you and to drive you both apart. If it wasn't this it would be something else. I recommend you save your money and wait for the divorce.", "Send the proof! NTA!", "Oh my god, what a little brat. I’d show her and your son the camera footage to see her reaction.\n\nNTA. Your son has already had one wedding and is 30 years old, they should think about funding it themselves or getting her parents to do so.", "NTA \n\nIt's wild that you would think you could even maybe be an asshole.\n\nShe threw and smashed a photo of your (presumedly deceased??) mother and flowers on the ground, lied to you about it.", "1) why did you give a woman whom you don't like or care for a key to your house?\n2) why are you funding a wedding for people who are financially unstable?\n3) why have you not emailed/texted/shown your son the video of her committing the transgression?\nYTA to yourself for letting yourself be a door mat.", "NTA I can't imagine the marriage will last. Immature people can't hold a marriage together. She is nasty. Please don't be emotionally blackmailed into giving them money. She'll soon drift off if she thinks you'll leave your son penniless.", "NTA. Change your locks. Also these are two adults going through a tough tie financially. Why are they getting married rather than focusing on getting their finances together. You have a lot of money save that you might need as you get older because I wouldn't bank on Vanessa and your son to help take care of you.", "NTA, send the video to your son and tell him that this person is no longer welcome in your home.", "NTA. Vanessa is deliberately disrespecting you and is getting your son to do the same. I’d not only defund their wedding, but would also change your locks. You can’t trust her in your house when you’re not there. If you haven’t already, send your son the video so he knows who he’s marrying.", "NTA- but why haven’t you sent the video to your son? She’s clearly not someone he knows very well and he deserves to know how crazy she is before marrying her", "NTA. *Do not apologize*, good grief. Vanessa didn't make a mistake or have an accident; she destroyed an item of deep sentimental value for no purpose other than to hurt you. What else could she have hoped to achieve? \n\nYour son gets to date who he wants, and marry who he wants, and that's his business. But why on earth would you pay for it? Gifts are meant to tighten the bonds between people--they both express positive feelings and create bonds of obligation. Your daughter-in-law-to-be is actively rejecting both. Don't pay.", "NTA show your son the video that's a massive red flag move.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy son (30M), I'll call him Jack, is getting married to a girl I'll call Vanessa (24F). Jack has been married once before, and I completely covered the cost for his whole wedding. He met Vanessa online on a dating website around a year ago.\r  \n\r  \nThe first time they met in real life, Vanessa met both Jack and me. She was, in my opinion, extremly judgemental the whole time. Didn't eat my food, kept giving me \\*the look\\*, whispering things about me to my son, etc.\r  \n\r  \nEvery single time I met her, she'd be extremely rude to me. She was saying stuff about my weight, and things I don't even want to mention on here.\r  \n\r  \nA few months ago, he proposed to her. He asked me to fund the wedding, as they both needed as much money as they could get because they're going through a tough time financially. I funded his last wedding for the same reason. I agreed, because I'm retired with lots of saved up money.\r  \n\r  \nThis is where things get sour. (A couple of days ago) I wasn't home, but I have camera set up looking into my hallway from my front door. I have a display with a little picture frame of my mom, and I put fresh flowers there every week to honor her. Vanessa has a key to my house, and can enter whenever she'd like.\r  \n\r  \nWhile she was walking, as I could see on the camera, she turned to face the photo of my mom, and threw the photo and the fresh roses I had bought the day prior onto the floor. She continued walking after that.\r  \n\r  \nWhen I got home, I saw the picture shattered on the floor. I went to go check the cameras, and lo and behold, I saw what Vanessa had done. I immediately called her and she started denying it, saying it was an accident.\r  \n\r  \nI would have forgiven her and forgotten the whole situation, if she hadn't started telling my son that I was framing her. He called me and yelled at me for at least 30 minutes straight. That was my last straw.\r  \n\r  \nOn that phone call, I told him I wasn't going to fund their wedding. I hung up, and we haven't spoken since. I've felt so guilty for the past couple of days. I don't know if I should apologize or not. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. But the only way to solve this is to send a copy of the video to both of them, and a demand for your keys back. \n\nWhen they are ready to apologize, they can reach out.", "NTA !!!", "NTA. Change the locks. Don’t even ask for the key back.", "NTA, it seems to me that shes alienating your son agaisnt you and manipulating him to get what she wants, the way she acted towards you, i wouldnt be funding in the first place, plus, its his second wedding, it was too fast, i would have a convo with him to make sure he knows what hes doing. One thing is the mil/fil being awful, other thing is her just behaving like that for no reason and your son allow her, when all you did was to still treat her well.", "NTA. I wouldn't expect any good from this woman, so let her be, but your son yelling and insulting you - is perfect AH. You already funded his first wedding and he did not keep his vows. You taking back your promise to fund another one is so understandable and reasonable.", "NTA. Please show your son that video. Vanessa is giving off so many red flags - she’s potentially trying to isolate him from family, as abusers do in the beginning.\n\nFor the record, I cannot imagine anyone above the age of three slamming a picture frame to the ground.", "NTA. She sounds like a nightmare. Change the locks. Don't they know you have video?", "NTA. Send your son the video and CHANGE YOUR LOCKS.", "This sub should be called 'Am I a mug?' - yes you are! She's been disrespectful from day 1, purposely broke your things and lied to your Don! Why has she hot a key? Why even agree to pay for their wedding? They haven't even been together a year. If they can't afford it yet then they should bloody save up! Give yourself a shake Op. NTA.", "NTA. Show your son the video and get your key back", "Change your locks. Send the video to your son. Don’t find the wedding. NTA", "NTA it sounds like Vanessa has a Cluster B personality disorder and your son should ditch her if that s the case. she nasty", "NTA Don’t fund this wedding. \n1. They need to grow up and be responsible for their own finance and not depend on you.\n2. This one too will end in divorce.\n3. She is completely disrespectful to you so why would you find anything having to do with her.", "Why were you funding the wedding of this awful woman in the first place? Why does she have a key to your house? \n\nNTA. Show the video to your son and then banish this woman from your life.", "Good lord OP. Please do not take care of his finances until he learns to respect you.\n\nNTA", "NTA. First, you are under no obligation to pay for a second wedding. It’s maybe (theoretically, if you felt a lot of affection for your DIL-to-be) nice to “chip in” but your son is an adult now and can pay for things himself. If his budget exceeds his means, well, he can either go into debt or he can shrink his budget.\n\nSecond, that’s really disturbing behavior. I wouldn’t feel safe with someone who seemingly randomly and purposefully broke my things. It feels very hostile. I would ask for the key back from her ASAP and change the locks to be sure.", "Why would you fund a second wedding for full grown adult? 30 years old too? \n\nYou are short changing yourself and you would be T-A if you paid for this wedding.", "Nta did you show your son proof?", "NTA, get that key back from her AND your son and change the locks. If she’s willing to just break your stuff randomly, who’s to say she won’t trash your house for not funding her wedding.", "NTA. Show your son the footage. Regardless, if they do y have money, they shouldn’t be having a wedding. No one needs a wedding, especially one they can’t afford", "NTA. I'd send your son the video but make no further comment. At this point, even if the both apologize, I'd tell them you won't give them a dime for any reason and I'd ban her from your house entirely. Either make her return the keys or change the locks.", "I don't understand any of this. You were bullied by someone less than half your age. Your son thinks nothing of that even though it happened right in front of him. You have *video evidence* of this bully (who for some reason has your permission to enter your home whenever) destroying a picture frame and vase...and you haven't sent the evidence to your son, the marriage addict? And you're actually asking if Y T A?\n\nMost click-baity thing I've seen in a while.", "NTA. She violated your hospitality in a really nasty way, repeatedly, and this seems like the last straw for you. They don't need this money. They can do it at the courthouse if they just want to get married. \n\nMight be worth showing your son the video of the incident, though. It may or may not change his mind, but he should hopefully know who he's marrying before the deed is done.", "NTA change your locks, post the video to Facebook and refuse to pay for your son's wedding", "Nta I hope you stand your ground and your son comes to his senses. I hope you showed him the video. Don't worry you did the right thing.", "NTA he shouldn't marry this crazy woman.", "NTA. He’s 30 year old. Old enough to fund himself the wedding. Who tf let someone disrespect their mom like that. Don’t ever apologize.", "Easy NTA", "Nta and get your keys back.", "NTA. And why should you feel guilty? Did you show your son and his wife the footage of her breaking it?\n\nThey need to apologize to you. And I wouldn't fund their wedding.\n\nOh, and change your locks.", "You were kind enough to fund your sons first wedding. That in itself is enough to not warrant paying for his second.", "Actually op admits to it in a comment on this thread. [https://i.imgur.com/kLZ5bDW.png](https://i.imgur.com/kLZ5bDW.png)", "???? Where did you get that info as I don't see any other post posted by op?", "Where did you read that?", "Because it obviously didn’t happen. If it did she wouldn’t have sat through 30 minutes of being screamed at.", "I tried once at the beginning, same day we met. He completely disregarded it. I gave up at that point", "Where is this coming from?", "4 sons, different DILs", "I hadn't thought of that. Op definitely show your son", "Change the locks", ">change the locks.\n\nthis.", "This right here is what to do.", "He didn't.  He makes shit up to start drama.", "OP had two previous AITA attempts. Should have taken a screen shot before they got deleted. Oh well bummer.", "Op admits to it.\n\n[https://i.imgur.com/fJ50MK7.png](https://i.imgur.com/fJ50MK7.png)", "May I ask why you would have considered paying for the wedding in the first place?  I mean you’ve got quite the laundry list of examples of disrespect.", "There should still be the automod text.", "I truly don’t believe this is the real or whole story. Somebody half your age is bullying you then she broke a picture of your mom and you have video proof? Why wouldn’t you have shown that to your son?\n\nSomething’s not adding up & it’s likely you. \n\nGet real.", "Is this even a real story? Why would you listen for 30 minutes and not mention the video? You knew it wasnt an accident bc the video so how does your reply for the judgment bot make sense", "YTA for making up such blatantly false reddit posts. In what world would people think you’re the asshole in this situation?", "NTA. Also, you need to stop funding your son’s terrible romantic decisions. Your son is a grown ass man and if he wants to get married, he can save up and pay for it himself. \n\nSend him the video and if he continues to defend Vanessa, cut off all support you’re giving him, if you’re covering anything else, and let him face the consequences of his actions. If he’s willing to back someone who is a liar and disrespectful to his mother, then he deserves nothing from you.", "First I would never fund my child’s second marriage after only being with them for a year. If they can’t afford a wedding they shouldn’t be getting married. Also especially if she’s been rude in the past. Then she lies about something she was at fault for. You don’t reward bad behavior. Then for your son to jump the gun. I’d happily send them the video and let them both eat shit and cry about not being able to afford a wedding. Take that money and go on a trip. Let them cry all they want.", "Wait, so you gave a key to your house to someone you don’t like? Why? Do they live there?", "Just tell him you'll fund only his odd-numbered weddings.\n\nThat being said, this girl is a massive brat, almost a cartoon villain, and you gave her a key to your home?", "Is this real? This can’t be real.", "YTA for leaving out details and deleting all your old posts when people noticed there was more to the story.", "INFO: Did she sing that the ocean will be hers while doing this? Cool story, bro.", "Tf? Send your son the video and ask him to get her to explain it to him. And yeah, get your key back. This lady is not good.", "My question is why she has a key to your house?", "I wouldn’t give them any money and I would change the locks", "Tell your son that you have made a video apology and want to play it for them. Get a bunch of family involved make a big production of it. \n\nStart the video off by saying ‘I’m sorry’ and then cut to her destroying the photo and back to you and say ‘I’m sorry you have chosen a woman that would do this and lie about it and then turn my own son against me.’", "NTA - My question is why are you so spineless?", "NTA. Um, she's a psycho and your son should see the video before he marries her.", "NTA. Send your son the video of what she did. I’m sure she’s spun it some way. Show him the truth.", "Change your locks, send your son a copy of the video (I'm assuming that's his mother) and give your son a break until he can apologize for the horrible disrespect to you. You don't deserve that kind of treatment from her and he should not stand for it OR  belittle and speak hatefully to you and pretend that it's ok to treat you that way.", "NTA. Send him the video. He should know who he is engaged to. Also change your locks.", "INFO: Why were you also there the first time Jack and Vanessa met in real life? Did she come and stay at your home?", "NTA.\n1. Your son is 30. Getting married is not a necessity to staying alive. He’s not entitled to you paying for ANY of his weddings. \n2. If she is being disrespectful to you then she shouldn’t be in your house at all. Please change your locks. \n3. Send your son the footage! It sounds from your story that he’s been brainwashed into thinking she didn’t do it. It’s not about winning the argument, or having him choose you over her, it’s about him knowing the truth and being able to make his own decisions with that information.", "You have good reason to be angry and anxious for your son's future. But not following through on the wedding will make you seem the bad guy to him, and create a real strain on your relationship. And that is the important relationship. Be there for him--he'll need you if that relationship (fiancés) goes bad.", "Nope. NTA", "Send him the video", "NTA. She sounds deranged, send the video to the family chat, let the images talk for themselves, if your son still defend this behavior let him deal with the consequences.", "NTA. You did absolutely nothing wrong here. And please change your locks.\n\nETA: and maybe double check to make sure your will is set up how you want. Your son’s fiancée is malicious.", "NTA send the video of the woman your son wants to marry, (throw a picture of his grandmother and destroy a memorial flower) to him and ask him how exactly you are supposed to be ok with giving this woman anything? If you have proof expose her.", "NTA !! get keys back or change locks. do both. did you show son the video?", "NTA. There is obviously something wrong with that girl. Your son is grown and can do as he pleases. You should also not feel guilty for doing as you please with your money. Be firm and let him know he will not be getting a dime from you for anything.", "NTA, who the hell throws someone's mom photo on the floor purposely? That is insane. Why does she have a key to your home? You paid for his 1st wedding no reason to pay for the 2nd one. Just cause you have some money doesn't mean you need to spend it on him. Tell him to ask her father to pay for it. You deserve what you have and spend it on yourself because if you ever run out you know he won't help you. Change all your locks immediately, get an alarm system and don't give them the code. Also show or send him the video which clearly show she threw the photo on the floor as if it was an accident she would have cleaned up after herself and told you about it. Even try to get the photo reframed to make it right.", "NTA what she did was evil and super unstable. I get loving your son but don’t break yourself trying to love him, send him the video tell him it’s completely up to him how this ends. But don’t pay for a wedding of a person who neither respects or likes you", "With respect to you as a parent, it appears to me that your son has some issues understanding what it means to be a man and be an adult.\n\nHe's allowing his fiance to disrespect you in your own home, he's immediately taking her side and not critically appraising the situation(s). \n\nHe's been married before but acting brand new, has he reflected at all about his life choices and actions...? \n\nIf he was my son I would have a sit down conversation with him, after taking his car keys so he can't just give up and piss off, and explaining the law of the land.\n\nWhich is, you are respectful to people, you don't shit where you sleep, you are grateful for your parents giving you so much in your life that you don't just take take take from them. I would show him the video and express how hurt you were by these actions and how it's indicative of the behaviours he's going to be subject to if he continues to consort with this child. \n\nHe knows on some level that he's in the wrong, or he's too soft and allowing this girl to walk all over him, and be extension you! \n\nI'm sure you love your son, but you need to be strong because he needs to learn how.", "N T A. She seems like she's making moves to cut him off from his family.", "NTA. I'd post it all over social media's. I'd also change the locks and the will. Do not pay for this wedding. A 30 yr old man who has already been married and divorced needs to pay for his own wedding.", "NTA\n\nOh man, she sounds awful. I hope your son reconsiders marrying her. Offer to let him see the video", "NTA. I wouldn't have funded one cent of the wedding with the way she treats you. Save your money. You're going to need to change your locks as soon as possible. She would absolutely sneak in and steal valuables.", "NTA.  Red flags, she sounds conniving. Get your Don alone and show him the footage.", "Has your son seen the video?  If he has and he’s still defending her, then definitely NTA.   If anything you’re probably saving him from a whole lot of crazy.  Even if it was an accident, she should have told you what happened, apologized and cleaned it up before you got home.", "NTA get your key back now. Do not pay one cent to that wedding. Your son owes you an apology. His actions are disrespectful I’m so sorry. Do not give him any money as it will go to her. Nothing! Get your key and I’m so sorry about the picture. This woman is unhinged", "NTA. Get your keys back and then change the locks. I would also try to at least show the footage to your since and go from there.  She sounds crazy.", "NTA. You already paid for one wedding already. You did more than enough already. He wants a lavish wedding him and his terrible fiance can pay for it themselves. Stop tapping into your retirement to pay for an ungrateful asshole son. That woman he wants to marry is just awful. Cut him off financially and from your will.", "NTA and if he continues being a bad son tell him you’ll pay for the third wedding", "This seems so extreme, of course based on this NTA, but its such terrible behaviour from her, seemingly unprovoked it makes me wonder if part of the story is missing.", "NTA. Why would you let your son yell at you for 30min? Let alone 30sec? Hang up..please..", "You are not the asshole and you dodged a bullet.\nGood riddance!", "NTA in any way shape or form. Firstly let your bloody son fund his own wedding!! You did it once its not your burden or problem to have to solve!! Quite frankly she doesn't deserve a decent wedding, what a ugly,  nasty, spiteful thing to do!! I honestly am wondering what your son sees in her. I know you love your son but yeah he kinda already assumed you woukd pay because you did before.  No no and no. Sorry but that's my opinion. Let's hope they break up ASAP.", "NTA\n\nDon’t bother getting your keys back. Change the locks on all doors. Anyone that toxic will make copies of keys.", "NTA.  Change your locks immediately. Have you showed your son the video?  Send it to him and let him come to his own conclusion.", "NTA. She sounds horrid. Also, have you shown the footage to your son?", "NTA. Send your son the video. Change your locks.", "NTA. And share the video.", "NTA. something about her is very off and I would not only change my locks, but would also ban her from coming into my home ever again. the audacity...", "Well she sounds hideous… NTA.", "NTA. You shouldn’t be expected to fund TWO weddings. If they’re that hard done by financially then they need to reschedule or plan a small wedding that they can afford.\n\nWhat Vanessa did was wildly disrespectful to you, your mother and your family as a whole. She’s not worth your time and effort. Id send your son the video and let him see what really happened.", "NTA! She has some serious issues! I agree that you should show the video to both of them at the same time.", "Wow NTA I thought maybe it was an accident but on purpose???\n\nI think you should sit down with your son and show him the video. This is not ok. It sounds like best case Vanessa needs serious therapy and worst case she’s an abuser but most likely she’s a little of both and no matter what it sounds like she will be harmful as a partner in her current state.", "NTA. Show him the film. Lose the guilt. You’d be funding a marriage that probably won’t last anyway.", "NTA email him the video of her.", "NTA you already paid for 1 wedding is he gonna expect you to pay for the next 2 as well. They can pay for there own wedding.", "Don’t apologize. Send him the footage of what she denied doing. Such disgusting disrespect", "NTA. Send your son a copy of the video.", "Why did you give this awful person keys to your house?! NTA!", "NTA, obviously. You now have the opportunity to be an absolute savage. Send the video to your son, with the message \"I will not be funding this wedding. I'll consider helping with the next one\"", "NTA but Vanessa sure is.  She is trying to turn your son against you.  You need to show him the video.  Do not fund their wedding", "She’s mentally whack.   Change the lock.", "NTA", "NTA send him the video and change the locks. Plus, who has the audacity to ask you to pay for two weddings?!", "INFO - Did you show your son the video?", "NTA but OP, and I don’t mean to be rude, but you sound like a grade A pushover. Why are you letting this woman treat you this way to the point she feels comfortable breaking your belongings and you yourself said you would have forgiven her even after she lied? Why does she have A KEY TO YOUR HOUSE? You are nowhere near TA in this situation but your such an AH to yourself it is killing me.", "NTA.  Please stick to your guns about not funding their wedding.  And BTW, why does Vanessa have a key to your house?!", "NTA. Send proof to your son and say nothing else. Change your locks.", "NTA. Change your locks. Vanessa owes you a huge apology as does you son.You have this woman on camera vandalizing your home. Who does that! Plus they are grown adults who can pay for their own wedding. How many weddings are you supposed to fund.", "NTA.  He is old enough to pay for his own wedding AND the fact that he allowed her to continue to treat you with disrespect are both reasons not to pay. The fact that you have it on tape, it was not an accident AND he yelled at you...No need to even go to the wedding. \n\nI am sorry he is treating you so badly.", "NTA.\nChange your locks and show your son the video. Even if she apologizes do NOT pay for their wedding. You should not be paying for a wedding because if I were you I wouldn't support the wedding. They are using you for your money", "Hell no you're not guilty! Definitely NTA!", "Send the video to your son and call it a day", "NTA and change the locks before they come back to destroy more stuff or steal something from you also, you've already funded one wedding, that should be enough.", "NTA, send him the video let him make his own judgement", "NTA\n\n1. Send your son a copy of the video \n2. Change your locks\n3. Tell your son to go to courthouse and get married.\n4. Make peace with the fact that if they have kids you won’t be apart of their life.", "Have you showed your son the video?", "Info:  Why does this woman have a key to your house.", "NTA\n\nChange the locks and send your son the video.", "Send him the video!", "NTA and change your locks.", "NTA OP.  If I were your son, I would be wary of Vanessa.", "NTA make sure you change the locks", "Why does she have a key to your home? Change your locks and show your son the video. NTA", "What did your son say when he saw the video?", "NTA.  Send the video to your son proving it wasn’t an accident.  Let him know that the more she denies it, the more you’re likely to not be involved at all.\n\nMaybe it’s time to encourage your 30 year old son to put himself in a stronger financial position before he starts spending other people’s money recklessly on weddings. Cut this off and tell him to grow up.", "NTA. Put the video online for the whole family to see.", "You funded one wedding. That is beyond enough. They can get married in City Hall.", "Apologize for what? You have no reason to do any apologizing. Let them fund their wedding. You are NTA but Vanessa most definitely is an AH.", "Why didn't you show your son and his girl the video???\nIf they can't afford the wedding, then they should put it off until they can or go to the courthouse, not that difficult of a \"situation\".\n\nN.  T.   A.", "NTA. jaw dropped. how devastating. 💐 🕯️💛🫂 for you and mom.", "This CANNOT BE REAL. \n\nThis girl has been an absolute monster to you, and in addition, has vandalized your things, and you’re coming on here asking if you’re the asshole????", "Stop paying for your son. You’re not doing him any favours by not letting him grow up. \n\nDon’t pay for a grown man’s second wedding. He should be embarrassed. He can go to the courthouse if he’s that desperate to get married.\n\nGet your key back.\n\nJust disengage. \n\nThey’ll never disown you completely because they will eventually be back looking for money.", "NTA. You would already be in the right to say no with how she treated you and/or with how short the relationship has been. That said, I want to clarify something here\n\nShe *intentionally* smashed a photo of your mother who has passed on, and then claimed she didn't do it on purpose?\n\nYour son needs to wait MUCH longer before trying to spend your money on someone like this. If this is the kind of behavior that comes out after 10 months, I'm terrified to think what might come out in 10 years.", "NTA. Why does this jerk have a key to your house? Change the locks. Do not give your son a key. This b----h sounds unhinged. Do not engage with her again. And keep your money. This is a very bad investment.", "NTA. And you need to show the video to your son, so he can see that she’s the one lying. Plus, you already financed one wedding for him. It’s now up to the two of them to plan a wedding ***they*** can afford.", "NTA. Save/record that video, and send it to both of them. It's irrefutable evidence. If you want be extra petty, put it on social media. This is not a good woman, and she thinks she won't/shouldn't face consequences for her actions. Prove to her that she can, and show your son what kind of woman he's going to be stuck with (up until a very expensive divorce) if he marries her.", "NTA. Sorry your son has such bad taste.  Maybe the third time will be the charm?\n\nDid you show your son the footage?", "NTA, but definitely would try to repair the relationship with your son.\n\nSounds like he doesn't have all the information (or the video) to help mediate the situation between you and your potential daughter-in-law...emphasis on the \"potential.\"", "NTA. You should have never agreed in the first place. She sounds like trouble and he’s still too immature. He needs to get his shit together because always having financial hard times is a problem.", "Send the video to both of them. \n\n…or be super petty and post it on Facebook and tag both of them. NTA.", "NTA and send a copy of that video to your son.", "NTA and your son is a grown man that has already been married once. He can pay for his own wedding", "wait is this a continuation or are Jack and Vanessa commonly used as fake names?", "NTA. I’d post the video online so she can’t spread lies about you. Change your locks. Your son does not deserve your money. Stay strong.", "NTA - first you already paid for one wedding, you aren’t required to pay for this one, or the next because this one is doomed to fail. Second, she was rude to you from the start and made you feel uncomfortable so that should have been enough to not pay - but clearly your nicer than me. \n\nThen she deliberately disrespected a tribute to your deceased mother. That is a new level of awful. It sounds like she really hates you, and maybe because your close to your son and she wants full control (speculation on my part).\n\nFinally, rather than ask you what happened your son disrespected you.\n\nDo not feel guilty and do not pay a cent for that wedding your are totally NTA.", "NTA\n\nSend the video to your son. Change the locks and when she tries to get inside, call the cops!", "NTA. How can he propose to his girlfriend if he/they can't afford a wedding? Unless they want one really long engagement.", "NTA\n\nYou need to send your son the video.\n\nGoing into someone’s house and intentionally destroying a loved item that has nothing to do with her is incredibly disturbing.\n\nThe only reason someone would do that is because they are cruel and vindictive. \n\nNot that I had a high opinion of her after she was making comments about your weight.\n\nIt’s such a bizarre thing to do I can understand why people would have trouble believing it (even though it hurts he believed her first)", "INFO: have you shown your son the video evidence?", "[removed]", "Send him the video.", "She doesn't deserve your forgiveness.\n\nChange the locks, and ban her from returning.\n\nNTA", "NTA", "NTA, she sounds unhinged. Why would you let such a person have a key to your place?", "I feel like there is all kinds of information missing. Why were you at your 29 year old son's first date with this girl? Not to mention around her so frequently that you had that many negative interactions within one year. Maybe she was giving you the look and whispering to him about you because she was wondering why he brought his mommy on a date. That's weird af.", ">I agreed, because I'm retired with lots of saved up money.\n\nHe doesn't need you to pay for his second wedding. Also, wtf. NTA.", "Can you send your son the video footage? The girl is a nightmare!", "NTA tell him you will pay for the lawyer if you are feeling nice. But really, this guy is 30 and marrying for the 2nd time, you need to tell him to grow up.", "No, get new locks.", "And send son a video of the demon he loves so much", "OP, we teach people how to treat us. \n1. Change the locks.\n2. Don't pay for the wedding. Your retirement savings is for YOUR retirement, not to support your son and his bride. Expect them to ask for money in the future.\n3. Decide if you are okay with being disrespected. If not, decide how you want to proceed.\n4. Talk to your son. Why is he okay with her behavior? Is she getting clues from him?\n\nDO NOT allow them to walk over you.\n\nEDIT- punctuation & spacing.", ">if she hadn't started telling my son that I was framing her.\n\nSend your son the video file with the caption, \"the photo is the only thing I'm framing 😎\"", "Maybe the third wife will be the one, you know, third times the charm and all that", "I cannot beleive that anyone fell for this.  \n\n\n>He called me and yelled at me for at least 30 minutes straight. \n\nSo she didn't send him the video? She just listened for 30 minutes?\n\nThat doesn't sound plausible at all. It sounds more like the thing a narcissist would say than anything that could have actually happened.", "And send the video to your son", "After you get the keys AND get new locks, send the video to your son. I leave the timing to you.\n\nNTA", "Jesus, you paid for one wedding already. He's 30 years old, making another big mistake. Why an earth are you supporting this crap?", "Also the part was “i funded his last wedding”. One wedding funded per kid is my policy!!!  You don’t get another baby shower for the second baby!!!!", "Hope she sends it with the subject line \"the photo of your grandmother is the only one being *framed* 😎\"", "> Either make her return the keys or change the locks.\n\nChange the locks. Don't trust that she's returning all copies of the key.", "There is no video to send to her son that yelled at her for 30 minutes straight, she just held the phone to her ear, blank eyed for 30 minutes while listening to her son yell and didnt offer to show the video or anything, just listened.\n\nThe story makes no sense.", "This is probably made up because that would be anyone's natural first step when their son accuses them.", "Yep. Shit like this doesn’t come out of nowhere. Also, weird details: they met on a dating website, they hadn’t met in person but the first time they did mother was there?? She was rude from the beginning? None of it makes sense #missingreasons", "I need to know more about this.", "Anyone out there have a screenshot of these posts?", "Say whaaaa?", "Wait, what?", "Wow!", "Wait! WHATTTTTTTTTTTTTT?", "Tbf we don't know why the first marriage isn't still a thing. The son's first wife may have died or something 🤷‍♀️", "Right?? Even if it /was/ an accident, you know what you do? You call/text the person whose stuff you messed up and say, “oh my god! I’m so sorry! I accidentally broke your thing. Is there anything I can do to remedy this?” You don’t freaking hide it. NTA, op, but as someone who loves and values her mother, please do not pay for this woman to marry your son. She clearly does not love and value you like a mother.\n\nThat, and I’d call it your son’s responsibility to cover any weddings past no. 1. That’s his responsibility to make his marriage work or cover his own costs.", "Tbf we don't know why the first marriage isn't still a thing. The son's first wife may have died or something. \n\nBut otherwise yes fully agree.", "because OP has conveniently deleted her other posts that explain why she is being met with justifiable rudeness.", "I swear it is like online dating was built for people like this.", "not anymore malicious than OP who punched one of her DIL's in the chest after an augmentation and pulled the funding from 1 of her 4 sons 2 months before his wedding. \n\nUnfortunately OP got ahead of everyone and deleted the posts before they could be shared to give everyone a better picture of who she is.", "A very large part of the story is missing, the part that would change everyone's vote to YTA.\n\nReddit must have the posts somewhere that she deleted but I'm going to give them the titles that are probably the closest to them \n\nAITA for punching my DIL in the chest after she had a breast augmentation done\n\nAITA for pulling funding from my son's wedding 2 months before it took place", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "⬆️⬆️ This is the way. ⬆️⬆️", ">get new locks.\n\nand a new backbone.", "Exactly. Why was OP even entertaining their sons 30 min lecture? Just send the video, mic drop, and walk away.", "Yes. Unless OP is a filmmaker by trade most people aren’t going to be able to fabricate that.", "I'd be sending that video to every guest invited to the wedding who asked me why I wasn't coming.", "Lol and brilliant, what an evil witch.", "Yeah until she shows receipts and sends son said vid as proof it all sounds to me like paranoid bullshit", "Maybe I'm missing something. How do we know that OP is female?", "It seems lovely to have such a nice life and know only such lovely people that you can’t imagine anyone yelling in a way that’s uninterruptible.", "Thank you!", "So glad this didn’t go unnoticed LOL because I thought it was weird as hell. Why is mom third wheeling their first real life interaction?", "We’re missing the good details -", "Yeah like wayfugginment.", "Nope - trying to find them!  Doh - why didn't I copy first???", "Maybe you have a bit of a reputation amongst your sons?", "Why delete your history?", "u/possessioninside6039\n\n\n\nWhoa, whoa, WHOA, hold on here. Do you have a violent history with ANY of your daughter-inlaws? We need to know. Spill the tea.", "wtf dude you really did that??", "And you punched your DIL boob?", "This immediately changes everything… you can’t leave out major details. What the fuck is wrong with you? ESH", "That is true", "Been on a deleting tour…", "This is the way", "THIS, OP", "I don't think this is about a backbone. He's proven that he has a backbone by refusing to pay for the wedding after that blatant act of disrespect. The times before? Without proof, his son could view OP as being vindictive, so OP was respecting his son's decision to be with/marry this individual. \n\nOP is not the AH and he needs to change his locks, yesterday.", "Could she not have hung up?", "yeahh we are missing a lot of details", "That’s if the OP, was honest.\n\n3rd times a charm, coming to this sub …. But the stories slightly change, tone remains.\n\nKeep reading further down, there is NO video to show because it doesn’t exist.  Manufactured drama & physical violence to other family members.   Too busy deleting previous history to even respond…..to this bullshit.", "She could have, but chose not to. That’s her prerogative. If someone I loved called me screaming I’d probably keep listening until they tired themselves out.", "Right, but that isn't what uninterruptible means.", "In that case nobody is literally uninterruptible unless they’ve chained you to a chair. But you clearly understood what I was talking about and are being pedantic, presumably to make some kind of point?", "You're being rude in the thread while also misrepresenting the scenario. If you're letting someone yell at you for 30 minutes on a phone you can easily hang up, they aren't uninterruptible. You're just not interrupting them.", "Hanging up isn’t interrupting. You can’t show someone a video or even tell them about the existence of a video by hanging up. Therefore hanging up is not an option that has anything to do with the comment I was replying to. I’m not sure why you’re pretending not to understand.\n\nETA since they either deleted their comments or blocked me: yes obviously they could hang up and send the video in a text, that goes back to my statement about it being their prerogative. Everyone is free to decide whether they want to listen to the entire screaming rant or not. It’s entirely reasonable to try to interrupt, have the person keep yelling, and then just sit there listening to see how far they’re gonna go. It’s also entirely reasonable to say “no fuck this” and hang up. Different people react to scenarios differently, and a person doing something that you wouldn’t do doesn’t make the entire story untrue. Which I think was my original point.", "Of course you can. You can hang up and text the person. \n\nOr you can stay on the phone for a half hour and get screamed at, I guess."]}