{"id": 19096, "submission_id": "141wptv", "title": "AITA for wanting my debit card back the same day?", "selftext": "My [27f] boyfriend [27m] left my apartment today. When he got home, he sent me a text saying he had accidentally taken my debit card with him. It’s my only card, so I was stressed and confused.\n\n\nI asked him if he could bring it back, but he said he would have to wait until tomorrow and wouldn’t give me a specific time. (It’s a 20 minute drive, but he didn’t want to get stuck in traffic)\n\n\nHe questioned what I really needed to spend money on before that time tomorrow. I did have to cancel social plans and then later not get painkillers as I had no card, but I didn’t bother bringing it up as if he’s told me I’m not a priority, that’s just useful info to know and he won’t be budged.\n\n\nWhile in pain, I texted him asking him to please not use my card. He responded saying I had “stressed [him] out”, I was “being unreasonable” and that this was “not an issue”. It’s an issue to me; it’s my property he’s taken and he can’t just return it when convenient. But I’m worried I was mean for briefly worrying he took it for nefarious reasons. AITA?", "created_utc": 1686009364, "permalink": "/r/AmItheAsshole/comments/141wptv/aita_for_wanting_my_debit_card_back_the_same_day/", "score": 109, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I believe I may be the asshole as I semi-accused him of stealing due to my confusion over his behaviour\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. Sounds like the first stage of financial abuse. RUN! This was a test and he failed it multiple times.", "NTA. He literally is controlling you financially (and because of this also socially) since this is your only card and he thinks he's the victim here? Get that card back (or cancel and replace it if necessary) and rethink if that relationship is a priority for you. This is a BIG red flag on his part. \n\nSide note: if all you have is a debit card, please start keeping at least 20 in cash as a backup. Hopefully he does get your card back to you but what if the card got stolen and your tank was empty and you had to get to work or something? Always have a backup plan.", "Call and cancel the card, *immediately*. And *do not tell him*. See if he later confronts you with a WTF, did you not *trust me!*??\n\nThink of it as a little experiment. For science. If he is a good guy\nand does not try to use it? He will never even know you cancelled it. \n\nYou will have a new one before he returns yours. NTA", "I know some have said to cancel the card  but If you have the ability to do so via your banking app, as some banks allow, just lock the card so he can't use it even if he wants to.  If he gives it back you will be able to unlock it so you can use it right away which you wouldn't be able to do if you cancelled it.  If he doesn't give it back you can always cancel it then.", "NTA. How did he take it \"accidentally\"? He stole your card to use it or to control you and keep you from going out. Report it stolen immediately. When he blows up because he couldn't use it dump him, or dump him when he finally gives it back. He doesn't care about you and he can't be trusted. Either issue should be a deal breaker.", "MTA. Ditch that child and report your card stolen. He has no right to you money.   Call now f before he bleeds your account dry.  people don’t accidentally steal your debit card.", "NTA, however you need to leave this guy. Why did he even have your card in the first place? Plus, you had social plans yet he could not spare 20 minutes? Even though it was his mistake? Although this may be a small incident, this could escalate to even more. I just think you may be better off without him.", "NTA\n\nRetrieve your card and dump him. If you don't trust him, that's enough of a reason.", "NTA\n\nImmediately cancel the card.  I doubt him taking it was an accident.", "Lock your card from the banking app or on their website. He can't use it. Simple.", "NTA - Sounds super sketch to me.\n\nInfo: was your card just laying around or in your wallet?", "NTA….he can be inconvenienced by 40 minutes (round trip) to correct a mistake he made.", "NTA. And I think he's testing to see what he can get away with. It wasn't near his stuff. It was between your wallet and passport (so he didn't \"accidentally\" pick it up). He knows you can't drive. He's being manipulative and I don't know whether it's cruel fun or to see how fast he can push you.", "NTA at. All.\n\nHe better have a damn good excuse for not bringing it back. I have chronic pain, and that would've gotten him broken up with the moment I got my card back if my partner did that. Not only is he saying you're not a priority. He's letting you *suffer* without the ability to get your meds. I don't know about your pain, but my average is a seven. To hell with him, I say. You deserve better. Especially if he has a bad excuse.", "NTA. He should have immediately turned around to return it.\n\n\"I messed up but I don't feel like fixing the problem I made\" isn't okay", "NTA: report it’s as stolen before he used it even more", "NTA. Lock/freeze your card. This is also why I have a stash of cash. You never know when you need it for an emergency. And it\\]f you can, get a credit card and keep it locked up…again for emergencies. I have one that I only use once in a while and when I do it’s something inexpensive just to keep it active.", "NTA but he comes off sketchy AF", "NTA!! In many places what he did would call for some jail time. He should have returned it immediately.", "Why are so many women with men who say outright that they are not a priority?\n\nNTA - he absolutely should have returned it immediately.", "NTA\n\nReport it as stolen. That's your money.", "I would immediately block it (assuming you can in your banking app) then call report it stolen.", "NTA.  It’s your card and accidentally taking it or not, it’s his responsibility to return it", "NTA:\n\nThis seems super strange (how did he have your card on his person/in his stuff to begin with??), and he should have returned it immediately when you asked for it back. That would have been the normal response when accidentally taking something important that someone needs, even if it’s before returning it would be “convenient” for you. \n\nBtw, I *am* making the assumption that you actually asked for it back rather than jumping to a freak out. If this was just an innocent accident on his side, it would make sense for him to ask and not to make the trip if you didn’t need it, though obviously doing it if you explained that you did need it (even if just for the security of having it in hand) would be the only acceptable action on his side.", "NTA.   \n\nDon't leave yourself  dependent  on a debit card.  What if you lost it?  You should have a credit card or cash, just in case.\n\nCancel your card just in case", "Unless you normally keep your card in his pocket, he stole it. I have been together 20 years with my partner and not once did we take each other’s cards by mistake. Get a new card and boyfriend.", "NTA— DO NOT freeze or lock the card. He could write down the numbers to use later. Cancel it outright.", "NTA. He’s just trying to keep contact with you some how, put a lock on the card for now.", "NTA. Dude stole your card, refuses to return it, and is getting mad at you asking him not to use it. That's shady AF. Go cancel your card.", "Dump him now.", "He’s definitely using your card", "I'm going to go one step further. Don't just report the card stolen, but file a police report as well.\n\nNTA", "Dump that guy.  He's a jerk.  You deserve better.", "NTA. This is super sketchy and concerning. And not just because of the potential for him to steal your money, I think more is going on here. \n\nI saw your comment about how it was left out - it seems like he must have intentionally taken it. But then he told you he had it, which I imagine he wouldn't do if he was planning to steal from you. \n\nI'm concerned that he's messing with you and/or testing you. Testing to see how you react. Messing with your head. Or trying to have control over your movements. Huge red flags.", "NTA\n\n>He questioned what I really needed to spend money on before that time tomorrow.\n\n**Dump that thief.** You don’t have to justify wanting your stolen debit card back.", " NTA and lock your card ASAP keep an eye on your online banking to make sure he isn’t using it", "NTA look up your account immediately if he used it report it stolen", "NTA. This feels like a test run for financial control abuse tactics.", "Go on line check your balances. Cancel your card. Your bf responses are suspicious.  \n\nNTA", "NTA, please cancel the card and cancel the guy. \nhow in the first place can anyone accidentially take someone elses debit card??", "NTA this is sketchy. Cancel the card and the theif who took it. Because this was no accident. This was a power play.", "Ok so youre not the AH for needing your debit card but you can also you know say yes I need my debit card because I have plans and I need to buy medication. It is not reasonable to assume that he's stealing from you, you have no basis for that belief, and yes it is dramatic.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy [27f] boyfriend [27m] left my apartment today. When he got home, he sent me a text saying he had accidentally taken my debit card with him. It’s my only card, so I was stressed and confused.\n\n\nI asked him if he could bring it back, but he said he would have to wait until tomorrow and wouldn’t give me a specific time. (It’s a 20 minute drive, but he didn’t want to get stuck in traffic)\n\n\nHe questioned what I really needed to spend money on before that time tomorrow. I did have to cancel social plans and then later not get painkillers as I had no card, but I didn’t bother bringing it up as if he’s told me I’m not a priority, that’s just useful info to know and he won’t be budged.\n\n\nWhile in pain, I texted him asking him to please not use my card. He responded saying I had “stressed [him] out”, I was “being unreasonable” and that this was “not an issue”. It’s an issue to me; it’s my property he’s taken and he can’t just return it when convenient. But I’m worried I was mean for briefly worrying he took it for nefarious reasons. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA.  INFO: Where did you keep the card? If you kept it in your purse, or in your desk, you need to DTMFA.  Keep checking your balance, and if you see anything that’s not one of your charges, call the police and report it stolen.  What is this guy planning to say to you when he returns it?  “I took your card by accident and I also charged a couple hundred bucks at Best Buy…by accident”?", "NTA How does someone accidentally take someone else’s card? Yes he’s going to use it. Cancel it and him.", "NTA - Based on where you describe it being this was not an accident.  Don't just freeze it cancel it he absolutely has retained your financial information for use later and/or this is a test to see how far he can push you.\n\nWhy did he need to know what you had to spend money on today? That is not his business and doesn't actually matter.  What if an emergency came up and you needed something?  All of this is incredibly sketchy.\n\nFinally his reasons for not bringing you your card back are flimsy at best.  You should absolutely be VERY cautious moving forward if you make the choice to stay.\n\nGood Luck", "Cancel the card NOW", "NTA. Honestly I'd call the cops on him. Fix him of his little attempt at financial abuse real quick.", "If you have credit cards, check the activity on them. Also, make sure you actually have them in your possession. Follow the other advice here about cancelling your card and your boyfriend.", "NTA. Cancel the card, dump the boyfriend/asshole/abuser, and if he has a key to your place or had an opportunity to copy your key change the locks if possible, and if not see if you can at least get one of those chain ones for the front door and use it when you're home. There's no way that was accidental, and the refusal to return it promptly is 100% malicious. He doesn't need to know whether you planned on using it or not before tomorrow, if it was really an accident he'd have returned it as soon as possible. You weren't mean at all.", "YTA to yourself. This guy is not there for you nor does he care. Get your card back and dump this ass", "NTA\n\nDon't cancel the card - report it as stolen. Because actually he stole your card. This is a police matter.", "Hard second to this. 🚩🚩🚩🚩🚩It feels like he’s pushing to see how much he can get away with here. You said he asked what you’d need to spend money on before tomorrow - maybe you want to get snacks, food, go hang with friends, pay a bill - IT’S NONE OF HIS BUSINESS. And his disregard for your ability to access your own money has left you in physical pain and canceled plans. Don’t walk. Run.", "I have epilepsy and thus cannot drive. Otherwise I would’ve driven right to his and taken my card back! But you’re right I need emergency cash, thank you", "I’ve frozen it. I don’t think he’s stealing from me, but I also don’t know how you can accidentally steal a card from someone. And then refuse to return the stolen property until it’s convenient for you. He thinks I’m being OTT though, clearly", "Nope. Cancel.  He can still write down the numbers and use it later.\n\nIf you lose custody of a card, you should cancel it.", "This. Do this.", "She also had to cancel picking up meds and is in physical pain. Like WTF?? Who does that? Even if taking the card was an accident, withholding it when she needs her meds is a huge red flag. \n\nThis was not an accident and he is showing his true colors by controlling you and denying you stuff you need \n\nNTA", "It was on top of my wallet, under my passport, on my dresser (where none of his stuff was). That’s why I’m especially annoyed, it seems like a wild “accident”", "This this this!!!! \nCame here to say definitely NTA, and I hope you find someone who loves you, respects you, and actually understands what a chronic illness is. It's even scarier that he treated you so and his actions so casually when it causes you literal physical pain. \nThis ish is not the one. PLEASE for serious leave this dude.", "He says he doesn’t know how it happened. When I asked for it back he said no because he didn’t want to be stuck in traffic (this was 1pm, plenty of times that day he could have returned it with low traffic).", "Just your last two posts are throwing up so many red flags", "Don't run, SPRINT outta there. NTA", "Pshhh tell him to keep the card as a memento of this past failed relationship.... Cancel it and him and move on to greener pastures. Lesson learned.", "then you tell him to bring you your card or you will call the police and have it brought back. thats theft. 20\nminutes or 20 months his pick", "Any sane person would scramble to return your card. It is not on you to correct his mistake, it's not on you to scramble for your own money to get some painkillers, it is not on you to cancel your plans when he could just return your card. Cancel the card. Drop the guy.\n\nThis was no accident.", "Cancel it.  He has written down the numbers and will use it later.", "NTA He's working you, training you. If you stay with him after this, the exercises will get bigger. He'll take it for a week. He'll confiscate your medications. He'll call you a b***h for objecting. He'll tell you every reaction on your part is exaggerated, unnecessary, and abusive. The longer he is your boyfriend, the worse this will get. He even gave you a nonsense story about accidentally stealing it. Now, you are distracted by his BS story, instead of calling all his friends and family, and making a scene to force him to bring it back.  He is counting on your silence.", "FUCK this guy, you can get a better one.", "Super sketch. Follow the banking advice folks gave you here.", "Does he have the same card; same design?", "That seems very reasonable to be suspicious of.", "Is there any chance he did it to keep you from going out? \n\nIt would be a very dumb way to steal money because he announced he had it right after he left, so I’m trying to come up with some other explanation for him purposefully taking it. Based on where you said it was, I can’t see how he “accidentally” took it.", ">He says he doesn’t know how it happened\n\nI'm sorry, OP, but this is shady AF. If you didn't ask him to pay something on your behalf, there is no reason why he should have your card.\n\nI would keep an eye on your online banking info and replace that card a.s.a.p. - who knows if the info was cloned?", "Nope, not at all, and he keeps them in his smaller wallet in the same place", "No, I never told him about my prior plans. Though I suppose if could be an excuse to stop any potential ones?", "WTAF!? SO or not, nothing adds up here but you already know that. It's all either very odd ... or highly suspect. Check your bank transactions. May or may not want to get a new card #. But expect a negative reaction if you tell him about it.", "he definitely did this on purpose and now he gets angry every time you try to confront him. you already know what he's doing, the whole reddit community already told you, i hope you know what the right step is now. find yourself a man that doesn't abuse you, that doesn't trap you financially and doean't steal your freedom."]}