{"id": 19162, "submission_id": "142vw84", "title": "AITA For Not Letting My Parents Move In", "selftext": "I know this sounds horrible, but I am having a hard time.\nI (46f) have lived with partner or alone for over 22 years (at the moment I live alone), my parents are both in their early 60's. My mother is slightly disabled by back problems, but she can get around and do stuff, I am her carer and have illnesses myself. I have always had a problem with having boundaries crossed by her, even when I have said something, it was ignored. Simple things are if I have said I don't feel well, she said she feels ill too and I need to just get on with it, it has got to the point sometimes where I just don't say what is wrong. She has called my choice in partners to my face and infront of her friends. She constantly asks where I am, who I am meeting, what I am doing. \nI have been left a house by my aunt in her will, it is 2 bedroom cottage. My mother told me the other day that they have some debt and are planning on selling the house and both my parents move in with me with their dog, I thought until they found a smaller place but found out she actually plans for this to be the rest of their lives. My dad goes to work at 5am every morning (the front door is by my bedroom door), he likes to sit around in his underwear if they are alone, I would not be able to have a night out with the girls as my dad goes to bed at 8pm and would get grilled if I was going out. She also said she wants to change carpets and get the bathroom changed into a wetroom, even though there is a bath and shower, when I asked why she said because she wanted to.\nShe has then been telling other people this was my idea. I feel like my only option is to sell her the house and move into a 1 bed rented place. So would I be the ahole if I said no, or is it better to just get a 1 bed place", "created_utc": 1686091683, "permalink": "/r/AmItheAsshole/comments/142vw84/aita_for_not_letting_my_parents_move_in/", "score": 297, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > My parents want to move in and I want to say no to them. It might make me an a hole as I am the only child\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA - tell her plainly that no, they cannot move in. Don’t put yourself in a bind by selling the house because you don’t want to confront them. (I know, easier said than done bc I hate confrontation.) You’ll regret being a doormat to them. And don’t let them tell you they’re only going to move in temporarily, but it won’t be.", "NTA. It is your house, you are allowed to decide who lives there and what happens to it. It's selfish of your parents to expect you to make adjustments to revolve everything around them.", "Oh hell no! NTA\n\nThey are trying to assume themselves into your home. Not okay!", "NTA\n\nThat house is rightfully and more importantly, legally yours. They have no ownership over it, if they try to force their way into your house, you can report them. There's no reason for you to add the financial burden of paying rent in a smaller house when you have a better one available.  \n\nThey just plan to use you to pay their debt while living rent free in your house. Don't let them force you into it.", "Have you ever thought that the reason your aunt left it to you was so that you could get away from your parents? That she didn't leave it to them for a reason?\n\nNTA\n\nGET OUT", "NTA she's manipulating you into either becoming your parents' caretaker or moving out of a home left specifically to you. If they can afford to buy the house from you, they may be able to afford assisted living. There's lots of options which provide independence, it's not all hospice situations.", "NTA. Just tell her no and change the locks if she has a key. Seriously. \"Mom, you know I love you and Dad, which is why I do all I can for you. I'm sorry but you guys can't move into my house. I need my own space and as much as I love you, I cannot live with you guys. You and Dad will need to figure something else out.\"\n\nWhen she complains they are poor and they should get the house:\n\n\"I am sure you and Dad will figure it out. And I will still help you do things. I'm not abandoning you but I am 46 and need to live independently of my parents. I am not changing my mind about that \"", "NTA.\n\nYou are a grown ass woman and can absolutely say no to the prospect of going back to living with your parents and I think they are entirely wrong to expect that, let alone try to action it without even attempting to have a conversation about it first.\n\nIt sounds like you’ve been a presumed part of their retirement plan for a long time. \n\nIt’s an insane presumption. Tell them respectfully no and have yourself that girls night.", "NTA. Do what is best for you without consideration of those entitled people.", "Why wouldn't they sell *their* house and move into a 1BR ground floor apartment? \n\nNTA", "Why would you sell your house? Tell them no, change the locks, and be firm. When someone mentions their plans to move in, respond \"You must have misunderstood. I have no plans of sharing my house with my parents.\" And quit being your mom's carer. Let her pay to abuse someone else! NTA", "NTA!!!!!!!!!\n\n\n\nAs someone who currently has their in-laws living (temporarily) with them, it is not sustainable long term.  You are entitled to be able to live your life in whatever way you see fit and this does not include moulding or adapting to your parents' life styles \n\nThe AUDACITY of saying that they would change your bathroom to a wetroom just shows the entitlement you are navigating. Wetrooms in homes can lower property prices as the average buyer will require a 'normal' bathroom or will be considering the costs of changing it back to a standard bathroom.\n\nI don't think I would let them move in, even temporarily, based on your post. They don't appear to be considering your boundaries and this is incredibly likely to continue when they move in. If they absolutely need to, then maybe get something in writing that states it is temporary and any work to the home MUST be authorised by you and you alone. I wouldn't want you to come home after work to find a wetroom installed...\n\nEdit: wetroom not wetroon", "You are grown!!!! TELL HER NO!!!! She can’t bully her way in. Tell her you will help them find a place but no way they are moving into YOUR house!!! Do you want to be miserable the rest of your life??   YWBTA to yourself if you allow this to happen. NTA", "NTA\n\nTell her that no, you have not invited her to live with you and that won’t be happening.\n\nAnd mean it. Stick to it. Tell anyone she’s already told that no, that was never the plan, never an offer, and that won’t be happening.", "NTA.  Your parents do not respect you so you need to protect yourself.", "NTA\n\nYou need to stand up for yourself and say no.\n\nIf you let your mother bully you like this, she'll make sure you pay the costs of the plans she has for YOUR house and she'll have you running yourself ragged to be her 24/7 carer.\n\nIf your parents sell their house, they need to use that much ney to rent themselves a one bedroom place.\n\nDon't let them in your home for even one night.", "NTA. Live your life and rule your house any which way you want. They are not entitled to your house.", "NTA \n\nYou have been on this earth for almost 5 decades and you can still be pushed around by your parents? Lady, please get a spine and learn how to say \"NO\".", "NTA- no you dont need to have your parents move in just because mother has decided. WOW. Your aunt left you a house, you should use it. They can rent a place for themselves.", "NTA, but move if you’d rather.", "NTA. YWBTA to yourself if you don't self-advocate and put your foot down. They have no issue walking all over your boundaries but you deserve space to be your own person. Do NOT move in with them or let them move in with you, don't let them guilt you into doing otherwise either. You will be much happier living your own life, you live your life not your parents.", "NTA: don’t let them move in you told them no and they have to take that", "NTA, tell them no!", "NO NO NO NO NO!!!\n\nDo NOT allow your parents to move into your house, and do NOT sell them your house. Just NO. They can find their own smaller place. You live your life in your own house without them. What they are doing will harm you for the rest of your life. It is unacceptable for them to do this. NO!!!! You are NTA.", "NTA - Get out of there you need your own space and they need to learn to respect that", "NTA. Absolutely", "Do you want your mother or your father or both to be the boss of you for the next **30 years**?  That's what could happen if you let them move in with you.\n\nYou are not responsible for their finances. \n\nYour aunt left you the house because she realizes how abusive your parents are.\n\nChange the locks in case they have a key, and don't let them stay for even 1 night, or you may never be rid of them.\n\nYou need to tell them ASAP that you have decided to live by yourself.  Yes it will cause WWIII.  Better to fight from different residences, though, than to be fighting in the same household.\n\nIf you need reinforcements, see a therapist to help you figure out how to tell them.\n\nNTA", "NTA. Grow a spine. Tell her NO. Do not allow them to intimidate you.  Block their numbers. Be a grown up. Tell them if they sell their house they’re on their own. Speak up! Otherwise they will take over your life for ever until they expire.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI know this sounds horrible, but I am having a hard time. I (46f) have lived with partner or alone for over 22 years (at the moment I live alone), my parents are both in their early 60's. My mother is slightly disabled by back problems, but she can get around and do stuff, I am her carer and have illnesses myself. I have always had a problem with having boundaries crossed by her, even when I have said something, it was ignored. Simple things are if I have said I don't feel well, she said she feels ill too and I need to just get on with it, it has got to the point sometimes where I just don't say what is wrong. She has called my choice in partners to my face and infront of her friends. She constantly asks where I am, who I am meeting, what I am doing. I have been left a house by my aunt in her will, it is 2 bedroom cottage. My mother told me the other day that they have some debt and are planning on selling the house and both my parents move in with me with their dog, I thought until they found a smaller place but found out she actually plans for this to be the rest of their lives. My dad goes to work at 5am every morning (the front door is by my bedroom door), he likes to sit around in his underwear if they are alone, I would not be able to have a night out with the girls as my dad goes to bed at 8pm and would get grilled if I was going out. She also said she wants to change carpets and get the bathroom changed into a wetroom, even though there is a bath and shower, when I asked why she said because she wanted to. She has then been telling other people this was my idea. I feel like my only option is to sell her the house and move into a 1 bed rented place. So would I be the ahole if I said no, or is it better to just get a 1 bed place\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. it's your place so it's your choice to decide if you want anyone to move in. You did a good thing by setting your boundaries.", "NTA do not let them move in.", "Repeat after me: \"No\"", "This is your home, left to you, not her. Correct what she is telling other people. They are inviting themselves and you don't agree.\n\nDo not let them set foot in your home. You will never have your own life if you do.\n\nNTA", "NTA... NO . Not for a single day. \n\nIf you need to, sell the place and move onto something they wont fit in. \n\nAre you kidding me? Your not actually going to let this happen?", "Run don’t walk. NTA", "NTA", "NTA, tell them no.  Whenever anyone brings it up say your mom misinformed them, put it right back on her.  If the ask why, be honest and tell them what you posted here, even if your parents are right there.  If your aunt wanted them to live there, she would have left it to the three of you, not just you.", "NTA- the time to tell them no is now.  Stop letting them make plans you are not happy with… the sooner you put a stop to it the easier it will be…", "Thank you", "Thank you", "Thank you", "Thank you", "Truth!", "Thank you", "All of this but without the ‘I’m sorry but’.", "Thank you", "Thank you", "Thank you", "Thank you", "Agreed, do not let them even spend the night you will never get them out", "Thank you", "“No.”  It’s a complete sentence.  Do not respond to any questions with any reasons as this gives your mother something to argue.  \n\nTheir financial situation is their problem, not yours.  Advise her to look into low income or senior housing.\n\nIf you have any problems doing this see a therapist immediately.  You, and only YOU, can prioritize your self.  Good Luck!", "We at Reddit support you!  We are behind you 100%.  Don’t faulter! Be strong!!!", "Agreed, please OP, put your foot down!! Your parents are way too much and you're all adults. You deserve your own life, and you absolutely don't have to live with them. Hoping the best for you", "I think the \"I'm sorry but\" is helpful because it shows she wants to help and understands that her saying no will have a negative impact on them. It shows caring and that she isn't just reacting but has thought long and hard about it, and despite it meaning people she loves will not get what they want, she is atill saying no. It's not an apology for putting her needs first, it's sympathy for them not getting their way.", "I hope it works out okay for you", "Hell no. They can sell their house an move into an assisted living home. Also side note go change your locks like now. Just go now. Because if they have keys they will walk in with their things and never leave. Ring camera too. Nta", "NTA", "NTA - the answer is don't sell your house and don't have them move in.", "NTA. It will be uncomfortable but you need to say no. Don’t elaborate, don’t give a list of reasons, simply say you’ve decided and that decision is final. If they make a fuss, end the conversation. If they call in the flying monkeys, end the conversation and block them if necessary. \n\nYou do not have to justify how you choose to live in your own home. Your parents are not entitled to live in your home. \n\nHold the line. This is such an important thing. You’re in your 40s and they want to keep you as their helpmate and treat you as a child. Your literal freedom to live as you choose is at stake.", "Nta, you shouldn't have to sell your home to accommodate two adults who made bad life choices. Just tell them they need to make other arrangements bc you prefer living alone.", "Don't even let them move in temporarily or you will never get them out. Tell them it is your house to remodel as you see fit and you would be happy to have them over for lunch/dinner, but nothing more. Keep your boundaries very well defined and do not budge. If they push you, block them until they get the message. NTA and you will be miserable if you let them follow through on their plan.", "\"That is not an option, mom. If you need to downsize that's fine, but my home is not an option for your retirement or beyond.\" Be firm about this *now* because it's much harder to say no after it's already done and they're there.\n\nAlso NTA Maybe you wouldn't mind if they were chill, but she's nosy, he's sloppy, you're already caring for her, and now they want your house *too.* Hell no, you've been more than generous but you deserve your own space.", "YIKES NTA!!! Listen, my husband’s parents are also pretty unreasonable and controlling, and we’ve spent years trying to get them to respect us and basic boundaries. I have been living in the reality that drawing hard lines is difficult, so I know this won’t be easy to do. But please do not throw away the incredible fortune you’ve been handed just because you can’t tell your parents no. For all you know, your aunt gave you the house knowing you’d need a cushion when dealing with them. Please choose yourself first. Your parents aren’t choosing you at all and it’s heartbreaking, but you deserve your own happiness.", "Put on your adult underwear and say NO.  Scream it!  You are allowed to have a life and to do what you want, get strong, stand up for yourself, and be who you want to be without them dictating your life.  NTA.  You are a strong person, you can do this, believe in yourself.", "NTA. You moved out of their house for a reason. You are not obligated to do anything you don’t wanna do.", "NTA but please seek therapy. It can only help. You are an adult", "NTA and please don’t feel pressure to sell YOUR house just to avoid confrontation. \n\nMy advice would be to tell them no. If they pester you and ask why, say calmly and honestly that you don’t think it would be good for anyone involved. The house is too small, and parents and adult children often don’t make good roommates. \n\nAlso, lol at them already wanting to renovate. Come on. \n\nIf you’re really feeling like you absolutely need to help them, help them find an apartment.", "Aunt is the real MVP!", "I just typed the same thing. Definite possibility.", "Do you possibly get a sense that perhaps your aunt knew what they are like and left you the house so you could have some autonomy and freedom?", "NTA  Have you considered seeing a therapist to help you become able to set clear boundaries with your parents and stick to them?   This house belongs to you, it's small, you want to live alone not with two other adults and a dog.  The answer to your parents is \"no\".  They can sell their house and buy a smaller one or rent an apartment or live with other relatives.  You deserve your privacy and control over your own life.", "Honey, you are 46 yrs old.  You deserve an independent life and to enjoy your own little cottage to remodel and decorate for you and your taste.  It's one thing to stop by your mom's and check on her a couple times a week, but you're not responsible to live with them or give up your independence.  Draw a line now or you'll never do so and will end up catering to your parents and not living your best life.  NTA", "NTA. Your concerns are valid, and you have every right to prioritize your well-being and set boundaries. Talk to your parents openly about how their permanent move would impact you and express the need for clear boundaries. If you genuinely believe it would cause significant distress, consider finding a one-bedroom rental to maintain your independence. Take care of yourself and prioritize your happiness and mental well-being above all.", "NTA say NO!!", "NTA. If I were you, I would find a way to sell the house without telling them . Then find a country where that amounth of money buys two or three houses. And move to that country.", "And if they have a spare set of keys or if they have ever had the keys long enough to make a copy of them, get your locks changed. It isn’t that expensive\n\nThen tell them that they cannot move in, but if they need to sell their house, you will help them find another place to live.\n\nThey will be upset. You need to prepare yourself for this. There are no magic words to prevent them from being upset.\n\nLook at it this way—either they will be upset or you will be upset. Please let them be upset while you enjoy your cozy cottage all by yourself.", "Right.  They're turning OP's inheritance into their inheritance.  They ran up debts and now figure they'll fix it by living rent free in OP's inheritance.  OP shouldn't give up someone loved her enough to live HER, not them.", "To add to this, renting would add much more complications/expenses to your life. I don’t think you want to deal with the housing market anytime soon with these interest rates. Also, rents always rises, it’s really hard to break the cycle of renting. Have them rent a 1 bed apartment.", "Your physical strength from 46 to 56 is going to decline significantly if you're already dealing with your own health problems. You will further harm your own health seeing to theirs. DO NOT DO THIS. You deserve a life too and not to have your own joy compromised for theirs. If they were not self centric and using you as their retirement plan, they would see this.\n\nMy own grandmother used to say she would rather die than live long enough to be a burden to her children. I'm not your mother. Consider me an internet big sister who is reading your story and seeing too much pain for you, saying, YOU deserve your own life. Do not let more of your energy be stolen. You should not be their caretakers. They are being abusive. 💔 Put them in contact with adult social services or your country's equivalent and step back. It's YOUR TURN TO LIVE FOR YOURSELF.  \n\nNow go read all these other comments here from your reddit family begging you to show yourself the care you deserve.  We are rooting for you. Titanium spine!\n\nEdit: AND DON'T MOVE. THAT'S YOUR HOUSE! But get good locks. And don't let them in. Not even to visit.", "THIS!", "NTA.\nConsider what others have written above, also consider they are in their 60's but could easily live into their 80's or 90's.\nThey should be looking at an aged community that suits their needs and circumstances, not loading you up for the next 20 or 30 years.", "Op, you're 46 and it's time to realize something. Your mother is not God. She can only stomp your boundaries if you let her stomp them. And even congratulate her after. \n\nNTA, but go to therapy, there's a looooooong way to go.", "Just keep the cottage and don't allow them to move in and tell them from the outset they are not welcome. Nta", "Wake up.  She does not want you to 'sell her' the house, she wants you keep paying all the taxes and maintenance on it while she takes over your life.  Do not let your parents move into the cottage unless they pay the full purchase price first.  They can accomplish this by selling their place and staying in lodgings until their purchase of the cottage is completed.  Then take your money and get that apartment.  Or just tell them no.  NTA", "NTA. If you let them walk over you, you’ll become so bitter. They have no right to grill you for going out late or being… an adult. You’re 46. Just because they have debts doesn’t means it falls on you. They know they can move into a one bed but moving in with you would be much more convenient and save them a ton. Don’t do it. They’re putting themselves first so you should be doing the same. Don’t let them control your life.", "My weird fantasy is to have my super controlling mother move in with me one day when she is old so that when she gives me trouble I can just throw her old line back in her face:  \"My   \nhouse, my rules.\"\n\nYour dad can be out sitting in his underwear and you can tell him \"Put pants on dad.  My house, my rules.\"\n\nBut anyway OP, NTA.  Living with a boundary-crossing entitled parent sounds like a living nightmare.  And you absolutely do not have to sell the house in order to have the right to them no.", "You will not be the a-hole when you say no. You can do this. Remember it's going to be a temporary discomfort to say no and keep saying it. No negotiating or explaining. No. It's not happening. I will not let you move in.\n\nNo matter how hard saying no is, it's a TEMPORARY discomfort. If you let it slide and start thinking there's a compromise (if they follow rules, which they won't) THEN you will be uncomfortable for THEIR ENTIRE LIVES.\n\nYou CANNOT, MUST NOT let them move in. Say no now. Don't delay. Don't look for the right moment or try to be nice. Don't let them down easy. You can blurt it out and flee the scene if you have to but say NO every time it comes up.", "They can only stomp your boundaries if you invite them to. Just say no. What can they do against your \"No\" ?", "P.S. If you're having difficulty with establishing boundaries and saying no, you might want to look into Codependent Anonymous. The word codependent has many meanings. So don't get hung up on that word.\n\n[Coda.org](https://Coda.org) has a list of meetings (virtual and in person), and \"the only requirement for membership is a desire for healthy and loving relationships.\"\n\nIt's a great place to learn more about boundary-setting and handling difficult personalities.", "No. Please don’t do this to yourself. Don’t sell your cottage and don’t let them move in. Make your home your sanctuary. Your aunt left it to YOU so light a candle in her memory and enjoy your home. \n\nAs for your parents, they have three basic options:\n1) Age in place\n2) Sell their house and downsize to a smaller house or apartment. \n3) Sell or rent out their house (for income) and move into a senior community. \n\n“No” is a full sentence. Use it every time she brings up moving in with you. Yes, she will try to bogart you. Say NO again and louder. \n\nAnd every time someone mentions them moving in with you, tell them NO that is NOT the plan. When they say but your mom said, look them in the face and say “absolutely not, no one is moving in with me. I am a grown woman, it is MY house, and I said NO!”\n\nAnd NTA", "NTA. No, they cannot decide to move into your place if you don't want them there and you certainly don't have to sell the house to them.They can make other plans. It's not like they're homeless right now.\n\nIt won't be easy but this is the perfect time for you to learn how to stand up for yourself. Don't let your parents bulldoze you. You will regret it. Imagine the next 20 to 30 years living with your parents. You will be miserable. Don't put yourself in this position. Just say \"No, this won't be possible.\" No explanation needed. And if people think it was your idea you can either set them straight or just ignore it.", "Your cottage is your inheritance. Do not sell it for them. They’re intent on selling their own house, they can get themselves something smaller. Do not let them move in. FIGHT!! This is the next 20-30 years of your life! \n\nIf it’s available where you live and is affordable, some kind of home help agency can take the burden off you. I’m in my mid-60’s, and while basically healthy, have herniated discs in my neck and back that sometimes cause me trouble. I do everything for my household, my husband still works. We have no intention of asking our kids for anything at this point. Your parents are too young to be acting like they can’t do anything for themselves! NTA!", "If she is in debt, how would she pay for the house you sell her? She can't. So then you would be out of luck. \n\nYou need to tell her no, now. You don't want to live with your parents, and they need to either find a smaller place or keep their home. \n\nIf you let her move in they will never leave. \n\nNTA for not wanting to live with your folks.", "NTA tell them NO don’t sell your house just put your foot down.", "OP, I say this with love, and it's not your fault... but your normal meter is BUSTED. Individual therapy will help, as will reducing contact for the time being with your parents. For starters, look up \"enmeshment\".", "NTA.  You just go ahead and tell them and everyone else that the cottage is not for sale they are not invited to reside with you or on any property owned by you.", "YWBTA if you sold up the house that your Aunt wanted you to have, which sounds ideal for you just so your domineering mother can rip it apart to suit her own needs while bullying you.\n\n\" My mother told me the other day that they have some debt and are planning on selling the house and both my parents move in with me with their dog\" - well, that is her plan but it does not align with yours which is to live your own life, happily mixing with friends when you want to.  Such a shame that you are old enough to stand up to her and say it is NOT your plan (and for goodness sake do not let them move in even short term!)", "As a sole  mother when   in my 30s,  who was told ! by  my mother that I would be looking after her( she had many many health issues). ... I say do not do this. Do not let them ride roughshod over you.  Do not let them guilt you that you are their child and it's your responsibility.    Do not let them move in.  You will never have a life", "NTA - it sounds as though you have never been a free woman.\n\nNO is a great word and it is time for you to use it.  This is not a good idea and your health will only suffer.\n\nAre you their only  child or are you the only person willing to deal with them?", "NTA", "NTA \n\nYour mother is abusive so is your father.....grilling a woman in her 40s is so wrong in so many ways. \n\nRefuse.  Say NO you are not moving in with me", "(They could AirB&B her old room to pay off their debts.)", "Do not even give them a spare key! I am sure your aunt left you the house for a reason.\n\nPlus, if you sold it to them, there's no way they would give you the amount it's actually worth.", "Try to get therapy to learn to stand up for yourself . NTA but say no", "NTA\n\nits your house, your rules \n\ndo whatever you want and don’t feel guilt, you should be able to do what you want without feeling trapped in your own home", "NTA…you are 46.  Stop letting your mom dictate your life.  “Uh what mom?   Sorry, nope.  We are not living together.  You will not be moving in with me.  And even if I was crazy enough to consider it, you will not be changing my home.”  When she asks questions, “you want to know this why?”  Sorry mom, no reason for you to know or ask these questions.  I am an adult living in my own.  You need to set your boundaries, be firm and stick by them.  Just tell mom no, or whatever your reply is to a question and do not leave it up for debate.  Walk away.  Or mom, I said no and that is final.  I am not talking about this anymore.  Leave, hang up or walk away.  Whatever you have to do.", "Nta. \nStraight up tell them no. You are an adult and you are allowed to do so. They are not allowed to move into your home without your consent, You could actually call the police and have them removed. Their situation is their own to figure out and deal with. You have given them enough, and your mom clearly doesn't seem to appreciate any of it. You did not have to become her carer, you could have told her to hire one. But you did it. Because let's be honest, any carer that she would have hired, probably would have quit long ago and she would have had a hard time finding another one based on her attitude."]}