{"id": 19227, "submission_id": "143i7md", "title": "AITA for not babysitting my niece’s stepsister", "selftext": "I (29f) have a niece, Amy (12). My sister passed away 3 years ago and Amy stays with her dad, Rick (37), who remarried and has a stepdaughter, Kate (4). Amy gets along OK with her stepmom and Kate.\n\nMy sister and I lost our parents quite a while back, so we pretty much only had each other. I was, therefore, doing everything I could to maintain contact with her and Amy even though I went to college half way across the country and after that took a job overseas. After my sister’s passing I regularly call and text Amy, letting her know I’m there for her. We are very close and she tells me a lot of things going on in her life and asks me for all kinds of advice which I am only happy to help.\n\nAlmost a year ago my job relocated me to a city under an hour away from where Rick and Amy live. It is a promotion of sorts so my hours are more flexible. I often drop by to see Amy and take her shopping or go to places we want to go, usually once a week. I always called Rick first to see if the family has any plan with Amy, but Rick and his wife hardly say no. Lately I notice that they try to ask if I can take Kate with me on these outings as well, but I always tell them no, as Kate is too young to enjoy most of our activities (salons, cooking classes, candle making etc.).\n\nAmy was to stay over at my house last Saturday because we would be looking at some summer activities together on Sunday. When I went to pick her up, Rick and his wife asked me if Kate could stay the night with me. Rick’s SIL was breaking up with her fiancé and needed their support. The wedding was like 2 weeks away and Rick’s wife was a bridesmaid, so there was a lot she needed to do. They said they would be back to pick the kids up on Sunday night.\n\nI told them no. I have no experience babysitting anyone that young by myself. I never even babysit Amy at 4! I said I don’t have a problem extending Amy’s stay, but I really can’t take Kate.\n\nRick was upset and said that Kate is Amy’s sister and thus my niece as well and I have been playing favorites long enough. His wife said that the kids really need their aunt right now.\n\nI stood firm and insisted on only taking Amy with me, as planned. They tried to tell me Kate is well behaved and they had all her things packed so it would be easy for me. I said they had a choice of letting Amy come with me or not, but I wouldn’t babysit Kate, end of discussion.\n\nI eventually took Amy but Rick called me AH for not helping out Amy’s familyI wonder if they were right and I was the AH.", "created_utc": 1686156145, "permalink": "/r/AmItheAsshole/comments/143i7md/aita_for_not_babysitting_my_nieces_stepsister/", "score": 259, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I refused to step in and babysit my niece’s stepsister when the parents had a non-medical family emergency. I still took in my niece so that could be seen as playing favorites and maybe I should just help babysit the kid.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. \n\nThey want a free babysitter.", "NTA.  Kate is not your family, Amy is.   It would be one thing if it was a sudden emergency but supporting a friend is not an emergency.   Stepmother needs to enlist her side of the family to help with Kate.   Be prepared tho, they’ll likely try to manipulate you by getting Amy to ask if Kate can come along in the future and you’ll have to figure out if it really is what Amy wants.", "NTA, i have babysat for 4 years now and trying to push a 4y/o onto someone who has no experience sitting for kids that young is a recipe for disaster. Good for you for standing up for yourself!", "NTA. The fact that they keep asking you to take Kate. They’re just trying it to get free childcare. Kate is not your niece and her being there will detract away from the time with Amy.", ">Rick was upset and said that Kate is Amy’s sister and thus my niece as well and I have been playing favorites long enough\n\nUm, no, a child wholly unrelated to you is not your  relative. She's your niece's stepsister. And you're not playing favorites, you're spending time with your niece.  Your brother in law is trying to manipulate the situation to fit his preferred narrative for free babysitting.", "NTA\n\nThey just want free babysitting.  Continue to say \"no\".\n\nAlso, if you have the ability to do so, you might start setting aside some money to help Amy with expenses for college or other plans.", "NTA they are trying to get you to babysit for free. Do not guilt and manipulate you.\n\nAlso I would suggest going ahead and speaking to a family lawyer. I figure it’s coming soon you either take both or you no longer get to see Amy. In this situation I think you would be eligible for grandparents rights considering your the only family Amy has on her moms side.\n\nI don’t understand where people think because your one child’s aunt that automatically makes you the half siblings or step siblings family. It’s not like that.\n\nYou and Amy have a right to spend time together with out the other child. Your not her aunt.", "NTA   why can't Rick  look after Amy?\nHe doesn't need to go with his wife,  does he?", "NTA - It’s the manipulation that gets me. “Can you please?” becomes “She is your family now (according to us)” and then “We’ve already packed for her and replanned your schedule to out liking.” No. That's not how family/schedules/life works. You should consider emailing/texting in a very firm but polite way that points these issues out and makes clear you will not be engaging in this way in the future. Additionally, it's more than shitty of them to interfere with her last connection to her mom. Gross.", "NTA.  Kate is NOT your niece and not your responsibility.  Having a 4 year old underfoot would wildly change the dynamic of Amy's visits with you and it's not fair to her.  You are her only connection to her mom and she deserves to have your undivided attention.", "NTA\n\nYou’re not spending time with Amy to provide babysitting services. You’re fostering a family link with one of your remaining kin, that’s something in the mutual interest of yourself and your niece and has nothing to do with her father’s new wife’s child.\n\nIf they keep up (or further escalate) their attempts at forcing Kate into your relationship with Amy it’s probably worth how much fuss you’re willing to kick up to stay in her life. She’s 12, it’s not much longer before she can have a more independent social life and six years until she’s an adult who can do as she pleases. Bottom line is you’re Amy’s last biological link to her mother, she has a right to have a relationship with you. One she doesn’t have to share with a step sister.\n\nStart documenting when they aggressively try foist Kate on you and why, never hurts to keep a record.", "I mean what are they going to be doing that they can’t also watch their kid.Good for you for standing your ground.", "NTA. Rick married into your family but, unless your family has chosen to maintain a familial relationship with him and his new family, his wife has not. There is no family obligation to her or Kate. Even if you did feel some kind of extended family bond with her, you already stated that you have no experience with young children and wouldn’t feel comfortable watching her. That alone would be enough for me to not want to leave my child with you.", "I don’t think you have to do anything with Kate. She’s not related to you. If you choose to do something with her great but you will never be the A-H for not doing something with her. She’s not your family unless you want her to be. Anyone that says you have to include her, is wrong. You don’t have to do anything.", "She is not your niece as well. That's not how that works in the slightest. SMH. I don't really understand this request or why people keep trying to make it. Kate is not even a half sister. \n\n>They tried to tell me Kate is well behaved and they had all her things packed so it would be easy for me.\n\nOh bs. Four year olds are hard. You're basically a stranger. Overnight requests are very difficult. NTA.", "NTA your former brother in laws step kid is not your niece by any stretch of the imagination. It might help to sit down with just your BIL and make sure he knows that you will not be babysitting for his wife's child. Let him know you don't want this to affect your relationship with your niece, she's already lost her mother she doesn't need to lose her aunt.", "Nta-But I would suggest you look into hiring a lawyer in case Amy’s father tries to limit your time with Amy.\n\nIf it goes that route you might be able to get court order visitations as you’re the only family left on Amy’s dead mother’s side it is important to maintain contact. Also the fact that Amy already has an attachment to you. \n\nYour BIL could have stayed with Kate while his wife handled her sister’s situation. They just want a free babysitter.", "What about the other side?\n\nDo the stepsister’s aunts and uncles babysit your niece?\n\nYou don’t want to hurt your niece by starting a “tit for tat”.", "This is a tough one, but I think NAH. You appear to see only Amy as part of your family, but Rick (and his wife) feel that you’re part of their entire family and hope you’ll have a relationship with Kate as well. \n\nI can’t fathom the extent of your feelings between losing your parents and your sister, deepest condolences for all this. It seems like Rick still thinks of you as a sister and wants to have you be part of their lives as a family, not just as part of Amy’s life. Is there room for developing closeness with them as a family unit, or is it too hurtful to spend much time around Rick? I don’t think anyone could fault you if that were the case. If there’s room for them, it does seem like they want you there.\n\nEdit: typo", "NAH.  I think that their request was reasonable, and your refusal was also reasonable.  I think Rick calling you an A-H was too far, and hopefully he'll apologize.  It sounds like parents were stressed.  But I think Rick's larger point that you are causing some drama in their family by leaving Kate out this frequently is also valid.  Of course that's going to hurt Kate's feelings, and every time you take Amy for something special, parents have to explain to a heartbroken four year old why Amy has a special aunt and she doesn't.  That's probably painful for Rick as well, but for Amy's sake, he's been dealing with it.  \n\nLook at it this way: you now have a chance to be a great aunt to two nieces, even if one is not biologically related to you.  No obligation certainly, but finding some time to include Kate would be the kind thing to do.  Maybe you and Amy can teach her how to make candles or bake cookies together?", "YTA I think you need you need to stay in their good graces because you have no legal right to see Amy.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (29f) have a niece, Amy (12). My sister passed away 3 years ago and Amy stays with her dad, Rick (37), who remarried and has a stepdaughter, Kate (4). Amy gets along OK with her stepmom and Kate.\n\nMy sister and I lost our parents quite a while back, so we pretty much only had each other. I was, therefore, doing everything I could to maintain contact with her and Amy even though I went to college half way across the country and after that took a job overseas. After my sister’s passing I regularly call and text Amy, letting her know I’m there for her. We are very close and she tells me a lot of things going on in her life and asks me for all kinds of advice which I am only happy to help.\n\nAlmost a year ago my job relocated me to a city under an hour away from where Rick and Amy live. It is a promotion of sorts so my hours are more flexible. I often drop by to see Amy and take her shopping or go to places we want to go, usually once a week. I always called Rick first to see if the family has any plan with Amy, but Rick and his wife hardly say no. Lately I notice that they try to ask if I can take Kate with me on these outings as well, but I always tell them no, as Kate is too young to enjoy most of our activities (salons, cooking classes, candle making etc.).\n\nAmy was to stay over at my house last Saturday because we would be looking at some summer activities together on Sunday. When I went to pick her up, Rick and his wife asked me if Kate could stay the night with me. Rick’s SIL was breaking up with her fiancé and needed their support. The wedding was like 2 weeks away and Rick’s wife was a bridesmaid, so there was a lot she needed to do. They said they would be back to pick the kids up on Sunday night.\n\nI told them no. I have no experience babysitting anyone that young by myself. I never even babysit Amy at 4! I said I don’t have a problem extending Amy’s stay, but I really can’t take Kate.\n\nRick was upset and said that Kate is Amy’s sister and thus my niece as well and I have been playing favorites long enough. His wife said that the kids really need their aunt right now.\n\nI stood firm and insisted on only taking Amy with me, as planned. They tried to tell me Kate is well behaved and they had all her things packed so it would be easy for me. I said they had a choice of letting Amy come with me or not, but I wouldn’t babysit Kate, end of discussion.\n\nI eventually took Amy but Rick called me AH for not helping out Amy’s familyI wonder if they were right and I was the AH.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA", "NTA - they're just looking to off-load Kate.", "NTA there is a massive age gap and activity interest gap.  She is not your niece nor is she the sister to your niece, she is stepsister.  You are the only connection she has left of her mom.  Kate has her mom's family, dad's family and Rick's family that can step up and watch her and do things with her.", "NTA\nKate is NOT your niece, she is not your sister’s child. \n\nYou are under NO obligation to take her and the whole notion of playing favorites is ridiculous.", "NTA, if there's not a more pressing safety issue necessitating a babysitter I think springing a 4yo on someone with no experience is too dangerous. How many things in your house are fine with Amy, who's old enough to know better, but dangerous for Kate? How well secured are those things? Do you know how high Kate can reach, how good she is at turning doorknobs, if she likes to leave the house without telling anyone? Can you kate-proof your home with no warning, while trying to watch Kate? Even if Amy helped while you moved all the breakables and anything chemical, it's a situation that would almost guarantee you missed something. If you were lucky Kate might not find whatever gets left within her reach, but it's too strong a possibility when the alternative is just that she stays home. Those are things that you might make work if it was a serious emergency, but they aren't worth it for this. And on top of that I don't know that I but that they NEED Kate gone for this. I think if you weren't taking Amy both girls would've been just fine at home. You aren't Kate's aunt, and they SHOULD be teaching her how families are different, and sometimes people don't share relatives, etc.", "NTA. Kate is not your responsibility.", ">His wife said that the kids really need their aunt right now.\n\nLMAO - \"in this difficult situation, where we want a free babysitter, the kids really need their aunt right now\".\n\nThis is a classic. NTA.", "NTA. They are taking the mick and trying to emotionally blackmail you into being a free babysitter. I", "Fortunately, Amy is already 12, so she should not be too easy to manipulate. Plus, she is probably not eager to do activities targeted towards her stepsister's age. Let's hope.", "This is what I was thinking… it is weird… NTA.", "The problem is OP isn't related to Kate. It is unfair to push OP to spend time with her. They should explain to her about the relationship between Amy and OP. He was widowed which is unfortunate but he can't expect his late wife's family to have a relationship with his future spouse's children.", "The problem is also that Kate is 4. There is a huge difference between watching a tween over night and watching  a toddler.", "Also I have a feeling that OP's occasional yes would turn into nonstop asks. That first yes is likely to open the floodgates.", "NTA.. she is not your niece and you have no bond or connection to her. They just want a free babysitter.. rude", "NTA Kate isn't your family", "NTA. Kids aren't packages to be parked wherever there is space. If you have no experience with 4 year olds and don't feel confident caring for Kate, then you don't do it, end of discussion. And claiming you are playing favourites by spending time with your motherless niece but not with her stepsister is just gaslighting. Kate is not related to you. They might have just as well criticized you for playing favourites because you didn't take all of Amy's classmates when you took Amy.", "NTA. Based on what you've written here, it sounds like you are the only thing your niece has left of her mother, who she no doubt remembers. You being there for her is probably something that she cherishes, and I can imagine she'd prefer to have your time together to herself. You don't have an obligation to the step-daughter of your brother-in-law.", "NTA. Kate is not your niece. Now, family isn't just blood - maybe someday you will see Kate as your niece! But you don't currently, and it sounds like Rick has done nothing to try to foster an actual relationship between you and Kate. Everything you mention doing with Amy is taking her out in public or to your house. If Rick wants you to be part of his whole family (instead of just Amy's aunt), he should be inviting YOU to join THEM for stuff, not just trying to pawn off Kate on you when it would make his life easier.\n\nNow. If he were doing that, you would still have every right to turn him down. You don't HAVE to see his whole family as family. But if he wants you to, HE needs to be making the effort. If he actually has been inviting you to family movie nights and birthday parties and outings, and Kate has been making adorable drawings for you, then I would switch to N A H but I'm pretty sure you would have mentioned that.", "NTA\n\nI have sisters and we have a pretty wide age gap. We went out with grandparents and aunts on separate occasions, because what we wanted to do was very different.\n\nPlus, this 4 year old does not know you (!), you do not know her, and she is not your nieces' sister.", "Let me see if I have this right. Rick wants to send his Four year old stepchild (just barely out of the toddler stage) to what is essentially a Stranger's home (Kate does not know you personally and has never been in your home presumably) to sleep over. \n\nHow does he know your home is safe for her? Do you have anything to accommodate a small child? Is she toilet trained? Does she have allergies? Hell that's not even considering if Kate would even be comfortable in a stranger's home with only her much older stepsister as someone familiar to her.\n\nNTA, Rick needs to reassess his priorities here. Kate isn't your kid, nor is she your niece.", "Are you within your rights to say no, of course. Was it the right thing to do in the situation? IMO, no. Taking care of a 4 year old for one night is not a huge deal. They needed you in an urgent situation. You are NTA for saying no, but I wouldn't be surprised if they aren't as eager for you to take Amy and do stuff anymore. It sounds like they've been incredibly open to you continuing to see Amy and have a close relationship with her. They didn't have to be that way. We've seen that in many cases in this forum. You are NTA, but you aren't a very empathetic or kind person.", "NTA", "Nta. They needed a babysitter and they were going to guilt you into it.", "NTA", "NTA, although it would be good to try and have a bit of a relationship with the little one, since her parents could begin withholding your niece in punishment. They way they went about it was really awful and Amy's Dad could be taking care of Kate, while her mother helped her friend (that poor girl!). I would just reiterate that you don't have a toddler friendly home at all, and maybe talk about the age at which you would feel comfortable having her over, if at all. \n\nI'm relieved your getting such reasonable responses. Some poor guy wanted to take his niece for ice cream and got ripped a new one for not taking her two older stepsiblings.", "What does Amy want? I bet she likes the alone time with aunt. NTA", "NTA, your family is Amy and not Kate", "NTA. They’re trying to use you as an unpaid babysitter  for the 4 year old. Good for you for standing your ground. You are not the Aunt of the other child. You’re Amy’s Aunt.", "NTA\nYou are the only living link for Amy to her mom. You share her loss. \nKatie and her mom never met your sister. \n\nIt's manipulative for Amy's dad and his second wife to try to force you to duplicate the unique bond you share with your niece and give her unrelated stepsister your time, energy and resources \"to be fair.\" Katie's mom is alive and lives with her. How is that \"fair\" to Amy? Every relationship is unique, as the two people are. Demanding a motherless girl \"share\" you with her much younger stepsister shows jealousy and greedy disregard for the feelings and relationship they want to tear into to get a piece for themselves.\n\nAmy shares her dad and her home with Katie all of the time. Her \"girl time\" away with you is special for a number of reasons. It is NOT a bargaining chip to be used to overrule your autonomy for those parents' convenience.", "NTA. First of all even if Kate was related to you, you don’t fob a 4 year old onto an unsuspecting relative when they show up at your door. Second, you’re Amy’s maternal family. Just Amy’s. This is what people need to accept when they decide to blend families. Kids growing up in the same household will be treated differently and it’s the parents responsibility to make sure it doesn’t end in resentment. For example Kate has a dad that’s not Rick. Is it reasonable to send Amy off with Kate when she has a visit with her dad? After all, they’re sisters right? I doubt Kate’s dad would think so when he’s asked to take a preteen with him when he comes to pick up his 4 year old.\n\nThis needs to be sorted out before you get to “AITA for leaving my niece’s stepsister out of my inheritance” or “AITA for not giving my niece’s stepsister my deceased sister’s jewellery”", "Her mom died so she gets to be Aunt Throwaway’s favorite niece. That’s ok. \n\nIf you were to start to take her, it’s more than likely you’d never like her as much and then it could *actually* become a problem.", "NTA  \nTHere is a HUGE difference between 12 and 4.  You can't do the same things with two children that age, you have to gear everything to the 4 year old.  \n\nI'm sure Amy is THRILLED you are taking her away from the little sister for alone time", "Nta\n\nKate is not your niece, so you owe her nothing.", "NTA simply bc if you are not prepared for/comfortable with taking care of a toddler then you shouldn’t!", "NTA. Even if she *were* your niece (debatable), you have no obligation to watch a four year old overnight if you don’t feel prepared/comfortable doing that!\n\nAlso, side question, why can’t Rick watch his stepdaughter while his wife is helping her sister?", "NTA - sounds like you might be open/willing to bring Kate very occasionally when she’s old enough to participate and enjoy the activities. \n\nThe fact that they had her bags packed and ready means they 100% knew what they were doing. They hoped to catch you off guard and you’d just agree. Also, while I think 4 year olds can be awesome, they can be so difficult. Old enough to mostly articulate but still young enough where reasoning and articulation are not there. It stands to reason that someone who isn’t comfortable with young kids and sending a young kid with a mostly stranger is not a good parental decision", "I think the part that has me stuck is that the BIL is going. The wife’s friend needs HER support. Not his.", "Or the kids real bio father since she isn't Rick's", "Exactly. OP, you need to sit your brother in law down and say that no, Kate is not your niece. She’s your niece’s stepsister. You’re related to your niece through your late sister. You really need to spell this out to them. \nTell them that your main objective here is to maintain a relationship with Amy because her mother isn’t here anymore. That you have a special connection. \nObviously you’re NTA but you really need to have a very stern and frank conversation with your bil - obviously  without his new wife present. \n\nGood luck and if you feel like it, keep us updated", "Reddit is a strange place - there's another person being roasted on another thread for not taking her niece's stepsiblings out for ice-cream with them because \"they're family now and you should make an effort, why are you excluding these teenagers you've known for 2 years\"", "They should be incredibly grateful that OP has been such a great aunt, and a great mentor!", "I absolutely see your point, and my extended family includes people who are not blood relatives, but I disagree with your judgment. If Rick and his wife see OP as part of their family, or want her to be, THEY should be putting in the effort. Unless OP left a bunch of details out, they're trying to turn her into Kate's family by getting her (OP) to do them favors. That's a selfish AH move. They want her to be THEIR family without being HER family.\n\nThe non-AH approach for Rick and his wife would be inviting OP to family movie nights, dinner, outings, etc. If they were doing that and OP wasn't interested, that would be N A H because she'd still have the right to decide she just wants to maintain a special relationship with her sister's daughter.", "The fact that they keep asking you to take Kate. They’re just trying it to get free childcare. NAT", "It's just an opportunity to send Kate off to start the routine of her being included with Amy.", "Valid points, thanks for the breakdown.", "Maybe, but I didn't get that from the post.  It sounded to me like they've just been dealing with a left-out kid.  OP us definitely within her rights to refuse to care for Kate, but I just said it would be kind of her to form a relationship with the whole family.  If it's too painful or she just doesn't want to, that's fair too.  I stand by NAH.", "It would be very kind. With that said, dad has a 12-year-old (very independent age) and frequent breaks thanks to Aunt. Mom has a 4-year-old and (presumably) no breaks. That situation very often ends up with the free babysitter being overrun with babysitting duties (or with requests to do so)."]}