{"id": 19264, "submission_id": "143y9yo", "title": "AITA for calling out my husband over a food order", "selftext": "Edit: we talked about it and he said that he was sorry for laughing and not acknowledging me. He’s the best husband ever and I really love and appreciate him. Thank you all for your comments! \n\nToday my husband (23M) & I (23F) got some subway. He went alone and I asked him to just follow the same order I had sent him yesterday via Snapchat. I fell asleep and woke up later and went to go eat my sandwich. I noticed it wasn’t fully what I ordered so I asked him if it was his or mine. He confirmed it was mine so I started to eat it. I was confused because some things were missing and other things added. I noticed spinach inside and asked him about it. He said he added spinach instead of lettuce because it’s a superfood and therefore healthier. He knows I like spinach so he said that he didn’t think it was a big deal. I said it wasn’t a big deal if he forgot what I wanted or just messed up with the ingredients, but it kind of annoyed me that he purposely changed something in my order because it was “healthier.” \n\nI got irritated as we kept talking about it and told him it was a crappy thing to do because it insinuates that I don’t know how to make choices for myself, or healthy choices at that. He said “what got into you after your nap.” \n\nAITA for getting annoyed and calling him out? I also made a comment that if a guy did this to me on a first date there probably wouldn’t be a second. Was that a really crappy thing to say? \n\nEdit: this post might make me seem like a lazy, entitled wife. I’ve been feeling under the weather hence why we’ve had subway two days in a row and he went alone.\n \nEDIT: I happily ate the sandwich. I’m not overly picky and it was whatever, what bothered me was how be blew off my feelings and laughed at me for calling him out. He didn’t say anything apologetic and basically just brushed me off.", "created_utc": 1686195769, "permalink": "/r/AmItheAsshole/comments/143y9yo/aita_for_calling_out_my_husband_over_a_food_order/", "score": 166, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I started a mini argument over my food order and I feel like I was over the top\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Nta, I wouldn't be okay with someone implying they know what I should have and it's different to what I want. That's just a weird off-putting power play", "NTA.   I'd be completely annoyed if my husband implied that he knew what I should be eating better than I did.   If he or the restaurant made a mistake that would be one thing, but that isn't what happened.  He knew exactly what you wanted and decided that he knew what you should eat and you didn't.", "NTA- what's up with people getting mad at you for eating the sandwich? You're allowed to be miffed that he changed your order.", "NTA I can’t imagine changing my husband’s order for it to be “healthier”, that’s just rude. Is he normally that controlling? It’s insulting. The “What got into you” comment makes it even worse.    \n\n\nIt’s like that trope of “nice guys” ordering a salad for their date because it’s healthier.", " He said he added spinach instead of lettuce because it’s a superfood and therefore healthier. He knows I like spinach so he said that he didn’t think it was a big deal. I said it wasn’t a big deal if he forgot what I wanted or just messed up with the ingredients.\n\nNot a great train of thought that's for sure, on quite a few levels.", "NTA", "Isn't Lettuce literally 99% water? How tf is that unhealthy lmao?", "Nta\nHe sounds controlling. It was weird of him to change the order. If it was my husband I would jump to him thinking I need to lose weight or something. I feel it's insensitive and rude. I feel like if he wants the two of you to have some sort of lifestyle change he should have the balls to discuss it and not just start switching orders and your food choices at his own whim like HE gets to pick out and decide what you get to eat, with his input? Wtf", "[deleted]", "Yeah I think I would be a little annoyed if my husband purposely changed my order. Who cares if I like spinach, maybe I don’t feel like spinach today which is why I asked for lettuce. But you are coming off as a little ungrateful. Did you thank him for picking up dinner? \n\nI’m going to say ESH because you’re making a big deal over a sandwich and he is not just acknowledging that you’re a person who doesn’t like their order fucked with and will keep that in mind next time. It seems like you two could communicate better.", "YTA. You say you were feeling under the weather and your husband probably switched to spinach since it’s healthier to get you feeling better. Sorry he was considerate of your health when you’re sick!", "I think you’re reading too much into leafy greens.", "Changed my answer. YTA. If what was on the sandwich didn’t matter than what even is the point. What’s he apologizing for if you happily ate your sandwich? When the sandwich isn’t the problem?", "YTA, total overreaction to spinach.", "YTA.\n\nIs this a hill to die on?", "ESH\n\n> we’ve had subway two days in a row\n\nOh, y'all need to be better to yourselves.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n\n\nToday my husband (23M) & I (23F) got some subway. He went alone and I asked him to just follow the same order I had sent him yesterday via Snapchat. I fell asleep and woke up later and went to go eat my sandwich. I noticed it wasn’t fully what I ordered so I asked him if it was his or mine. He confirmed it was mine so I started to eat it. I was confused because some things were missing and other things added. I noticed spinach inside and asked him about it. He said he added spinach instead of lettuce because it’s a superfood and therefore healthier. He knows I like spinach so he said that he didn’t think it was a big deal. I said it wasn’t a big deal if he forgot what I wanted or just messed up with the ingredients, but it kind of annoyed me that he purposely changed something in my order because it was “healthier.” \n\nI got irritated as we kept talking about it and told him it was a crappy thing to do because it insinuates that I don’t know how to make choices for myself, or healthy choices at that. He said “what got into you after your nap.” \n\nAITA for getting annoyed and calling him out? I also made a comment that if a guy did this to me on a first date there probably wouldn’t be a second. Was that a really crappy thing to say? \n\nEdit: this post might make me seem like a lazy, entitled wife. I’ve been feeling under the weather hence why we’ve had subway two days in a row and he went alone.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "[deleted]", "You should do the same thing for him the next time you order. Tit for tat.", "Also, spinach AND lettuce is a great way to go ....", "Read one a while ago (maybe on Quora?): first date, they order, she goes to the restroom,  food arrives and hers is lobster instead of the chicken she ordered. She tells the waiter; date says I changed your order because I'm not cheap. She walked.", "She said she’s under the weather or sick so I’m guessing husband switched it wanting his wife to get better. OP is an AH", "I just didn’t appreciate how be blew off my feelings for the most part. I happily ate the sandwich, spinach and all, it was just the way he reacted that upset me", "She seems like the AH on this to me. Husband switched it from lettuce to spinach since she’s sick. He probably thought hey I want my wife to not be sick so let me get her something healthier! And it sounds like he only switched the lettuce. She’s an AH for being mad over that. How inconsiderate of him to want his wife to eat something healthy while she’s sick!", "I’m not going to waste food, but i also don’t like when someone goes out of their way to give me something I don’t want", "I do, but not on certain things. Like sandwiches.", "Honestly? Fuck the spinach. Op already knows she likes spinach. If op wanted spinach, she would have bloody asked for it. There is no real health factor to consider here, just imposed will.", "She’s under the weather so changing her order is an ahole move. She doesn’t feel well, she told him exactly what she wanted — and he changed it. \n\nWhat next? Pat her on the head because hubby knows best??? Fuck that shit. \n\nHe should be happy she even ate it. If I wasn’t feeling well and my partner took it upon himself to change my food without asking, he might be wearing it.", "OP you’re an AH. He wanted you to eat something healthy cause you’re sick! Must suck to have such a considerate husband who cares about having a healthy wife", "Exactly!!!\n\nForgot. NTA", "The husband probably wanted her to feel better and get something in healthier gosh what an inconsiderate asshole he is! When I’m sick and I ask for food I’d be happy with whatever is brought to me because at least that person cares enough to bring me food and take care of me.\nMy parents did the same thing to me once when I was younger except they forgot one item but I wasn’t mad. I was grateful they still went out of their way to take care of me by getting me outside food instead of cooking food for me. Be for real.\nYou threatening to have your partner “wear” whatever food he got wrong just screams abuse. \nOP even said she didn’t care so why make a big deal over spinach! She’s an entitled brat", "Nonsense. Grown people don’t need their partner changing their order because “he knows better.” \n\nThat’s rude, controlling and dismissive of OP as an adult that is fully capable (even when sick) of deciding what she wants to eat.", ">except they forgot one item\n\nthere is a HUGE difference between 'oh, sorry, I forgot you wanted lettuce' and 'Yes, I know you wanted lettuce, but I know better than you what you should eat so I got you spinach.'   It has nothing to do with the spinach and everything to do with deciding you know better than someone else what they should be eating.", "@Bar-Hopper-Cow95 I ate the food and thanked him multiple times for picking it up. We got in a mini argument about it and then moved on with our day. I am not an entitled brat, but thank you very much.", "Do y’all not have loving partners? LOL I doubt he did it because he knows better. He wanted his wife to eat something healthier so her body can get those vitamins and health benefits. Damn he’s such a controlling monster!!!! How dare he!!!!! Next thing y’all are gonna say is he better not dare ask his wife to take her meds because that’s so controlling of him :’(", "He didn’t change it because he “knows better” OP SAID herself he changed it because it’s a superfood. So it’s easy to see he wanted his wife to eat the healthier version so she can start feeling better. But gosh what a monster! The horror!! She even said she didn’t care and still ate it. You guys are acting like he put dog shit or said “NO YOURE GONNA EAT THIS BECAUSE I SAID THATS HOW I WANT YOUR SANDWICH TO BE!” Jfc", "The spinach is not the issue here!", "Bffr when someone tells you what they want on a sandwich, it's not an invitation for you to innovate. Some leaves on a sub is not going to make or break ops illness. Saying he did it for health benefits is absolutely ridiculous. All he did was decide op couldn't have what she asked for.", "Oh god not the room for art, I can't do this again", "Bffr dude It’s the same as when mom makes you chicken noodle soup instead of letting you eat ice cream or whatever shit you want when you’re sick. They want you to eat the healthy stuff to get better. I guess the husband is a monster for caring about his wife getting healthy food in when she’s sick 🤒 i doubt he’ll ever do it again and we’ll get OP coming back “AITA for yelling at my husband that he doesn’t care about my health?” \nY’all are funny lol", "No. It's not. He's not her parent. He didn't decide to make her something healthy and home made. He changed a leaf on one crappy sub, changing the taste and texture of her whole meal, for a bullshit reason. \n\nComparing lettuce and spinach to soup and icecream is ludicrous and even if it were about soup and icecream, *she's a grown adult* not a child for him to raise. \n\nShe is an adult who asked for a specific sandwich and he decided she couldn't have what she wanted. That's it.", "You need to learn to pick your fights", "It's like my husband getting me a subway years ago to bring to work.  He got salad  yum,  ham  yum   . NO CHEESE  No Mayo or sauce.  Everyone at work just looked at him, like dude , we only work with her and know cheese is her thing. (Like its own food group thing) \nHow could you, married , not get that.\n\n ( He remembered to get the cookies for the co workers though.)  Seriously took a while to get over that.", "I kind of assume her husband going \"Damn what a gr8 idea, thanks\". Now THAT would be a plottwist youd not be ready for.", "Thats not what anyone said?\n\nTheres a lot of drinks and foods that are MORE HEALTHY than water, as in they ADD vitamins and whatnot that your body needs. That doesnt make water (lettuce here) unhealthy", "First of all, there is so little difference in nutrients between a handful of lettuce and a handful of spinach that the idea of switching them to improve her health is laughable and makes you sound like an idiot.\nI hope your SO reads this and takes it to heart. The next time you're under the weather and just really want a nice cold drink to soothe your sore throat, don't be surprised if he or she tosses you an emergen-c packet and a bottle of room temperature water bc that would be wayyyy healthier for you. Because of course a grown woman shouldn't dare question her husband when it comes to him deciding what she should and shouldn't be consuming. \nThe whole sandwich thing didn't end up being a big deal between them, but your repeated attacks on OP in others comments plus this one shows that you are one big misogynist. I sincerely hope that anyone who gets food for you in the future fucks with your order. And there will always be a good reason, I'm sure. Oh you wanted fries? Well I got you a salad bc that much salt is bad for you. And you wanted a beer, but I got you wine because heart health!", "lol i hardly ever get in with these so i am unrepentant", "NTA. He’s policing your food as a power play and that’s never ok.", "NTA that was weird. Good that he apologized and I hope this was a one time incident and not something he does constantly.", "NTA. Next time switch out the ingredients in his sandwich.", "Eh, there was a famous American sailor who proved otherwise.", "Funny response, but seriously, Popeye was part of a marketing campaign to get kids to eat spinach.", "And it turned out years later it's not true. Spinach doesn't actually have that much iron.", "Popeye lied to me????", "'Unfortunately the propaganda was fraudulent; German chemists reinvestigating the iron content of Spinach had shown in the 1930s that the original workers had put the decimal point in the wrong place and made a tenfold overesti- mate of its value. Spinach is no better for you than cabbage, Brussels sprouts, or broccoli.'", "ESH...yeah he should have followed your order but you reading that into a personal insult or him looking down on you is a bit much.  If this is your reaction of a minor vegetable substitution what are you going to do when you have a real issue between the two of you?", "I get you. The typical lettuce put on a sub adds crunch. I like spinach, but I don't want it on a sub. \n\nNTA", "NTA isn't subway bread really unhealthy though? I'm sure a handful of spinach won't make it healthy", "It’s not even about the sandwich to me. If their conversation happened something like this they would come away NAH, for me at least.\n\n\nHey, thanks for picking up sandwiches. This isn’t what I ordered though, what happened?\n\nOh, I though spinach would be healthier since it’s a superfood.\n\nActually I was really looking forward to crisp lettuce on this sandwich. Could you ask next time before changing my order?\n\nSure no problem.", "I believe that spinach actually does have a fairly high iron content, it’s just that it’s inaccessible to humans due to the way we digest plant foods", "Don't listen to an idiot who clearly has the emotional intelligence of a peanut. Just because someone does something for you does not mean you need to be grateful, especially when it was done incorrectly for no damn reason. \"Oh, you cleaned my room! (and also moved every single item I ever told you not to touch)\" \"You cooked me dinner! (And used ingredients I've stated multiple times I hate)\" \"You bought me jewelry! (And ignored the hundreds of conversations about what kind of styles I like)\" The quality of gestures means something OP. \n\nI'm not going to tell you to divorce him because that's insane to do off of one slice of life on Reddit. But think about the actual effort put into your individual gestures for one another. You got married really young, don't let a lack of life experience or early attachment blind you to the realities of your relationship because you have decades to go. I hope this was just a bad day/misunderstanding, but if its not and this kind of behavior is a pattern, consider if this is really the kind of effort you'll want at 30, 40, 50, if you have kids etc. Good luck."]}