{"id": 19284, "submission_id": "1449pzp", "title": "AITA for telling my sister the division of labor in her house isn’t equal?", "selftext": "I (27f) have an older sister Jane (30f). Jane has been married to her husband John (32m) for 9 years, but they’ve been together since she was 17. I have been with mu girlfriend Sam (26f) for 4 years and we’ve lived together for 3. \n\nJane and I are quite close and usually tell each other most things, including relationship issues. Full disclosure: for the past few years as I’ve grown up, I realised I don’t really like John, I think he’s a bit of an ass but I’ve kept it to myself unless my sister specifically asked. But at the weekend Jane and I were having lunch at my house, and she was telling me how worn out she’s been feeling lately. She works full time and is the primary earner in their house because John works part time and plays soccer for a local team on the weekends. She’s also in the pre-treatment phase of IVF. She explained to me that she feels when she’s home she’s always either cleaning or cooking. \n\nShe commented that I’ve never ever complained about chores around the house or that Sam doesn’t do any.  I told her that it’s because we split things equally. At the beginning of each week we jointly agree upon which chores in specific need to be done that week, we both have chores that we love but the other hates so we take care of those ourselves, and we divide both the planning and execution of the remaining ones equally. Jane gave me the run down of chore splits and it basically comes down to: he does a few short chores which she plans, and she does everything else including planning of chores they do together like grocery shopping. I told her that she’s probably been feeling worn down because she’s burned out from having to plan everything he does as well as take care of her own stuff for so long. She said that that’s unfair , he does do things and I replied saying that he physically does things but she does all of the planning and that even if the execution of those chores was equal, the division of labor still wouldn’t be. She does all of the emotional labor as well as her physical labor and that the division isn’t even close to equal. She got mad and left, she hasn’t spoken to me since which is unusual. I told our mom because I was worried and she told me I was an AH and overstepped because I don’t like John. I didn’t think that was true but now I’m second guessing. AITA?", "created_utc": 1686231903, "permalink": "/r/AmItheAsshole/comments/1449pzp/aita_for_telling_my_sister_the_division_of_labor/", "score": 3468, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I told my sister her and her husband aren’t equal when she brought up the topic and thought she was asking for my opinion but she might not have been. I implied that her husband barely does anything\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA - the truth hurts. Maybe you said it in a dismissive way. Probably could have asked a few more questions. But yeah- you are right and it hurts.    \n\nIs this guy a paid soccer player or just for funsies? his life sounds great! Wife does everything, he works PT, and gets to play soccer. Man- good times!", "NTA\n\nYou are 100% correct. Your sister is doing both the bulk of the physical labour AND the ‘mental load.’ This will only get worse once she has the children she’s working hard for, unless it is handled through both individual and couples therapy.\n\nHere are some links that may help you communicate about this and show it’s a thing, if you find that it’s possible in future to talk more with your sister. Now is probably not the time, unfortunately.\n\n[This comic is a go-to on the topic](https://www.theguardian.com/world/2017/may/26/gender-wars-household-chores-comic)\n\nhttps://www.mindbodygreen.com/articles/what-is-the-mental-load\n\nhttps://www.bbc.com/worklife/article/20210518-the-hidden-load-how-thinking-of-everything-holds-mums-back", "NTA- Sister is mad because you pointed out that John doesn't do much.", "and she’s paying for IVF to have kids with this man 😵‍💫", "He works part time and spends the rest of his time playing, she works full time and runs the house, and she’s mad at you for pointing it out? 😂\n\nNTA, but she should be prepared to do all the kid work herself while John continues to go play outside.", "NTA\n\nYou spoke the truth. Jane didn't want to hear the truth. I hope Jane wakes up before the ivf works.", "NTA but it might not be a terrible idea to apologize for offending her. Just for the sole fact that she's gonna need a ton of support when she eventually leaves him. You've said your piece, now leave it be and try really really hard to avoid any topics that might make it seem like you're coming across as judgemental of her partner. \n\nIt's super common for people who are not ready to hear the truth to double down hard. She's just not in the place to properly take in what you said but you've planted the seed of truth in her subconscious. It is now entirely in her hands to decide to either think on what you said or to discard it entirely.", "NTA\n\nIt appears to be (by your sisters reaction) it's a sensitive subject for her. I'm a firm believer if you don't want advice, don't ask for an opinion. \n\nNow that you know it's a sensitive subject for her, simply change the subject or let her know you're choosing not to give advice / suggestions for her relationship.", "NTA- what are they going to do when a baby is in the mix?", "NTA. Your sister is pissed bc she knows you are right. She is creating her own unhappiness by enabling him. And she knows it", "NTA. It's probably something your sister need to hear, but which isn't easy to hear. For me, it took reading this comic - https://english.emmaclit.com/2017/05/20/you-shouldve-asked/ - to understand that I was carrying that stuff around in my mind all the time, even if my partner is very considerate and did not need reminders of chores. It was exhausting, but I think many women are raised to do that. Maybe she'll recognise herself in this? In the end, although she asked you why you're never complaining about chores, this is probably a realisation that she has to come to herself (with some gentle guidance).", "NTA, and your sister needs to REALLY think about if bringing in a baby is smart since she’s already so worn down- especially since IVF often involves multiples.", "NTA, you're right and she probably doesn't want to admit that, give her time and support", "NTA - you were talking about a problem & suggested what you thought the issue is. You weren’t being insulting like \"John's lazy.\" You stated your observations. She took it very personally for reasons unknown. Honestly, sometimes the truth hurts to hear.", "NTA and your sister seems to be in denial of what you told her. She doesn’t want to see it and she lashed out at you for pointing it out. On top of the pre-treatment for IVF may be messing with her emotions and hormones", "NTA. She's mad because she knows you're right. It is easier to be mad at you for pointing it out than to admit that she spent a decade with a loser that lets her carry the burden of their house and that she is PAYING to try to have a kid with.", "NTA - she was complaining to you and you gave her your opinion. She's probably only mad because she knows that it's true that her husband doesn't help out enough.", "NTA. Your sister is mad because you tell her everything she knows but deliberately trying to ignore.", "I’m actually really curious what a typical chore chart looks like for you. I’m always looking for better ways to get my husband to pull his weight.", "If it happened just as you said, you are NTA. \nAre you sure your dislike of John didn’t come through your words too much?", "NTA. Send her the mental load cartoon when things calm down.  \n\nUnfortunately when it comes to other peoples relationships best not to double down when they disagree with you. You can’t win when you fight with family.  She’s venting. Let her. She asks you what your home life is like. You answer. Don’t judge her. Let it sink in for her. Move on. She’s not really asking for your help or to change things.", "NTA.  OP sure as he'll isn't wrong, but it is up to sister to talk to husband and implement a better division of labor that works for their household (whatever that may look like for them).  Sister I think reacted the way she did because perhaps she just wanted to vent and then got hit with a hard truth she wasn't ready to handle.  Good luck to her if/when a baby comes and she's doing the work for three while John plays aging HS jock.", "NTA - though I think it’s possible delivery could be a factor - you were looking out for your sister and it sounds like you were generally respectful and just trying to help", "Nta. She asked. And she probably hasn’t called you not because she’s mad but because she’s trying to figure out now to prove you wrong and making it seem like it is fair. Or you got her thinking of her relationship and is mad at herself for doing so much while only works part time. And it’s not your fault she asked just give her time and space.", "NTA. She's probably just feeling stuck and embarrassed because she loves the dude and thought he was doing pretty okay for a man, and you kinda shown on light on the fact that it's not the case, there are men out there who do pull their weight in the home.\n\nThis is the downside of marrying young, you don't know what to expect out of a partner due to inexperience, and you get settled into a groove of bad behavior that honestly should have been addressed and ironed out before marriage was even on the table. I married young too, I get it. Give her some time to process her feelings, maybe a week or so, and check in on her later.", "NTA. She is your sister and you were telling her the truth. This is just a “shoot the messenger” situation. Let her vent and be there for her.", "NAH but when someone is telling you that you are wrong about something in their relationship, it's best not to double down and keep explaining why you think you're right. At the end of the day you don't really know and she does, so should just drop it at this point. You will be TA if you keep pushing but as is, it's not a massive deal.", "NTA", "NTA, that’s the truth and I think your sister knows it (at least deep down) and she’s bitter about it", "NTA for giving her your perspective while you were talking about it. If you keep pushing your view when she's not willing to accept it then this could change though.", "NTA. \n\nAnd I’ve been saying for years THIS is exactly why there is so much opposition to gay marriage and to the changing of gender norms. The husbands have brainwashed/gaslighted their wives for so long and dont want them to see that “equality” could mean that they might actually have to do stuff around the house, too.", "Ahh yes. Sounds like you’ve disrupted the image of her “funhouse.” First of all, absolutely NTA. Secondly, the Funhouse is a concept that my 84 year old grandmother talks about in the context of dysfunctional marriages. She saw women in the 1950’s and 60’s marry men that were mistreating them in some manner or another. Instead of these women leaving those men to find someone better, they pretend everything is ok, living their lives in the Funhouse, where the illusion of satisfaction is alive. Your sister got with John at such a young age that she hasn’t shopped around at other men. At this point, your sister is probably terrified to leave this marriage and start all over, so she’s trying to make this work. My only parting advice to you would be to not bring this topic up again. You’ve said your piece once and you sister will never forget that. She reacted this way because she knows you are right so repeating this discussion won’t add anything new.", "You are 100% right, and probably 100% TA, although it's hard to tell. You clearly don't like John, as you pointed out. You mentioned that he does the physical labor, but you never talk about what that is. There's a good chance that you were rude and/or condescending about her husband, which is an AH move. It's also her relationship, so while it's totally understandable to explain how you do things in your relationship, it may not be appropriate to start telling her what's wrong with her relationship. \n\nAll that said, it sounds like your sister is married to a bum, and if she thinks she's overwhelmed now, it's going to be a lot worse with a baby that he will probably fall short on caring for. Tough situation, and a good example where being TA might be the right move since you're trying to support and care for your sister.", "NTA but it probably would have gone better if you only talked about your experience - \"my partner and I decided that the mental load needed to be split in half, as well as the physical act of doing chores\". No matter your intentions or how well you phrase it, commenting on how someone else runs their life can sound like a judgment. Your sister is probably reacting to that feeling of being judged more than the advice you gave her. She also didn't even ask for advice, she asked what you did at home to make chores feel equal.", "NTA for pointing it out the first time but YTA for insisting you’re right after she tells you you’re not being fair and that he does do things. There’s no emotional labor in saying “You do the dishes while I fold laundry” or whatever chores their planning. Nobody is sitting a desk painstakingly planning chores for hours.", "Possibly YTA. With your dislike for John I imagine your words did not come out as nice as they did here. I mean you’re not wrong but sis might not have taken it as help and possibly felt criticized. \n\nIf I were you (which I’m not so feel free to handle as you please) id reach out first and let her know that you care about her and would like to give some tips on how you and your partner lean on each other.", "Going against the grain and saying YTA. She didn’t come to you with a problem about her life or marriage, she was simply mentioning that she’s tired and overwhelmed and you took it on yourself to tell her the reasons her partner and marriage suck. The reality is that you aren’t there most of the time and it has nothing to do with you. She was most likely hoping for the support of her sister while she goes through something very taxing (IVF and infertility), and instead you criticized her husband and marriage. Who wants to stay and listen to someone belittle the people they care about? It was unwelcome.", "Eh, I'll go with a soft YTA. You're likely right about your sister's dynamic, that's not being put into question. But something I've had to learn long ago with my wife is that often when she comes to me with issues or problems, she comes to vent and just wants to be heard, she doesn't come for solutions or to have her life or choices be picked apart. I think it was OK to point out the existence of the mental load and how the split might not be as even as she thought it was, but a soft YTA for pushing after she said you were being unfair. You could've just said \"Sure, if you say so\" and leave it at that. You would have still planted a seed and not antagonized your sister. She's tired, no doubt very emotional from the IVF hormones... It's not really about who's right or not at this point, it's about supporting your sister and respecting her choices.", "Let's see...\n\nHe:\n1. Works part time \n2. Attends to his hobby \n3. Helps out partially if he's told\n\nAnd she:\n1. Works full time\n2. Manages the house full time\n3. Feels exhausted. \n4. But she wants to add in a baby... when (return to the top)\n\n\nI'm trying to make this make sense.  Not sure how she thinks that's going to go for her. \n\nHonestly, people who put themselves in these senseless loops just want a brick wall to vent to occasionally. It re-energizes them so they can get back on the hampster wheel to nowhere because in some unfathomable way, it works for them. They don't want our insights nor do they ask for it. When they're finally tied off it, they'll let you know. \n\nAlso,  (and I'm sure you know this) not all relationships look like yours, and comparing straws is a pretty condescending thing to do. Comes off like my kids when one is struggling and the other does the \"good kid\" bit: \"I'M not doing those things, right mommy? I'M doing it RIGHT, right mommy???AMIRIGHT?????\" and naturally, that pisses off the other kid, who now thinks their sib is an AH.\n\nYour not an AH. Just that part was AH-ish.", "YMBTA, Everyone is allowed to vent to their close friends and family about being tired and run down. That doesn't mean it has to be a big deal. Whatever the breakdown of labour it, it obviously works in their relationship and has done for a long time. If that dynamic is tiring your sister out, she should be able to comment on that without you going in on her partner for everything you don't like about him. It sounds like she was venting and you escalated it to bring up your concerns about her relationship which seems to work for her. You're NTA but you're not faultless.", "Eh…this is so mild in the grand scheme of things & can be easily fixed, but, you’re *kinda* the asshole for implying her husband’s an asshole, as I feel their division of labor still seems quite fair. I think your mom nailed it. 😕", "YTA “emotional labour of chores” lol", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (27f) have an older sister Jane (30f). Jane has been married to her husband John (32m) for 9 years, but they’ve been together since she was 17. I have been with mu girlfriend Sam (26f) for 4 years and we’ve lived together for 3. \n\nJane and I are quite close and usually tell each other most things, including relationship issues. Full disclosure: for the past few years as I’ve grown up, I realised I don’t really like John, I think he’s a bit of an ass but I’ve kept it to myself unless my sister specifically asked. But at the weekend Jane and I were having lunch at my house, and she was telling me how worn out she’s been feeling lately. She works full time and is the primary earner in their house because John works part time and plays soccer for a local team on the weekends. She’s also in the pre-treatment phase of IVF. She explained to me that she feels when she’s home she’s always either cleaning or cooking. \n\nShe commented that I’ve never ever complained about chores around the house or that Sam doesn’t do any.  I told her that it’s because we split things equally. At the beginning of each week we jointly agree upon which chores in specific need to be done that week, we both have chores that we love but the other hates so we take care of those ourselves, and we divide both the planning and execution of the remaining ones equally. Jane gave me the run down of chore splits and it basically comes down to: he does a few short chores which she plans, and she does everything else including planning of chores they do together like grocery shopping. I told her that she’s probably been feeling worn down because she’s burned out from having to plan everything he does as well as take care of her own stuff for so long. She said that that’s unfair , he does do things and I replied saying that he physically does things but she does all of the planning and that even if the execution of those chores was equal, the division of labor still wouldn’t be. She does all of the emotional labor as well as her physical labor and that the division isn’t even close to equal. She got mad and left, she hasn’t spoken to me since which is unusual. I told our mom because I was worried and she told me I was an AH and overstepped because I don’t like John. I didn’t think that was true but now I’m second guessing. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA, she asked!", "NTA - she's probably kind of embarrassed about putting up with him, but that's hardly your fault.", "NTA it’s fine to divide things any way that works for them but if she’s wondering why she’s struggling it’s because the split favours her doing the majority of the work. I’ll say though that the majority of straight couples have to work hard on this because most men have been socialised with their mother doing the majority without that work actually being visible, there’s time for them both to get this sorted if they are willing", "NTA. \n\nSometimes the truth hurts, and my armchair psychologist guess is that you touched a nerve by articulating something your sister deep-down knows to be the truth but has been diligently working to ignore. \n\nIf that's the case, I'm not surprised she acted the way she did. How she probably gets by is by believing nothing's wrong with how they do things (or more accurately, how SHE does all the things). \n\nIt's just going to get worse if they have a kid. I hope she's ready to hear the truth before that happens.", "NTA\n\nIf your sister is in the middle of IVF stuff, she might be even more fatigued from that as well...and...not to generalize but maybe more hormonal too...so even if you didn't mean it in a hurtful/hateful way...she might have taken it even more strongly than she normally would have.  You might want to reach out...message her...if you have spare time...maybe ask how the IVF is going and if you can do anything to help...if you have the extra time? Plan a spa day if she's into that? I've never had a sister so I'm guessing at stuff she might like.", "NTA, he is definitely freeloading, and a fair division of labor - very much including mental and emotional - is super important for a couple, and even more so for (future) parents. He needs to stand up and do shit without the need to be asked and explained for the 20th times how to put a socks in the washing machine, etc.\n\nThat being said, I don't think your timing was great. If you've never undergone IVF, you might not realize how it takes a toll on your mind and body. The appointments, the pre-treatment stress, the recurring ultrasounds - and all the time out from work needed to get all these tests done, followed very soon by the daily (sometimes several times a day) injections, the hormonal outbreak, more tests and ultrasounds, then the egg retrieval in the ER, the wait to hear from embryology, the embryo transfer, and then the 2WW... We'd all say it was worth it if we end up having a viable pregnancy and baby, but it is fucking hard.\n\nCriticizing her and her marriage (even though John definitely sounds like a loser to me) at this specific moment isn't really helping. Maybe, ask how she is doing instead. She needs support. And if John isn't willing to support her, I'd say she needs even more support from her family.\n\nEdit: punctuation", "It would have been better to send her a link to something on what a mental load is. Explain that this is probably something you should read and consider. She could have figured it out on her own and decided what to do. \n\nInstead, you are in the middle, and that's why you are getting attacked. It's better to be a listener and to offer references without making application.  \n\nNext time. NAH", "YTA. Even though you were fine to comment about the chore chart, you were out of line saying her husband doesn't emotionally support Jane. They have been married nine years and are starting IVF (the hormones are also making your sis emotional). You didn't need to BIL-hate right now. Ideally, they should get a house cleaner every other week. It makes a world of difference. And why does anyone need to cook all the time? She can just say she's tired and it's \"fend for yourself\" night, but that's her choice.", "Maybe getting a service like \"Hello Fresh\" is a good idea for her. You select some meals for the coming week (or you go with whatever the app chooses for you) and they deliver the ingredients with an easy to cook recipe. \nNo more meal planning and way less grocery shopping.", "It’s possible my tone could have seemed judgmental or dismissive even though that would have been unintentional of course. \n\nHe doesn’t get paid for the soccer, it’s just for fun.", "These are great resources. \n\nOP, getting Jane to listen will be tricky. I recommend apologizing for upsetting her, letting her know that you’ve read about this issue in hetero relationships, and was too quick to judge that it was an issue in hers. Then maybe offer these resources “if she’s curious”. But also let her know that your relationship is important and that  you won’t bring it up again.", "[Fair Play cards](https://theeverymom.com/fair-play-cards/)", "Wait why'd you link The Guardian for the comic? She has a website.\n\nhttps://english.emmaclit.com/2017/05/20/you-shouldve-asked/", "My mind immediately screamed \"Nooooo\".", "Right? Just wait till there’s a kid in the mix. Seeds already planted for single parenting. Sounds like she already has a kid.\nNTA", "That comic, really open up another word\nThank you 👏🏻", "I wanna know OP's breakdown for myself", "Google \"the post it note challenge\"!!", "Well, I really enjoy doing laundry and my girlfriend loves doing the dishes so we both always do those. We both don’t mind vacuuming so we usually divide that in half and we usually do it based on which rooms we think will take the longest that week and we do one of the long rooms each (i’ll do the living room and she’ll do the kitchen for example) and the remaining rooms are usually divided by who has the most time on that week. We meal plan together on a Sunday, then write our list and go grocery shopping together and if we forget something either I’ll pick it up on the way home from the gym or she’ll pick it up on the way home from the office depending on when we notice we forgot it. I walk the dog in the morning and she walks him at night during the week and at weekends we walk him together. I do the wiping of surfaces with wipes stuff once a week (usually on a Monday), and she does it again a couple days later (Wednesday, usually) so nothing really gets the chance to build up and it takes way less time. I make note of trash collecting days and she takes the trash out for a couple of weeks and then we switch for a couple of weeks (our city only collects trash every 10 days, but there are different pick ups for different types of trash once a week). I feed the dog in the morning and she feeds him at night. I cook 3 dinners a week and she cooks 3 dinners a week and then we usually get takeout once a week, we’re responsible for our own breakfast and lunch since I’m an early riser and she definitely isn’t. For things that only happen occasionally like deep cleaning the bathroom or other rooms we usually pick a date like once a month on a Sunday and I do half of the tasks we agree need done and she does the other half. We both play sports recreationally (but regularly) so even though I usually do our laundry, we’re each responsible for our own gear. \n\nWe also babysit for her sister during the week because we both work irregular hours so we’re usually at home while her sister is working. So in terms of childcare: I always help with math and language homework, Sam helps with science and everything else (for context, he’s 8). We alternate school drop offs in the morning depending on our work schedules. Usually we’ll both take him to school on Monday, and then Sam takes him on Tuesdays and Wednesdays and I take him on Thursdays and Fridays. His mom picks him up on a Monday because she finishes early, but at night the opposite of who drops him off picks him up. We both take him to after school clubs/soccer practice. On nights he has to stay with us we divide the night time routine based on his preferences so I read him his story because he prefers when I do it and Sam makes sure he brushes his teeth/goes to the bathroom/ has showered. We eat together so he eats with us and whatever who ever cooked that night made but occasionally he’ll ask for something different and we usually do that together because it’s quicker. \n\nBasically we divide all household tasks into personal chores (being responsible for our own gear for example) and communal (everything that involves both of us) and childcare. Then we break it down into things that need to be done everyday, things that need to be done once or twice a week and things that only need to be done once a month or so and we divide them based on enjoyment, time constraints and then just what needs to be done. We decide on these things together, who is responsible for each thing together and the rough time frame they’ll be done and it really avoids having arguments like “you didn’t do x” “well you didn’t ask me to do x” because we make sure we both know what we’re doing and have agreed on what needs to be done. It also reduces the amount of time most of the tasks take because we both have more energy to do our part and they pretty much always get done (unless we’re sick or something obviously). \n\nI hope this helps! I feel like I’ve forgotten something.", "Not OP but my husband and I do something similar. We have permanently assigned chores (based mostly on who dislikes things more) and discuss splitting up the rest on a more ad hoc basis. \n\nMine: bathrooms, laundry, cooking 1-2 days/week, dishes/counters when he cooks for us, weeding the garden.  \nHis: dusting, vacuuming, cooking 3-4 days/week, dishes/counters when I cook, hedge trimming/leaf blowing/bigger garden tasks (we don't have a lawn).  \nAd hoc: taking out the garbage, emptying the dishwasher, deep cleaning the kitchen, mopping, grocery shopping (we make the list together), pet care\n\nWe usually do our big cleans at the same time, so whoever is done with their \"big\" tasks (bathrooms, dusting, vacuuming) first will do the kitchen and/or mopping.", "I did try to be conscious of what I was saying but it’s possible.", "She doesn't feel comfortable standing up to her husband who sounds like a real ass, so she is taking it out on OP.", "I disagree. She should keep pushing it because her sister is about to become a domestic slave. She shouldn’t have children with this dude", "Because….?", "This is the way to go.  But she may be defensive - dude works part time and plays soccer for fun - no rational way that he shouldn't be doing MORE at home.", "If you don’t think that having to plan out when and where he does his chores so that they actually get done is emotional labor I don’t know what to tell you. If you don’t think that planning out what they’re going to eat and making a grocery list even though they grocery shop together most of the time, I don’t know what to tell you.", "Mental load is absolutely a relationship killer. \n\nAn adult who is equally contributing around the house should not need to be asked or told what to do. That leaves her with the burden of keeping track of everything that needs to be done, and what tools/resources need to be available in order for it to happen. She takes accountability for the task, while he’s “helping”. \n\nIt’s exhausting. \n\nAn adult should be perfectly capable of noticing that washing powder is running low, and going to the supermarket to purchase more. And since they’re going to the supermarket, check the fridge and pantry for anything else that needs to be purchased. She shouldn’t have to ask or tell him anything. \n\nHe’s not a child.", "It sounds like, because you don’t like the guy, you’re taking the one thing he’s not doing and twisting it into some arduous task that your sister is forced to do in order to justify disliking him.", "\nShe did come to her with a problem about her life, specifically that she's always cleaning and cooking when she's at home. \n\nThe sister invited OP to respond: \n\n> She commented that I've never ever complained about chores in the house or that Sam doesn't do any \n\nAlso, don't complain to people about a topic if you don't want to hear their opinion on it. It's natural for the people who care about you to address the issue in response.", "Sometimes people just want to vent.", ">She commented that I’ve never ever complained about chores around the house or that Sam doesn’t do any\n\nit wasn't venting, the sister literally pointed out \"hey you never mention having this problem i keep having\" and OP explained that she doesn't have the problem to mention.", "Okay, but is it working in their relationship, or is it tiring OP's sister out? You do get that those 2 are in contradiction...", "How is the division of labour fair? She brings in most of the money and does most of the housework how is that fair? She’s his second mother", "How's it fair? He works part time and plays soccer.. it's not at all fair on her.", "It’s the emotional labor of having to parent her husband, who apparently needs to be directed where and when to do chores.", "https://english.emmaclit.com/2017/05/20/you-shouldve-asked/", "Hobbies are awesome! But so is shared division of labor and a good relationship. Sounds like you are being a good sister\n Good luck", "Sis. You did the right thing. This is something that needs to be addressed before there is a baby.", "I think if that was the case, your sister would have told you. Her silence instead means you touched an open wound, to me. Obviously, im just guessing. NTA", "That is an absolutely bonkers reach based on limited information from someone who has admitted a bias towards the guy. Wild Reddit cliché' lol.\n\nEDIT: A real life Reddit Moment. Not interested in debating further, I think you're absolutely out of your mind to agree with this extreme of a sentiment based off this and I am not changing my mind on it lol.", "Because stuff and things.", "I plan chores every day and if you think the process of identifying something that needs to be done and then delegating that work to someone else is emotionally exhausting then I feel sorry for you.", "If the guy can’t think for himself that’s a separate issue. Saying “Honey, the yard needs mowed” is not at all exhausting.", "EXACTLY this. 👏 Having the same discussion down below, it’s exhausting.", "I would have agreed if OPs sister hadn’t said that the division doesn’t bother her and she felt OP was being unfair to her. OP’s sister has agency over her life and if she doesn’t think it’s an issue, it’s not an issue. OP pushed on someone else’s relationship and business too much. What feels like emotional labor to OP may not be to her sister. Clearly she hurt her sister when she insisted the husband is a bum, and the sister is right to be hurt by that after she drew the boundary (this is fine for me and my relationship) and OP crossed it.", "He does some grocery every once in a while and plays soccer every weekend while she is undergoing costly, invasive and extremely exhausting fertility procedures (plus doing like 90% of the chorses and working full time). It's definitely more than fair and if anything, she should be more grateful that he brings milk home once in a while when she asks him and list exactly the product, brand, size and cost needed...\n\n/s", "My point is that the *planning* of the things, which OP seems fixated on as an emotional burden, is not that big of a deal (as the sister said). \n\nLook, bottom line is, if the married couple agree that the division of labor is fair, why should the OP get involved? It’s none of her business.", "It’s fair because SHE DEEMED IT FAIR. This isn’t difficult…the wife thinks it’s fair (& since she does, I’m assuming he probably does alot more around the house than the OP is characterizing here), so just leave them be! \n\nSerious question: Why in the world would you insert yourself in someone else’s marriage issues, that the married couple themselves do not even feel is an issue, unless there are real stakes involved (abuse, etc.)??", "Remember OPs sister works full-time and is taking hormones for IVF. So yes, leaving work and then immediately having to think, \"I need to text my husband to hoover the house, and then I need to buy food and cleaning products so husband can do the dishes after I cook. And I mustn't forget my hormone shots\", that is added mental load, otherwise known as stress from life admin. Very different from being able to leave work thinking, \"my turn to cook, I should rest before today's hormones\" and that's it because you trust your partner to see what needs to be done and do it. \n\nRemember John only works part-time. So aside from playing his favourite sports for fun and his part-time work, he doesn't have any life admin stress because he just waits for his wife to tell him what chores he should do that day.", "A grown ass adult, who are typically the men in these situations, should not need to be directed in simple household maintenance or duties.", "I'm guessing you either don't have kids or like OP's brother in law, don't carry your own weight when it comes to chores and planning.", "You seem oddly fixated on this - that may be your experience but it might be worth considering that others clearly don’t feel the same.", "Plus, everyone is saying the husband shouldn’t need to be told, he should know. We’re not mind readers. There are things that need done and there are things that a spouse wants done. We’re only hearing one side.", "You're flat out wrong here.", "Mental load is absolutely a big deal", "If it's \"not the big of a deal\", why isn't the husband planning it? He works part-time, so he should have more free time to work on the plans.", "https://english.emmaclit.com/2017/05/20/you-shouldve-asked/", "Her sister should not have made the comparison between the two relationships if she didn’t want to hear what makes them different. She made it OP’s business by asking about OP’s division of labour.", "Wow so you’ve never heard of mental load then? Read up on it seriously.\n\nWhy should she have to manage him like a child when they are both grown ups? She has common sense to see what needs doing around the house so why can’t he also without having to be told like a child? \n\nWhy does he get to only do a few easy chores that are planned out for him and she does everything else AND works more hours?\n\nThis division of labour is obviously not fair at all, that is why sister was defensive.", "Just because you deem something fair, doesn't mean it actually is. You are very much wrong about this. The husband is a literal teenager in an adults body. Works part time, plays soccer on the weekend with his boys, while his wife works fulltime and takes care of the house fulltime. In what world do you think that's fair?", "And then also check that he either has or has not done it- I hate chasing my husband to do shit.  If I’ve asked you, it’s important.  If I have to ask you again I’m pissed because you’re a child and not a grown up.", "OP never said he’s playing “for fun” but he’s on a local team. So he’s most likely working really hard on his side gig, if that’s what is is, on top of part time work and chores. Like I said NTA for pointing out what she thought was the problem but definitely for pushing the issue after being told that’s not the case. All the things you mentioned do sound exhausting but did OP say IVF or work was the problem? No, she immediately blamed the husband and I’m gonna go out on a limb and assume she didn’t say it as eloquently as she did in this post.\n\nI work 7 days a week, full time university, do all the cooking, shopping, and split chores with my wife while juggling 4 kids. It exhausting but planning what chores need done requires zero effort.", "I’m not here to make judgements on their marriage, that’s OPs job apparently.", "Ok, then shouldn’t OP also consider people don’t feel the same? Especially after being told she’s wrong by her sister?", "Yup. This is the nuttiest, lowest-stakes BS in the world compared to REAL marriage problems, & people are all up in arms about it, defending a wife who doesn’t want/need to be defended against her hubs. Bizarre.", "Sorry you don’t agree, but it’s nobody else’s business how a married couple divides up chores. If they feel it’s equal (which the sister said she did), then it is NOT YOUR BUSINESS & you should stay out of it. 🤷🏼‍♀️", "The “mental load” of creating a chore list?? Come on, man…that’s like a basic life function. I’ll happily spend 3 minutes of my day planning all the shit that needs to get done so my hubs can spend an hour doing most of the physical labor.", "I didn’t deem it fair…SHE DID. The wife. 50% of the marriage. If she accepts his schedule/choices, then why in the world would you argue with them about it? Leave them be.", "Lol, local teams don't make money. That is absolutely a hobby, not a side job. If he was playing sports professionally he would have a very different schedule. Dude is 100% spending most of his free time having fun", "I'm going to guess if we asked your wife she'd give a different answer.\n\nIn OP's example, the sister plans all and does the majority of the chores, while being the main breadwinner. Husband does some chores, works part time and dedicates his weekends to his hobby.\n\nYou - *it's not that hard, I don't know why she's complaining*\n\nOf course.", "https://www.reddit.com/r/AmItheAsshole/comments/1449pzp/aita_for_telling_my_sister_the_division_of_labor/jnecaar?utm_medium=android_app&utm_source=share&context=3", "Hmmmm, I think the sister’s reaction is that of someone being told something she didn’t want to hear, rather than not agreeing. “That doesn’t happen in our relationship” isn’t likely to trigger an emotional response. \n\nI suspect you may also be getting hung up on OP’s use of “emotional load” when she’s actually referring to “mental load”. \n\nRegardless of whether you see carrying the mental load as an issue, it seems pretty clear that the husband (working PT and participating in his sporting hobby) is not contributing nearly the same to the household as his wife.", "So you're balancing the mental load against the physical load, by having your husband do most of the physical work?  LOL, what are you arguing for here?   You seem to weigh mental load quite heavily.", "If he’s playing in a soccer club then, no he’s not, but if he’s playing for a semi-pro league and trying to make it big then he could be which is why I said “if that’s what it is”. OP only said a local team. Maybe he’s trying to make it big because if you’re playing for fun, you can work full time.", "That might be an accurate explanation of her reaction but even if that’s 100% true, once she said that’s unfair and her husband does do things, she should have dropped it. Like I said NTA for pointing it out, but TA for pushing it.", "Never comment on another person's relationship. \n\nEven if you're right they feel attacked.", "NTA she brought up the conversation, and you made her realize what's happening in her own home.  It's not really you she's mad at, it's her husband for being lazy and unhelpful, but she's probably embarrassed too.  \n\nIf you feel you came off harsh, you can always reach out and say \"I hope I didn't upset you the other day, I didn't mean to sound judgmental.  I just want you to be happy and not feel so stressed.\"", "N-T-A. Sometimes you gotta call out the unequal division of labor, even if it ruffles feathers.", "NTA\n\nWhy do majority of straight men thinks the household is the woman's responsibility?", "NTA \n\nShe shouldn’t have asked and you wouldn’t have told her. More than likely she knew you were right and she’s too embarrassed to admit it.", "The amount of people that ask questions and then get offended when they receive an answer.... NTA. She asked you why you didn't complain about your partner not doing chores and you gave a fair and detailed explanation. She probably wanted to hear that you have it just as bad or worse, but instead found that her younger sister has a more considerate partner than she does. If she feels this way now, stretched thin and tired, adding children to the list of things she will have to do primarily by herself isn't going to be good. Emotional labor is real labor, and maybe having to confront her current and possible future reality were upsetting. But she shouldn't be mad at you, when all you did was make an accurate observation.", "NTA.\n\nIt’s stunning she’s shelling out $50,000+ in IVF treatments to have a baby with a man who works part-time and cannot purchase food or clean a toilet without supervision. Doesn’t she realize she already has a baby?\n\nAnd if she’s burnt out now? Imagine how it’ll be when a baby gets here!", "NTA. You held a mirror up to her about her relationship and she doesn't like it. But as they say, don't ask questions if you can't handle the answers. \n\nAlso, I'm a firm believer that you should be consistently supportive of loved ones but there are times when you need to speak a truth. You would only be the AH if you kept hounding her about this.", "YTA for interfering in her marriage due to hating her husband.  If she’s not happy with the division of labor than it’s up to her to complain about it, not you as it’s none of your business.  If she was unhappy about her marriage than she is the one that should bring it ip, not someone who hates her husband and actively wants the marriage to fail.", "Might not be a popular opinion but NAH (well, except for John).\n\nAs an FYI: the pre-treatment and IVF are fucking BRUTAL. Your hormones are ALL over the place, as well as being completely wiped out. That's why your sister is taking it so hard and may be in a bad place for a while.", "Y kinda TA.  Unless you misrepresented this situation, she did not ASK you to diagnose her marital problems, which makes you TA, even if, we all know, you're absolutely right. And it's mostly the way you told her. \n\nPeople have to make their own mistakes.  They do. I'm sorry, and I'm speaking from experience.  People told me my then husband was a dirtbag and I didn't listen.  Guess what? He was a dirtbag but I was too blinded by LUV to see it.  \n\nBut here's the thing. Do you know who I did not turn to when the poop hit the fan about my husband?  The people who looked down their noses at me and snottily acted like their marriages were perfect and mine is wrong and they had no problem telling me so. \n\nYour sister is eventually going to need someone on her side, but the way you handled this? you might have permanently burnt that bridge. Not cool sistering.", "I think you meant well, but yta. You also can't tell her she has an ugly baby if it turns out she does. There are just some lines that get tough after marriage and kids and stuff. You probably wouldn't like it if she were criticizing Sam either, but even if you didn't mind, she does. \n\nI hope you work it out soon. I'm sure she needs you.", "NTA\n\nShe might be huet because she just wanted to vent or she is hurt because she feels stupid - you still told her an important truth that is a regular problem for many couples.\n\nI saw a chart in another thread today that lets you analyze labor division, let me go find it while this comment helps me find my way back here...\n\n\nIt was posted under this comment I wrote with some links, might be helpful here, too, the Emma comic was already mentioned:\n\n\n\"I'm just going to post some links to take a look at:\n\n[You should’ve asked](https://english.emmaclit.com/2017/05/20/you-shouldve-asked/)\n\n[She Divorced Me Because I Left Dishes By The Sink](https://www.huffpost.com/entry/she-divorced-me-i-left-dishes-by-the-sink_b_9055288)\n\n[Women Aren't Nags—We're Just Fed Up.](https://www.harpersbazaar.com/culture/features/a12063822/emotional-labor-gender-equality/)\n\n\nIn his eyes the domestic labor is your responsibility. He is there to \"help\" occasionally. Newsflash: It is not \"helping\" if you are taking care of your own f* household. Just like you can't babysit your own children, you parent them.\n\n\nEdit: This problem is a regular occurrence in various threads, this one isn't even a day old:\n\n[Living like my husband](https://www.reddit.com/r/TwoXChromosomes/comments/142omoe/im_currently_living_like_my_husband_does/?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=share_button)\"\n\n\n\nu/MdmeLibrarian commented\n\n\"I like this checklist of household labor division, because it breaks out the childcare and appointment setting too:\n\nhttp://oliver-uploads-aus.s3.amazonaws.com/2018/05/09/08/10/35/535/WORK180_Family_Chores_Checklist.pdf\n\nI remember it being very eye opening to several redditors the first time I saw it posted, especially because of how it breaks out the emotional tasks associated with child rearing.\"\n\nThe checklist seems like a great starting point for reflection.", "8u77", "YTA. The idea that everything has to always be 50/50 is childish.", "NTA and i honestly wonder if she's too stressed/overworked and if that's part of their fertility issues. Sometimes I just can't believe people who have all the earning potential in their households still get stuck in relationships with spouses like this.", "NAH. You’re definitely not an AH for saying this, I think it’s supportive of your sister to recognise how much she does. But she’s not an AH either for being upset and needing space, although she could’ve tried to talk it out with you but maybe she’ll do that once she’s had a think. Sounds like John might be an AH but hard to tell as you admittedly don’t like him.", "NTA she asked you answered", "NTA - Jane brought up the subject and explained in detail how it works in her relationship. It's not your fault that you gave your opinion once invited to do so. \n\nMaybe your tone could've been the problem? But given that you and your sister are quite close, I imagine she would've understood your intentions. You did mention she's going through IVF pre-treatment. Idk what that looks like medically but I'm sure it's a ton of pressure on her physically and emotionally, which may be why she reacted that way.", "NTA for speaking the truth, which is what really upset your sister, YTA for speaking the truth when I think your sister was just venting and just wanted to let some steam off.   But…overall NTA.  What does your sister think it is going to be like if and when she has a baby?  If she thinks she is tired now, just wait until that kid comes along.", "NTA.  In my experience (as a gay woman), a lot of heterosexual people do not understand how unequal their divison of labor is, or that it actually does not *have* to be that way.  We statistically have more even splits than straight couples.  Straight women have been socialized to be grateful for any indoor help or childcare their husband does, and it can create a messed up dynamic. \n\nYou're not wrong for pointing it out to your sister, but she's likely going to be resistant to it and feel like you're judging her, even though it doesn't sound like you are.\n\n(Required caveat that some straight couples recognized mental labor and do have equal splits.  But statistically y'all do not have as even spits as queer couples, particularly women.)", "She didn't like the truth bomb, but you were NTA for telling her.", "NTA, she's reacting negatively because she realises you're right but she knows John is too of an asshat to have the same routine with her. Classic case of blaming the messenger", "She is upset because she knows you are correct and doesn’t want to see the issue in her relationship yet.", "NTA. She was venting and didn't want to hear advice. But she needs to figure things out before she has a baby. Who is taking care of the baby? Taking off for doctor's appointments? Changing their schedule because school/daycare is closed? Who will be getting up with the baby every night? \n\nIf she is upset now it will be 100% worse when they start having children.", "NTA\n\nYour sister asked a question and you answered it.  She specifically asked for your input around her being exhausted and why you don't complain about division of chores in your home.\n\nIf you had just randomly brought it up without her prompting you would be in the wrong, but she asked and it isn't your fault she doesn't like the answer (likely because she knows it's true)", "NTA - you dont like john because he treats your sister like dirt, and likely been \"training\" her for years to keep her compliant.  She asked - you answered and it challenged her whole life paradigm.  Oh well.  Shell get over it, or not. but at least you can look yourself in the mirror and know you tried to help her.   If you think you were too harsh, apologize for your delivery , but not yoru message. .", "NTA, she’s mad because she knows it is true.  She’s mad because she doesn’t know how to change it…", "Ivf is an emotional roller coaster, your sister may have over reacted not only bcs of that but also bcs it sounds like your correct and she's physically and emotionally exhausted as well. I think your NTA in this situation but if you guys are close let her know you didn't mean to overstep that you were just worried about her and it was a conversation you two were having that made you feel comfortable sharing your feelings. I don't think she's the AH really either, just an emotionally charged topic that touched some feelings. I hope this settles down as soon as possible between y'all. Your relationship as sisters and friends is extremely valuable. Best to you.", "NTA \n\nThe cat was gonna come out of the bag, and it's nice that you're looking out for your sister's livelihood", "NTA - if Jane is not happy, she needs to address that with John. If she vents, confides, unloads on others, the others are free to give their opinion.\n\nJane may have been offended because either (a) it hit too close to the truth; or (b) she overstated the case. (I'm biased, since I carried 80% of the load during my marriage, but since my ex had the martyr syndrome, she acted like she was doing everything). I don't know Jane, maybe Jane too has the martyr syndrome.\n\nOne of the common themes as well in certain relationships is that some people just want to vent, and don't actually want to hear a solution to their problem. This is commonly pointed out between men and women where one party (usually the woman but not always) wants to vent and is bothered if the other (usually the man but not always) offers potential solutions.\n\nThis ties into the martyr syndrome - if the problem is solved and the cause for complaint is removed, the self-appointed martyr has no more reason to complain, and loses his or her status as a victim. Victimhood is part of certain people's identities.\n\nThat said again, NTA. You gave your opinion and offered a solution.", "NTA, you probably touched a nerve but you were right, and you said it out of concern for your sister and because it came up naturally in the conversation.", "NTA she's projecting her anger and frustration on you, but it's likely it's because she's realizing that you're right but she's really not ready to confront her husband about it or she knows confronting him won't do any good. Just give her some time to process it.", "NTH at all. She got mad because she realized you were correct and probably felt a little stupid for enabling it. \n\nThat said I want to know more about how your planning system works. My girl is feeling like your sister only I WANT to do chores. I just never know what she wants done and what to prioritize and usually wind up doing the wrong thing or less important task and she is not really good about communicating her needs. We’ve tried a chore calendar and even then there are problems. \nFor instance she’ll write on mine “living room” I assume that means pick up, tidy up vacuum what have you do I’ll do that and then I move on and next thing I know she’s in the living room mad trying to adjust the rug because it wasn’t square and the couch pillowcases need washed which we don’t do every time, and now she’s disappointed because I didn’t instinctively know they were dirty because the cat slept on one all day for the 4th time since the last wash? \n\nIdk man something’s got to give. I’d love to be able to bring a new solution to the table to try.", "NTA\n\nPeople who are delusional don't want to wake up from their fantasy. Still, if you don't want to ear an answer don't ask the question and if you don't want someone opinion don't complain about it to them. \n\nAnd there is clearly no reason to get mad at what you said. It's not fairly distributed chores, if she is alright with it, then good for her. No reason to get mad seriously. And if she think it's fair, she might as well think the earth is flat and 2+2 equal -25. At this point it's just a faith and nothing else, and you can't reason about faith.", "NTA she doesnt want to see or hear the truth you cant reason with people like that", "NTA - I would tell her next time about reconsidering having a baby. Who will take care of the baby? Obv her. You did right by saying what you said and your mom being quite about it does not help anyone.\n\nAnd yeah I don't like John either.", "NTA. Also, if she works full time and he works part time, the division shouldn't be equal but unbalanced in her favour, it's common sense. Plus: it is tiresome itself if you have to deal with a grown up boy who needs to be told what to do", "NTA.  This is your sister and you said it because you care and I think she needs to hear it. Also if she gets pregnant this will only get significantly worse. I have a feeling that she got so mad because she knows this is true. From your description John sounds lazy, works part time and then she has to direct him on what to do around the house.. absolutely not. Maybe just try to be gentle with her because I’m sure she does love him, but they probably need some changes on their household.", "NTA. I don't even think you were too blunt about it. It sounds tactful. But you're sister didn't realise she wasn't ready to hear the truth. Your mum's complicit with misogyny. Understandable since gender disparity and misogyny were even more normalised for older generations. Though they do enable abuse. Also, you BIL is also financially abusing your sister. Even according to patriarchy he's not doing his traditional part of the job. Terrible idea to bring children into the equation. It's just gonna get worse. And he'll know he has her trapped in hell (unless she wises up and leaves him).", "NTA but:\n\n\"Hey sis, obviousky you're upset with me, I don't entirely know how you are feeling, but I suspect you felt attacked or criticized, and I am sorry for making you feel that way. Sometimes I forget that when people are venting, they don't need me analyzing the situation, they just need me to listen. I'm working on getting better with that, but it's clearly a work in progress. Please let me know when you are ready to talk. I love you!", "Been together since they were 17... different stroke for different folks", "NTA. I want John's life! \nHis typical week: 20 hours of work, 10 hours of soccer, 40 hours sleep, 3 hours chores, 47 hours laying around and/or drinking beers with his friends!", "NTA\n\nShe asked you how come you never complain. You explained. Sounds like she’s embarrassed that she’s got a dead beat as a husband.", "NTA. Your sister *is* doing way more than her husband. Unfortunately, that's not uncommon in heterosexual relationships. Has she seen [this comic](https://english.emmaclit.com/2017/05/20/you-shouldve-asked/) about the mental load of chores at home, and how it wears down the person doing said load? It might be beneficial for her to read it.", "John is a bum. He works part time while his wife works full time and he barely does anything around the house while using joint income to indulge what is probably an expensive hobby. \n\nShe already feels burnt out and wants to reproduce with this guy? Not smart. Hard to sympathize with her. \n\nIs she planning on not taking time off and going back to work so she can provide for the family? And then likely having to resume chores AND childcare responsibilities? \n\nShe is mad because you said out loud what she's thinking and she was looking for someone to lie to her so she could continue pretending it wasn't that bad.\n\nNta.", "NTA. she asked a question, and you gave her an honest answer/perspective. She wasn't ready or couldn't handle the truth.", "NTA\n\nIf she is feeling tired/burnt out now IMO it will only get worse when she is pregnant and after she has the baby unless John decides he will step up.  \n\nI will say perhaps the information might have been better accepted if you had stopped at telling how you and your gf’s system has worked for you including adjusting when one is not up to it so neither of you gets overwhelmed.   \n\nI suspect your sister knows the workload at her place is not distributed fairly. However she likely didn’t want to hear her husband being criticized (even if it was true). \n\nYou might consider sending her an email to apologize for overstepping.", "Nta. She asked a question you answered truthfully. And honestly seeing at how this guy treats your sister, you shouldn't like him. Hopefully she will use this conversation to reflect.", "OP Sister's household and how it runs aren't your responsibility or right to plan/criticize.  Sister mush run it how it works for her.  Sounds like she has a raw deal.  If asked about the propriety of IVF, I'd simply point out to her that after a child is born, she will be primary bread-winner, primary-parent to both her husband and her child.  If she goes for this, she will have to live with the decision.  Perhaps Sister is asking for help, don't give it if you don't want to be part of BIL's permanent support group, explaining to Sister why you won't be supporting BIL.  Stop talking about this to family members, let them provide support to Sister instead.  I guess YTA for overstepping your role in Sister's life/marriage.  However, I agree with your opinion.  But Sister has to make her own decisions, however foolish they may appear to OP.", "NTA what would the division of labor be after they have a child lol", "NTA, you did the right thing and I hope she realizes it. Sometimes the truth hurts... Hopefully she'll gtfo before she gets pregnant - she'll be even more tired with a second child to take care of.", "NTA but be patient with her. She was upset because she was experiencing cognitive dissonance. You rocked her understanding of her own relationship, and it shook her up.", "NTA. Many people have never given a lot of thought to all the mental labor most women do in a relationship. She’s probably dealing with a hurt ego because she knows what you said is true.", "NTA. She asked, but this is a classic example of \"don't shoot the messenger\". You spoke honestly after she initiated the conversation. As soon as she said \"that's unfair\" and she started to defend him, you should have stopped talking because she doesn't want help. She wants to vent.  She will defend him forever until she is ready to be treated better.  I agree with you 1000% re: John, but it doesn't matter who agrees with you.  You pointed out clear obvious flaws and she defended her husband.  Next time say \"gee that sounds tough. I\"m sorry you're so tired and worn.\"  Wash, rinse, repeat.", "NTA. She's just mad you're right, unless you also said some mean things about John while pointing out the unequal division.", "Nta, is she's burnt out now then she probably shouldn't be having kids when she already has am immature husband", "NTA. Does your sister realize how much worse things are going to be for her if they are able to have a child? May she should just get him a dog.", "Agreed, NTA.\n\nIn addition, a lot of the Y T A votes are saying she should have kept quiet, but I feel like most of the “mind your own business” rules of etiquette don’t apply to a close sibling relationship. If your own sister can’t point out that what’s going on in your relationship seems unfair and maybe that’s the reason you feel so wiped out, then who else can you rely on to tell you the truth? OP’s sister willingly went into detail about the chore split and was asking questions about the workload balance in OP’s relationship; to me that’s an invitation for input.", "I did try to be conscious of what I was saying but it’s possible...", "Aw man I wish I had this set up\n\nExcept I couldn’t live with myself if I was taking advantage of another human this hard :P", "Woa I'm going to show it to my wife and our therapist, I've been struggling to express why I was so exhausted with the division of labour in our house and that is extacly that. If I'm not planning most of the thing she won't do them and or do just what I told her w/o the undrlying obvious side chores to do...thanks !", "I sighed when I read that. \n\nI know too many couples in this dynamic where the woman is doing too much. Then the couples add children to the mix. It only gets worse. So much worse. I often hear “it’ll be different when the baby is here.” It’s so dangerously optimistic.", "That's wild, it'll only get worse. Hope she understands this period is relaxing compared to what is coming", "And the effects of stress on conception are well known so she’s actively undermining her IVF treatment", "Wonder who will end up taking care, feeding, taking them to school/Dr/events…. Etc.", "Especially when it’s already known that you hate the person they’re with as any negative comment will come off as you trying to break them up.", "Yeah, this stuck out to me as a dangerous game:\n  \n>I think he’s a bit of an ass but I’ve kept it to myself unless my sister specifically asked", "isn’t he a big boy though? does he need her to plan it all out for him?", "Yeah I really wonder if people actually believe that, or just want to invent problems because they have things too easy. Apparently women had it best in the 1950s when they could just switch their brains off and do everything their husbands told them to do as there was no mental load involved", "I’m sorry. A 32 year old who doesn’t have a full time job because of . . . soccer? And this is just an acceptable thing amongst his family and friends? And he’s not embarrassed? Your sister is basically paying for this guy to be a slacker. \n\nNTA, but her husband not doing his fair share of the chores (or even close to it) is symptomatic of the whole. She brought up the topic and you answered honestly. She just didn’t like the answer. She most likely knows you’re right, but is clinging to her narrative because that’s all she’s ever known, so she lashed out at you instead of acknowledging it.\n\nEdit: added the word “the”", "It must be hard to avoid sounding negative about this guy, since there’s so much negative about him. They got together when she was 17 and he was 19, and it sounds like he basically continued his late-teens existence with her taking the parenting responsibilities of both earning most of the money and running the household.\n\nShe doesn’t want to hear your point about John, but she needs to hear it before she adds taking care of a child to her already heavy load. What are her plans for childcare? Who’s going to do most of the housework while she’s heavily pregnant? Even if she doesn’t like thinking about the unfairness aspects, she needs to give a very careful consideration of her capacity and whether she can handle a significant additional and ever-present responsibility.", "It sounds like your sister is mostly upset because your words struck a chord with her and made her reconsider how her husband treats her.  Uncomfortable truths are difficult to process, but I don’t think you did anything wrong.  \n\nHere’s a link to an excellent article about mental load, which I think illustrates exactly the sort of things you were talking about. Maybe share it with her with an apology for inadvertently hurting her feelings.  I think she and your brother in law need marriage counseling.\n\nhttps://english.emmaclit.com/2017/05/20/you-shouldve-asked/\n\nETA: NTA", "Your sister should not be trying to have a baby with that man! What does she think will happen?", "NTA\n\nWe all know who the ass is, and it’s not your sister!", "It probably wasn't just the tone, but also the message. As others have said, the truth can hurt.", "Not only that, the sister started the conversation when she commented that OP doesn't complain about the subject. At that point I feel like the two options are being honest with your sister or dodging the comment. I certainly don't blame someone for being honest in that context.", "I’ve come to understand Reddit is oddly black and white about the “mind your own business” rule and the “only say polite things” rule. \n\nBetween my best friends and I or my partner and I, those rules are utterly meaningless because when you care about someone, you say truthful things that may sometimes be hard to hear. It’s helpful to say and be told those truths. You should want someone who cares about you enough to tell you.", "Yes!", "What’s past is prologue. It’s sad when people expect “things will be different” without any evidence whatsoever that the other(s) involved will step up.", "Tacking on - for those who are like me and my husband, who both equally hate laundry and dishes, we try to do those chores together.  So, like, we'll fold clothes together, unload the dishwasher together, clean up after dinner together, etc.  We don't do it this way every time, but we both recognize that chores are nicer with a buddy and I think we both find we feel more emotionally connected when we share the load in this way - talking about our day, things we've read, etc. while we do them.  I also kind of suspect that it's gotten to a point where seeing one of us cleaning acts as a cue to the other to also do a chore - so, if I'm tidying the kitchen, my husband will all of a sudden start vacuuming (he's more sensitive to dirty floors than I am).  I don't know, we do still quibble sometimes about chores but I do at least feel like we both view domestic work at home as a team effort, and that he'll be a good role model for any kids we might have in the future.\n\nEdited to add: he often makes a point to say things like \"Why don't you play your video game for awhile?\" (currently I'm entrenched playing the new Zelda) in the evenings when I get home from work, I think just because he wants to see me have time to do things I enjoy doing.  This should really be, like, bare minimum for couples who love each other but unfortunately I've read enough horror stories that I do not take it for granted.", "Wow. Thanks!", "I wonder if she would’ve been mad regardless of your tone. I suspect (and I could be wrong!) that she’s actually angry at her husband and maybe herself a little bit, but it’s easier to be angry at you than it would be to express her anger and needs to John. Or to honestly look at her life and relationship. \n\nThere’s more risk involved with actually directing her anger where it should be going. She knows she can be mad at you and treat you unfairly, but you’ll still be around. So she’s misdirecting her anger.\n\nI’m sorry that’s happening, that’s not fair to you. And don’t feel bad for disliking John. You dislike him because he’s not treating your sister the way she should be treated, and you love your sister, so that makes you angry. It seems like you’ve handled that as maturely as you could so far!", "She shouldn’t have children with this dude, but she’s not listening to OP’s message so pushing further in the same way will just mean she tunes it out and stops talking to OP.\n\nMaybe the childcare issue could be approached on its own? Jane is already tired given her current load — no matter why her load is so high — so what will things be like when there’s a child?", "Yep!", "Did you forget to log into your alt for the start of this conversation between yourself and yourself?", "That is not emotional Labour, like it’s literally not defined in that way at all.\n\nhttps://www.google.co.uk/search?q=emotional+labour&ie=UTF-8&oe=UTF-8&hl=en-gb&client=safari", "Yes mental load is an entirely different thing to emotional labour, and is a phrase that might apply here. Unlike emotional labour.", "[removed]", "[removed]", "And playing soccer for fun is NOT included in “works hard.”", "Sounds like a perpetual high schooler.\n\nI hope she's not going through IVF because he pressured her.", "Or you got her thinking of her relationship and is mad at herself for doing so much while only works part time.", "I saw she was doing IVF and thought “well that needs to stop.”", "She's probably paying for the IVF, too. \n\nWhat exactly does this guy bring to the table other than nostalgia for teenage love?", "Lol it’s not even remotely a bonkers reach, we’ve all seen it happen over and over again.", "Maybe not so bonkers considering how hard it will be for her to leave once she has a kid with him", "When a person is stressed, overworked and overwhelmed, those things definitely do add to the load. Do you honestly believe that if you were, you'd find planning things relaxing, or count it as your free time? If you wouldn't find it relaxing in these circumstances, it's clearly then a chore which adds to the mental load, even if so little it's not noticeable when *not* stressed and overwhelmed.\n\nAnd if you're not recognizing this experience at all, I guess you can consider yourself lucky?", "No I had something to add to my comment and didn’t feel like editing it. Are you the Reddit police 😂", "TIL those are two separate concepts. Sorry about that.", "[removed]", "[removed]", "u/MechanicOne1817 is a comment stealing bot\n\n[Link to original comment](https://www.reddit.com/r/AmItheAsshole/comments/1449pzp/aita_for_telling_my_sister_the_division_of_labor/jne8ny6/?utm_source=share&utm_medium=ios_app&utm_name=ioscss&utm_content=1&utm_term=1&context=3)", "And it’s on the weekends. I bet that many of his teammates have full-time jobs. But an all-weekend activity, when he’s manoeuvred his wife into managing all household tasks, gets him out of almost everything around the house (since he’s not around when she’s planning things).\n\nI bet playing soccer is not all-weekend either… they probably go to the pub after a game.", "The fact that she wants to add to her already overwhelming plate by adding a baby is insane. I’m betting sis is trapped in the sunk cost fallacy. Plus she’s been with this guy her entire adult life. She literally doesn’t know anything else.", "Maybe he’s great in be-hahahah, nahhh. No one so dismissive of his partners feelings could manage that.", "It is an absolutely crazy reach and I can't believe any rational person comes to the conclusion that OP's BIL is going to make her sister a domestic slave because OP doesn't feel the chores he does are enough, even though her sister adamantly disagrees. You don't know these people and OP is (by her own admission) biased, \"HE'S GOING TO BASICALLY ENSLAVE HER\" is craaaaaaaaazy to come to as a conclusion.", "Yes and did OP tell her sister any other factor might be the problem? No she specifically blamed the most minuscule factor because it directly related to the husband. Then after being told her assumption is incorrect, she doubled down. I am probably the busiest and most stressed person I know and, yes, sitting back in my chair at work and taking a minute to think “Should I mow the yard today?” IS relaxing. It is quite literally doing nothing. She didn’t tell her sister that working full time or IVF pretreatment or doing chores was the problem she specifically said that planning chores for her husband was. Huh? I couldn’t imagine the most fragile person in the world being overloaded by that.", "You should read up on the other comments to see exactly why I feel “mental load” doesn’t apply here. \n\nHer marriage, her choices. If she feels it’s fair, it doesn’t matter how you, I, OP, or anyone else feels.", "No worries, you’re one of about 105 currently 😂", " She works part time and spends the rest of her time playing, she works full time and runs the house, and she's mad at you for pointing it out?", "honestly I think this was a great timing... atleast she said her piece before the two of them had kids and the division of labor got even worse and the possibility of divorce was even more complicated", "u/Seniorcvdn is a comment stealing bot\n\n[Link to original comment](https://www.reddit.com/r/AmItheAsshole/comments/1449pzp/aita_for_telling_my_sister_the_division_of_labor/jneq1pk/?utm_source=share&utm_medium=ios_app&utm_name=ioscss&utm_content=1&utm_term=1&context=3)", "I know too many couples in this dynamic where the woman is doing too much.NAT", "Uh I was not taking it literally. I’m pretty sure the commenter didn’t mean a literal fucking domestic slave? What a weird take.", "You're overanalyzing things here, dude.", "Here’s basically the conversation \n\nOP: “You’re husband is a deadbeat who doesn’t do anything”\n\nSister: “That’s unfair, he does things”\n\nOP: “I know more about your marriage than you do and you’re wrong”\n\nReddit… who knows neither of them: “She’s right, she does know more about her sister’s marriage dynamics”", "If it's equal, why is she tired all the time?", "Holy sh!t you're dense. Let me explain clearer for you I guess.\n\nJust because an individual in a situation deems that situation fair, doesn't mean it actually is fair. \n\nShe is starting IVF treatment. Works full time. And does most of the house planning and cleaning. He works less, does much less house work, and plays soccer. It's time to start acting like an adult.", "104—I just un-downvoted you lol", "It is literally verbatim what the comment I replied to said...? And I didn't once use the word \"literal\" in my response, I used it in the same exact context they did. I didn't take it literally but what they imply is still an insane reach. I am struggling to understand why you even commented to argue in the first place.", "Likely bleeding money on that hobby too, unless they hand out slots on the green for free where OP is from.", "OMG, *dyyyying*. 🤣🤣🤣 Absolutely nailed it!", "You’re a complete moron if you think inserting yourself in someone else’s marriage, over something as trivial as household chores that THEY don’t have a problem with, is a good idea. Have fun with that. ✌️", "😘", "Because the situation being described is so common. The woman is already doing 90% of the work at home while also being the breadwinner while her husband works part time.  They are currently doing IVF. Add a baby to the mix and you get basically a domestic slave. \n\nSister didn’t adamantly disagree, she got defensive when she realized that laying it all out like that shows how little John actually does.", "It's called hyperbole.  This dude is working part time to make sure he can still play soccer every weekend (which for some reason stops him from working full time?) and then STILL needs her to write a list of things for him to do.  It's not reaching at all to say that once she has a kid that she will also be doing all of that work as well.", "He's 32. He's got zero chance at being a professional athlete (especially soccer!) and even for golf and tennis, which skew older, the local brackets lose money until you are basically famous and getting marketing deals from Nike. Your advice is very out of touch with how professional sports work. It's not even taking a favorable interpretation on the post, it's straight up impossible for this dude's \"local sport\" to be anything but a hobby", "At least today I learned to avoid people who complain about the “mental load” of identifying something that needs done, and then telling someone else to do it. Sounds exhausting.", "I'll keep being a moron that believes household responsibilities should be split fairly between a couple. Says a lot about you that you don't feel the same way. Have a great day. 🤘", "This is all speculation and assumption on your part based mostly on a paragraph from an unreliable narrator lol. If going around on Reddit overreacting to relationships and jumping to wild conclusions to the point you're calling domestic slavery and the cliché' \"DIVORCE HIM\"  is your thing power to you, but it's still a crazy reach lol.", "I understand hyperbole, which is why I went on to say I still think what they imply is an insane reach, and I disagree with the rest of what you're saying. We don't know the reality of their situation and literally the only person that matters, his wife, doesn't have an issue. Everything else past there doesn't matter to me. This sub is crazy sometimes when it comes to this stuff lol.", "The oldest professional soccer player right now is 56 so you’re the one who’s out of touch but I’m just playing devils advocate here. Whether or not this guy thinks he’s got a shot and his wife wants to support him or if he’s just having fun on the weekend would not affect my answer to OP’s AITA.", "Right? I “plan” to vacuum the floors, dust the furniture, take out the trash…let’s ignore the fact that my husband *actually* vacuumed the floor, dusted the furniture, & took out the trash. The fact that I had to tell him to do it is a burden on my mental load. \n\nUgh, I need a nap…Reddit’s wilin’ today. 🤣", "Is everyone on here an unreliable narrator then? Why are you even on this sub if you can’t take a post at face value? She acknowledged that she doesn’t like John and says she tried to monitor her tone with that in mind. Nothing I’ve read points to an unreliable narrator, generally an unreliable narrator won’t acknowledge their biases right up front.", "If his wife didn't care then why was she complaining to her sister about it? And why did she get so mad when OP brought it up? If she didn't care that he did it then she wouldn't be complaining lol", "Are you talking about Kazuyoshi? He became a pro at 15! If you're already a pro athelete at 32 you have a solid chance of staying one for a bit longer, but no one is \"trying to make it big\" at 32. They have already not made it. Saying you're just playing devil's advocate is such a cop out and a weasle way to have a discussion. You don't know what you're talking about. That's fine. It's better to own it.", "how was that overstepping? she commented how you and your partner never complains about your chores and you explained why...she gave you the details on how she does it in her household and you just told her your observation. so which part did you overstep? you did not tell her to leave her hubby or something like that. nor that you dont like john coz he is kinda an ass until she asked you. \n\n&#x200B;\n\nNTA. healthy relationship is a balance relationship base on give and take and compromise.", "NTA. He sounds like the AH. Something I try to do with friends and family if they are complaining about something is ask what they would like from the conversation: to just vent, to get advice or to get perspective.", "NTA. She came to you for frank advice, and you gave it. It doesn’t mesh with her view of reality, so she’s trying to make excuses for her husband instead of facing the truth. This is something she and he need to work out and the first step will be her admitting to herself that there’s a problem. Hopefully your advice here will help her see that.", "NTA.\n\nShe asked. She got an answer she didn't like. And if she's knackered now, imagine once she's pregnant and after the baby is born.", "NTA \n\n>She works full time and is the primary earner in their house because John works part time and plays soccer for a local team on the weekends. She’s also in the pre-treatment phase of IVF.\n\nThey are not prepared to have a child, both the work and financial burden will increase and it will only fall on her. I understand being passionate about sports but there's no reason he shouldn't be working more. Especially given the cost of ivf, and then despite her working ft she is doing the most.\n\nI hope she reconsiders trying for a baby with him right now. Not until he's at least working more and if not helping more, then paying for help to increase his contribution.\n\nShe needs to write out lists of what she sees the work load of having a child and what she legitimately can see him taking on in addition to the current situation.", "So let me get this straight... John works part time so he can enjoy his soccer and has to be told what to do as if he's like 9 or something?\nAnd on top of being his full-time mommy, she's working full-time AND taking hormones that take a toll on your energy to get pregnant?! Why does she want 2 babies?!\n\nNTAH. John is 100% the AH", "Your mom just doesn't want you to mess up her chance at being grandma\n\nEdit NTA", "nta! tread carefully and stay neutral concerning the BIL, but discussing how chores should be divided and discussing behaviors/habits is fair game. i say stay neutral more for your benefit and your relationship with your sister, he deserves nothing. \n\nyour sister is in for a huge uphill battle. bjt as someone who considered IVF with his wife, lemme tell you: the stress and being overworked will significantly impact the chances of success, which i'm sure everyone's aware of. it's also a difficult thing to go through usually, so if anything hubby should be doing *all* the chores and/or getting another job to pay for help.", "NTA\n\nJohn needs to grow up and work full time and fully participate in the house chores", "Definitely Nta. Idk if that would make the situation worse but maybe you could send her the comic “You should have asked” by EmmaClit. It does a really good job presenting the topic.\nBut then again, maybe not if she’s not speaking to you as is rn.", "NTA - you certainly don't seem to be wrong, and it could be that you're dead right and your sister knows it, that's keeping her from talking to you right now. because frankly this opens up a whole other set of issues for her, i would imagine. realizing she contributes much more in every aspect of the relationship is likely a hard pill to swallow, especially when she's in the early stages of intentionally trying to have children with this person. i would give her some time to process and see what comes of it in the near future. but, if she chooses to continue her life as it is, i wouldn't recommend pressing any of this any further. she's an adult and what she chooses to accept from her marriage is between her and her peter pan husband. i'm sorry but what kind of unpaid hobby prevents you from working full time? anyway, again, NTA.", "nta people just don't like hearing the truth about their relationships", "oh hey I want to tell my sister the same thing\n\nany advice?", "It’s gonna get so much worse when they have kids. NTA, I hope your sister sees what’s happening", "NTA she is angry because she knows you are right and now that you’ve pointed it out she can’t claim ignorance.", "You didn’t tell your sister anything she didn’t already know. She knows. She just doesn’t want to deal.", "NTA\nIt's the truth. Sucks to hear it but it is.\n\nI have a friend who had been dating his former girlfriend (just broke up last February) for 8 years, and they had been dating since he was 17. Dating someone for that long and basically spending your whole adult life in a relationship is not healthy. He was borderline delusional of how jealous and insecure she was of other women, and could not see her doing anything wrong all the way up to when they broke up when he caught her cheating on him.\n\n Your sister is in the same situation. On some level, she knows you are right. But imagine he doesn't want to change. Therapy doesn't work, conversations don't work, ultimatums don't work. She will either have to stick it out and be miserable, or face the fact she wasted 10 years of her life on this person. That's hard. Hopefully that helps give some perspective.", "YTA - The only division of labor that matters is the one agreed upon by your sister and her husband. Mind your business.", "NTA, why ask if you're not going to like the answer? You were just being honest.", "NTA. She's in for more misery if IVF is successful.", "Much easier to be mad you than at herself for getting into this situation - and *actively* trying to have a child (to the point of paying for it!) with him.", ">She works full time and is the primary earner in their house because John works part time and plays soccer for a local team on the weekends. She’s also in the pre-treatment phase of IVF.\n\nShe wants to do IVF with someone that works part time, has a very time extensive hobby, and she's the breadwinner. She does the cooking and cleaning. People need to recognize that their partner isn't parenting material. You didn't overstep by pointing out reality. You don't like John for the reasons you mentioned. NTA.\n\nI see you babysit quite a lot for your gf's sister. I wonder if your sister will be looking at you for childcare when her husband fails to step up. There's a big difference between an eight year old and a newborn.", "NTA", "Very often. The last thing people want when they ask for the 'truth' is the truth.", "NTA - She asked, you gave her an honest answer. She's upset that you put light on her unfair situation, and is taking it out on you.", "NTA\n\nYou hit a little closer to home than your sister is willing to admit at the moment. Trust me, your words will linger and hopefully do some good in how your sister and her husband go on.", "NTA. I would also keep in mind that IVF is a very intensive process, and while she is burnt out from all of the work that she does for herself and her household, she's also experiencing hormonal fluxes while trying to still lead a normal life. She likely wouldn't have taken too kindly to what you said if she weren't going through IVF prep, but she's going to be especially emotional and vulnerable while she's preparing.\n\nMaybe put a pin in it and circle back when things have mellowed a bit, and just be there for her when she needs you, just like you've been doing.", "NTA.. truth hurts.", "NAH.  You were just giving your honest opinion because you and your sister are close.  She left because she was upset.  Maybe by your opinion or because she is realizing some truth to what you said.  Either way prepare for the fallout because people, even close siblings, don’t always want to hear the truth.", "NTA", "NTA and damn, it must be nice to be able to work part time and play your favorite sport (for free) while your partner works more. Must be nice. \n\nI wish it were more appropriate to just straight up tell someone \"You shouldn't have kids with this particular person\" but people won't like that unfortunately", "NTA - it's crazy seeing how much daily tasks get broken down into gender roles once you're in a same sex relationship. My bf and I split the house chores evenly. We even do the extra work when one has been having a rough time and needs the break. We're a team.", "I would love to work part time so I had more time for my hobbies. What could be better!", "Thanks for saying this. I didn’t realize that this is the burden that I’ve been having in my relationship for years. She’ll say things like “make me a list of chores and maybe I’ll do them” or “make me a budget and maybe I’ll stick to it” and stuff like that. It’s always been daunting but I haven’t been able to adequately describe why until reading this thread. Thank you.", "That comic made my brain hurt and threw me back into the 50s. The whole feminist rhetoric wasn't helping. And I'm female. Don't want to carry the load these days, don't marry a useless guy (edit or girl). Easy. Been married over 10 years... discussed household chores... never. They just happen, and not cause of my mental load lol, I don't even think about it. Sometimes I think I'll do x later today and oh cool it's already done. \n\nThe worst thing about it is it's all about a woman, meanwhile men have the same issue. You just don't hear about it with your feminist girl group :/", "Triplets on their way...", "Show her this\n\n\nhttps://english.emmaclit.com/2017/05/20/you-shouldve-asked/", "Have you heard of a game called \"fair play\".\nSometimes people don't actually realise how much work they doing tho run a home,  or realise how  much the other partner is/isn't doing.\n\nThe game gives a bit more if a visual representation and kind of let's people actually realise the situation.", "You don’t want to dismiss her feelings. They are not less valid, but IVF treatment can make you feel especially vulnerable. The feelings are real, but they may be way more intense, like being a teenager again.", "I don't like John either.", "Truth- I couldn't do it morally, ethically, and other ally out there", "But it WILL.\nWhere she used to do 85% of the work.for.two people  she will now do 95% of the work for three people.", "Lol, I have a lot of male and female friends and am not part of any feminist \"girl groups\". Probably also because I'm definitely not the right age to be called a girl anymore. I've discussed this topic with many people and belive it or not, people have wildly different experiences (although I can tell you, there are much more women who recognise themselves in that comic whereas men that I know tend to not feel like that, even if they're not useless, as you describe).\n\nI'm happy for you that you don't feel the need to talk about chores in your marriage. I prefer a clear distribution, so I don't have to think about everything, but only the stuff that I'm supposed to do. My partner is more than capable and happy to handle his part. \n\nNot sure why you feel the need to be so dismissive towards other people's experiences. Remember, not everyone is you nor had the same experience in life. There are billions of other people in vastly different circumstances.", "Damn, that is really well thought out and very even! Kudos. I will say that your town is a bit of an asshole- trash is every ten days?! I get the other trash thing; I’ve been places that do recycling every other week on a different day than trash. But every ten days so it’s a different day is evil. Unless they keep it on the same date each month- like always the 10th, 20th, and 30th.", "I mean how much does OP actually know about the division of labor in their house?  My wife and I have an agreement that from the outside may not seem fair, but it works for us.  \n\nOP's mother's and sister's reaction doesn't make it seem like all OP did was say that the division of labor was unfair.  She probably had some pretty unkind things to say about OP's husband.", "Part of getting older is being tired and moaning about being tired. If everytime I said my girlfriend tired me out because of xyz my mates tried to split us up I wouldn't feel comfortable talking about my relationship with them.", "And she's spending God knows how much money to bring a(nother) baby into this nonsense. What happens when she has to do everything AND raise the baby because dude is off playing soccer?", "NTA - as far as a fair share of chores goes, there is a simple solution.   These people need a spreadsheet.   On the spreadsheet, list every chore and duty that needs to be done (including the mental load), how long it takes, and how often it has to be done.  Jobs also get put in the spreadsheet with number of hours.   Paid work and work around the house count the same.   Hobbies and sports do not go on the spreadsheet.  The goal is to determine the amount of free time each person has per week and what that free time is used for is irrelevant.   I think a lot of people  give typically man-type chores way more credit than they deserve.   For example, some people might say he cuts the grass and she cooks the meals.  Cutting the grass takes 2 hours a week.  Cooking the meals takes 14 hours a week, yet some people would consider those tasks equal, which they are not.\n\nThe end goal is equalize the amount of free time each person has.    It’s very obvious that the sister has very little free time and is doing just about everything.   Heaven help her when she has a child and the care of that child just gets tacked onto her duties.\n\nI can never understand why anyone is willing to accept unfair situations like this.   Did her wedding vows include her signing up to be his mommy, doing everything, and supervising and directing the few things he does?   Lord, I would not sign up for that job in a million years and I surely wouldn’t have a child with a person who is a user, not a real partner.\n\nMany of us grew up with parents where mom stayed at home and did all housework and childcare, and dad worked full-time, and other than things like lawn care and car maintenance, their time was free.    Mom would be working far into the evening, making meals, cleaning up, helping with homework, making lunches for the next day, and meanwhile dad is sitting on the couch because he “worked hard all day”, like housework and childcare don’t count for much.\n\nSomehow many women still feel like if the house isn’t sparkling clean or the meals aren’t all nutritious and homemade, that she is failing as a wife/mother, even if she works full time, because their mom who didn’t work outside the house handled everything else.   This thinking needs to end, even for women who are stay-at-home moms.   Each person, regardless of whether their “work” is at home or elsewhere, deserves the same amount of free time.  We should not settle for less.", "\"Aren't you embarrassed?\"", "I also think that regardless of the relationship, you should have someone's consent to tell them hard truths first", ">Part of getting older is being tired \n\nNot when you work part-time, spend your weekends playing soccer and wait to be asked before you grab milk and bread from the grocery store while your wife does everything at one + works full time...", "Hahahaha so companies shouldn’t  managers or strategic management plans for time and resources ? Those things aren’t ‘real’ work?", "Yeah one of my coworker’s wife got IVF and it’s expensive af. They both bring in decent salaries, but it’s still a pricey route to take. OP’s sister must make bank to even consider it, which makes it even more mind-boggling she’s stuck herself with Soccer Boi.", "I love me a spreadsheet!!  I have one for chores, one for work and college, and another for my budget.  This should be higher.  They could even make it in Google Sheets, so it's accessable to both right from their phones.", "I wonder if there's a housework/chores list out on the internet to start from. Like I know my house needs a ton of daily/weekly/monthly/seasonal things done but I couldn't just list them all of the top of my head.", "I thought, and she thinks it’s bad now!", "Are you comparing running a corporation to a wife making a “honey-do” list? And anyways, no it’s not real work, I’ve been in those meetings and a bunch of people sitting on their ass saying the same thing 100 different ways all day is the absence of work.", "That's what jumped out at me, too. She has no basis for comparison because this is the only way she's ever lived. I suspect that's why she's so upset with OP over this - it's rocked her worldview big time, taking the \"this is just what being married is like\" and standing it on its head, forcing her to question whether she's actually satisfied with her relationship or whether she's been putting up with it because she felt there was no alternative.", "I paid close to $45k. IVF is costly.", "Excellent idea!   Of course, she’d probably have to remind him to look at the spreadsheet.", "I would start by just putting it on the list every time you do anything, and making note of how long it takes.   A simple way could be to just dictate a reminder onto your phone if you have it handy.", "She may not know any better. It’s also possible that he turns on the charm for that, since it’s only short-term effort.\n\nI know some teenage sweetheart relationships do work out, but in general people should make sure that their partner is capable of being a functional adult before they get too attached. And consider actual living compatibility not just whether they like the same stuff.\n\nDoes John even like Jane much, beyond being happy that he’s landed someone who provides for most of his needs?", "NTA\n\nMy guess is that she knows what you're saying is true, but it's a hard pill to swallow. Honestly, I think your mom is wrong since your conversation was very tame and matter of fact. You both went over how chores are done in your house and you happened to make an observation. Personally, I dont think a sister being concerned for their other sisters burnout is an overstep on your part.", "NTA and she shouldnt be adding a baby,which can we be sure she really wants? Or is it what her husband wants?\n\nIts also sooo expensive and he's only working part time,it also doesnt always work the first time. Can they afford to do it again?", "NTA\n\nThis wasn't an unsolicited opinion, it's not described as having been stated in a way that's derogatory to John, and it's not like it was some vague acquaintance with whom you can't speak candidly.\n\nIf you'd jumped in and told her John was a lazy ass bum taking advantage of her hard work so he can play and drink with the boys, work part time, and fuck off while she takes care of the house, without any preceding discussion, you'd have been wrong. That's not what you did.", "NTA - don't ask questions you don't want the answer to.", "NTA\n\ndon't ask if you don't want to hear the answer.", "NTA and she’ll be hit in the face if she give birth to a child. Jon won’t be of much help, she will complain, you’ll say I told you so, then they will eventually separate and be miserable.", "NTAH, it doesn't matter whether your sister or her husband does 'their' share of the chores, do yours and let them hash it out.", "Don’t ask if you can’t handle the answer", "NTA when trying to get someone go see something your way it's better to get them to realize it more themselves. Such as ask what percentage of the work does he do compared to you? Do you think that's even? Do you wish you had more time for yourself? Would he be willing to pitch in more to give you that time? Having her answer these questions will get your point across bit also make her feel like you're concerned and not attacking him.", "NTA. It was a open conversation between siblings. She just didn't like what you have to say.", "NTA, sounds more like your sister is a single mom to a teenage boy instead of partners with a grown man. You told her what you did out of concern for her. Your mom should be concerned for her too instead of taking it out on you.", "I’m sorry this dude doesn’t have a full-time job because he plays soccer on the weekends?😂😳So many people work full-time and engage in their hobbies on the weekend. It’s too bad Jane doesn’t have the time. NTA.", "NTA because she's your sister, and sibling usually care and look out for each other.\n\nSome women get really defensive and hate to see their marriage criticized because they know changing habits usually lead to conflict and stress. She doesn't know any other model of adult life and of course she will feel defensive, eager to protect her decisions. People are very afraid of finding out they made a bad decision or have to do any change in their lives.\n\nAlso sometimes we have to be careful when giving advice so the other person doesn't feel personally attacked. Some advice can sound patronizing or oversimplifying. So just let her know you gave your opinion because you love your sister, and you know she's not stupid and this is not a simple situation.", "NTA. She probably is upset that a more equitable division is an option that she didn't realize. That mental load and planning is exhausting", "NTA, you held up a mirror and she didn’t like what she saw.", "Your sister wasn't ready to hear the truth about her marriage and telling her was like running a car into a brick wall at 60 mph.  She needs some time to realize that you were correct and she will.  You are NTA", "Your sister sounds naive. Nta", "YTA\n\nthere's a lot in a relationship that isn't shared with people not in the relationship.\n\nYou may see it's unfair, and say the fix is John needs to step it up. She may have been looking for some sympathy or assistance to get through a rough period in life.", "This is the way.", "There's also a documentary called \"Fair play\" - I haven't seen it but follow the Instagram and they talk about this topic as well.", "It’s easier for her to be mad at you than to be mad at him. I would give her some space and not bring it up unless she does.", "I'm a little vague on what you mean by plan the chores for the week?  Aren't most of them redundant?  Dishes, laundry, shopping, mow the lawn, etc.  What goes into planning chores for the week?", ">Been married over 10 years... discussed household chores... never. They just happen, and not cause of my mental load lol, I don't even think about it. Sometimes I think I'll do x later today and oh cool it's already done.\n\nhow neato for you\n\nweird that that's clearly not everyone's experience", "RIGHT??\n\nWhy is your sister undergoing IVF -- Sounds like she doesn't need yet another kid to raise.", "My wife’s coworkers always tell her it must be nice that her husband does stuff around the house. I clean, cook a few days per week, make our son breakfast before school, grocery shop, etc.\n\nThe thing is I work from home four days per week so it’s kinda easy helping out since my work commute dropped 80 percent several years ago.\nIt’s pretty common now a days where women and men both work full time yet women do a lot more work in the household than men.\n\nMy wife’s coworker was complaining and I told my wife she can talk to her husband but a lot of men have this “I can’t cook” yet they expect women to have the ability given to them at birth or something… you can talk to your spouse and odds are it might change for a little while or not change at all. So it’s almost as if you have to get a divorce or after trying to change things just accept they won’t change at all…..", "This...is spot on!!!", "I don't think that there's something wrong with a 32 year-old working part-time at all if the financial situation allows for it. But then the partner working full-time should have close to nothing to do in terms of chores. He doesn't do enough in either department, which obviously shouldn't fly!", "AND sister is trying to get pregnant. Why why why? This guy is NOT going to step up.", "Yep you can't say \"how come you never complain about your partner?\" Then be bummed when the answer is \"well she does her fair share and John doesn't\".", "It is an issue whether the sister wants to recognise it or not. If it wasn't an issue, she wouldn't be complaining about the amount of work she does compared to her husband. It's not wrong for siblings (especially when they're as close as OP says there are) to give hard truths sometimes.", "Sisters Unite! and Amen! Hope OP gets her sister to read this. NTA Sisters should be able to tell each other the truth when it's not being told maliciously. And there is so much emotional work that goes into preparing for weekly meals; it's the only reason I don't like to cook anymore. I love eating, but after 40 years, I'm done planning and shopping.", "You Hit This On The Head!!", "Ding ding ding! This poor woman. NTA", "YTA. You shouldn’t talk shit about siblings husbands.", "Your sister is planning a child with this dude??? Yikes. Please tell me she realizes that she will do the bulk of childcare and be even more burnt out.", "I don’t think you need to plan every week that sounds exhausting. The chores are basically the same every week", "So, the execution of chores is equal, but planning said chores pushes it over the edge?\n\nINFO what does planning chores entail? I have been married for a long time, and every week is like the last. So seriously, what does planning actually entail?", "NTA\n\nThe truth hurts.", "It's sad and almost pathetic what people are willing to settle for. And to want kids with that person? Nah, sympathy gone.", "Have a look at this and show it to your sister. It explains the mental charge so well:\n\nhttps://english.emmaclit.com/2017/05/20/you-shouldve-asked/", "NTA, she got mad because she wasn't ready to hear the advice that she went looking for.", "yeah this, what a sane response NAH", "If he plays soccer ON THE WEEKENDS that does not explain why he doesn't work full-time. And even working full-time would not explain why he does no household chores or cooking during the week. Your sister works full-time, does everything in the household, and covers the majority of the bills. This is outrageously unfair and I think she's finally realizing it but doesn't want to admit it.\n\nYou're obviously not an asshole. And good on you for saying something. Give her space. I just hope your words start to make her reevaluate things. It's going to get so much worse if the IVF takes. She's going to be doing everything she does now plus raising the child completely on her own.", "Wow.  So he basically just fucks around while mommywife takes care of everything?  \n\nThat d must be out of this fucking world.", "I think you're just projecting what you feel is work onto someone else.\n\nWhat you think is a great mental load is not what others think is a great mental load.", "What the actual fuck? What are you, 12? You know nothing bc about this marriage at all.", "My mother has mental health issues and has to live with me. To be clear, her mental health issues have NOTHING to do with her ability to do chores or anything of the sort. However, I have a rule where she has to do 30 minutes of something a day (basically cleaning her dishes or tidying up her room type stuff).\n\nIt literally takes me twice as long just to get her to complete her 30 minutes. On most days, I give up and just do it myself. We know that OP's sister's husband is lazy and doesn't do his share of anything, that much was made PERFECTLY clear from OP's post plus what the sister said. So I'd imagine that what she deals with is very similar. \n\nAnd, yes, it is absolutely mentally exhausting when you're stuck parenting a grown man/woman who can't be bothered to figure out what needs to be done and do it without having to walk them through it every step of the way.", "But the wife doesn’t think it fair. She’s exhausted", "no. it's a cheap cop out to say \"you should have\". That's putting all the blame on someone else, instead of taking ownership of your own feelings.", "mental load vastly differs between different people. There are some that say it's a huge effort to even write up a menu and grocery list, there are others that do that for fun.", "OMG…it’s literally in the original post.", ">So he’s most likely working really hard on his side gig, \n\nFirstly, OP did clarify he's not getting paid anything it's just a fun hobby.\n\nSecondly, it's only on the weekends. It in no way interferes with his ability to work a full-time job. But, more importantly, if he's only working part-time during the week why isn't he doing most the household stuff? He clearly has plenty of free time.\n\nSo weird how you're trying to defend the husband here when there's literally no evidence whatsoever that he's contributing much of anything to the household. Either financially or in regards to labor.", "Basic life function that both her husband yours are ‘unable to do’", "NTA\n\nMy question is does she think he's going to step up and be a hands on dad? I mean if she's having to plan what chores he does, is he going to change and feed the baby, do laundry, cook, clean? Or is she going to have to take on all responsibility for the baby while husband gets to continue acting like he's a teenager? I mean, part time job, sports on the weekend, being told what to do around the house? Sounds like a teen to me", "NTA - learning about emotional labour/mental load/ etc. is important information to share. She might have just been jarred by this new information, especially since she's learning it in the context of being taken advantage of. I think she'll come around", "NTA, she started the conversation and you were honest about it.", "NTA and sadly this sens to be a common pattern. Woman works and makes most of or all of the money and then comes home to her lazy partner and had to also cook, clean, take care of children. I thin she's just upset that you pointed it out.\n\nMy husband works 80 hours a week, I work part time and do most of the tidying and laundry etc. He still will wash the dishes, give the Bunny hay and clean up around the house on his off days. I don't even have to tell him because he understands what needs to be done to keep the apartment clean.", "NTA if your partner is the main earner and you work only part time, I would say it is only fair that you contribute more to chores not less. \nI sometimes feel like our society has accepted that the traditional gender roles for the main earner can be reversed but women are still expected to do the housework. \nYour sister seems to have two full time jobs, while her husband has only two part time jobs at most. That doesn’t seem fair to me.", "Normally I'd say you overstepped, but she asked. It's not your fault she didn't like the answer. NTA.", "Sounds like NTA. But from your sisters reaction it sounds like more is going on here. \n\nWhy does John work part time? And why did you include the soccer thing? Lots of people play sport on the weekend, how is that relevant?", "have i mentioned how tired of classic men i am? playing peter pan and wondering where the women went 😏\n\nwhoops also\nNTA \ntruth hurts when you’re not ready to hear it", "YTA - all these “gotta speak the truth” comments are forgetting you absolutely overstepped.  No one ever asks questions like that casually hoping for brutal truth delivered by someone using themselves as the superior example.  It’s like when someone asks you if you like their cooking, you don’t say it’s awful and my partner’s is actually way better. You can offer constructive criticism mixed with compliments to keep it positive.", "Why does she support him working part time for a hobby? That’s insane.", "nta. wtf does she let him work part time and play soccer 🥴 dude needs to grow up and contribute to his household. he made his wife his mom", "Yeah this whole idea of \"I'm too busy for chores\" is ridiculous but shockingly common\n\nLike, your hobbies are done in your free time, and your free time is what you have left AFTER chores are done", "Obviously?", "The thing is it's not about distribution, it's adults adulting and therefor no need for discussion. I guess I'm lucky I married an adult who acts like an adult.\n\nI'm not dismissive. It's just sad.", "OP only shared what she sees of the relationship. You're grasping at straws to say OP know what is happening in someone else's relationship.\n\nAlso, thank you for perfectly proving my point of people projecting onto others.", "Why the hell does playing soccer on the weekend prevent you from having a full time job and getting off your ass and helping around the house? And she wants to have a child with this lazy deadbeat?  She better be glad she is not related to me because this would be exactly what I would have said to her. NTA", "NTA. A high school relationship not working out into adulthood? What a shocker! /s", "She’s gonna have a fun time finding out what kinda father he’s gonna be 🙃", "NTA", "NTA\nShe's already raising a child, who will never grow up.  Doesn't sound like she has the time or energy for another child.", "NTA. Your sister heard the truth and didn't like it. John should be working full time and equally sharing the mental and physical responsibility of household chores. Things are only going to get worse for Jane if and or when she conceives if nothing changes now.", "NTA. Most likely, your sister realizes you are correct but doesn’t want to admit that she’s in a bad marriage. It’s easier for her to just blame you rather than face the reality of her situation.", "NTA\n\nBut I'm more concerned about the IVF.\n\nFFS. Convince her to not do that.", "Unless she's got herself a hobby that takes up about as much time as his soccer, that's a horribly inequitable division of labor.\n\nNot only is he working only part time, but taking a lighter share of the work at home so he can go play. The soccer stuff might be physically challenging but it's mentally and emotionally renewing.", "Same!", "this comment! now that you have said the thing and she has heard you enough to be mad about it, you go full support mode. you won’t convince her by giving her more sources and descriptions…you have to give her the space and the grace to admit you might have a point.", "And the mother should be backing OP's message for her daughter's sake, not guilting the daughter who answered her sister's questions honestky,", "Well, BIL is awfully busy playing football & drinking wth teammates 2 days out of 7. \nNTA. Your sister is having a bad time but does not want to hear the truth. She's ghosting the messenger.", "*correction: honestly.", "Excel has a template for that.", "NTA.  It’ll get worse with a kid, so you told her the hard truth she was probably already realizing.", "NTA sometimes true things aren’t easy to hear. But better that you were straight with her instead of just listening and telling her everything will be okay.", "NTA\n\nYour sister brought up the subject of chores and being tired. You explained your situation then she explained hers. You commented on the differences. She doesn't have to like the differences; that's OK. What's she done is get mad at you for pointing out the differences that she doesn't want to acknowledge. She started defending her husband for the same reason.\n\nYou didn't do anything wrong, but to move forward, you can simply say, \"*I'm sorry our conversation upset you. If you are happy with how your household works, then I am happy for you.*\" Then you don't have to say another word. She's already aware of the differences, so you don't have to mention them again. She's already defended the logic and 'fairness' of her home situation, so you don't have to consider it again. If she ever brings up being tired again, you can simply reply, \"*I'm sure you will figure it out.*\" or \"*Yes, my situation does seem to work for me.*\" and refrain from expressing any further thoughts on the matter.", "NTA. She knows you’re right. He’s a user. She’s been with this guy far too long.", "The truth doesn't hurt unless it ought to 🤷", "NTA\n\nMy advice is from personal experience being you:\n\nIf the relationship matters more than being right than you'll keep your mouth shut. She'll defend her way of life even if she doesn't agree with it wholeheartedly because it's where she's at and who she's with. She reacts defensively and will come back to it if she wants to.", "NTA I hope thos is a wakeup call for Hane. She needs to really think about whether she wants to do 90 percent of the cooking, cleaning, AND childcare for a baby.", "yeah, there's a huge difference between telling a friend/relative you don't like their new hairstyle (when there's nothing *objectively* wrong with it and it's just your subjective opinion that no one asked for) and telling them that you think they may be being taken advantage of. \n\nthe former is just being rude for no reason, the latter is showing that you *care*.", "Haha, this is the first time I've ever seen someone suggesting that having good communication with your partner is a sad thing. I actually love discussing everything with my partner! But you do you, I guess :D", "well, you can dial it back cause I never said that. Do you always misinterpret things? cause that's gonna suck for any partner and goes against the whole bs where you said you love discussing things with your partner.\n\nor is it only internet folks you play that game with?", "NTA you just explained to her what the mental load is. I think she’s just upset about having to deal with this with her husband now and that the wool has been pulled off her eyes than upset of you pointing it out.", "NTA\n\nA revealing question would be to ask, \"How many times have you stopped yourself from asking him because you know he won't do it, that he'll do it wrong, or that he'll expect something in return?\"\n\nYour sister has a lot on her plate. She's actively and painfully trying for a baby with this man and doing more than her share of work. The stress from that is not suddenly eased by realizing she needs to expect better from him, that he needs to change for her to be happier and healthier. The fallout of dealing with this could go a lot of ways, and some of them include losing her husband and future child for the hope of better treatment elsewhere. It's emotional, to say the least. \n\nIf you can, try to give her some grace for her reaction. Be there for her if she comes back for help, even if it's just for ways to change in a healthy manner while staying with him. Who knows, maybe he could learn a little empathy and be less of an ass.", "With a partner like that, your sister shouldn't even be thinking of having a child with him. That's only going to be more work pushed onto her juggling between her job, housework, and the child's needs while he gets to slack around and have fun with friends. OP is NTA", "NTA, you just spoke the truth. Whether or not she does anything with her is her own issue.\n\nAlso, it sounds to me like John is a kid living with his mother. She seems to be doing everything...", "NTA. The truth hurts, and she’s angry that you pointed out that she’s doing an unequal share, which is wearing her out.", "This is a pet topic of mine and I've had very good friends (like sisters to me) who've had this conversation with me and I've been very blunt about my thoughts and I've also sent them a spreadsheet they can use to divide up the chores equally. They've all been very excited by the spreadsheet, and I believe they've all had \"the chat\" with  their other half, and had agreement about a new division of chores. To the best of my knowledge, that lasts a few weeks for every one of them and then it went back to the way it was before. I don't ever have that conversation a second time with them. If they raise the topic with me again, I say something like \"we've talked about this before and you know my views. It's up to you to change this and so long as you don't, there isn't any sense in keeping on asking for advice on it\" (but in kind and supportive words and tone).\n\nPeople who enable an unfair distribution of household chores are the ones who have to fix the issue. The only way to do this is to stop doing an unfair share of the household chores, either by agreement or not. It's really that simple.", "Obviously somebody willingly doing household chores for their family is a slave", "As you said \"The thing is it's not about distribution, it's adults adulting and therefor no need for discussion.\" We like to discuss everything, so yes discussion needed ;)\n\nAnd you're making some bold assumptions about me and my relationship too. But that's okay, since you're an Internet stranger and it doesn't matter. I find this rather boring and fruitless, so have a nice weekend! :)", "> We like to discuss everything, so he's, discussion needed ;)\n\nWhat? That's not something I said. If you're saying it i think your auto correct failed you.\n\nI stand by what I said. My husband and I have never once discussed household chores... we just do them. Even joke sometimes cause \"oh well I was gonna do the dishes but you got to them first\" in a fun way. So yea, adults adulting, I wish everyone had that sort of partnership and I'm sorry they don't, that's sad. I'm not saying we're perfect, no one is and no relationship is. But you should at least link up with someone who can do the basics without having to be told.", "The part you said is the part between the quotation marks, the rest is what I said. \n\nBut yeah, I have to agree that it's sad that many people (from what I've seen, mostly women though) end up in relationships where they basically do everything around the house while the other person pretty much doesn't do anything. Sadly, many people don't even realise that they have taken this role and that's why I share comics like that. As you say, no grown up should be told to do basic home chores and that is exactly what the comic says as well. That's not the same as discussing it though, discussing how you divide up chores is not the same as having to tell someone else what they need to do. If I'm honest, if a couple has been together for several years and one is just not pulling their weight, I don't have much hope for the relationship getting better (unless both are really very motivated to change things).", "NTA. She is mad at herself for allowing her marriage to get like this", "Nta, you kept it real and she couldn't handle it.....", "He does know that he is going to have to step if your sister gets pregnant and they have a baby right or is your sister going to have to do all the kid stuff and John going to be the guy complaining about having to babysit his child for five minutes while your sister goes to the toilet", "My son is 21.  Monday is uni and work.  Tuesday is uni.  Wednesday is  work.  Thursday and Friday is uni.  Saturday is sport.  Sunday is work.  Add in training up to three times a week.\n\nHis sport is not something that will ever make him money, but he does play at a high level.  He still manages to do full-time uni and two part-time jobs.  And he's 21.\n\nWhat is this bozo's excuse?"]}