{"id": 19296, "submission_id": "144exeb", "title": "Update for \"AITA for \"stealing\" my sisters baby\"", "selftext": "Original link; https://www.reddit.com/r/AmItheAsshole/comments/zrupdt/aita_for_stealing_my_sisters_baby/?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=share_button\n\nMy sister and her husband signed the adoption paperwork without any fuss. \"Sara\" will officially be our daughter on June 28th!", "created_utc": 1686244113, "permalink": "/r/AmItheAsshole/comments/144exeb/update_for_aita_for_stealing_my_sisters_baby/", "score": 2269, "replies": ["Congratulations!!", "Short and sweet. Congratulations ❤️", "Congratulations!!!", "Congrats OP!  Keep up the amazing work and Sara will appreciate it down the road! 😊", "Congratulations! Thanks for the follow up.", "congrats!", "Congratulations!!", "Congratulations! This sounds like the best scenario given your sister's struggles... Your daughter has a stable loving home that will support her building a relationship with her birth mom, as your sister is ready and able.", "Wonderful news, congratulations!", "Congratulations!!!!", "Congratulations!  That is a wonderful update!", "Congratulations! thank you for following up!", "Happy News!!! I will be smiling about this all weekend :)", "“Sara” is such a lucky girl.", "That's awesome! Congratulations!", "Congratulations! I remember your original post and I am glad that your family now has the security not to be ripped apart sometime in the future. This is just the best outcome for your little girl.", "🫶🏽❤️❤️", "Made your day", "Congratulations!", "Congratulations!", "Yay for you. That's awesome news.", "Congrats! *HUGS!*", "That’s fantastic news", "This just made me feel all warm and fuzzy. Congratulations to you and your growing family! Thank you for being there to take on Sara and giving her a shot at a stable loving home/life.", "Congratulations!", "Congratulations!!", "I am so happy to know that Sara is going to be in a stable, loving environment with you and your wife. Kudos to you and wifey! Congratulations!!", "I remember being accused of the same thing with my four adopted daughters. \n\n6 years later and the birth parents still haven't even tried to make contact with them, not that 3 of them would even remember them anyway.", "Oh yay!!! And in this, the month of our Pride, too! Just lovely", "Please make sure you get your daughter the lifelong support she’ll need as an adoptee. Every adoption is born of trauma.", "She's the blessing, actually", "That sucks. You did steal her from your sister. I’m sorry your wife can’t have her own but you only gave Jane 6 months and then you felt entities to her daughter? That’s wild. No wonder she didn’t want to leave her with you. You guys were baby hungry. Sign any papers you want. Jane will always be her mother, and when she gets it together, sara may want to be with her real mother.", "Congrats!!! That’s great news, thanks for sharing such a nice update", "Congratulations!", "Happy days, OP!\n\n\nFantastic news!", "Congrats OP!!", "Congratulations!", "Congratulations 🎊", "Congratulations!!! 🎉 ❤️ happy for you guys and for Sara!", "Congratulations 🍾", "That's very positive to hear, you helped that kid dodge some mental health bullets.  Hope everything stays well for your family!", "Happy for you, congratulations!!", "[removed]", "And if the baby is better off with OP? Jane may be an unfit mother", "\"Stealing\"!?!? The poor child was left on their doorstep, the birth mother and father voluntarily gave up the rights. \n\nKids deserve a stable home and parents that want them. Jane is just an egg donor at this point.", "Oh, indeed. But her life would be very, very different if her two moms hadn’t fought for her. I still contend she’s a lucky girl", "Congratulations! After reading your last posts and edits, I want to insure you and everyone with questions that you did the right thing.\n\nI wish I could adopt my daughter. It's been 9.5 years and her birth mom has a 3.5 year old. I also thought taking her in would be temporary. I'm single and only on social security (1,000/month) and food stamps ($200). I don't qualify for any other benefits because I haven't adopted her. Her birth father has 17 other children. \n\nThere have been long periods where we didn't hear from her mom. Her mom's family accused me of keeping her away. She's had her own cellphone since she was 4, they still don't call. We only confirmed who her father is recently. He's still too busy being a rolling stone. \n\nAs for why you didn't take your sister in, I found drugs in my home. I had strange people calling and knocking on my door. I've never used any illegal substances and rarely drink alcohol. I didn't want this around the place that is supposed to bring me peace. \n\nEnjoy your newly expanded family and the security you've given YOUR daughter!", "Congrats!!! \n\nI read your update wrong first, read your story, and then was like “wait.. she took her from you after all…?” \n\nNOPE!!!\n\n\nGlad sara gets to stay with those she’s familiar with ❤️❤️❤️", "I am interested but not enough to read", "That’s amazing!  What’s even better is that June 28th is my birthday!  Two great things happening on that day!  Congratulations!!!!", "To Sara, congratulations on having a loving home and caring parents!\n\nTo OP, I am hoping that sister and her husband can straighten their lived out and become part of Sara's family, and I am very happy for your new addition to your family!", "Congratulations", "That's great to hear. How have things been with your sister? Is she making any progress? Has she been trying to see your daughter at all? I'd love an update on her life.", "Congratulations OP! I was adopted by family when I was a baby, and while I definitely should have gotten therapy when I first found out, it’s still the best thing that could have happened to me. I owe my whole life to my parents. Thank you for caring so much for her and making sure her best interests come first.", "Congratulations", "Congratulations!! I just wanted to say that I read the original post and wanted to let you know that you’ve done everything correct imo. Taking your niece, de facto daughter, from the situation your sister was in was the absolute right thing to do. At this point there’s really nothing you could have done differently because I believe this was what was best for “Sara”", "Congrats on successfully \"stealing\" your sister's baby.", "I can feel the love you and your wife have for her. You will be the best moms to her, I can tell. I hope you have the time of your life with your family ❤️", "Damn, you are telling me this post was 5 months ago? Time does fly. I'm very happy for you and your family!", "Oh wow how did your sister have such a big change of heart? What happened?", "Yay for happy ending!", "Yay! The best news I’ve seen today.", "Thank you for the update!!! The very best wishes for you and ‘Sara’ ❤️🫶🏻❤️", "Thank you ❤️", "Yikes", "Did Jane write this post?", "That was nearly a year ago. In what works does protecting this child from a traumatic childhood a bad thing?? Plus the parents signed her over to them. That is NOT stealing their baby.", "I honestly have no idea. We met with a lawyer and were ready for anything, but when we opened up the conversation with them, they immediately agreed. My wife and I were extremely shocked, but grateful. The minute they left, we both burst into tears. We were so ready for it to go bad.", "Maybe a lawyer told her the reality of her situation that reunification was unlikely and even if it did go that way she would have to put in the work pass drugs tests etc", "You posted this a year ago - contradicts your latest post.\n\n“So me (f23), my best friend (f22) Sara, and her little sister (F18) Tina.\n\nSara has 2 kayaks and moved out of town, but left the kayaks with her mom and told me that I could use them whenever I wanted to. One day Tina and I decide to go kayaking, we let her mom know, pack up the kayaks, and go. Important; Tina has several medical conditions, (none that made it unsafe for her to kayak) but she can have hallucinations and pass out. We get into a situation where we both almost died and lose the kayaks in the process (long story; character count won't let me tell the whole thing, but there was a lot of action. I swallowed plenty of water, she passed out several times, then 2 miles of me carrying her to where the ambulance could meets us).\n\nWe both end up being ok. But after all this Sara is mad that her kayaks are lost and demands that we each replace the kayak we were in. She says if it was an accident that they were lost or not, we are still responsible for the things we borrow. Which is fair. However, considering that we both almost died, it hit a sore spot that THAT'S what she was worried about. Also, she never used the kayaks and no one was taking care of them, to the point that the reason we got on the water 2 hours after we were planning to was because we had to wash the mold off of them. Also, that we're long time, very good friends where things like this would normally be brushed off and forgotten. She claims that we were irresponsible for kayaking so late in the day (2pm water time?) and that we didn't ask her if we could even use the kayaks (she said we didn't need to ask and we let her mom know). Also, I don't make much money and live paycheck to paycheck, whereas she makes 6-figures. The kayak was $700-800, she spends that much in a day on bags and clothes and that's a week and a half of pay for me.\n\nHer sister refused to replace hers, but just because we're friends and I didn't want to argue about it, I decided I would buy a new kayak. But as I don't make much money, it was very difficult for me to buy one, and since I disagree with having to replace it, I wasn't in any hurry. But this also meant that if I spent money on ANYTHING else, she would bring up the kayak. She brought it up so much and we argued about it so much that it got to the point where I said I would not be replacing the kayak because of the way she was acting about it and because I still don't agree with having to replace it at all. I told her \"I saved your sister life, almost died myself, and in the process, lost a kayak. And now you care more about the kayak than you do our friendship. If you really wanted a kayak, you would have bought one. I will not be replacing it and if you bring it up again, I will cut contact.\" Since then we have barely spoken and or friendship has all but disintegrated.\n\nSo Reddit, who's the asshole in this situation?”", "Congratulations!! That's fantastic news!", "Now that is an update! Congratulations!", "Congrats and I do agree with someone about getting her into therapy centered on the adoptee. I'm sure you are setting her up for the best place she can be at but I'm also sure she will have questions and concerns. I hope Jane manages to  get on the right path so she can have a part is Sara's life.", "Mazel tov!!", "Congratulations and so happy for all of you.", "congrats omg! off topic, but that’s actually my birthday haha. i’ll be thinking of your fam and celebrating for y’all ✨✨🤍", "That baby will have a lovely family. Thank you.", "Congrats!", "Yay.  You have her best interest at heart and are her true mom.  And a great person.  Hopefully she realizes what you did for her when she's old enough", "Absolutely - OP has done a big thing.\n\nI am not permenant guardian of my nephew. He came to us at 6. He is 8 now. My little sister struggled with addiction for most of her life. I never wanted kids, but now I have one.\n\nOP, nobody will know what it's like. So many emotions - anger, fear, resentment, empathy, and anger again. And heck, my work promotes harm reduction and acceptance of drug use and encouraging healthy alternatives rather than penalizing users. I have naloxone on me all the time. I have all the compassion in the world, and I still feel such fury for the harm my sister caused my family.\n\nI hope your sister recovers. Mine died of an overdose about 4 weeks ago this very minute, just 6 weeks after getting out of a recovery jail she transitioned into after prison. She was only 30. She hadn't talked to her son in weeks on the phone and it had been weeks before that, and hadn't seen him since I took him back to visit her over a year ago. He went to school with a plan to make a mother's day card so I could send her a photo and after I picked him up I had to tell him mommy was dead. It breaks my heart to even type it. I feel such immense anguish and pain and sorrow for myself, but even more so for the little boy sleeping downstairs and my poor parents.\n\nBut I won't lie that I feel a deep sense of relief that not only is he safely ours now with no chance she might complicate and traumatize him later, but also because he is so safe and loved and has resources and therapy and a community of folks to protect him.\n\nDon't feel guilty for any of it. You are a good person and that baby will thank you for it when they're all grown up ♡", "How come you can't adopt her? Birth mom won't sign away rights or something?", "Some good news, some bad. Since they signed the paperwork 3 months ago, neither of them have visited or checked up on her. However, my sister is attempting to divorce her husband, which is a great step in the right direction. She was also offered a job by my other sister in another state and plans to take her up on it.", "Our son is in therapy, and luckily, it doesn't bother him at all that he's adopted. We get nothing but \"great job\"s from his therapist. When she's old enough, hopefully, she'll be the same.", "Thank you. I agree, but there's always gonna be that tinge of doubt and guilt.", "Thank you so much!", "BicycleSignificant81 is a comment stealing bot. This is rephrased from the parent comment, most of its other comments are copy-pasted stolen comments. \n\nThese accounts eventually get used for t-shirt scams: they'll soon start trying to sell bootleg fandom merch on other subs (pretending they just bought some cool shirt/mug/poster and then linking a shady website that will steal your personal details). Report as spam - harmful bots", "She doesn't want to because she doesn't want to hurt her mom's feelings. I don't think she understands that it's mostly for benefits (and because I would love to officially make her mine). Her mom will never be out of our lives because we're family.", "Glad to hear she's moving forward.", "Awesome to hear! In my case it wasn’t the adoption part that bothered me, I just had a hard time processing who my biological parents were. Neither of them are exactly what you’d call good people. \n\nSounds like you’re doing everything right! Congrats again, and may your family have all the love and happiness you deserve :)", "My husband and I had a similar conversation when my sister and her husband had my niece. Neither one of them had expressed an interest in having kids so we were concerned there was going to be some issues. That was four years ago and thankfully we were completely wrong and they love her so much.", "That's what our lawyer told us, and what we were ready to tell her, but we didn't get that far before she agreed."]}