{"id": 19297, "submission_id": "144ch1j", "title": "AITA for confronting my husband about his sudden changes around the house?", "selftext": "I (40F) have a habit of taking my two kids (8 F) and (10M) to visit my family in a suburban area close to the city we live in during the 1 week break they get at the end of their first semester each year at school. We’ve been doing that for as long as i can remember.       \n\nThis all started 3 years ago when my kids and i came back from my family’s, my husband insisted he had a surprise for me and that i would absolutely love it. Once i entered our living room, i discovered he had painted the walls a hideous shade of pink, almost peach but still mildly striking. I hated it.\n\nFor context we own a house far away from the city centre to which we go to during weekend and in which i gave him full liberty to do his arts and crafts considering how much he loves doing these things, the appartement i came back to tho, is closer to our jobs and the children’s schools so we stay there during the week. I acted as if i liked the change and that it’s refreshing to the living room that i had previously decorated in muted and monochromatic colours, but that these kinds of decisions should’ve been discussed prior. He agreed and we moved on. \n\nThe next year however, while driving back home from my parents, my husband called and informed me that he had yet another surprise for the kids and i and that it involved our balcony. I loved our balcony it was my safe place, i kept plants in there and spent all of my alone time in it and so i was irritated at the thought of it changing without my knowledge. My husband decided to remove the demi-wall i hung my plants on and replaced it with a green metal grid and put plexiglass on the top area so the balcony was completely closed now. He also disposed of all my plants that ive grown particularly fond of. \n\nI was livid to say the least but kept it together in front of the kids and just went to bed since i was already tired. I figured i could just get new plants and not make a big deal out of the situation since ly husband seemed happy about it. The next morning at breakfast a silly argument started between us and my husband started stating all the things i do that he hates and so i blew up and told him every single ^refrechement^ he’d done is hideous to me and that he has no taste in home décor and should stop believing he does, he got mad, stormed off, and is now giving me the silent treatment . Am i the AH for saying what was on my mind?", "created_utc": 1686238520, "permalink": "/r/AmItheAsshole/comments/144ch1j/aita_for_confronting_my_husband_about_his_sudden/", "score": 689, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > My husband called me an asshole for confronting him about the ugly changes he made around our appartement while i was away and without my previous consent.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nOk, the paint colors were one thing, you don't agree on paint colors but you're willing to put up with it.\n\nHe DISPOSED of your entire plant collection without talking with you? WTF? He threw away living things you maintain.", "NTA. Why is nobody commenting on how malicious and controlling the husband's behavior is? He purposely destroyed her decorating in the living room and then threw out all her plants and closed in her favorite place in the house. He's trashing everything she likes.\n\nThe husband is purposely doing this and then when OP objected he had a list of complaints about her just ready to go.", "your husband threw your plants out?!?!??? NTA. What a git.", "NTA.   \nPainting is one thing, it can be painted over.  \nYour husband definitely shouldn't have thrown away your plants. If he knows the balcony is your space then yeah he should've talked to you before he did anything. He should've talked to you about changes before he tried to do any.    \nThe house is owned by both of you so I do believe a discussion should've happened before he did anything.", "Nta. Your husband's taste is irrelevant. It's both your home and those choices are a joint one. And I would be LIVID if my plants had been moved and the wall I'd put up for them to climb up had been removed. Seriously I'd be absolutely devastated and furious. My husband knows he never needs to touch my plants unless there's a house fire.", "NTA except for the bad taste comment. His tastes may just be different than yours.\n\nHe's TA for fricking throwing out your plants! Who does that? I'm sure you thought you made it clear that these kinds of decisions need to be discussed ahead of time, but apparently not. Yall need to calmly discuss this and he should be repurchasing your plants and perhaps even replacing your demi-wall", "Info:  has he ever complained about you guys leaving?  Maybe a malicious way to keep you home?", "NTA, but when things calm down, have a civil discussion about it.", "I would take his car that he drives to the office and have it spray painted Barbie Pink and have pink fur lining on the car interiors. Also install an extremely loud and embarrassing ringtone on his phone. Replace all the office shirts with Frilly neon colored shirts etc. And that would just be the beginning of my comeback.", "ESH\n\nBy pretending the first remake didn't bother you, you set up a situation that later led to you releasing all the pent up feelings in a way that wasn't constructive.\n\nYour husband is changing things after agreeing that redecoration decisions should be mutual, and he got rid of plants that he knows you put time into caring for.\n\nThis is not about redecorating. It is about two people who communicate with passive aggressive messaging because they haven't learned how to share their feelings. Things build up until something blows up. Get a therapist. Learn how to talk to each other.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (40F) have a habit of taking my two kids (8 F) and (10M) to visit my family in a suburban area close to the city we live in during the 1 week break they get at the end of their first semester each year at school. We’ve been doing that for as long as i can remember.       \n\nThis all started 3 years ago when my kids and i came back from my family’s, my husband insisted he had a surprise for me and that i would absolutely love it. Once i entered our living room, i discovered he had painted the walls a hideous shade of pink, almost peach but still mildly striking. I hated it.\n\nFor context we own a house far away from the city centre to which we go to during weekend and in which i gave him full liberty to do his arts and crafts considering how much he loves doing these things, the appartement i came back to tho, is closer to our jobs and the children’s schools so we stay there during the week. I acted as if i liked the change and that it’s refreshing to the living room that i had previously decorated in muted and monochromatic colours, but that these kinds of decisions should’ve been discussed prior. He agreed and we moved on. \n\nThe next year however, while driving back home from my parents, my husband called and informed me that he had yet another surprise for the kids and i and that it involved our balcony. I loved our balcony it was my safe place, i kept plants in there and spent all of my alone time in it and so i was irritated at the thought of it changing without my knowledge. My husband decided to remove the demi-wall i hung my plants on and replaced it with a green metal grid and put plexiglass on the top area so the balcony was completely closed now. He also disposed of all my plants that ive grown particularly fond of. \n\nI was livid to say the least but kept it together in front of the kids and just went to bed since i was already tired. I figured i could just get new plants and not make a big deal out of the situation since ly husband seemed happy about it. The next morning at breakfast a silly argument started between us and my husband started stating all the things i do that he hates and so i blew up and told him every single ^refrechement^ he’d done is hideous to me and that he has no taste in home décor and should stop believing he does, he got mad, stormed off, and is now giving me the silent treatment . Am i the AH for saying what was on my mind?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "ESH? the biggest takeaways from this seem to be that:\n\n1. you should be honest with your husband about your feelings, so things he thinks he's doing as a kindness and expression of love for you can actually feel that way to you, and \n\n2. the man is clearly bored to tears when you take the kids away to your family's and will always need a project to do. knowing you want to discuss big home renovations didn't stop him from rationalizing that the balcony must be okay. help him find one the next time you go.", "NTA\n\n&#x200B;\n\nGet a divorce, this is abuse.", "ESH. You should have talked to him calmly about the pink paint and nipped his home decorating in the bud. Personally I would have tossed him over the balcony for getting g rid of plants.  What was his logic there?", "[deleted]", ">my husband started stating all the things i do that he hates and so i blew up and told him every single refrechement^ he’d done is hideous to me and that he has no taste in home décor and should stop believing he does\n\nESH, Everybody Sucks Here.  More you than him.\n\nHe sounds clueless, not malicious. Definitely should not have re-done the balcony without discussing it first, since you made it quite clear after the pink paint that you didn't appreciate his 'surprises.'\n\nBut you personally attacked him, with cruel words chosen specifically to hurt.  When you're at the point of feeling comfortable talking to a spouse that way, you need marriage counseling or a lawyer.", "I don’t see a conflict here.", "I’m not sure. This is what happens when you don’t communicate and brush everything under the rug. Now you both are TA’s.", "Ooof, I'll say NTA but you could have been nicer. What he did was rude for sure, specially throwing away your plants!! But he musta been doing it from a place of care/love, so in his mind it was a kindness. I hope you can talk this out and he can realize what he did was wrong. Maybe suggest starting a home decor project together?", "Agreed! I could totally see him mistakenly thinking she’d love pink walls and thought it was really sweet until he threw out her plants wtf", "This is my thought as well.\n\nHe's upset that she leaves with the kids but doesn't have a \"logical\" reason why so he stews in this resentment and does these things passive aggressively to punish her for leaving \n\n\nIf the whole living room was in monochromatic neutral colors ... Then he had to know that his wife wouldn't LOVE being surprised by a bright peachy pink paint job. \n\nAnd not getting the reaction he was hoping for, upped the ante the next year by destroying her balcony and throwing out her beloved plant collection.", "I really like the way you think", "I've never had to discuss \"please don't throw away my things\" with my boyfriend.", "She did ask him not to do any further changes without talking it over first.", "He threw away her stuff. How is she worse??", "This action was performed automatically", "Any time my mom left town when I was growing up she would come back and my stepdad would have rearranged the whole house. He would make spaces completely unusable and it was really irritating. He absolutely did this either consciously or subconsciously to punish my mom for leaving for any length of time. NTA", "NTA but you should of nipped it in the bud and told him exactly how you felt after the first things he did", "nta. Houseplants are not cheap if you want the more rare ones.  Pop ups are charging 50 buck minimum for a cutting of a leaf. And that's the lower end of the scale. I'd be livid.  And then he... turns the balcony into some hot box that you can't use nta.", "NTA, and honestly? This sounds like some kind of weird power move. Why did he have to throw away your plants? What did he do with them and they're already gone? WTF?", "INFO: Do you think he did this to intentionally start a fight? I get the impression you two don't communicate at all. And you both obviously have a lot to say to each other that wasn't getting said.", "INFO: Why is he not coming with you on this visit every year?   \n\n\nIt seems that he resents that you leave without him and is acting out while you are gone and he can't deal with his feelings more appropriately. Does your family not like him? Is he left for the week ruminating over what everyone may be saying about him or how you're all just having a great time without him?   \n\n\nNone of this excuses anything he is doing, but it may help to understand what is going on under the surface.", "He hates you for some reason. The plants were just a surrogate for you. Not sure what's going on but I suggest therapy so you can talk this out.", "Uh, is he OK? He sounds not right in the head from eating too many bad sausages.\n\nNTA but get him help.", "NTA toss the husband and get more plants", "I *gasped* when I read about the balcony, but couldn't *buh-lieve* he threw the plants away. NTA. How awful to make such changes without discussing it first.", "ESH or probably NTA. It seems to me just basic common sense that the primary adults in a residence should talk to each other about major painting/reburbishing/furniture/landscaping decisions. Is this not how you guys operate? Is all your 'not make a big deal about' stuff contributing to some weird non-communicative dynamic where you guys don't talk about normal stuff and it turns into after-the-fact fights? Or is he just circumventing established norms of basic communication with this 'surprise' notion to do what he wants without consulting you?", "ESH (more him than you) - You should have spoken up about the wall color. Throwing out your plants is some passive aggressive shit. He resents you, or maybe your vacations without him, for some reason. Counseling ASAP.", "NTA he has been disrespecting you. He knows that. throwing away your precious plants!!! I would be so sad!", "There is no reason to \"surprise\" your partner with big household changes. \n\nYou can \"surprise\" them with a plan/proposal for their approval, sure. Some people might appreciate you putting in all the work, sourcing the items, pricing out the materials, etc. But for god's sake, give them a say in it before you pull the trigger. \n\nThis is what me and my partner do. We don't collaborate terribly well on projects, so one of us will take the lead and do the planning, then run it by the other before making a move. It works out great. Nobody gets overruled. \n\nThe only reason to do it as a \"surprise\" is if you don't think they're going to approve and you believe in asking forgiveness rather than permission. That is to say, making it a \"surprise\" really just means disregarding their wishes. NTA. Especially since you've previously talked with him about this and he did it anyway. You deserve to have a say in your home decor.", "Tell him in NO UNCERTAIN TERMS NO more painting or redecorating unless there is mutual agreement. Nta", "Nope, NTA! But you guys should set rules about not changing major things in any house, unless you both agree to the specific change… or is this his sneaky way of making you scared of leaving him home alone???", "NTA you don’t paint the house a new color or remodel the balcony without checking with your partner first.", "NTA- those are decisions that should be made together.", "NTA. He threw away your plants? That’s awful.", "NTA Time for couples counseling.", "Esh. If you don't communicate when things happen, you're setting yourself up for future resentment, as you learned here when you both threw the things you never communicated to each others faces in a fight. That's not healthy communication, I highly recommend a couples therapist before this breeds into a bigger beast so you can have a mediator for the discussion. There's a showtime show called couples therapy that's a great rep of what actual sessions look like. \n\nHe's an asshole for just throwing away your plants. Does he have any idea what a collection costs? \n\nHome decorating should always be a joint project. If he wants to do more or have more say around the house, he needs to say something, he can't just unilaterally decide things any more than you should be. I care more so I do more work, but my process with my husband is I grab 3 pictures for a room with styles I'm interested in replicating. My husband and I sit and talk through what we like or don't like, then in round two I pull together the inspiration boards based on the specific notes we discussed and discuss further to ensure I hit the mark. After that, we both get assigned specific furniture to find within our budget and present our options. Never have had a fight about what our home should look like in the decade we've been together.", "YTA for not communicating your feelings better. NTA for having those feelings.", "ESH - He should have discussed with you first and you should have been honest with him.", "NTA", "ESH but you need to be more upfront about these things in the moment. Shrugging them off and not being honest about what you're feeling or thinking until you blow up isn't a healthy communication model, and has probably led to him not understanding your true feelings. You need to sit down and have an honest conversation about why he is doing these things and how they make you feel.\n\nEdit because I changed my mind on my judgment. It sounds like you needs some couples counseling so you can both learn to communicate in a healthy and productive way.", "ESH for waiting to until you had a boiling point and completely unloading all at once. You essentially lied to your husband by failing to be direct with compassion. \n\nInstead of \"pretending\" to like the hideous paint. You should have said, \"I appreciate the effort that you put into this and that you thought I'd like this, however I don't. This isn't the type of décor I want to live in and we should mutually agree on how we customize our home so that we can both be comfortable and happy with the outcome.\"\n\nYou essentially gave your husband the stamp of approval when you said you like the \"paint\", even though you said you'd like to discuss it in the future, you gave him verbal approval of his taste, style, and \"Surprise\".\n\nYour husband is TA for throwing your personal items away. Living plants are a little more than decoration. It's pretty shitty of him to just toss them in the trash and not even storing for you to put them somewhere else. \n\nYour husband lacks consideration and you hold onto resentment that you allow to boil over.", "I’m confused… you have a house and an apartment?", "ESH - Therapy, pronto. Neither of you are in the right completely.", "ESH\n\nObviously these were things he should have run by you. But why tf were you pretending you liked them? Both of y’all’s communication sucks.", "ESH - so you do t like the way he decorates, but you described everything he changed as him changing things you did. You blew at him saying you think what he did was ugly however its also entirely possible he thought the same about the rooms before he changed them\n\nHave you 2 done any decorating together?", "I'd say YTA for not speaking your mind the previous times and then blowing up about it. How's he supposed to know if you pretend", "YTA. You mention this started 3 years ago, the only thing you said was \"we should talk about major changes\". That's not remotely good communication. Then, when he made another change you didn't like, you blew up at him and said things that I assume you know are intentionally hurtful. You know he likes to do art projects, so telling him he has no taste is just rude and hurtful. Honestly I'm shocked he threw your plants away, but you went to bed without saying anything?!!? Maybe ESH, but your communication is top tier bad.", "ESH. On multiple occasions your husband has made significant changes that you can't stand, but you didn't tell him that they bothered you. You weren't even going to tell him how you felt about the plants! It's no wonder you blew up at him when the opportunity arose - you are rightfully pissed off.  \n\nYour husband is absolutely in the wrong for doing what he did. But you are being way too passive about your own needs. You can't expect your husband to take your feelings into account if you don't tell him what they are.", "Yikes. \n\nYou were a fucking 10 on him painting the room pink. Why the fuck did you present a 4 to him? Communication requires honesty, including sharing negative feelings right away instead of letting them fester.\n\n\nNo idea why he thought throwing your plants away was okay.\n\n\nEdit: wait, you have two properties, this is the one that is explicitly for gim to play around in? YTA all the way wtf", "Completely TAH, you should have spoken up at the time, but you pretended you liked it so he tried it again you didn't say shit then blindside him the next day. How in the heck do you think you aren't the a hole", "you weren’t honest with the first not discussed change so he kept going. In not bringing it up and placating his feelings you enabled the next step to happen.  It’s not really fair to him to be furious now if you didn’t speak up and agree to ground rules the first time.  For that reason, YTA", "NTA. My husband and kid go to his parents' house without  me once or twice a year.\n\nI like to get projects done around the house, but I don't make big changes. Just, like, going through different cabinets and tossing expired toiletries, refilling spices, or dropping off clothing donations. All stuff we'd already discussed. \n\nI certainly wouldn't repaint a room or throw his things away.", "NTA. Look, I do projects when my wife is out of town. It's peaceful to not have a back seat driver, but I would never just make a solo decision about a paint color (in a common space, my office my choice). If I got rid of her plants it would only be because they were already dead.", "NTA, though I would have said to him at some point after the paint incident that you didn’t personally like the decor and no more surprises.", "NTA. He got rid of your plants?? What was he smoking??", "NTA. \n\n>but that these kinds of decisions should’ve been discussed prior. He agreed and we moved on. \n\n>He also disposed of all my plants that ive grown particularly fond of. \n\nI'm so happy my husband has a brain. The man doesn't touch my babies (my plants) without even checking with me.", "NTA\n\nPaint?  Ok… \n\nTossing out your plants from the balcony?  Nope….  \n\nBoth should have been discussed ahead of time.  He screwed up big time", "If my partner threw out NON-LIVING belongings of mine, I would be pissed. Throwing out my PLANTS??!? No. Just no. Does this person know you at all?", "NTA. Decor surprises should never happen unless discussed and agreed upon by both ppl. This is very disrespectful of him to do this behind your back. Especially when you've made it clear you dont like it when he doed.", "NTA, omg I'd be livid. I'm terrible with plants, but my yarn is my baby. My husband wouldn't even move my yarn without asking me about it. It comes down to respect, imo.", "This is really weird. On the surface I could see this as a really misplaced form of showing love. The first time. But a whole year later he secretly plans what to change without you knowing again, after having discussed how changes to the apartment need to be made together. Not only that, but he changed your favorite area and threw out your plants?! Wild. Petty as fuck. Dare I say, unhinged. I think you two keep A LOT of your feelings to yourselves and it’s coming out in weird ways now. Time for a couples therapist.", "To b perfectly honest id throw him out like he did Ur plants what an AH", "NTA. This isn’t about being creative or trying to do nice things, this is about him either having an impulse control issue or he’s trying to make you leave him.", "ESH. Y’all are adults, learn how to communicate.", "Yeah, your husband's an AH for throwing away your plants. Those aren't just objects, they're living things which you have nurtured and which bring you a sense of connectedness and calm. I would rip my husband a new one if he even rearranged my plants without consulting me.\n\nNTA", "NTA he is doing this on purpose. This is meant to punish you.", "NTA", "NTA!\n\nIf I came home, and found out my husband had painted the main common area of our home, a colour I hated, without even consulting me, I'd be pissed as it was. Not just that he did it without talking to me, but because he was literally my husband, and didn't know what colours, and style I like.\n\nThen I got to the part about the plants, and all I can think is wtf is his problem? Is he mad about you going away or something, and has picked the most passive aggressive way that is humanly possible to try to punish you for it?\n\nEither way this behaviour is super weird, and controlling, and a really big red flag to me.", ">The next morning at breakfast a silly argument started between us and my husband started stating all the things i do that he hates and so i blew up and told him every single refrechement\\^ he’d done is hideous to me and that he has no taste in home décor and should stop believing he does, he got mad, stormed off, and is now giving me the silent treatment . Am i the AH for saying what was on my mind?\n\nESH!\n\nYou held it in that you didn't like his renovations.  Apparently he's held in some opinions too about thing's he hates.  You both blew up at each other over a silly argument cause you're both not communicating elsewhere which is leading to blow ups it sounds like.\n\nBe honest with him if you don't like the renovations and be kind to explain you wish he'd consult you.  Be open to his criticisms as well, as apparently he's been holding them in too.  Maybe see a counselor because the blow up sounds like there is more to this then this one argument over renovations.", "NTA this dude sounds controlling as hell", "The pink walls sounds like he was watching reruns of a British show where two families swapped houses.  There were way too many in the series that used a pink that pretty spot on would match the contents of a bottle of pepto bismal. \n\nSo if the patio area is in the sun and covered with a  ‘ceiling’ if clear plexiglass I’d think that little area could become uncomfortably warm at least for people. \n\nNTA as I know your husband tried but good lord those are not small changes and should be discussed. \n\nOP I hope you and your husband are  able to have a calm discussion in a few days about your differing views and come to a compromise.  Possibly back to he can do what he wants in the country house assuming you all have agreed on a budget but the in the city home changes must be discussed and agreed upon. \n\nWhile you are waiting maybe see if you can find some paint samples to look at.   As well as getting your plants back in the patio.", "NTA. You definitely need to work on your communication skills, however. You can't just let things slide in the moment and risk blowing up later. But if my husband ever threw out my plants while I was gone, it would be the last thing he ever did.", "NTA\n\nAs others have said, it is very possible he is doing this to passive-aggressively punish you for taking these trips.", "ESH\n\nYou two have clearly grown apart over the years. If you care about this marriage continuing you two need to figure out how to communicate and grow closer together again. \n\nEither way, you two sound like you resent each other and you both treat each other poorly. This isn’t how marriage should be.", "NTA! If my husband threw out any of my plants there'd be hell to pay. Your husband not discussing major house changes with you ahead of time is just selfish. He seems to take these liberties when you're gone so could it be that he really hates when you guys are gone and does these things to fill some void and get a reaction from you all? I really feel your pain on your balcony because that's one of my spaces in my home too. I totally understand. Maybe he should go on these trips with you all from here on out.... Still NTA though.", "To me, this sounds more like a control thing rather than him not wanting her to go on those trips, but maybe that's related.", "I have over 30 plants in my living room alone. I would be devastated.....", "Like others - THE PLANTS? Anyone hurting my plants might as well throw out my fur babies and human child. Nopely, nopely, no.", "This was my first thought. I love my plants I’d be so sad and angry!", "All of the husband’s actions are some passive aggressive bullshit.   He doesn’t like something about those trips.", "I don't even have living things I maintain, but my partner was joking about changing major things in the house in the times I'd be be out town. I told them straight up I'm not OK with that since I need to be consulted just as well as I'd consult with them on the idea AT THE VERY MINIMUM instead of doing it whole hog (concept to execution). \n\n\nI have no issue with major or minor remodels being done so long as I had input beforehand and it's just execution happening without me", "Completely agree. It’s one thing to redecorate. But literally if I came home and my husband had thrown away all of my plants, his body would be 6 feet deep fertilizing my garden", "I would be so pissed off about that. \n\nIf it's not yours, you have no right to throw or give it away. \n\nOP should throw his stuff in the trash and see how he likes it.", "Throw out my plants? You're next!", "I’d go with ESH because OP never voiced objections to his home decorations. If she keeps “loving” everything he does, he probably got the false impression that he can do no wrong. Even after the plant thing she pretended like it was ok. He gets TA for throwing away all the plants, because who throws away other people’s plants?", "She's still the AH for blowing up at him and telling him everything he does is hideous. The fact that she wasn't honest with him about her thoughts on the changes only makes her more of an AH. She didn't even confront him about the plants, her communication is atrocious.", "You are wrong", "Does he not want her to go and this is his way of punishing her?", "OP to husband:\n\n\"I love you. And ever since you repainted the living room I realize you love punk so much and I never knew! I dyed all your white shirts and sweaters Pink while you were at the pub.\",", "OP to husband:\n\n\"I love you. And ever since you repainted the living room I realize you love punk so much and I never knew! I dyed all your white shirts and sweaters Pink while you were at the pub.\",", "This is the house they spend <2 days out of the week at, and which is explicitly his for arts and crafts.\n\nOP is the asshole here, absolutely.", "OP to husband:\n\n\"I love you. And ever since you repainted the living room I realize you love punk so much and I never knew! I dyed all your white shirts and sweaters Pink while you were at the pub.\",", "Could also be acting out as he feels their home doesn't reflect his ideas, and is disguising the things he wants to do to put his mark down as \"help\"", "But she established after the first time that these should be mutually agreed upon decisions.   Just because she didn't have a melt down doesn't mean that she didn't address it.", "She has to take care of their kids *and* manage his free time. She might as well bring him along if he needs his hand held so badly.", "I have had absolute break downs because the changes were supposed to upset me. The few time they were nice but unsettling because I hate surprises the X-husband was Slightly irritated when they didn't hurt me enough.", "Ding, ding, ding! On target with that observation.", "Yes! I would not be ok with my husband redecorating without us talking about it first. That just seems a little controlling or something.", "If my husband threw away my plants he'd better sleep with one eye open.", "Holy shit, the amount of arguments and logical reasoning included in this comment!", "It reads that way doesn’t it?", "That's exactly what I was thinking.", "Sounds more like passive aggressive punishment for all the things he doesn’t like that she does, but keeps bottled up inside.", "This. This is exactly it. I once went for lunch with a friend and when I got home my alcoholic ex had tried to wallpaper the entire place. Then one time I was in hospital for a week with a throat problem, came home and she'd done something similar. This is definitely a 'this is what you get when you leave me alone' type of relationship.", "No it’s not. This is at their daily apartment. OP was saying that he has a place to redecorate to his hearts content but he chose to fuck with her plants instead.", "She casually mentioned, 3 years ago now, that they should discuss major changes. She never discusses her feelings on the paint, or the plants.", "Skipping all the renovation nonsense, it sounds like some non-relevant argument started at breakfast and they both unloaded things they'd kept in.  There seems to be an underlying issue and the renovations and disagreement is only a surface sympton.", "Are we reading the same story? OP doesn't address any of her concerns with her partner. She lies about the reasons she doesn't want him to make changes, and doesn't address issues when they come up. She built up 3 years of resentment and then blew up at him telling him his artistic taste is bad.", "When \" I'm alone\" I start cleaning,  taking the trash out, dishes and laundry.... Maybe I'm just weird, but the first thing I see is something that needs cleaning.", "She should tell her partner not to throw away her things? I've never had to tell my husband not to throw away my book collection because he's not crazy. I can turn a blind eye to paint but you don't throw away your partner's belongings.", "She blew up at him *after* he started rattling off things he hates about her", "She lies and said it was fine but did ask him to communicate before making these changes. So it's not like she said \"great\". She said said \"great... But don't do this again\" and he did!"]}