{"id": 1930, "submission_id": "yqurka", "title": "AITA for telling on Steve?", "selftext": "We have this guy in the office Steve(60’s) that’s been a nightmare since my internship a few years ago. He recently said in a meeting “you all should thank me for paying off your student loans”  I asked him about his education and Steve said he was street smart not book smart and he never went to college. Strange enough we have access to employees profiles on our workday app and it says Steve as an MBA? In the next meeting I ask Steve about his MBA and he says he doesn’t have one or any college background. Our project manager is ??? because Steve was hired for having an MBA and he’s either lied on his resume or lied to his team an Steve was suspended now Steve has been laid off. A few coworkers said it was my fault for questioning Steve credibility but I told them to call me the Karma fairy and Steve deserved it.  Some feel sorry for Steve because of his age and he’s going to have issues finding a new job without his “degree”", "created_utc": 1668026039, "permalink": "/r/AmItheAsshole/comments/yqurka/aita_for_telling_on_steve/", "score": 156, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > No one knew of Steve’s lies until I checked the workday app seeing it said he had a MBA and I called him out on it publicly in a meeting\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA.\n\nFirst, it's Steve's fault for lying.\n\nSecond, it's Steve's fault for not at least remembering what lies he told on his resume.", "NTA. Someone else caught him lying and looked into it. \"Play stupid games\" and all that.", "NTA. Steve is an idiot. \n\nInfo: why were you supposed to thank him for paying off your student loans?", "Not so street smart now, are ya Steve?! NTA", "NTA\n\nSteve lied about his education and got found out. Steve got Steve fired.", "NTA, it's Steve's fault for lying about an easily verified fact and the office's fault for not checking.", "NTA. You didn't make Steve commit fraud, he did that all on his own. \n\nHe should be thanking you for paying his social security and Medicare in a couple years.", "Nta, dude brought it on himself", "NTA Steve deserved this Karma", "NTA he dug his own grave.", "NTA but definitely TKF (the karma fairy).", "All you did was ask him a question and he answered it truthfully, wouldn’t be an issue if he didn’t lie to get the job *or* been aware of who was around him when he answered your question and not contradicted information that got him hired. Your coworkers can feel sorry for him all they want, but that doesn’t mean you did anything wrong. NTA", "NTA Steve spun his lies, now he is entangled in the web he weaved. Steve should be thanking you for for cutting him loose from his lies.", "NTA. Steve chose to play a stupid game, and Steve won a stupid prize.", "Steve lies and can't keep his stories straight? Steve got himself \"fired\" PERIOD. NTA", "NTA. Steve shouldn’t have lied.", "Hmmmm. I'm struggling with this one. Workday profiles are \"public\" to employees so technically anyone could have seen it. You can't tell a blatant lie that anyone could fact check like that so part of me is like he's a dumbass for that one. But, I think its the more sorta doxxing him in a meeting (among his peers) vs confronting him later or with another superior. I don't think YTA, but it doesn't sit with me quite well. I dunno.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nWe have this guy in the office Steve(60’s) that’s been a nightmare since my internship a few years ago. He recently said in a meeting “you all should thank me for paying off your student loans”  I asked him about his education and Steve said he was street smart not book smart and he never went to college. Strange enough we have access to employees profiles on our workday app and it says Steve as an MBA? In the next meeting I ask Steve about his MBA and he says he doesn’t have one or any college background. Our project manager is ??? because Steve was hired for having an MBA and he’s either lied on his resume or lied to his team an Steve was suspended now Steve has been laid off. A few coworkers said it was my fault for questioning Steve credibility but I told them to call me the Karma fairy and Steve deserved it.  Some feel sorry for Steve because of his age and he’s going to have issues finding a new job without his “degree”\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA but remind me never to get on your bad side. You go for the jugular.", "Steve told on himself", "Oh, Steve. FAFO.", "Technically YTA. But I would have done the same thing, if that’s any consolation.", "to the under 30 you are NTA, to the rest YTA \n\nI am sure you feel he \"deserved\" it, and technically you didnt do anything wrong. I would recommend caution invoking the karma fairy she tends to enjoy coming back around", "YTA, you got a dude fired because he was a smart-aleck. I mean sure you didnt mean to fire him like that, but the net result of your actions resulted in getting him fired when he didnt do anything for you. He was just being a dumbass, and you lost an old man his job, knowing full well that the qualifications were suspect. If he wasnt qualified, then he would be eventually fired anyway, because ability shows itself, and lack of also does, you didnt need to butt in", "I'm willing to bet he was talking about the recent forgiveness of some student loan debt in the US.", "He was making a point about the student loan forgiveness going back on the tax payers", "Lol. How did Steve fool all those people for years?", "exactly, he was a dumbass for being stupid, but OP full well knew that something was off and decided to publicly expose them for it for no reason other than OP was offended. Like if a comment offends you, you dont need to go scorched earth, just leave it", "Yeah, I suspect the karma fairy will boomerang on back to OP with no problem whatsoever.", "Steve leaned the Z expression FAAFO the hard way.", "Oh you mean the very ones being stopped in the Supreme Court? 🤣😂", "So you should thank yourself for that too.  Because presumably you pay taxes.", "Lol, have you worked with MBAs? Fooling them was the least of Steve's worries.", "While we don’t know specifics about Steve, I think we can assume he’s an over estimated mediocre white man failing purposefully upwards. I’m not at all surprised he got away with it as long as he had.", "I think that's why it doesn't sit well with me. Because I know someone in my office (she no longer works there thank god) that I would want to hurt in a manner like this if I could. I know it sounds mean and awful and that's because it is. It would be embarrassing for her and 97% of all the employees would be happy to see her come down a few pegs (she was a **monster** -- multiple HR reports, but she played the R-card with the DM so she was untouchable). \n\nBut, it would still be like...well if *I* personally thought she was doing something unethical...why didn't I go to HR with my suspicions? You are specfically taught that anything you *think* is unethical, you go to HR and HR handles it from there. OP didn't *have* to say anything to Steve in public if it was just for an ethical reason. But, OP chose to. Steve comes off like he absolutely deserved it. And because if I had chosen to do something like that to the woman at my job, I would think I'm an asshole too. I dunno how to judge this because I am so torn. Does that make sense?", "I have a degree but rarely use skills learned in school. There are occasional times I need to calculate something, but nothing that can’t be googled. In fact, I don’t remember 90% of the formulas and have to look them up anyways. Most of my skills come from working in the industry through college. \n \nEven when doing the math would be appropriate, I usually just overestimate (fancy term is “safety factor”) whats needed.\n \nHonestly some people off the street could do half my job. The other they’d pick up within a year of starting.", "I think it depends on how OP asked it. We're they being malicious and asking in that sickly sweet tone hoping for an outcome like this? Or was it more like built up frustration and along the lines of I'll embarrass him? Only OP can answer it and only OP will really know if they were being vicous when they asked. Honestly OP didn't say much as far as what he has done to make things a nightmare for her so kind of hard to judge if he deserves it or not. I mean technically it was an AH thing to do but it may have been justified. He's also an idiot for lying on his resume and not remembering or keeping up his lie.", "NTA. He deliberately lied to her that job. Not remotely your fault.", "TA.  You took the extra time to snoop about a co-worker and then at the next opportunity you outed him to management.  You try to setup the defense for your actions by generically saying that Steve has \"been a nightmare\" since you started your internship a few years ago, but you really give no description of what being a \"nightmare\" is aside from a snarky comment he made.  Now, if you said he sexually harassed you, picked a fight in the parking lot, or something else crazy, I could understand, but you basically admit to just not liking the guy."]}