{"id": 19340, "submission_id": "144rcug", "title": "AITA for being “difficult” on my birthday?", "selftext": "Background in our family on your birthday you get your activity of choice and meal of choice, and of course gifts.\n\nI have been married for 15 years in that time I have received a gift on maybe 50% of my birthdays and never received a gift I have asked for. It’s always been something random. I have never gotten to do the activity of my choosing (usually going fishing) and I never get my meal do choice, SO doesn’t know how to cook it.\n\nSo now my standard answer when asked what do I want for a gift, meal, activity is always I don’t care or it doesn’t matter because really it doesn’t since it won’t be what I want anyway.\n\nThis year I was told I was being an asshole for being difficult so I explained why I answered the way I do and now I was told I am a bigger asshole for being ungrateful. So AITA here for thinking since my wishes wouldn’t be honored on my birthday that I shouldn’t even state them?\n\nEdit:\nInfo- for clarification on the activity I usually don’t get to do my chosen activity because something else is planned. It isn’t expected that everyone attends just that you are allowed to do it. For example last year SO wanted to visit a spa get a massage etc. that’s expensive for 2 people so I just facilitated them being able to do that. \n\nFor the meal it isn’t expected that anyone cooks take out, going out that’s all in the realm of normal it’s just the person who is the birthday gets to pick.", "created_utc": 1686273821, "permalink": "/r/AmItheAsshole/comments/144rcug/aita_for_being_difficult_on_my_birthday/", "score": 53, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I vaguely answered questions on regarding my birthday.  People might have wanted to know the answers and I didn’t give them.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Why the hell would you put up with this.  You just say ‘I’m going to hike/fish/shop/drive to so-n-so destination, then I’m going to eat at Italian/Mexican/steakhouse restaurant.  Care to join me?  Seriously, stop letting them hurt you like this.  NTA.", "INFO:  Is this a case of you arranging your SO's activity, meal, and gifts of choice and your SO not reciprocating and also accusing you of being ungrateful for giving up?", "INFO: what is the obstacle to going fishing on your birthday?  Is there something preventing you from going?\n\nAlso, what are you asking for on the meal?  If you’re asking your spouse for something they simply do not know how to make, is it okay if they order it from somewhere?", "**INFO** if this is “how it is in your family”, how come it hasn’t been like that for you for 15 years? You describe it as if that’s the case but it clearly isn’t, so what’s the real situation? You do it got others but nobody does it for you? Who else does it for others and not for you?\n\nThe way it’s described right now leaves me confused as to who’s delivering and who’s slacking.", "NTA I suggest you go celebrate with yourself as your wife does not care about your birthday.", "NTA I can imagine how frustrating that is.\n\nThis year for your birthday do your own thing…. Buy yourself the gift you want AND book your own activity and meal - you can of course invite others but let them know that YOU booked it, its what YOU want to do and ITS NOT UP FOR NEGOTIATION.\n\nYou could also keep everything on the down low and let you SO know what you want and if they don’t come up with the “good” say thanks but no thanks I have other plans…. This will of course lead to a major argument potentially but I think that has been brewing for sometime anyway.\n\nGood luck and happy birthday (for whenever it is)", "NTA. It’s ridiculous that you don’t get to share in the tradition. What was the response when you gave very specific examples? I’m not big into fishing, but I would absolutely go with someone if that was their wish, and I would have a fun time, if only because I knew I was making that person happy!", "How old are you?? There's either something wrong in your communication or your expectation. \n\nIf you know SO can't cook your top choice for dinner, why not just go to #2 or ask to eat out as your present/dinner. I don't understand why you're acting like a child. \n\nFishing is a pretty mundane and quiet activity. Do you have kids that would make it difficult? If your birthday falls on a work day/school day for your family, it's unreasonable to expect it as a birthday activity. \n\nI feel like you're leaving things out so you can complain freely. But there's definitely something else going on here.", "Reading this made me so sad for you🥲 There are people out there who will treat you right. You don’t need to settle for someone who doesn’t really care or put effort in.", "So it's not a tradition, really now, is it?", "Info: what do the other members of your family get to do on their birthdays? Doesn't seem like a tradition since it hasn't been the case for 15 years.", "OP a number of people on here are saying YTA because you've determined you're not worth it compared to your SO by allowing them to take precedence over your needs.  You really need to take a long hard look to see if you want to continue this for another 15 years or you want to finally start putting your wants and needs first because you're worth it and quit complaining about your what your SO wants instead.  No one is ever going to look after your needs more than you are.", "NTA it is reasonable to want to eat a special meal and go fishing on your birthday, and to want to be treated like the rest of your family members. The Y T A comments are probably the anti-birthday crowd, since for some reason a lot of Redditors seem to think it's sooooo selfish to celebrate yourself once a year.", "ESH. You will solve no problems by refusing to be part of the solution.", "ESH this sounds like something that should’ve been addressed years ago. Sounds like everyone needs to communicate better", "NTA. the same ppl who never get it right are now the ppl made that you dont even want to do a celebration? its supposed to be YOUR day and they don't act like it is, how else are you supposed to react 🙄", "Wow, some people on this thread have obviously become accustomed to being treated poorly and accepting it.\n\nIn my family we celebrate much as you described. I go all out for them, and they go all out for me in return. We don't do this because of entitlement or expectations, we do this because it's awesome having a day to celebrate someone that you love.\n\nIf you're doing your part for them and they aren't reciprocating then no, you're definitely NTA here.\n\nPS: seriously how hard is it to pull up YouTube and learn to cook something your spouse loves? Even if you screw it up royally, at least you gave them the consideration they deserve.", "NTA — but it doesn’t sound like your SO deserves you.", "YTA\n\n>Background in our family on your birthday you get your activity of choice and meal of choice, and of course gifts.\n\nIn your family? What imaginary family is this? For the last 15 years this has not been true for you in your family. Fix it, on your birthday buy the gift you want via proxy and plan your activity and meal of choice. Bring your family along for the ride. If this is the rule, make it the rule.", "YTA. You're being butthurt and immature. Is there a reason your SO might not want to do your activity? You said they can't cook your meal so what do you want? Yes it's your birthday and your wishes should be taken into account, but not at the expense of any to the detriment of other people.  \n\nINFO: what do you do for your SO birthday? Do you enthusiastically do an activity of their choosing, make the exact meal they have requested and shower them in gifts?", "I’m going to say YTA purely because I think adults who get upset about their birthdays are ridiculous. You are literally turning a year older, so grow up and go do whatever the hell you want.", "YTA. It's not 100% about you on your birthday. There are people who love you and want to celebrate with you and your wife might hate fishing, and arguably you can go fishing any other time of the year. Also don't complain about receiving not great or sucky gifts if you're just pouting and saying, \"I don't care.\" Clearly you do. Or maybe you don't get gifts sometimes because you're clearly unhappy with what you do get and she's given up on trying some years. You're a grown a** man and it's past time to learn to communicate over being passive-aggressive and learn to compromise with your wife.", "YTA\n\nIt's called growing up. Just play along with the charade. The days of being treated like a princess just because it's your birthday has long since faded away.\n\nAt this point, find your own happiness and don't push your depression onto others because this is such a non issue.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nBackground in our family on your birthday you get your activity of choice and meal of choice, and of course gifts.\n\nI have been married for 15 years in that time I have received a gift on maybe 50% of my birthdays and never received a gift I have asked for. It’s always been something random. I have never gotten to do the activity of my choosing (usually going fishing) and I never get my meal do choice, SO doesn’t know how to cook it.\n\nSo now my standard answer when asked what do I want for a gift, meal, activity is always I don’t care or it doesn’t matter because really it doesn’t since it won’t be what I want anyway.\n\nThis year I was told I was being an asshole for being difficult so I explained why I answered the way I do and now I was told I am a bigger asshole for being ungrateful. So AITA here for thinking since my wishes wouldn’t be honored on my birthday that I shouldn’t even state them?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Oh honey, NTA. My family has a similar rule with birthdays—you get to do whatever you want—but I like the way you phrase it. \n\nNow that I’m married, my spouse doesn’t *love* birthdays but always makes a point to get a card/present for me. I don’t like cake, but I make sure that he gets the sweet he wants!  That’s part of a relationship, a meal/activity is implied and it’s always up to the person.\n\nMy birthday was recent. This year we couldn’t do the activity because I’d just gotten out of the hospital but we have it on hold for a future day. We still made a point to have a little celebration at home and it was wonderful. My partner’s is upcoming and I didn’t do the best for it last year, so this year I’m trying to plan a bit better. \n\nI hope things get better. \nEdit: For me, birthday activities are usually group activities, but sometimes that isn’t the case! Everyone should be allowed to chill if they want a break.", "NTA. Your spouse isn't putting in the work for your birthday. The fact that she's planning things she wants to do during your birthday makes it all the more clear that she  doesn't care.\n\nAs usual, people will blame you here for being upset at your spouse.", "Yes that is the case.", "This. OP added that they don't usually get to do their activity because other things are usually planned. Sounds like OP waits to communicate until it's too late, which is probably the case with gifts as well. As for meal, OP keeps omitting what their meal choice is which leads me to believe it's incredibly specific.", "Why is it immature to ask to be treated the same as everyone else in the family? Why shouldn’t OP also get to choose and activity and a meal? Family isn’t unilateral.", "So by your logic should OP start ignoring their spouses wishes on their birthday?  Or other family members?  If the family has a set way for how they handle birthdays it isn’t ridiculous to ask they get the same treatment as everyone else.", "OP seems to be a dude. I'm guessing you thought OP wasn't because of your princess comment?", "You sound like a pretty miserable person.", "And why aren’t you deciding what to do on your own day instead of being disappointed every single year? At this point after so long you know nothing good that you want to happen/eat will materialize. I would suggest just announce what you’ve decided to do and those who care enough to join can do so, if not then you go and do your own thing AND BE HAPPY ON YOUR BIRTHDAY.", "So here's the thing:  You called shit shit when you smelled it.  You returned 15 years of disrespect with one sentence of angry protest.  NTA.\n\nBut don't try to argue this better with your SO.  Instead, go to somebody outside the relationship (not Reddit!) and talk about it.  Keep a journal and read it often.  Get some perspective from other people and from laying it all out for yourself.  If your SO is just dumb about parties and gifts and this is not part of a larger pattern, there's one course ahead of you.  If this is just That One Fucking Thing among Many Fucking Things that finally eroded a hole through your armor of hope, there's another.", "If the activity doesn't have to mean something for the whole family then I don't understand how this grown adult can't just tell SO/kids that he's gonna go fishing for his birthday in advance. \n\nFor the meal as well, he probably does want something incredibly specific like a childhood dish or \"something his mom makes\" and obviously anything SO makes won't live up to that. Again, I don't understand why he can't just choose something he can be satisfied with instead of insisting on one specific thing every year.", "It depends on whether OP’s requests are reasonable.", "The way the post is written makes it sound as though these were the birthday traditions they had growing up, not ones they have started with their SO. Maybe this is the wrong assumption, but if I'm correct, OP needs to grow up and have a conversation with their partner over what they want their birthday traditions to be going forward together, not get whiny that their partner isn't giving them the birthday they got as a child.", "Sure. Call him a prince, whatever. The sentiment remains the same", "Also, if that's his chosen activity and \"no one else is required to participate\", how do they coordinate a solo fishing date for an adult man? Do they have to call his boss and get the day off for him? Pack him his mom's home-cooked meal to take with?", "Well sure, but how is asking to go fishing unreasonable? And other than choosing a dinner that someone literally can’t eat, even if it is not a favorite of others, suck it up! It’s literally one day a year to show someone how much you appreciate them. Good families do this for each other.", "That was my first impression too.", "Then what is stopping OP from putting fishing into the calendar for their birthday six months in advance to make sure nothing is booked over it? OP seems very passive-aggressive.", "My husband has food allergies that prevent him from eating lasagna, but he still makes it for me a couple of times a year (usually with extras to freeze that I can heat up later) because he knows it's my favorite and he loves me. This isn't even usually for a special occasion, but just because he wants to do something special.\n\nAt the same time, I've learned to make/modify about a dozen meals that are allergy safe for him that I didn't do before we got together.\n\nI know I'm extremely lucky and not everyone has a relationship like this, but I can't imagine being married to someone for 15 years and not trying to figure out how to make their favorite foods."]}