{"id": 19407, "submission_id": "145hwsq", "title": "AITA for doing an about-face on selling my house and moving 1000 km away for my BF?", "selftext": "I am going to try to be as succinct as possible while still giving enough information. \n\n\r  \nI (47F), a widow of 2.5 years, my BF of 1.5 years, Mr. A, (M50). We have been “living together”, but really in name only. We share an address. He was working in a northern camp for really good money, but we both wanted him to come home so we could actually grow our relationship. Fast forward a few months, I found a position in our city for him – not his dream job, but in his line of work, with decent pay. \n\n\r  \nThe same week he came home to start the new job, I ended up in the hospital with double super-imposed pneumonia for nearly two weeks. I was incredibly sick; septic, fevered, hallucinating, etc. During my stay in the hospital, he got another job offer that pretty much was his dream job (and it turned out he really hated the job that he had just started)– but it was located over 1000 km away. I wasn’t really up to trying to figure out what that would mean for us, but I had no choice, as they needed an answer ASAP. So, he took the job, moved there, and plans were put in place that I would sell my house and follow sometime this summer. He was gone and working at the Dream Job less than a week after I got out of the hospital. \n\n\r  \nIt's been three months now with him working there and me being here(with a couple of visits in between). I contacted a realtor, had some home repairs done, planned to list the house. But. As it gets closer and closer, I have been feeling miserable and sick about things. I have an incredibly great job where I’ve been for 6 years. Great pay, great people, all around fantastic. I can afford my house, I can afford my lifestyle, and for the first time in my life, I feel safe, secure, and most importantly, independent. \n\n\r  \nThere’s no guarantee of a job for me there, so I would be dependent on Mr. A. Selling my house here is the only way we could buy a house there – but Real Estate is very different there. The price of my nice little middle class house here would buy us a tiny “handyman’s special” there. In addition, it’s a small community, job opportunities aren’t plentiful. \n\n\r  \nI find I just cannot turn my back on the stability and security I have here at home. AITA for saying that yes, I’ll sell the house and move my life across the province – and then completely changing my mind?\n\nEDIT\nReddit, you are amazing. I came here expecting a severe judgment. \"Maybe NTA for your decision, but YTA for saying you would, and now you won't.\" \n\nThat's honestly what I expected. Instead, I feel like Reddit has put its arm around me and told me it's okay.  I absolutely cannot tell all of you how much this has meant to me. I wish I could reply to every single comment. \n\nThere have been other red flag which I have been ignoring, but am rethinking now. I've paid off his debts, to the tune of roughly 14K. He left before I was well enough to go back to work. He has no assets; basically a suitcase and a car (and his Marvel collectibles). I can't trust him with my dogs - he's not mean to them, but has no idea how to care for them. They were kennelled during most of my hospital stay, and  they came home two days before I did. But when I got home, their water bowl was completely dry  \n\nI got into this relationship too soon after my husband died. I know that now. I am naive. I know that too. Now I just need to figure out how to get out. \n\nThank you, Reddit. You have a reputation for being very judgmental, but you have made me think long and hard about everything, and I think that is going to make all the difference", "created_utc": 1686347371, "permalink": "/r/AmItheAsshole/comments/145hwsq/aita_for_doing_an_aboutface_on_selling_my_house/", "score": 260, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the asshole for saying I would uproot my life for my boyfriend but then changing my mind completely.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\n\nIt is okay to chose you. You are happy where you are. I'm really normally not on the \"break up wth him\" wac\nVe of reddit but... consider it.", "NTA\n\nIt's OK to change your mind.  He did what was best for him rather than staying to be near you.  You have every right to stay to do what's right for you rather than moving to be near him.   \n\nNot every relationship ends in cohabitation or marriage.  Maybe you'll make it work with the distance, or maybe it's just time to admit you've both found your place 1000km apart and you're moving in different directions.", "NTA. Security and stability are valuable. Trust your gut and keep your nice home and job.", "NTA\n\nHe made a life-changing decision while you were *hospitalized.* He didn't get that job 48hrs after he applied. \n\nKeep your house. True Love^tm just isn't worth it most of the time.", "NTA. You were in no state to make that sort of decision at the time. \n\nAlso, hope you're feeling much better", "NTA.  What would happen if you sold your house, moved to be with him, he broke up with you (or took yet another job somewhere else), and then left you there all by yourself?  He did not consult you when he took this job, does that not indicate something to you?  There are other fish in the sea.", "NAH, you need to make the best decision for you life.", "NAH.  A year and a half is a decent amount of time but it’s really not that much. Sometimes people have to make hard choices. And I think a big part of mental health is fulfillment in one’s work. And he would probably wind up making a shitty boyfriend if he was in a job he hated, especially if he turned down his dream job in order to be with you. \n\nOn your end, you have a lot of things going for you that might not work out if you move to be near him. You might end up resenting him for the same reasons.", "NTA. If this is causing you this much misery it isn't the right thing. Trust your gut.  It's speaking.", "NTA you had to make the call while in the hospital you can hardly think straight in there. You have the right to change your mind. You have the freedom to choose security or a risky move.", "NTA- you still don't really know him either.  If in doubt, then don't.  And what happens if you buy a house, his name is on the paperwork too and things go south because you find you can't live together.", "NTA\nit’s a major decision that you agreed to in less than a week while very ill. he was so quick to move there that my gut tells me he would have gone anyway. you both need to figure out if you can do long distance, or if he can find a dream job closer. \nit’s Okay to choose your happiness over him. you’ll be miserable there if you don’t really want to move there. he can then make his own decision too", "NAH. You are allowed to change your mind. You can continue with this as a long distance relationship and see if that works for you both. But even if it doesn't, you are allowed to pick yourself and the life you have already built.", "NAH your paths have just diverged.", "NTA\n\n&#x200B;\n\nDon't sell your house, don't leave your job.\n\n&#x200B;\n\nYOu already KNOW you don't want to do it, trust your gut. And: It would be a huge thing if you had any indication the relationship would be great - but you did not even live togehter, so how would you know?\n\n&#x200B;\n\n&#x200B;\n\nTrust your gut. Don't sell, don't quit, don't go.", "NTA, total red flags. He wants to move you away from family, friends, job and a sole ownership home.  The first step in an abusive relationship is isolation.  The second is dependency on the other person.  Another red flag is he had a job but left you sick and in the hospital for his \"dream job\".  Please keep this as a long-distance relationship.  See what his reaction is.  When he moved to be with you there was a plan in place, both had jobs, nice house. He wants you to move where there is no owned home (you would be buying), you have no job, no family or friends.  stay safe.", "NTA. Do not compromise your independence for anyone. This relationship is too new for you to jump in with both feet.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI am going to try to be as succinct as possible while still giving enough information. \n\n\r  \nI (47F), a widow of 2.5 years, my BF of 1.5 years, Mr. A, (M50). We have been “living together”, but really in name only. We share an address. He was working in a northern camp for really good money, but we both wanted him to come home so we could actually grow our relationship. Fast forward a few months, I found a position in our city for him – not his dream job, but in his line of work, with decent pay. \n\n\r  \nThe same week he came home to start the new job, I ended up in the hospital with double super-imposed pneumonia for nearly two weeks. I was incredibly sick; septic, fevered, hallucinating, etc. During my stay in the hospital, he got another job offer that pretty much was his dream job (and it turned out he really hated the job that he had just started)– but it was located over 1000 km away. I wasn’t really up to trying to figure out what that would mean for us, but I had no choice, as they needed an answer ASAP. So, he took the job, moved there, and plans were put in place that I would sell my house and follow sometime this summer. He was gone and working at the Dream Job less than a week after I got out of the hospital. \n\n\r  \nIt's been three months now with him working there and me being here(with a couple of visits in between). I contacted a realtor, had some home repairs done, planned to list the house. But. As it gets closer and closer, I have been feeling miserable and sick about things. I have an incredibly great job where I’ve been for 6 years. Great pay, great people, all around fantastic. I can afford my house, I can afford my lifestyle, and for the first time in my life, I feel safe, secure, and most importantly, independent. \n\n\r  \nThere’s no guarantee of a job for me there, so I would be dependent on Mr. A. Selling my house here is the only way we could buy a house there – but Real Estate is very different there. The price of my nice little middle class house here would buy us a tiny “handyman’s special” there. In addition, it’s a small community, job opportunities aren’t plentiful. \n\n\r  \nI find I just cannot turn my back on the stability and security I have here at home. AITA for saying that yes, I’ll sell the house and move my life across the province – and then completely changing my mind?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "If he's just going to work away in camps, he can do it from your haouse as readily as from the other city.", "NTA.  It's your life, you have to do what you feel is best for you.  Feeling safe and stable is awesome, I wouldn't want to give it up either.", "**NTA** \\- I think the BF was going to take the job whether you came along or not.", "**NTA** \\- I think BF was going to take the job whether you came along or not.", "NTA. Listen to your gut, it’s telling you this move isn’t a good one.", "You're not an asshole for making a *sensible* choice. Uprooting your life when you haven't known each other for that long (and haven't actually spent a lot of time together) is risky. You have your independence, your security and you enjoy your lifestyle, your job, your house... that's a lot to gamble with.", "NTA\n\nThat’s kind of what he did. You two agreed he’d move to where you were with a job you found for him. But while you were in the hospital he completely changed the plan without talking to you. He did what was best and most comfortable for him. You can do what’s best and most comfortable for you. He should’ve never made a plan that involved your money without talking to you first. Keep your house, keep your job, find someone who’s compatible for you.", "NTA- Major life decisions are best made after you “sleep on it”. Rather, you take time and give it real thought. The fact that you feel so at home and comfortable where you are at and that is what you are truly looking for says to me that it’s probably time to break up. You both want different things. No one is an AH. You have a right to change your mind.", "NTA at all you do you lady cuz he had no problem doing him as soon as he could while you were ill in the hospital no less.", "Nta\n\nConsider what happens if he gets an even better job offer, next year. Or even 2 or 3 years in the future. Would you be happy to move again? \n\nWhat if you move there, but also either do not get an appropriate offer, or get one further away? \n\nIn either case, you would need to move again. Would you be comfortable with that?", "NTA. He left for his dream job without a second thought.  You are living your dream life right now. Don't give up your dream for his.", "NAH.\n\nYou agreed while not of sound mind and body. You shouldn't been obligated to follow through now that you've had time to recuperate and think clearly.\n\nHe won't see it this way but, IMO, he chose his dream job over a relationship with you. You've been in a long distance relationship for a year and a half. Asking you to sell your house and leave a job you love for a relationship that is just getting started with a man who just started a new job is entirely unreasonable.", "Not ah at all. Women are constantly putting men before themselves, and it isn't fair. It's not fair to expect you to give all you have up to move and support HIS dream job. Be happy in your life and live in your dream home and job. NTA", "NTA. Why would you sell your house so that you can buy a house “together”? At that point , your money becomes his via the house. BF chose what’s best for him. If you were only looking for work over there , you can think about it. Selling your house is a no-no for now.", "NAH.  Bf isn’t an AH for taking his dream job.", "Having recently been hospitalized for pneumonia...even upon release, my brain was not in any shape to make major life decisions for at least a month.  Stay where you are.", "True love meets in the middle. I really believe that if it's meant to work out both sides will find a path. This doesn't sound like it. He chose him without consulting OP, as you pointed out while she was in hospital.  She should do the same and choose herself.", "They just want to follow different paths right now. And that’s ok.", "NTA. You are allowed to change your mind. It's okay to be single and happy and concentrate on YOU.", "NTA. Do what is best for you. You owe nobody.", "You were in the hospital sick with double super-imposed pneumonia when this was said, he can't hold you to it. Also he left only a week after you were released ? That doesn't seem like a life partner. \n\n He was also looking for jobs before he moved, it's hard to get a Jon in this economy. There's no way he got one within a week. \n\nNTA", "NTA You shouldn’t move that far for anyone unless you are 10000% sure you want to. You would be giving up a lot for a man that took a job 1000 km away while you were gravely ill.", "NTA. If he was unwilling to make that sacrifice for you when he had a job and your house to live in, why would you do it for him without those things?", "Stay in Calgary, let him go. We have over a million people here, there will be someone better suited to you when the time is right. \n\nNTA", "One thing that stood out was that you said that you two would not be able to afford a house unless you sold yours.  It sounds like you are saying the new house would be both your names.  So you are going to exchange your own equity for a joint equity.  Not a good plan since you don't seem to want to make the move.  It will turn out badly if you are already having doubts.", "NTA. Don't do it. Stay at your job and have long distance.", "NTA. Listen to your gut - you don’t want to go.", "NTA\n\nI think there needs to be a greater level of relationship commitment than “bf” of 18 months. It also sounds like you were left to recover alone? Did you have adequate aftercare? How are your financial interests being protected if you sell and buy in a more expensive market? With the way 2020 changed the housing market, could you even afford to return if things don’t work out with Mr. A?  This change seems like it needs more planning that hasn’t been done than jumping in with both feet first", "NTA.\n\nIts a step that once taken you can't rewind.\n\nSigned: someone who sold her house to buy with a partner in a different place and now totally regrets it. I made a dumb move both financially and emotionally.", "NTA. He made the best choice for him. You are allowed to make the best choice for you.", "NTA. He chose himself. Didn't even give new situation two weeks before he was gone.\n\nYou can choose yourself as well. You like not having to be depended on someone for your living expenses. And what if it doesn't work out, then what? You are stuck.\n\nMaybe take it as a sign that the universe doesn't want you two together.", "Agreed. It’s a worthy conversation, for both parties. Sometimes a relationship ends not from lack of love, just a fork in the road.", "NTA  \nYou've paid off his debts? You found him a job? He cannot take care of pets? Most likely does not chores or anything.\n\nWhy don't you find someone who is has their shit together? The man is 50.\n\nBy no circumstances sell your house! Even if said you were going there, you need to rent your home. Do you realize you would buy a place in this new city he decided to move to, but he'd be living free of charge in your new home?", "NTA. \n\nHe’s not the only one who gets to follow his dreams. By sound of it, you really like the life you’ve created for yourself, and that’s fantastic. \n\nYou haven’t mentioned any emotional response from your BF, so I’m hoping it’s been nothing but understanding. However, if he’s annoyed that you won’t leave, that not selling the house is unfair, that you’re ruining his chance at a dream life etc…please view it as the red flag it is. \n\nYou can have a long distance relationship. You can wait to move until there’s a steady job that you’ll like. You can wait to make sure *he* likes this dream job of his. There are so many options.  Please choose what’s best for *you*.", "Reddit, you are amazing. I came here expecting a severe judgment. \"Maybe NTA for your decision, but YTA for saying you would, and now you won't.\" \n\nThat's honestly what I expected. Instead, I feel like Reddit has put its arm around me and told me it's okay.  I absolutely cannot tell all of you how much this has meant to me. I wish I could reply to every single comment. \n\nThere have been other red flag which I have been ignoring, but am rethinking now. I've paid off his debts, to the tune of roughly 14K. He left before I was well enough to go back to work. He has no assets; basically a suitcase and a car (and his Marvel collectibles). I can't trust him with my dogs - he's not mean to them, but has no idea how to care for them. They were kennelled during most of my hospital stay, and  they came home two days before I did. But when I got home, their water bowl was completely dry  \n\nI got into this relationship too soon after my husband died. I know that now. I am naive. I know that too. Now I just need to figure out how to get out. \n\nThank you, Reddit. You have a reputation for being very judgmental, but you have made me think long and hard about everything, and I think that is going to make all the difference", "NAH.... you need to do what feels right for you. Dont ignore your gut feeling.", "Heed your gut and don't uproot yourself unless it feels right. But that doesn't make him an ahole, so NAH.", "NTA there are a few red flags with your boyfriend, don’t sell your home.", "My own experience with a similar situation is so full of regret for giving up a job I loved and a beautiful apartment that was rent controlled for a man I later ended up divorced from after following him to his dream job, I can't even wrap my head around doing that again.\n\nNot everyone who follows a partner ends up regretting it, I guess. But I do so much that if time travel ever became a thing, I know the exact moment I would return to.\n\nI've spent 30 years wishing I had stayed put and not married that man, and left the things that I'd worked for and loved behind.\n\nThe only person that will be with you your entire life is you. So take care of that person first", "NTA: do what you feel is right for you. You can do an LDR and both of you can be happy you get keep house and community and job and he is happy with his dream job, and if this doesn’t work for him then problem solved.", "NTA, trust your gut! \n\nIn my very early 20’s I quit my job and moved several states away for a boyfriend who I’d been with (long distance) for over a year. It was one of the worst experiences of my entire life. It’s so difficult to make a big move under the best circumstances, but when it’s for a relationship, and to a place where your person has a job and a community and you don’t it’s even worse. If I could go back in time the first thing I would do is change that decision. It’s exhausting and isolating, and it sets your life up so that everything is dependent on your partner. \n\nYou’re always allowed to change your mind, and to be a bit brutal (and I’m sorry for saying this) but if this man was willing to not only move away from the life you had both agreed upon after such a brief time, and also willing to leave you when you’re that ill, is he even partner material? If you had to be super honest with yourself, what is it that he’s adding to your life that makes it in any way better? \n\nSometimes a big change is a great choice, but is this relationship worth unmooring your entire life for? And also, if he was only willing to try living with you for what seems like a couple of weeks before totally changing the game, why give up the life and home you’ve built for him?", "NTA. You should always choose your happiness and if your SO is not a part of it then so be it.", "Nta. The fact he would leave before you are back on your feet is beyond telling. Then you mention that you need to sell your house to buy a shack. What is he contributing? He should be paying at least half.  That he pressured you for an answer before you were well enough to even deal with it shows he is not capable of putting anyone above what he wants. There are so many red flags its scary. Don't uproot your life. Esp if you arent 1000% sure. I couldn't imagine losing my husband & having to start over. Its a whole new world. But you can do so much better. This guy sounds like he is taking you for what he can get.", "Not in Calgary, but yes, in Alberta! My city is quite a bit smaller LOL", "No, he doesn't do chores around the house. I'm finally beginning to wake up. My family is hugely relieved that I'm not moving now. I was stupid, lonely, maybe vulnerable after my husband’s passing. I got the life insurance, and I guess thought I should help the new man in my life. I feel like I am absolute idiot", "I'm a GODDAMNED MENSA MEMBER. What the HELL is wrong with me??", "I'm at my wit's end. I'm a decent person, I get along with everyone, I'm intelligent, and I have my life together. How is it possible that I have been this dumb??", "Agreed! It took me six months to recover all three times.", "Lol I took a shot, knew it would be alberta. My point still stands. You need to make yourself priority #1, because he made himself priority 1 without thinking about you. \n\nNot everyone is meant to be together, even good people. You deserve better than what he gave you. \n\nI wish you rest, peace, and health"]}