{"id": 19431, "submission_id": "145tlp0", "title": "AITA for telling my mom I don't want kids because of her?", "selftext": "I (30f) have always had a difficult relationship with my mom (52), I’m the oldest of 4 sisters. It’s been years and years of therapy on my side to try to have a decent relationship with her but I still sometimes have relapses when it comes to how I react to certain attitudes of her. \nThings improved a lot when I got married and moved overseas two years ago but every now and then we have big arguments because I sometimes still don’t know when to retire from a difficult conversation. \n\nYesterday we were on the phone and, out of nowhere, she told me to hurry up and have babies. I've repeatedly expressed my dislike for her and anyone else making such comments. I've tried to educate her on the privacy of this topic and how intrusive it is to ask (let alone demand) others to have children.\n\nI gave her the first \"warning,\" explaining that I didn't feel comfortable discussing that. Her comeback: procreation is the only purpose of human beings and as a woman I should naturally have maternal instincts.\n\nSecond warning I said I have a different opinion and asked her to respect my boundaries. She then said how happy she is with her four kids and how she has no regrets about motherhood.\n\nThird warning, less calm. I told her that I respect her decisions and would never judge her choices regarding bringing children into the world. However, I have my own decisions to make and asked her to respect my right to decide and stop discussing the topic as it was getting upset.\n\nWell, she then accused me of VIOLATING HER RIGHTS by denying her the opportunity to become a grandmother. That’s what blew me up!\n\nI know I don't owe her no explanations, especially on this topic. But I didn't pause to think before responding and told her that if she truly wanted to know why I didn't want kids, it was because of her and her threats. By this point, I was far from calm.\n\nFor some time now, she has been threatening that when I have kids, she will spoil them, scold them, cover up their wrongdoings, and more. She has argued with me about being close to my MIL, fearing that my children would prefer her over my mom. So, when I said she was the main reason I didn't want kids, it wasn't entirely untrue. \n\nShe started crying, saying that I had hurt her so bad and hung up. Later she texted calling me cruel and immature for blaming her and that I am an ungrateful daughter.\n\nNow, even when I know that I would have the option to raise kids without her around, I really don’t want to go NC because I love her. I'm working on finding healthier ways to communicate with her. But even when I think I should’ve address this differently, rn my biggest fear of having children is the added stress it would bring to our already fragile relationship.\n\nI feel guilty for making her cry and wonder if I should’ve kept this to myself (and my therapist maybe).\n\nSo, AITA?", "created_utc": 1686381979, "permalink": "/r/AmItheAsshole/comments/145tlp0/aita_for_telling_my_mom_i_dont_want_kids_because/", "score": 24, "replies": ["##[AITA for blocking your go-to time killer from June 12-14?](https://redd.it/145o4jz)\n\nWelcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the AH because I could’ve address the situation differently and not in a heated argument. Maybe it was indeed immature of me to blame her when I have plenty other reasons and it is not even a fixed determined decision. \n\nI already apologised for saying that but she has been cold, she usually brush things off and act like nothing happens in less than a day (not that I think it’s healthy and not that I take advantage of that) but it is an unusual attitude that makes me think that I really hurt her.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nYour mom is toxic and you have a lot of patience trying to get along with her.", "Complicated but NTA\nwhen the family is toxic and wont back off, and once you put your boundaries down they try to guild trip you..\n\nBeen dealing with the same bs with my own mother.\n\nPs: am gay, and when i was a kid my mom acted all accepting n shit but now im an adult and she showed her true colors. its the same bs religious nutjob excuse she gives me, “you were born a certain gender and your purpose is to bring a child in this world, you are against god your a sinner” blah blah blah. \n\nI say, live and let live.\nLet her live her delusion, and go live your happy life. \nSure it really fucking sucks. Id love to have a healthy relationship with my own damn mother too. But shit when the family is so toxic they guilt trip you at every chance they get, i dont feel its worth having a relationship when it is so draining.", "NTA\n\n60F, childfree by choice.  I told mother, there's no way in hell I'd ever have a child.  I'm a CSA survivor,  mother knew and the only thing she did about it, was blame me for not fighting harder.  I was 6, her new husband 30.\n\nMother is the # 1 reason for remaining childless.  \n\nWhat if I became like her?  I wasn't willing to take that chance.", "NTA. You established a pretty clear boundary which she violated, and violated, and violated, and it's now wonder you blew up at her. You should still apologize, but NTA.", "NTA. Why maintain a relationship with her? Go NC.", "NTA. You owe no one anything.", "NTA - your mother is trying to manipulate you. You gave her three warnings and she crossed boundaries", "NTA. She already knows all of your feelings about this and continues to press just so that she can be the victim when you snap.\n\n\" I just want the best for you\" is one of the assholes cries. \n\nSide note. Some parents try to force being a parent on their own children because they want them to \"suffer\" like they did. \n\nYou can try and be kind(as you have been) and remember women didn't have birth control and abortion or divorce as an option back then.\n\nI do think a lot of these \"old bitter\" type women trying to press are just a little bit jealous. \n\nI know I could not understand my own mother and her life until I looked up the abortion laws in canada. \n\n4 un wanted  kids before 23, which might make you bitter, which in turn makes you jealous and mean to your own child. \n\nNo excuse,  just something I considered for my thesis.", "NTA- people that don't want kids are doing kids a favor by not having any.", "NTA. She's being manipulative as hell. Keep her at a distance for your own sake.", "NTA. She kept pushing until you gave her an answer. Now that she has one, maybe she will let up. You cannot help that your answer was one that upsets her. she has no one to blame but herself and her selfishness. \n\nAs a stepdad, I just sit back and watch what my stepdaughters do. I am curious and fascinated at where they will go and what priorities they will set. I ask why they chose something from time to time but I leave them to find their own way.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (30f) have always had a difficult relationship with my mom (52), I’m the oldest of 4 sisters. It’s been years and years of therapy on my side to try to have a decent relationship with her but I still sometimes have relapses when it comes to how I react to certain attitudes of her. \nThings improved a lot when I got married and moved overseas two years ago but every now and then we have big arguments because I sometimes still don’t know when to retire from a difficult conversation. \n\nYesterday we were on the phone and, out of nowhere, she told me to hurry up and have babies. I've repeatedly expressed my dislike for her and anyone else making such comments. I've tried to educate her on the privacy of this topic and how intrusive it is to ask (let alone demand) others to have children.\n\nI gave her the first \"warning,\" explaining that I didn't feel comfortable discussing that. Her comeback: procreation is the only purpose of human beings and as a woman I should naturally have maternal instincts.\n\nSecond warning I said I have a different opinion and asked her to respect my boundaries. She then said how happy she is with her four kids and how she has no regrets about motherhood.\n\nThird warning, less calm. I told her that I respect her decisions and would never judge her choices regarding bringing children into the world. However, I have my own decisions to make and asked her to respect my right to decide and stop discussing the topic as it was getting upset.\n\nWell, she then accused me of VIOLATING HER RIGHTS by denying her the opportunity to become a grandmother. That’s what blew me up!\n\nI know I don't owe her no explanations, especially on this topic. But I didn't pause to think before responding and told her that if she truly wanted to know why I didn't want kids, it was because of her and her threats. By this point, I was far from calm.\n\nFor some time now, she has been threatening that when I have kids, she will spoil them, scold them, cover up their wrongdoings, and more. She has argued with me about being close to my MIL, fearing that my children would prefer her over my mom. So, when I said she was the main reason I didn't want kids, it wasn't entirely untrue. \n\nShe started crying, saying that I had hurt her so bad and hung up. Later she texted calling me cruel and immature for blaming her and that I am an ungrateful daughter.\n\nNow, even when I know that I would have the option to raise kids without her around, I really don’t want to go NC because I love her. I'm working on finding healthier ways to communicate with her. But even when I think I should’ve address this differently, rn my biggest fear of having children is the added stress it would bring to our already fragile relationship.\n\nI feel guilty for making her cry and wonder if I should’ve kept this to myself (and my therapist maybe).\n\nSo, AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA\n\nis she also that demanding with your younger sisters?\n\nshe cant force you nor your sisters to get preg,if she's desperate to be a grandma,sucks to be her I guess", "NTA. She basically pressed you and you gave an honest answer. You have multiple opportunities to back away from this issue, but she chose to continue onward. What happened is on her.\n\nShe totally sounds one of those people that would sue you for “grandparent rights.”", "NTA. Your mother won’t change. Please think hard about having such a negative force in your life", "You’re not having kids to spite someone is the only wrong reason not to have them. You could easily have a family away from your mother. \n\nNTA", "As another person who is never having children because of their mother I am biased but NTA, and yours sounds even worse than mine. I suspect there are a lot of us out there but the subject is still so taboo that people only admit it behind closed doors.\n\n\nWe’re the next phase of human evolution! I am so sorry you lost the mother lottery. You deserve an understanding and unconditionally supportive, loving parent, but you just don’t have one.", "[removed]", "This is hard, so ESH? If you really want to try to keep your relationship with your mother, maybe give her a little time to cool down and explain to her that what you meant was you don't want to lose your relationship with her. Don't worry about the other reasons. Focus on that part only. Maybe by basically putting the ball in her court, she also works on your relationship from her end. Or go NC.  Otherwise it'll just be fighting about babies until you crack and give in or go NC. Good luck hon.", "Lol are you lost? What do you think this sub is for?"]}