{"id": 19454, "submission_id": "1461450", "title": "AITA for not letting my mom walk with me at graduation?", "selftext": "My [17m] high school grad ceremony happened last week. A month ago, my friend was telling me how he wants his mom to walk with him at graduation because she never got a chance to graduate herself because she had him and had to immigrate to America, and sacrificed prospects of her education to take care of him and her husband.\n\nOkay, fair enough, I get where that’s coming from. My mom heard about this and started hinting that she would like it if I did the same thing. \n\nI didn’t think that would be suitable because my understanding is this is something for parents that weren’t able to graduate themselves so they can experience it. My mom graduated high school, college, *and* grad school, so I don’t feel it’s applicable.\n\nI asked her why she wanted that to understand where she’s coming from, and she said that she took care of me, helped support me throughout school, etc, so she feels she should be recognized for that, and plus she’s an immigrant like my friend’s mom.\n\nAt the risk of sounding ungrateful, I feel like that’s just what a parent’s supposed to do? To clarify, I *am* grateful, but it’s not above and beyond to the level of sacrificing your own career and education to take care of others. \n\nMy dad thought I should just let her in order to avoid a fight, but I didn’t feel it would be right, so I said no. Since graduation, my mom has been upset at me for not letting her walk with me. The situation is honestly confusing.\n\nAITA?", "created_utc": 1686405844, "permalink": "/r/AmItheAsshole/comments/1461450/aita_for_not_letting_my_mom_walk_with_me_at/", "score": 1151, "replies": ["##[AITA for blocking your go-to time killer from June 12-14?](https://redd.it/145o4jz)\n\nWelcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I refused to let my mom walk with me during graduation, and this might make me TA because she’s upset at me for it.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA.\n\nParents do not typically walk with their kids at their graduations. This isn't their moment. \n\nIn your friend's particular case, I see why he wanted to do this for his mom as she never got a chance to graduate herself. So your mom heard about this and instead of taking it as the sweet gesture that it was, she thought \"oh here's an opportunity to make this about me\". Just no. Parents are supposed to let their kid have this moment for themselves, and to look on with pride.\n\nAnd yeah, supporting you is kind of her job as your parent.", "NTA. It’s so awkward when people give gifts (both material and of service) and attach themselves to some self-defined return of gratitude they feel they should get. It sours the gift and reveals much about their (underdeveloped) character.", "NTA. If she’s experienced it already, then what’s the point?", "NTA. By wanting to do this, your mother is trying to take your moment and make it about her - she is being selfish. As far as her taking care of you and supporting you throughout school - *that is her job as your parent*! That is the obligation she took on when she decided to have a child.\n\nShe needs to put her ego in check and let you have your moment.", "NTA this was your day. Your graduation. You put the hard work and effort in. It’s nice of your friend to have allowed it but that doesn’t mean you have to. I’m honestly surprised a school even allowed this. I’ve seen it with parents carrying their babies and that makes sense. It’s another obstacle the student faced and overcame but a parent shouldn’t try to take the spotlight from their kid on their day.", "NTA\n\nYour mom is allowed to ask.\n\nYou are allowed to say, \"no.\"\n\nYour mom should respect you enough to let it go. She's allowed to be upset, but if she keeps on making it an issue and being dramatic about being hurt, she's an AH\n\nAlso, life lesson. Never do something to keep the peace of avoid a fight if it contracts your values. Have the fight, preferably in a calm, well-reasoned manner, but don't avoid it. Best to hast things out sooner than later.\n\nThis is a case where one of the two of you would likely end up resenting the other. Guess what? The person making the unreasonable request should lose in that situation.", "Your mother is trying to live vicariously through her child. This is YOUR moment. Take it as a red flag for future moments of importance in your life. She sounds like the type of mother that would wear a white wedding dress to your wedding.\n\nNTA", "NTA your mom doesn't have to have her fingers in your graduation.", "NTA\n\nGraduation is a day about you and it is your decision whether you want to share it with someone else. Ur friend made a decision to share it but you have the decision to keep it for yourself. It would be selfish of her to be upset if you don’t want her to walk with you", "NTA. It isn't the parent's graduation day, it's yours, and you are free to do whatever u want. But at the same time, i understand why she's upset, she did raise u, supported u and took care of u, maybe she just wants some recognition, u should let her down gently by explaining that to her", "NTA. Your mom sounds INCREDIBLY self-centered. She's pouting because you didn't make your accomplishment all about her? Ridiculous, and NOT normal behavior for a supposed \"adult\".", "NAH. You're just not feeling it enough to make it part of your tradition.\n\n>At the risk of sounding ungrateful, I feel like that’s just what a parent’s supposed to do?\n\nWell, and that's true. As someone who has a difficult job (not parenting), I will say that answering the call of duty can perhaps become routine. But that doesn't make it easy. I've read that effective parenting requires a lot of mental discipline to do the right thing in the face of beyond the pale frustrating days.\n\nI believe your mother wants to take an opportunity to get recognition for that. Truthfully you should give it to her. But I fundamentally think you have to do it in a way that feels natural to you.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy [17m] high school grad ceremony happened last week. A month ago, my friend was telling me how he wants his mom to walk with him at graduation because she never got a chance to graduate herself because she had him and had to immigrate to America, and sacrificed prospects of her education to take care of him and her husband.\n\nOkay, fair enough, I get where that’s coming from. My mom heard about this and started hinting that she would like it if I did the same thing. \n\nI didn’t think that would be suitable because my understanding is this is something for parents that weren’t able to graduate themselves so they can experience it. My mom graduated high school, college, *and* grad school, so I don’t feel it’s applicable.\n\nI asked her why she wanted that to understand where she’s coming from, and she said that she took care of me, helped support me throughout school, etc, so she feels she should be recognized for that, and plus she’s an immigrant like my friend’s mom.\n\nAt the risk of sounding ungrateful, I feel like that’s just what a parent’s supposed to do? To clarify, I *am* grateful, but it’s not above and beyond to the level of sacrificing your own career and education to take care of others. \n\nMy dad thought I should just let her in order to avoid a fight, but I didn’t feel it would be right, so I said no. Since graduation, my mom has been upset at me for not letting her walk with me. The situation is honestly confusing.\n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA \nI get the sweet gesture of letting a parent walk with their child on graduation.\nThis is your achievement! And she needs to be in the crowd cheering you !", "NTA. I'm a mom with a kid graduating this year. I had my own graduations years ago. This one is his.\n\nI agree with you- providing for my kids and supporting them through school and life as they learn and grow into independent people is just part of the job of parenting. Another part of parenting is letting go of control as our kids grow up.... like letting them have stage alone when they reach a big milestone. \n\nI hope your mother gets over her disappointment and appreciates that she raised a son prepared to advocate for himself rather than giving up the recognition he deserves. That's something to be proud of.", "This is weird and not a thing. \nNTA.", "NTA. \n\nMy daughter just graduated from a rather prestigious college. The old saying is ‘it takes a village’ is true. She would probably not have achieved what she did without her family around her supporting her morally and financially through 16 years of school.\n\nHaving said that, she did the work to get there. We (the family) went to two graduation ceremonies and a party for her. It was her weekend. None of us even considered upstaging her by trying to walk with her. It just doesn’t make sense to me.\n\nHaving said THAT, I can 100% understand your friend’s situation with their mom. It’s outside of my personal experience, but is a really sweet gesture to a mom that went above and beyond what many are willing or able to do.", "Holy cow. I see your mother wants to be the center of attention. She is a mother. Taking care of you is her actual job along with dad. A thank you and love ya should suffice. The walk is for those that ARE graduating. Mothers Day is her day. Tell her to sit down and cheer like every other non “look at me” parent. Having to “keep the peace” for an adult woman is insane. And shows your mothers maturity level. NA. I am a parent and I would rather build my child up instead of trying to steal the spotlight of hard work and glory.", "Holy cow. I see your mother wants to be the center of attention. She is a mother. Taking care of you is her actual job along with dad. A thank you and love ya should suffice. The walk is for those that ARE graduating. Mothers Day is her day. Tell her to sit down and cheer like every other non “look at me” parent. Having to “keep the peace” for an adult woman is insane. And shows your mothers maturity level. NA. I am a parent and I would rather build my child up instead of trying to steal the spotlight of hard work and glory.", "NTA. She did what parents are supposed to do for their children. Your mom needs to get over herself and your dad needs grow tf up and have a discussion with his wife about how she is being selfish.\n\nI’m also surprised your school even allows this.", "Exactly", "I’m not sure if graduation ceremonies in her home country include walking on stage, but yeah, she’s graduated not once or even twice but three times so I don’t see the need for the gesture", "> Also, life lesson. Never do something to keep the peace of avoid a fight if it contracts your values. Have the fight, preferably in a calm, well-reasoned manner, but don't avoid it. Best to hast things out sooner than later.\n\nThank you for the advice", "but isnt that what mothers day is for?", "I graduate in EU where most countries don’t have ceremonies at all. It’s pretty much minimum to graduate high school. Your final grade of ‘maturity exham’ will be put on a public bulletin your diploma shipped. And thank you very much. Nobody expect anything at all. We celebrate only university graduations. We also have no proms doesn’t mean I expect my children to invite me to prom…\nThat said. Just cause we didn’t have it doesn’t mean she has to have her moment. It’s yours. NTA.", "If she graduate in EU most countries don’t have ceremonies at all. It’s pretty much minimum to graduate high school. Your final grade of ‘maturity exham’ will be put on a public bulletin your diploma shipped. And thank you very much. Nobody expect anything at all. We celebrate only university graduations. We also have no proms doesn’t mean I expect my children to invite me to prom…\nThat said. Just cause we didn’t have it doesn’t mean she has to have her moment. It’s yours. NTA.", "If she never got the chance to walk the stage then I can understand she’s missing the experience. But at the same time, she’s a grad 3x over which is more than most immigrant mothers.", "Mother's Days are a dime a dozen. There is only one graduation day.", "Fair enough. I will say having multiple degrees isn’t uncommon for Asian immigrants though, at least from what I’ve seen.", "Compared to your friends mother, she’s definitely achieved more though. Like we’re not knocking her success but her wish to walk the stage is vastly different to other mothers who never even got a proper education.", "Yeah, that’s how I saw it as well. Sure, my mom had struggles as well moving to a new country, but moving as a upper middle class white collar professional in your 20s who speaks fluent english isn’t the same as moving without a job, not knowing english, and being in your teens, and treating it as the same isn’t the best", ">At the risk of sounding ungrateful, I feel like that’s just what a parent’s supposed to do?\n\nBecause it is. Your mothers looking for handout kudos and to absorb someone else's recognition. It's akin to claiming your victory as hers. The other parent is being walked because she never got that experience and actually made sacrifices, but your mother sounds like short of moving countries her life has been smooth sailing since she also got grad school in there.\n\nHonestly, I wouldn't be surprised if she's a wear white at my sons wedding kind of mom.\n\nNTA", "\n\n>she said that she took care of me, helped support me throughout school, etc, so she feels she should be recognized for that, and plus she’s an immigrant like my friend’s mom.\n>>At the risk of sounding ungrateful, I feel like that’s just what a parent’s supposed to do?\n\nyou're not ungrateful, that *is* what parents are supposed to do, and your graduation is *not* about her. NTA. her request is bizarre and her reasons ridiculous", "She raised you like any normal parent is expected to do. She just wanted attention. NTA", "She may not be able to. There are rules. One gal made a mini graduation gown for her daughter, who was then not allowed to march.", "NTA.\n\nYour mom absolutely helped you get you where you are, but this is YOUR opportunity to be acknowledged, to shine. Your dad just wants you to give in to avoid conflict. Don’t do it. This is YOUR moment. \n\nParents- especially mothers- do sacrifice their careers when they have kids in small ways over the years that add up.  As a parent, she should realize by now there is no real recognition LOL. The recognition is in seeing you grow & develop into an adult. To see you walk across the stage & get that diploma. To see you graduate, her heart filled with such pride and love she feels like she could burst.", "NTA. Stick to your guns. Your mother is overbearing, trying to steal the spotlight of your graduation. Tell her \"no\" is a complete sentence and you will not be discussing it further.", "[removed]", "Most countries in the EU don't celebrate high school graduation? I feel sad for those graduates. Even though most people graduate from high school I still think it's worth celebrating. In Sweden high school graduation is a huge deal, it was the best day of my life. I loved eating breakfast with my classmates in a local park, signing their graduation caps and singing the Swedish High School graduation song (Studentsången in Swedish). And of course running out of the school to meet family members who were waiting on the school yard.", "NTA but if I were you I would check with the person in charge of the ceremony.  They may not want this because half the audience will end up walking and ruining their time table, plans for seating and space, etc. Then you can say you asked about it and was told no. Oh, and if they say yes, tell them you don't want this and need them to tell you no!", "NTA. This is just odd, your mom is doing what a good parent does. Doesn't mean she can cross the stage with you.", "As a former university event manager (including work on significant portions of commencement), this sounds like the stuff of nightmares to me. You must have had a very small high school. NTA--your mom was *totally* unreasonable. Frankly, I think it's bizarre that they allowed the friend's parent to walk.", "NTA\n\nThis is YOUR graduation. It’s time to recognize your achievements.", "You are NTA. Your friend did a kind thing to recognize his mother. Your mother wants to be recognized for very vain reasons. She wants to take attention away from your accomplishments. Don't let her. You are in the right.", "Exactly! I agree with you. She did what she had to do as a parent. I don’t really know about it in the USA but in my country parents are legally forced to let their children go to school (or have some sort of schooling, but homeschooling is absolutely not common in my country). So it’s the bare minimum if you’d ask me. NTA", "Specifically with OP’s friend, it was *the kid* who wanted to do that for his mom. NOT the mom who asked for it from his friend.", "Begone, bot!", "Its not sad, honestly. We get our results in the post mid summer holidays, generally, then go out drinking. After we sober up, we confirm places in university. As already stated somewhere, finishing school at 18 is normal. \nMoreover, its practical with no fuss. I mean the OP wouldnt have a problem if no graduation took place?! Just another example of the USA adding pomp and attention to basic shit, while the rest of the world get on with the day. Also OP, NTA, her your mum to get back in her box", "Your mom is the AH.  She graduated multiple times and she did no more than a parent is expected to do.  Your friend is inviting their mother for all the right reasons.  Your mother is trying to take the attention from you to make it all about her.", "NTA.", "NTA. Does she make you give her gifts on your birthday? Yikes. I don’t think I’ve ever seen this at any graduation I’ve been to and I’d be kind of surprised if they allow it for your friend but you mom should celebrate your accomplishments from the stands with the other family and friends. This is your ceremony!", "Narcissistic entitled behavior from OP’s mom. NTA.", "NTA I would have pointed out to her that your classmate's mother did not graduate or experience that while she has multiple times. She doesn't need to be recognized publicly for supporting you. She should expect recognition from you in the form of not wasting what she had taught it what you have learned.", "I work in higher ed and have worked at several commencement ceremonies, and let me tell you: the school officials HATE IT when people do this. It slows down the lineup and procession, and it takes the focus off not just the graduate who's walking with an extra, but from every other graduate who's anywhere near them. Tell your mom to get another degree if she wants to walk at a commencement ceremony so badly.", "NTA\n\nContrary to what she may think, graduation day isn't about her.\n\nBTW, congratulations!", "NTA\n\nyour mother sounds kinda narcissistic and also i doubt that your school would even let that happen in the first place", "First and foremost, what does the school say?", "\"she said that she took care of me, helped support me throughout school, etc, so she feels she should be recognized for that.\"  So in other words, OP's graduation is all about the mother, eh? And that's exactly what the mom was trying to do.\n\nNope, OP, you are NTA.  Your mom had multiple opportunities to walk down the aisle at her own graduations.  It would have been inappropriate for her to walk with you at yours.", "I’m a mom and I would NEVER try to hijack my kid’s’ graduation. This is your moment and YOU earned it. Your mom achieved a lot and walked three or four times. Why does she want to walk again?", "NTA. Why can’t your mom let you have your own shining moment?", "NTA. Having a child means you have to care for them. I dont understand parents who want their kids to kiss their asses for being given the bare minimum from their parents which they’re required to give.", "Not remotely the asshole!   Your mom sounds a tiny-bit self-centered, though -- graduation is a specifically personal accomplishment.   I've never seen a parent accompany a student.", "NTA\n\nMy brother and sister bought our mother a bouquet of flowers on graduation day.\n\nMother's Day is for thanking your mother for all she does.\n\nI have never heard of what your friend did and I think it's amazing!\n\nThis was your graduation. Not hers.\n\nI got my GED, went to business college and then the Navy. I was put in foster care at 12, so my childhood wasn't the same as my brother and sister.\n\nMy mother was also a single mother.\n\nI'm just telling you this so you know what I saw other students do. Mothers got bouquets, some got coursages, some got jewelry. I did see mothers get gifts.", "NTA. This is kind of a younger version of a parent wanting to make their kid's wedding about themselves. Were your mom's parents alive when she graduated? Would she have liked it if they horned in on her ceremony? Don't ask her that, because she'd probably lie and said she definitely would have. Just keep it in mind while you're standing up for yourself.", "NTA. She is supposed to have taken care of you because she is a mom. Graduation is YOUR time.", "NTA. Go through with this and she'll be standing beside you at your wedding or with you when your kids being born etc etc", "I would give her the gown and the cap and let her walk while I stayed in my chair.  Everyone should shine the spotlights on her.", "NTA…it sounds like she maybe just wants the attention you’re supposed to be getting? Your graduation is not about Mom.", "I understand your reasoning. Was in a similar situation when I was in my teenage years. However I still regret it to this day, that I said no to my mom. Tbh 20 years later I am still not over it, even though she said that she understands. For context she wanted to go on a 3 day school fieldtrip with my class.", "NTA! It's weird for your mom to do that when she already graduated!", "NTA. I have never heard of this practice and frankly find it a bit strange. Graduation should be for the students who are graduating. The only exception to me would be if a graduating student passed away before they could finish school and their parents were invited to walk in their honor.", "NTA. I purely hate weaponized gratitude.", "This never would of been allowed at my highschool.  I don't think they would have even allowed the friend to do so.We had set seats and such. Graduation is for the students who graduated on the other side of the football field. You are correct.  That is my job as a parent.  My job is to enable my son to be able to live his life.  Your whole life you're going to have people pushing and pulling on you to get you to do stuff.  You don't have to be rude, but you don't have to be a doormat.  This is your moment.", "Why would a parent want to walk with their child at graduation? It's the child's time to shine, not the parents.\n\nI am 52 and could never imagine asking my teenage daughter to do that when she graduates. School was all her work, not me.", "Your mom wants attention but this is YOUR moment.\n\n&#x200B;\n\nNTA", "Honestly, I can’t help feeling like she doesn’t have the right to be upset unless she can keep it COMPLETELY to herself. I cannot even imagine wanting to horn in your kid’s graduation. What if every kid had to walk with a parent? The kids would be completely overshadowed at the ceremony that basically acknowledges they have reached a huge milestone and are heading into adulthood. I am so sick of parents who just cannot let their kids separate.", "Ask if her mom walked across the stage with her, then tell her, \"no.\"", "It’s not like anyone at your graduation would name her or hand her a diploma. Right? I feel like she’s just being a clingy mom.", "Apparently not. OPs mom already got 3, and now she's trying to use OP to get a fourth graduation ceremony to walk at.", "Probably USA people will find sad you didn’t had prom, homecoming, preschool/kindergarten/lower school/middle school graduation. High school graduation it’s only the end of a very very very very long list of school scholastic celebration. Spirits week. Appreciation days. \nI have 3 kids in the UsA school system. I had to get literally schooled on everything and it’s a second job to make it to all…", "We have big celebration for university. In Italy your friends will made a ‘papiro’ which is a long satirical poem in rhymes. Usually extremely vulgar and satirical, which caricatures of yourself and your life. Which then is posted all over the city. Special candies (almonds dipped in red sugar glaze) are given to families and friends. Big parties. But yes before then preschool, kindergarten, high school are nothing big celebratory. It’s state compulsory school… \nNow I have children in the usa from preschool and to the end it’s a big party. I like them both. They are just different. Probably someone that had preschool graduation will be like ‘oh but if you don’t have preschool graduation!!!’ In reality you are not going to miss something none of your friends do…", "NTA- it’s your moment not hers. Your friend is doing it for his mom bc she didn’t get to do it ever so he wanted to share it with her. That’s his choice but you don’t have to", "NTA", "NTA.  Graduation is supposed to be about those who are *graduating*.  Why is the school permitting parents on the stage?  If your friend’s mother wants to graduate, she should take classes and graduate like everyone else.  Otherwise, be happy with Mothers Day.\n\n\nYou might want to let a counselor at the school know (confidentially) that other parents and family members are beginning to believe they can all march across the stage with the graduates.  I say confidentially or anonymously so as to avoid blowback from your mother and your friend if the school restricts the ‘walking’ to graduates, as they should.  Good luck and congratulations, graduate!", "NTA. That walk is something you earned because you made it. Your friend had his mom walk with him because, although not quite in the same way, she made it too. Your mom, on the other hand, already made it three times. Your getting through high school wasn't her personal struggle.", "OMG!  I think I've heard it all from the entitlement front now - parents getting to walk at their kids' high school graduation?  Because they cared for and supported the kid through school?  And if that is the only reason for mom to walk, shouldn't dad also be dragged across the stage?  I can understand an exception for an extraordinary reason but this is nuts.\n\nI've probably been to two dozen high school graduations (large family, yes) and have never seen a parent walk with a child.  Even when there have been graduates with leg braces and crutches or canes or wheelchairs, the graduate walked alone or with the aid of a school staff member.  \n\nWhat's next?  Mom and dad get complimentary diplomas for making sure the kids showed up for classes?   I can't decide if this is total narcissistic behavior or just a mom wanting attention.  \n\nNTA for saying no; graduation is for you.", "I've literally never heard of anything like this happening. NTA for saying no.", "NTA! It’s sweet of your friend to include his mom because she gave up education prospects to immigrate. Your mom HAD her moments in the spotlight at her own graduations and then she wanted yours, too. As others have pointed out, taking care of you through high school is what’s REQUIRED of a parent, and it doesn’t entitle her to encroach on a day that’s supposed to be celebrating you. She’s being ridiculous.", "NTA.  Honestly, it sounds like your mom was trying to take the focus away from you by not letting you have your own moment on the stage.", "NTA.\n\nI’m also curious- even if it was okay with you (NOT saying it should’ve been, I think you’re 100% in the right here) would the school have even allowed it? It’s one of those “what if everyone did it” type things, it could get out of control real fast!  Focus should be kept on the people graduating.   \nThe only person I’ve ever known who had someone walk with them was a blind student who was being guided, and that’s a totally different scenario.", "NTA. That is weird. If her rationale is the standard, nearly every HS kid would have a parent walk with them--which they don't. She did her job and did it well apparently. Good for her. She had her trips down the graduation aisle already. This is about you.", "NTA it makes sense in your friend’s case because his mom had to give up her chance at education to make sacrifices and emigrate to the US.  Your mother is highly educated so she didn’t miss getting to graduate.  The “sacrifices” she mentioned are normal parental responsibilities", "You are so nta here. Let's not literally applaud a fish for swimming. Like come on, what is mom expecting here? The moment you decide to become a parent is the moment that child becomes the priority no matter what. You want applauded and cheered for for doing it, wait till mothers day when it is about you. Not the day that's supposed to celebrate your sons accomplishment. It's your mother who is ungrateful for having this outlook on being a parent and what she has done and sacrificed, not you for expecting her to do what she agreed to when she became a parent.", "NTA.  What a horrendous idea.  It would make me feel like a little kid that couldn’t be trusted to walk and get my own diploma. Your mom is all kinds of wrong.", "NTA \n\nThe situation with your friend was unique and I think it was very special for him to recognize his mom’s actual sacrifices and give her an experience she gave up to get him where he is today. \n\nYour mom likely worked hard for her degrees but having her walk with you at your high school graduation IMO would have made your friend’s sincere gesture of recognition to his mom look like less than it was. \n\nIdeally your mom will get over it.", "NTA\n\nYour mom's mad she couldn't steal your spotlight during a big milestone. That's pretty messed up.", "I would never demand to cross the stage with my child. This is their moment to shine and I wouldn’t dream of making it about me. Especially since I’ve also done it 4 times now. Your mom sounds like she has narcissism issues. NTA", "NTA, did your mom try to compete with you in all aspects or is it just this? Either way this is wrong, it is your accomplishment and your day. I'm a mom and didn't walk my kids. She sounds like a narcissist, you cut those people out of your life if they cross boundaries just an fyi", "NTA… this is super weird and cringey", "You're mom sounds selfish af..", "NTA. Your mom is weird and sounds like she is trying to steal the spotlight. Tell her she has had three graduations, and no one walked with her. Why can’t you walk alone to celebrate your accomplishments just like she did?", "Um, I’m a prof, have attended more graduations than I can count, and I’ve never seen someone walk with someone.  \n\nYour mom is out of her mind.", "Also, think on this.  If she is such a narcissist she wants to steal OPs shine at a high school graduation, what's going to happen next.  She will make OP sit in the stands while she collects his degree?  She going to be standing right on top of him at the wedding ceremony?  She's DEFINITELY going to demand to be in the delivery room and also that she gets first choice on naming any future children too.\n\nOP, NTA, and this is exactly the time you need to set firm boundaries and stick to them.  Future you will thank you from the bottom of your heart.", "\"I fed you, clothed you, kept a roof over your head - so I am *entitled* to this thing [no matter how you feel or what you say]!\" was a go-to for my parent with undiagnosed Borderline Personality Disorder...\n\n...which is so gross.\n\nEven if the role of parent was entered into hesitantly or unwillingly, it can be traumatic for kids to hear \"well I supported your basic needs so you need to do XYZ for me!\" but it's absolutely a thing with Cluster B (and I'm sure other) parents, and their enabling partners don't typically help.\n\nSuper proud of OP for standing up for himself and hope he's able to continue to set healthy boundaries after reflection and consideration like he did here well into adulthood!\n\nNTA times a million.", "Honestly, I don’t even see how this would work.  I’m in higher Ed too, and I can’t see the logistics of this.", "You're mom sounds selfish af..", "And super annoying for the school admin who'd have to add in \"everyone can have someone walk with them\" to planning. And you know it wouldnt stop there, then everyone would be asking if their pet iguana can walk with them", "NTA, this is your moment.  She can attend as a guest only or not at all.", "NTA and you are right. Your graduation is about you, not her. She was being self centered. Let her pout, she will get over it eventually.", "NTA.\n\nFirst, congratulations! You're becoming your own person. Yes, your parents raised you and supported you and blah blah blah blah they did the parenting they should have done. Your mom doesn't deserve to eclipse what was ultimately YOUR accomplishment just so she can have a little extra attention. She's had her time(s) to shine if she graduated multiple times already and presumably had events like weddings and such.\n\nKeep an eye out for more of these behaviors in the future. Is she going to insist on walking with you at your college graduation, or if you decide to pursue a degree after college? Is she going to wear a wedding dress to your wedding if you decide to get married? \n\nSince you graduated, I am going to assume you're going to college soon. This is a good time to start setting boundaries for yourself as a young adult, especially if you intend to move out on your own. \n\nGood for you for telling her no. It wasn't her place or right and you should be celebrated as your own person, not an extension of her. Best of luck!", "NTA, at all.", "NTA. It sounds like your mother is trying to steal your spotlight. She already had her graduation; she shouldn't get to have yours too. \n\nHonestly, I hate the mindset of giving into unreasonable demands \"to avoid a fight\".", "Glad you didn’t let her walk and steal your shine. Sounds like she makes everything about her\n\nNTA", "NTA. She had her moment of celebration already. Your friend doing that is nice and it is fitting with his mothers struggles. But your mom graduated and was celebrated. Also taking care of u wasn’t a solo job since i see ur father is in ur life AND it is what she is supposed to do. Like she decided to keep u, taking care of you is ur parents job. It’s a bit weird she doesn’t understand why she isnt in the same predicament and weird she wants attention focused on her.", "NTA. Your mom is nuts.", "NTA. This isn't her moment in the spotlight. It's yours and yours alone. She had her time 3 times.", "NTA your mother is projecting her insecurities and perceived failure on her child and attempting to live vicariously through you. Sounds like she needs some therapy.", "NTA - She already had her walks. Did she let her mom walk with her? Secondly...what happens when you go to college? As a parent, you have to learn when to step back and let the child live. Good luck and congrats on graduating.", "NTA - what's wrong with your mom?", "NTA, your mom sounds like a narcissist. My mom would constantly throw the “I took care of you” shit in my face and it would guilt me. Until, I saw how other parents treated their kids, then it infuriated me. \n\nA parent should never, never throw the “I took care of you” in your face. It’s literally a crime if they didn’t, and you didn’t choose to be born, your parents wanted a kid, and they knew what that entailed. She gets recognized for it everyday when you call her title “mom”. I assume you also do stuff for Mother’s Day for her. \n\nIt’s your moment, not hers. You were the one who worked hard, and stressed, and balanced your personal life with your school. Not her. At risk of sounding callous, it’s fucked that she would want to jump in your spotlight. What your friend is doing is sharing the spotlight that he earned with his mom who didn’t get the opportunity. What your mom is trying to do is shoehorn herself in so she can feel validated for doing what is expected of all parents. \n\nSo, yeah, OP, NTA, and I hope you have a good graduation ceremony, and a good time with your friends afterwards. ( I never got to graduate high school, so I always find it cool when people do. )", "NTA\n\n&#x200B;\n\nPArents walking with their kids is ridiculous, even for the friends mom.", "NTA and frankly I don’t think the school should have let your friend’s mom walk in the graduation either. It’s very sweet that he wanted to do something special for his mom but it’s an inappropriate venue and occasion. Graduation is about the graduates, not whose parent made the most sacrifices to get them there.", "NTA\n\nMother is being an asshole here. Credit stealing is so gross. Tell her that you ran the idea by some people and they said it was \"cringe\" and she would look like a fool.", "NTA: She has had her time to shine three times.", "OMG....that is so weird.   You don't escort someone done the graduation aisle.   This crap has got to stop.  NTA.", "She's has too get over herself. NTA", "Nta she needs to recognize it wasn’t about her.", "NYA your mom seems like a crazy attention seeker and your da did an enabler.", "NTA. This is your moment, not your mom's. Graduation acknowledges your success, and before reading this, I've never heard of parents walking with their kids.", "Narc mother alert! Your graduation is about you. It's your parent's job to sit in the audience beaming with pride. NTA. I doubt the school would even allow this nonsense.", "NTA. Sounds weird, entitled & trying to take away from your day. Just MO.", "NTA\n\nDoes your mom try to make things about herself in general? Is it possible she's feeling lost because (if you are her youngest) she's about to see her baby go off to college? (Just a thought... no idea.)\n\nWhatever her deal, most definitely not NTA.", "I wouldn't be surprised if she wore white to my sons wedding.", "NTA", "I was thinking this.... as lovely as the gesture is from the young man to his immigrant mother who did not graduate, this can not be allowed.  The only time a family member walks in the ceremony in our district is when we have a special needs graduate who is best supported by their own family member.  (We provide an aide, but a few students are just best served by a family member).  Those family members wear a black gown (not our school color) and are clearly there to provide support.  (Our aides do the same, so most observers don't even know that person is family and not staff)", "Most people don't have this level of awareness to recognize the difference. Good on ya", "NTA, OP I’ve got news for you bro! Your mom will proxy fuck your future wife metaphorically!!!", "NTA. Your mom sounds like a narcissist. You did right not to let her walk with you.", "Your mom is an attention seeking A. You are NTA", "NTA\n\nYou don't want her too, she doesn't. Simple as that. Your mother decides how much of a fight that is. If she wants to be recognised, maybe take her out to lunch as a thank you or do something (I still think expecting this is too much and takes away from its authenticity but it's something) but that's as far as it needs to go.", "NTA. Ugh. What’s with my age group and their codependency with their kids? \n\nIt’s your graduation not hers.", "NTA, your mother is a self-important narcissist.", "Wtf. My son just graduated and I cannot imagine asking to walk with him for HIS accomplishment and HIS graduation. That is ridiculously absurd. You're absolutely correct, that IS her job when choosing to have kids, she should be ridiculously proud of you and congratulate you, not pouting because you didn't celebrate her! \n\nNTA", "Did her parents walk with her all three times?  NTA, but mom is a bit narcissistic to turn your achievement into hers", "NTA. She just wants attention", "NTA. Your poor Dad... just do what she says!  She is a bomb!", "As Chris Rock said, \"That's what you're supposed to do!\"", "NTA", "Ewwww. Why is your mom making this about her? Super narcissistic move. You are totally NTA.", "NTA. I find it bizarre that she is so hung up on this when she has had three of her own graduations. Sure she supported you, but that's to be expected. That's not something that merits special recognition. Kind of seems like she's just jealous of the \"specialness\" of your friend's gesture for his mom. (I am a mom, by the way.)", "NTA I graduated last year and my parents were fully invested in watching me walk the stage. They would’ve never requested anything like that, we graduate high school once and it’s our moment", "NTA - your mother will also want to wear a white wedding dress to your wedding because she raised you and made you the man you are. You need to have a serious talk with her before she starts displaying overbearing behaviour.", "She dulled your moment by making a confusing and undeserving request.\n\nNTA", "NTA it's not really common for parents to walk with their kids when they graduate, my graduating class had about 500 people and none of their parents did that and this was in 2014.", "Oh god, she sounds like she’s going to be a nightmare of a mother in law.", "I haven’t signed up for reddit in fear of feeding my scrolling addiction 😅😅 but I did just to comment that, moms matter 💙", "Yikes. NTA. \n\nShe’s making this moment about her. \n\nHigh school graduation ceremonies are for the kids.  It marks the end of one stage of life and the beginning of adulthood. Us parents get to celebrate and enjoy that our kids have worked hard and finished, a sometimes grueling, life achievement.  \n\nWe get to watch our kids become adults. From that point on we are more guides than parents. \n\nSaying no to mom is okay, it’s a healthy boundary to set. It maybe awkward and difficult but you are your own person. \n\nIt might be the mom is struggling with this major change but that is for her to work through on her own. Hopefully, she will see that this your moment, to celebrate your accomplishment.", "And dad is an enabler. Just shush and go along so there isn’t a fight?", "Exactly, watch this turn into a Thing and then the nice boy who started it won’t get to bring his mom up"]}