{"id": 19464, "submission_id": "1467a12", "title": "AITA for not paying my daughter’s tuition after she refuses to talk to me?", "selftext": "I (45M) decided to stop paying my daughter’s(19F) college tuition after she blocked me basically everywhere and won’t talk to me. \n \nThis started about 2 years ago, when I found out my then ex wife Bertha (44F) had an emotional affair and kissing someone else. My ex and my daughter were really close, she was her only daughter while we had two younger sons. Though the divorce did change our relationship, I was still in good terms with my daughter. \n \nA couple months after that whole mess, one of my friends, Stacy(31F) was really there for me the whole time, and we decided to get together. I don’t think our relationship is wrong. We’re both over 30, and actual adults. Once again, we were mostly cordial still, though I’m pretty sure my ex made some nasty remarks.\n \nLife went on until recently Stacy figured out she was pregnant. I do realize I’m older than the average dad, but once again I don’t think I did anything wrong. I also proposed to her because I do genuinely love her. My sons were entirely supportive and actually pretty excited when I told them. My daughter on the other hand got super mad, and presumably this is what led to the blocking silent treatment. All of this happened during December. Stacy gave birth 2 weeks ago, and we were talking about cutting my daughter’s tuition for next year because she hasn’t been at any family functions and hasn’t talked to me since January.\n \nShe figured it out through her college portal and got really mad once again. She told about how I was marrying to a person so much younger than me and so forth. It’s like she only wants me for my money and doesn’t want anything to do with me.\n \nEdit: I’ve tried reaching out to her, asking my sons if they could reach out to her, asking mutual friends. She didn’t want to talk to me at all.", "created_utc": 1686421388, "permalink": "/r/AmItheAsshole/comments/1467a12/aita_for_not_paying_my_daughters_tuition_after/", "score": 988, "replies": ["##[AITA for blocking your go-to time killer from June 12-14?](https://redd.it/145o4jz)\n\nWelcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > i could be the asshole because my own daughter is so mad at me for doing all the stuff i did\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nIs your money and the only one who wants a money relationship wigh you is her ...\n\nBe happy with your New wife", "Honestly, the only thing I feel compelled to point out is that *if* you go this route, you are nuking any possibility of a relationship in the future. Your teen is an adult, but a *very* young one who is clearly struggling with something in regards to your relationship. \n\nI leave it to you to decide which course of action feels right to you.", "INFO: As a father, what have you done to resolve the conflict with your daughter over the years other than post on Reddit? \n\nThat information is suspiciously absent from this post.", "INFO\n\n>we were talking about cutting my daughter’s tuition for next year \n\nWho's we in this situation? Because your new wife should have absolutely zero say about that decision.\n\nAlso, doing that without even mentioning it is a major AH move. You aren't obligated to pay her tuition, but there were plenty of ways to message her, even if she cut you off. YTA\n\nEdit: No, I don't think the wife gets to have any say in an arrangement made before they were even married.", "NTA.\n\nShe thinks your wife is only with you for money, yet she's blocked you everywhere and expects you still to pay for her tuition?", "INFO:\n\ndo you want a relationship with your daughter? she's still young, dealing with her dad starting a new family. did you suggest counseling? what have you done to try and mend the relationship before just deciding to cut funding for her schooling? or do you just not care if you have a relationship ?", "Taking this at face value, I have to go with NTA. If the reason she is cutting you off is because you divorced her unfaithful step mother and then found love with someone else, that's very immature of her and a refusal to see you as a person with emotional needs, but rather she does see you as an ATM and even your adult children don't get the right to treat you that way.\n\nI suspect, however, there is something more, but if she won't talk to you about it then still, OP you are NTA, because she won't talk to you about it and give you a chance to make right what was wrong or apologize or whatever else she needs from you. Unfortunately until level headed people help her to this point, there's not much you can do.  Is her birth mom in the pic and potentially helpful?", "NTA\n\nYou’re not refusing to pay because she’s upset, you’re refusing to pay because she refuses to speak with you, there’s a difference. She’s not entitled to have her education paid for, and if she wants a life without speaking to you, that’s her prerogative. But she shouldn’t be expecting the benefits of a paid college if so. \n\nWants her cake and to eat it too.", "NFO: was the divorce just because of your wife having an emotional affair? Did anything else happen that your daughter was upset about or may have found out about? Did your daughter tell you why she was upset? \n\nI'm wondering if its possible there's animosity towards Stacey for a reason beyond her age  - you got together with her a few months after divorcing. I'm not saying this is true, but I'm wondering if daughter suspects you had feelings for Stacey before the divorce and feels like theres been some hypocrisy here.", "Nta. Fafo", "Cutting her off after she cut you off. NTA\n\nNot telling her (i know she blocked you, but your sons can reach her) or her mom and she had to find out on the platform was an Asshole move though", "Regardless of who the AH is, you should consider the fact that if you choose to do this it will definitely be the end of your relationship with your daughter for good. You have no idea what she is going through or why she blocked you~college is a lot of pressure and dealing with family drama is sometimes so stressful it can take a toll on studies, maybe it was wrong for her to stop talking to you but acting petty and immature in response to her struggle will be the nail in the coffin of your strained relationship", "YTA simply for how you went about it. It’s within your right to have cut tuition for her cutting you off. However, just doing it without reaching to her, giving her a heads up, and allowing her a new plan of action? Majorly YTA. \n\nThe fact she is so upset about it shows that she cares about you. If she wasn’t upset, she wouldn’t care. I agree that age different at this point in life isn’t a huge deal, but she’s 19. Her brain still isn’t fully mature. Her parents split up. That’s an upsetting thing even years down the road. She has a right to have feelings and be upset about things.\n\nIt’s YOUR JOB as the parent to try and connect with her to figure it why she’s upset and talk about it. Like the adult that you are. It sounds like you didn’t even try. You just cut the payment which was really awful of you.", "INFO: What does your divorce settlement and/or parenting agreement say about who pays what for college?", "NTA. From what you've said (and all we can judge on) your wife had an emotional affair and ended up kissing the AP. You divorced her, which affected your relationship with your daughter as she was closer with her mother. Now you're dating someone else and haven't advertised that fact, your partner is pregnant and has now given birth. Upon finding out you'd moved on from your ex, who you were divorced from, your daughter cut all contact and refused to communicate.\n\nShe can either be an adult and communicate, or face the consequences of her tantrum.", "All i’m gonna say is if you cut her tuition she’ll certainly not want to talk to you anymore 😭.", "NTA. Your daughter is 19. She's an adult. If she wants to not have a relationship with you and block you, then she may as well kiss her tuition goodbye.\n\nIf she thinks your wife married you for money, your daughter is also expecting money from you without doing any work. At least your wife is being a wife.\n\nYou don't owe your daughter money, neither is she entitled to your money.", "NTA. Don’t bite the hand that feeds you. She can be upset and add distance, she can be mad. But she cannot seriously be so entitled that she thinks she can completely ignore you and still have you shell out thousands for her tuition. She’s an adult, it is never a parents obligation to pay for college, that’s a luxury she lost. She can get a job like the rest of us", "NTA. Your daughter is angry with you for finding happiness. She too is an adult and if she won’t speak with you there is no reason to provide her with anything. As far as I’m concerned you’ve done nothing wrong.", "Was college covered in the divorce decree? Check your family laws on who is responsible to pay for college", "NTA. Your daughter doesn't call, visit, nor interact and still wants to be part of the family and have the benefits of a supporting dad? I don't think that's fair.\n\nI see other people here talking about the timing between your divorce and your new relationship, but that is IMO irrelevant to your daughter, you are already divorced, so what are people expecting of you? Are you supposed to have some kind of emotional mourn period after the divorce and stay alone for God knows how many years until a new relationship \"feels\" appropriate? \n\nYour daughter is the one making a tantrum, don't fall for it. You deserve to be happy.", "Sad situation...nta\n\n\nI wouldnt cut off tuition of you really care for your daughter. She is still young and irrational. You should pay for her tuition because you want her to jave a good life, not because it buys you your daughters love.", "I am not familiar with the exact terminology but kinda assish but understandable. \n\nOn the one hand she has to at least tolerate your relationship because she has no right not to, especially if she still depends on you financial.\n\nOn the other hand, just withholding the tuition and not telling her in advance may have major consequences, depending on where she's at. In my uni you only had a certain amount of time to complete a given set of mandatory courses and just losing a semster may have messed this up big time for her.", "NTA...she cut you out of her life and still expects you to foot her college bill? Wrong answer. Your love life is of no concern to her, if you are happy she needs to just grow up and accept it. She has her mom, she can be happy with her.", "NTA You paying for your daughter's tuition is a privilege for her, not a right. She is not owed that money. If she is so upset with you, she shouldn't want your tainted money anyway. If she doesn't want to treat you like a member of her family there is no reason you should feel obligated to pay. \n\nAll of these people on here calling you the AH are out of their minds. Relationships are a two way street. She Is holding your relationship with her hostage to try to manipulate your behavior because she disagrees with the choices you have made as an adult. She is learning that there are consequences for her controlling and abusive behavior.", "Nta. She's an adult. Her actions have consequences.", "YTA. You say \" we were talking about cutting my daughter's tuition\". Your new wife should not have a say in what you spend on your daughter's school. You will forever destroy your relationship with your daughter if you carry out your revenge plan. Your daughter will not forgive for damaging her education. Do you want to damage her future to punish her for not liking your marriage to a younger woman? Think long and hard before you blow up your relationship with your daughter to be petty.", "NTA", "INFO: did you really cut her off because of her behavior or because now you have another mouth to feed, and that was a convenient excuse?", "you are for cutting it with out any warning. plus, the new wife really should have no say in this matter. this is between you, ex wife and daughter. your daughter is acting entitled though. plus, people here forgetting that the poster was CHEATED on and is now a free adult to fall in love with whom ever he wants. he has moved on. AND, ex wife has probably poisoned daughter against her dad.", "NTA\n\nSo you're daughter wants nothing to do with you right now, except for your money? I've always been in the mindset that after 18 years old, anything else the parents provide (housing/schooling/etc) is just bonus. She can get a job and pay for her own tuition like a responsible adult.", "NTA based on what you’ve written.  She’s obviously mad at you about her mom and you moving on with your life.  But, she needs to keep the lines of communication open if she expects support.  You are under no obligation to pay your stepdaughter’s education.  As for being an old dad, I had my first child at 43 and my second at 46.  They keep young, but it helps if you keep up with going to the gym so you don’t feel like you’re having a heart attack when playing football.", "I feel like it shouldn't need to be said using your daughter's financial dependence on you against her because she's giving you the cold shoulder is immature. But apparently that's what you need to hear.\n\nYTA. You're the adult in this situation. Act like it.", "NTA. You’re not just an ATM. If she wants help from Dad, maybe she ought to try talking to him and not blindly taking her cheating Mom’s side. Maybe a lack of tuition will bring her to the table.", "NTA. Your daughter can't handle you dating someone else and is punishing you for divorcing your cheating ex by ignoring you. Thats not fair. Your daughter needs to learn better coping mechanisms than ignoring her emotional problems. Your sons are ok with you being in another relationship, so your daughter needs to act her age and get over it. I don't agree with the YTA votes. Your daughter doesn't get to cut you out her life by blocking you then expect you to be ok with bankrolling all her college expenses. Put that money towards your new family instead.", "NTA\n\nShe sounds very entitled if she thinks she can ignore you completely and still have her tuition paid. Everyone saying you’re the AH seems to have this idea that parents aren’t humans with feelings. It’s a two way street.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (45M) decided to stop paying my daughter’s(19F) college tuition after she blocked me basically everywhere and won’t talk to me. \n \nThis started about 2 years ago, when I found out my then ex wife Bertha (44F) had an emotional affair and kissing someone else. My ex and my daughter were really close, she was her only daughter while we had two younger sons. Though the divorce did change our relationship, I was still in good terms with my daughter. \n \nA couple months after that whole mess, one of my friends, Stacy(31F) was really there for me the whole time, and we decided to get together. I don’t think our relationship is wrong. We’re both over 30, and actual adults. Once again, we were mostly cordial still, though I’m pretty sure my ex made some nasty remarks.\n \nLife went on until recently Stacy figured out she was pregnant. I do realize I’m older than the average dad, but once again I don’t think I did anything wrong. I also proposed to her because I do genuinely love her. My sons were entirely supportive and actually pretty excited when I told them. My daughter on the other hand got super mad, and presumably this is what led to the blocking silent treatment. All of this happened during December. Stacy gave birth 2 weeks ago, and we were talking about cutting my daughter’s tuition for next year because she hasn’t been at any family functions and hasn’t talked to me since January.\n \nShe figured it out through her college portal and got really mad once again. She told about how I was marrying to a person so much younger than me and so forth. It’s like she only wants me for my money and doesn’t want anything to do with me.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "INFO:  What does the divorce decree say about college money?", ">She told about how I was marrying to a person so much younger than me and so forth. It’s like she only wants me for my money and doesn’t want anything to do with me.\n\nShe's really reaching here.  45 and 31 isn't that far off when it comes to maturity and life-experience.  And it's still well within the (age-7)*2 rule.", "NTA.  Plain and simple.", "NTA. You made the right choice and I hope you stick to it without giving in the your daughter and ex-wife’s demands. Your daughter should be appreciative and consider herself lucky you’re even paying for her post secondary education in the first place because you’re in no way obligated to do so. If she’s cut all contact with you it gives you every right to cut off her tuition with or without notice. She should’ve applied for a student loan anyways. The money you’ll save will be better spent on family who actually loves, respects and cares for you: your wife and baby. If your ex-wife doesn’t like it tell her she should be the one paying for the rest of your daughters tuition, since your daughter clearly still talks to her.", "Gonna say NTA… your daughter want to have her cake and eat if", "Regardless of what happened, I wouldn't support someone who was openly hostile to me, either. Your paying for her tuition was a gift, not a given, and her attitude is confusing to me because unless she lives under a rock, she should know she shouldn't bite the hand that feeds  her. \n\nGently let your daughter know this and inform her that the responsibility is now on her mother pay it.", "NTA", "YTA\n\nThe divorce is still very fresh in her mind, and it happened during a huge transition period in her life that is already really stressful (moving from hs to college). I'm thinking she's still pretty messed up over it.\n\nAdditionally, women going out into the world start to get a lot of messages about how their worth declines as they age, and about how they become less attractive in their late thirties and forties while men just become \"silver foxes\". They start to learn that a lot of men are only attracted to women 10-15 years younger, and start to get hit on by men your age. Being confronted with the reality of existing as a woman in the world is probably hitting her like a brick, and it sounds like she's projecting new insecurities onto you.  With the type of things young women are bombarded with at that age, I don't think it's a leap for her to assume  Mom had an emotional affair because you were no longer attracted to her, and looking for an out to date younger women. \n\nLook, she's your daughter, and 19 is a messed up age. Functionally, 19 year olds are still children in many ways, and they are adapting to learning that the world is a shitty place.  I would not destroy her future over not talking to you for 6 months. If you've put this money aside for her college tuition, follow through on your commitment to her.  Even if she never talks to you again, you will know that you did everything you could for her, and that you were always a father she and her Mom could count on. \n\n(And this might get me downvotes, but unlike most of Reddit, I do think parents who can afford college tuition have the responsibility to pay for it for their children who are decent people with the ability to succeed. It is parents' income that qualifies or disqualifies students for financial aid. If you have the money to help her pay for college, she is not eligible for grants or subsidized loans.  There is a cap on unsubsidized loans which may not be enough to cover her costs, and private loans would require a cosigner. Basically, she's still financially tied to you and dependent on you for the purposes of her education, and using that fact as a power move just because you're angry at her and disappointed with her is probably not the way to go. \n\nI'd say, be the bigger person and keep reaching out and following through on your promises to her.  Then, if she still won't talk to you, wash your hands of it. You did your best and put her out into the world, and hopefully one day she will realize all you've done for her and hear out your side of this story.", "NTA. I hope your daughter gets over herself and you can rebuild your relationship. She’s being awful. Congrats on the new addition.", "NTA, and you’re right, she only wants the money.", "Sounds like your daughter only wants you for your money lol.\nNTA", "NTA\n\n\nI would say you're an ass for not letting her know first, but seeing as how she's refusing all communication that's on her, not you.", "NTA. A relationship works when both the people in it are ready to talk and understand each other's pov. If your daughter feels irked by anything she should have communicated to you. And since she doesn't want to communicate with you isn't eligible for the monetary support.", "NTA.", "NTA. You are under no obligation to pay her tuition. If she doesn't want anything to do with you, she shouldn't expect anything from you.", "Good grief. NTA but your daughter is having a hard time because of what your cheating ex-wife fills her head with. What's the freaking big deal about 45m and a 31f getting married. If you have to fly, drive, train or whatever you and your daughter need to have a long conversation. You aren't replacing her with anyone. If you stop her tuition I can assure you that you will definitely never see your daughter again.", "I would Say NTA because she was  not talking to you so what’s the point of paying it and she wasn’t talking to you and she blocked you off of everything because she find out your wife was pregnant", "NTA she dropped you first and refuses to talk.  She seems mad you moved on after her mother moved on while still being married to you.", "Info: what do you think the outcome will be if you do stop paying her tuition? Do you think that shows her how you feel about her? Don’t you think that will make things worse? If she’s not talking to you now don’t have any hopes she will in the future. YTA", "NTA", "NTA - It is your money, you can decide what you want to do with it. She clearly doesn't want a relationship with you, and only wants your money.\n\nYour daughter has a right to decide who she does or doesn't want a relationship with, but that does come with consequences.", "NTA..", "YTA  \nShe is upset over the huge changes in her life, and you even allude to her mother possibly making comments that are exacerbating the situation. Rather than contact her directly, you've chosen to make matters worse by cutting her off. Did your new wife tell you it was a good idea to cut her off? If so, then she's an asshole, too. She'd be an even bigger asshole if it was her idea.   \n\n\nWhat's worse is that you didn't even let her know you were cutting her off. You let her find out through the portal. Even with her blocking you, you could easily get in touch with her, but choose not to.", "NTA. you don't block the hand that feeds you.", "NTA I’ll be damned if I’m paying for someone’s tuition who won’t talk to me. You don’t want to talk to me go talk to the bursars office. You’re the one shelling out thousands of dollars, why should you be the one begging for the scraps of her attention. I am so tired of people on here assuming that being a parent means always being the perfect ATM.", " NTA", "NTA.", "Nta", "YTA. I have a feeling that there is more to this story than OP is sharing. All the excuses are sus.", "NTA for moving on  but you have to deal with this without dragging your sons into it.", "Yta I think you should have warned her, your actions have real consequences for her future and I get your mad but like is the love for her gone as well?", "YTA. She’s a young adult but she’s still an adolescent working through complicated emotions and relationship dynamics. She’s still your daughter. \n\nCutting her tuition is sending the message that your love  actually is conditional. Be the “actual adult” you claim to be and offer emotional support to your daughter as she deals with the consequences of your actions. That might include space from you for awhile while she sorts out how she feels.", "YTA. Not paying your daughter's tuition because she's upset about you marrying someone who is closer in age to her than you are is a dick move. It's your job as a parent to support your child's education regardless of your relationship with her. You're acting like a child throwing a tantrum because someone doesn't approve of your choices. Grow up and be a responsible parent.", "YTA. You knocked up another women within a year? Less? After splitting with her mom. Or had you actually split before sleeping together?\n\nWhat exactly are you hoping to accomplish?\n\nThat she dutifully visit, sit in your living room for an allotted period period of time, and at that point you’ll release the funds? \n\n\nHow much time does she need to be present?\nAn hour? A meal? How often? \n\nOnce a month? \n\nIs she required to feign interest in the baby?\n\nDoes she need to speak while there? To whom?\n\nIf my dad got remarried to a much younger woman and “just happened” to impregnate her-\nand then “we” decided to cut off funds to an existing child? \n\nI don’t think I’d believe it was a love match.\nNot mutually anyway.\n\nWhispers of gold digger and baby trap must be making the  family group chats.\n\nYou aren’t making your replacement family look very good.", "Yta, but only because you're going _way_ too fast.\n\nIt'd be one thing to cut her off after a solid year of no contact, and refusal to initiate contact or something. But unless I'm reading this wrong, you're cutting her off after a _month_. That's not a _good_ relationship, sure, but that still within \"busy and inconsiderate\" territory for God's sake.\n\nI agree that she's doing a fair bit wrong, and I see how it is hurtful that the thing that got her to break her silence is the end of your money. But it is _not_ like she \"only wants you for your money\". You have not been in this position long enough for that to be the case. There have been exactly _two months_ where she both didn't want to talk to you and was still making use of what you'd agreed to give her, and that's too quick to make a judgements when the two of you haven't even discussed her problem.\n\nI think it be best if you do that before making any relationship ending moves like this. Because trying to financially bully your daughter into affection like this is a bridge that's hard to unburn.\n\nAlso: be careful with that \"we decided\". The idea of your new young wife making decisions that pertain to your kids is dangerous at best.", "YTA. You’re the parent here, she is the child and yet you are acting like a child. You should want the best for your daughter without strings attached like she needs to be happy about your much younger new wife and baby. \n\nShe’s 19 for gods sake. I’m sure you made a lot of stupid emotional decisions at 19 too. You’re setting her up for failure because you’re butt-hurt. You want a permanent rift from your daughter and any future grandchildren? This is how you do it.", "YTA. She's still your daughter even if she's giving you the silent treatment. Withholding tuition is messed up. Not even warning her is a major dick move. I know a guy who did this and his kids HATE him now. Is that what you want?", "This is tough. I’d say ESH. She’s the bigger one for sure, but you really ought to empathize with her. This is a lot to go through. You’re not under any obligation to help with her tuition either so people calling you an ahole for that reason can kick rocks. HOWEVER before cutting that tuition, you should’ve gone directly to her place of residence (I assume your ex?) and told her face to face. That way if she avoided you again, you really did all you could.\n\nBut YTA for letting your new wife have any say over this decision. She absolutely should not have input over this at all", "Your daughter is young and is dealing with a lot of stress. With college and her dad getting a whole new family within a year. \n\nMaybe 19 is old enough to not block you on everything, but she is still a child. And could have a relationship with her in the future. \n\nHave you tried to get in contact with her in different ways? Or have you had a conversation about what she’s feeling and even why she blocked you? \n\nYou are acting like a child by holding her future in front of her face like a carrot. If you previously agreed to pay for all of her college education then you should pay for it. \n\nETA- but I would recommend trying to talk to her, maybe invite her to lunch to discuss everything.", "YTA.  Don't hold tuition over her head like some sort of coercion.   It won't help to get her to accept the situation. It will only make it worse by alienating her even more.  find other ways to reach out to her and repair it.  It isn't about money. She is having trouble emotionally adapting.", "YTA. \n\nShe hasn't just decided she doesn't want a relationship with you, she has valid reason to be upset with you. She's clearly having a difficult time accepting that you're essentially moving on and having a do-over family (in her eyes). \n\nWhat you're doing is a really shitty thing, it can quite literally fuck up the rest of her life. There are very few situations where a parent who is financially capable of paying, who promised to pay/who was already paying can realistically \"cut off\" financial support for college and not be an AH. You often cannot qualify for financial assistance whatsoever if your parents earn over a threshhold because it's expected that the parents contribute.", "YTA that’s going to help that relationship with your daughter oh so much.", "I can see how from your daughter's perspective, first you replaced her mother, and now you're replacing her with a new child. This would be really painful for her, even if from your perspective it's not true at all. If college tuition wasn't stated in your divorce arrangements you don't have a legal obligation, but it sounds like you're going scorched -earth with this. Is it worth destroying your relationship forever, never knowing her or your future grandchildren someday? Adult children who cut off parental contact typically have very good reasons.", "Yta Do you really think it's ok to nuke your daughter's future, because she's having trouble navigating all that turmoil? How about you acting like the grown up and not a spiteful child?", "YTA and the math does not add up you were divorced when she was 18 and she is 19 now \n\nAnd shortly during the break up you hook up with a 31 year old “friend”.  \n\nI wonder if this friend was also a friend of the your ex wife and maybe OP was the one cheating and the daughter figured it out. \n\nAnd NOW you and your friend decided to not pay her  tuition with out telling her in advance. \n\nSo what happens to your daughter does she drop out of school now \n\nI wonder if it has anything to do with the cost of a new baby. \n\nYou and your friend are both jerks if you really cared about your daughter All you had to do is call the ex wife  and say if she does not contact me I will stop paying tuition. \n\nALL along you and your friend decided to stop paying the tuition due to the new baby and used her not talking to you as the excuse. \n\nCongratulations on the new baby because you just LOSSED your daughter. \n\nHope it was worth.", "YTA. She is a very young adult who is trying to come to term with her dad marrying and having a child with someone who is closer to her age than yours. You should be the bigger person because you are the father.", "YTA", "You’re acting like a child. YTA", "YTA- I get your daughter is being frustrating, and it hurts that she isn't speaking to you. But, the best thing you can do is to meet her in person and have a heart to heart. Go back to paying her tuition, apologize for canceling it, and being petty, let her know you love her and so forth. Explain your side of things. Even if she's still mad and shit she's young, and if anything, once she matures and gets older- as long as you continue to be a father and stay in whatever contact you can manage, she'll come around. She probably can't see your side of things because she's focused on her own feelings. I'm sorry to hear you're going through this.", ">we were talking about cutting my daughter’s tuition for next year because she hasn’t been at any family functions and hasn’t talked to me since January.\n\nYTA\n\n**So you would rather she is a fake person who pretends at family function for the sake of money? Is that what you want?!?!**\n\nIf you are a father, you should care about her having a difficult time. Her parents got divorced. Her mom was in an emotional affair and broke her trust. You got over it fast, found someone, and within two years remarried and had a kid. Don't you think all of that is a lot of change for anyone, even more so a teenager who is also away from their family in college? Isolated from her family?\n\nAlso, teens go through a hard time in college and many have a lot of mental health issues, more so during and post-lockdown.\n\nInstead of finding a way to help her, you are like \"I would rather have a daughter that pretends everything is fine and is here for the money.\"\n\nSaying she doesn't pick up the phone is dumb. Send her an email or a letter, and give her TIME. It has only been 6 months. During those months she was busy with college and probably ignoring everything to be able to focus or do something else!!!\n\nYTA", "NTA but you wouldn't be doing this if she were your biological kid. This is what it all boils down to. I appreciate you calling her your daughter but I see through it.", "Ya. And you could have warned her that you were not going to pay for her Fall Term so she could hustle and save over the summer. You flattened her.\n\nWay to parent. /s\n\nAnd where does it say a parent can go back on their word to help with college fees because their student child just can't talk to him right now?\n\nYTA", "Look, life happens.  Whoops, you're going to be a dad again.  What's done is done, and it can't be taken back now.  \n\nDaughter is allowed to feel how she wants about this-replaced, mad, betrayed, etc.  She's apparently completely cut off her father, OP.  Again, she's allowed to do this as a result of whatever she's feeling.\n\nDaughter, however, shouldn't expect to continue to have her tuition funded by the person she cut off.  Actions have consequences.\n\nI'd be really ready to declare OP an AH if, say, daughter had come to OP because of some emergency and OP refused to help.  \n\nNAH.  Daughter is allowed to feel how she feels about her dad's new family situation, and OP did move on pretty quickly...but also, there are consequences to completely abandoning a relationship with the person paying a major life expense for you.", "IMO: My ADULT daughter wouldn’t get MY money if she acted like that. She’s not making an effort while he is trying to.", "YTA. You screw around with other people’s lives, having them left to “figure out”:\n\n1. You characterize you impregnating your new partner as “Stacy figured out she was pregnant”\n2. You changed your decision about your daughter’s tuition support, yet didn’t communicate this to her. As you say “she figured it out through her college portal”. \n\nHoly moly. You really seem to be minimizing the YOU roles in all of this.", "INFO:  Is your daughter your biological daughter?  \n\nSometimes you can try and do everything right, but if Mommy Dearest is playing the victim with her daughter (conveniently forgetting her cheating precipitated the end of the marriage). \n\nDaughter is an adult and learning adult lessons. FAFO", "There appears to be an absurd amount of entitlement on this sub.\n\nYou don't get to go no contact with someone and expect them to remain your piggy bank.\n\nNTA", "YTA,\n\nCutting off your daughter's tuition in order to make her get in contact with you will not work the way you want it to.\nSure, you can stop paying it if you want to but this is not the way.\nFirst, she is angry with you and has decided to ignore you, have you asked your sons to help you contact her or your ex wife.\nSecond, any talk about tuition should not at all include your new wife, this should be between you and your daughter and your ex-wife.\nThird, cutting her off will not make her talk to you in the way you want her to, she will see it, how it is perceived as, emotional blackmail, you are using her education as a tool for you to be in contact with her again.\nIf you want to cut her off, first let her know, and do it over a period of time, such that she is able to get financial help, she needs to continue college, by cutting her off like this so suddenly, you are essentially destroying your relationship with your daughter, she will probably have to drop out and will never speak to you again.\nThis is toxic behaviour from your end.\nYou are not acting like a father\nSounds like something an abusive partner would do to make their partner stay with them trapped.", "ESH, only because of the way she found out. At minimum, you should've sent her a letter.", "YTA she’s only 18\n\nEdit: 19. I stand by my comment. Her family imploded and she’s ignoring her dad. Dad should be more mature.", "YTA no wonder she doesn’t talk to you. You never give up on your kids ever. You don’t enable them, you don’t pander to them but it is your job to manage the relationship with your children and you’ve just shrugged your shoulders and decided to financially manipulate the situations. Instead you could have…I don’t know…called her. Asked for counselling. Tried to work through your issues. Behaved like a parent instead of just moving on. This is her education you’re talking about, I presume she’s always banked on having that paid for so she never saved independently. But you’re messing with her future now. Good job dad. Don’t expect to mend this rift anytime soon. But hey you’re popping out more kids with your younger wife so I guess you don’t need to be on good terms with all of them!", "YTA for not telling her, but you're within your rights ho have reasonable expectations of tuition payment, namely not treating the person giving the money as if they don't exist. You don't have to be best friends but you should at least be on birthday card terms.", "YTA  this is such a nuclear option. Presumably shes going through something. You can’t hold financial security and education over her head as both carrot and stick contingent on behaving how you want.     \nI understand you’re hurt but financially punishing her because of that is called financial abuse, and it would jeopardize her education and perhaps even housing. You agreed to pay for school so pay it.", "Of course YTA? You don't stop being her parent. You're happy enough to mess with her education because she doesn't pander to you? Make MORE effort, not less.", "NTA\n\nFor all the people saying \"you should've given her a heads up\" HOW!? How could op have done that when she's blocked him on everything  he's tried alternative numbers and accounts and has tried communicating through the sons!", "Jesus Christ yta", "YTA she found out through her college portal???", "YTA I'm afraid. Don't use money to force your daughter to speak with you. Apologise. Pay up. Wait for her to open up. It could be a while.", "YTA - your daughter is adjusting to divorce, her parents moving on and you having a new family. She needs time to work things out and you decided to make your relationship transactional. So congrats on on making a likely temporary situation a likely permanent one", "YTA, you didn't even have the guts to tell her.", "INFO to recap, you are divorced because your ex wife was interesting someone else, thereby blowing up your daughters life, causing her to be forced pick a side.\n\nYou were able to upgrade your life, while ensuring your daughter can’t because she’s not sure who to trust anymore (because her brain isn’t fully formed).\n\nSo while your daughter is  scrambling for her footing, and making mistakes, you think it’s the best time to withhold her education.\n\nVery interesting why she doesn’t trust you.", "NTA, I would say you are if you had built a relationship with her, exclusively on just financial support, but you didn't. Her mother had an affair and she gets a free pass when it comes to moving on and you have to do it, on her terms? No, it doesn't work that way.\n\nI wouldn't drag your son's in this. I get that you're doing what you can to establish some method of communication but the truth is, your daughter needs to learn that you don't pick and choose what you want from a parent who is divorced. If she's going to go NC with you, then she needs to put on her big girl panties and accept the consequences that come from what sounds like immature behavior. No financial or emotional support, from a parent she wants nothing with (except $). She needs to grow up and like her mom, learn that there are consequences when you fuck around. It's called finding out.", "NTA for not paying.  YTA for not telling her in advance.  Just because you can’t get to her directly, you could have told your ex who could have told her.", "Well you can write off ur whole future relationship with ur daughter for good now cause yta congrats", "YTA because instead of being a parent and getting to the root of the problem, you did the drastic thing that almost ensures the relationship will remain strained", "Yta", "Congrats on the baby, because you just lost your daughter. YTA. And I agree with what others are saying here. The math doesn't add up, and I also feel like you're punishing her for not immediately accepting everything going on. She wants space from you right now and she's allowed to feel that way. You and your new partner decided to cut off her funding for school now that you have a new baby, effectively cementing any feelings of being replaced that she may have had.", "You love your daughter.  She is hurt and acting like a teenager.  Pay the tuition and give it some time so your relationship may heal.  Not paying feeds the story that you have abandoned her for your new wife and child.", "Hey, so you have every right to pursue your own happiness, especially since the divorce wasn't from your own infidelity. Just saying YTA for a knee jerk response. Your daughter is processing a lot - her parents breaking up, and within a year you starting a new family from scratch. This is a lot for her to handle, and she doesn't feel like she can talk to you right now. Fine. Cutting her off financially because she isn't handling the situation as fast as you is really not it. She might need time. It might hurt you to not be spoken to - but if you ever want a relationship with your daughter at some point, a financial punishment after such a short amount of time is not the way to go about it.", "Crappy dad alert", "YTA. Your divorce was likely hugely traumatic for her, and then you got together and had a baby with a woman who was only “your friend” in a very short period of time. Your daughter reacted emotionally, and you reacted MUCH more strongly in the same way (I wonder where she gets it….). If you want to permanently destroy your relationship, you’ve done it. If you’d like to act like an adult, there’s time to reflect and change.", "YTA. For all the same reasons being said. I can't add anything that hasn't been said so just my vote of YTA.\n\nYour new wife has no place in any discussion about your daughter as she has literally nothing to do with herm this discussion should have been between you and your ex wife.", "YTA", "YTA", "Are you sure your ex-wife was the only one having an affair? This whole timeline with Stacy sounds like you may have been too. If I was your daughter I’d be grossed out and concerned too that my dad was in a relationship and knocking up someone closer to my age than his. Stacy sounds like she already has too much influence over you if she’s making decisions about your daughter’s education. She should have no say in this decision. This needs to be between you and your ex-wife as well as your daughter. \n\nYTA for how you went about this.", "I suspect everyone telling you you’re an AH is because you are a man trying to find happiness. Don’t let them get in your head. Very much NTA", "NTA. She’s an adult. Neither of you is entitled to a relationship with the other. You’ve tried to maintain one. She has refused. Like the millions of other college students with whom you don’t have a personal relationship, she is not entitled to your money.", "NTA If she’s going to give you the silent treatment presumably about the new wife and child she deserves to have her tuition cut off. You did also try and contact her about it and heard nothing back.", "You are not TA for moving on. You and your new wife are both adults. You haven't done anything wrong by marrying her or having kids. I don't know why some people are upset with you having a baby with your new wife but so what? \n\nYour daughter cuts off contact because she doesn't want you around her or in her life anymore but still wants you to pay for everything? \n\n*You however are the TA for Cutting her off WITHOUT telling her or giving her any notice to sort out her finances*. Also your new wife should have no say in cutting your daughter off like that.", "Probably unpopular opinion here but NTA. If dude was blocked everywhere and she refused all contact how could he warn her? You don’t take someone’s money and treat them badly and expect the cash flow to continue. That’s just silly and childish. It sucks for her but she made the grown up decision to cut off her dad, it’s reasonable to assume the money goes with him. No idea if he’s a good dad or not but that’s not the question here. In this situation he ain’t wrong. It’s made now, she’ll have to sleep in her bed.", "NTA\n\nShe has every right to cut contact if she feels that's what you deserve, but she should also live with the consequences of that decision then and accept any negative reaction from you in response to her treatment.\n\nIt sounds like a good conversation is in order but that's pretty hard if she won't talk to you. Strange how she remembered your number when you cut tuition, isn't it?", "Your daughter is young and going through a major trauma event (parents divorce) while going to college. Your daughter likely feels like you have chosen your wife and your new baby over her. Now she feels like that had been confirmed by you cutting off her tuition.  Instead of asking her brothers and friends to talk to her on your behalf, grow up and go knock in the door and visit her, and have an grown up conversation together, instead of shrugging your shoulders about the situation.  YTA", "NTA.", "NTA\nDaughter made a decision to cut ties with her father. That should also mean she shouldn’t be  financially tied to her father since she is legally an adult. Sometimes decisions backfire and this one sure did on her.", "So she supports her mom who cheated, but can’t accept the fact that you found a new love and got married. It isn’t making sense to me.\n\nI would go with NTA. Don’t bite the hand that feeds you", "You can't go no contact with someone as an adult and still expect money, that is very entitled behaviour.. You are more then an ATM.\n\nI don't really care about the other stuff. To me this is what makes NTA", "YTA.  Your personal life and your daughter's education are two separate issues.  \n\nI get it.  You and your daughter are going through a rough patch.  But you pulling her tuition is not fair to her.  Her eligibility for loans, grants, ect are entirely dependent on what your income is.  If you pull the money, she doesn't have the ability to get loans/grants because of your income that she has to declare on the applications..  The people making those loans/grants will know that you have the college fund.  It will be on their application.  So she will be in a rough spot to attend college at all.  That will not make her love you more.\n\nSo she, rather than resenting you for your new relationship, will transition for resenting you for a rotten thing you actually did.\n\nBe the bigger person here.  As you mentioned, you are an adult.  She's still a teenager.", "NTA\n\nyour money is good enough but not you? She is old enough to realize actions have consequences. and she blocked you on everything instead of talking.", "You chose your new wife who swooped in after your divorce over your daughter (I'm sorry, but did she get pregnant before or after you married her? Also, what was your new wife's relationship like with your daughter? If new wife said something bad about her actual mom in private to her while you weren't around, if I were your daughter I would want nothing to do with you both too - it's really crappy to sh*t-talk your kid's other parent whether you're married or split-up). Something tells me a lot more led up to her going no-contact with you than just remarrying.", "NTA\n\nYour daughter went NC. You tried to reach out. This is a consequence of the daughter's actions. \n\nReddit loves to suggest NC. This is real world consequences of NC. Reddit take note.", "Info: Are you wanting to actually have a relationship with your daughter in the future?\nAt the moment, she has cut you off while she is dealing with some difficult feelings. I’m sure that’s painful for you and it’s not the most mature way to handle things, but she’s 19! \n\nMore than likely, she will come around given enough time and space, unless you do something to make the rift permanent.\n\nBottom line is, she’s closed the bridge between you, do you really want to be the one to burn it?", "NTA she is hurt but she will grow the fuck up eventually. Or she will be like MY older sister and be a complete asshole to your new child for the rest of her life. Either way that isn’t on you. HOWEVER, I am also fully of the belief that 99% of the time strained parent-child relationships are the fault of the parent. If you had had a strong foundation of a relationship with your daughter BEFORE all of this happened then while she would have probably still been upset it is unlikely she would have cut you off completely. Maybe you should take a bit to look inward and truly examine the relationship you had with your daughter and ask yourself if it was really in the best place possible before this happened or if maybe you had fallen down in that regard.", "You have a bigger problem than if you're an A or not. \n\nDo you want a relationship with your daughter? How important is it to you to be right? \n\nYou're daughter cut you out a bit.  If you leave an opening and show that you want a relationship, that can easily be done.  No issues. But, if you cut her off, you will be confirming that her decision to cut you out was the right decision. \n\nIs she being petty? rude? judgmental? Most liking, yeah.   She is.   If you stopped paying her tuition, you wouldn't be the asshole; you just risk permanently destroying a relationship with your daughter.   \n\nThere's also a real possibility that she saw you are the perfect dad, you were her superhero.   Remarrying and having a kid within a year of divorce shattered her ideal of you.  It's hard for kids to see their parents as someone other than THEIR parent.", "NTA you tried to reach out but she won't speak to you. She cut you off.", "NTA. You are her father, not her ATM. No relationship, no money.", "not an arsehole.  \n\n\nif she doesn't want to have a (even limited) contact with you and her new sibling, than she shouldn't sponge off you.", "NTA", "NTA\n\nYour daughter is facing the consequences of her actions. What a good lesson for a young adult.", "NTA. Personally, I feel that this Reddit is heavily biased and would never side against a fellow millennial going through their similar \"struggles\" of adulting, which mostly comprise of teenagers making poor, unnecessary decisions that uproot their own life. Where I am from in Asia, you are widely considered to be an adult at 18. You are fully responsible for your own actions, and that much has been effectively drilled into our heads, starting from our very childhood. Most parents nowadays, wherever they are from, I assume should have taught their children the importance of independence and self-accountability, as they are simply critical values for surviving and thriving in this increasingly competitive world. \n\nI say all this to set the stage for my main point. At the age of 18 and above, your daughter, as a college student about to pursue their interests/career in whatever academic field they may have selected, should be WISE ENOUGH not to cut off all contact with her biological father for SEVERAL MONTHS at a time, after he has painstakingly forked out the necessary cash to fund all of your education up till now, even though he clearly has no solid obligation to do so.\n\nYou could chalk it up as young adults being confused and making poor decisions due to their chaotic family situation, but it is so difficult to understand why your daughter would do this, and I truly empathise with you on that matter. Why have you not encountered this problem with your sons? Did you treat them any differently? The way I see it, I sincerely believe your daughter was intending to cut you off and sever her ties with you immediately after she no longer needed your help. To go MIA for months at a time, and only bat an eye when money is involved, is such an obvious stereotype for your typical selfish, entitled child who would not hesitate to leave you in a nursing home the moment you become too heavy a burden to carry on their frail shoulders. At the end of the day, I can only give you my take on the situation, but it is still your life and your choice.", "This will probably be an unpopular opinion, but NTA. Yes you are TA for involving your new wife in this big decision regarding your daughter, but you are NTA for cutting off tuition. If she makes no attempts to make amends or to keep literally any contact with you, why should you have to give her a free ride to college? And now that you've been trying to contact her through multiple means over and over and over again with no response, it's all too obvious that she only wants your money. Maybe she can have it back if she's willing to reconnect and actually come back to good terms with you.", "Offer half back and make her come clean and work for it", "Random question: what is the arrangement for college for the younger 2 in the divorce decree since your daughter was 18 at time of the final decree? The reason I'm asking is in all fairness to all of the children, you should put forth what was set up in the decree for them all. If not that becomes a different set of resentment. \n\nShe is 19 and possibly has mom in her ear feeding the flames against you moving on. You as the senior adult and parent need to have a sit down, come to Jesus moment with your child. There is so much going on here. Everyone is emotionally damaged and charged. I hope you all can work this out. Congratulations on the new baby. Good luck!", "Perhaps your daughter needs more time to process everything. I wouldn’t cut her off. Your love is supposed to be unconditional. This is a bump in the road. Cutting her off will just reinforce negativity. Show her you love her the best you can. Be there for her. Cutting her off after having a new baby is not a way to strengthen your bond. Don’t do your daughter dirty . She may be 19, she is still just a kid, and processing this mess her parents made. Have some compassion. Play the long game. Don’t walk away from your daughter. College will set her up for success!!!!!!!!! Pulling out could do hurt her in the long run.", "NTA\nWhen you cut someone out of your life, it is in all aspects, not only in those that are convenient for you.\n\nShe has every right to be angry about her father's decisions, but that doesn't give her the right to disrespect her father and his new wife. She is not a little girl who has to be taught that there are consequences, she made her decision now she has to live with the consequences of this.\n\nDon't worry about being an older parent, my dad had me at 43 and we have a great relationship.", "NTA We do know that one person only wants you for your money. Your daughter obviously. Can't speak to your wife, but nothing you told us suggests it.", "NTA\n\nOf course you would discuss this with your now wife. If your daughter cannot be bothered to be in contact with you, she doesn't deserve you paying for her college. This is a situation entirely of her making.\n\nYes, there is an age gap but this one isn't really creepy and not one to cause this reaction from your daughter.", "NTA", "NTA", "ESH. Your daughter doesn't really get a say in your relationship now that she's not under your roof. It's not like you're dating one of her friends or someone close to her age. That being said, your wife (who your daughter doesn't even know) doesn't get to decide what you do with your daughter's tuition at all. Also, you should've tried harder to tell your daughter you were cutting her off, ie telling her brothers to tell her. Just know, you've most likely turned what could have been a period of her not talking to you into something permanent. She doesn't have a reason to talk to you anymore, and she now has a real reason to dislike your wife.", "You should have got her brothers and/or mother to tell her she’s jeopardising her college funding by being such a shit to the person who forks out for it. There were ways to let her know. So YTA for not warning her where her behaviour was leading. Also YTA for actually stopping it without telling her.", "NTAq", "NTA, only literal children would vote y t a.", "NTA", "You may be 45, but you and your 19 year old have the same maturity and style when it comes to handling conflict (btw, you’re the person making the relationship transactional, not your daughter). YTA. Keep paying your daughter’s tuition and don’t blow up the entire relationship. Her feelings will probably evolve as her brain fully matures IF you handle it well. My mom and I went through a big blow-up when I was a teen. Guess who’s invited on our summer overseas travels? That’s right, my 85 YO mom.", "NTA , she wants to be immature, let her be immature. You don’t owe her anything and you’ve done nothing wrong. Hell, I wish I had a dad like that 😂", "So months after. - guess Stacey was closer to you whilst married than you admitted.\n\nYou got on with your life your. Daughter although an adult now life got ripped from her \n\nYou replaced your wife and daughter with Stacey and the new horn guess it’s a girl \n\nHow hard have you actually tried to talk with uour daughter.  You not your new wife \n\nSo guess Stacey gets the money and your new kid.", "NTA\n\nYou have attempted to resolve this by reaching out both directly and through others. She has you blocked AND she’s ignoring requests for conversation. It’s obvious you tried to talk with her and either resolve this or notify her, it’s her behavior that made that impossible. She cut you off and somehow expects you to financially contribute tens of thousands of dollars to her education despite her disrespect and lack of contact? Nope, nuh-uh. \n\nFurthermore, she has no say in your relationship; I’m not saying she can’t have an opinion, but she doesn’t get to guilt you or shame you for moving on after what her mother did. Her trying to punish you while still expecting you to finance her is pretty damn bold.", "Why would the daughter assume OP would continue to shell out for her when she's completely cut off all contact?   I'm also not convinced OP made any real effort to help his daughter process these changes.  Did you sit down with her and tell her you were dating and offer counseling?  Did you give your ex a heads-up or talk with her when you suspected she was talking bad about you to your daughter?  And I'm sure someone knows your daughter's mailing address.  You couldn't have sent a letter expressing your hurt and letting her know if she didn't attend therapy with you, this was the last semester you'd finance?   The daughter doesn't get a pass, but OP carries a good 90% of the assholery here, so YTA.", "IDK if YTA... But usually when children don't speak with their parents, it is usually the parents' fault. Children are programmed to love their parents.\nIs this the only reason she is mad at you, or is there something else?", "NTA but do understand the consequences of your actions. If you go this route, you will never reconcile with your daughter. You will not be there at her graduation or her wedding, & you will never meet your grandchildren.\n\nYou’re probably ok with that since you have other children & now a new family, but if you’re not, reconsider.", "YTA - OP is not giving us the whole story.  Got a gf 2 mos after catching wife in emotional affair?  Must have really torn you up OP.  Waiting 2 whole months.  Having an unplanned pregnancy at your age with a woman 10 years younger?  Yea, there are some details we are not privy to.", "This is a guarantee that she’ll never talk to you again. Tell her that you need to have a conversation about college finances in person and get a therapist or trusted person (clergy, whatever) to mediate a conversation between adults", "You new wife should have no say on this matter", "YTA because it seems it was your much younger wife's decision to cut your kids tuition to have that money for her and her kid. (you said it was both of you but we know who made that choice)", "INFO : can your daughter still attend college of you don’t pay for it? \n\nCOMMENT: is the “we” your new wife who is saying you should do this? Certainly doesn’t help the gold digger comments does it? \n\nWhat does your ex wife say about this, surely she can arrange a sit down with you and your daughter?", "YTA sure it's your right to cut her funding because she's cutting you out. But remember you are the father in this relationship, you are the one who decided to have a kid, and part of having a kid is often paying for or helping pay for tuition. And also consider how this affects your relationship with your daughter going forward. Do you think she's going to want to have a relationship with her dad who negatively affected her future (cutting her tuition and thus making it harder to get a post secondary education) at the same time he welcomed a new wife and child into his life? How is that gonna make her feel? It's certainly not going to help make her want to spend time with you. She's young (still technically a teenager) and struggling with some major changes to her family dynamic. Is it the most mature way she could handle this? No, but it sounds like one of those things where she just needs time to adjust and to know her dad is still there for her and loves her. Taking away your support is not helping.\n\nPersonally I think a parent child relationship is something inherently non-reciprocal. The parent, as the one who decided to have a child, should provide unconditional love and support, and the child, who has no say in being born or being their parents child, is not inherently bound to the same feelings. It's obviously best if they do, but that's the job of the parent, to raise their child and do their best by them so that the child is someone who loves them and wants to provide back to them. I know not everyone thinks this way, but it is a common interpretation by millenials and gen z, so it may put your daughter's feelings and reactions to your actions into perspective.", "You should have told your daughter before hand thru your sons that you are cutting her off. Your daughter's attitude is terrible and I am pretty sure your ex is feeding her crap for her own mistakes.", "I don't agree with dating someone so much younger, but you are both adults no matter how I see it. That said, you aren't the asshole. \n\nYour daughter doesn't get to just cut you out of her life and then expect you to continue to pay for her life. If she cut you off, you have no obligation to continue to be there for her. She's an adult.", "INFO I feel like there is a lot of context missing. Your daughter didn’t simply go NC. What happened before that? Is there bad blood between wife and daughter? Did you vacate your teenage daughter’s room/space to prioritize your new wife? What was the relationship with wife and daughter before you started that relationship? You’re definitely leaving out a lot of information here.", "NTA. If your adult daughter doesn't want you in her life, as indicated by blocking and refusal to communicate, then she's certainly old enough, and presumably smart enough to recognize that your financial support os part of that. There's no reason for her to think she can cut you off entirely, except for you continuing to five her money. Nope. That's pretty extreme entitlement on her part.", "Esh. Your sons seem nice, daughter is immature, you are potentially ruining her future, wife is wrong for also agreeing to potentially ruin her future. Mother is asshole obviously. You don’t owe your child tuition, but it still feels icky that you are punishing her lack of affection for you with taking away her education", "NTA.\n\nIf your daugther has cut off all communication, then consider it abandonment.\n\nYou have the right to discuss this with Stacey, a therapist, a homeless man on a corner, a tree,  a dog, or a wall of bricks.\n\nThe decision to cut off financial supoort to an adult who can take care of herself is ultimately your decision.\n\nThis works the same way if an adult decides to cut off communication from you because of your life choices - what ever they maybe - because at the end of the day, it's your life that you are living through your choices, not through psychological manipulation.", "Your new wife should have nothing to do with this decision. Ding ding ding, she's the problem your daughter has.", "YTA. Most of the time the child is dependent on your economical support, cutting her off could cost her a lot of her life quality, this ain't it.", "For all the people saying why should his new wife have a say? Probably because they're joined financially now? I'm a stepmom to two boys who I help pay for as they're 9&11 and I definitely deserve a right to say I  how we invest our money since I'm contributing half.  She's 19, a legal adult. Her attitude is making her sound like a child whose throwing a temper tantrum. If she wants to act the way she is there are going to be consequences. You don't get to be shitty to someone because you don't like who THEY'RE choosing to live THEIR life. She's not being rude to her mom who started all this by cheating. I would say NTA.", "Interesting you phrased this as your daughter having a relationship with \"your ex\" and not, you know, her mother.\n\nOn principle you don't have to pay for her college unless you agreed to do so without conditions attached. That being said, your execution needs some work. I would've drawn your ex into the conversation to communicate your intentions to your daughter since they're close. Triangling your sons into the situation is like, a little gross. Your ex is still her parent so I would say that's more appropriate.\n\nYTA but you can turn this around if you talk with your daughter and express your feelings to her. Now that she's re-engaged, it shouldn't be a problem.", "Not sure why everyone is upset over an adult cutting college tuition for another adult. Like some parents kick their kid out at 18 and tell them they're on their own. She's 19. She can fill out fafsa and do all the other things. She wants to be an adult and not speak to dad, then she needs to start acting like one. If she can't afford college, get a job or go into a trade. Not everyone needs college. Parents are not obligated to pay for college. While it is greatly appreciated, it's not mandatory. It's June. College doesn't start until August. She had a semester of \"free\" college and didn't speak to her father. Tell her mother you're not paying. Also, why is he paying and not the cheating ex-wife? Maybe she should pay? NTA, but you will be TA if you don't tell her ASAP that you are cutting her funds off.\nEdit: a word", "NTA.  It sounds like you need to seriously work on communication with almost everyone in your life, but at the end of it all, your daughter is an adult, and you owe her nothing.  Theat bei g said, she owes ypu nothing as well.", "19 is still young. I bet she feels like you abandoned her for your “new” family. She probably would have eventually come around if you had continued to show her what a good, loving father you truly were. You’re a bad dad. And if your new wife encouraged this, she’s a bad wife. And if your daughter was expecting and needing you to help pay her tuition, then you have severely disrupted her life, on top of feeling abandoned (which is a natural reaction when parents start another family no matter what your age). You are a very bad, selfish asshole.", "As a daughter that went through the same thing YTA not because you've stopped paying her tuition but because you've never taken her mental health into consideration yes the mother did cheat but for you to move on and start another family so fast is a low blow to her and to continue and cut her tuition that ended it you've basically just showed her that you don't care about her and her feelings at all", "For me NTA\n\nIf she cut you off and blocked you how are you suppose to let her know?\n\nShe’s 19, many kids pay for their own college. She was lucky that you were paying for it.   \n\n\nIf she really ‘cared’ she wouldn’t have cut him off. Why should he continue to pay her tuition if she won’t even speak to him in any way.", "if you don’t want your daughter in your life, this is the fast path to making that happen.  If you hope to have a relationship in the future, I wouldn’t do this.  Reddit is so ready to cut off parents/children/extended family.  At the end of the day, are you her father or not?  Did you agree to pay for this or not?  Do you hope to have a relationship in the future or not?  Choose wisely.", "NTA. Your adult daughter can't cut you out of her life entirely and expect nothing to change.", "NTA op if she wants to go NC with you that’s on her. she treats you like shit and like a ATM but has the nerve to say “daddy can you pay for my tuition”", "NTA. Very convenient that she can take your money but she is accusing you of doing something immoral.", "YTA for cutting it off without pursuing other means to talk to her. Have you considered family therapy for yourself and her to go to together? Cas y'all seem to have some issues to work out.", "I think I'm going to go NAH.\n\nIf you cut her tuition payment without telling her WHILE HAVING A MEANS OF CONTACTING HER, then you'd be the AH, even considering that you're not obligated to pay her way at all. She has a right to go NC but if there's trolly no way of getting to her, then unfortunately, I guess, this is how she'd find out. However, I do agree with other commenters saying that your new fiancee really shouldn't have a say in whether or not you contribute to your daughter's tuition.\n\nThis is pretty messy all around but I think pretty much everybody's feelings and actions are surprisingly justified. Hopefully you two can talk things out now. I'd hate to lose all contact with my daughter over miscommunications. And it sounds like you *might* be a lil bit of an AH in regards to speaking with your daughter previously these past few years.\n\nGood luck OP!", "NTA - because your daughter is the one who decided it.  She's an adult, she can go get loans or try harder for scholarships/grants if she wants tuition. But she cut the ties here and is throwing a tantrum. Let her figure it out on her own,  that's what she wants after all. When you cut someone off you can't just expect the money to stay, that's so entitled.", "Honestly NTA. If she’s not talking to you at all, then she shouldn’t want your money either", "I swear I’ve read this before.", "NTA\n\nYour daughter ghosted you. She’s an adult. Time for her to learn there are consequences for her actions.", "Wake up bonehead. Your child needs you and you abandoned her over a new \"mom\" and baby. YSA.", "I’ve tried reaching out to her, asking my sons if they could reach out to her, asking mutual friends. She didn’t want to talk to me at all.", "How was he supposed to mention it?  He's blocked everywhere.\n\nEdit: Seeing as the comment I responded to has been edited since I posted, I'd like to point out that using a third party to discuss private business would be a huge violation.", "His wife should have no say in a major household financial decision?", "Why does a wife not have a say on how he spends his money?  Legally and ethically, the wife has a say, unless it's court mandated, when nobody gets a say.\n\nAnd how does he mention it to his daughter, if she blocks him off?\n\nAll in all, very foolish of the daughter, to cut off her nose to spite her face...", "His new wife with new child shouldn't be involved in their financial decisions? That's ridiculous.", "I mean depending on how new wife contributes financially in their relationship and how their finances are handled, she might have a say. Say they both earn incomes and all money is in shared accounts, some of the money going to his daughter’s college tuition could be from her. \n\nI’m not saying that’s the case here but if it is then OP needs to decide how hard he is going to push for his daughter. Is he obligated to pay expenses for a child that doesn’t talk to him? Not at all, but if he ever wants a chance to talk to that daughter again he better keep paying even though she’s the one in the wrong. I would say NTA but treading on rocky ground depending on specific details of the story we don’t know.", "Bs. It’s Stacy’s family now too. She has a say in finances. NTA to both of them.", "Disagree. They're married now and its a decision regarding joint finances.", "Why should his wife have zero input?   Family finances should be an open book. Otherwise, neither interested party has any idea what's going on in the most contested issue in relationships.", ">Who's we in this situation? Because your new wife should have absolutely zero say about that decision.\n\nThe new wife has every right to be involved in financial decisions this large that affect her life and future.", "Nta - and I do think your new wife has every right to have a say in the household finances. I think it's admirable you are talking about it and making a decision together.\n\nPersonal note: I recently cut off contact with my dad, and I specifically told him I don't want any of his money either.", "This is completely untrue. His new wife is involved in his household and his financial decisions effect her too.", "It's not an asshole move to cut someone off without warning if THEY chose to go full NC. Lol I hate this world. \"you're toxic, I don't want you in my life at all.\" parent: *okay, stops paying for college*\n\nThe internet: wow, not at least giving a warning? What an asshole move.\n\nI'm astounded. If wanted his financial help she should have made nice until she graduated then cut full contact.", "At worst for OP is should be ESH since the daughter is acting like a child and ghosted him for six months.", "Am i the only one seeing potential parent alienation by ex via blaming op for cheating with new wife (as far as we know op didn't cheat but it wouldn't be the 1st liar taking advantage of a situation)", "Absolutely, yet the same wife who's saying don't pay for your daughter, where do we think that saved money will be going?", "Agreed NTA.", "Yeah, I gotta agree with you here. OP you're NTA", "You gotta admit that finding out from the college and being blindsided is pretty messed up, though. She could have been working and saving or applying for more scholarships or something if she’d been given a heads up.\n\nHe could have told a family member to pass the word along if she’s not answering calls. Just some kind of communication there would have been better.", "Frankly, it is different.\n\nOP has likely spent his daughters (snd son's) whole life telling them he'll pay for college. That is a promise, and if its repeated often enough of course she'll plan with that in mind.\n\nIf someone had gotten sick and they needed the money for medical care (which is horrendous, to be clear) then he wouldnt be TA.\n\nBut in this situation, he's a 45yo matching a 19yos maturity level and pettiness. Which is ridiculous.\n\nThis is what \"take the high road\" was designed for. And when she's grown up a bit more she'd realize it.", "expecting your parent to keep paying your tuition while you're having outs with them for a few months is hardly seeing him as an ATM.", "He’s blocked on everything. How does he reach out?", "Hard disagree. He can’t reach out to her. He’s tried. She’s blocked him on everything and if she’s at college, presumably he probably doesn’t know where she lives college kids move yearly almost at a minimum after dorms freshman year. \n\nThe she’s upset because she cares is bullshit. Anyone would be upset if they stopped receiving 10-50,000 dollars yearly. \n\nHe can’t connect he’s blocked everywhere. She’s an adult if she can’t communicate and realistically I get this is probably hard for her, she should want her dad to be happy or at least communicate to him she feels this is rushed. OP’s wife CHEATED on him, not the other way around. We’re talking about a college aged adult not a young child", "1. He tried to contact her and he’s blocked. If someone refuses to communicate, does that make them entitled to money somehow?\n2. Maybe she’s upset because she still cares about him; maybe she’s upset because she just wanted the money and isn’t getting it anymore. Which one of these possibilities jives with her refusing to speak with him?", "How is he supposed to talk to his daughter about cutting her tuition if she won't speak to him and has him blocked everywhere?  It's not like he can just go up to her school or just show up at her work. Then he is likely to get the police called on him.", "She cares about him so she blocks him on everything? A heads up through a second party would have been better but cutting off all communications and basically disowning someone should be expected to be a two way street. She’s 19 and should be able to critically think", "I'm 19 and I don't think the whole \"brain isn't fully mature\" thing works, because youre still old enough to know how to act right, not saying that she didn't, but it's the principle of it. Her parents splitting up because her bio mum cheated on her dad doesn't necessarily pardon her being rude to the guy,sure she can have feelings and be upset about stuff, it's the how you handle it that counts, and other people are also entitled to react to how she acts. She's also an adult too. He said that he was blocked on everything, that means he tried and couldn't contact her. What more was he supposed to do? He's got a kid coming along so he needs to be careful with his money and she can't even be sensible enough to at least communicate or allow him a way to communicate with her, is he supposed to just do nothing because she's decided to throw an extended hissy fit? She didn't even do it temporarily too like a week or something, like she kept it that way untill she HAD to speak to him if she wanted the money. Not like OP got with some kid, or cheated on her mum, he got with a fully grown woman. If she was like 20s and then op was 40s I'd be like that's weird but she's in her 30s, like? Also what gives her the right to throw a fit over who her parents date? Should he just be alone forever since her mum cheated on him?", "Doesn’t sound like he can get ahold of her. Sounds like he’s tried reaching out even through his sons but to no avail. Seems like he’s entirely in the right to do what he’s doing. Actions have consequences.", "Well, seems the daughter cut communication\n\nHe can't reach her through her brothers, so how would he let her know if she cut all the ways he could communicate with her?\n\nActions have consecuences. \nDon't bother talking to me? Dontwant *me* to communicate and reach to *you*?  Well, now you won't know I will stop paying you tuition\n\nCommunication goes both ways lmao", "No, not talking to him doesn't prove anything about how much she cares about him. It can mean anything,b because she *says* nothing.", "‘Her brain still isn’t fully mature.’ Ahh that old Reddit canard. \n\nHaving your tuition cut off is a helpful accelerator of maturity, for those who\nfeel childhood lasts until 25.\n\nChildren eventually learn that money comes with strings attached. Christmas doesn’t last forever. \n\nYou can pay for her tuition if you want, since I’m sure you’ll consider going no contact with the person paying for your education is totally warranted and should have no consequences.", "Bullshit take.\n\n&#x200B;\n\nDaughter went no contact over this. THis is real world consequences over that action. He reached out and she refused. NTA", "I think I can understand one reason why she is mad. Op mentioned moving on within a couple months. While I'm certainly glad that op is not wasting energy with being sad over a cheater, the daughter could interpret it as him having been mentally checked out of his marriage and life for quite a while previously to this incident. Or just rebounding.", "So did you just not read the part where she cut him off from contact? How was he supposed to contact her?", "How can he give her a heads up if she blocks him everywhere", "God help OP if his new baby is a girl. Daughter will totally see it as a replacement.", "100% agree with this position. The rebound baby is going to haunt you until you’re done paying that tuition too into your early 70s. \n\nDo what’s correct as a grown ass man and finish what you started; pay your daughters tuition.", "She is upset because she's not getting money. She wouldn5 be upset. She's upset because all her daddy's money is now gonna be spent on the baby and the step mom. And she's 19, an adult, not a kid. \n\nShe can be upset, but she can also pay her own tuition. If you're gonna stand up for your principles, you should be able to face the consequences as well. She can stand for her principles and pay for her own tuition.", "I think you're maybe right, but it feels like there's two sides to  this. If she's going to block and cut her dad out of her life, she shouldn't expect financial support (this sounds like it's been going months so not a \"I'm not talking to you for a little while\" type argument). On the other hand, he's her parent and needs to make sure all his children are provided for regardless of how he feels about it. Imo ESH", "Another comment about reaching out to her - how? When she has him blocked everywhere?", "I disagree completely. It’s silly to give a 19 year old a free pass simply because her brain isn’t fully developed. She’s old enough to be able to communicate her feelings without giving everyone the silent treatment. In his edit OP stated he and his sons tried to reach out with no success.", "She is an adult who decided to block him and go no contact. He can’t force her to have a relationship with him but she shouldn’t expect to get money from him either in that case. In her shoes I’d assume it’s a foregone conclusion that intentionally cutting someone out of my life meant they wouldn’t give me money any more. NTA", "If she won’t talk to him how is he supposed to tell her?", ">However, just doing it without reaching to her, giving her a heads up, and allowing her a new plan of action? Majorly YTA.\n\nHow was he supposed to give her a heads up? He is blocked on everything. And he said he tried to get her brothers to reach out also and she would not speak to him.", "Shes upset because her financial aid has been cut off and she'll be scrambling to find a way to pay it, not because she cares. Not saying she doesn't care, but its very unlikely that she's upset out of \"care\".", "Is he not blocked on everything?", "While I agree he should have reached out, how was he to do so?  She blocked him on everything.    You can't really tell someone something if you are blocked....and it would be unfair of him to ask his son's to pass on that message.....", "she already doesnt want to talk to him anyways, not like its gonna change much", "Thank god since she sounds like she’s only in it for the money.", "He literally brought her in this world, he should provide for her up until she is independent(unless she stays like a parasite, which is deffo not the case here), cutting of money cause of disagreements is a shit move, especially since she is studying for a better future.", "I agree. Definitely an AH move to not inform her but she’s an adult.", "I’m still partially responsible for paying for my sons. But I’m fine with paying for all of it.", "If he loves his daughter, it should be no matter what. And messing with her future will lead to long term consequences. Doubt she can get last minute aid and likely will have to drop out. New wife certainly does not mind, you would think her father would", "I'm floored by seeing this so often.  The new wife is legally joint owner of all their collective resources.     \n\n\nWhat's more, they have a child together that is absolutely their dependent, unlike this adult woman, who is the child of his ex.    \n\n\nHe's definitely going to blow up this relationship, so if he expects to have one with her after this he's silly, but she went no contact for months and still expected him to pay for her future.   That's also damn silly.", "You think his wife should have no say in major household financial decisions?", "Why would he pay for his kid’s school when the kid won’t speak to him or hang out with him at all? Reread the post, she cut him off months before he cut off the money. He already has no relationship with her, there’s nothing to blow up.", "Does sound like the new wife is all for cutting the daughter off", "Lots of, LOTS OF, people in here are trying to gatekeep happiness and it is truly disturbing.", "Sounds like you think the daughter gets to behave however she wants without repercussion.  That sounds like entitlement that needs to be addressed.", "I don't see it as \"using your daughter's financial dependence against her\". \n\nI see it as you can't go no contact with someone and still expect them to send you money. That's insane, I'd NEVER expect that.\n\nOP's daughter stopped talking to him and *blocked him* SEVEN MONTHS AGO. She has refused to so much as acknowledge him for more then half and year and she expected him to keep sending her money? She blocked him, how are they even supposed to be in contact about her tuition payments? \n\nI find all these Y T A comments shocking. A 19 year old is not a toddler who isn't responsible for their own behavior, can't predict the logical result, and is a dependent regardless of behavior. OP is not morally obligated to act as a faceless bank account for another adult who dosen't want a relationship with OP and has made it impossible for OP to even discuss giving them any money. \n\nI remember being a 19 year old quite well, and I didn't know a single person who expected all of their expenses to be paid by someone they went no contact with. That's shockingly entitled and also shockingly dumb. She really thought that if she blocked him for 7 months he'd keep paying for her tuition without even the ability to discuss the payments with her? \n\nPart of being an adult is that if you want to use people you have to at least acknowledge their existence. Not exactly a high bar. Also, if my minor child didn't talk to me for 7 months there would be results to that too. I wouldn't just keep giving them money to do whatever they want and not worry about it.", "So the daughter doesn't talk to OP or go see him at all for 2 years and he's just supposed to suck it up and keep funding her life? She's 19 she can get a job and apply for scholarships", "He's the adult???? She's NINETEEN!", "Sounds like the outcome from OP continuing to pay would be the same as stopping, except with paying OP ends up with a lot less money.", "I have tried contacting her, she doesn’t want to be contacted at all.", "Agree with all of this. OP is gross, post-divorce he immediately leaped into a relationship with a much-younger woman, and now he’s cut off his daughter’s tuition, and even worse, without adequate warning. Applying for financial aid takes time, but he just dropped this bombshell on his daughter and she may have to drop out of her semester. You threw a grenade on this relationship, your daughter will never trust you again. Hope it is worth it.", "yeah just a longtime much younger \"friend\", that he just happened to get with and knock up right after. hm.", "I agree. All the comments saying that the daughter only wants OP to pay for everything are seriously overlooking WHY she cut him off initially.", "it is NEVER a parents obligation to pay for college. that’s a major luxury and if she isn’t even speaking to him, why would he pay it? his daughter is the one throwing a tantrum by blocking her dad rather than communicating like an adult. her mom is a cheater and she still speaks to her, why should he get the silent treatment?", "Yeah OP’s daughter will no doubt be absent from his death bed, as will his young wife if the money runs dry and someone her own age takes interest \n\nOP is kidding himself if he thinks someone who hasn’t even hit thirty is going to be changing his diapers in ten years", "How you gonna warn someone who's made themselves inaccessible? Don't bite the hand that feeds.", "I was with you until that last part.   Prior to that IMO it was spot on.     \n\n\nHowever, it isn't his resources now, it is their resources, and they have a young child who absolutely is their dependent, unlike the daughter who is legally an adult.  \n\n\nOf course your wife gets a say in how you spend your collective resources.", "OP is under no obligation to pay her tuition. hes not \"holding it over her head\"", "How did he replace her mother? OP's wife cheated on him.", "Stepdaughter, who wants nothing to do with OP aside from his money, from the sound of things, although I got the strong sense that OP wished the relationship was better again.\n\nETA: If it’s not a “step-“ relationship, I just don’t understand the “her only daughter but we have two sons…” part.", "That’s hardly nuking her future she could get a job and pay her way or get a student loan.", "How is the math not adding up? He found out his wife was cheating 2 years ago and divorced a year ago.", "And the fact that OP didn’t make this decision, it was made with his friend.", "No he's not", "Where does it say shes not his daughter? I’m confused", "It is not his biological daughter? Now it is all making much more sense. Excuse to not pay sounds more fitting, and she gave him the excuse", "If the child in question has cut off their parent then they shouldn't be expecting their parent to bankroll their life. She was straight up going to refuse to talk to OP to even try to come to an compromise and only talked to him because she needed money. She's treating OP like an ATM. It's not that she CAN'T talk to him it's that she's REFUSING to.", "*19", "NTA\n\nI disagree, OP left all communication channels open and tried to reach his daughter many times by asking his sons and other family members. The daughter was the one stupid enough to go no contact without a proper conversation / explanation. \n\nThe communication is still open on OP's side, she is the one who refuses to make any effort. A relationship is a 2-ways streets, if the other party doesn't even want to talk to you while you are actively trying to reach them then they can go F themselves. \n\nUniversity is a choice, not a free ride. There are plenty of ways to pay for it ( loans, part-time job, etc ) . It's part of the adult life, if daughter wants to behave like a c-word, then she should face the consequences of such actions.", "The man has hardly moved to the others side of the planet. If one of my children was hurting as this girl clearly is I wouldn't cut her off because she won't answer the phone! I'd be on her doorstep with my arms open wide. I really don't understand how cold hearted a lot of reddit people can be.", "That’s exactly right, thank you. I honestly feel like a stalker by doing everything I’m doing, and I hate that", "You’re right, I definitely regret involving my sons too much into a mess that they have nothing to do with", "You two got divorced when she was 17, wasn’t there a custody arrangement? How often do you visit her at school? What’s your coparenting arrangement with her mom? \n\nYou’re her father. You’re acting like a victim.", "He said he'd asked his sons to get the daughter to talk to them. He could have told the sons or ex that this was his plan, and for her to get in contact.", "Mail. Envelopes work.", "I would think he could easily have contacted his daughter through her mother (his ex, as he claims to still be \"cordial\" with her). Every time he responds to questions about this though, he claims he's tried to contact her every in every way, yet he NEVER once mentions trying to contact her through her mother? Seems odd.", "Writing a letter still is an acceptable form of communication, even in 2023", "Not if he's been promising to pay for college for his daughters whole life, and she has a college fund that was part of that.", "The new wife doesn’t get a say in things he discussed with his kids before they got together.", "No, unless they are having serious financial hardships, which OP does not remotely mention or allude to...  a new spouse does not get to say \"Hey, I think you should go back on the promise you have made to the children from your previous marriage, now that I just had a baby!\"\n\nIf she thinks OP is spending money irresponsibly, the time to have that conversation is before they get married.  No sane step-parent thinks it's a good idea to cut educational funding unless it's absolutely necessary because someone lost a job, or otherwise had a financial setback that wasn't a choice they made (like having another child).\n\nOP does not say they planned to have this child, it's clear the baby was an \"accident\".  If OP doesn't understand why his daughter has feelings about him having a baby with a woman who is closer in age to her than her father, than let's just say, I can understand why she might have decided to stop talking to him.  He comes off as utterly clueless in his own post.", "Not when it comes to his existing kids.", "The new wife has joined a programme already in progress I’m afraid. She can’t change things financially for his older children just because she’s come on the scene. You can’t just push other children aside when you birth your own.", "It doesn't sound like it's a decision about family finances, so much as it's an attempt to punish her for being angry. He says in the post that they plan to stop paying *because* she hasn't been going to family functions.", "Ethically no. He ethically has a responsibility to his children from his previous marriage and that responsibility is not Stacy’s business.", "So, their are these things called college funds. You set money aside in them with specific intent of them being used for college and may face steep penalities and to get the money out for non-college use.\n\nIf, say, the money was in one or had previously been set aside to be used for college the wife doesn't get a say.\n\n> And how does he mention it to his daughter, if she blocks him off?\n\nGiven that she allegedly blocked all contact in December but he was still talking to her this January I'm going out on a limb and saying OP is not a reliable narrator.", "Not concerning his children from before her no. He still has an obligation to them as a parent despite any callings out with them, and that is not Stacy’s business.", "Her getting knocked up doesn’t mean she gets a say in things he already discussed with his kids before she was in the picture.", ">some of the money going to his daughter’s college tuition could be from her.\n\nI agree with your second paragraph...  this isn't so much who's the AH, as what type of relationship does OP want with his daughter, because while she might get over him having a child with a woman who's closer in age to her than her father, she's not going to get over him cutting funding he had previous promised her.\n\nHowever I disagree with their having co-mingled finances being a factor.  If they are co-mingling their finances, the money that goes towards the daughter's schooling should have been discussed BEFORE they got married and co-mingled.  OP is presenting this decision as being based solely on his feelings towards his daughter.  If his new wife is supporting the money being cut off for some other reason (like they are co-mingling finances, and she doesn't want her money going towards that), than she's the AH for not talking about this BEFORE she set up the very situation that she doesn't agree with.\n\nI see no problem with him discussing his feelings about his daughter with his new wife, but she shouldn't be swaying his opinion on what he does with the money he already promised his daughter.  If she married him and combined finances, knowing he was paying out this money, but not agreeing with it, then waiting till they're married to try to talk him out of it, that's super problematic, manipulative, and AH behavior.", "lmao, not from pre-divorce made agreements. If the state mandated that this man pays, young wife has absolutely no say in this (thank god, I've never met a step mother who liked that their husband contributed to his first family)", "Even if she wasn't actusly saying that i can see a stituation allong the lines of \"I only cheated because the relationship was already dead.\" \"see the how quickly he moved on, with a new women? Its proof that even though I cheated first 'he would have' If he had had the opotunity.\"  Style of its not my fault its his fault style of blame shifting, which when their the only side of the 'debate' it can lead to you siding with them.", "Doesn't specify, but I hope OP puts it in a separate account that can only be accessed by him.", "Not nearly as messed up as treating your own father & source of funding like you hate him just because he has found a new love after being cheated on.\n\nNTA.", "Cutting someone off means you should not expect support from them. Either you are cut off or not. Maybe the daughter can learn to talk things out instead of just ignoring the problems.", "She stopped speaking to him in January, he paid for her Spring semester. Now he’s not paying for her Fall.\n\nI’d say a full semester is more than just “a few months,” and based off of his post it seems she was going to continue to ignore him. She only reached out because he stopped paying. \n\nThat is the definition of seeing someone as an ATM.", "It’s been half a year. That’s stretching “a few months” paper thin", "Don't forget to mention he's already tried to reach out through others", "He’s amicable with the mother. He said it above.\n\n“Hey Bertha. Have to talk to daughter about next semester’s tuition. Have her call me back.”\n\nNot that hard.", "Talk to her mother or brothers", "I want more info on that. Is it socal media or also phone what is evrething?", "Redditors like to play the brain development card when it’s convenient. Mainly to object to any sort of personal responsibility on the part of the person they are defending.", "Did you not read the part where he said he’s amicable with his ex?", "Through his ex-wife or his sons.", "If she maintained communication with him, she would have known that this isn't the case. But she is acting like he is not her father anymore, and he is responding accordingly.", "Seeing as the daughter doesn't want anything to do with OP anymore, I don't think she deserves to feel that way. She's the one disowning OP, not the other way around.", "Why should this man just continuously pay the tuition of a grown adult that won't speak to him? Love is a 2 way street.", "How canhe be haunted by someone who won't talk to him? She's needs to talk to him as an adult or be punished like a child. \n\nPlay stupid games win stupid prizes.", "He is trying to force her to have affection for his family by cutting off the tuition. And why is Stacy coming into the discussion? It should be between OP and the daughter. He took the commitment to pay for her education and he should complete that obligation and not leave her hanging in the middle. Post her education, his responsibility is ended and he can choose to have nothing with her.", "She's not the first kid to pay tuition on her own. Her relationship with OP is dead though.", "Where are you getting that the daughter is upset about not getting money? That is not how the sequence of events went.", "I think you may be a bit out of touch thinking that 19 year olds are mostly able to easily pay their own tuition.  \n\n\nThis is not as easy as it used to be.", "Are you Stacy?", "You’re always your children’s parent no matter how old they are. Paying her tuition would tell her that he loves her unconditionally, as he should. This bullshit tells her he only loves her if she behaves the way he wants her to. It’s just going to reinforce how she already feels, which is probably along the lines of ‘you replaced mom with a new wife, and now you’re replacing me with a new child’.. If he wants a relationship with her in the future, he needs to pony up to let her know he’ll always be there for her.", "She was upset **before -** and probably because Daddy only needed a couple of months to replace her Mom and start a new family. And now Daddy acts like a kid rather than a father. Just ridiculous.", "She was upset before money was an issue. Dad fucked around with a person 15 years his junior, and 11 years senior of his daughter. He has kids that are old enough to start having their own kids. Many people find that disgusting, myself included.  If he has financial obligations created via a divorce settlement, then he is required to pay them whether or not youngwife agrees.", "His ex wife, daughter’s mother, doesn’t have him blocked. He said above they’re amicable.", "How can he inform her if she’s blocked him?\n\nNTA", "INFO: How are you responsible for paying one and not both or all. Decrease don't usually bias one child over the other even when it comes to paying half of anything.  You do realize if you are partially responsible for your daughter's education your x can take you to court for it.", "Why? Because she was 18? Or is she legally your step-daughter?", "I don’t believe you did anything wrong. Your daughter is just mad and being childish. Congratulations on the baby!", "Daughter is 19 and has another parent, refuses to even see the father, is only mad once the money stops.", "OP’s daughter is still his child just as much as she’s the “child of his ex.”", "She isn't the \"child of his ex,\" she is HIS child equally. Usually you go NC with someone close because they have hurt you in some serious way. If they had a fine relationship before then something major would definitely have set this off. She also probably assumed her dad wouldn't discard promises he made to her as her father to help her get a college education. He should have kept paying and finished the 4 years at the very least. Sounds like he isn't one who sticks to his word. Whether new wife and baby is there or not, they don't negate his role as a father. Him saying new wife asked her to cut off tuition or reduce it is him using this new family as an excuse to ditch his daughter when their relationship is going through a rough patch. Screw him. YTA, op.", "She should have some say, but unless this causes a large financial burden on them, she should stay out of this one. This is his child, who she has no relationship with, and who she knows doesn’t like her. Involving her in the decision-making, while not inherently wrong, muddies the whole situation and brings in questions about her motivations. Best not to make things messier.", "Sounds like the daughter has a fantastic reason for giving him the cold shoulder, and he just proved her right. \n\nHe has a brand new family, and is try to “eject” his old one, all because of the divorce.", "What I think is this guy seems completely clueless about how his daughter feels about the major life changes their family has undergone in the last couple of years, and has made little effort to find out. She's acting how one would expect a teenager to act around her recently divorced father with a girlfriend closer in age to her than her father.\n\nAnd he's acting like he can force his daughter to take all of the emotional responsibility in their relationship by exercising his financial power over her. If that isn't asshole behavior, I don't know what is.", "By the time I was 19 I’d lived in 3 countries and had half a dozen jobs, and had no financial support for a couple years. I still spoke to my family without expecting them to fund me.\nNTA, OP’s daughter went no contact (as often demanded by so many on here) so gets no cash.", "Agreed 10000% here. It’s shocking how much people can’t read here.\n\nIf she wants to go no contact with someone, that’s on her and she most likely didn’t even put into consideration of the fact that stepdaddy was paying tuition until he turned it off. Now she’s likely mad because she realized she fucked up and instead of acting like an adult and come to negotiate terms with him (which would mean she would have to go back into contact with him), she continued to stop talking to him. The 19 year old can get fucked. Tell her to grow up and have an adult conversation or deal with the consequences of no more college funding.", "This", "He didn’t say it had been 2 years since she blocked him.", "So you think 45 should be as mature as 19?", "Nineteen-year-olds, famous for making mature and responsible decisions,", "And he's 45? She's literally still a teenager.", "Lol", "So they've more than a half-decade until their brain finishes fully developing, yet you'd split responsibility equally between child and the parent that chose to suffer this world onto them. *Dunning-Kruger in effect, ladies and gentlemen.* I'd weep for any children yours, but I'm sure they'd have tears enough their own for your failures.\n\nOP isn't worth the meat that makes their being.", "Yes, still a teenager.", "She's his daughter. One would hope he loves her even if she's on the outs with him. If he always planned to help her financially through college I don't see why he wouldn't want to continue to do so. My parents couldn't afford to help me but nothing would have made them happier if they could have.", "Why is your new wide involved in financial decisions regarding your daughter? That is such an egregious overstep.", "You haven't tried very hard. You didn't even bother to warn her of the stop in tuition. You're using her emotional response to this upheaval of her life as an excuse for your own abysmal behavior. The difference is that you're a full-fledged adult, and she's your barely-adult kid in college.", "YTA. You can create a new email address through a wide selection of free email accounts and at least email her before you cut her off because you're mad she isn't accepting your new wife and the oh so convenient new baby.", "Have you moved to the other side of the planet or something?", "Damn, your country must have a really low life expectancy if it's normal for 55 year olds to be incontinent and incapable of changing themselves. (Also Stacy is 31, so maybe you commented on the wrong post?)", "Why are so many people in this thread convinced that there was absolutely no way for him to contact his daughter? He could have informed her through his ex-wife or other members of the family at the least.", "Well thats up for debate on second marriages. Personally? I do believe in combined finances & decision-making. But this would be an exception. Its not her child & she hasn’t even been in the picture long enough. This really falls on his shoulders to make the decision. Asking for input from her is actually unfair to her because she’s damned if she says cut the funding (going against daughter) and she’s enabling bad behaviour by saying to keep supporting her. \n\nIf it were me, and my spouse came to me with the same problem, I would say I’ll support whatever decision you think is best. And leave it at that. \n\nOP should’ve done more to resolve this prior to it reaching this point though", "she was her only daughter while we had two younger sons\n\nThis is what I get from this", "I think there is just some weird wording in his post where he says, \"she was her only daughter while we had two sons.\"", "She is seriously hurting here. She probably wants her family back, her dad back, the person she thought her mom was back. Sorry you are wrong. The parent always manages the relationship with the kid. And if it’s always been understood that he will pay for school and if historically he does then he’s now trying to financially manipulate her.", "If you ever want a relationship with her don’t cut off her tuition. She will permanently cut you out and you will have a really low chance of regaining any relationship with her. It’s not about buying her love. It’s about supporting her. Understanding she is going through one of the hardest things in her life. She still needs to grow up and become emotionally mature. Sure. She is handling this terribly. She’s the kid. You be the adult. Hold this door open or it might close forever.", "You came to AITA for judgement but you’re not accepting the judgements people are given unless they validate you and say you aren’t TA, what’s the point of posting? YTA", "We divorced when she was 18. No custody agreement for her.", "BS\n\nThe daughter is an adult and went NC (as reddit loves to suggest). This is a consequence of NC. NTA", "You are more than an ATM. Perhaps she should try talking to her father if she needs his assistance rather than blindly siding with her adulterous mother. She could come to the table because she can't pay her tuition.", "She’s not owed that, she made an adult decision that had adult consequences.\n\nGood enough to take daddy’s money but not good enough to pick up his calls?", "Or maybe if you go NC with someone you have the brain to realize they might not pay your bills anymore.", "Maybe he could send it certified with a required signature to ensure he isn’t listed as the AH", "I don't understand why people forget that mail exists.", "He didn’t say there was a college fund. He said it was part of his yearly budget, which clearly indicates it isn’t.", "Well if you go AWOL and don’t talk to your dad you shouldn’t really expect him to keep up with that promise.", "Or if it's part of the divorce decree that he pays for the childrens' college.", "Where is evidence of any college fund?  Have you ever been married?", ">The new wife doesn’t get a say\n\nMarriage doesn't work that way.\n\nNot if you want it to work.", "Unless the money is coming out of an account that is in the daughter’s name, then yes OP’s wife absolutely gets a say in how their money is spent", "Yes she does if it affects their finances", "Never get married", "His wife gets a say in whatever he lets her have a say in. He didn't make that boundary so neither should you for him.", "They're marries.  When yiur finances are linked like that then yes you do have a say.", "Don’t get married", "And when a child ghosts their parent for six months they shouldn’t be expecting the parent to pay for college.", "Knocked up? They're married and had a kid. She definitely gets a say in their finances.", "Are you the daughter? Lol", "Huh?", "Reddit is all about \"Cut them off, they're narcissists!\" because they're not the one's shooting themselves in the foot financially from that decision.  \n\nShe expected that she'd have no negative effects from her decision to stop talking to her dad because he hooked up with a woman in her thirties (and come on people, I understand why people get uptight when some creep is dating a 21yr old masseuse who is also his daughter's best friend, but 31 and 45? get real) after her mom had an affair.  \n\nShe doesn't have to talk to her dad anymore, but it's odd that cutting him off for his sins doesn't extend to his bank account.", "ah yes, the 19 year old is not handling her father's remarriage maturely and hasn't spoken to her father in 6 months. better force her into thousands worth of debt so she can finish her degree, this will surely help resolve things.", "a full semester is quite literally a few months. it's 6 months. \n\nthis doesnt answer any questions. did he get her counseling ? for the divorce? remarriage? how did the introduction to his new wife go? all of this is entirely too vague.\n\nThe girl is 19, and while she may be immature. He's cutting her school funding and forcing her into thousands worth of debt. that won't help things, so has he given up?", "And when she refuses to call back?", "Damn dude, i guess in his multiple attempts to reach out he never though to send a person with a message. Totally no bad faith commenting here", "He already tried to reach the daughter through the brothers (per a comment below,  wasn’t in the main post)", "Good for him?  Maybe cheating mom can pay her tuition.", "No, she cut him off so he simply reciprocated, pretending going NC is consequence free is simply daft", "She killed it", "He doesn’t care, he cares only about the new family.", "She fucked around and found out. She shouldn’t of behaved like a 5 year and ignored him, then blocked him so he couldn’t even get ahold of her. Now that she doesn’t have a free ride, she realized she fucked up and is now trying to do damage control. FUCK THAT", "You don’t have to be the stepmom to see her side", "But it was perfectly fine for mommy to cheat on daddy while they were married? JFC.", "Replace the mom who cheated on him?", "She’s in contact with her brothers and they could’ve passed the message along. Not ideal, but possible.", "Send it writing, signature required/return receipt requested? If she fails to open it, she's terminally stupid. (Hell, it could be Dad sending a check directly to her because she refuses to communicate and thus he has no way of knowing how much her tuition is next term or even if she plans to attend.)", "Reread the post. She went no contact before he was going to stop paying tuition.", "The money only stopped after the daughter went NC, though.", "And she basically cut him out of her life. Seems like she only wants him when it benefits her.", "I’m willing to bet that college tuition is a financial burden.", "Yet she gets to ignore him for two years and be emotionally abusive to the father and never bother explaining, but he is supposed to hunt her down and give her a heads up that her shitty behavior will cause him to stop paying her tuition?\n\nI’m gunna be honest, I see a lot of attacks on this man…and I think it has nothing to do with the daughter for real, and everything to do with he is with a younger woman.  That’s honestly how it comes across to the average reader.  And I say this as a gay man who thinks women are far superior to men in nearly every metric.", "I think they're speculating the length of the daughter's college.", "Those immature decisions still have consequences.", "But also an adult that is allowed to make the decision to cut off her parent. Along with all the consequences that has", "She's still responsible for her own decisions. She chose not to speak to the person that is giving her $50,000+ a year for 6 months because he chose to move on after his _exwife cheated on him._ Doesn't matter if your age ends with \"teen\" if you're old enough to decide you don't want to speak to your father anymore because he did something most adults do at some point, you're damn old enough to deal with the consequences of that. Plenty of 19 year olds don't get to have their college paid for, she can be an adult and either get over her stupid problems with her father expanding his family and reach out and try to repair the relationship or figure out how to fund her life choices without an ATM.", ">So they've more than a half-decade until their brain finishes fully developing,\n\nIf you mean 6 years(generally) then say that. Your phrasing is deliberate obfuscation to make it sound more than it is.\n\n>yet you'd split responsibility equally between child and the parent that chose to suffer this world onto them.\n\n19 isn't a child. It's an adult and should be treated as such, once again your phrasing is designed to confuse the point and make it sound worse than it is.\n\n>Dunning-Kruger in effect, ladies and gentlemen.\n\nHow? Nothing they said would fit the criteria for DK effect.\n\n>I'd weep for any children yours, but I'm sure they'd have tears enough their own for your failures.\n\nWtf does that even mean?", "So if you marry someone you shouldn’t be involved in any decision making…because they had a family prior?  There are some unstable people on this thread.", "It doesn't sound like it was his new wife's idea. More like he was whining to her in a face-to-face version of this Reddit post, and she told her new fiance/baby daddy that he should do what he thinks is best.", "You do realize I’ve used other phone numbers and other social media to try and contact her?", "So you've been divorced for a year and in one year you've introduced your new girlfriend (closer in age to your daughter than to you), you've gotten engaged and you're now expecting a child. I don't know but this may be a bit much to process in a year or less. \n\nIf you care about your relationship with your child (19 is basically a child) then don't let your new partner influence your decision making when it comes to your other children.", "Regardless of the legalities of her age, in a world where higher education demands significant financial costs after which additional time is needed to build a career amounting to long-term high-income potential, *at what point did you consider your obligation to her future and success as a stable adult,* and is your decided obligation to her compatible with suddenly blocking her tuition, which has dire consequences on housing, classes, and academic standing?\n\nYou may not like your daughter’s behavior but it’s a manifestation of a deeper problem within the happiness of her childhood, your raising of her, and this fresh BS piled on top of it. She doesn’t have the benefit of completed education and a high, solid income. Wtf dude, this is why parents are outliving their kids in this day and age", "Doesn’t mean college tuition wasn’t addressed or there is a state law on tuition responsibility", "So you've gotten a woman pregnant and married her in about a year (if that)...and you wonder why your daughter is upset?\n\nI don't understand how you can't see that.", "They always say people have free will to do as they please with their money until it is inconvenient.\n\nSometimes you get good advice on here and sometimes the top comment is absolute nonsense.\n\nThe grown adult blocked him, yet, this commenter wants him contacting everyone to warn her that he is not paying her tuition.\n\nThe dad is not good enough for a conversation but he is good enough to be an ATM. Make it make sense, please.", "LOL this dude really said “mail” in 2023. Unbelievable", "Because its slow, and somewhat an obnoxious affair to deal with.", "He was paying her tuition before marriage so that should be coming out of his finances, not hers or shared.", "Wasn’t planning on it babe x", "Sure seems like it to me. They're on this thread just trying their hardest to crucify the OP", "Seems like it", "It’s a privilege to have your college paid for and isn’t the reality for most people. Severing ties with the person funding your own responsibility should be expected to absolve that privilege", "1) 6 months isn't a few months. It's literally half a year. \n2) a semester isn't 6 months. Did you not go to college?", "This can't be be all on OP, you keep pushing this all onto him. The daughter is 19 and while not what I would call a mature adult at the age, still has some responsibility here!\n\nYou don't get to cut people out of your life and still receive funding/support from them. If you quit a job they don't pay you for the months you may have worked before you quit.", "Yo, everyone I know got into debt going to uni. It's not a given that parents can afford to give their kids a debt-free lifestyle. And even if they can, should they? Sounds like his daughter knows the cost of everything yet the value of nothing.", "You cannot \"get counseling\" for a legally competent adult. You can suggest and offer to fund counseling and that's it.\n\n(Well, I suppose if someone is financially dependent, you could make counseling a condition for that support to continue, but it's unlikely to be productive or have a positive effect on the relationship.)", "Cheating mom relays the message.", "She’s 19 and hurting.", "This is typical of teenagers today. Maybe he can stop paying her cell phone for this, but college tuition? He’s an asshole.", "No one says that’s ok.", "He stated in a comment and in an edit on the post he tried to make contact through the brothers and mutual friends with no success", "Probably is, but we don’t know how well-off OP is and how much of the tuition OP actually pays (likely not 100% unless she goes to community college). Unless it causes them actual issues, she should stay out of it.", "Have you tried telling your ex - your daughter's mother - to let her know what you are doing?", "Were any of those messages \"I am going to stop paying for your education\"?", "So then OK to pretty much destroy her life? Because she is going to have to drop out & was probably already severely depressed. She obviously DID love you or she would not have had any issues. YTA for sure", "Why does your new wife get a say about you paying for your daughters college? Your daughter is allowed to be upset about your \"accidental\" pregnancy and quickie marriage. You need to be the parent and keep reaching out to her. Your new wife should have never had the power to suggest stopping paying for your daughters college. That's something you discuss with your daughter, and your daughter only. Keep reaching out to her.", "Yeah that stuck out to me, too. Also, per OP, child is now born.", "Child in this case, a grown ass woman", "Let's pretend, for the sake of avoiding tangents, that OP knows whether he agreed to pay all of his children's college tuition as part of a their divorce decree.", "I mean, the daughter isn't upset at her mom who cheated on her dad, which is what LED to the divorce. She is only mad at her dad who moved on AFTER the divorce.", "How long should I have waited?", "Your daughter thinks it's wrong that you're content. She is an adult as well, so there is no incentive to give her anything if she won't talk to you. You haven't done anything wrong in my opinion.", "Exactly! She wants nothing to do with him but wants something from him? The world doesn't work that way. If he'd told someone else the headache could've got distorted down the line. Plus at that point, it would've been an ultimatum. The daughter made her bed when she blocked OP", "Pretty sure that's their decision to make.", "I stayed silent and prayed my abusive, awful father wouldn’t stop paying my rent when I was in college. My mom had already picked up the slack for the tuition he dropped. She was abusive and guilting me about it in her own way. I was trapped. Privileged to have a lot of financial help for my college, but trapped, abused, and unwell. I was 19 also, and it is absolute BS to have to be the adult in the room full of your own parents who fucked you up throughout your life and now depend on you to be the mature one. Absolute fucking BS.\n\nI’m not saying OPs daughter is in this boat, but I am saying that if anything toxic is at play in this obviously toxic situation regarding this new pregnant wife, and dad having a pattern of using money to fix problems instead of addressing the root cause, then I empathize more with the daughter. Even if she’s entitled and privileged, taking advantage of her father, he is still the one with the upper hand in this… she is an adult freely testing the situation, but he is also an adult so he needs to respond accordingly. We don’t know the ultimate fairness of this if we don’t know the full story.", "It would depend on where you went to college. Here the academic year is divided into two semesters (each comprised of two terms) of six months.", "So he should just let her behave like an asshole and work around her attitude? Nah", "Have you ever been married? His wife is the ONLY other person who gets a say in his financial situation.", "She’s perfectly fine cutting off the dad who gets a new wife but not the mom who destroyed the marriage??? Lots of people overlooking that one", "Most people don’t though as they fail to realize that if silent in the document some states have statutes that say they have to pay as the child is disadvantaged coming from a broken home", "Longer than you did. But since you didn’t you could simply just try being a bit more sympathetic to why your daughter is struggling and not just cut off her tuition without warning (and you definitely shouldn’t let your wife have a say in that).", "I think it would be beneficial to look at it from her perspective. It’s dumb to imply you were being unfaithful, but she could genuinely feel that way. She could feel abandoned and like you’re moving on too quickly. Those are valid feelings for her to have. She has gone nuclear, that’s true, but she is your daughter. If you want the possibility of a relationship in the future, the cord shouldn’t have been pulled like it was. It’s okay for you to make that decision, but doing it directly after the new baby was born sends her a very clear message that you seem to be missing regarding the timing of this all. \n\nYou’re not a bad person, but the decisions you’ve made (and your ex-wife because I assume your divorce is at least kind of related to the infidelity you mentioned below) are the direct cause for you daughters emotions. You have a responsibility as her father, children with reasonable emotions and fears should come before spouses. Your child didn’t choose their life and if you want to repair the relationship, what you did made it nearly impossible.", "I mean, half a year for marriage and a pregnancy is *rushed* no matter the circumstances.\n\n\nWhen you have kids that are still dependent on you? Like, 15× more so.", "You should have known that the second you and her mother separated, you should have castrated yourself and lived a life of celibacy, so as to not upset the apple cart and keep your adult daughter on the pedestal she put herself on. \n\nYou awful person, you!\n\nLook, obviously I am kidding but she does not appear to be interested in having a father anymore. Why? Who knows? And your attempts to reach out were slapped away. \n\nCongrats on the new baby, BTW", "Long enough for her to grieve and process that the family she's known has broken. It's been like a year, and you're already married to a much younger woman and have a new baby. Are you seriously scratching your head over why she's upset? Come on.\n\nExpecting a teenager to just be completely fine with your new rebound family isn't going to happen.", "Considering you were already with someone \"a couple months\" after your divorce with a \"friend\" who \"supported you the whole time\", it honestly sounds like your wife was not the only one having an affair.", "You know it’s smells like you were cheating on her mom if somehow in a year you managed to get married and get your new wife pregnant. I mean that’s what it sounds like to me. One year and now your married again. I’d be mad at you to.", "Until all of your kids from your original family were ready for you to have a do-over family.", "She's not being the adult though, she's actively taking offence on behalf of her mother who was divorced for having an affair.", "When you'll do something major like that, yes. You'll talk to the ex or ask your other kids. He is an AH for not giving a warning, hell even for the not paying if he promised to do it initially.", "Wasn’t the mom cheating first? This isn’t even cheating.", "Upset is not the same thing as breaking all contact.   She can be upset.  But if she ghosts him and only contacts him when she wants his money that's not appropriate.", "She's allowed to be upset.  \n\nBut she can't expect the person paying her life expenses to keep doing so if she's cutting them off.", "Are you really trying to gatekeep how someone should go about living their life happily?  Wtf is wrong with you people.  Y’all are demented.", "Are you accusing me of an affair based on a reddit post? Jesus, I was the faithful one in our relationship.", "This is a terrible comment. Just because a friend became something more doesn't mean there was something else happening. Bad bad bad assumption.", "What’s with this sub and holding parents to insane standards", "In some families, that might mean after their mother dies, if then.", "So? The daughter could be angry at both the mother and OP for all we know (OP is blocked, so he doesn't), it's not a competition on who is \"worse\" here.", "It doesn’t matter if it’s “better” than cheating if the daughter now feels left behind by BOTH parents", "You love your kid, you do exactly that. You wait it out and do what you can to give them the chance at a good life.", "I'm saying that its complicated and is clear daughter has valid reason to be having intense feelings at her parents imploded marriage and her dad's new marriage. \n\nYou can go about living your life however you want, but you're going to have to accept that it might impact your relationship with your kids.", "This is reddit 2023....", "I'm suspecting that you're not being very honest in your description of circumstances, because the timeline is funky and you're leaving out important details.\n\nYou described your wife's affair as an emotional one, with a kiss. So she got close to another man and eventually kissed him. But YOU said your friend Stacy \"was there for you the whole time\". The whole time what? At what point exactly did she start \"being there for you\"? After you found out your wife kissed someone else? You were good friends before that and just relied on her after?\n\nThis whole process has happened within 2 years and you already are remarried with another child. How did you meet Stacy? How did you, as a 43 year old married man with children, become good enough friends with a 29 year old woman for her to \"be there through it all\" in the first place?", "But you were obviously checked out of it, if you were able to move on so quickly or is your new, younger wife a rebound? \n\nYou've basically replaced your entire family and are asking your teenage daughter who is not done emotionally developing to be able to accept it without any issues or push back. Oh oh oh not only that but you're punishing because she won't talk to you after you've married someone 14 years younger than you and 11 years older than her?\n\nAre you really that dense? Are you really that bad of a father that you can't see your mistakes?\n\nYTA and failing of being a father. I feel bad for the little one that you get to raise next If you can't acknowledge the mistakes you're making now.", "Why was an almost-50-year-old married man good enough friends with a 28-year-old that he just happened to marry and impregnate immediately after his divorce? Come on OP \nAnd the fact you’re involving her in your financial decisions regarding your daughter, who is rightfully suspicious of this situation, is really leading me to believe that she won’t be visiting you on your death bed \n\nYTA", "Except that he said his ex-wife had an EMOTIONAL affair. And usually it's not someone 15 years younger and someone attracted to you/you attracted to them being your emotional support through a divorce.\n\nWhat exactly is the difference between an emotional affair and a \"good friend supporting you through it all\" (that you ended up having a kid with within the year) here? Obviously you can't answer that, it's a question for OP.", "Lots of young people in here who don't understand nuance", "Love your kid, don’t be a doormat. You’re not entitled to unlimited help and STILL get to act however you want\n\nBig girl made her choice. If anything OP failed her in passing on critical thinking skills. Most people know not to expect financial help after completely cutting someone off but she’s somehow shocked that this was the result??", "Did you pull a muscle with that reach?", "Holy shit, I was 44 and she was 30 when we first started anything other than being friends. You’re exaggerating both of our ages to prove a weird point. Why are you doing this?", "Wow you are trying to skew things. I assume you were cheated on and trying to make yourself feel better."]}