{"id": 19553, "submission_id": "146yr7m", "title": "AITA for refusing to change my natural hair for my friends wedding?", "selftext": "I’m 21F and mixed race. I have 4B type hair which is usually put into braids (most likely goddess box braids). My friend (25F) is white with pin straight hair. We are close family friends, but don’t really talk much as we have our own lives, but are still on good terms. She messaged me a couple months back that she was having a wedding and invited me to be one of her bridesmaids. Of course, I said yes and was added to a groupchat with all her bridesmaids. All white. I didn’t really think anything of it, of course. As soon as I was added, a girl asked me “Oh, is that you in your profile picture?” (a picture of me, a woc). I said yes, and the girl immediately asked the bride to dm her. As this groupchat went on, all the girls were very.. off with me. The bride later began becoming off with me too, but I didn’t mention anything. \n\nA week went past since I was added, and we were discussing the hair and makeup. One of the bridesmaids said.\n“On that matter, @myname, won’t you have to like get your hair straight permed or something? I don’t know how your hair works.”\nI replied, “No, I’ll just get my braids freshly done. Why do you ask?”\n“Well, we all have straight hair and we just don’t want hair like yours ruining the theme of clean hair.”\n‘Clean hair??’ I thought. I held back my thoughts and just remembered I don’t know these girls and they’re probably just misunderstanding of black features (bride and bridesmaids grew up in a white dominated town). I politely replied telling her braids are just as clean as straight hair, and getting a silk press would damage my hair. The bridesmaid just reacted to my message with a “😬”. The bride called me a couple minutes after and asked me if I could just get a silk press so my hair didn’t ‘ruin the theme’. I replied with “😂😂 Ruin the theme? My hair will be damaged from getting a silk press. I’ll make sure my braids are neat, trust me girl.” She angrily replied, “Well, until you fix your hair, you’re not welcome at my wedding.”\nI’ve still refused to get a silk press, and she’s removed me from her invite list. My family who knew her (white) told me I should just get my hair done to stop the hassle. But my boyfriend and friends told me she’s at fault. AITA?\n\n\nEDIT: I did some deep diving and found out many of the bridesmaids have links to a Neo Nazi club, and that the bride has links to a KKK ‘comeback’ club. Thank god I’m not invited to that wedding. PS- thank you for your support and comments on this post. Ly 🫶🏽", "created_utc": 1686502121, "permalink": "/r/AmItheAsshole/comments/146yr7m/aita_for_refusing_to_change_my_natural_hair_for/", "score": 285, "replies": ["##[AITA for blocking your go-to time killer from June 12-14?](https://redd.it/145o4jz)\n\nWelcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) I refused to get a silk press for my hair to be straight like the other bridesmaids.\n2) This girl is a good family friend and I feel petty.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "WT actual F is a “clean hair” theme?!?! Be happy you’ve been uninvited. They sound like a bunch of massive racists and your better off staying far away from all of them.", "NTA - it's reasonable for a bride to ask for aspects of your appearance for a wedding, such as a colour theme or type of makeup. \n\nIt's not reasonable for her to ask you to make a permanent change that could be damaging in the long run. Imagine is brides demanded people get tattoos. It's not something you can change back easily or was out at the end of the day. \n\nHer reasoning is disgustingly racist and this woman is not your friend. Black hair is beautiful, don't change it for anyone.", "What an upsetting way to learn that a person you thought was a friend is a horrible racist. I'm sorry that happened, OP. NTA.", "NTA in the slightest. What exactly is the theme of her wedding, White Audacity? Jfc.", "NTA - As a white woman, I am totally pis**d off on your behalf. The bride & the other bridesmaids can go screw their “clean hair theme”. \n\nYou are not losing a friend, you are losing an A H and her friends. You hair is your hair and you don’t need to fix a damn thing, especially if it damages it. Be happy you are missing what sounds like an excruciating wedding.", "NTA - The Caucasity of all of them! Your hair doesn't need to be fixed, their brains do.", "NTA; the bride and her bridesmaids are racist", "NTA, she knew what kind of hair you had when she asked you to be bridesmaid but she's listening to her (racist sounding) friends.", "NTA don't go to the wedding anyway though, why would you spend a tonne of money on being a bridesmaid for a racist lady and her racist friends who are gonna treat you like shit before and during the wedding?", "NTA\n\nDump that racist woman, she's not your friend.", "This person is not your friend, and you are NTA.", "Listen, I'm not a POC so I'm not going to tell anyone what they should or should not do to survive a racist environment. All I'm saying is that, IMHO, the minute someone used the word \"clean\" to discuss something your hair was not, they jumped from clueless white person territory into bigot territory. NTA.", "Thats blatent racism, and i think you already know that.\n\nThe only thing asshole you did here was NOT going tf OFF. \n\nNta", "NTA - Sounds like the real theme of the wedding is white supremacist BS.", "NTA\n\nThis enrages me as a (white) mother to a Black daughter. My daughter actually gets a lot of questions and compliments about her hair as it's very, very tightly curled but incredibly soft due to her really taking a lot of time and care of her hair. Her hair when wet is far longer than her white friends hair and is much healthier. \n\nBut there have been times when others have wanted her to have her hair be more \"white\" and straighten it out using chemicals. I'm like, if you like my daughter and want her to be involved in your shit then knock off the racial crap. It's jealousy on their side due to my daughter getting so much positive attention about her hair and being the only one of color. In fact, my daughter has been considering getting little braids in the near future, and I'm all for it. \n\nThis mentality by white women that they have better hair needs to stop. OP, as you stated, you aren't great friends with these girls, and it doesn't sound like too big of a loss to not be a part of this wedding. But I'm sorry that you're getting told you're the AH about this when you certainly are not.", "NTA. Friends don't make you feel bad about your appearance. And those girls were racist, full stop.", "NTA. Those women are ignorant af, and your “friend” is not a friend.", "NTA i wouldve gone in on these girls 😮‍💨", "NTA. Girl, these are not your friends, and I'm shocked your family is ok with this.  Stay away from the bride and her friends, you don't need that energy.  Sit down with your family and explain the situation and why you will not do what is  being requested.  I'm sorry you are going thru this.", "WTF? NTA\n\nThat is racist and crazy to expect you to change your body to be a bridesmaid. I honestly wouldn't want to be around someone that toxic.", "NTA she’s racist not your friend", "I have 4b hair myself and it is a Hassel to deal with but getting a silk press would literally damage my hair so bad that it would look horrible for a wedding\n\nI understand her having rules it's her wedding but on the other hand you can't just tell people to mess up something they have spent years growing for one day and some pictures\n\nAnd tbh goddess braids are so pretty and would look amazing in wedding pictures\n\nAnd one more thing, they called your hair dirty.....🤨\nYes I know they are from a white dominated town but come on I know they not in that town now and I know they have seen other people of color and with that same hair, it just seems a little off to me\n\nBut overall Nta", "NTA.\n\nI really don't understand how people can expect others to change themselves to fit in with an aesthetic. Just don't invite these people to the wedding!\n\nOr better yet, love these people as exactly who they are, and have a blast marrying the person you love surrounded by the people you love and who love you.", "NTA. If it wasn't your braids, they'd complain that you stick out because of your skin tone. You would be better off not go to or be in this wedding. Don't set yourself on fire to keep other people warm.", "NTA, if the wanted hair on theme, they can buy some curlers. This girl is not your friend. Take the braids out, come to the wedding with your beautiful curls in an updo, with jeweled combs. Let everyone see how much more beautiful you are than the basic 🐝. My petty self would wear an African wedding dress, and sit front and center.", "I have never looked at a bunch of lank, straight hair on women and thought, “Ooh, a clean hair theme!” What the hell? NTA, OP, and bullet dodged", "Absolutely NTA\n\nCount your blessing that you're not a part of this idiot's wedding.  (Wondering how long it will actually last with attitudes like she has.)", "NTA. None of these people are your friends. Side note: I’m so ridiculously fucking sick of the increasingly insane requests people make of their wedding parties and guests.", "NTA. And you’re not friends with a racist anymore, so result.", "NTA. Ruining your hair for the sake of a wedding theme is not an okay ask. I would happily be removed from that toxic situation - you don't need to be around those racists.", "Post your story on TikTok or whatever. Expose your “friend”. It’s 2023 and a bridesmaid saying braids doesn’t equal clean hair! TF?! And they  are all agreeing that you need to confirm to their white standard of beauty to participate? What else will they be telling you to change ?\n\nNTA", "**Yikes**\n\n>My family who knew her (white) told me I should just get my hair done to stop the hassle.\n\nYou need to have a talk with them.", "NTA. The bride and bridesmaids are major assholes. I have heard that some people ask their bridesmaids to colour their hair etg.... Just NO. Its sad to lose someone you thought were a friend over bullshit like this, that's hurtful. But at least you now know she never really was someone you'd want to be friends with. I'm white as a sheet with classic curls and I too would be shocked if a bride asked me to straighten my hair.\n\nLike... The photos are meant to capture *the people that are there to celebrate the couple*. The people are not meant to be kicked into whatever small minded view the bride has of how the people she are close to should look to make her look good! I mean why not invite manakinds withso you're sure they're identical, showd no personality, no memorable facial features, the \"ideal\" weight and height, etc, instead of inviting real people if that's the look she's going for! I'm not going to understand how this is even something people want. I don't want a wedding; but if I did, I'd want photos with the people I love and their quirks to be visible as that are real memories of the real things I love about them.\n\nJust... No.", "Nta at all. This is going to sound so weird but I wish I had a friend that was a poc so I can ask my million and two questions about their hair. I have so many questions and I don’t want to seem rude so I never do. The only thing I really know is that straighten it damages it so much and it basically almost never recovers right? Why would someone want you to do that to your hair? It’s your hair, you have the right to not want to damage it lol", "I am so white I glow and my hair is so straight that when I tried to get a perm it went straight back to straight. I am flat out convinced that the universal problem that white people have with POC hair is that when it is healthy y’all can create sculptures that are beyond our wildest dreams. We have to add hair pieces wigs and a butt tote of product to even try. The volume, curl and height you have rolling out of bed is just plain unfair. \n\nWe as the superior race (I really need a sarcasm font!) had no choice but to run it down.  Really how dare nature give you better hair than us. \n\nAgain this is the opinion of one white woman and I am sure that there are plenty who will disagree with me. But trust me if you remove all the manure you will find at least a few seeds of jealousy in the “just straighten your hair” argument.", "NTA. I noticed in the beginning you said the bride was “having a wedding.“ I thought the phrasing was a bit odd but it might be 100% accurate. There’s a good chance she will be having additional weddings in the future, with her entitled attitude and horrible communication skills.  Tell your ex friend she needs to find another bridesmaid.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI’m 21F and mixed race. I have 4B type hair which is usually put into braids (most likely goddess box braids). My friend (25F) is white with pin straight hair. We are close family friends, but don’t really talk much as we have our own lives, but are still on good terms. She messaged me a couple months back that she was having a wedding and invited me to be one of her bridesmaids. Of course, I said yes and was added to a groupchat with all her bridesmaids. All white. I didn’t really think anything of it, of course. As soon as I was added, a girl asked me “Oh, is that you in your profile picture?” (a picture of me, a woc). I said yes, and the girl immediately asked the bride to dm her. As this groupchat went on, all the girls were very.. off with me. The bride later began becoming off with me too, but I didn’t mention anything. \n\nA week went past since I was added, and we were discussing the hair and makeup. One of the bridesmaids said.\n“On that matter, @myname, won’t you have to like get your hair straight permed or something? I don’t know how your hair works.”\nI replied, “No, I’ll just get my braids freshly done. Why do you ask?”\n“Well, we all have straight hair and we just don’t want hair like yours ruining the theme of clean hair.”\n‘Clean hair??’ I thought. I held back my thoughts and just remembered I don’t know these girls and they’re probably just misunderstanding of black features (bride and bridesmaids grew up in a white dominated town). I politely replied telling her braids are just as clean as straight hair, and getting a silk press would damage my hair. The bridesmaid just reacted to my message with a “😬”. The bride called me a couple minutes after and asked me if I could just get a silk press so my hair didn’t ‘ruin the theme’. I replied with “😂😂 Ruin the theme? My hair will be damaged from getting a silk press. I’ll make sure my braids are neat, trust me girl.” She angrily replied, “Well, until you fix your hair, you’re not welcome at my wedding.”\nI’ve still refused to get a silk press, and she’s removed me from her invite list. My family who knew her (white) told me I should just get my hair done to stop the hassle. But my boyfriend and friends told me she’s at fault. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA - Hell to tha no. I’m white and there is no way I would ever make you change your appearance for my wedding.", " NTA. \n\nThey’re low key mad because black girls own the hair game and they don’t want you upstaging anyone. \n\nFuck ‘em.", "NTA\n\nI would take screenshots of these evil messages and send them to all family on her side, alongside a basic definition of racism.\n\nAnd anyone who continues to side with them is also racist. Cut each and every one of them out.", "NTA,\nit sucks that you even have to ask cuz they’re blatantly racist. you shouldn’t have to get rid of your features to fit in. ur beautiful as u are", "NTA this girl is not your friend and she’s straight up racist. Just because you wear your hair in braids that doesn’t mean your hair isn’t clean. She knew what the hell you looked like when she invited you to be a bridesmaid. Don’t allow anyone to pressure you into doing something you don’t want to do. Fuck her and her wedding.", "NTA no one has a right to demand you do something that will ruin your hair.", "I hope you find something super fun to do that day that has nothing to do with these people bc 🤢🤯😦🤦🏾‍♀️🫠\n\nNTA", "This made my blood boil! NTA. Holy ish I don’t even know you and I want to roll up on them.", "Not once did they mention the potential damage,  those women are disgusting", "[removed]", "NTA\n\n&#x200B;\n\nDon't give in to these racist AHs.", "Wow. Just…wow. NTA and I hope you didn’t think for a second that you did anything wrong! There were seriously bad vibes from the moment they asked if that was *you* in your profile picture!", "The only thing you need to do here is drop out of the wedding, and find new friends. NTA.", "[removed]", ">I did some deep diving and found out many of the bridesmaids have links to a Neo Nazi club, and that the bride has links to a KKK ‘comeback’ club.\n\nHOLY CRAP you dodged a bullet there! \n\nNTA even before that update!", "NTA\n\nYour body your choice", "As a white woman who understands next to nothing about hair on a POC I can’t imagine that they would have spoken to you like that, it’s absolutely disgusting behaviour.\n\nNTA, and do NOT bend to that entitled behaviour", "Oh my god I just saw your edit. Holy crap", "NTA and i think you should inform your family ab her club so they can all cut ties", "I cant believe you’re family is excusing that behavior. She is ignorant and racist. Trust me, you don’t want to be her bridesmaid. You need to drop this girl, I can’t imagine being upset with someone for not wanting to damage their own hair on their own body. Theme isn’t hair type, theme is colors and shit. This is very bigoted and wrong of her.", "NTA\n\n&#x200B;\n\nWell I have heard of a lot of interesting wedding themes but \"straight hair\" is a new one for me! What are they going to do, hang lots of wigs around the reception hall as deco? Old Man Cactus centerpieces? Chia pet favors?", "i was all ready to do my rant about how the brides input on bridesmaids hair extends as far as “up or down” and that’s it, and then i saw the “clean hair” bit and started worrying about white hoods and burning crosses. and then i saw the edit. wtf. guess if it talks like a duck… nta. very clearly. hope you blocked all of them.", "Well, you figured out that they are a bunch of racists, right? NTA and sorry you had to went through this!", "NTA I am shocked by the brazen racist entitlement! Good job you don’t have to go anymore especially considering the nazi bridesmaids", "NTA and I hope you ditched this ‘friend’ before wasting a dime on being a bridesmaid or on a wedding/shower gift.", "We need to start a new trend, of asking brides if their planning a \"perfect\" wedding, then refusing to attend if the answer is yes.", "Undoubtedly NTA. On top of the other people being TA, you handled it with grace. I feel sick reading this. People are disappointing.", "Well that was a hell of an update. Thank God you found out before you went and you're able to keep yourself safe.", "You dodged a bullet there \nNTA", "I'm legit grossed out by them", "NTA. And I hope their wedding cake gets puked on. Seriously.", "Maybe Laura Ingraham would be free to be a bridesmaid that day, if there isn’t a White Power Rally or a gun show.", "NTA\n\nJust wow. Glad you found out their true colours. Unreal. Run don't walk.", "NTA. No one can tell you what to do with your hair, especially if what they want you to do would damage it. \n\nIt would be one thing if the bride wanted a specific hairstyle for all bridesmaids and asked you for a style  that's not harmful/would not require long term changes (such as asking you to dye it, cut it, or undergo any major transformations). \n\nI have a friend with 4B/4C hair and she changes up her style constantly. She looks gorgeous and stylish in every single one she chooses. If I were to have a wedding, I'd put her in my party, tell her the dress color, and let her surprise me with everything else. I'd never dream to meddle with her hair.\n\nIt is a pity they were so hateful and unwilling to see the beauty and versatility of your hair. But also, good riddance! \n\nStay with the people who support you!", "She’s a racist assholes fuck her", "NTA. Plz don’t give in, find a better friend.", "People join Neo-Nazi groups, and you can see them?", "Wildly NTA especially after that edit...\n\nI say this as a white dude with mostly straight hair that's usually kept pretty short. As soon as I read that \"clean hair\" bit I was like \"what fresh hell is this racist bullshit from\"... and sure enough you came in with the edit that some of the bridesmaids have ties to Neo-Nazi groups and the bride is part of some KKK related group.", "As a white person I'm so sorry you were treated this way. I'm disgusted for you. I wish they could all be publicly called out and shamed. \nOf course you're NTA. F those people.", "NTA\nWtf is “clean hair” they’re all racist", "NTA\n\nAlso, I fear the bachelorette would have been like that “sleepover” with a dozen white women and one WOC, where they murdered her for no reason and she thought they were her friends before this. Please google Tamla Horsford.\n\nAs a mostly white person, I don’t always understand details about textured hair maintenance. I actually thought (because I was told by adults back when I was a kid) that black and brown people didn’t need sunscreen… When I learned from a friend who’s black, who got skin cancer while in the military, that isn’t true, I changed my thinking and tried to assume less because a lot of assumptions are micro aggressions or worse. And now I have 2 children who are half “brown” so I have definitely grown and changed my mindset. It wasn’t my fault that I was taught racist stereotypes but it would be my fault if I didn’t reeducate myself when corrected on those stereotypes. \n\nRacism is a choice.", "NTA. What awful things for them to say.", "NTA. She sounds racist. She’s not your friend.", "NTA.. idk I don't even have any words, just wow. I mean, the dresses are themes. Makeup a theme, but changing something natural about yourself isn't a theme. Why did she even ask you to be in the wedding if she just wanted it to be whitewashed? It just makes me sad that people are like this.", "She’s a racist assholes, f her and your white relatives", "\"Clean hair\" seems like code for \"I think braids/more traditional black hair styles are dirty\".\n\nBecause why would they mention \"clean hair\" it is like saying \"remember to make sure your dress isn't stained and you don't stink\". Basics, every adult attending a wedding would ensure as a matter of course.  \n\nI have no idea how black womens' hair works either. It has never come up in my life as a white british woman in a 98% white part of the UK. \n\nBut I do know black people (women especially) have to deal with their hair being touched by strangers, their hair not being considered \"professional\" or \"clean\" and western beauty standards being harmful to their hair. This is like so commonly know I do not think there is no excuse for people living in white majority areas anymore.", "It's a huge dog whistle. People like this see BIPOC hair as naturally dirty because to them it's associated with poverty. Dreads= matted hair from neglect. Tight braids= attempt to keep lice and such away. Frizzy/coily/kinky hair= unkempt hair that's not seen a brush ever.\nGood 'clean' hair is straight, smooth, and types 1/2. \nIt's horrible and racist and the whole association needs to go the way of the dodo.", "My first thought was they meant sleek, but then I realized they don’t mean that at all. I’ve been requested to have my hair flat ironed before, so it would be sleek and lay flat, but I feel that’s a very different ask for me (a white woman with frizzy hair). At the most, I could maybe see a bride getting away with having all her bridesmaids have their hair in updos, but wanting them to remove braids entirely? Absurd.", "Judging by the edit, it's: 'Return of the Klan'! \n\nFFS, I'm ashamed to be glow-in-the-dark white in case someone associates me with these pathetic morons.", "Same! You wrote everything I was feeling. People like the bride and her friends make me so mad. \n\nOP..NTA!!!", "Caucasity 😂😂 Ly", "I can imagine you clutching your pearls as you wrote that 🤣", "I can't love this comment enough!!!", "Caucasity I love it.", "😂😂😂😂", "I’m going to add an edit  now, I did some deep diving and found out most of the bridesmaids have links to some Neo Nazi club .. Thank god i’m not going to that wedding.", "Real. Check my edit too.. supports your point", "Thank you so much for your comment ml. You’re doing such a great job as a mother to a black little girl and I’m happy you are doing what my white mother didn’t. Being a white mother to a black child and doing it right is something I genuinely don’t see often due to the practical fetish of mixed race/black babies. Wishing you the best", "I meant a perm sorry 😘🤞", "\"Don't put yourself on fire to keep others warm\" is a sick line and I will be stealing it thank you very much. Also you are so right, OP you are so NTA it's insane your family can't see it", "😂 Girlll i would’ve smacked that ho up if she wasn’t one of my family friends. Thanks for ur comment, much loveee 🫶🏽🫶🏽", "My previous post got taken down, but my mother died of cancer last month. She was a drug addict and alcoholic, and my father (black) left us so we have no contact with him or his family. My mothers side of the family also had the same habits as her, cut us off, are in jail/prison or are the snobby, stuck up, racist part of the family. I’ve had words with them and they’ve told me that my mum made a mistake getting with a black man and constantly called my hair disgusted. Sadly, I’m not surprised they agree with her. Thank you for your comment ml 🤍", "Don’t worry about asking questions. Me personally, I like the questions my white friends ask me about my hair as long as they’re respectful :). But yes, it damages our hair severely for a long term or literally forever. As our hair is tightly coiled together, the straightener will have to go through the hair to make it pin straight so much that there is literal bright white steam coming from the hair. Silk presses are also sometimes wet with water or product, and wet hair is when the hair is most vulnerable. That’s why a lot of woc wear wigs, to refrain from having to permanently damage their hair.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", ">Judging by the edit, it's: 'Return of the Klan'!\n\nDaughters of The Confederacy?", "I agree with you both! \n\nNTA OP", "And I say that as a white guy, too. My people are a goddamn mess...", "Go nuclear. Put all the info on social media. Tag & message employers, churches, & schools. Fuck them. Let the world know who & what they are.", "Two things: yes I did, and they were in my ass when I did it.", "Sometimes the pearls must be clutched. 🤭", "Yep, run as fast as you can. Your friend isn't who you think she is!", "WHAT?! Omg. Dodged a disaster with this.", "Ah, you were to be the \"Token Good Minority\" so she could claim potential non-racist/ ally points. \nGood on you for telling her to shove off", "NTA\n\nYou deserve better than this.", "Oh good lord. Yeah, dodged a bullet for sure 😬", "Well shit, I think you dodged a massive bullet there!", "I'm sorry about all of this.", "I mean.. honesty is key!", "🤣🤣"]}