{"id": 19629, "submission_id": "1498ueg", "title": "AITA for not giving someone my Reese's", "selftext": "If there's one food on this earth that makes me feel better no matter what it's a Reese's cup. I'm staying in a shelter with my bf right now while we wait for a new apt bc we didn't have the funds for anything else and it was the only option that also helps our pets. They don't provide food here and we're outside so you're pretty limited to either walk to a different shelter for a meal when offered and just have a few snacks on hand. We're in the desert so we try to buy stuff that'll keep us hydrated and gives the most vitamins.\n\nBut when I get the chance I'll grab a small Reese's cup. I can't just freely go out and we have a lot to get done today so this morning I was eating one cause it was the last of what food I have here (bf has food too he just wasn't with me at the time). \n\nA guy I've been friendly towards saw the wrapper on my lap and asked for one. I said I'm sorry this is all I have rn I can't. He wasn't rude, but kept pressing it for a few minutes and I just kept saying the same thing until he walked away. 5 min later he was passing by again and was like c'mon give me one. I'd finished by then so I said I'm sorry I don't have anymore. He pointed out that he could one in my bag which irritated me so I picked it up and shook the empty package to show it was empty and he walked away.\n\nIf I were in any other situation I wouldn't think twice about giving him one so I feel really bad cause I want to. But I think I'm in a spot where I need to put myself first and while it's not something super healthy it's still going to help keep me going. Just curious if IATA or not.", "created_utc": 1686751686, "permalink": "/r/AmItheAsshole/comments/1498ueg/aita_for_not_giving_someone_my_reeses/", "score": 72, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > The action I took that should be judged was not giving him my Reese's cup. It could make me an asshole bc we're in the same boat and it's just candy but I was hungry.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Nta. They’re your food to eat as you please. A total stranger is not entitled to demand your food from you and get upset because you refused.", "NTA - He asked, you refused that should ahve been the end of it.  As soon as he pestered you again, he bacame TAH.", "NTA. When you're in that situation, it's literal comfort food. Having a small joy like that can mean much for mental health too. And you don't owe it anyone to share.\n\nWhen I was unemployed, once a month I would splurge and go to a cafe, get an expensive latte and stay there drawing for a bit. A little thing, but huge for my sanity.", "NTA. It was OP's last one. There is no need to give it away. That is the one small thing that makes her happy, and  right now, she is pressed for money.", "NTA, you already told him no once, he should have stopped asking after that.", "NTA!\n\nA polite kind person would not keep bugging you.\n\nBest way to get respect is say no now and then. Say yes all the time and folks get a sense of entitlement and turn mean.", "NTA. No one takes my Reese's", "NTA, however i think dude might be flirting with you also using that as a gateway to open the talks. Also, 20 years ago i bought a pizza for lunch when i worked at ATT, and this one girl asked for a slice, i didnt want to share. so i told her, she offered me 3 dollars for the slice. I gave her a slice and when she went to lunch she was supposed to bring me the money back. she stiffed me, so after that going forward if someone asks for some of what im eating i tell them 20 dollars. when they say they can buy their own at that point, i tell them do it... i wasnt selling anyway, you just kept being annoying. follow my advice", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nIf there's one food on this earth that makes me feel better no matter what it's a Reese's cup. I'm staying in a shelter with my bf right now while we wait for a new apt bc we didn't have the funds for anything else and it was the only option that also helps our pets. They don't provide food here and we're outside so you're pretty limited to either walk to a different shelter for a meal when offered and just have a few snacks on hand. We're in the desert so we try to buy stuff that'll keep us hydrated and gives the most vitamins.\n\nBut when I get the chance I'll grab a small Reese's cup. I can't just freely go out and we have a lot to get done today so this morning I was eating one cause it was the last of what food I have here (bf has food too he just wasn't with me at the time). \n\nA guy I've been friendly towards saw the wrapper on my lap and asked for one. I said I'm sorry this is all I have rn I can't. He wasn't rude, but kept pressing it for a few minutes and I just kept saying the same thing until he walked away. 5 min later he was passing by again and was like c'mon give me one. I'd finished by then so I said I'm sorry I don't have anymore. He pointed out that he could one in my bag which irritated me so I picked it up and shook the empty package to show it was empty and he walked away.\n\nIf I were in any other situation I wouldn't think twice about giving him one so I feel really bad cause I want to. But I think I'm in a spot where I need to put myself first and while it's not something super healthy it's still going to help keep me going. Just curious if IATA or not.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA and No is a complete sentence. You did not have to shake your bag and or prove you didn't have one. A simple No is your right.", "NTA.  It is you food, all you had, and a great comfort to you.  He had every right to ask, but when he did not accept your 'no' as an answer and continued to pester you, he became TA.", "There was no need to give one away even if OP had a 3kg bag of them: stranger asked, OP politely declined, should've been end-of-story. NTA. Stranger wasn't raised correctly."]}