{"id": 19643, "submission_id": "149aks4", "title": "AITA for agreeing to babysit my friend's kids on my day off?", "selftext": "My BF (M36) and I (F29) have been together for a year, we moved together last month. We don't have kids and we are not planning on having them. Both of us work 5 days a week, but my days off are always Thursday and Friday, while his days off varies from week to week, so our days off don't always match and it's possible that they don't match for weeks or even a couple of months if we are unlucky enough.\n\nSo, last week my BF's days off were Friday and Saturday, and mine as usual were Thursday and Friday, which meant both of us were free on Friday and we were pretty excited to enjoy our day off together. It was our first day off together since we moved together. We didn't have anything planned, but I was looking forward to laze around with him the entire day.\n\nFriday, at 2AM I received a call from my best friend (F29), she was crying because her husband (he is a truck driver) was in a traffic accident. The accident was in a city 8 hours away, and he was taken to the nearest hospital in a really bad shape. My friend said she and her MIL wanted to leave to the hospital right now so they could be there by mid-morning. My best friend has a ten months old son, and she said she obviously can't get a hold of her usual babysitter at 2AM, so she asked me if I can watch her son for a few hours until she can reach her babysitter.\n\nNow, I'm also not a huge fan of kids, specially babies, I don't know how to deal with them, but this was an emergency and I understand it's probably impossible to get a babysitter at 2AM. My friend had never asked me to baby sit before as she knows I'm not good with kids, but this is an emergency and what are friends for right? So, I said yes and I told her she could drop the baby at my place.\n\nAs soon as I disconnected the call my boyfriend told me he couldn't believe I agreed to babysit and that he didn't want a screaming baby in our house, that it would ruin his day. I agreed he shouldn't be forced to interact with the kid against his will, after all I was the one that agreed to babysit, so I called my friend and told her I will babysit at her place instead.\n\nMy boyfriend got angry at me again, but I left anyway and went to my friend’s place. My friend called the babysitter at 8AM, but she said she wasn't available until noon. So, I ended up babysitting from 2AM until noon. When I returned to my place, my boyfriend was still angry at me. He said I ruined our day off together as I was missing half the day to go babysit a kid that's not even mine. I tried to explain that I was just trying to help my friend.\n\nHe has been ignoring me since Friday, he said it was clear to me my best friend is more important than him as I picked helping her over spending the day with him. I told him it was not matter of who is more important, but he is still upset.\n\nI understand I missed half a day off with him and that we might not get another for a few weeks, but I think it was a special circumstance, my best friend needed my help. AITA?", "created_utc": 1686755952, "permalink": "/r/AmItheAsshole/comments/149aks4/aita_for_agreeing_to_babysit_my_friends_kids_on/", "score": 194, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the asshole because it was my first day off with my BF and I'm not sure when we will have another one but I agreed to babysit without consulting with him first.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nMight want to reconsider that relationship if this is how he reacts when you help someone in an emergency.", "NTA lol. if he can't understand that sometimes emergencies take precedence over his wants, then he's not worth you.\n\nWould he complain to you if someone in you family were in the hospital on his day off, too, and you had to go visit them?\n\nHe can choose not to help your friend out n baby sitting, but he doesn't get to yell at you for doing so.", "Oof, you've got a selfish BF. NTA.", "NTA, but you definitely need to replace the BF if he's getting that upset that you're helping a friend in a desperate situation.\n\nYou did the right thing and you still had half a day to spend with him, he ruined that half of the day with his selfishness. If he wants to blame you for ruining the first half, blame him for the second half.", "NTA Your bf is self centred and only cares about his wants and needs. The fact he can’t even show enough empathy in an emergency like this is extremely worrying. These are huge red flags and I hope you get yourself out of this relationship.", "NTA. I'm proud of my husband when he is a good friend, even if it could be a little more convenient because I love that he is a caring, thoughtful person. Do you want to date someone who doesn't have empathy? Your friend's husband was in a terrible accident and it had to be about him and his day off.", "NTA \n\nYou could have been together on Friday if he was mature enough to understand the circumstances of your decision. In that case you would be at your home and will have an helping hand. \n\nI understand a screaming baby could put off some people, but he can just switch rooms, and considering that it was his off day, he shouldn't be angry about seeing a baby.\n\n\nI dont see a problem here being you. Helping someone for a few hrs in their time of trouble is what a friend does, and a partner is responsible for his other half to take care of you. \n\nConsider this a red flag. There could be a past trauma or something affecting his decision making. \n\nI think if you end up marrying him, he can just leave you when you are sick or in trouble as he doesn't like your friends visiting you at the hospital or something. \n\nSorry to say this, but I would advise you to clear things up before moving ahead with your relationship.", "NTA, and your boyfriend has just given you the gift of showing you who he really is.  Believe him.", "NTA find a better boyfriend", "Absolutely NTA. You went to your friend's house to babysit a 10-month-old, but you're living with the biggest baby of them all.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy BF (M36) and I (F29) have been together for a year, we moved together last month. We don't have kids and we are not planning on having them. Both of us work 5 days a week, but my days off are always Thursday and Friday, while his days off varies from week to week, so our days off don't always match and it's possible that they don't match for weeks or even a couple of months if we are unlucky enough.\n\nSo, last week my BF's days off were Friday and Saturday, and mine as usual were Thursday and Friday, which meant both of us were free on Friday and we were pretty excited to enjoy our day off together. It was our first day off together since we moved together. We didn't have anything planned, but I was looking forward to laze around with him the entire day.\n\nFriday, at 2AM I received a call from my best friend (F29), she was crying because her husband (he is a truck driver) was in a traffic accident. The accident was in a city 8 hours away, and he was taken to the nearest hospital in a really bad shape. My friend said she and her MIL wanted to leave to the hospital right now so they could be there by mid-morning. My best friend has a ten months old son, and she said she obviously can't get a hold of her usual babysitter at 2AM, so she asked me if I can watch her son for a few hours until she can reach her babysitter.\n\nNow, I'm also not a huge fan of kids, specially babies, I don't know how to deal with them, but this was an emergency and I understand it's probably impossible to get a babysitter at 2AM. My friend had never asked me to baby sit before as she knows I'm not good with kids, but this is an emergency and what are friends for right? So, I said yes and I told her she could drop the baby at my place.\n\nAs soon as I disconnected the call my boyfriend told me he couldn't believe I agreed to babysit and that he didn't want a screaming baby in our house, that it would ruin his day. I agreed he shouldn't be forced to interact with the kid against his will, after all I was the one that agreed to babysit, so I called my friend and told her I will babysit at her place instead.\n\nMy boyfriend got angry at me again, but I left anyway and went to my friend’s place. My friend called the babysitter at 8AM, but she said she wasn't available until noon. So, I ended up babysitting from 2AM until noon. When I returned to my place, my boyfriend was still angry at me. He said I ruined our day off together as I was missing half the day to go babysit a kid that's not even mine. I tried to explain that I was just trying to help my friend.\n\nHe has been ignoring me since Friday, he said it was clear to me my best friend is more important than him as I picked helping her over spending the day with him. I told him it was not matter of who is more important, but he is still upset.\n\nI understand I missed half a day off with him and that we might not get another for a few weeks, but I think it was a special circumstance, my best friend needed my help. AITB?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA\n\nHoly cow your BF has no empathy!!!  If you get sick or need help, I'd be worried he'd be mad at you for messing with his plans and you making your share of the rent.  You went above and beyond respecting his need for peace on his day off and went to your friends and he's mad that you chose to help a friend in an emergency instead of hanging out for a few hours.  Based on your post, he is stone cold.  Is this the quality of person you see yourself with long term?", "NTA\n I'm sorry but this is bringing up a ton of red flags. He is acting incredibly immature. You helped a friend in need and had kept your part of your promise to not force the baby on him. You went to HER apartment and took of the baby there. It's not like the parents were going out to party or date, there was an emergency and no one else was able to care for the child in the meantime. \n I implore you to rethink this relationship, because if this how he acts when he doesn't get his way over something as small as not seeing you for a few hours, I'd rather not stick around when he doesn't get his way for bigger things. RUN!", "NTA, there are few things in life that would excuse this behavior toward your partner. This is clearly one of them. Your partner should grow up a bit.", "Does BF have any real friends? How does he not understand that we help people we care about? Sounds like a jerk.", "Absolutely NTA, also like a lot of other commenters mentioned, this scenario is clearly showing some red flags.\n\nThe blatant lack of compassion and understanding from your SO is kinda appalling, and clearly, he is incredibly selfish to stick to hus argument.\n\nObviously I don't know if he's shown any manipulative or abusive behaviours in the past, but if I were in your shoes, I'd use this situation as an opportunity to get out before his need for control puts you in danger.", "NTA. You two could have hung out after noon, and the rest of the day. Were there already plans for the two of you in place, that were time-sensitive and were missed (like seeing a movie at a certain time, brunch/lunch plans with friends, etc)? \n\nSeems pretty selfish and immature to hold a grudge against you for helping a friend. You even accommodated him by not watching the baby at your place for his sake. Is he the type to not help a friend during an emergency? What if you had an emergency and needed him? Could you count on him? Would he be mad about having to help his own friends or you? Maybe some couples counseling would be a good idea if you want to continue this relationship. Having a mediator can help with conversations about things like this.", "NTA you were doing a huge favour to your friend who was in a time of need. If your boyfriend has a problem with you helping your friends when they need it then I don’t think he is the one", "NTA…how can he be 4 years from 40 and still be this selfish and not understanding? It’s not like any of this was planned….", "NTA he sounds like a narcissist- no compassion at all for your friend or her husband?! I’d probably use this as an opportunity to make him an ex-bf if I was in your situation. 🚩⛳️🚩⛳️", "NTA you did it for a real emergency not just because your friend wanted her hair done besides she even set up for you to switch with the babysitter. You may of taken up half the day but your bf made sure to ruin the other half, he chose to stay angry", "NTA\n\nWhere is his empathy for your friend and her family? Even if you don't like someone you still usually feel bad when this stuff happens to them.\n\nHe's really selfish and immature imo. It's overkill to still be upset days later. It seems like he thinks if he punishes you hard enough now in the future you won't step out of line. That would really bother me.\n\nHope your friends hubby is ok.", "NTA\n\nYou are going to need to re-evaluate this relationship though.", "Your BF is a major asshole. You helped a friend out in an emergency and did it at her place. NTA", "NTA- you’re a really good friend. This is what friends do for each other. It was a serious situation and your bf couldn’t understand and that’s a huge red flag. If you can’t rely on friends and family what exactly is their purpose? Thank you for being there for your friend. Now consider being there for yourself by getting rid of the guy before you waste any more time on this selfish prick. You deserve better.", "NTA and boo fucking hoo that his day was “ruined”. i’m sure your best friend’s day was pretty damn ruined too.", "NTA, u didn’t even need to ask. SO needs to grow up a little.", "INFO: is your bf 36 months, or 36 years old? Judging by his behavior, he needed a babysitter to watch him, too.\n\nNTA. Drop the bf who acts worse than a literal baby during an **unplanned emergency.**", "NTA", "NTA- you helped a friend who had an emergency. This wasn’t some small situation…her husband is seriously injured and in a hospital hours away. You were being a supportive and compassionate friend/human. This was an isolated situation and your bf is acting like you moved a baby permanently. Sounds like your bf is the one who owes you an apology for being a massive insensitive jerk. You do not owe him an apology whatsoever. Relationships are give and take and you should support each other, he should have been supportive in your decision to help a friend.", "NTA.", "What a child. You should probably arrange for someone to babysit him on his next day off so he doesn’t feel so lonely. \n\nNTA", "NTA, it was an emergency, you were supporting and helping your best friend. Shit happens, you are a great friend in stepping up.", "Nta it was an actual emergency tell your boyfriend to grow the fuck up", "NTA agree with all the others.  Your bf is acting selfish and immature.  You can do so much better OP.", "Yta", "[deleted]", "Nta", "NTA and you are an amazing friend. Dump the BF as he’s shown a distinct lack of empathy x", "NTA - your boyfriend is acting like a child.  He is ruining his own day by throwing a hissy fit like a spoiled brat.  Might want to have a discussion with him as to why he feels the need to control you. \n\nKudos to you for helping out a friend in need despite not being comfortable with kids.", "NTA. such guys - for the d*ck and to the museum😉", "NTA. You agreed to help out a friend who needed help in an emergency. That's something to be commended (especially with you not being a big fan of babies), not throw a tantrum over. \n\nI hope your friend's husband comes through this okay.", "NTA but wow your boyfriend is one. How selfish of him!", "NTA. Dang I want to be friends with you! You drop everything to watch a baby that is not related to you. Personally that’s what friends do. Drop and help at a moments notice!", "But significantly older partners are usually so mature!", "NTA\n\n\nExactly! If your partner is going to act like that and give you hell in such a traumatic situation that has to do w someone very important to you (best friend), maybe you're better off without him... 🚩🤧 \n\n\nEven if you're only friends w someone like him, would make sense to reconsider.", "This is clearly one of them. Your partner should grow up a bit.", "I think BF is cranky from teething.", "LOVE this comment! 😭", "Literally how???", "This comment is crazy to me. Maybe involving him in the decision?! The way you worded that makes it seem like OP wanted to change plans just to casually hang out with her friend and kids. He’s not mad that she didn’t include him in babysitting, he’s mad that she’s helping out a friend during a very serious family emergency. There’s nothing to talk out.", "Right lol. My first thought was, grown ass man can’t handle the thought of a literal baby upstaging him as the biggest baby in his gf’s world hahaha", "I had to go back to look at the age again, cause by the end I was visualizing a 21yo ~~man~~ boy.", "36 to 29 isn’t really an insane age gap.", "That made me chuckle 😂😭\n\nHe's soon to be de-teething 🗿", "Right??! 😭If she were to try to \"involve him in the decision\" the way that commenter suggested, it'd probably take more than from-2am-till-noon w his attitude...", "Insane? No.\n\nBut **25%** older is still *significant*.", "NTA this was an emergency. Those aren’t something you can schedule. Also it’s fine to not want a kid. But how can a person be that irritated by their existence? Bf needs to grow up a little more.", "NTA. Your boyfriend is an AH who apparently thinks other people don't matter. Reconsider this relationship.", "Your boyfriend is a selfish prick. NTA OP.", "NTA. But did he know it was an emergency? He seems to be so heartless.", "NTA\n\nIf he acts like this when you're supporting a friend during what could be the worse time of her life so far, he's a selfish and inconsiderate person.\n\nTime to do with him what you do when you finish babysitting: return him to his parents.", "NTA\nHe sounds selfish and controlling. Your time off of work is NOT his to manage. You were considerate to manage babysitting where he wouldn't be bothered. Beyond that, he's out of line.", "NTA. Noon is not the end of the day!!! \n\nAlso - not all babies scream. And it was a freakin' emergency. And you were done at noon!!! Most of the time you were gone you would have both been asleep. He could've used the morning for errands, cleaning, gym, anything that would've paved the way to make the rest of your time better.", "NTA, and your boyfriend needs to grow up. I understand that he wanted to spend time with you, but hey, it's a force-major situation. And this is really what friends are for. Also, I don't know your routine, but on my days off I rarely start the day before 12pm, so getting home by noon doesn't sound like ruining the whole day for me.", "NTA\n\n&#x200B;\n\nYour bf is an AH, this was an emergency.", "NTA. It is never wrong to help someone in a genuine emergency. Your boyfriend sounds like the type who can't stand to be inconvenienced ever. Tell him to be a better human", "Your boyfriend is TA.   This was an emergency.  Even if this was not your best friend out of compassion you should have babysat.\n\n&#x200B;\n\nPlus he should not have forced you to leave the house at such a late hour", "NTA, and as another childfree person who isn't particularly fond of young children, what in the **hell** is wrong with your boyfriend as a basic decent human? \n\nIt is now Wednesday, and he's been ignoring you since last Friday, when your best friend's husband nearly died in a car accident and you did a one-time (but important) favor to her? And you even tried to make it easier on him by changing the location of the babysitting and driving to your friend's house instead. \n\nAll over 10 hours of babysitting?! \n\nYour boyfriend lacks empathy and basic decency, but is abounding in selfishness. \n\nI know this sub is quick to say it, but ditch this guy.", "We are getting one half of this. This might be an ongoing problem where OP lets others inconvenience her to a fault. My mom was like this. I still hate going out of my way for people. PTSD from my mom is still with me. 17 yo me waiting for 3 hours for my mom to pick me up because a friend needed her. I was always last. It still affects me.  Maybe he is acting childishly because he was a child when this type of trauma affected him. I'm in no way proud of this about me, but my anxieties get the best of me. \n\nOr he's just a dick!! Lol. \n\nGood luck.", "[removed]", "NTA, but now you’ve seen how he’ll likely react if you ever have an emergency that mildly inconveniences him. Act accordingly.", "[removed]", "NTA - it was an emergency. Your bf is showing you he’d be useless in an emergency and that he very immature by giving you the silent treatment. Moving in with someone shows you their true self. It won’t get better from here tbh. People don’t change. They just hide who they are and show you over time.\n\nHe should have been understanding and helpful not acting like the ten month old who needed watching.", "jfc NTA. you’re a good friend and a good girlfriend! you solved his issue by babysitting at your friend’s house, were back by noon, and he’s still complaining?? yikes.", "NTA. This was an emergency and you were a good friend! Your BF needs to get over himself.", "NTA. Your friend was in dire straits and needed help. It’s not a regular occurrence. Your bf is acting like a child. Congratulations OP, you’re still dealing with a kid. \n\nI don’t know what it is with young people these days and their insistence that children are untouchable creatures that should be despised. You were a kid once and did the same damned things so just grow up and act like an adult. It won’t kill you to act decently to a little kid that finds themselves in circumstances that they don’t control, and a friend that may just be losing her husband.", "NTA. Your boyfriend is self absorbed and selfish. It was an emergency where a friend was in need, something out of the ordinary. You’re a good friend. Your boyfriend is a whiny child who thinks the world revolves around him. Major red flag that he got so angry and couldn’t be supportive. Pathetic.", "NTA, OP, and thank goodness you could be their for your friend. I hope all is well after that accident!", "NTA.\n\nYou stepped up during an emergency.  It sucks that you had to cancel plans for part of the day with your BF but you did a good thing.  I could understand your BF being irrationally angry at 2am - not all of us are at our best at that hour! - but not forgiving you once he'd had some more sleep and processed what happened is a bad sign.", "NTA.  Your boyfriend needs to grow up, ffs.  What a child.  This was an emergency, ffs.   A bonafide emergency, and then you have to come home to this asshat whining that he's not the center of your universe for a few hours.  Bet the 10 month old was more mature", "NTA. I don’t ever see myself being with someone who acts so callous towards a loved one undergoing trauma. \n\nIf this were me, this would be a no-brainer end of the relationship.", "Oh wow!!! NTA but your boyfriend is!  This was an emergency!   Someone was in an accident, in the hospital!!  Run, girl, run!", "Mostly NTA. The bringing the kids to your place meant either he had to put up with them or leave. You fixed that though, so he should be mature enough to not think you have to be attached at the hip. I'm sure you see him more than you see your BFF, so if he can't share (especially in an emergency) it is pretty sad that he can't put off not very special plans until the next opportunity.", "NTA.\n\nYour response to this situation is a textbook example of how people contribute to a functioning society. You compromised on your having to deal with kids one time in an emergency to help your best friend because her husband was hospitalized in a traffic accident.\n\nThat your thirty-six year old BF has difficulty comprehending how this works speaks more to his lack of maturity than anything else, and perhaps you might be better off not having to deal with the emotional burden of someone who seems to lack basic empathy.", "NTA. That’s how a 36 yrs old man behaves? Yikes. Nobody would want him as a friend or boyfriend.", "NTA, but drop your boyfriend!\n\nHe doesn't want you to be a loyal friend?", "NTA but your BF gets the asshole of the year award. Given your lack of interest and inexperience with kids, it was kind of you to babysit in an emergency. But what else could a decent human being do? \n\nYour friend's husband is in serious condition and your AH, I mean boyfriend, is worried about you ruining his day! Seriously?\n\nThis man is unkind, selfish, childish, and controlling. Don't trip over the red flag.", "NTA. \n\nYou're obviously great with babies, you're in a relationship with one. He ruined your day off. You were done by noon. \n\nRun. Fast.", "NTA you help the ones you love when you can. If he doesn't agree with that then you two arn't compatible.", "Reminds me of the time my friend called me at midnight, waking both myself and my husband (we both work fairly early). Her son had swallowed a quarter and choked. She was at the hospital with him, but was covered in vomit and needed clothes, and I'm the only one in our friend group who is close to her size.\n\nMy husband got up and started the car while I grabbed some clothes and a jacket, then drove us to pick up food and cigarettes for her, and then to the hospital 45 minutes away. Then waited while I went in and gave everything to the front desk. \n\nWe ended up back in bed around 3 am. He had to be up in 3 hours. \n\nNot a peep of complaint, only concern for our friend and her child (who is fine now!).\n\nNTA. Dump the asshole.", "Yep, not seeing a shred of empathy from him. Seems to only care about his needs.", "And run!", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "He’s not some 5 year old that Op need to hold hand and talk to make him understand the circumstances. Sure, their one day got ruined but this was emergency. Op wasn’t even asking him to participate. If I were the bf. I would gladly let my gf do what she needed to do.  As long as I don’t have to do it. Even if she ask for help, any normal adult would understand.", "Thank you for helping a friend in need despite not being comfortable with children.", "Not really. 29 & 36 are at pretty similar stages of life & both are old enough that no one isn’t taking advantage of a naive kid. They also only started dating a year ago. \n\nAre you young or just don’t like any age gap?", "This is Reddit sir. \n\nIf they aren’t born the same day, month ,year… it’s a MASSIVE RED FLAG 🚩!!!!!!", "Old enough to not be taken advantage of, sure, but 29 year olds and 36 year olds are generally NOT in the same place in life.", "They pretty much are. People that age have had the opportunity to date around and establish themselves. Some do, some don't. But that depends way more on the person's life choices than their age.", "Eh, 7 years out of college if they went that route and 14 years out of college if they went that route.  I dunno, the 36 year old could be significantly more established but no guarantee and again, both totally adults who have been working a significant amount of time.", "Right, but people on similar life paths are not in the same place as each other at age 29 vs 36. You'd have to be with someone with a completely different life trajectory than yours to be in that same place when one of you is 29 and the other 36. \n\nThis is also a fast-moving age, kind of like being a teenager. 29 year olds do not typically have families yet, at least not in my circle. However, most 36 year olds I know do. Life changes more between age 29 to 35 than between 22 and 28. This is pretty much true for everyone I know."]}