{"id": 19666, "submission_id": "149b1kr", "title": "AITA for what I said to the neighbour’s daughter?", "selftext": "Not feeling great about this by any means, so I’m using a throwaway. \n\nI’m a middle aged guy with a wife and two teenage kids. Over the years I’ve got friendly with the guy who lives next door (I’ll call him John) - we say hi whenever we see each other, we go for beers sometimes and our kids go to the same school.\n\nI can see John’s garden from my upstairs window, and last Saturday John’s daughter (who is 19 and I’ll call Casey for this) was out there sunbathing and listening to some music. Now I get on pretty well with Casey and with John’s other two kids - we’re obviously not best friends, but whenever I see them (like with John) I say hi and we chat for a moment. \n\nHere’s the problem - I wanted to say hi and at that particular moment Casey was putting some sunscreen on her arms, and so I jokingly shouted from my window;\n\n“Hi Casey! You missed a spot!”\n\nTo my horror she looked up at me like I’d just slapped her across the face, and got up and left the garden. A couple minutes later I get a very, very pissed off John at my door yelling at me for upsetting his daughter. I felt pretty bad (like a total creep honestly), and tried to explain that I’d only been joking around and that I’d never meant to make Casey feel weird, but John wouldn’t listen to me. He honestly got pretty aggressive and told me that if I ever did a thing to upset her ever again I’d deeply regret it.\n\nMy wife was out at the time, but when she came back and I explained the situation she was on my side and furious at John for threatening me.\n\nI totally accept that I upset Casey, which I’m really sorry for and never meant to do. But I’m not too happy with what John did either, and my wife thinks he was majorly overreacting by dishing out threats to me in my own house. \n\nI think I was stupid, but do you guys think I was the asshole?\n\n\nEDIT: In response to some commenters - when I said “You missed a spot” it’s not that I’d just been looking at her long enough to determine where she hadn’t put cream and that’s why I said it. I just said it generally as a joke towards someone putting on sunscreen. It had nothing to do with how much or little she’d put on and I hadn’t been staring at her for ages", "created_utc": 1686757117, "permalink": "/r/AmItheAsshole/comments/149b1kr/aita_for_what_i_said_to_the_neighbours_daughter/", "score": 36, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) The action I took that should be judged is what I said to Casey\n\n2) I think it might make me the asshole because it weirded her out and her dad was angry\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. \n\nYou sound like you had good intentions on making that joke but it may not of came off as such. Given that Casey is only 19, you are probably much older than her so it could be seen as creepy in her perspective. So just keep that in mind. The fact that your wife has your back also should solidify that you are NTA as it was a mere joke. John though totally overreacted and is definitely the AH here. He should’ve came and talked to you reasonably and then acted on what your intentions were. End of story.", "YTA - You, probably unintentionally, came off as very creepy. You're a grown man who was watching a young woman sunbathe. There was no need for you to take any action except for walk away from the window as soon as you realized what was going on. Invest in some curtains for that window.", "You may not be a creep, but that was a creepy thing to do. Even if you weren’t it makes it sound like you were peeping on her tanning in the yard. YTA", "YTA.  Even if you had a good relationship where joking is common, that comment from a window puts you in the creep category.", "YTA. I know it wasn't intentional, but it can be seen as an adult male spying on a teenager. I see why her father freaked out. There are a lot of predators out there.", "YTA \n\nYou were watching her from an upstairs window and then commented so that she knew you were watching. I can understand why she felt creeped out and I actually don’t think her dads response was out of line", "ESH.  You were so wrong to invade her privacy like that as she had reasonable reason to believe she was sunbathing in private although obviously your upstairs window overhangs their backyard.  Whatever, you had a lapse in judgement there and she clearly felt like you were being a peeping tom.  As for her father's reaction, that was a bit over the top too and unfortunate.  Perhaps if you'd known Casey better it wouldn't have mattered so much, but obviously that is not the way she saw it.  Sorry.  Maybe when the heat of the moment is past, you can speak again to your neighbor about what happened and how your intentions were not meant to be lewd but rather in jest.  Whatever, you invaded her privacy and went where you were not welcome.", "Look, soft yta +ESH.\nYou seem to be a decent dude and I can tell you didn't mean to be a creep but honestly you were kind of a creep... The thing with yards especially if they're fenced in is people feel that they should have a reasonable amount of privacy within them. I know you can see over this fence, but it's still a boundary. It sounds like you had a foot-in-mouth moment, her dad is right to be pissed off that you were a creep, even if it was unintentional. Threatening you may be a bit much, but for all you know she misheard you and thought you said \"you look hot\" or \"I tell you what!\" \"Id kiss that spot\" Ect. That's the thing about shouting out windows, you can easily miss facial cues and the finer point in phrases.\n\nYou need to wait until things calm down and then find a time where you can apologize to Casey, wholeheartedly and earnestly, and explain to her that you didn't mean to make her feel uncomfortable. Own that you shouldn't have been looking at her, and it was inappropriate for you to comment on her in this situation at all. Remember you are an adult male and are very powerful in a teen girl's eyes, any comment that you make directly or indirectly about her body feels threatening. That's just the world we live in.\n\nIt seems like you and John are pretty good friends and those are hard to come by in grown men so I would certainly say do your very best to not implode this friendship.", "Yta. You just know your neighbor. You are not friends with him let alone his daughter. If you knew the daughter grond when she was little and have a like good relationship what het than you could make that comment. But in this situation absolutely not. You sounded like a pervert watching your neighbor’s daughter. And i get where the neighbor is coming from and maken a threat, because he is protecting his daughter. So yeah big AH move.", "I am not going to make any assumptions re what you were doing at the window, how long you were standing there or why you felt the need to make sure she knew it.\n\nThat being said. You clearly made her feel uncomfortable and upset her- unfortunately your intentions don't really matter here.\n\nThat was a weird thing to do and I feel like as a middle aged man, you should have known better.\n\nYTA.", "ESH, jokes like those are never funny if it’s not among friends who joke like that, but your neighbor definitely went overboard with threatening you. She’s his daughter but she’s also of age. Your joke was stupid but nothing to threaten violence over.", "YTA.  You don't say anything familiar to a teen girl sunbathing.  I'm gonna bet that the dad isn't angry that you \"upset\" her, he's concerned at your not respecting boundaries.", "This falls under the “good intentions, bad outcome” situation. \n\nI don’t think YTA but I would give it a few days, let things cool off then go over and attempt to apologize to the family and then have a conversation with the dad one on one. After that, let it be, let them approach you so you know they’re over it.", "YES. YTA.\n\nWho the fuck watches a teenager out of their window applying sun cream? What the actual flying fuck?\n\nYour wife is no better for taking your side??? What. Dude. This isnt okay. \n\nMassive asshole.", "YTA. That was fucking creepy.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nNot feeling great about this by any means, so I’m using a throwaway. \n\nI’m a middle aged guy with a wife and two teenage kids. Over the years I’ve got friendly with the guy who lives next door (I’ll call him John) - we say hi whenever we see each other, we go for beers sometimes and our kids go to the same school.\n\nI can see John’s garden from my upstairs window, and last Saturday John’s daughter (who is 19 and I’ll call Casey for this) was out there sunbathing and listening to some music. Now I get on pretty well with Casey and with John’s other two kids - we’re obviously not best friends, but whenever I see them (like with John) I say hi and we chat for a moment. \n\nHere’s the problem - I wanted to say hi and at that particular moment Casey was putting some sunscreen on her arms, and so I jokingly shouted from my window;\n\n“Hi Casey! You missed a spot!”\n\nTo my horror she looked up at me like I’d just slapped her across the face, and got up and left the garden. A couple minutes later I get a very, very pissed off John at my door yelling at me for upsetting his daughter. I felt pretty bad (like a total creep honestly), and tried to explain that I’d only been joking around and that I’d never meant to make Casey feel weird, but John wouldn’t listen to me. He honestly got pretty aggressive and told me that if I ever did a thing to upset her ever again I’d deeply regret it.\n\nMy wife was out at the time, but when she came back and I explained the situation she was on my side and furious at John for threatening me.\n\nI totally accept that I upset Casey, which I’m really sorry for and never meant to do. But I’m not too happy with what John did either, and my wife thinks he was majorly overreacting by dishing out threats to me in my own house. \n\nI think I was stupid, but do you guys think I was the asshole?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA. \n\nYou made a comment at a 19 year old girl that made her likely feel like you were watching her for a while and she felt violated. \n\nVery poor taste. You won’t be rude  if you don’t say hi to your neighbors everytime you see them.", "YTA\n\nIf you cant understand how a middle aged man starting out their window at a 19 year old sun bathing might come across as creepy you need a reality check. \n\nI don't think you meant it maliciously obviously but you need to understand that this could 100% be interpreted as creepy behaviour.", "YTA but I believe that you didnt mean to be. Honestly, I just chalk this up to a lapse in self-awareness. She didn't know she was being watched and that startled her. As a young woman, to contemplate how long my middle aged neighbor has been watching me apply suntan lotion...even if you didn't mean it to be, that is unsettling. Your neighbor is just doing the best he can by protecting his young daughter at all costs. I don't think there are \"sides\" to this, I think that you can do your best to be apologetic and earnest and hope that your neighbor friend sees that and understands. I would steer clear, let the dust settle and wait to see if your neighbor decides to try to engage with you again on his terms.", "Yta, you thought it would be funny to call out the window to a young woman who was sunbathing thar they missed a spot.\n\nThey don't know if you're being joking or if you're creeping on them. You even stated that you felt like a creep. \n\nWomen get enough guys cat-calling them. They don't need it happening in the privacy of their own backyard.\n\nFor the dad overreacting according to you, look at it from his perspective.\nHis daughter had someone basically call them out as if they were watching them apply the lotion to the point they knew they missed a spot. How would feel if if it was done to your child?", "Explain the good intentions", "What good intentions?", "So you basically cat-called a young woman who was sunbathing in the privacy of her own back garden? \n\nPut yourself in her shoes; She thinks she is sunbathing in the privacy of her own space. But you apparently have been watching her invisibly from a window long enough to see that she has not rubbed cream on every inch of her body. So you shout at her that she has missed a spot. She jumps a mile! How long have you been watching? Do you always watch her sunbathing?  Have you watched her throughout her suncream application? Are you getting off on it? Why are you watching? Or commenting?  \n\nCan you see it yet?\n\nOf course YTA, women don't want or need comments like this. Why do some men feel it is their right to comment directly or indirectly on a woman's appearance? At 19 she probably gets more than her share of  sleezy behaviour and is probably on high alert for it. Good on her dad for sticking up for her.", "YTA and a creep.  She is never going to feel comfortable going to her own garden because she'd think you'll be there looking at her.", "you sounded like a creep..lol.. YTA.", "YTA. You have of major stalker/voyeur vibes with what you did. And now, despite any assurance you might give, the poor girl will never feel completely comfortable sunbathing (or anything else) in her backyard again for fear of her creepy, middle aged neighbor peeking at her. \n\n“I was only joking” is the common refrain when people get caught doing something they should not have but don’t want to apologize. And it is your neighbor’s job to protect his children from people who give out creeper vibes - yes, he was aggressive, but he needed to shut this down, and shut it down *now*!", "YTA. \n\nJust because YOU know you hadn’t been looking long doesn’t mean SHE knew you hadn’t been. \n\nCongratulations! You just became part of the reason that girl will cross the road rather than walk past a group of men, why she will carry her keys through her fingers in a fist.", "YTA put yourself in her shoes. A middle aged man was staring out of his window and watching her and then yelled out to her ‘you missed a spot’. That’s very creepy, especially when you claim to it even be close with John", "YTA because your edit suggests you know exactly why what you said was inappropriate. You understand that what you said could be interpreted to suggest you'd been watching her in a creepy way and yet..... you're not sorry? Whether you meant to sound like a creep or not is irrelevant, you did sound like a creep. You should be embarrassed and apologetic, not mad at John for looking out for his daughter.", "Casey probably felt like it was safe to do some sunbathing in the privacy of her own back yard. You handily dispelled that illusion for her.          \nI can understand why she would feel shocked and upset. Even though you were joking around. It still made her feel exposed, uncomfortable and vulnerable in her own yard.                     \nI think John overreacted somewhat. But I can see where he is coming from. You basically came off like you were peeping on his 19 yr old daughter.              \nThe best that you could have done was recognise she was having private solitude time in her backyard. Closed the curtains/blinds to ensure her privacy and went about your day, minding your own business.      \nEven if you meant no harm, harm was done.      \nYTA for making a 19 year old girl uncomfortable on her property. John is an AH for threatening you and not hearing you out.          \nProbably a good idea to not shout to/at teenage girls from your house, going forward.\nEven if it was innocent, it’s still kinda weird.", "Yta.  Your wifes support is relevant.  Short of you killing someome, its nice to have a wifes support\n\nSome wives will support their husband indecent behaviors.\n\nWhat matters is what you did, how it was perceived, and that it did offend others/target", "YTA and a massive creep. The fact that you noticed she missed a spot that means you were looking at her for quite a bit. The girl's dad easily could've done more.", "YTA \n\nEwwww. That's creepy. You know that it's creepy. That's not joking. You know it. There isn't any excuse that you can make that makes it okay for a \"middle aged man\"--from an upstairs window (or elsewhere), watching a teen girl, in her own yard , saying something inappropriate and making her uncomfortable.\n\nA middle aged woman.", "Soooo creepy uhhhglllllllllll", "I’m in the minority here, but NTA. You weren’t creeping on her. You were just making a dad joke. Could have been a simple fix if neighbor had just brought it up and let you explain yourself instead of threatening you. If this was a frequent occurrence it would be one thing.", "NTA\n\nDude, you made a perfectly innocent comment. Not meaning to throw shade, but \"you missed a spot\" is probably as old as sunbathing it's self. Some people just can't not make a mountain out of a mole hill. 😂", "YTA - Poor taste, man.", "YTA", "YTA and a creep!!!", "You, a middle aged man, watched a 19 year old girl sunbathing in her yard from your upstairs window and shouted at her that she missed a spot when she was applying sunscreen.\n\nFor a moment you redeemed yourself by saying you felt like a creep (you were), but then you proceeded to make a Reddit post to validate yourself, clearly discarding the way you acted. Therefore YTA.\n\nI don’t condone violence or threats of such sort, but I’m glad that Casey has a dad who stands up for his daughter and wants to make sure she feels safe. As a father, you should understand where he’s coming from. If some guy leered after you kids, I’m sure you would have something to say about that yourself as well.", "Huge YTA. Can't believe your wife thinks what you did is OK", " YTA. And your privilege is showing. Obviously that was upsetting to her and you should be embarrassed at your mistake rather than outraged at the dad. \n\nI believe you that you meant no harm, but you caused harm and probably lost a friend. \n\nDangerous men are all around, and being a 19 year old girl is like having a target on your back. \n\nI hope you learn from this!", "YTA incredibly creepy, incredibly tone deaf, don't know how or why you thought this was a good thing to say or that it was any of your business /that you had the right to comment on it.", "NTA but...I'm surprised one even have to point this out, in this day and age. When it comes to men vs women, the atmosphere is \\*so\\* adversarial that a man cannot say a single damned thing, EVER, if there is even the tiniest \\*hint\\* it could be taken the wrong way: no matter how \"innocent\" it, or you, were meant to be! After #MeToo and all that went along with it over the last few years: you had to be out of your F'ing mind to do what you did! These days, anything with even a hint of the old \"I didn't mean anything by it\" will not fly and you will be destroyed for the smallest infraction. I don't even say \"Hello\" or look them in the eye anymore. Frankly, it's liberating: Chivalry is dead, too, so I don't have to concern myself with any of that. And apologies don't matter anymore so...Forget it. Don't let it, or anything like it, happen again.", "once we reach a certain age, like your age, we have to get extra tuned in to what is creepy.  Anything a man over 40 does regarding any woman younger than he, is off limits.  Don't look, talk, or talk about, anything.  its all creepy", "Nta", "From the way he said he felt bad about it he obviously sees he is in the wrong here.  He realized his mistake and tried to apologize.   You thinking he doesn't understand makes me think you didn't really read the post.  He even wrote \"I felt like a creep.\"  This seems to indicate he gets it.", "PS the defense ‘bruh i was only joking’ is not real.  No one has to accept you were only joking. Its barely passable for children to try and pull that, its not acceptable for adults", "make sure she's in company when/if you try to apologise again, no cornering her just the two of you alone or you and your wife vs her.", "Granny here & I agree. That's a throw away line used as a greeting. I can see the neighbor's daughter being startled that someone could see her, but why is that even threatening unless she wears a burka outside the house.", "An adult making a comment to a young girl even if shes of age, about something with sexual connotations does not require the parent of said girl to be reasonable.  And no reason girl needs to give that adult benefit of the doubt", "He said he upset her repeatedly, but a more accurate term if he really \"got it\" would be to say that he *scared her*. It feels like he's downplaying it - if course she didn't know he hadn't been staring at her for ages. Of course her dad kicked off.", "If he \"got it\" he wouldn't have made the post asking if he's the AH. Also, by the way he worded his post to say he has two teenage kids, I bet he has sons, not daughters, but is trying to seem like he \"gets it\" as a parent of teens. Not great.", "How can you explain the sexual connotations of putting on sun screen?  That’s not sexual in any way.", "I agree, OP can say he didn't look for long or try to downplay it. What OP doesn't understand is how his actions were perceived. She didn't know how long he was there, the fact he said she missed a spot could be perceived as he's been watching her for awhile.", "An older guy making a comment to a younger girl, in partial state of dress, probably bikini since shes sunbathing, that hes watching her rub lotion on her body and intently enough that she missed a spot while she rubs lotion on her body….\n\nThats a setup literally for raunchy comedies and some pornos", "I appreciate your point but, in my opinion, I don’t think OP had malicious intentions by making that joke. At least it’s not clear to me that he had malicious intentions. I’ll agree he shouldn’t of said it but I still don’t think he is the AH. John though I definitely think overreacted a bit.", "I dont know if he had malicious intent which would be irrelevant\n\nThat is simply something that should not happen outside a movie\n\nActually now that i think about it the follow up is also .  Want me to help you rub lotion on you.  Since she missed a spot.  Raunchy movies like that were common in 90s.  \n\n\nHow should john react if from his perspective his daughter is upset cause the middle age neighbor was perving at her from his 2nd floor window and said something that could have been a come on", "I think if we had more context things would be more clear as to what OPs’ intentions were at that time."]}