{"id": 19736, "submission_id": "14a1538", "title": "AITA for refusing to help pay for my mother's funeral?", "selftext": "A bit of context. \n\nMy father passed a couple years ago and long story short, it cost me individually over £3,000. He had things planned but unfortunately he deal with the wrong people and basically nothing was paid for. \n\nWhen it happened, I told my mum she needs to get things in order as it will be unfair on her children. She was a notorious procrastinator and her house was literally falling apart around her as she failed time and time again to get things sorted. \n\nDespite constant nagging and promising to get it done, she didn't and has now passed. She wanted to be buried and the casket and burial plot alone are £6k. That's not including any funeral service fees, wake etc. There's 3 siblings and only myself and another is capable of funding any of it. \n\nI've said we just do the cheapest cremation option or natural burial but the brothers are insistent on \"giving mum what she wanted\" and burying her in a casket and typical cementary. \n\nI've flat out refused to put any meaningful amount sorted because as far as I'm concerned, she was told to get it sorted, seen the issue we had with dad and wasn't so old (67) that her mental state was compromised. She was just a procrastinator. \n\nAm I an ass hole for refusing to pay for her funeral?\n\nUPDATE - Forgot to mention that there is NO inheritance for anyone. Nothing significant as she doesn't own her home.", "created_utc": 1686832047, "permalink": "/r/AmItheAsshole/comments/14a1538/aita_for_refusing_to_help_pay_for_my_mothers/", "score": 96, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I refused to pay towards my mother's funeral. It can be seen as an ass hole act as she was good to me for most my life but I'm refusing to pay. I also offered a cheaper alternative that goes against her wishes.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. You mum isn't around to see the funeral, you are not TA to not want to get into debt or spend large sums. It's not unreasonable for you to tell your siblings that having paid over £3,000 for your dad's funeral you just aren't in a position to make any financial contribution for your mum's / can only contribute a limited amount (say 1/3 of what the basic option would be) IF your siblings want to pay to have a more expensive funeral then that's up to them.\n\n&#x200B;\n\nI would say that for the sake of future relationships, it's worth trying to soften things a little, which is why Id suggest that you say you don't have the funds spare to cover the costs, especially having paid so much to sort out your dad's funeral, rather than saying it's because she wouldn't do anything herself, all of you are (presumably) grieving ad everyone tends to be much more emotional and easily upset at that time and quarrels can fester for ages afterwards . \n\nSo stick to 'I'm not in a position to contribute more than £xxx' rather than 'If mum wanted a fancy casket she should have planned better like I told her' you are more likely to be able to retain some form of relationship.\n\nYou could also point out that not having a fancy casket doesn't mean you can't have a full service, and that h casket will be covered by followers or a cloth anyway, equally, it's not necessary to have hired case or a wake if you have a low budget. \n\n&#x200B;\n\nbut I'd stick to *\"I'm sorry, the maximum I can contribute is £xx, If you're in a position t pay more to pay for the plot etc  that's fine, I don't best to her having those things, but I can't cover the extra costs\"*", "NTA.\n\n>\"giving mum what she wanted\"\n\nShe clearly didn't want it if she was unwilling to get her affairs in orders, especially after the loss of your father. That's when most people realize they need some form of life insurance to avoid ruining others' lives when they leave. It also seems that your siblings want you to take care of it because you forked over so much for the dad's.\n\nIf the other siblings want to provide a fancy funeral, let them and let it be on them.", "NTA. Your mom isn’t going to know one way or the other. I told my kids to do whatever the cheapest option is whenever I die, and take whatever is left of my life insurance money and do something that makes them happy.", "NTA. If other people want this, they can pay for it.", "NTA, they want the big blowout, they pay for the big blowout. If you want to share in the expense, pay your share of the cremation option.", "NTA.\n\nIn a perfect world, everyone would have enough money saved to pay for their own funeral. But not everyone can. There are many people living in dire poverty who have no savings at all, and who will probably never will. I hate the idea of burying them in unmarked and unknown pauper's graves.\n\nSo I do think everyone deserves a simple coffin, and either a burial in a known grave, or a cremation, whichever is the cheaper option. If the deceased has no savings and the family can afford to pay for this basic type of funeral, they should.\n\nHaving said that... if it is known that the deceased wanted something more lavish - fancier coffin, imposing headstone, best spot in the cemetery, huge wake - then the deceased's estate should pay for it. If there is insufficient money in the estate, then sorry, Mum, you get the cut-price option.\n\nPut simply: the survivors of the deceased should not have to go into debt to pay for the funeral.\n\nStand your ground, OP. Your siblings are wrong. If this was so important to your mother, she should have made provision for it while she was alive. If it's so important to your siblings, let them pay for the bulk of it.\n\nIf I were you, I'd get a quote for the cheapest option, and divide it by the number of siblings. That's your share. That's the amount I'd hand over to your siblings. If they want to spend more than that, they can pay for it themselves.", "NTA - It sounds a lot and could put you in debt.", "Nta i dont have a close relationship with my mother and i dont think my sibling would be in position to deal with it, so my plan will be cremation as well.  \n\nPeople act like burial is an obligation", "NTA\n\nTell your brothers to pay for the funeral, they are also her children", "NAH. Your mother has passed, so I definitely don’t want to call her the AH. \n\nI went through a similar circumstances with my mom. She was paranoid about dealing with end-of-life details, and died young. It sucks, but what can you do?\n\nI would say that if your brothers want things a certain way, then they should pay for it.\n\nI’m sorry for your loss.", "NTA.   \"He who pays the piper, calls the tune\".   \n\n\nAnd note, when it's time for decisions to be made, the only people in the room are the ones paying the bills, signing the agreement with the funeral director.  So you could go through with it, determining what the funeral will be. \n\nBut. \n\nI can tell you from experience that the death of a parent is an emotional time for everyone.  More significantly, a person who played a central role in the family dynamic has disappeared from the scene.  And so it is common - and it happened to me - that siblings erupt in irreparable schisms, that forever alter their relationships with each other.   So there's a chance if you do change it, you will lose siblings for the rest of your life.    \n\n\nSo perhaps consider that cost as an investment in your relationship.   \n\n\n\\*OR\\*  You can even say this: \"I am not going to agree to any cost that we don't share equally.  So, even if  you cannot pay now, I will pay the funeral costs in full, and you will owe me 1/3 of that, which you will have to pay me back, in monthly installments, over the next 3 (or 5, or whatever) years.\"   That would be a pretty generous offer on your part - and if they refuse that, then they will at least know they are super duper in the wrong in doing so.  And, later on, when they fail to pay you back, you can say magnanimously \"Fine then.  I am going to completely forgive this loan, so we can both move on.\"", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nA bit of context. \n\nMy father passed a couple years ago and long story short, it cost me individually over £3,000. He had things planned but unfortunately he deal with the wrong people and basically nothing was paid for. \n\nWhen it happened, I told my mum she needs to get things in order as it will be unfair on her children. She was a notorious procrastinator and her house was literally falling apart around her as she failed time and time again to get things sorted. \n\nDespite constant nagging and promising to get it done, she didn't and has now passed. She wanted to be buried and the casket and burial plot alone are £6k. That's not including any funeral service fees, wake etc. There's 3 siblings and only myself and another is capable of funding any of it. \n\nI've said we just do the cheapest cremation option or natural burial but the brothers are insistent on \"giving mum what she wanted\" and burying her in a casket and typical cementary. \n\nI've flat out refused to put any meaningful amount sorted because as far as I'm concerned, she was told to get it sorted, seen the issue we had with dad and wasn't so old (67) that her mental state was compromised. She was just a procrastinator. \n\nAm I an ass hole for refusing to pay for her funeral?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA\n\n&#x200B;\n\n\" but the brothers are insistent on \"giving mum what she wanted\" and burying her in a casket and typical cementary.\" .. Since THEY want that, let THEM pay for it.", "A soft NAH. It sounds like you're punishing your mother in her death. She is gone and your brother's remain. A funeral and things are for the living and if you value your relationships with your brothers and other family, I'd consider helping more.", "I’m unclear what exactly the issue is. Is it the money or you’re just unwilling to participate because your mother did not do what everyone told her to do?\n\nYou are the person who needs to live with your decision. If your siblings want to provide your mother with “what she wanted” that’s their choice. I don’t imagine they will appreciate your unwillingness to help but it is your choice. Clearly, your mother was not able to get her affairs in order properly. It appears her procrastination came as no surprise to you & your family. No one should put themselves in debt to honor mom’s wishes. \n\nNAH — very sorry for your loss.", "NAH \n\nSorry for your loss.\n\nI think your concern over value is warranted. It is a lot of money to put towards something that IMHO doesn't matter as much as people say. \n\nYour brothers want to honour your mums wishes so they aren't AH either. \n\nI'd say that its more important how you remember your mum and not where she is buried. If every time you think of them you are going to think about the cost of the funeral it will taint the memory. Find a nice plot to have her ashes spread or body buried whichever you decide and say sorry you couldn't bury her were she wanted but that you loved her and wanted to remember her more than than the grave. \n\nSide note: your mum was 67 so likely didn't claim too much of their pension thus making me wonder why they aren't able to pay for the funeral out of inheritance if there is some.", "Edit: ~~YTA~~ \\-> ESH.\n\nWith no inheritance to make up for the costs, and with the expectation that you'll have to pay more due to one of your siblings ducking out it's also fair that you should have a say over the arrangements.\n\nIt's not right for you to pay nothing, and most people would consider it 'right' to honor your mother as she wished, but you aren't *obliged* to pay for the expensive ceremony either.\n\nI'd offer a compromise between your fair share of the cheap option and the 2k you would have paid for the expensive version, and leave it to your siblings.", "NTA, if your siblings believe it's what she would've wanted, then they should be willing to help.", "Nta if she was on benefits you can contact them about help with the cost.", "NTA.If you can’t afford it, let them do it since they insist. Nobody needs to be buried in an expensive casket.", "They can't order up a fancy burial if they aren't willing to pay for it. \n\nIf that's what they want, it's on their conscience and wallet. NTA", "Nta for the siblings saying give mom what she wanted, they need to pay. Your mom should have set this up. Hell my mom prepaid her moms and her own cremation for like $1200. And the one my mom got is transferable too! You paid for the last funeral. It’s not your responsibility to have to pay for a second one", "NTA. If other brothers want to pay they can pay. Otherwise you do cremation and a lovely, heartfelt memorial at a local park. Keep repeating \"that won't be possible.\"", "NTA you paid for your father's your siblings can fund your mothers", "INFO: aren’t you legally obliged to pay for it in your country? Because in mine you would be, it doesn’t matter if there’s no inheritance. The only way you could get away with no paying is if you filed for bankruptcy.", "NTA. When I die, I want my body donated to science, or something similar so that something productive can be done with my corpse. But if that’s not possible for any reason, just throw me in a ditch if it’s the easiest thing to do. I’ll be dead, won’t make any difference to me.", "YTA\n\nBury your mom, dude. Jesus. If not for her, do it for your siblings, who are clearly grieving and upset by the idea of giving their mother the cheapest possible disposal of her mortal remains.", "Another question is this: How much of an impact will paying for the funeral be? If you are a millionaire maybe you're just being stubborn. If paying means that you will have to give up or postpone necessities, then you shouldn't have to pay. Who helped you pay for dad?", "My Mum says the same. She loves her garden and gardening, so always says she’d be happy in a cardboard box at the bottom of the garden, if it were legal.", "And if the mom wanted it, she had the time to arrange it, but now the burden falls to her kids, then the kids get the say.", "Important question and I've updated the opening post. There is no inheritance.", "This is the best answer here O/P you're not obliged to do anything. \n\nHowever one thing I would say is do not push a cremation when the individual wanted a burial. Go for the cheapest option but please don't go against their dying wishes.", "People need to live within their means even if it's upsetting, even if they are grieving. Siblings aren't a money tree to shakedown because they are feeling grief. \n\nPeople like you are just guilt trippers.  It's completely inappropriate to use guilt like that get an expensive burial.", "my mum is the same only she wouldn't want the box lol, she said just stick her in a hole and she's happy", "I should have put info tbf. That changes things, thanks for the update."]}