{"id": 19796, "submission_id": "14an02e", "title": "AITA for saying my sisters boyfriend can't move into a 2 bed apartment with me and my girlfriend?", "selftext": "My girlfriend and I have been living in the same 2 bed apartment with my sister in NY city for the last 1.5  years. We rent off a family friend, so the rent isn't too bad and it's actually how we ended up living together in the first place as we were offered it on the cheapish. Otherwise we'd never have ended up living in this situation. \n\nSo out of the blue I get a text from my sister (who's away on holidays with her bf) saying that her boyfriend is moving in in a few weeks time and it's ok cos she already cleared it with the landlord. This has not been discussed in any way yet with me or my gf. In fact the opposite was... there's been a few periods when he'd come over and stay for a week+ in a row and we'd had conversations how the place wasn't that big and was very cramped when he stayed over for more than a coupe days. It particularly feels this way as they both work from home and don't have to do too many hours in work. Whereas the 2 of us are the opposite having to go into work and dont get home until 6.30ish meaning we're only home in the evenings if we're not out doing something after work.\n\nI understand how she wants to move her relationship forward and obviously wants to build something with him but feel that we've been put in a seriously awkward position as if we don't say anything we'll end up falling out and me and my gf will probs end up having to move out so that we have enough space. Whereas on the other hand if we do say something it's obviously going to drive a big wedge in between the lot of us which we obviously don't want either.. \n\nWhat are peoples thoughts? How should we go about resolving the situation?\n\nEdit 1: lot of people highlighting the lease situation. Noted that there is none in place, so we don't have anything in writing which would prohibit this move in. However, the 3 of us moved in together as a group initially on the basis that this would be the living situation.\n\nWe've had multiple discussions about the size of the apartment before and how there wouldn't be space for another person to move in.\n\nUnderstand how in a completly fair situation she would get a chance to live with her SO but the circumstances aren't exactly fair for that given the agreed arrangement up until this message was sent to me. (To note they've been going out for 18 months and broke up for 3 in the middle, while menand the gf are together 5 years) If this was a bigger apartment there'd be as much of a problem. The first big issue is space. \n\nThe next which I hadn't mentioned is he's extremely messy and not curtious when it comes to sharing the space whenever he's over. Will come in and take up the kitchen/living room by WFH during the day, not cleaning up after himself after work, leaves a mess when cooking and then will happily sit down on the couch watching TV for the evening so that we're confined to the bedroom. \n\nLot of info in the above edit but just trying to make the full picture clear as to why it will be a very uncomfortable situation if he was to move in.", "created_utc": 1686889759, "permalink": "/r/AmItheAsshole/comments/14an02e/aita_for_saying_my_sisters_boyfriend_cant_move/", "score": 769, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > What I want to say is that he can't move in as there's physically not enough space for 4 of us. If I say this it will make me look like an asshole but I'm not surenif that's completely fair as I think this has all been caused by her\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Uh I've gotta ask does your sister live with you?", "First of all, your post is misleading. You make it sound like it's just you and your gf living there, but it's you, your gf and your sister.\n\nAnyway, you and your sister are both living in a rental apartment with family bonus (cheap rent). That family bonus is an important key factor. \n\nThe owners of the apartment presumably has the same relationship to you and your sister, so they want to treat you both the same way. \n\nYou had the option to get the family bonus for yourself and your gf. Now your sister wants the exact same conditions, family bonus for herself and her bf.\n\nI get that this impacts your living quality, but at the same time, your gf has impacted your sisters living quality in a similar way. If your gf had not been there, it would have been only you and your sister, and the apartment would have been even less crowded.\n\nThe only difference between you and your sister is that she wants to change status quo, whereas you have always had the double family bonus. I don't think \"first come first serve\" is fair in this situation. Why would you and your gf get a cheap apartment from your family friend, but your sister is second in line and has to rent one for regular price? That's not fair.\n\nIf the apartment is really too crowded, a good compromise would be to find a comparable one for one couple and split the cost of both rents. So that both couples have equal family bonus. \n\nAs of now, I say YTA, because I don't think you have the right to complain", "YTA. Your post is deliberately misleading as your sister lives in the apartment too. It’s not fair that you are able to live there with your partner but your sister isn’t. The landlord is ok with it so if you don’t like it then move. It’s not your property and you don’t have a lease so you can’t dictate who gets to live there", "So how are you not the asshole when you already got your gf living in a space where maybe your sister didn’t want to share with an extra person?", "ESH - you make it sound like it's just you and your GF living alone, but it's you and your GF in 1 room and your sister also living with you in the other room. It's as much her place as it is yours and she's already cleared it with the person who really gets to have a say in the decision, the landlord. \n\nI will say, you should have been the phone call before the landlord and it should have included a discussion and plan of action; it definitely sounds like she sprung this on you without much notice and probably is aware that it's been cramped when he's stayed over previously so will definitely be a big transition which will impact both you and your GF. \n\nYou can say that you don't want him moving in but it won't really solve much since it sounds like it's already a done deal and will most likely just cause tension right off the bat (if you think it's not done and that your sister might actually understand, go for it, but your post doesn't make it sound that way). \n\nYour options really are to make the best of it (probably should sit down and try to figure out solutions to anything you considered a problem from when he has stayed there previously, while keeping in mind that this will be an adjustment for him as well and that he deserves to be able to settle in, so grace is need on both sides) or start looking for a new place asap. Maybe start by discussing with your GF and seeing what she thinks would be the best course of action.", "INFO This all depends on whose on the lease etc. Who’s on the lease, who’s paying what portion of the rent and what was the original situation?", "Question: where you living together when your girlfriend moved in? And how was it treated - did you also just tell your sister your girlfriend was moving in and you'd already checked with the landlord or was there more of a back and forth?", "INFO: Do you have a lease? Does your sister pay half the rent or 1/3rd?", "So you, your GF and your sister all live in this apartment. It's ok for you to have your GF live there but not your sisters BF. YTA. Why do you get to have a live in partner and she doesn't? Did you discuss it with her before your GF moved in?", "NTA, you're not the one driving the wedge, it's your sister trying to tell you, not ask you, to move someone else into your apartment.  You need to not wait but get back in touch with her immediately and tell her absolutely not, the place is too small for that, and you will not entertain it any further.  If she says she's doing it anyway, you'll need to contact the owner and tell them this was not discussed with you and is not ok with you.", "NTA- should have been discussed prior.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy girlfriend and I have been living in the same 2 bed apartment in NY city for the last 1.5  years. We rent off a family friend, so the rent isn't too bad and it's actually how we ended up living together in the first place as we were offered it on the cheapish. Otherwise we'd never have ended up living in this situation. \n\nSo out of the blue I get a text from my sister (who's away on holidays with her bf) saying that her boyfriend is moving in in a few weeks time and it's ok cos she already cleared it with the landlord. This has not been discussed in any way yet with me or my gf. In fact the opposite was... there's been a few periods when he'd come over and stay for a week+ in a row and we'd had conversations how the place wasn't that big and was very cramped when he stayed over for more than a coupe days. It particularly feels this way as they both work from home and don't have to do too many hours in work. Whereas the 2 of us are the opposite having to go into work and dont get home until 6.30ish meaning we're only home in the evenings if we're not out doing something after work.\n\nI understand how she wants to move her relationship forward and obviously wants to build something with him but feel that we've been put in a seriously awkward position as if we don't say anything we'll end up falling out and me and my gf will probs end up having to move out so that we have enough space. Whereas on the other hand if we do say something it's obviously going to drive a big wedge in between the lot of us which we obviously don't want either.. \n\nWhat are peoples thoughts? How should we go about resolving the situation?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Tell her you that you aren't willing to allow him to move in and that he'll need to find other arrangements. She should have asked, and not just talked to the landlord. \"Hi Sister Name, I'm sorry, but having another roommate just isn't possible for us right now. BF will need to find a different living situation.\" And yes, she'll call and demand to know why, and you don't have to explain. But if you want to, tell her that it wouldn't be healthy for your relationship with your gf at this time. And don't get into fights, don't get into arguments, just say no. NTA", "NTA for feeling like the apartment will be too cramped for four of you.  I would have that conversation with you sister and say that you understand her wanting to live with her boyfriend,  but that will end up crowding you and your gf out, so you both plan on moving out by a certain date.", "Yes, lol. It's a 2 bed apt.1 room me and my gf live in and she has the other. There's another room which has a kitchen/living room/utility grouped into 1.", "Have you confirmed with the landlord that it’s actually ok with him?", "If I say no, it may cause problems in their relationship. Either might cause her to move out or to then hold it against me.", "I, too, am annoyed at OP for making it sound in the opening like it's just him and his gf in a 2-bedroom apartment.\n\nOP, you, your sister, and your girlfriend need to have a sit-down conversation about all of this - that you don't want another person in the place and then what changes need to be made if she insists (expense split, for example). You should also be prepared to find another place or try to push your sister out. Start with a talk between you three about your sister's proposal. I think that's how I would treat it at the moment - she has proposed that her boyfriend move in with you all.", "Original situation was we all moved in together and had an agreement with the landlord that the 3 of us would split the rent 60/40 with me and my gf paying 60%. No official iap lease as its a cash in hand situation", "Not an official one. We pay in cash to the landlord. Its a 60/40 split in rent with us paying the 60%.", "The 3 of us moved in together at the same time. I had discussed with her a while back about how the place was cramped as her bf was staying there for several days in a row WFH and not going back to his own place. She agreed before that the place was cramped and she wasn't looking for him to move in. Agree if all things were fair he should be allowed move which I wouldn't object to but there's just limited space and we'd be on top of each other if there were 4 of us there.", "OP’s sister lives there too, OP doesn’t have a lease and the landlord agreed. I think it’s not that straight forward. I do think this should’ve been discussed beforehand.", "The post is misleading. It's the apartment of OP AND his sister. Op gets cheap rent for himself + partner and his sister wants the same conditions. I think it's fair that both siblings get the chance to profit from the cheap rent in the same way, since it's only cheap due to family connection.", "Thank you, that's how I was feeling but it's a tough one to broach without causing a fight. Conversation needed obviously", "Who all is on the lease? When you moved in was your partner agreed upon or?", "You might have misread this one, they asked how could you not be the asshole here", "Boyfriend moves in and rent changes to 50/50\n\nEdit: Otherwise you would be YTA. Sister would be the YTA if she refuses to the adjusted rent .", "Well, I definitely wouldn't be paying 60% anymore if you are all sharing. Hate to say it, but without a lease and it IS someone else's home...but sucks to be in your position. Is it already a tight fit?", "If all things were fair you would ask your GF to move out so her BF could move in for the same amount of time your GF was there", "So what if she lives there too?  That contradicts nothing I said - she's trying to move someone else in without asking them.  Normally when you lease a place, to change those terms, everyone has to agree.  \n\nIf the sister wants to move someone else in, she needed to ask.  And if the landlord says they're not interfering, OP should tell them then we'll have no choice but to move out, and tell the sister that if you force us to move out, that will be the last time we speak for a long time if ever, because you don't get to just throw my life on the fire for your own wants.", "Have you confirmed with the landlord that it’s actually ok with him?", "Yep, sorry you're dealing with it, but not your fault, it's gonna be an unpleasant conversation because your sister seemingly doesn't mind making your lives very uncomfortable.  She should have discussed this idea with you before bringing it up with the BF or landlord, and any considerate person would know this - she is trying to force you, and that's the cause of the conflict.", "It's not an official lease so that's where it's a bit blurry. When we moved in we agreed with the landlord that we'd pay a fixed amount (in cash) every month but yes it was agreed that the 3 of us would move in together initially and all moved in at the same time.", "Haha that's for sure! Yea it's perfectly fine for 3 ppl and we all have our own routines that work well together but with 4 we'd be completely on top of each other", "That’s a lot of hypotheticals which don’t apply to the current situation. The landlord is doing him a favor and does agree with a fourth person moving in. Also, there’s no lease. Of course OP can decide to move out and not talk to his sister. But that would be totally on him.", "You don’t have much ground to stay on if you don’t have a lease and your landlord agrees. She should have discussed it beforehand but if you can share your room with your GF, is it so unreasonable to want to share her room with her partner?", "No I completely understand that and she should absolutely be entitled to. If the place was bigger and we wouldn't end up so on top of each other I'd have no issue but I get ya with the lack of lease. Was always going to end up causing issues 😮‍💨", "ESH you can't have your gf live with you, then deny your sister having her bf move in. She sucks because rather than talk with you first, she dropped it on you.. but she probably knew you'd say no if asked. \nTime to look for a new place mate", "YTA I feel like you got yours, but you don't want your sister to get the same deal. She cleared it with the landlord, so she is in the right. It's a shared apartment, not your apartment exclusively.", "I would bring up that it hadn’t been properly discussed and that it doesn’t fit well with your expectations. I assume as there are 2 of you (you and your partner) you probably have the bigger room, pay more rent etc. I suggest you approach it from the angle that you’ve been paying the bulk, and that you weren’t consulted and that you don’t want a 4th person in the house, suggest they find their own place and that he stays in the interim. NTA\nDick move on her part, she may have just been excited and unintentionally blundered, however it sucks to be in that spot.", "Or you can move out since you're the one with the problem.", "light YTA. I get why you wouldn't want him there, but it's unfair to your sister. I think more than lack of space. The issue is that you don't like how he shares (or more accurately doesn't share) the space in the common areas, right? So make some rules about that as a condition of him moving in - and the rules apply to everyone. \n\nSo kitchen mess gets cleaned up immediately, no WFH in public spaces, divide up who gets the TV during the week, etc. Things like that. You don't have to just hide in your room & endure it.", "YTA,  when it comes down to it if it's ok for you to have a SO there it is for her too.    It's cleared with the landlord already.    What you can do is put your foot down about the common areas and demand rules for availability.    WFH should be relegated to bedrooms etc.   You shot yourself in the foot with starting out with \"he can't be here at all\" though.", "OP - it's normal to feel upset about this situation after you've been living in a way that suits you for 1.5 years now, and it'll be disruptive to your routine to have him move in. I think you do understand that you are being unfair to think you get the privilege of having your girlfriend live there, but your sister doesn't get that privilege. But you think the disruption to you is more important than the unfairness to your sister. It isn't. And if you think about it honestly, you know this.\n\nYou should all sit down and talk about your concerns re overcrowding and how this is going to work, and come up with a roommate agreement. It is different having someone there for a few days than it is living with that person. Once he moves in, it'll take a bit of time establishing a new routine. Unless this guy is a problem roommate, you'll adjust in time to having him there. And if it's still a problem, then at that time, you try to figure out a new plan. You need to open your mind a bit and realize you are jumping to conclusions about how it's going to be, and really consider if it is worth it to possibly wreck your relationship with your sister.\n\nETA: YTA", "YTA!\nYour sister pays more than you on the rent. Although the three of you moved in together, things change. I’d say she went to the landlord before you because she knew how you’d react, and you’re proving her right. \nUnless your girlfriend is moving out, it’s unfair to think that only you and her can benefit from the apartment. \nYou guys can work around and ask for the lar to WFH from their bedroom and/or set up a home office for him in a corner. I’ve seen 4 people sharing a one bedroom apartment that’s the size of my bedroom in Dublin. There is room for both siblings and their partners. So either your partner leave or her partner move in.", "i’m gonna say nah. it’s understandable that you wouldn’t want another person living with you, but it’s obvious why your sister would want to have her partner living with her just as you do. i agree with the other commenters— it might be time to consider moving out. maybe use the reduction in your rent save up and find another place with your girlfriend", "Going against the grain here NTA/ESH. its not exactly 'fair' to her but the three of you all *agreed* to move into this place as just the three of you. She wants to change the status quo and move a fourth person into a cramped apartment. \n\nDoes the landlord know you are not supportive of this move? Given its a family friend etc he probably just okayed it and didnt give it much thought.", "NTA, your sister is being sneaky doing this shit behind your back. Thr place isn't big enough for 4 and you got there first. I'd bring up the issues you've mentioned here with your sister, his attitude when it's already not his place doesn't bode well for future harmony. I predict that you will move out if he moves in. I'd also contact the landlord and raise your objections as this was never agreed with you. Of the answer is...no lease...tough shit...then just give notice and mention how a consultation would have been nice.", "Unless your girlfriend is moving out, it’s unfair to think that only you and her can benefit from the apartment.", "One roommate arbitrarily bringing in another person without discussing it with the other people who already live there isn’t an AH move because it’s their boyfriend?", "because the three of them agreed to that at the time?? And shes trying to change the terms of the agreement", "See, you've made your post deliberately misleading so YTA for that on its own really", "It sounds like OP was just expecting the sister to move out at some point and have the cheap rent to themselves so I have to ask what the catalyst event that they saw changing this living arrangement was. Engagement? A raise? Both neccessary to justify and afford no sister living there? Valid complaint, too many people- but all good things come to an end and it is a majorly unfair complaint to the sibling moving in at the same time who was 3rd wheel for 1.5 years. Honestly sounds like NY isn’t the right place for this couple as with them saving so much already and living together so long a larger place of their own is the logical next step which is…unattainable? Majority rules kinda but also it’s a privilege to live there and the sister and SO have no complaints so. If you’ve been living together 1.5 years (so likely together for 2-4 years) it’s time to discuss living alone together anyways, right?", "so she’s paying more than the two of you and yet she doesn’t have a say? You pay 35% and so does your girlfriend. \nYTA.", "That actually depends on if you and your GF already got the master bedroom and possibly an ensuite bathroom. If you get a larger room, then it can be perfectly valid that you continue to pay more of the rent. The only thing that should definitely become 50/50 is the utilities", "NTA because she didn't discuss this with you beforehand she went directly to the landlord. Also because her bf comes in makes a mess then leaves it for someone else to clean then commandeers the whole living room with no respect for the fact that there are other people that live there and he does not. but i dont really think you have any choice in the matter except to see if your family friend has another apartment or find another one. this is something you wont win on", "ESH. Your sister has just as much right to have her boyfriend there as you do. If you want cheap rent, you will just have to suck it up. The only thing you can do is insist that your sister's boyfriend do his share of cleaning and that he can't live like a slob. Rules are important is such a confined space. \n\nIf the second couple works from home, they should do their food prep and cleanup before you get home. You have equal rights to all common spaces.  He doesn't get to take over the tv.\n\nMany people living in a small space is doable for the sake of saving money if everyone follows house rules and respects others. We once lived 10 young, working adults in a small 3 bedroom house with only one bathroom. Everyone was given a 15 minute time slot to shower . Thank goodness we had slightly different schedules and were able to make it work. \n\nIf you are lucky, your sister and her BF will break up soon or move elsewhere once they get the chance to find something else.", "NTA.  Tell your sister the truth.  Your apartment isn't big enough to share between 4 people and if she did move in with her SO, it would ruin your relationship and you would hate for that to happen.  That is the fact, with the slobby SO a second round of ammunition if needed.  Sometimes 'No' is the answer.  Apologize for the situation and try to help her find an alternative.", "Yta based on what's good for the goose, is good for the gander. \n\nYou'll have to implement schedules and rules, ie:\n\nLiving room schedules if it is truly too small to all occupy at the same time. Specifically when you and your GF come home from work and settle y'all should be able to get an hour or two in the living room as they WFH and have free access all day \n\nHe needs to understand in small spaces picking up after himself within a timely fashion is imperative. Like cook and eat but once done eating clean up his mess, not leave it till the next day or whatever so that the facilities and utensils are readily available for others. \n\nMaybe have a once a month meeting as a family (he is family op, as he and your sister are committed) to iron out any wrinkles in the dynamic without animosities brewing", "Is he planning to pay his share of rent and bills? I'm assuming it's currently split 3 ways, so would him moving in split it 4 ways now? If it's split 50/50 with you and your girlfriend only paying half, then yes, it's totally fair for your sister to move in her boyfriend, but split three ways is more of a gray area....\n\nDid your sister ask or just tell you it's happening?\n\nCan you and your girlfriend just move out? \n\nFrom what's been said about the boyfriend being messy and rude, I'm going to tentatively say NTA, but it's really close to ESH. Your sister should be asking, not telling, and it sounds like he's a shitty person to live with, but it also sounds like it is only really fair if your sister can also move someone in since your girlfriend lives with you (depending on how costs are split)\n\nBest scenario is you and your girlfriend just move out. No drama that way. Your sister gets what she wants, you and your girlfriend get the peace you want, no relationships are damaged, and you don't have to live with a slob....", "YTA. If your sister lives there and pays rent, and the landlord is okay with it, you can’t do anything. You don’t have a lease. Let it go.", "YTA. Fine for you to live with your girlfriend in that apartment. But now your sister can't do the same.", "Give us an update !!!", "NAH it’s reasonable for your sister to want her bf to move in when your girlfriend lives there, fair even. While you mention too crowded for 4 what I pick up on is more of how he is an inconsiderate and incompatible roommate. Up until now he has been coming and treating it as entirely his home and you have accommodated him because he is a guest and it was temporary. At a minimum you need to have a roommates meeting one with your sister first about your concerns regarding him moving in and then deciding how to bring their concerns to him. It’s possible he is willing and he is certainly able to clean up after himself. Agreements like the common space isn’t used to wfh during certain times, even a schedule for which nights which roommates have access to the living room tv etc. This may work with rules structure and a schedule.", "YTA. Your post is very misleading, you made it sound like it’s just you and your girlfriend living there but your sister also lives there. It’s not fair that you get to live with your partner and she doesn’t. She’s already cleared it with the landlord and doesn’t need your permission", "YTA. If there is enough space for your girlfriend , there is enough space for her boyfriend.", "YTA for your misleading title. \n\nAnyway, either your gf moves out or you have no cause to say no to him moving in.", "This is still an oral lease. It's not about what's \"fair\" it's about what the parties agreed to. And unless the op moved his gf in without telling the sister and she lived there first, it's really not the same situation at all.", "Honestly I think it was a YTA from the start bc OP very ~conveniently~ left out the fact that his sister lives with him and his GF and that the friends of the family offer of reduced rent was given to him and his sister, NOT his GF (only saying this about the GF bc it would be a different thing if the landlords gave GF an individual reduced price but it seems that she gets reduced rent bc she’s dating/living with OP, whereas sister gets reduced rent outright)\n\nI also think it’s odd that OP only added it bc the question of whether or not his sister lived there is the second most popular comment, so it couldn’t be left unanswered.\n\nThe wording on the original AITA is really odd bc from the start it sounds like his GF and him live alone in the apartment and his sister suddenly squeezed in her BF even though she doesn’t live there.\n\nHow odd to include such an important piece of information at the bottom instead of the actual post.", "How does she pay more in rent when the couple pay 60%", "Right?? I can't believe the number of folks saying it's \"unfair\" he can have his girlfriend there but she can't have her bf.... This is a housing/landlord tenant situation, and life isn't fair. Even if there's not a written lease there's an oral contract and they didn't consent for it to be changed! \n\nNot to mention like... Yes they have benefited from cheap rent. That doesn't automatically mean that sister should get the same benefits because faaaaaaiiirrnnesss. If op and gf were ready to move in before she and her new bf, that means they get to take advantage of some opportunities that existed then but DON'T now!", "Why was that NOT mentioned at ALL in the post, except in a roundabout, completely indirect way? \n\nAlso, you're subletting for cheap from a family friend, so why do only you and your girlfriend get to benefit from this, and not your sister and her boyfriend? If your bedroom can house a couple, why can't your sisters'?", "Can I ask what gives you the right to have your partner in your apartment but your sister can’t have her partner in her apartment?\n\nNot being sarcastic here, just genuinely asking. I’m sure it feels inconvenient and cramped to have your sister’s partner in the apartment. But I can’t help but wonder if your sister felt the same way about your partner.\n\nNot to mention it feels awkward as hell being the third wheel. I can’t imagine living with a couple and constantly being the third wheel. Your sister has just as much a right as you do to have a partner living with her.\n\nIt’s not fair that only one gets to benefit from the reduced rent. You should be grateful rent is reduced in the first place.\n\nYour sister wants to bring her BF over and she has every right to do it. Tbh the only reason she has the right to do it is bc the landlord is trying to benefit you BOTH as you both are friends of the family. Therefore it’s not fair to favor one over the other.\n\nI would also like to add that it’s NYC. And as a New Yorker… there’s no room anywhere. Rent will always be expensive. You will have to make sacrifices like space and privacy for the sake of having cheaper rent. I would think of this more as a roommates situation.\n\nYour sister sucked it up for over a year. Now it’s your turn. You get to have a life in your apartment, and so should she. You are the only one with a problem here. That means you either (a) suck it up, or (b) leave. Up to you.", "You might want to state that in your post.", "Goes exactly the same for OP's girlfriend, so in that case OP has been the AH for as long as she's lived there.\n\n~~And before you go “But that was probably discussed before they moved in!”: Yeah, and so is the sister opening the discussion now, so where do you get “arbitrarily bringing in another person without discussing it”?!?~~\n\nAh, duh – after rereading OP I got that. Yeah, perhaps a bit abrupt... But still, only fair. He's had his GF there for 18 months; Sis' turn now. If the place is too cramped for four, GF gets to go.", "If it’s not breaking the lease, then it’s not an AH move", "He didn’t post that in the original post. OP made it seem like it was just him and his gf living there. And his sister was trying to move in her bf", "And she'd be fully right to hold it against you.", "And wouldn’t they split that between them meaning they each pay 30% while she’s paying 40%. They may be a couple but they’re still two people.", "She’s already paying more than them, so she’ll definitely agree to the 50/50", "So the GF gets screwed over? And that is fair to you? In what world man. OP and GF have been together 5 years, that's planning your whole future together status. Sister and her BF haven't even been together a solid year (they broke up in the middle- timer starts over as far as I'm concerned when that happens. Especially since they broke up for months). What happens if your plan happens, kick out gf move in bf, then they break up again? This isn't even to mention the rude ways the bf has been show to act when he does \"share\" the space", "Not even “all things” — if _OP_ were fair, he'd do that. But he won't, because he isn't.", "Feels like the word “initially” is doing an awful lot of work there.", "Because that makes NO SENSE. WHY is everyone in these comments advocating for the COMPLETELY INNOCENT gf to get kicked out of her home? She also pays rent. She moved in at the same time. Regardless of anything with the sisters bf, WHY would you screw over the gf? Because you think op is a meanie? Jesus christ", "If you have a problem with it, why don’t you move?", "So, you've been enjoying living with your GF for quite a while. Isn't it Sis’s turn now? Fairest solution is, if the flat is only big enough for three, your GF leaves.", "What is this line of thinking? This makes zero sense. Screwing over someone who moved in with all parties agreeing for a guy who has not even been with the sister for a year straight? Come on, get real", "My thoughts on it would be that given its her that's changing the status quo that if there's adjustment needed it should be on her part. Not fair for anyone to make such a big desicion without even consulting the other house members.", "So you were just going to expect her to stay single forever? Why is it that only you get to benefit from reduced rent?\n\nI would argue that you affected the status quo first. The family friend offer was given to you and your sister, not your GF. Your GF isn’t a friend of the landlord.\n\nShe only gets cheaper rent bc she’s dating you. You and your sister are at a time of growing and changing. Does she not deserve a life with a partner (like you’ve had for a year and a half by now)?", "NTA", "Nta. I feel I would have to speak up and be blunt how you feel. Why has her perspective changed. Why didn't she come discuss with you guys. If willing to try what firm boundaries you have. Sucks! Best of luck.", "NTA. This is a recipe for disaster. Don't allow it.", "YTA. Your post is deliberately misleading.", "YTA. \n\nYou’re really clinging to the technicality of you three moving in at the same time so you all agreed to the original living conditions. \n\nYou’re still an asshole though because it’s only fair for her to have her significant other living with her if you’re allowed the same. You couldn’t have reasonably expected her to stay single forever.\n\nIt is technically correct for someone to not split an inheretence from an abusive parent between their siblings.  But that does make them an asshole in some cases.  Same thing here.  You’re technically within your rights of the original agreement to deny him moving in, but you’re still an asshole.", "You are NTA but your sister kind of is for putting you in this position. She is trying to change your living arrangement to something really uncomfortable. I would put my foot down and say absolutely not.", "Additional information needed. Will rent be split 50/50 now? Has there been any conversations in the past or since about her wanting a boyfriend move in. Discussion needs to be had.", "Wow.  Flat out tell her that another person is not welcome - in writing with both of you signing it.  If she us not the leaseholder, I would  change the locks before she returns.  But, legally, it may come down to whoever is on the lease making the decision.  Also, does the lease  say how many people are permitted?", "I would say this sucks but you have nothing in writing so this is 100% up to the landlord.  So, NAH, but you may very well be screwed.  I'm from NY so I can only say...good luck.", "INFO \n\nHave YOU talked to the landlord??\n\nDoes the landlord know that YOU and your GIRLFRIEND don't want a 4th  person in the apartment??\n\nCan you and your gf afford to pay for the place just the two of you???", "YTA", "So your sister planned with her bf for him to move in without speaking to you and your gf. She spoke to the landlord without speaking to you and your gf. She **told** you that he'd be moving in.\n\nNTA all day everyday. As soon as it became a discussion btwn her and her bf, you and your gf should have been included. You need to talk to the landlord and make sure that they're actually ok with it, and they know you're not ok with it. Considering how your sister has gone about this, she probably preemptively told them you and your gf don't mind.", "NTA - everyone who currently lives there has to agree to an additional person…. Why would you want to live with a slob", "NTA... but discuss this with property owner. \n\nINFO: Do you have the right to say no to others living there? \n\nGet the rental details in writing. Then say NO", "NTA. All it takes is one clown to mess up a wonderful deal. Tell her as clearly as you can you don’t want him. But it looks like the good times are over.", "You need to have a talk with the landlord and tell him you are not ok with him moving in. She didn’t even ask she just demanded. The agreement when you all moved in was for the three of you not 4.", "YTA for both being a huge hypocrite and for being misleading with your post.", "Your sister should be able to have her boyfriend move in since your girlfriend is also living there.  The family friend offering the cheap rent discount offered it to you and your sister, so she should get the same benefits as you.\n\nWIth respect to the living situation, you should establish some ground rules about:\n\n1) Clean-up of the kitchen/living room/bathroom spaces after each use\n\n2) Consider alternating the nights that each couple gets to use the living room such as three nights for each couple (alternating the nights), and one night shared with everyone.\n\nGood luck.", "I truly believe OP has the right to move out now and sister has no right to complain. If one roommate gets to make a decision about the living situation, it's only fair that the other does to.", "OPs gf has been there and doesn't work from home in the kitchen.  Another person in a small apartment is a big difference..", "OP, the sister, and gf all moved in together at the same time. They all agreed to the living situation before hand", "Except it’s probably already uncomfortable that way for her?", "I assume rent would of course have to be split. No discussions held at all. The opposite in fact in that she said he wasn't ever going to move in cos thr place wasn't big enough", "How are you splitting the rent/utilities?", "lmao wait you're going 60/40 and trying to control your sis? She's paying more in rent than you bruh. This just keeps getting worse.", "In this case yes. Because OP already has a guest there that lowers the sister's quality of living. It's only fair she's allowed to bring her partner over. They're in the same situation. Either both are allowed to have their partner over or neither is. OP is not special", "He also left out that the rent split is idiotic and favors  him.\n\nThe current split is 60/40:\n- OP: 30%\n- GF: 30%\n- Sister: 40%\n\nAs a fellow NYer, grow tf up - most of us learned how to live with multiple people in shoe boxes, and yall are complaining abt this?", "Sounds like you gaslit your poor sister. You're not a very good sibling.", "Most people saying YTA aren't concerned with the contract, they're just calling OP out for being shitty, which he is.", "35%?", "30%", "That's not how being an asshole works.\n\nJust because something is legal doesn't make it a non-asshole move. It's legal for me to wash out the stinky garbage bin only on days when my neighbours have a BBQ. Would still make me an asshole.", "but they share a room and sister gets a room by herself.   60/40 seems like a fair split-- though when sis's bf moves in that should change to 50/50", "It doesn't matter how long they've been together and that's the same gaslighting technique OP tried to use. Equating how important the sister is to how long she's been dating her bf is shitty.", "Here’s the thing. It sounds like you get a massive rent discount. \n\nIf you want to KEEP getting that massive rent discount, find a way to adjust everyone’s routines.", "It's just thinking realistically. Living with someone is a huge step, and starting off with creating tension isn't going to make it an easier transition. The sister set this whole thing up for failure by going above everyone's head. Tension is killer. \n\n\nI'm not saying the sister is unimportant, I am saying it is remarkably silly to kick out the gf in favor of the bf. By your own logic, is ops girlfriend less important than the bf? Why? And that's not what gaslighting is, this is just a difference of opinion. My opinion is that the GF shouldn't get kicked out to make room for someone that hasn't even been around that long", "She could just as easily tell you to move out or move your gf out.  Sorry.", "i don’t get why you can’t sit in the living room just cause he’s there too. each couple has their own bedroom, yes the bathroom situation might be a little hard but i don’t see any other issues", "Yup, sounds like the cheap rent party is over.", "Unfortunately for you, you don’t have much of a leg to stand on. You’ve got no official lease and a landlord who already agreed to a 4th moving in. Your sister has just as much rights as you do here, so it’s time to face reality and make it work. Schedule a roommate meeting and set guidelines about expectations for all living together peacefully. If you can’t do that, it’s time for you to move out.", "YTA - it’s equally her place as it is yours. Your post is misleading", "I’m kinda confused by the amount of Y T As. NTA you can’t just move someone into a shared space without asking/talking to the people you live with. The three of you (you, gf, and sister) moved in together so her living with y’all isn’t new. The fact your sister is entitled enough to essentially say I’m moving my bf in whether you like it or not is inconsiderate at best.", "Do you split rent 3 ways or two ways. If it's only two ways, you don't have a leg to stand on here.", "YTA but I do sympathize with your reasoning. Living cramped like sardines sucks! But just because the agreement was just the 3 of you originally doesn't mean anything. Life goes on, circumstances change, and people have to adapt. The fact is that you and your sister have a family friend that is doing yall a favor. While I agree that your GF is not a guest and this is equally her home as it is your sisters, you have to realize that barring your sister from having her partner live in her room is completely unfair if you get to have your gf live in yours. The fact of the matter is that if you and sister were to move out, the deal on the rent would not extend to your gf alone. That is the difference. She may not be a guest in the house, but a special accommodation has been made for you. It's only fair for your sister to get the same accommodation. \n\nThat being said, I am sincerely sorry your sister doesn't value the limited space you have like you do. I know what its like to be in a very cramped living situation and I don't wish it on anyone... especially if sharing a bathroom.", "At first I was going to say you were the a hole. But then once I read that they broke up for 3 months in the middle of the 18 months, my mind has changed. Majority of the time if a relationship breaks off it’s for a reason. Which means it should be left alone. If they couldn’t push through whatever issue they had prior, Who is to say they will in the future? Living together completely changes the dynamic of a relationship as you will truly see someone in their actual light for the first time. People can easily wear a mask when they do not live together. I would not be comfortable with it for that reason.", "YTA. You make it sound like it’s just you 2 living there- but your sister lives there too. Why do you get to live with your SO but she doesn’t?", "Nta. Y’all moved in the three of you as roommates. None of you should be allowed to just spring on the fact that you will be adding another human to the living quarters. That would need to move brought up and discussed. So that once you come together and each figure out what you want, if they don’t align then one of you can make plans to move or maybe come to some compromise that works for you all. But she can’t just say “hey I’m moving my boyfriend in to our shared home without discussing it first, just deal with it” \n\nPeople who are calling you the asshole I think are hung up on the fact that you are in this living situation with a partner and so they are thinking to be “fair” she should get to live with her partner… which I can see where they are coming from IF your sister did come to you and spoke about her desire to mover her boyfriend in and NOT just tell you she was moving him in.. this behavior shows that she feels she has more rights or power over your home, when you all should have say, Vince why the only appropriate way to have addressed this situation is with a conversation and not a demand. IT IS A SHARED APARTMENT.", "NTA. She needs to have permission from both of you. I’d tell her that if he’s moving in, you’re moving out.", "NTA since the original agreement was only with have 3 people there not 4", "YTA  \n  \nWhy can you move in with your long-term partner in this place and she can't? If the landlord OK'd it and you don't have a lease to veto it, kick rocks bud. I get why she didn't address it to you prior- she's had him over for extended periods (probably testing the waters) and gotten chewed out about it, irregardless to the double standard.", "My concern is squatter's rights. If duderino comes in, and is obnoxious, he gets to literally drive YOU out of the place.  \n\nNTA for protesting this. The vibes, as they say, are way off.", "YTA (almost E.S.H.)\n\nYour sister should have discussed moving her boyfriend in with you and your gf before talking to your landlord. I agree she didn't handle the situation properly. \n\nHowever, you don't have a lease and your landlord okayed her bf moving in. You're also renting from a family friend who's giving you a cheap deal on rent. I genuinely don't understand why you think you and your gf are entitled to this great deal, but if your sister wants the same (live with partner plus discounted rent) she has to move out. The apartment being crowded is not a good enough explanation. I don't blame you for liking the status quo. It just seems like you and your gf are very selfcentered and view your sister's relationship as less important (especially your edits to your post comparing the time everyone has been dating).", "I think YTA, but your sister isn’t a complete angel either. \nYou’ve all been living together for a while, and if you’ve actually had conversations about the lack of space/not adding another roommate to your situation, it’s definitely not okay for her to just spring the fact that her partner is moving in on you. That’s inconsiderate, I’d be PISSED if my roommate added someone to our living situation without having an open conversation with me about it first. \nEverybody deserves to be comfortable in their space and set their own boundaries. \nHowever, you are TA for assuming that your sister would just be totally fine with never having the option to live with her SO. \nYou share the space with yours, she also deserves to share the space with hers.", "YTA. What’s sauce for the goose is sauce for the gander.", "You 3 had an agreement before moving in together.  You did not agree to living as 4 together.  Your sister is wrong to just announce that her boyfriend is moving in without talking to you and your girlfriend first.  I would just say it will be too crowded, and nothing against him, but if he does move in, you and your girlfriend will find your own place.", "NTA you don’t move new people in without the current people agreeing, that’s fucked up.", "NTA.  \n\nI know this won't be a popular opinion, but the three of them agreed to rent together.  One person of the three should not be allowed to change the fundamental  nature of the group.  \n\nIf OP broke up with his girlfriend, then got into a new relationship with someone who the sister could not live with, she would have the right to say she didn't want that party in the home.\n\nThe same courtesy should be given to OP.\n\nBTW, I would bet that she told your landlord that you and your girlfriend were fine with it when she got permission.", "ESH.\n\nI don't think you can reasonably say no, but I *do* think you need to set clear boundaries. There should be a trial period in which they prove that him moving in isn't going to substantially lower the quality of life for two out of three original tenants. It sounds like he's a terrible roommate, and you should have the option to deny him a place in the home if he can't abide by certain standards. \n\nHonestly though it sounds like it's probably time for you and your girlfriend to move out.", "ESH. Your sister assumed but you believe you are more entitled to the space for some reason.", "How the hell is the post misleading the very first sentence states that her sister lives there.", "What is family bonus?", "It’s been edited.", "I would say you can either move out since it seems like you outgrown this living situation. Seeing as you been with your gf for 5 years I think maybe it’s time to grow up and get a place with just her or you just deal with the fact they’ll be 4 ppl and set boundaries as to cleanliness and shared comunal space is for entertainment and cohabitation and if you have work or personal stuff it should be done in the confines of your private space being the bedrooms.", "My partner was part of the original agreement when the 3 of us moved it. The place was offered to the 3 of us not just me and my sister. If she ever did feel cramped she's never mentioned it. The only time that's happened is when he's stayed over for long periods which she herself has said.\n\nAgree that she has every right to bring him over as would any person with their partner but there's a severe lack of boundaries and respect shown when he does come, which is part of the issue.\n\nI just think it's an odd thing to have done to bring the landlord into it rather than having an honest conversation first.", "The plot thickens!", "OP's GF isn't a guest, she's been there since day 1 of this lease as an equal tenant. She has just as much say in a possible fourth roommate as OP.", ">Because OP already has a guest there that lowers the sister's quality of living.\n\nExcept OP's gf is not a guest. She moved into the apartment at the same exact time as everyone else. It's as much her home as the other two.", "This is not necessarily a fair assessment. OP and girlfriend share a bedroom, while sister has more space to herself. There's a case to be made that an uneven split in rent is justified because of this.", "That last comment of yours. Idk if OP is new to the city but as a fellow New Yorker, yeah… it’s cramped and it’s dirty and old and expensive in there. You just have to learn how to suck it up sometimes.\n\nEspecially for cheaper rent. Cheaper rent = worse conditions. I’m not saying that the family friend’s apartment is bad (I’m sure it’s a decent apartment), but no one else is going to give OP a discounted rate unless it’s like completely falling apart and basically uninhabitable.", "No, you don’t just think it’s odd. You would have  wanted to shoot it down or sabotage it with the landlord. If she had had “an honest conversation “ first, would that make the apartment bigger?\n\nAnd I don’t understand the cramped part during the day. They both WFH.\nYou and your gf are gone until 6:30. So for how long are you being “cramped”? I mean, I could see you objecting to two desks in the living area or wanting him to be courteous and keep the apartment neat, those are valid. But “I’m not there so when I get home I need more room” doesn’t make sense to me.", "It’s not odd at all. Why? Because it’s not your property. It really sucks bc an apartment can be a home to someone but they might ultimately have no say over it bc it’s a rental.\n\nIf this were a situation where you owned the apartment, then ofc your sister doesn’t have a right to move her BF in. But you don’t own the apartment. The reduced rent agreement is given to you just as much as your sister.\n\nThe landlord okayed the BF moving in. Why is it okay for the landlord to approve your GF but not your sister’s BF? The landlord is aware of the size of the apartment. They would know 2 rooms = 2 couples per room.\n\nAt the end of the day the reduced rent is given to you and your sister. Your GF was included in the agreement by the landlord, and now the landlord extended the agreement to sister’s BF.\n\nThe offer is merely up for grabs and both you and your sister took it. The landlord agreed to your GF and has now also agreed to sister’s BF. Don’t like the landlord’s ruling? Then you hold it in or you move out.\n\nRemember that getting reduced rent is a kind and generous offer and not something that is owed to you and your GF.", "You wanna know who has the biggest say on tenants? The landlord as this is an informal renting situation with no lease according to OP. And the landlord has given permission. \n\nUnless the BF is going to be sleeping in OP's room, he has no real grounds to reject it. OP doesn't own it, he's getting the place for cheap because of his and his sister's connection to the landlord and he's already got his own partner living in with him. The GF doesn't matter because the reason they're getting cheap rent is due to OP and the sister. The GF is irrelevant since she's just contributing cheap rent money she's just an add on. The landlord owns the place and OP and the sister not only pay tent but are also the reason its so low. \n\nThe sister is probably uncomfortable with the GF around but she's sucked it up. OP can either do the same or move out.", "She's the least important one in this situation. It's the landlord's property, there's no lease in place and the rent is lowered due to OP and his sister. She could leave and other than OP everyone else would either be indifferent or better off.\n\nI really wanna know what OP's endgame plan was. Because his sister is an adult who will inevitably have adult relationships. Did he just expect her to never live together with her partner? Did he expect her to leave the place with cheap rent so that OP can get it to himself and his gf.\n\nThis was very obviously one of 2 conclusions which would happen if OP himself didn't choose to leave.", "> So the GF gets screwed over?\n\nYup. Her turn, innit.\n\n> And that is fair to you?\n\nYup. Turn and turn about. A lot fairer than if it were Sis that _continues_ to get screwed over, innit?\n\n \n> In what world man.\n\nEvery world except yours.\n\n> OP and GF have been together 5 years,\n\nOf which they've got to enjoy living together for eighteen months, thanks to the largesse of a family friend. In what world is a family friend of OP's family not just as much a family friend of OP's sister's family? How, exactly, is it fair that the largesse of a family friend of both OP's and his sister's should always just benefit him and not her?\n\n> that's planning your whole future together status. Sister and her BF haven't even been together a solid year (they broke up in the middle- timer starts over as far as I'm concerned when that happens\n\nFortunately you're not the universal judge of that. It's not you who are concerned here.", "There are five people who have to agree for a new tenant to move into the apartment:\n\nThe landlord, as this adjusts the lease and there are also legal issues around knowing who's in your property.\n\nThe new tenant.\n\nAll three of the original leaseholders. GF is one of them; she's paying rent, and she absolutely has a say in who she lives with. She is an equal to the siblings -- she's not getting a free ride and she's not there 'under the table.' Yes, the cheap rent is because of the siblings' relationship with the landlord, but GF makes it even cheaper with a three-way split instead of a two-way split.\n\nIf all five parties don't agree to the change, then there will not be four people in the apartment. Either the new tenant doesn't move in, or one or more of the original tenants leave.\n\nAnd really, saying that you're comfortable sharing a small NYC apartment with two other people but three other people doesn't work in the square footage available is fair. We're not talking about a 2,000 SQ ft 4 bed home where there's room for WFH areas to have dedicated non-communal space. Having a roommate who works in the communal space means that you only have reliable access to the bathroom and your bedroom. That'd be a deal breaker for me. At that point I might as well be in a studio.", "If sister is uncomfortable with girlfriend, she shouldn't have agreed to share an apartment with her.", "I definitely agree that the sister should get the same accommodations as the brother (having their partner share their bedroom), but you do need to understand that the GF here is not a guest in this house. I guess I'm arguing semantics at this point but the argument of \"brother gets a guest, so sister should too\" isn't exactly valid. GF has been living there as long as the other two, and both the brother and his gf should have been talked to before the landlord agreed to let sister have someone move in. I'm not saying the brother or gf should get the final say, but they should have been talked to about it before any decisions were made. This is their home for crying out loud!", "OK, so chop both OP's GF and Sister's BF down the middle, and let half of each live there and benefit from the largesse of OP's and Sister's common family friend. I mean, if only three people can live there; 2 × 1.5 = 3... What's that you say, we don't do half people, only whole ones? Well, OP has had his whole GF there for quite a while now. Why isn't it his sister's turn now? If not now, then when? \n\n> WHY would you screw over the gf?\n\nWhy would _you_ then _continue_ to screw over the sister?\n\n> Because you think op is a meanie?\n\nNo, because it's unfair that only he gets to live with his SO. How utterly blind does one have to be not to see that?", ">All three of the original leaseholders\n\nThere are no leaseholders as there is no lease. This is an unofficial situation where the landlord sets rent cheap and so OP and the other tenants forego certain legal protections in return, and they use OP's parents as the thing that protects and enforces this relationship. \n\n>She is an equal to the siblings -- she's not getting a free ride and she's not there 'under the table.' Yes, the cheap rent is because of the siblings' relationship with the landlord, but GF makes it even cheaper with a three-way split instead of a two-way split.\n\nShe could leave and be easily replaced (by the BF). She's not all that special or important. She's only important to OP. When she's the least important person in the situation, and she objectively is, she gets the least say. I doubt the landlord gives a fuck whether it's the GF there or the BF there as long as they get their money. The sister would probably rather have her BF there than OP's GF. The only person that cares whether the GF is there or not is OP.\n\n>If all five parties don't agree to the change, then there will not be four people in the apartment. Either the new tenant doesn't move in, or one or more of the original tenants leave.\n\nExactly. And so OP can either suck it up or he can move out. \n\nWhat exactly was OP's plan? Did he just expect his sister to never enter a serious relationship? Did he expect her to leave their place with cheap rent so he can be comfortable? What exactly was the endgame? Or did OP just think to himself \"I've got cheap rent and can live with my partner. Sister's problems are hers to sort out\"? She's an adult who's going to inevitably have adult relationships. This happening could've been seen from a mile away and it's unreasonable to expect her to just be alone or move out to do the exact same thing OP is doing.\n\n>Having a roommate who works in the communal space means that you only have reliable access to the bathroom and your bedroom. That'd be a deal breaker for me. At that point I might as well be in a studio.\n\nOP and his GF work on site. Why would it matter if one person works in the communal space while they're not even at home? Oh no! The communal space is being used when half the house isn't at home. So much discomfort. \n\nWould a studio even be cheaper when you've already got low rent and it's being split among 2 couples?", "Why does it matter if they were told or not if they don't have the final say? It's not like this is a random, completely unexpected event. The sister is an adult in a relationship, which both OP and the GF (presumably) knew. Provided they didn't break up permanently first, this wasn't a matter of \"if\" but a matter of \"when\" and they got their few weeks heads up.", "How do you know OP didn't set up the whole thing by constantly gaslighting his sister into thinking they couldn't have a 4th person living with them (which is what I was talking about btw)?\n\nAnd I agree kicking out OP's gf is silly, but I never said anything about that to begin with. You might have me confused with a different poster. So no, not 'by my own logic' lol.", "Legally, by NY state law, they are on a month-to-month lease. If the landlord chooses to end the lease, they must give 30 days notice for the tenants to leave. If the tenants leave, they must give 30 days notice. If the terms of the lease change, there must be 30 days notice given. OP, the sister, and the GF are not squatters, and are not without rights in the situation, even if they don't have a traditional lease with a set expiration date. They are legal tenants with all of the standing that provides them.\n\nI think OP was expecting his sister to treat him as she would any roommate. 'Hey, I'd like to live with my partner. What do you think of a fourth roommate?' Not 'Oh by the way, the landlord approved a fourth roommate kthanksbye.' One is mature, the other isn't.\n\nAlso, wtf? GF of five years is replaceable? Yes, relationships break down and end, but holy hell! She's a person, not a sex toy. And sister can prefer her BF all she wants. It'd be rather awkward if sister would rather hook up with her brother's GF than her own BF. This isn't about who likes who better, it's about OP and his GF not wanting to live in this space with the sister's BF.\n\nA lot of WFH positions don't follow standard work hours, especially if you have breaks during the work day for things like doctors appointments. You either take that as PTO...or you make up hours in the evening. In the communal space, in this instance.\n\nAnd living space is always a compromise. Do you pay more for privacy and control over your own space? Do you pay less, but give up privacy and have less access to the total space you pay for? Do you pay a high price for a great location, or do you go remote and find cheaper digs in a less fashionable area? Everyone will have their own balance point.", "You speak as someone that has very little or no actual perspective for a situation like this. You're speaking in black and white, but this situation is very much grey-area. Discussing things that are going to drastically change your life before they happen is a very normal and adult thing that happens in life. This should have been no different. Try and put yourself in their shoes. How would you react to this without any warning? You'd just sit back and say \"oh well, I shoulda known!\" Doubtful. You know you'd be upset.", "You get real. Not continuing to let OP benefit wildly more than his sister from an arrangement by a family friend of hers just as much as his is just simple fairness, not “screwing him over”. Why are you so hellbent on _continuing_ the screwing-over of his sister?", ">Legally, by NY state law, they are on a month-to-month lease.\n\nIf its on month to month basis then the lease ends every month no? So why can't the BF just move in at the start of the lease? Logically he'd then have as much right to be there as the GF since they're both now there since the start of that month's lease.\n\n\n>I think OP was expecting his sister to treat him as she would any roommate. 'Hey, I'd like to live with my partner. What do you think of a fourth roommate?' Not 'Oh by the way, the landlord approved a fourth roommate kthanksbye.' One is mature, the other isn't.\n\nAnd the he says no and then what? This was clearly the inevitable conclusion. OP just wants his sister to leave so that he can get the cheap place to himself and is using the fact that he and his GF outnumber the sister to force her out if she wants to have a serious relationship. So to that end he's making it inhospitable to her relationship. \"I can have my partner but YOU can't. My partner and I have decided on it. We outnumber you. If you don't like it, you can leave\"\n\n>Also, wtf? GF of five years is replaceable? Yes, relationships break down and end, but holy hell! She's a person, not a sex toy. And sister can prefer her BF all she wants. It'd be rather awkward if sister would rather hook up with her brother's GF than her own BF. This isn't about who likes who better, it's about OP and his GF not wanting to live in this space with the sister's BF.\n\nReplaceable regarding the living situation? Yes. Landlord likely doesn't give a fuck whether the GF or BF are living there as long as they get the rent money. To the renting situation, the GF doesn't matter. There is someone who is willing and able to replace her. As an individual she is just contributing rent money, which anyone can do. OP and the sister have connections which make this situation possible to begin with. I never said anything about the siblings fucking each other's partners. Idk why your mind went there.\n\n>A lot of WFH positions don't follow standard work hours, especially if you have breaks during the work day for things like doctors appointments. You either take that as PTO...or you make up hours in the evening. In the communal space, in this instance\n\nThat's such a small inconvenience. That sounds like something that would happen once in a while rather than regularly. You make it sound like they're going to start working when OP and his GF come home and so they'll spend the day at work and then spend the evening and night in their bedroom.", "They got several weeks heads up. You agreed she doesn't need their permission. What more do you want? It's not like he's just moving in tomorrow. There's nothing to discuss because they don't get to decide how her relationship works. There's just a matter of informing and they've been informed weeks in advance.", "Not at all no but if something like this was to be considered you'd think that any considerate person  would bring it up directly with the ppl it affects rather than tiptoeing behind their backs and dropping it like a bomb.\n\nNope, the family friend offered the 3 of us move in initially as they also knew my gf so she was part of the agreement when we moved in.", "I can't say that you are the biggest asshole on here, but definitely super manipulative, and you know all the reasons why. Fuck you, you don't pay as much as your sister so why the fuck do you think you have any say in this? Landlord agreed to it, so deal with it or move out.\n\n Have a grown up conversation with the people in your life instead of coming on here and painting it in your favor while slowly leaving a trail of crumbs showing how poorly you painted yourself.", "ESH, you can’t just dictate that she doesn’t get her partner to move in when the landlord cleared it. You should sit her down and discuss it that 4 people is too much and you need to figure out if you and your gf need to move out or your sister needs to move out with her bf. She didn’t create this situation it’s a natural progression of life. You and your gf need to decide if you can afford to rent another place or cover the rent of the whole apartment.", "I think all the commenters are missing the fact that the sister didn't broach the subject prior to telling him that her BF was moving in. The fact that she only cleared it with the landlord and not the other occupants of the apartment was an asshole move on her part. She should have talked with them first. OP mentioned that he had stayed over for a week here and a week there, but it was too cramped then. It will be even worse when it becomes a permanent thing. There should have been a discussion about it prior to her clearing it with the landlord. I say OP is NTA.\n\nGranted, adding a 4th person will reduce the amount of rent contributed by everyone to 25% per person. \n\nHonestly, this post will eventually turn into an entitled people post when the BF continues usurping everything (claiming it's for WFH) and not cleaning up after himself. I know I am not getting his side of things, but based solely on this post, that's my opinion.", "NTA the three of you moved in there together, with the agreement that it would be the three of you.  If she wanted to add her bf, that's something she should have discussed with her two roommates, before ever talking to the landlord.", "NTA it wasnt a discussion, it was her telling you. It was sneaky and life isnt fair. If she really wanted to live with her bf so desperately she should have discussed it and prepared for the answer being no to which she can give her notice to go live with him elsewhere.\n\nI get that people will say OP should move out but OP isnt the one that demanded a change in circumstances.", "ESH she is an absolutely an ass hole for not discussing it first but you always don’t a have a right to say no because your gf lives there’s. I feel like maybe it’s time to find a new living situation. She sucks  worse than you for springing a new roommate who you don’t particularly enjoy on you with saying a thing.", "NTA. The apartment is not big enough. It would be better for your sister to move out and then she and bf can live together in their own place. Otherwise tell your sister the apartment is too small and you do not agree for him to move in", "I would say let him move in but have ground rules for everyone (everyone the same rules) and if they don’t, whoever it is gets 3 strikes then out. If the sisters bf wants to move in he will have to pull his own weight.", "How is it misleading? OP does mention that OP, and OP’s girlfriend lives with OP’s sister…\n\n“My girlfriend and I have been living in the same 2 bed apartment with my sister in NY city for the last 1.5 years.”", "Also if it gets too cramped and you can’t deal with it then either you and your gf or her and her bf moves out and gets a different place.", "She really should have discussed it with you first as that was a AH move on her part", "The post was edited. The \"with my sister\" was not there in the beginning.", " It's ok for you to have your GF live there but not your sisters BF. YTA. Why do you get to have a live in partner and she doesn't? Did you discuss it with her before your GF moved in?", "He's only paying 30 gf is 30 sister is 40", "Yeah, so if the guy moves in then it should be 25% each unless there is a serious difference in stuff like bedroom size/master suite.", "Yep", "Some people do things they're not comfortable with because they love the person they do it for. Or they expect reciprocation. Two things OP doesn't seem to care for. \n\nOP and his GF are obviously using their numbers advantage to bully the sister out of the apartment. Nobody can move in without their permission and they won't let the sister move in her bf. So the sister's only option is to move out to a more expensive place so that OP and the gf get the cheap apartment all to themselves.", "learn what gaslighting means please", ">What more do you want?\n\nHuman decency, especially from family. Taking this \"technically I am in the right\" approach is a great way to end relationships. You don't treat the people you love with \"technically.\" The sister going behind their backs to get the bf moved in was a shitty move and you know it. You're being willfully ignorant of common decency. Telling her brother \"this is happening whether you like it or not\" is not the same as having a discussion. Your family deserves a discussion, even if you know what the outcome will be before having it. What the sister did was incredibly shitty behavior and I hope you never have to experience this situation yourself."]}