{"id": 19818, "submission_id": "14axy7u", "title": "AITA for refusing to see my wife's brother?", "selftext": "I'll try to keep things short.\n\nI (M29) have gotten along very well with my wife's (F30) family. They are a really great group of people, and I have always felt very welcomed when I'm with them. My wife and I live relatively close to most of her family, so I do see them quite regularly.\n\nFor the past few years, my BIL (M33) and his wife (F31) have been fostering dogs. Most of the dogs have been great, but they typically don't keep them for more than a few weeks before finding a permanent home for the dog. However, that all changed with Lucky.\n\nLucky is a 150 lbs pitbull with a history of, as the shelter put it, \"sporadic acts of aggression.\" Not only that, this dog has unfortunately been subjected to steroid injections by its previous owners. Since no one in their right mind would want to take Lucky, my BIL and his wife decided to keep him full-time as he would most likely be put down otherwise.\n\nI saw this dog once before, and I was more than a little terrified. Lucky doesn't take kindly to strangers, and my BIL has told me that he had to put him into a chain-linked enclosure in the backyard whenever anyone comes to visit them.\n\nSince then, Lucky has chewed through this enclosure, and my BIL and his wife have decided that perhaps exposure therapy to strangers is the best treatment for him. So, they've been asking people to come by their house to say hi.\n\nMy wife has volunteered both of us, and when she told me that, I let her know that she'd be going alone. We argued about it for a while, and my wife told me that I was doing the most. She said it would be rude if I didn't go since she had already promised them, but I still adamantly refused.\n\nShe then framed it as how a real man would come and make sure she felt safe and would protect her if needed. I was beyond annoyed at this point and told her that hypothetically, I could find a new wife, but I couldn't get an arm back. She got upset by this and decided to leave on her own. AITA?\n\nEdit - For those wondering, my BIL and SIL do have some training with dog rehabilitation. But Lucky is the most challenging case ever seen by them or the shelter which he lived in.\n\nUPDATE - My wife has left to go visit her brother and SIL, I stayed behind. I'm not going to lie, no amount of money would make me want to go next to Lucky. I spoke with my MIL and she too is terrified of the dog, she doesn't blame me at all for not going. To be honest, it was nice to bond over our shared fear of Lucky.", "created_utc": 1686924794, "permalink": "/r/AmItheAsshole/comments/14axy7u/aita_for_refusing_to_see_my_wifes_brother/", "score": 1452, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1. I refused to visit my BIL and his wife when my wife wanted us to go and say hi to them and their dog.\n2. I refused to go with my wife and argued with her for a good while, I let her know that I did not feel comfortable going and let her leave on her own\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA.\n\nYour wife voluntold you for something, then tried to emasculate you when you didn't want to go. That's an AH move. Hold firm on this.", "\" She then framed it as how a real man would come and make sure she felt safe and would protect her if needed.\" \n\nWow..\n\nIt's a dangerous dog. Nice of th that they want to keep him but you don't have to subject yourself to that. And your wife is manipulative af... \n\nNtA", ">hypothetically, I could find a new wife, but I couldn't get an arm back.\n\nTrue and practical. Possibly relationship ending but hey, if she's going to insult your manhood for not volunteering to throw yourself in front of Cujo she earned a snappy come back. NTA.\n\nAnd lordy your in laws have lost their minds.", "NTA\n\nI’ve fostered dogs, including dogs like Lucky, and you need to be very careful with who you expose them to and how. The people involved all need to agree. Your wife should have asked you first, not accepted on your behalf. \n\n>She then framed it as how a real man would come and make sure she felt safe and would protect her if needed.\n\nYour wife is TA.\n\n>perhaps exposure therapy to strangers is the best treatment for him.\n\nWith dogs, the treatment is called [desensitization and counterconditioning](https://vcahospitals.com/know-your-pet/introduction-to-desensitization-and-counterconditioning).", "NTA. \n\n>My wife has volunteered both of us\n\nNever a good idea in a relationship.\n\n>She said it would be rude if I didn't go since she had already promised them\n\nYes, it was rude of her to promise something without asking you.\n\n>She then framed it as how a real man would come and make sure she felt safe and would protect her if needed.\n\nShe's admitting it's a dangerous situation but is somehow using this to try to belittle you?\n\n>I could find a new wife\n\nYes. A much better one.", "\"A real man\" Oh, nice. A real man would throw himself in the way, so it's his face that gets mutilated beyond recognition instead of hers.\n\nNTA.\n\nETA: I wonder if she truly understands how violently and quickly a 150lbs steroid enhanced pitbull with a history of aggression who CHEWED THROUGH A CHAIN LINK FENCE could kill a human being.\n\nIf she did, she would not have volunteered you both, let alone make a sexist comment about you expressing your fear.", "You are not refusing to see your BIL and his wife; you are refusing to see a aggressive and hostile dog.  Focus on that aspect.  NTA.", "NTA.\n\nIf you’re uncomfortable around an animal, no one should force you to be around it.\n\nIt was wrong for your wife to volunteer you. It was double wrong for her to make that sexist remark.", "NTA. As others have mentioned, you shouldn't have to do something you aren't comfortable with (and in this case I'd say rightfully so considering the nature of the Pitbull). Your wife shouldn't have volunteered BOTH of you without your permission. If your wife really wants to go, then I don't see how you telling her she'd be going alone would make you the AH.", "Genius response.  NTA.", "A real man?  Seriously?  You went straight for the throat with your reply and I am totally here for it.  She tried to manipulate the shit out of you be emasculating you verbally.  Honestly, she doesn't sound like she respects you much.  Her comment was pretty indicative of that.  Yours was perfect.  Harsh?  Absolutely.  Warranted? 100%.  NTA", "NTA\n\nYou're wife should not have volunteered you. If she wants to play around with her life then fine that's her choice but she doesn't get to play with the lives of others.", "NTA, you never agreed to this, period.\n\n>I was beyond annoyed at this point and told her that hypothetically, I could find a new wife, but I couldn't get an arm back. \n\nHahaha, master burn. \n\nAnd for the real man comment - tell her the 1950s called and want their sexism back.", "Info\n\nWhy is having Lucky wear a muzzle whenever there are visitors not considered a reasonable option if the backyard enclosure isn't working out?\n\nIt seems wildly irresponsible to expose a dog with a history of aggression without a muzzle to all sorts of triggers and random strangers. It's a huge liability issue.\n\nI personally would only be willing to volunteer if Lucky were in a muzzle and there was a professional trainer handling him.", "NTA. Your ILs are dumb for keeping such a liability on their property especially one with a history of aggression. Your wife is an AH for trying to emasculate you to try to pressure you into doing what she wants.", "How nice of your wife to volunteer you to be a crash test dummy/dog training toy. And how smart of you to decline. **NTA** and not a dummy.\n\n\"Should have said\"s are easy after the fact, but the \"real man\" insult's reply should have been, \"A real man would prevent his wife from ignorantly waking into danger. Should I be a 'real man' right now?\"", "NTA\n\nI've been around pit bulls that have had similar traumatic pasts and tbh, if you're already scared of the dog, it's not going to help the situation on a whole. \n\nBIL and SIL need to be working with a behaviourlist to help Lucky, they're not equipped to decide what is best for the dog. Chances are that all this will do is stress the pup out and put you in an uncomfortable position.", "NTA. She volunteered you so she can greet the dog. Good on your BIL and his wife for keeping the dog, that’s a wonderful thing to give it a second chance, but right now it still very much is a scary dog and you shouldn’t have to deal with it", "No one tells you what you are and are not comfortable with. No one tells you to stuff your fears to do anything, not even your wife. \n\nShe can do her own thing. You don't have to.\n\nNTA", "NTA  what's rude is for your wife to decide how you should feel. If you're not comfortable, no matter What the situation is, your feelings are valid", "NTA\n\nYou don't feel safe in front of a dog that can be really dangerous and now your wife is gaslighting/manipulating you? Yeah, that's bs.", "Nope. I was terrified of dogs well into my twenties and no amount of cajoling could get me out of the car no matter how much my husband and the dog owners swore it was “a nice dog” and I was overreacting. Thanks, but I’ll just overreact from the safety of the car.", "NTA. She made the commitment, not you. You've already expressed how you feel about the dog and to expect you to spend time with it as part of its rehabilitation is unfair. Your BIL and his wife are doing a great thing in caring for it, but that doesn't make it your responsibility.\n\nAnd the \"real man\" jibe is a real low blow. Kudos to you on the comeback.", "NTA. A real man knows when risk outweighs the reward. The dog is a known threat.", "NTA    the quip that you aren't a real man, is quite a toxic mindset. \n\nDogs can sense fear, and it makes aggressive dogs more aggressive, that won't make the dog better. \n\nPlease tell me that they at least muzzle the dog when it's around people, because if they don't, and the dog attacks someone, it's going to cause a massive lawsuit. \n\nIn my city, it's illegal to own a pit bull, unless you already had it before the law came into effect. It might bring me some heat, but I am happy they do that.", "No one tells you what you are and are not comfortable with. No one tells you to stuff your fears to do anything, not even your wife. \n\nShe can do her own thing. You don't have to.\n\nNTA", "NTA\n\nIt’s simple. If you are uncomfortable doing something, you shouldn’t be told to do it. Playing the “man up” card is a super asshole thing to do. Realistically, if she doesn’t feel safe with out your, maybe she shouldn’t go either, but that’s her cross.", "A ”real” man would not be *stupid* enough to volunteer himself *or* his partner to be exposed to a known vicious animal. \n\nNTA.", "Solid decision. No need to be part of this dog’s therapy. NTA.", "NTA.\n\nI've been thinking about getting a boar spear.  If I had to visit this dog, I think I'd pull the trigger and bring it along.", "NTA\n\nBut your wife sure is an AH", "lol nta maybe the last comment was questionable but when you break out that sexist real man bullshit you kinda ask for what you get. what are you supposed to do with an angry dog, bite back? in a manly fashion?", "NTA ID report that dog to the county or city. He is a menace to society and may need to be out down. Lord knows what type of abuse he suffered and may never recover.  \nI love the comment you made of getting a girlfriend but not your arm.  It makes sense.", "A real man puts his foot down when his family is about to do something stupid. NTA.", "NTA. you decide what you’re comfortable with and your wife’s perception of masculinity is unhealthy and gross. \n\nas a side note, sometimes keeping an animal alive at any cost is not the kind or responsible thing to do", "NTA\n\nTo me you’re being a real man by admitting you’re scared of the dog & don’t want to go! It sounds like they need some professional help with this poor dog & unless they have full control over this dog 100% of the time I can see a very bad outcome sometime in the future. Dogs like this can be rehabilitated but it really does take lots of time, patience & professionals help and is often best done in a completely safe environment for all including the poor dog; it will help with dog feel so much more settled, confident & happy too", "Why is your wife volunteering you and gaslighting you into doing something you aren’t comfortable with doing? \n\nNTA", "**NTA** \\- if you are uncomfortable facing a 150-pound pit bull then it is your choice to stay away.  You were pushing it with \"new wife\" quip, but she was manipulating you with the \"real man\" BS.\n\nShe was rude to you when she promised that you would do something without checking with you first.  When I accept something for me and my wife, I always make it clear that it is tentative, pending my wife's agreement.\n\nWhat did you mean when you said, \" that I was doing the most\"?", "NTA, but all they have to be told is that \"it's a tool to help with her neurodivergence.\" That's the truth *and* it sounds medical enough that kids will accept it.", "[deleted]", "ESH. You suck for saying that last bit about your wife being replaceable, and she sucks for saying that manipulative bit about being a real man. Both of you need to improve your EQ and conflict resolution skills before a more serious topic comes up and you disagree in an unhealthy way again. In a healthy relationship, she would have asked before signing the two of you up for something. Then you would have expressed your fear of the dog, and she would respect your honesty and vulnerability and chose to go on her own. End of discussion, no argument necessary.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI'll try to keep things short.\n\nI (M29) have gotten along very well with my wife's (F30) family. They are a really great group of people, and I have always felt very welcomed when I'm with them. My wife and I live relatively close to most of her family, so I do see them quite regularly.\n\nFor the past few years, my BIL (M33) and his wife (F31) have been fostering dogs. Most of the dogs have been great, but they typically don't keep them for more than a few weeks before finding a permanent home for the dog. However, that all changed with Lucky.\n\nLucky is a 150 lbs pitbull with a history of, as the shelter put it, \"sporadic acts of aggression.\" Not only that, this dog has unfortunately been subjected to steroid injections by its previous owners. Since no one in their right mind would want to take Lucky, my BIL and his wife decided to keep him full-time as he would most likely be put down otherwise.\n\nI saw this dog once before, and I was more than a little terrified. Lucky doesn't take kindly to strangers, and my BIL has told me that he had to put him into a chain-linked enclosure in the backyard whenever anyone comes to visit them.\n\nSince then, Lucky has chewed through this enclosure, and my BIL and his wife have decided that perhaps exposure therapy to strangers is the best treatment for him. So, they've been asking people to come by their house to say hi.\n\nMy wife has volunteered both of us, and when she told me that, I let her know that she'd be going alone. We argued about it for a while, and my wife told me that I was doing the most. She said it would be rude if I didn't go since she had already promised them, but I still adamantly refused.\n\nShe then framed it as how a real man would come and make sure she felt safe and would protect her if needed. I was beyond annoyed at this point and told her that hypothetically, I could find a new wife, but I couldn't get an arm back. She got upset by this and decided to leave on her own. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Nta, why tf did wife answer on your behalf?", "NTA.  Nope.  You're being the smart one and her putting you down was quite rude.", "NTA\n\nAnd maybe, if she keeps insisting, consider letting her and your BIL know that should Lucky attack you, you will be reporting the attack.", "NTA anyone using the 'a real man would....' argument is automatically TAH though", "Absolutely NTA. Your wife shouldn’t have put you down for not wanting to go near a dog that’s been proven agressive for an experimental meeting. NTA.", "NTA\n\nTime to lay down the law with your wife", "NTA, it’s heartbreaking what Lucky has been put through in life, but that doesn’t change the fact that he’s dangerous now. You aren’t the AH for not wanting to be bitten.", "NTA. That was the correct response. She has no right to volunteer you for something that's potentially dangerous. Does she have a history of doing things like that?", "A real man would tell his wife not to put herself in the vicinity of an aggressive, untrained animals mouth.\n\nNow if your idiot BIL said, “the dog and I have just completed a several week professional trainer led boot camp for aggressive dogs. He’s really changed. We are now conditioning him to doing what he has learned at home.” Then it would be uncool to not show up.\n\nBut the exposure therapy he is doltishly trying to do is really just using humans as bait so he can negatively scold the dog if it gets aggressive. That’s dangerous and it will never work. A dog that is aggressively trying to protect itself/family/turf is not in a “trainable mood” FFS. It’s full of adrenaline and singularly focused on ripping your damn scrotum off.\n\nYour wife’s whole “real man” comment was disrespectful, and if it happened to me, she could sleep at her BIL next to the dog until she is ready to not be callously manipulative and disrespectful. Seriously, if that’s how she talks to you, you deserve better.\n\nYou are NTA, but you are surrounded by them.", "NTA if anything, being forced to go would likely be the worst thing you could do. I'm not an animal expert, but from what I do know, that dog will absolutely notice the nervousness. I don't know what may set this dog off specifically, but your nervousness would easily be seen as a weakness and is a very real potential trigger that could make the situation far more dangerous than it needs to be. The people going over there need to be absolutely calm, especially if it's in the beginning stages of this therapy.\n\nEdit: Additionally, having your wife respond to your very valid concerns over safety with emasculating and belittling remarks is a big concern for me. Does she do this often?", "NTA\n\n\"Real man\" are words that are an automatic red flag", "NTA and I'm pretty disgusted with your wife. She has some toxic views on gender and your autonomy. All she had to do was tell her brother that after speaking to you, you didn't want to go so she'd either come on her own or not be coming either.", "NTA \n\nit does not even matter if the dog is aggressive or not, you cant volunteer people for activities without their knowledge and then act upset when they say no. \n\nyour wife is ignoring basic courtesy, on top of potentially endangering your safety", "NTA, \n\nEven as a 'pit bull type' owner I would euthanise Lucky if he was mine. \n\nIt doesn't matter the breed, an aggressive  dog is not safe.", "I’m with you 100%, why put yourself at risk going near and dangerous dog when there is no need. NTA, do they even have any training to do exposure therapy on the dog?", "NTA but your wife definitely is.", "NTA , this dog is a risk and they want people to take the risk to hopefully make him less of a risk?  Most of the time I hear “a real man would…” anymore it’s a manipulative tactic to get you to do what they want", "NTA. Animals can sense when they are unwanted/feared/whatever. If Lucky is prone to sporadic acts of aggression, and you are afraid of him., guess who's going to pick up on that. Guess what's likely going to get triggered. And then guess who's likely going to end up in the hospital. And what's worse, if that happens, the dog may well end up being euthanized after all.", "> I could find a new wife\n\nProbably should. NTA.", "Well personally I think Luckys owners are absolutely insane to try this on such a) powerful b) reactive dog. I highly doubt should he lose his shit they could control a 150lb pit Bull. They’re asking for a lawsuit and should really consider getting the dog professional help. \n\nYour wife is insane for doing this. Lucky May be totally fine one second and then snap and rip her face off. I have nothing against pit bulls but they are incredibly strong and this poor fella probably wouldn’t take kindly to a bunch of strangers coming into his home. \nNTA.", "I hope your wife knows that if lucky were to grab onto her, there isn't a damn thing her brother or his wife or anything short of a slug to the brain can do to get him to release. I would say you are the smart one in the relationship.", "NTA. \n\n😁 get a new wife but can’t get an arm back lol. Very succinctly put.", "NTA\n\nplease show your wife the sub banpitbulls it's biased against pitbulls as a breed but has plenty of news articles about their danger. So she can take those massive blinders off.", "NTA. Her pulling that \"real man\" bullshit on you is unacceptable behavior.", "NTA... good analogy. \nShe needs to stop volunteering you for dangerous activities.", "NTA.\n\nAnd maybe Lucky isn't meant to a house pet.", "NTA\n\nNobody else gets to volunteer you for something you find dangerous. You go into those things willingly and fully informed or not at all.", "NTA, your wife is a complete asshole. Hell no would I go near a steroid dog! My imagination is running wild with that one.", "NTA. Your wife is being an unreasonable asshole here. Lucky should be put down.", "Unfortunately, you have bigger problems than your BIL.\n\nYour wife is horrible. Mostly I steer away from the whole get-a-divorce angle, but she emasculated you to get her own way. Easy to see her manipulating and gaslighting you in many different situations. \n\nPlease consider either therapy or divorce. Her behaviour is disgusting.\n\nNTA", ">...when she told me that, I let her know that she'd be going alone. \n\nSo the dog is so dangerous that you (rightly) don't want to be around him, but your *first reaction* wasn't to also persuade her not to go?  Weird.", "NTA. Delivery was good, timing was not so good.", "NTA - the breed doesn’t even matter (see recent post on super aggressive lab that killed a much loved cat), it’s the overall actions of all parties that matter in this case. \n\nINFO: do either of them have actual dog training skills? In my limited knowledge doing exposure training could be synonymous with reckless hope if not done properly\n\nETA: the reason I said breed doesn’t matter, is b/c there plenty of aggressive dogs regardless of breed and people not properly trained with how to handle dogs in general. I wouldn’t dispute the fact American Pit Bull terriers and similar breeds have a reputation for being aggressive (pitbull isn’t an actual breed). There is a valid argument for not knowing enough about the APB breed and how to train them properly so I could have been more specific in that sense.", ">Hold firm on this\n\n100% I will, I don't want to be eaten", "Do not poke the bear.", "She is putting herself in danger. You can't protect her from her own stupidity.", "When Cujo inevitably attacks her, OP may end up with the opportunity to find a new wife.", "I don't think she understands it fully, that dog is not normal", "Her own mother has refused to see the dog. She said that as a 60-year-old woman she'd have no chance of trying to run away if needed", "My SIL mentioned how she thinks a muzzle will make Lucky more anxious and both her and my BIL are slightly frightened of the idea of trying to put one on", "First time I saw it, I did't even get out the car because he was growling so much. When I started to slowly open the door to step out, my BIL told me \"You probably should't do that\"", "Nah fam, that dog needs to be put down. It's a ticking timebomb.", "Someone I once dated had a childhood pet - a massive German shepherd. He swore up and down that I’d be safe around the dog because he’s *soooo* gentle. I was terrified of dogs, but wanted to make a good impression on his family.\n\nFirst thing dog does when I find myself accidentally alone with it is attack me. Fuck that.", ">at least muzzle the dog\n\nMy SIL thinks a muzzle will increase Lucky's anxiety and also nobody is brave enough to try it", "That isn't what gaslighting is.", "I think the \"new wife\" part was a great comeback because its true", "This is a 150lbs steroid enhanced pitbull. If that dog decides that it is going to attack and kill someone, the BIL is going to be about as much a barrier as a wet paper bag.", ">he can't control a dog\n\nHe's had aggressive dogs before, but he admits that Lucky is far more difficult than all the others. I really didn't want to test how much control he has over Lucky", "Have you seen a steroid infused pitbull? His BIL wouldn't be able to do a fucking thing to stop that beast if it wanted OP dead.\n\nHe has every right to be annoyed that his wife is for some reason risking their life without his input.\n\nNTA 1000000%", "That wasn't histrionic.  It was an exaggeration for humorous effect.", "I do not think OP even mentioned anything about a dog taking his arm off whatsoever in his post, though it could be presumed that could be one of his potential worries. And even then I do not think ESH. Instead I think that the OP is NTA and the wife is being an AH by not respecting OP's wishes of not wanting to go when he has presumably made it clear that he does not feel comfortable with doing so.\n\nIf his wife wants to go then I agree with the OP, she should go herself. Someone should not be forced to do something/go through with something they are not comfortable with.", "So the dog chewed through his chain linked enclosure and his wife volunteered them for exposure therapy?  🤔  lol", "You’re right women need men to protect them from their own decision making /s", "She is presumably a full grown woman who has agency, OP is not responsible for her making dumbass decisions knowing what her brother has told her about the dog.", "Why, is it better for him to force her not to go than it is for her to force him to go? \n\nEveryone is adults here and free to make their own choices", "We don't know that.  They argued.  I presume that came up during the discussion.", "Not to laugh at your plight, but that made me spit out my drink. NTA by any means.", "Yeah, and I'm normally a huge advocate for helping dogs reform after a shelter but this just *screams* an idiotic idea from them and your wife.\nStay safe!\n\nIf the dog chewed through its enclosure it needs more than exposure to people, it would need some serious training and rehabilitation. \n\nDogs like that can and do recover, a friend of mine works at a sanctuary for wolves and often does rehabilitation for aggressive dogs, and she has worked wonders for people, but it takes a lot of time, and a lot of training one on one with people really dedicated to finding why the dog is aggressive.\n\n\"Exposure\" is doubtful to help a dog this stressed out by humans, and this aggressive.", "LOL\n\nI work with rescue dogs, too. I think their plan is idiotic at best. \n\nWhy is your wife so eager to please the dog's owner?", "People like your wife are actually doing a huge disservice to such dogs and it is oveall sad. That poor pup can be or might not be resocialized, but this “exposure” bull…t will only lead to someone getting hurt and the dog euthanized.", "In that case I'd say even more so NTA IMO. If I were in your position as well I personally would not want to be anywhere around a dog that could potentially harm me. ESPECIALLY considering the dog has chewed through his enclosure and your BIL has previously mentioned that whenever someone visits he has to separate him from visitors. \n\nIf they want to do exposure therapy then they should do it with people who are absolutely comfortable with going through with it. You shouldn't have to go through with it just because you are a man.", "LoL this dog needs to be put down. Call animal control OP it's a danger to the public and I doubt the shelter can legally place this dangerous animal in fostering", "Are either your SIL or BIL a professional dog trainer? Or did they consult a professional dog trainer that advised to not use a muzzle? That feels like very strange and wrong advice if that's what they were told.\n\nIf they taught their dog correctly, a muzzle isn't a negative thing. If they taught him correctly, he would be happy to put it on because it means treats, walks and all sorts of things he likes. They have to put in the work to create that positive association.\n\nLack of muzzle is even more of a reason to avoid. You need to look out for your own health and safety.", "Ya *fuuuuuuuuck* that.", "If you can't even get out of the car without the BIL advising against it how do they plan on doing this exposure? The animal is clearly not ready for this step.", "That's insane. That dog is going to kill someone.", "Sounds like his name is because he's a four-legged game of Russian Roulette.", "> I was beyond annoyed at this point and told her that hypothetically, I could find a new wife, but I couldn't get an arm back. \n\nWas referring to this", "If not kill, severely injure someone.  That dog is dangerous", "According to my BIL, they are fairly confident that he has eaten other dogs in the past", "Ahh I completely missed that part in my case. Even so I feel like that's just a \"hypothetical,\" a potentially extreme one, but still something that could potentially occur IMO. With the way the dog has been described, and what OP has mentioned, the wife wants to go and volunteered the both of them (presumably without asking OP if he was comfortable with going) but OP himself does not want to go.\n\nI personally still don't see how this would be an ESH rather than just OP being NTA.", "Oh but is fine for his wife to tell him he's not a REAL man because he doesn't wat to be attacked by a drug fueled, 150lb pitbull? Foh with that nonsense!", "NTA.  Please tell me there are no children in the home.", "Was a vet tech for 11 years, never in my life have I seen a 150# pit bull. Is it part mastiff? Anyway, NTA I wouldn’t go near it and I would recommend your wife doesn’t either.", "Some dogs should be put down for the safety of the rest of society. It sucks because it's not the dogs fault, but the kid they'll eventually maul otherwise deserves to live more than the dog does.", "Nta\n\nTell your wife you’ll be in the car ready to take her to the hospital when things go bad.  \n\nThat dog needs real help. He needs a handler with experience with his aggressions and issues. Not some doggy foster parents who aren’t equipped to help him.   If they don’t want to see the dog put down, they need to work with someone who has experience. If it bites anyone and they have to go the the hospital it’s almost always an automatic death sentence for the dog.", "Behavioral euthanasia is better than subjecting humans to potential mauling. Sorry OP, you are definitely NTA", "NTA. \n\nA \"real\" woman would obey her husband. \n\nSexist bullshit goes both ways.", "If a dog that size with that mindset wants something, it’ll get it. I love pits, but they’re strong, and a pit previously on steroids? Nah, I’m out. Your wife is dumb to be a Guinea pig for this situation. Dog’s gonna love the fear coming off her. \n\nAlso she shouldn’t emasculate you for being afraid. You can punch, kick, jab the eyes, pull the jaws of that dog and it won’t stop until it wants to. Your wife sucks and I hope you stand by what you said. It wasn’t nice, but she wasn’t nice either. You need an apology.", "Another tale of a wife signing up her husband to do something without his consent.", "Man, I am a dog trainer of 20+ years, specialising in aggressive and traumatized dogs. Last year I worked with a couple that have a bully breed and he was already showing signs of aggression at 7 months old. I recommended neutering, they said no, they wanted to breed him 🤦On top of that foolishness, they wanted to give him \"supplements\" to make him more bulky 🤷 I told them absolutely not, but it was a loosing battle. I did my training, made him at least safe to walk and left them to it.\n\nGot a call yesterday, they have an emergency and need to go out of town. Their friend will stay with the dog, but refuses to walk him. They begged me to do it. I didn't really want to, but we just moved and could use the extra cash. So I agreed. Told them to leave the dogs (they also have a smaller dog) behind a baby gate in the kitchen so that I could safely enter and talk to the dogs to remind them of who I am.\n\nWalk in the house, narrow entryway, and what am I confronted with? Both dogs, running loose in the house. The bully immediately rushed me, snarling. They had given him those supplements and he's now over 100lbs I'd guess. I'm not gonna lie, my heart stopped and I thought to myself 'if he gets me on the ground, I'm dead.'\n\nTraining instinct kicked in and I looked at the wall and just repeated his name over and over. No sudden movements, kept my body relaxed and just kept saying his name calmly. After a few minutes he came up and sniffed me and then he relaxed. But Jesus Christ, I thought I was dead.\n\nI'll finish what I've been paid to do and then those people can go f#@k themselves.\n\nYou're doing the right thing by not going over there. Safety first.", ">my BIL and his wife have decided that perhaps exposure therapy to strangers is the best treatment for him.\n\nRIP their liability and house insurance. NTA. Tell them to get an Umbrella policy.\n\n>She then framed it as how a real man would come and make sure she felt safe and would protect her if needed.\n\n>Lucky is a 150 lbs pitbull with a history of, as the shelter put it, \"sporadic acts of aggression.\" Not only that, this dog has unfortunately been subjected to steroid injections\n\nUh huh. A \"real\" man would call animal control since that dog has already broken out of the enclosure. Your in-laws have no idea what they are doing. That dog needs very specialized help.", "NTA.  \"You want a real man to keep you safe?  OK, I prohibit you from visiting dangerous dogs. That will keep you safe.\"\n\nSomeone else's dangerous dog is not your problem.  It's one thing to help move a couch or pick someone up from the airport, it's another thing to risk being attacked by a massive angry dog.", "NTA\n\nBIL and SIL are not dog behavioralists with an expertise of aggressive dogs. They don't know how to do this type of therapy. Are they going to have the dog on one side of a secured fence? Are they going to involve treats? Who is supervising? \n\nIt sounds they only want people around and the dog with nothing to prevent problems. Those dogs are so strong, good luck separating him jaw from someone if they attack. That can end with someone with a severe disability if not dead. And then you are supposed to call animal control to put the dog down and the whole family would be against you, because they sound like AH.\n\nIf the dog bites you, would your wife go to animal control to get the dog taken away or would she also insult you with the fact that you are not a \"real man\".", "My uncle had a really aggressive pit, and I didn't know. My family went to visit, and I went in the house, and they stayed outside talking. I saw the new dog, but I wanted to get my homework done so I could hang out. I sat on the floor with my books on the coffee table and started working. He always had random dogs around, so it wasn't a big deal to me. \n\nHe came charging into the house like he was sure I was on the floor bleeding out from a dog attack. It turns out I was working on my homework with the new dog lying on the floor next to me. He was shocked that his super aggressive dog was just chilling with me. \n\nThat dog hated all people and really wasn't safe, but we were besties after that. Every time I visited, she'd give me a big love bite on the butt though. I was in high school then, now I'm the dog whisperer in my family. \n\nConfronting an aggressive dog when you know it's dangerous? Not recommended. He'll definitely sense your fears and react badly. \n\nPits have a bad reputation because of bad owners who try to make them more aggressive to prove their toughness or whatever. It's just stupid. Who gives steroids to a dog? While I'm glad the dog is away from that jerk, it isn't your problem to help him get over his aggression. And your wife sounds like a real gem. NTA", "A real man? Wow, she listens to Tate much?", "NTA, lucky is going to end up killing someone.", "‘Are we switching to traditional gender roles? In that case, as the husband and the head of the household, I’m deciding not to go and telling you not to go.’\nNTA.", "NTA. Vet here. Exposure therapy- unless a behaviorist who is really specialized in aggressive dogs recommend it, no way. And needs to be basket muzzled. A 150lb dog with sporadic aggression is incredibly dangerous", "\n“I was beyond annoyed at this point and told her that hypothetically, I could find a new wife, but I couldn't get an arm back. She got upset by this and decided to leave on her own. AITA?”\n\nNTA.  You made my day with this statement.", "Was in a similar situation as you, and I still have the scar on my arm from getting attacked. Always be wary of dogs you're not familiar with personally, especially if they have a HISTORY of being aggressive", "NTA, but when she gets back from the visit you should ask her if you would take a child around that dog.\n\nIf it is that prone to agression it should be put down.", "NTA\n\nA steroid injected pit.  They are out of their league", "NTA\n\nYour wife is scared to go with out you but feels obligated to go. Family pressure is real. Let's forgive her.\n\n&#x200B;\n\nBut no you do not have to go sacrifice yourself to this dog.", "NTA. And this is coming from a pitbull owner. That dog (regardless of breed) sounds dangerous and should only be handled by professionals.", "NTA. Pits are plague.", "NTA\n\nYour wife is abusive af, what the hell? Who the hell just volunteers someone to interact with a vicious dog?\n\nI'd tell her that a REAL wife wouldn't endanger her husband for brownie points and if she wants a REAL man maybe she should get divorce papers and start looking.", "NTA, your response cracked me up 😂", "NTA", "NTA    \n\nAnd this may be unpopular, but sometimes the kindest thing you can do for an aggressive dog is euthanize. I'm all for working hard to rehab, but after a certain point it really is \"putting it out of it's misery\". A lot of aggression is fear based. Maybe cautious exposure to people will work, but I'd combine it with some SSRI medications to help \"open a window\" and help reduce the fear in the poor dog's brain so that the exposure has a better shot at working.", "NTA- I have big dogs. I love dogs but an aggressive, roid raging 150 lb pittbull is not a dog I'd want to meet. Your wife is AH for telling you that you would help with training the dog and disrespecting you when you said no. I had my arm broken a few months back from a dog bite and I wouldn't wish that on anyone!", "NTA and that is complete bullshit she pulled the “real man” crap…horrible!", "NTA\n\nYour wife was a huge asshole for implying you're not a \"real man\" for not wanting to put yourself in danger, but also this is a terrible idea in general. I'm a vet tech who frequently handles reactive dogs, including 150+lb aggressive cases who want me dead, and the worst thing you can do in those situations is be visibly uncomfortable/scared. The dog will pick up on the body language and get more freaked out. If they forced you or anyone to meet that dog when you're not 100% ok with it, they're putting human life in danger for no reason because it sure as hell won't help the dog.", "Your BIL needs to get a PROFESSIONAL trainer ASAP if the dog is as violent as you say. Uniformed owners with an extremely reactive dog is a recipe for disaster. \n\nI do think you are NTA, your wife was resulting to insults to win an argument which is incredibly immature.", "NTA. Your in-laws are being crazy irresponsible and your wife had no business volunteering you. They should be working with a professional trainer, not asking random people to visit the dog. But how do they go from \"don't get out of your car\", to \"come visit the pup!\"??\n\nIt sounds like the dog should really be put down. He's aggressive and someone is going to get hurt - and it won't be a little scratch.", "NTA. I bet your wife would be offended by any misogyny. Despite this, she has the gall to use misandry to not only try to manipulate you into taking an unreasonable risk that you don’t want to take, but she’s trying to use misandry to manipulate you into taking the much bigger risk by assigning herself protected status and assigning you the protector status. Gross.\nI hope that you are able to mine words and an approach that work for both you and your wife and that you are able to help her see the situation differently. You have every right in the world to choose your own risks.\nSide note: if this really is a deep rooted position of hers, might want to find out if her misandry extends to parenting. Becoming a parent can often result in a realization that the world is full of both misandry and misogyny. The misogyny was expected, the misandry, for me, was totally shocking and unexpected. Dads will be often and unapologetically treated as secondary parents by all sorts of people, not least their own wives. Honestly, I would have done the same, but my ex husband would have none of it. I offered up instructions, he instructed me not to instruct him. He pointed out that the child was his own and that I can’t tell him what to do with his own child. It’s very true. Parenting can’t work without mutual respect.\nDisrespect can be part of life because people are messy and we are all an AH in one way or another. You are not refusing to visit her brother and you are not refusing to look after her. Any such suggestion is at best, misguided. At worst, wildly disrespectful. Take the time that you need to figure out which it is.", "NTA.  I think you wife want to use you as a human shield just in case she needs to make a run for it", "Wtf are you gonna do to protect her lmao. That dog will make a quick go of both of you at the same time 😂", "NTA, steroid injections?! I understand how the stereotypical pit bull image sucks and they deserve so much love. But I have also seen a pit attack someone out of nowhere walking down the street. I always approach dogs with caution. I used to hang out with my friends chihuahua all the time then he came over to our new condo once and bit me. Any dog can pose a danger but the odds are stacked against you in the one.", "F that. NTA.\n\nPeople admire pets and forget that they're still animals.", "NTA. At all. Pitbulls are dangerous. That she tried to emasculate you for not wanting to be put into a dangerous situation is a dealbreaker for me.\n\nMy current partner tried to emasculate me exactly once. I told her, if she tries again, we're done. I don't do toxic masculinity, and I don't do put downs.", "Yeah I'm in the \"pit bulls can be good dogs camp\",\n\nBut with a history of \"sporadic\" aggressive behaviors, that's a no for me.\n\nNTA, and the esmaculating to try to manipulate you into going is really shitty.", "I have a lot of questions about this situation. Bear in mind, I don’t know much about dogs and I’ve never owned one in my life. I don’t hate pets or anything like that. I just come from a cultural background that’s indifferent to dogs and pets, in general. \n\nWith a dog like this, what’s the purpose of keeping it? It seems like this dog can really hurt people and it would be a lot to rehabilitate. Is it possible to rehabilitate this dog? I would hate to see a dog be put down but at the same time, it just doesn’t seem fair to keep it alive either.", "If you’re afraid of dog, it’s not going to help the dog. He’s going to sense it.", "I’m sure there are trainer friends/  people they could have come over who could help with Lucky’s training. Offering up family is not the way to go. I get wanting to help Lucky, but not at the expense of family.", "I almost want to ask if you have a hefty life insurance policy for your wife to be this adamant 😂. Knowing damn well you'd get eaten. IT ATE THROUGH A CHAIN LINK FENCE. jfc does she think denim holds a better chance? 😂", "Dogs smell fear.   You are not the right person for this exposure therapy at all.     They need confident relaxed people who know dogs and don't take BS from them.", "I have a reactive dog and I do not force any of my friends to see him as part of training. Fear of dogs is a very real thing that should be respected. If I had to say something in your wife's defense, I do think maybe your comment about finding a new wife was a bit harsh, but I honestly don't think YTA for wanting to keep your distance from the dog.", "NTA. If you’re not comfortable and confident around that dog, your presence will do more harm than good anyway. The dog will immediately pick up on your emotions and reaction and react to that.", "NTA. \n\nPartner's shouldn't volunteer each other for things. \n\nWe should all respect boundaries that don't adversely impact us, accommodate when they do, and accept them even if we don't understand them. \n\nNo one should ever be telling anyone, let alone someone they love, what being a \"real\" man (or woman) means. \n\nI get your partner trying to convince you it is safe and not a big deal. We all do a first pass at stuff like this. It's fine, then it gets annoying. \n\nBut what is remarkably gross is her saying that you should be a real man and protect her. It's just patently gross. Then add to that what she is saying is that when she does dumb shit, it is your job as a man to make sure she is okay? No way. \n\nI'm a woman, I expect the people I love of any gender to help me- as I would help them- when in distress. However, if people are gonna do stupid shit, no one is obligated to \"protect them\" because they did it to themselves. Her saying that would be a deal breaker for me.", " NTA. OP please refrain from this offer to become a chew toy for an angry beast. Someday the miracle of man's best friend may occur with Lucky. Until such time stay in driving distance from his mouth full of teeth", "I was beyond annoyed at this point and told her that hypothetically, I could find a new wife, but I couldn't get an arm back. \n\nThis part had me howling! Sorry… But as for visiting, fuck that noise! Dog is a disaster waiting to happen. It’s unfortunate that the dog was mistreated but why would your wife volunteer both of you to help rehabilitate it? Nope! From your comments, they are the pros and they are scared to try and muzzle the dog themselves! Hell no and NTA!", "*”hypothetically, I could find a new wife m, but I couldn’t get an arm back…”*\n\nPahahahahaha! Succinct and to the point. You are just pointing out the logic\n\nNTA - the dog eats chainlink. A femur would be like butter.", "NTA Your wife should have definitely asked before volunteering both of you, on top of that she definitely shouldn't have emasculated you either. If she needed a man to protect her then maybe she should've reconsidered going herself because basically that's like being ok with both/either of you getting hurt. That being said you shouldn't have said the whole you can get a new wife but not a new arm thing, even if it's true it was unnecessarily hurtful and could've really hurt your relationship. There were definitely better ways to make the point you were trying to make without going there so maybe a bit of an asshole but not on account of standing your ground and not going. I think when things cool down you should talk to her and try to calmly and rationally explain the reason you're not going and maybe apologize both for the earlier comment and for causing any undue stress by not going. Not saying she shouldn't also apologize but I've found that when you love someone and are having these kinds of spats it helps to remember that you're friends as well as lovers and put pride aside. It shouldn't be about who apologizes first but rather coming to an understanding while showing you care.", "NTA. Just wait till this drops g seriously injures someone.  Their troubles will be just starting", "NTA for sure.\n\nPretty much the only way I would be around that dog would be with a pistol in my belt.", "Let’s not forget that dogs like Lucky pickup on fear and react to it, putting you in a dangerous position. Please, please don’t put yourself in that situation. And try to talk your incredibly senseless wife out of doing it. Sounds like Lucky needs a lot more than immersion training and I certainly wouldn’t want to be a victim of a failed attempt. Your in-laws sound incredibly reckless knowing your fear and still wanting you to be a part of it. I am a huge advocate for pitties (donate to many rescues) even though I don’t have one myself, but I feel they are setting him up for failure with this strategy and Lucky will lose in the end if he does attack someone.", "NTA. You aren't refusing to see your wife's brother, you are refusing to be in the presence of a dog that has sporadic acts of aggression, doesn't take kindly to strangers and has chewed through a chain link fence. If your wife wants to be part of the exposure experiment she can, but she can't make you. Then insulting you to boot would make me have some strong words with her.", "NTA.\n\nDogs know when someone is scared and can interpret it as a threat. It would have been dangerous for someone scared to be around an aggressive dog. I feel for the dog, but you not going is best for everyone.", "NTA, honestly having someone that scared of the dog around the dog isn't going to help get him used to people anyway.", "Fuck your wife for that real man bullshit she put herself in a dangerous situation and she can get herself out a real woman wouldn’t put her loved ones in danger in the first place or belittle their fears and concerns", "Oh my God. I want to cry for this poor dog. My first thought was \"What pit bull weighs 150lbs??\" then I saw the steroids comment. WTF.", "Nta. No matter the situation its an AH move to volunteer someone for something without consulting them.\n\nMy stepdad does this with me constantly \"I need you to go help so and so clean their attic, just head over they are expecting you\" after a year or so of this I tried to put my foot down but he's a jackass and it never sticks. I just don't do whatever it is he volunteered me for then he makes me out to be the bad guy.", "NTA it’s best that you don’t go if you’re afraid of him. A dog will sense your fear and believe that there is a good reason to be fearful. It could cause him to act more aggressively. I think if your BIL and SIL have a lot of dog experience they would totally understand why you shouldn’t be a part of this therapy", "NTA your wife if a sexist not to mention the other crap she’s trying pull by volunteering you for stuff without your consent then insulting you for not going along with it.", "NTA. Your wife is one of those women who purposely put themselves into situations where they don’t feel safe and expect their bf/husband to be a “real man” by putting themselves on the line to make her feel safe despite the fact that it was her choice to get into that situation.\n\nYour wife is toxic.\n\nNext, she’s gonna mouth off to random dudes on the street and expect you to fight them.\n\nGet out of this marriage ASAP.", "NTA. You are not obligated to be around a potentially aggressive dog. You are not even obligated to be around a gentle dog if you are uncomfortable. \n\nBut this:\n\n>She then framed it as how a real man would come and make sure she felt safe and would protect her if needed.\n\nThat is disgusting. She needs to get out of this toxic mindset. A \"real man\" makes sensible decisions for himself. You decided you were not comfortable. Good job. She doesn't get to make promises for you then pull this weird sexist garbage on you when you don't like it. Very gross.", "NTA. It takes one “sporadic act of aggression” for this 150 lbs roided up dog to rip out your jugular. I’d never get near that thing", "Nope nope nope NTA!!\n\nI went to a friend's where I met their dog for the first time.  Friendly, outgoing dog that likes people I'm told.  I'm sitting in a chair.  I let the dog smell me.  He seems excited to play.  I pet him.  He jumps up and bites me in the nose with no warning. \n\nNew Years Eve in the emergency room and the plastic surgeon tells me I'm lucky to have my nose.\n\nNo one will ever make me interact with a dog if I don't want to.", "NTA doesnt matter the breed, if you feel unsafe around the dog then you're not in the wrong for avoiding it and if she wants to play the keeping her safe card, times have changed, shes a big girl in a modern world and dont need no man to protect her", "I would have said \"wow a person who is not a man is teaching one on how to be a man\" nta", "NTA and if they have kids you should call animal control or CPS. It sounds like the dog is endangering other people and animals it comes in contact with and no one knows when it will snap. It might be sad but putting it down might be the right choice.", "NTA. And your wife behaved like an a-hole.", "NTA. Also if you have children keep them far away. News is filled with stories of how the adorable little family pitbull suddenly one day decides to mangle the little ones.", "OMG and hell no, you’re NTA. \n\nI will never understand folks wanting to keep, and defending their ownership of, seriously dangerous canines. Yeah, there are humans that were responsible for making the dog be that way, and yeah, it wasn’t the dog’s fault… but that doesn’t mean the dog isn’t dangerous, and that keeping dogs that dangerous isn’t potentially foolhardy and catastrophic. \n\nI don’t blame you. No way I’d go there either.", "NTA.  The only way I'd even consider going on a visit like that is with some preparations that I don't think I can openly say on this sub.  The term \"hard cast\" would be present in those preparations (iykyk) because the fact is that \"Lucky\" is a dangerous animal and *should* be put down.", "If she’s subscribing to what “a real man” is, then put your foot down and not let her go and be a “good woman.”\n\nNTA.", "NTA - You may have a whole set of different problems if your wife doesn't think you are a real man. That's kinda nuts and mad disrespectful. You should have titled it \"AITA for refusing to see my wife's brother's roid raging, man-eating dog?\"", "That's super fucked up, misogynistic, and manipulative of your wife. Y'all need to have a talk and she owes you an apology. Christ. This dog is going to maim and murder someone. It's a matter of when, not if.\n\nNTA", "NTA when your wife trots out 'a rreal man etc' that's when you should say a real man protects his wife from a dangerous dog, and see how she likes being *told* she is not *allowed* to go. just to fit into the cave man ethos she wanted to create.", "NTA - I hate to be classic Reddit here, but run.  That \"real man\" shit needs to go and go FAST.  She's choosing to put herself in a dangerous situation and expects it to be your problem?  \n\nHow quickly would Reddit burn a person down if this were reversed and you said she wasn't being a \"real woman\" because she didn't \\[gender stereotypes.\\]  Not to mention, this one (and most examples of the \"real man\" argument\" are actually dangerous.\n\nCommunication is key, but if she doesn't understand your side after a well thought out conversation your best hope is professional support and the other option is the classic Reddit suggestion.", "NTA.  I love your response to your wife!", "NTA.  A real woman would not commit her husband to do something without asking him. \n\nAlso, by her argument a real man should have forbid her from going and putting herself in unnecessary danger.  \n\nMy point just being that was very manipulative and terrible of a comment on her part.", "NTA \n\nThere are so many nicer dogs put to sleep every day.\n\n As \"dog trainers\" they should know better than to keep a dangerous dog.", "NTA. I don't think that exposure therapy is going to be helpful if you're nervous and frightened of the dog. Animals pick up on stuff like that.", "NTA\n\nYour health and safety are more important than that dog's ability to be near strangers. Does your wife not know that when dogs attack people, they get put under quarantine and then put down? The fact that she also said you aren't a real man for going near an aggressive dog is also concerning. \n\nMy parents have a pit/lab mix and a German shepherd, both are known aggressive breeds so I am not going against the dog due to the breed. I am going against it due to the fact that the dog does not need to be around people. If you are told that a dog does not need to be around other animals, you don't bring another pet into the housing thinking \"exposure therapy\" will help. Your BIL, SIL, and wife are all idiotic if they think exposing a dog to strangers will help.\n\nSide note, the next time she wants to pop off about you not being a real man, remind her that a real wife wouldn't care more about her brother's dog than her husband.", "NTA. No one can force you to go visit a dog that makes you uncomfortable. I’m ask for helping neglected animals and shame on the previous owner for making this dog suffer and since he’s a pit bull the stereotype is also latch to him. It’s good they want to help this dog but do not force people to go that are not comfortable. You already express your discomfort they should respect that.", "Lol", "NTA. Just throw the whole wife away.\n\nFor real, though, sometimes humane euthanasia is the best option for dogs. With Lucky’s already disadvantaged livelihood, it’s something that does need to be considered if his “conditioning” isn’t improving his behavior.", "Also, dogs snse fear and that makes some prone to attack. Probably best you don't go. And I hope your BIL has good insurance. parading a bunch of strangers in front of a dog like that is a recipe for disaster! NTA", "NTA, dogs that were trained to be aggressive will act accordingly. And I don't blame you for not wanting to be a crash test dummy. Your wife sure is an AH for volunteering you, then trying to bully you into doing it.", "NTA. Your fear of the dog is just as valid as their desire to help the dog. It has nothing to do with masculinity and the fact that your wife framed it as such is both gross and unempathetic.", "NTA but dear lord, this is unlikely to end well. I really really hope that poor dog recovers and that they can successfully rehab him, but it does sound like he needs a specialist, and your wife is a total A for how she handled this. She sounds very very naive", "NTA\n\nA real woman/Wife would’ve spoken to her husband first before making a decision for the both of you. \n\nI would not put myself in a position to get hurt because I have a husband who can protect me. I wouldn’t want my husband potentially getting hurt either.", "NTA - That dog is a lawsuit waiting to happen.  My next door neighbor had a 12 year old Pit that had never bitten anyone.  She had a friend over with her toddler granddaughter.  The granddaughter threw a plushie at the Pit and the Pit attacked.  The child was in the hospital for a week.  The parents sued my neighbor and won a huge award.  The neighbors homeowners insurance refused to pay because their policy had a 'no pit or pit mix' rider.  My neighbor ended up in having to sell the house she had lived in for 40 years to pay the award.", "NTA only way I’d go near a dog like that is with a .357", "NTA.  I too would rather have an arm than a manipulating wife.  If your wife's idea of a \"real man\" is someone who does what they are told and doesn't stick to reasonable boundaries, but are willing to face dangerous animals, she has a very convenient definition there.  She might as well say, \"A real man is someone who does what I want!\"", "NTA… and what the hell is wrong with your wife? Is she always this denigrating? She sounds like the issue more than Lucky.", "Someone is going to get seriously hurt. \n\nThis story in particular came to mind: \nhttps://nypost.com/2021/12/20/mom-has-arms-ripped-dies-stopping-pit-bull-from-attacking-son/amp/\n\nDog was fine for years. Until they snapped and tried killing a child and ripped its owners arms off killing her. \n\nYour bil and SIL are being irresponsible here.", "\"She said it would be rude if I didn't go since she had already promised them, but I still adamantly refused.\"\n\nYou not fullfilling a promise made by someone else on your behalf is not rude.\n\nNTA", "> She said it would be rude if I didn't go since she had already promised them\n\n\nCompared to, say, making plans for people without asking them first? NTA", "150lbs? I would rather go try and pet a wild wolf.", "NTA and there have been many dogs who have that same issue that have caused serious bodily harm and even death.  I get that they are trying to save a dog's life and don't want to put him down but it's probably the best thing to do.  As soon as that dog gets loose in the neighborhood and hurts somebody they will be responsible in a big way.", "Hope the Madam arrives back in one piece?", "love that this ultimately strengthens your relationship with MIL, hopefully your wife realizes her mistake & can apologize when she returns (intact 🤞🏻). NTA.", ">She then framed it as how a real man would come and make sure she felt safe and would protect her if needed.\n\nThat's some toxic shit right there, whether she believes it or is just using it to try and shame you.\n\nIf she's going to do stupid stuff to get you to 'save' her so she 'feels wanted', she needs a therapist and you need to (quietly) prepare an exit strategy.", "In the UK recently they have been a series of dog attacks by breeds like lucky - I think 5 people have been mauled to death already this year. Maybe show your wife these articles too and she might change her mind", "Professional show dog handler here. 150 lb pit bull? Are you sure this isn't a Cane Corso or a Dogo Argentina, or Presa Canario? All 3 breeds have exploded in popularity recently. I'm not asking to be a smart ass, but I've never seen a pit bull anywhere near that size. It's important to know exactly what you're dealing with as all 3 breeds are different and I'd approach training all 3 differently.", "I've been biten by a dog that's \"normally really friendly\" despite barking it's head off and acting otherwise when unfamiliar people come over.  I would never elect to be around a dog that's known to \"random bouts of aggression\" - not exactly worded to OP but close enough.\n\nI think you're being smart.  Your wife's brother has a big heart wanting to help this dog out, but some dogs *can't* be helped (I'll likely get downvoted for that - ohwell).  Your BIL has to realize and understand that the downside to having such an aggressive dog is that *other* people won't want to be around it - which is completely understandable.\n\nNTA", "NTA\n\nFirst, your wife volunteered you for something without discussing it with you first.\n\nSecond, what Lucky's owners are proposing is extremely risky and dangerous.\n\nThird, I love animals and I fostered dogs for several years (including pitties). I'm telling you that the kindest thing anyone can do for Lucky is to euthanize him. Sooner rather than later, before he seriously injures or even kills someone. There are levels of aggression that a lot of dogs can be trained out of. What you're describing about Lucky is pretty severe.", "Nta my favorite part is her trying to say you need to make sure she’s safe. What nonsense if it’s not safe don’t go", "Your BIL and SIL are a lawsuit waiting to happen. Stay safe, NTA", ">Lucky is a 150 lbs pitbull with a history of, as the shelter put it, \"sporadic acts of aggression.\"\n\nLook, down vote me all you want but a 150 lbs pit bull would barely be able to move. Pit bulls are usually around 60-70 lbs at the most (pit bull isn't a breed, it's a group of breeds). I think you're making things up here to embellish your side of the story. I've bad a much larger breed dog that was really over weight and it was still only 130. It would have made a pit bull look tiny.", "JFC, I'm honestly expecting a disastrous update by this evening!\n\n(NTA.)", "Look your afraid and that's reason enough not to go, dogs can smell fear so you going would not help. And as for the way you were voluntold and then emasculated by your wife well that's way not ok (she wants to help but she doesn't get to just offer you out without checking your ok with it first). Seriously how would it go down if you offered her as help for something most reasonable people would be uncomfortable with? And then acted shitty when she said no. NTA", "The least your BIL should do is muzzle training and muzzle Lucky before introducing other people. NTA", "NTA.  And any wife who\n\n> \"...framed it as how a *real man*...\" \n\nshould be ignored at least, and possibly divorced.", "NTA It is one thing to do this with a dog who shows only a little aggression.  But Lucky sounds like one of those dogs that can't be saved.  It would actually be the kindest thing to have him put down. \n\nI recently got a three year old male dog. When he came to us, he was a little aggressive and even bit me. But in between the aggression, I could see pieces of a bouncy, happy dog who was trying to adjust. So I kept him separated from my dogs and other people, spent time with him, and walked him. He is now in my dog enclosure with the rest of the group and doing very well.", "Nta. That dog needs to be put down before it kills someone. I feel bad for all the other dogs that could be helped but they have decided to waste their time and put people in danger trying to \"help\" this one.", "I've been attacked by a dog before and it is no fucking joke. NTA for keeping yourself safe. Your wife is TA for disparaging you bc you don't want to get your face bitten off.", "NTA Am I the only one concerned about the wife’s real man comment? OP I hope she doesn’t say stuff like that often (& if so you need marriage therapy!)\n\nEdit: & that poor dog. None of this is his fault, though I get your fear. Maybe Lucky needs a muzzle during his exposure therapy? He also needs a dog proof dog run.", "Ban the breed", "NTA 100%. The “I can get a new wife but not a new arm” line made my day! Good for you for not allowing yourself to be manipulated into this.", "Probably going to get downvotes for this, but not all dogs need to be saved. Sometimes the kindest thing is to put it out if it’s mental misery. \n\nOh, and NTA. Not at all.", "NTA. I had a pitbull, from a puppy, for 4 years. We were GOOD owners. Did all the right things. He was an amazing dog, the best dog, until he wasn't, and randomly went after our son out of nowhere. I'll never own another pitbull. I understand some of them are amazing, I still love the way they look, but to me it's now about mitigating risk. I'm sure I'll get some backlash for this comment, but it is a true story and it is my experience.   \n\n\nETA: he is now in a kid free home with another pitbull and we know the couple so see pictures of him frequently on Facebook. He is happy <3", "NTA\n\nQuite charming how your wife volunteered you to go get mauled. Such a loving gesture on her part...", "Nta. Misleading title though. The issue is with the dog not the person. Your wife is ridiculous volunteering you with out asking and having a tantrum when you said no", "r/BanPitbulls", "We need another update when your wife gets back from her little play date with Lucky.", "Pitbulls kill more people than all other dog breeds combined. Even \"good\" ones can snap and kill/maul someone on a whim, let alone an already known to be dangerous pit.\n\nDefinetly NTA.", "This is not a dog issue or a BIL issue,  this is a wife issue.", "NTA though sorry you had to realize your wife is a sexist misandrist who tries to shame you by saying ‘a ReAl MaN’ would do this", "NTA\n\nI love pits and it’s not Lucky’s fault but he should be euthanized. An over muscled, uncontrolled, aggressive dog is a disaster in the making.", "NTA. She volunteered you for something without asking you first. Something she may not have considered is that Lucky needs calm people around if he's already fearful and aggressive. If you come in with your fear it will be nervous energy and will not help matters. Shes not entirely an AH though because it sounds like typically a visit to them isn't an issue, but given the current situation with the dog it would have been best to ask first.", "I love your response to your wife about the comparison between a new wife and a new arm. I wish I had the courage to say something similar to mine should such a situation arise.", "If she went to see Lucky I think there’s a reasonable chance that you might need to find a new wife.", "**Info** \\- What did you mean when you said, \" that I was doing the most\"?", "I don't get it. They are planning on introducing multiple people to the dog until it attacks someone? My friend tried a similar thing. Adopted a pit mix and it attacked the gardener. Sent it for training, came back and bit someone else.", "NTA pitbull owners are always in denial about the breed's issues, have friends who own them and they always ask me to pet their dog and i always decline. Literally feel safer around wild animals lol.", "a clean house, hot dinner and a back rub waiting for her man when he gets back from a hard days work.", "NTA.  Look, I know pitties I would trust and hang out with.  But I know that pitties (and any dog, actually) with a history of random aggression?  That's a ticking time bomb, and you were expected to be bait, stepping on a trigger.  I don't let any rescue pitbulls near my cats (around here, cats are often used as bait animals for pitbull fighting rings) just in case. I've NEVER had a pittie owner flip out about it--they understand that I'm not saying their dog needs to be euthanized or anything, just that I don't want something I love (my cat) to be  a potential trigger, in which both the cat AND the dog would pay the ultimate price if the dog attacked.", "No, you're not the AH. Your wife shouldn't be volunteering you without at least asking you first.", "Absolutely NTA. You're wife is though. Your BIL & SIL needs to find an expert on dogs. This is very dangerous for everyone involved. Stand your ground.", "NTA\n  I love my son's pittie.  Pitties are usually wonderful animals.  Cer sleeps in my bed when my son is out.  He's terrified of being left alone (because of prior neglect) and has jumped out windows, ripped off doors and dug through a trailer wall to the metal siding  - out of fear.  He LOVES everybody and every animal. And rocks.\n  This poor baby has been abused physically, mentally, and medically. He's going to need a lot of specialized retraining. He also needs a vet check for steroid damage, his thyroid, and could possibly benefit from medication to help his anxiety. \n  Dogs do sense fear and it scares them.  Anyone helping with this training needs to feel safe and confident.  You would trigger his fear aggression causing him to be more afraid of strangers.  You may be able (and willing) to help in a few months (yes, months) after training has progressed.\n  I also highly encourage a good muzzle to increase safety.", "NTA and based on your post and comments, I feel so badly for Lucky but he probably needs to be put down. There's no way he's living a happy life. Poor pup 😭", "NTA - Sorry your wife threw the masculine thing in your face. Not cool. I'd probably be a bit hurt if my wife said that to me.", "NTA - Nothing I need to explain here.", "NTA - Your wife, her brother and your SIL can collectively share that 'L'", "Has she come home yet?  I’d like an update.", "Your title is misleading, you’re not refusing to see a person but a dog.  That’s nothing wrong with that based on your fears and the dogs history.", "NTA but I hope you see how manipulative your wife is. Personally I don’t understand how you could want to be with someone that is extremely misogynistic and try to manipulate you into doing something She knows you’re not comfortable with. It shows who she really is. She doesn’t care about you or your safety. She only cares about how she looks to other people.", "NTA. I do look at r/reactivedogs so I know a *lot* of care can go into looking after a reactive dog like you're describing there. I would honestly suggest you look at the sub to see how people handle their reactive dogs and how much nuance can go into their care.\n\n*However*.\n\nYou do *not* need to be around a dog you feel unsafe around. Your primary concern is your *own* safety and mental health. If you do not feel safe, you *do not need to put yourself in that situation*.", "NTA- some dogs just aren’t stable enough to be rehabilitated and it’s in everyone’s best interest for the dog to be pts. It’s sad to see, but it’s a safety issue. \n\nHonestly, where are they living? Is their homeowners insurance even aware they have a dog with a known aggression history? That could easily get them dropped if there is an incident and they knowingly were exposing people to the aggressive dog, and not just dropped, but also sued personally for any injuries. Especially if they know he is able to escape. \n\nEvery professional I’ve met who had a true educational Background in canine behavior understands that unfortunately, for safety reasons, not every dog is able to be saved. I’ve only ever met self educated rescue types who feel they need to keep every animal alive no matter how much risk (legal risk and risk to their wellbeing). Some dogs just need to have their best last days filled with yummy burgers and then a peaceful goodbye for the sake of everyone’s safety. \n\nYour wife is crazy for volunteering to do exposure training with this dog, especially if it’s at their home where he could be even more territorial and aggressive.", "[ Removed by Reddit ]", "NTA, and for the dog's sake as well. \n\n\nYour fear response could set the dog off and set its training back. \n\n\n\nIt is best for the dog to not be exposed to people who will have an immediate fear response during this phase. Being afraid of it would strengthen the behaviours instead of training them out of the dog. \n\n\n\nThe dog needs to bark and posture and the person to not care at all for exposure therapy to work best at this stage. \n\n\n\nYou going wouldn't help anyone, and your brother in law would 100% understand and support you not being introduced to the dog at this stage.", "You're scared the dog is scared. Not the best combination.", "NTA. Your wife has no business volunteering you. Tell her I said pound salt!", "Absolutely NTA! Wife is mad to choose this particular hill", "NTA.  You had a reasonable fear and didnt want to go; wife volunteered you without your knowledge.  Saying you could replace your wife though, uh...  Technically correct, but not the smartest thing to say.", "Unfortunately that dog will hurt someone and only then be put down (something that should've happened already, shelters that place dogs like these should be shut down).\n\nHopefully the person hurt won't be your idiot wife.", "NTA. You can not expect someone to go when they  A.) Don't feel safe and B.) didn't ask to be volunteered", "NTA. The real man comment was completely out of line and fucked up.", "Had a semi similar situation with an old girlfriend . She showed me a video where a hit man walks into an outdoor restaurant that’s and kills a man sitting at the bar. The only other people in there were a couple sitting at the edge of the dining area. The boyfriend takes off running and the girlfriend stays there to watch. My ex- girlfriend asked me if I would run too. I said yes. She said “what kind of man would leave his girlfriend like that?” And something to the effect of a real man wouldn’t do that aimed at me. I told her that if she isn’t smart enough to follow me out is an active shooter scene then she might not smart enough to be my girlfriend. We broke up not long after that and I felt like the weight of the world was lifted off my shoulders. NTA.", "You saw the photos of the 13 year old girl that two pits attacked and ate her face?\n\nI'd recommend taking some photo's of your wife now\n\nSo you can do a before & after", "Yea fuck that shit NTA", "You wife needs to check her attitude at the door. Who forces someone to interact with a massive pit Bull? The breed was bred specifically to fight.", "NTA. Your wife is being dumb. You did the \"manly\" thing if trying to protect her by keeping her out of the situation. If she goes and gets bit you get to hold the biggest \"I told you so\" over her for life when she's trying to be wilfully stupid. Not that she'll likely listen...", "NTA, but you will be if you don't update us on whether or not your wife gets eaten. (Never thought I'd ever say/write something like that).", "You: NTA.  Your BIL:  AH.  Your wife:  AH, and I kind of hope Lucky eats her.", "NTA.\n\nYour BIL, SIL and wife are all very naive though. And that's me being kind.\n\nWho the hell thinks exposure therapy with strangers for an aggressive dog is a good idea? And who the hell would agree to that??? This is a recipe for disaster and I don't think anyone on here reading will be surprised when the dog finally attacks someone.\n\nNow I am going to say it makes me sad for the dog. It's not his fault. But your BIL and SIL are horrible pet owners and are really no better than the previous owner that caused the dog to become violent in the first place.\n\nStand firm, OP. Don't go and if you end up having kids, do NOT let your kids go see that dog.", "NTA. I’ve taken a bitey rescue, but I was warned well in advance & they were referred to me because I had a track record of dealing with biters in the past. I’d never have invited anyone round to go “hey, let’s see how you nearly getting bitten to shit goes”. I don’t think anyone but me & my husband handled them till we’d gotten the problem sorted, and this was for **rodents**, never mind a grown ass dog on steroids who can eat through chain link. WTF?", "ESH\n\n\nYour wife for obvious reasons, and you for \n\n>hypothetically, I could find a new wife, but I couldn't get an arm back\n\nhorrible thing to say to someone you love", "You're not an AH, but you are being dramatic. You can go stand outside and talk to a dog to allow it to socialize without putting yourself in harm's way. You could set more reasonable boundaries like that the dog needs to be restrained when you're around it while still helping with socialization. If you are truly terrified, you could have stayed indoors or in an adjacent room and still joined your wife for the trip.", "Your wife should have taken bear spray and a taser. Might at least slow it down a bit.", "I’ll never understand why anyone would expect you to put yourself in (what you legitimately feel is ) a dangerous situation just so feelings aren’t hurt?  You are NTA. But someone else is.  And you live with her!  Be safe. Stand strong.", "Doggy's been subjected to stereoids???\nOufff.. \n\nUnfortunately people are shitty and that dog is now paying the price. What is the likelihood of it having a good quality of life, if it is constantly stressed to the max, so much so that it chews through a metal fence?\n\nIn the worst case scenario there will be other victims too; as that dog is highly likely to hurt somebody. And it would not surprise me if it already has bitten or attempted to bite your BIL/SIL and they are minimizing it. \n\nI know what my choice would be.", "NTA no no no, hell no. Holy shit, your wife was WAY out of line trying to guilt you into coming along. Just wow.\n\nAlso, BIL and SIL should know better than to suggest exposure therapy to completely random, inexperienced people. This could actually make things WORSE for Lucky because he will pick up on the fear and nervous energy of the visitors which could trigger his aggression. If they want to go this route, they should be inviting other experienced rescue people and dog trainers to visit because they will know how to behave and how to react.", "NTA. I hate when women say a real man would do X and Y. (as a woman)", "Do you have a good life insurance policy or something? Your wife is cuckoo!\n\nThat being said, we have 2 pit rescues (1 the vet believes is full pit, the other looks to be a pit/lab mix). One was abused and the other neglected. We have raised them for the past 2-3 years and zero signs of aggression or we’d rehome. If they were as large and dangerous as you described I’d look into BA (new term learned from Reactive Dogs sub, behavioral anesthesia). Asking you to put yourself in danger (especially when you are unwilling to —which I understand and agree with!) to help with these dogs is crazy", "Perks of having an older woman as your wife. Even though it's only one year. They will disrespect you. I've had younger guys ask me out but I've declined more for their own good. Same with guys that are in a lower level in school but older than me. I very much don't want to be somebody's truama story.\n\nAnd they move on and I'm still friends with a few. And sometimes if they need advice for something I'm the go to person. I'm very proud 🦚 of it actually 😎", "NTA. I am guessing the dog would also sense that you are afraid/don’t want to be there. I love dogs, but would be scared to go near one of these breeds, read to many scary things. My husband got attacked by two dogs, same breed, luckily minimal injury. For a couple years after the attack, all the dogs we came across outside barked at him, small large breed didn’t matter. Which was not the case before. It’s been almost 10 years and they don’t bark anymore but they sensed it and didn’t like it.", "NTA. I would only go if a licenced dog trainer was there and recommended it. And I'm a firm believer that most \"aggressive\" dogs are actually scared dogs, and training helps them trust and take their cues from their owners, keeping them from being scared and displaying \"aggressive\" traits.\n\nNothing wrong with saying you'd be happy to help but would be more comfortable with a dog trainer there.", "Coming from someone who loves loves loves pit bulls, hard NTA. You have a right to keep yourself safe and your in-laws are playing a dangerous game. Lucky needs help that is beyond their expertise. Please sit your wife down for a heart to heart ASAP, the emasculation ploy is not okay", "NTA My rule is I stay far away from unpredictable animals. I know some people that rescue pits and they were really sweet dogs. Including the 100lb one that thought it was a lap dog. \n\nUnfortunately these dogs have had their original job breed out of them. That coupled with bad owners has destroyed the breed. \n\nThey have been banned here and those that were grandfather in have to be muzzled in public. Vets won’t treat them - closest vet that will is a 2 hour drive.\n\nThe dog will sense your fear. And not cool volunteering youn", "NTA \nRespect each other. She should not have volunteered you but its a great catalyst for starting a conversation and setting boundaries with each other.  Use this as a wonderful opportunity to grow closer and stronger as a couple. Respect her wishes to go help out, the same way she should respect your wishes not go. \nPS don’t go. I have a little experience with aggressive pits and I will tell you they pick up on a persons vibe and your discomfort might be misread. Especially considering all of the abuse the dogs suffer prior to being rehomed with your in laws.", "I was going to say nah until she tried to voluntold you and then emasculated you. Nta.", "NTA. You are always allowed to refuse to go to places you don't feel comfortable in. BIL and SIL may be wonderful trainers and foster parents, but if *you* don't feel safe going in, you don't have the obligation. Having that type of nervous energy around isn't safe. \n\nYour wife should have said \"I'll ask (OP) if he wants to come, but it'll be his choice.\"", "NTA. \n\nNot to mention the dog will 1000% feel your discomfort and who tf knows how it would react to you. This whole idea is ridiculous, imo. If they aren’t trained animal behaviorists or dog rehabilitators, this course of action seems like an incident waiting to happen. In fact, it wouldn’t be even slightly surprising if one of your in-laws ends up hurt by this dog.", "I'm afraid of dogs. Definitely NTA. Your wife was very wrong for attacking you like that.", "NTA \n\nI had a friend keep a pit for the exact same reason. Ruined his relationships, and his life. I had to deal with  her (the dog) while dating him. boy did she earn the title of “that fucking dog”. Difference was he loved that dog more than anything and she hurt me, destroyed my stuff, refused to let us leave the apartment etc. no apology. she can do no wrong. /s", "NTA!", "Um your wife wanted to put herself in a potentially/likely dangerous situation and got mad that you weren’t enabling it? No offense but YIKES. \n\nNTA.", "Yeah I’d say you’re NTA!", "NTA", "NTA. You can find a new wife.", "NTA. I love dogs but no way in hell would I go there. At least not without a gun and mace. And even that would be a toss up.", "NTA", "NTA\n\nprepare to says \"told you so\" when she will come back shocked or injuried.", "Nta. It doesn't matter what she volunteered you for - you are not obligated to do it. She is your spouse - not your boss or slave master.", "If you wanted to nurture your marriage you could have told her you want to keep her safe instead of making sure she knows you see her as replaceable.  It was probably a sarcastic dig but it was a damaging comment.", "I was going to say N A H but the comment from your wife about a real man made her her one. NTA", "Holy shit, you have multiple issues.\n\nFrom my perspective, I was attacked as a child by a dog, and suffered a phobia that only got better in my late 20s. Just a few years ago, I got triggered and left a party because a Rottweiler went beserk among the guests and the owners just let it happen without stopping it. \n\nMy wife understands so in a situation like this, I would absolutely not go under any circumstances. But I also have a wife that understands.\n\nSo I get your reasoning, and you are NTA.\n\nBut dude, you need to have a conversation with your wife about that attitude. She was way out of line.", "NTA, clearly. If things cool down I would kindly attempt to encourage my wife not to go as well. I had a very very scary encounter w a dangerous dog and let me tell u, they will not let go until they want to and no owner can intervene if a dog decides to do it.", "NTA. For a reason I haven’t seen mentioned probably because I’m too lazy to scroll. I am not a professional. But I have had animals of all kinds all my life. They sense fear. From honeybees to horses, they are reactive to the energy of the person around them. Lucky is fine with your wife because she doesn’t seem afraid. She should go. Great for her and the dog. You are afraid. And do not need to be near a reactive dog. He will sense it and it will set him back in his healing if he snaps at you and had to be reprimanded. He needs to be around steely nerves people right now.", "NTA In addition to other reasons stated, the dog will pick up on your discomfort and possibly be more likely to attack", "NTA - Sounds like BIL and SIL are out of their depth. They need to get Lucky to a professional who is use to reactive dogs. The half assed plan for exposure therapy is going to end up with someone getting hurt. Sounds like you have some common sense and use it. Please stay away from Lucky for your own safety.", "NTA.\n\nI think that your Brother-in-Law and his partner seriously need to consider whether they are capable of controlling what is clearly a dangerous dog, and if they are willing to accept the repercussions if anything does happen. I sympathise with them not wanting to doom a dog to what will certainly be euthanasia, but with that comes a lot of responsibility, and risks.\n\nYour wife also should not have volunteered you, especially for something that is potentially dangerous. You also do not deserve to be spoken like that. That was shitty of her.\n\nI’m the owner of a rescue, who was neglected and never socialised by his former owner. He’s improved a lot in the years I’ve had him, but as much as I love him, the safety and comfort of other people is always my priority.", "Nta, she didn't talk to you about it. She signed you both up. And tried to make you feel guilty because she couldn't face going alone. I'd be pissed off too.", "NTA", "NTA\n\nI'm working with a dog with behavioral issues, and any \"exposure\" is strictly volunteer-only.", "NTA- I'm a huge advocate for helping dogs like this BUT I've also been mauled on 2 seperate occasions. One of those times I was 4 and had to have surgery to put my face back together. I lucked out because I was only 10 mins drive from the children's hospital and they had one of the best rated plastic surgeons in the country on staff that put me back together.  Second time I was working for an animal control officer(little did I know the worst one the town had in decades)  and I had to break up a dog fight in an enclosure. \nThese situations can go so badly, quickly. Good on you for recognizing that you won't bring the correct energy to the situation.", "NTA. The best way to protect your wife is not to take her there.  She made a decision without you.  Her bad.  Her manipulative behavior afterward is highly toxic.", "NTA. Rescues waste time and resources on dogs like this when countless other ones sit in kennels or get euthanized. And this isnt a breed thing, especially since no \"pit bull\" should be 150lbs unless insanely obese. \n\nIs he muzzle trained? I would agree to meet up only 1. If the dog is muzzled. 2. On neutral territory. Like going for walks. Not entering *his* domain. And 3. Maybe even during a training session with his behaviorist.", "Nta. Dogs sense fear, so you definitely shouldn't go near that dog if you are afraid of it.", "Nta. And I laughed so hard about the new wife but not a new arm part.", "NTA\n\nAlso your wife pushing toxicity on you with the “real man” stuff is really disturbing. She also shouldn’t be signing you up for things without your permission.", ">then tried to emasculate you\n\nYeah, that was toxic masculinity being pushed by a woman, wife is a major asshole in this. I doubt she's planning to be a real \"woman\" and stick to being a nice submissive housewife who has a clean house, hot dinner and a back rub waiting for her man when he gets back from a hard days work.", "Voluntold. My new favorite word!", "She volunteered him and then called HIM rude for declining.", "I count not agree more. Good luck op.", "Yeah, there's no need for her to go there and get exposed to danger. If she feels in such danger that she needs a man to protect her, she shouldn't go.", "it’s a scary level of contempt. the cruelty of trying to hurt someone you “love” to avoid social embarrassment, the absolute bottom-barrel ignorance of weaponizing masculinity and gender roles like that… skip the dog, OP, and seriously rethink if this is the kind of partner you want.", "There are times when a dog should be put down and not rehomed even to an experienced owner, I would say this is one of them. If that dog breaks out it's a serious liability and can kill or maul someone. NTA and you seem to be the only voice of reason.", ">\" She then framed it as how a real man would come and make sure she felt safe and would protect her if needed.\"\n\nI she thinks she's in danger, why the hell is she going????", "So what she was saying is that she would expect you to put yourself between her and the dog if he got a little nutty? Lol she is such an AH. You are NTA.", "right and like animals can sense fear, like it would not be good for him to go see this dog while he’s shaking, it needs to be someone confident", "Right? Any man, \"real\" or not, is not winning a fight with a 150 lb roided out pitbull. The inlaws should be doing this kind of counterconditioning with trained professionals, not random family members.", "Right, this is a job for a professional. And if the professional tells them it's too dangerous, they need to listen.", "Thankfully, they don't have any children", "How is she gaslighting?", "For his part my BIL has started an entirely new workout regiment to bulk up and stop Lucky if needed. But I honestly doubt he can do much if Lucky does go all the way", "A 150-pound pit bull on steroids that’s already chewed through his enclosure once and doesn’t like strangers!", "> When I accept something for me and my wife, I always make it clear that it is tentative, pending my wife's agreement.\n\nIf you genuinely do this, then you're an AH.\n\nYou're agreeing to something and being the good guy, and if it doesn't happen, it's because your wife was the bad guy who disagreed.\n\nYou made your preference/choice public, but your wife may not want her preference/choice to be public. However, you don't respect her enough to give her any choice if she wants her personal preference/choice to be public.\n\nInstead of both of you discussing something and agreeing together and at the same time, you accept first and all the pressure falls on your wife. And then everyone knows who preferred/chose what.\n\nThis is exactly what OP's wife did. She agreed that they would do it, fully expecting OP to be on board, and then it got awkward when OP refused.\n\nThis is how OP's wife probably justified it in her head.\n\n\"I'll accept, but it's tentative pending my husband's agreement. But don't worry you guys, I'm sure he'll be on board with Lucky's exposure therapy.\"\n\nSpouses who do that are AHs.", "What?", ">but you are being pretty histrionic about a dog taking your arm off in that setting\n\nIts a roided up 150 lb pitbull that chewed through an enclosure.  WTF are you even on about?", "This comment is nothing more than a long winded way of saying, “you should just man up and do what your wife says”", "You have obviously never had to break up a fight with a Pit. I have one myself, and I know how strong he is and thankfully he its very well trained and socialized. OP is very sane to be wary of the dog.", "Pitbull owner logic is usually pretty deluded", ">the breed doesn’t even matter\n\nThe breed 100% matters.  Pits have an propensity for hair-trigger aggression, gameness, and size, strength, and agility due exclusively to genetics and how they were bred.", ">You suck for saying that last bit about your wife being replaceable\n\nShe insulted him by saying he's not man enough to face a crazy dog on steroids, his response was appropriate considering she didn't ask if he wanted to come and decided for him, and insulted him and belittled his logical fear/worries. He can't replace a body part if the dog took it off of him.", "LOL you know good and well if OP said \"no WE are not going\" you would be on here saying \"OMG OP your a controlling abusive AH! Red flags!!\" GTFO with this nonsense", "Which is really unfortunate because a pit bulls natural temperament is quite sweet and loving. People just abuse them into being attack dogs.", "NTA, but you aren't \"refusing to see her brother\", you are \"terrified of his dog\", which is a reasonable, if unfortunate, thing.\n\nI personally might have chosen differently, but what I'd never do is expose a dog that's acting out aggressively to a person that's afraid of it. Your fear will not help it rehabilitate.", "Yeah, honestly, that dog does not sound like an animal that it's safe to be around. Exposure therapy sounds like a monumentally stupid idea as well as a great way to face a lawsuit after the dog has mauled someone.", "I literally read an article yesterday about a guy who had his arm TORN OFF by his own pit. The dog is unsafe and this is a terrible idea that could get someone hurt. Your wife shouldn't go either. \n\nNTA.", "You have a shitty wife OP. One who doesn't respect you at all.\n\nNTA but rethink this marriage, if for your wife is more important a dog (that's not even hers) than you then I don't know why you marry her.", "As I was reading, I was like \"what does she expects him to do against a pitbull?!\"", "I'm a firm believer that rescue animals deserve sevond chances, but some dogs should and need to be put down. Pitbulls, especially pitbull terriers, are notorious for aggression, which is why they are banned in the UK. \n\nExposure therapy will NOT help this dog. It will only stress it out further. Hell, it chewed through A CHAIN FENCE...!?!?! As heartbreaking as it is, the healthier thing would be to put this animal down. The animal will always be an unpredictable risk.\n\nThis animal isn't reactive because their scared/ nervous, they're reactive because they've been trained to be aggressive.. Keeping this dog is incredibly stupid and dangerous to both of the owners.", "A real man? Seriously?", "\"I can get a new wife but I can't grow a new arm\", you are forever a legend for this. NTA at all, I am in dog rescue and sad as it is, this dog can never be considered safe and you're right not to want to be the person who finds that out.", "NTA, I completely understand how you feel. Also, my Mom does some work with dogs and is always pointing out they can sense fear or even hesitation. I have a hard time being in control of her dogs because I don't 'feel' like an alpha & you have to be one with them. (They don't hurt you; they are just smart asses.) I don't think it's going to help socialize the dog if you are understandably terrified. My mom could be calm... but not me.", "You probably wouldn’t have such a good sense of humor if you lost an arm either. I’m sure your wife appreciates that quality and will come around.", "Considering the crap she pulled, by a) \"volunteering you\" without asking first, and, b) trying to emasculate you, then this:\n\n\n\n\"I was beyond annoyed at this point and told her that hypothetically, I could find a new wife, but I couldn't get an arm back.\"\n\n\n\nWas well-justified!!\n\n\n\nNTA, OP", "Your rebuttal to your wife is Gold! Laugh my a off! \nBut it’s truth limb’s can’t be grown back. Spouse can be change. And emasculating you while being scared herself sheesh. \n\nYou volunteer yourself lady you could have say no to your brother if your scared. Not your dog not your problem. \n\nNTA op. 😤", "More than a few people *have* been killed by these monsters", "I'd rather poke a bear than a roid raging pitbull.", "Yeah, there’s a difference between protecting your wife from something as she’s walking down the street and unaware and willingly putting herself into harms way.\n\nPeople used to do this with their dogs when I worked at a hardware store. My coworker was terrified of dogs and a cashier, she thought “there’s no way this owner brought in a dog who would hurt people” and the dog then tried to bite her. The owner then said “oh, sorry. I’m trying to get him used to people.” She didn’t go near dogs brought in after that and neither did I.\n\nNTA", "Tons of women think this way and make these comments. Just my experience but there's always an expectation that men follow their own gender roles. I'm sure their relationship is otherwise 99% fine. My wife makes almost as much money as I do, has the same level of education, and I could 100% see her making this comment. It doesn't mean that OP lives in an toxic relationship with his wife.\n\nI was waiting for a comment about OP reevaluating his marriage, and here it is. Pump the breaks. Sometimes the right response is just communication, or if you want to be an asshole, reminding her what gender roles she doesn't like or do.", "100% agreed. I love all dogs (well most of them), if this dog is so dangerous, there is something not right in his head and he needs to go to the great beyond. Its sad; but that is what needs to be done.", "Huge animal lover here, and I agree. I mean that dog apparently chewed through a metal fence. Imagine the mental condition that dog was in that drove it to do that. Imagine the physical and mental suffering.", "My brother used to have a pitbull named Cujo. Cujo started attacking his brother who was my dog, and when I stepped in to intervene he bit my arm so hard i had two different fractures. Never thought he'd live up to his name so well 🙃", "Maybe OP should make sure life insurance is up to date.  \n\nMy cousin had dogs that attacked her ex-husband.  He’s actually lucky to be alive, but with some life-altering effects from the attack.\n\nCompletely NTA.", "You are not refusing to see your BIL and his wife; you are refusing to see a aggressive and hostile dog. Focus on that aspect. NTA.", "Let’s hope he does", "Precisely. This dog was trained and enhanced to be one thing: a living weapon. It's only a matter of time before Lucky turns on the BL and his wife.", "I would reframe this to your wife. Dogs know when someone is on edge or uneasy. And a dog that already has behavioral issues will not react well if someone is clearly on edge. I would tell her that you do not feel comfortable around the dog and you would not be helping that dog in any way by not being open and easy going. \n\nYour wife should not have voluntold you for this and her other comments are hideous. However, if you rephrase it by coming at this as you would probably do more harm than good, you may be able to get through to her on this issue. But you have a much larger issue with how your wife reacted to you saying no. And you'll need to have a larger conversation once this settles.", "Show her the TN mom story…", "I think some people have never been around a dog that flat out is not friendly. I remember my first experience, I could not even get off the couch without someone restraining the dog. Said dog should not have been in the room. Really changes your opinion of dog safety.", "No it isn't, and your wife's brother and his wife need to call a professional. NEED. As others have pointed out, dogs can do some serious damage. That dog's the size of a large wolf. The fact that it was stressed enough to chew through a chain link fence is incredibly telling. It's quite possible the kindest thing for the dog is for them to be put down so the poor thing isn't in a perpetual state of anxiety and stress.", "getting flashbacks here from my teen years.\n\na pretty close family friend had a son who adopted some kind of abused bull terrier dog. that dog was trouble and would apparently lunge at other dogs while walking and would be \"aggressive\" towards visitors. they went with the chainlink solution too and of course that dog chewed through that.\n\nanyway, one time i was visiting and the dog was in the garden. i was asked if i'd like to see the dog like \"oh he's lovely once you get to know him\". so i go outside, dog is on a slack lead -> walk up to the dog -> \"h-hey budd-\" -> dog lunges at me and instantly knocks me over -> immediately refuse to be anywhere near that dog\n\ni cannot impress upon you enough how strong those dogs can be. it's a freakish amount of force.\n\nso no, NTA. and to be frank, your partner is very naive and/or insane to even think this is a good idea let alone pulling this shit on you considering the preceding knowledge of the dog's nature", "A purse dog managed to rip chunks out of my mom’s forearm when she tried to pick up our dog so he wouldn’t be bitten by that feral thing and she still has the dips in her arm. Pits have some of the strongest bites of all dog breeds and can completely fuck you up. There is a reason assholes use them as fighting dogs.\n\nThis dog deserves the chance to rehabilitate but not at the expense of your health and life. You have more chance to survive a shark bite than a 150 pound pit jumping you and biting into your shoulder.", "She’s Lucky’s wife now.", "She is probably making the assumption that the dog won't attack her.  From the many comments, I think we are all going with \"Yeah, it will.\"  So how would your presence there help?  Do you have something to pry its jaws open?  What if it takes a latch to her neck?  Will they have it on a chain?  Do they know how to pull a dog off once it has a grip?\n\nDo not go in the pit with 'Roid Rage Roger.  NTA", "INFO: is your wife a big fan of Nope and trying to recreate the \"Gordy's Home!\" sequence?\n\nTell her to Google \"dog bite degloving\" so she can understand exactly how much damage a dog can do when it's pulling aggro. Pit bulls are great dogs, but you cannot ignore the fact that they have a very powerful bite. I love bullies to death, but you couldn't pay me to do what your wife wants to do right now. You are not crazy for standing your ground here.", "Pit bulls can run up to 25-30mph and this one was given steroids, nobody would stand a chance", "Lol I don't think many younger people can outrun an aggressive dog either ways.", "OP, guaranteed if she gets hurt she is going to blame you for it, not herself or her family members for thinking they can provide for a dog that is clearly beyond their control.", "INFO: are your wife and BIL aware of and prepared for what happens when this dog bites one of these \"volunteers\"? From the sound of it, what this dog would need to be properly rehabilitated is beyond the experience level of BIL and someone is going to get seriously hurt or wind up dead.", ">her and my BIL are slightly frightened of the idea of trying to put one on\n\nOk your wife is TA, but so are they.\n\nThat dog needs actual specialized care or to be put down. Because if they are scared of putting on a muzzle, which is meant to protect people from this animal, then this dog shouldn't be around people PERIOD.\n\n How incredibly selfish and blind do they have to be to expect people to put themselves in danger for the dog's supposed training. Tbh this doesn't seem like it will actually help train him to be comfortable around people at all. I've never owned a dog, but I'm pretty sure exposure therapy will never work if they can't, at the very least, put a muzzle on him.", "I muzzled my previous dog JUST because she was reactive with dogs. She never actually bit a dog, but I wanted the safety. We worked on reconditioning her and did not stop using the muzzle outside until I was confident both she and I could handle it. We both hated the stupid thing, but other people's safety is more important than a dog not liking a muzzle.\n\nIf they are afraid to muzzle, they cannot actually handle the dog. They have to be trained to accept it, but it is not an option at this point. If they are FRIGHTENED to do it, they are worried about being bitten and they should not have the dog AT ALL!", "The fact that they have any fear around this dangerously unstable dog is a very bad thing. Dogs can sense fear 🫣", "Muzzles can actually be a comfort to dogs. I don't know about Lucky though, he sounds scary AF and I am NOT afraid of dogs.", "Fuck that dude!! Fuck that. You made a smart move. Dogs can sense fear especially in their owners, and they will take charge of the situation and protect. If they are too nervous to put a muzzle on, chances are they will be nervous with you two coming over! Dog will sense their and your nervousness and think you two aren’t friendly! \n\nTell them to watch some Ceasar Milan. The best rule to follow for meeting aggressive dogs: No touch, no talk, no eye contact. Literally pretend the dog does not exist and tell yourself they are not a threat so it can’t sense your fear.", "When that dog kills or hurts someone, I hope your sister-in-law and her husband get charged", "Good.\n\n&#x200B;\n\nIf they did, that would be a good time to call CPS. This dog is a killer.", "Hard pass dude. BIL knows it’s a dynamite dog, ready to go off. Your wife needs to get real. If that dog went after her, BIL could not stop it, short of a pistol. NTA. Your wife owes you an apology.", "Mannnn, this dog absolutely needs to be put down. Normal pitbulls can be dangerous enough—Of all humans killed by dogs, 80% are killed by pitbulls—but this dog is too far gone. Normal pitbulls bite more often than other breeds, and they clamp down with *extremely* strong jaw muscles, making it nearly impossible to get away if they attack you. Your fear is a *godsend* and I hope you can convince everyone to stay away from this dog in time—before it does something irreparable", "I've heard of a case where an aggressive dogs bit something off a little girl's face, not sure what, I remember reading it and being horrified so I really really don't want to look it up or remember lol. Point is be careful because Lucky isn't a normal dog, don't risk losing a part of your body.", "Holy shit. N to the Ope. These people are infuckingsane. They were trying to make you a canary in a coal mine.", "Right? \"Good on your BIL and wife for keeping a high-strung, unpredictable, bloodthirsty animal *barely* contained!\"", "The BIL is absolutely deluding himself here", "A metal chain-linked enclosure, at that.", "[removed]", "[removed]", "As others have mentioned, you shouldn't have to do something you aren't comfortable with (and in this case I'd say rightfully so considering the nature of the Pitbull). Your wife shouldn't have volunteered BOTH of you without your permission.", "When Cujo inevitably attacks her, OP may end up with the opportunity to find a new wife.", "The line about replacing a wife, but not an arm, in the story got me rolling. This is just the icing.", "Also you don’t take a stressed out dog (chewing through the fence) and expose them to more stress (strangers) before you have the base level under control. And one should never ever get a dog they can’t control, so I sure hope their new fence is reinforced, taller and that they’re both either extremely strong bodybuilders or very used to working with large breeds. This is just nuts.", "Yes! Not to mention that exposure to a human that does NOT want to be near the dog, is scared of the dog, and is probably acting weird about it would most likely not be a positive experience for the dog! The goal is to set up opportunities for the dog and the people to have positive experiences", "This. This dog probably needs doggy Prozac before you can begin thinking about starting exposure therapy. You need to get the anxiety underlying the aggression treated first. I know this from the struggles my neighbors had with their dog which was highly reactive towards other dogs. The dog is now a lot better, but it took meds + exposure therapy once the correct meds and dose were worked out.", "Wasn't there something in the news a couple of years ago about a pitbull that killed the woman who adopted it. The woman knew the dog was aggressive and believed she had rehabilitated it already. But somehow one day it got triggered and killed her. Dogs with that kind of strength and background are really scary.", ">Yeah, and I'm normally a huge advocate for helping dogs reform after a shelter but this just screams an idiotic idea from them and your wife.\n\n\\#1 rule in trying to rehab a dog.  Don't bring over people that are scared of big dogs.  Neither the dog or person are going to respond appropriately, and things have a VERY good chance of going poorly.", "\" She then framed it as how a real man would come and make sure she felt safe and would protect her if needed.\"\n\nWow..", "Several months ago a woman named kylie waltman had both of her arms torn off by someone's pits that got out of their yard", "It's her brother/ sister and their spouse", "Seriously. Their neighbors didn't sign up to help rehabilitate this dog.", "Oh my god now I want to morbidly follow OP to hear the outcome…", "Very much agree with all of this! Unfortunately this dog needs to be put down before someone is seriously hurt or killed.", "I’m just waiting for the fanatical pit bull lovers to come after you with pitchforks drawn.\n\nEdit: Yep. See below.", "You can call me a fanatical pitbull lover if you want, but as a breed, pitbulls are not more aggressive than other dogs. They are less aggressive as a group than many. For example both poodles and chawawas are more aggressive as a breed than pitbulls are. \n\nCan they be trained to be aggressive?  Yes, they absolutely can, and generally, they are larger dogs with plenty of strength and can do alot of damage if they are aggressive, but so are labs. That is why it is the owners responsibility to ensure proper training and that there dogs regardless of breed (no, it is not cute that your little purse dog likes to bark at people that pass.) are well behaved, but it has nothing to do with the breed of dog and everything to do with the owner.", "**This animal isn't reactive because their scared/ nervous, they're reactive because they've been trained to be aggressive.**\n\nThis, and my heart breaks for them because they did not ask for this. Especially this poor dog injected with steroids.", "OP is terrified of dogs. I'm not sure I believe his narration of  events.", "A neighbor of mine had a yellow lab type dog named cullah that started acting aggressive and came after my sister multiple times, including once when I fended it off. I started calling it cujo, given the names are close, when it would growl at me from across the street.", "I hope your dog was ok", "Show her the TN mom story…", "What is the TN mom story?", "Sometimes euthanasia is a mercy. It would be for this dog's case.", "I think a lot of people have no idea of the STRENGTH animals have vs humans. We had a chow attack one of our cats and I was beating on that dog with everything I had to get it to let go, but it had no impact at all. In retrospect it was a very dumb move on my part and I'm very lucky it didn't turn on me.", "Man, that’s such a good movie.", "Honestly it's really irresponsible of them as pet owners to even ask non-trained people to volunteer themselves for exposure therapy. \n\nLike, op's wife is definitely TA. But the inlaws are also TA for expecting untrained scared people to put themselves in harms way for an incredibly reactive and terrifying dog. Seriously messed up to even ask while that dog is so aggressive.\n\nNTA", "> BIL could not stop it\n\nHe's been working out like mad for the past while now because he thinks he needs to be in good shape to stop Lucky if ever needed", "That's nonsense.", "> you are refusing to see a aggressive and hostile dog. Focus on that aspect\n\n\nNo, honestly the aspect he should be focusing on is she shouldn't make plans for him without checking with him first", "Bad bot u/RollDesperate3457\n\nYou stole [this comment](https://www.reddit.com/r/AmItheAsshole/comments/14axy7u/comment/jocqcod/?utm_source=share&utm_medium=web2x&context=3) from u/cogdat06\n\nDownvote and report>spam>harmful bots", "Bot stole [this comment](https://www.reddit.com/r/AmItheAsshole/comments/14axy7u/aita_for_refusing_to_see_my_wifes_brother/jocq8x7?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=share_button)    \n\nReport - spam - harmful bots", "You are not refusing to see your BIL and his wife; you are refusing to see a aggressive and hostile dog. Focus on that aspect. NTA.", "100% this", "Don’t forget the dog chewed through a METAL fence.  Metal isn’t easy to chew through and probably damaged the dogs mouth teeth and gums and the dog still chewed through it?   No I love dogs and have had them over the years but I would NOT be going anywhere near that dog any time soon. \nWonder if the next post will be “aita my wife ended up in the hospital due to a dog attack and I refused to forgive the dog???", "Exactly!\nRehabilitation means that all the building blocks need to be knocked down and then rebuilt, the poor dog needs to relearn everything it knows.\n\nAnd in the meantime, proper and secure methods of control need to be put in place.\n\nHow these people fostered dogs before is astounding.", "I have a 75lb pit-mix, and he is strong af. I can't fathom the strength a (steroid injected) 150lb pitty would have. It's a shame the dog was mistreated, but this is definitely a situation where professionals need to be involved or someone is going to get seriously fucked up. And the dog will be euthanized in the end anyways.", "Yeah this is a recipe for disaster compounding stressors like that.", " I would recommend your wife doesn’t either.", "I hope these people are far, far from any neighbors.", "My baby would never! /s", "Oh I'm one if those and I agree here. Pitbulls aren't naturally incredibly aggressive, but once trained to be they're incredibly dangerous and should be handled by professionals, or not at all.", "**This animal isn't reactive because their scared/ nervous, they're reactive because they've been trained to be aggressive.**\n\nApparently you (and ignorant others) don't read this part. Pit bulls are wonderful, loving dogs when they are not beaten, neglected, trained to be aggressive, or overbred. But, carry on. My cat has caused more bodily injury than my dogs, but I'm sure you know best because, you know, internet.", "Probably this one, mom was terribly injured and her two babies were killed:\n\nhttps://people.com/crime/2-children-killed-pit-bull-attack-tennessee-mother-hospitalized/", "Right? Just play tug o war with a puppy, fuckers are strong!", "Hope OP's wife has her will updated. Poor dog but it is dangerous AF, 150 lbs is 68kgs which is huge for a dog no?", "That’s the stupidest thing I’ve ever heard.", ">he thinks he needs to be in good shape to stop Lucky if ever needed\n\nI think he's gonna set himself up with a lawsuit if something bad were to happen, kinda reminded me of the case where a family monkey ate a woman's face off or something years ago.", "They need to put that dog down.", "This tells you he has no clue about aggressive dogs or how to handle them if they bite someone.", "Is he the sane size as Andre the Giant because he's not stopping that dog.", "Lmfao, the only thing he'll be doing is ensuring Lucky has a more sizable meal when it inevitably goes wrong.", "Call animal control. Be anonymous.", "The dog needs to be put down.\n\nIt sounds harsh, but it’s true. If he’s violent and aggressive enough that they genuinely believe that he *killed and ate other dogs—* he’s too dangerous. He’s *going* to kill a person.", "Dude is the dog holding them hostage? Ask them to blink twice if they need help!", "\" She then framed it as how a real man would come and make sure she felt safe and would protect her if needed.\"\n\nWow..", "I don’t get how it’s possible but the stress, fear and anxiety that dog must have felt to do that would be insane. And now he’s probably still as anxious but also IN PAIN because his mouth is messed up? The most dangerous dogs are the scared ones. I love working with dogs and I’m sure some people can get that dog better, but I really doubt the current owners are those people.", "I hope these people are far, far from any neighbors.", "We are fostering a Frenchton right now, and the rescue is covering puppy classes from a very good trainer.\n\nI wish for poor Lucky that BIL can get the same support.", ">My baby would never! /s\n\nSincerely, One-Armed Sally....", "Yep. Anyone who has spent any time online has seen videos of ineffectual bozos losing control of their large dogs.", "I think putbulls are not more agressive and do not bite more often than other dogs. But the way they bite is special and makes them quite dangerous once they are trained to bite. They tend to go for the face or the throat, and not to let go once they locked jaws.\n\nAs OPs BIL and SIL have had training how to take care of those dogs I guess they know what they are doing. There are many different ways to expose a dog to new people, like train new experiences under anxiety blocking medication, slowly getting used to kind persons who bring a sausage each time and come a little bit closer each time till the dog learns to see people as friendly, and many more. \n\nBut sometimes it does not work out. In Germany, where no dog is put down in shelters no matter how long it takes to find them new homes, some of those dogs live forever in special shelters in groups of four or five dogs and enough space to run around.\n\nSo who knows how this one will turn out? Still it is up to OP and not to his wife to decide if he wants to help.", "Wait, they were the family dogs?!", "\"...she tried to pull the dogs off her 5-month-old son Hollace Dean and 2-year-old daughter Lilly Jane, who were killed in the attack...\"\n\n\"The Oct. 5 attack lasted 10 minutes.\"\n\nMy God.", "Those poor babies... \n\nI know some owners are fanatical about them but I just could not have a breed with that sort of history of aggression around my kids", "An 90 lb pit bull is a huge dog. 150? Makes me wonder if this is actually real. They're generally 40-75 lbs.\n\nEdit: After a quick Google I found one at 180 lbs. That's a huge dog but he seems friendly. Adding steroids? Not a safe situation.", "https://www.pawlicy.com/blog/pitbull-growth-and-weight-chart/#pit-bull-growth-weight\n\nThis is an average weight. That dog is massive. \n\nhttps://www.pawlicy.com/blog/newfoundland-growth-and-weight-chart/\n\nThat's a newfoundland dog.", "Yep. He either needs intensive training or sending away to the rainbow bridge. \n\nI'm glad there are a few of us here who can genuinely appreciate just how dangerous this Lucky is.", "She is putting herself in danger. You can't protect her from her own stupidity.", "Not if they're answer is exposure or just lock it away.\n\nHopefully they find a well established professional who can help the dog.", "It as how a real man would come and make sure she felt safe and would protect her if needed,NAT", "Seriously. Their neighbors didn't sign up to help rehabilitate this dog.", "I'm only theorizing here since I can't know the dogs' motives, but there are a few possible reasons the dogs turned out that aggressive despite being long-term family dogs (none are an excuse it is so heartbreaking for the family):\n\n-based on the age of the dogs, the dogs could have been sick from old age and possible early dementia that made them lose control and forget who they were attacking (almost happened with out dalmatian who almost bit my mom, the dog was old and sick, but held herself back). \n\n- someone in the family or friends was training the dogs to be fighters (it's shocking how many times stories like this come up, and later you find out they were trying the dogs to be aggressive or abusing them) \n\n- The kids were constantly bugging and hurting the dogs with no supervision because the kids don't know better. I know people who had their dogs bite their kids because of this.", "It had steroid injections, which will only increase its aggression, plus it must be a solid mass of muscle.", "That's not actually a pit bull, it's a mastiff crossed with some kind of bully dog. And bulked up with steroids and treated God knows how. May have been deliberately de-socialized because a lot of fools like a mean dog.\n\nThis isn't the same as fostering a normal dog or even an abused pittie. Danger, danger, danger."]}