{"id": 19824, "submission_id": "14b0j39", "title": "AITA for grounding my daughter after she called me a liar?", "selftext": "My husband (m47) and I (f40) are getting divorced, we have three kids together Amelie (f17), (m15) and (m4). \n\nWhen my husband and I met we both were married to other people, he was my ex's husband coworker, we met in one of their company's parties, we hit it off and we had an affair before we got divorced to start dating. Amelie was born shortly after we got divorced. \n\nWe never felt like we should tell all of this to our kids when they were growing up, mainly because they were too young. Neither him or I had kids with our ex's, so we just throw away our weddings photos and pretended neither of those marriages happened. When/ if the kids asked how we met we told them it was though common friends. \n\nWell now that we're getting divorced, Amelie has picked her dad's side. I can't really stop her from seeing him whenever she wants because our custody agreement is not over yet, so she often goes to his house after school/ spends the weekends with him. He told her the truth, he's trying to get her to believe that I'm wrong in all of this (although all I'm doing is supporting my son), he's trying to get her against me and against her brother.  She told her that he has always wanted to tell them the truth but I didn't \"allow\" it since it would make me look bad. That's obviously a lie, but Amelie believed him. When she came back home she started arguing with me about why I never told her the truth, she called a \"lying bitch\". I tried to explain to her the truth and what her dad is trying to do, she told me she never wants to see me again and such. I got sick of that and grounded her, I took her phone and sent her to her room. \n\nThis morning she wasn't talking to me, all she told me is that she hates me and will try to leave to live with her dad. My coworker thinks I was an asshole for grounding her, she's a confused teenager, I don't know what to believe really, so I'd like to read some outsider perspectives please.\n\nEdit: our oldest son came out as trans, his dad isn't supportive at all, quite the opposite, that's why we're getting divorced. He's trying to get Amelie against her brother.\n\nEdit again: Amelie is not a product of an affair, I got pregnant with her after both our divorces were over", "created_utc": 1686931094, "permalink": "/r/AmItheAsshole/comments/14b0j39/aita_for_grounding_my_daughter_after_she_called/", "score": 6015, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I grounded my daughter after she called me a liar. I might be the asshole because I should've been less harsh on her maybe. She wants to believe her dad, I'm not helping my own cade here\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "ESH. Your soon to be ex husband is a royal asshole for not supporting your son and for using your daughter as a pawn in the divorce. \n\nYou are an asshole for grounding your very emotionally distressed daughter and further alienating her when she needs your support the most. \n\nYou and your soon to be ex husband are both assholes for lying to your children for years about such a critical part of your lives as having previous marriages is. You don't need to tell them the intimate details about your infidelity to your exes, but pretending you were never married and making up a story about you met is equally unnecessary and emotionally unhealthy. \n\nYou are both terrible parents. Those poor children.", "YTA and so is your husband, in so many ways. \n\nShe called you a liar.... for lying to her her whole life. You did lie to her. You are a liar. \n\nNot only that, you frame your divorce as something that your kids have to pick sides in. And you say shit like \"I can't stop her from seeing him\".... wtf would you want to? He's her dad.", "YTA. (As is your ex.) Okay the kid was out of line calling your a b\\*tch. But there is so much more going on here:\n\n1. She has just had her whole world turned upside down and you and your soon to be ex are putting her squarely in the middle of a divorce that is in no way her fault or responsivity. You can let her know that her calling you the b word  was  totally unacceptable.  Mor importantly given the circumstances cutting her a little slack would be the compassionate thing to do. Grounding her and taking her phone were not compassionate. They were angry responses.\n2. You're anger at her is not really about the b word. It's about her being manipulated by her father....and since you can't hit back at him, you're hitting back at her for her perceived disloyalty.\n3. You are angry because calling you a liar was a bit too close to the truth. You did lie about some things. So did her dad. You say that what her dad said about you was \"obviously\" a lie. But from where I sit I see no reason for her to reject what he said out of hand. You have lied on related matters before, why not about this?\n4. You seem to want to have custody of of her. Okay, but why? It sounds more like you're fighting over the marriage \"property\" than a human being. Nowhere in this do you show any loving or even liking for your daughter. You are so focused on your fight with the dad, that everything else has been made subservient to it.\n\nFrankly as your lawyer told you at her age the courts are going to put a heavy weight on what SHE wants in terms of custody--regardless of how thorough your case for parental alienation on her father's part is. If you want to loose your daughter affections, you are doing exactly what you need to to insure that is what happens, regardless of where she lives until she's 18.", "YTA. Your child is being manipulated by her parent and she is learning unflattering facts about you. Instead of supporting her while she’s being manipulated and used as a pawn, you punish her because you dont like being called out as a liar even though you are.", "ESH - except the poor kids, obviously.\n\nYou can't be mad at your kid for calling you a liar after you admit you *lied to your kid*.\n\n>We never felt like we should tell all of this to our kids when they were growing up, mainly because they were too young. Neither him or I had kids with our ex's, so we just throw away our weddings photos and pretended neither of those marriages happened. When/ if the kids asked how we met we told them it was though common friends.\n\nThat is a lie. You lied to your kids, and they called you out on it. You didn't like being exposed, so you punished your kid instead of having a conversation with her.", "Lol. Nothing says \"come live with me\" like grounding a kid for calling you out for being a liar.  Stop trying to get her to recognize her dad is trying to manipulate her. Just accept your part in the affair.", "YTA -  there are three things you cannot hide: the sun, the moon, and the truth.  the fact that you grounded her, especially when YOU are one of the major factors (along with your soon to be ex) causing her to act out, makes you double TA.  apologize, accept the anger from your daughter, or be prepared to lose her.", "ESH except the children. Your marriage was born out of the dishonesty of two bad people, it only appropriated that it ends full of lies and negativity through said bad people. \n\nBut to answer the question YTA for grounding her and have pushed her straight into the bigoted dads hands. Good job", "YTA- and you are a liar. Have been since your kids have been born (well, really before considering you lied to your ex-husband and had an affair. Gross.)", "YTA - Your children were always going to find out the truth one way or another. All you do by not telling them is procrastinate it and turn their ire against you, like it is now.\n\n&nbsp;\n\nAlso, I don't believe you. There's a lot of information missing here and I think you excluded it on purpose because it paints you in a very negative light. Your daughter didn't just choose her father for no reason.", "ESH. This is clearly an ugly divorce that is throwing the kids in the middle. I feel for them in all this. Also she is talking about her feelings and you grounded her for them", "YTA. Divorces suck, and you definitely lied to your daughter. Also your ex is trying to turn her against you. And she’s a 17 year old, not exactly a fully grown adult in master of her emotions. Sure she lashed out, but the solution would have been to let it slide. Talk to her, explain why you didn’t feel like bringing up your previous wedding, talk about your reasons for ending this wedding (which are super valid btw, good on you for looking out for your son). \n\nBut in this difficult time for your daughter, and with your ex trying to turn her against you, it’s very important that you don’t alienate her, and instead be a good parent and help her through it.", "YTA and so is your husband.\n\n> Neither him or I had kids with our ex's, so we just throw away our weddings photos and pretended neither of those marriages happened\n\nThat is such a childish way to go about your lives, it's almost funny.", "ESH\n\nYou and your ex husband both suck for lying to your children and allowing your kids to be put in the middle of what is clearly an ugly divorce", "ESH I feel so sorry for your kids for having such terrible, vindictive, lying parents.", "YTA. Multiple lies occurred and the past was attempted to be erased. Your daughter who is nearly an adult found out the truth and has every right to call everyone out on it.", "I find it difficult to make a judgement here, given that your history of lying suggests you may be an extremely unreliable narrator. But one thing that does comes across clear as day is that you are reacting very immature to what is an understandable emotional reaction from your daughter. Keep going this route and your daughter will go NC as soon as she legally can. \n\nYTA for that alone. Jury is out on the rest.", "Sooo…you lied to your children for their entire lives and now you’re somehow upset at the fact that you’re being called a liar?\n\nMaybe, just maybe, if you didn’t want to be called a liar, *you shouldn’t have lied*! Crazy concept, isn’t it?\n\nYour daughter’s entire life has been turned upside down and you’re punishing her for being upset about it. \n\nDon’t get me wrong, though, your stbex isn’t any better in this scenario. \n\nESH, and by everyone I mean you and your stbex. Your children are innocent in this. Don’t punish them for having emotions", ">although all I'm doing is supporting my son\n\nWell that's the Sarlacc pit of plot holes. What is it you need to support your son over that makes her angry enough to hate you?\n\n\nYta for grounding your daughter the way you did, give her consequences for swearing at you certainly but try not to make a habit of essentially teaching her truth telling is punishable. That's how you get politicians and we have enough of those.", "YTA, you’re supposed to be the adult here, but I don’t see it with your behavior.", "The only one not an AH in this situation is your daughter...she is being manipulated by your soon to be ex and being punished by you for being manipulated.  \n\nYTA, your ex is TA. Get it together people, you're supposed to be the adults here.", "YTA. Your daughters entire life and reality is changing but you ‘don’t like her attitude’? Check your own attitude you are twice divorced cut your child some slack. You did lie to her you’re a cheater (as is your ex husband)", "YTA,  and so is your husband (ex-husband)\n\nIt is wrong to drag kids into a grown up fight.  \nYou could have and still can talk to your daughter and tell her the truth.\n\nShe is still a child but she is old enough to know when someone is being genuine.  Have a grown up conversation with her.  Tell her why you made the decisions that you did and how they affected you. \n\nAsk her a few questions on how she feels.  She is obviously not happy that you and her dad are splitting up.  \n\nYou need to talk to her more and not push her away.  If you do not comfort her, she will find comfort in someone else.  She already told you this because she wants to live with her dad.  (Who is also an AH for talking badly about you) \n\nYou can not control what her dad tells her, but you can control how genuine you are with her.", "YTA You did lie to her. You do know that grounding her over your own mistakes makes the chances she wants to live with you and spend them with you even smaller no?", "YTA. Having fun with grounding an angry girl?", "Shockingly the guy who was willing to cheat on his wife turned out to not be a great guy! Who would have thought! \n\nESH. You clearly see this poor kid getting manipulated and your response is to punish her and push her further away.\n\nDo either of you actually care about her?", "YTA - Y’all brought this mess on all of your kids and you daughter may feel however she wants. Period.", "I think you need to try some radical honesty with your daughter. \n\nTell her the truth about your relationship with her father. Tell her the truth about the divorce and why you don’t agree with how he is treating your son.  Explain why you didn’t tell them about the affair.\n\nOnce you’ve been honest with her, tell her: \n\n-  that you love her\n- that you will never stop loving her \n- will do everything you can to support her \n- don’t want her to choose between you and her father, you both love her equally\n\nYour daughter is hurt, emotional and confused. She needs to know that your love is not conditional. She just learnt that her father’s love comes with strings (he’s turned his back on his son) and that’s likely why she is acting out.\n\nI understand why you didn’t tell her about the affair. I also think it’s ridiculous that people here vilifying you for something that happened 17 years ago. \n\nSadly, YTA. Don’t ground your daughter. I understand why you did it, but it’s not the best way to mend your relationship.", "> she called [me] a \"lying bitch\"\n\nYou did lie. The rest of the statement is evident in the grounding.\n\nGo have a real conversation with your child.. stop trying to talk AT her. YTA.", "YTA - When you grounded her, you essentially punished her for not believing you. That's some 1984 shit, whether you intended it that way or not.", ">That's obviously a lie, but Amelie believed him.\n\nSo, apparently, not so obvious.\n\nBy hiding the past, none of the adults here have any credibility and Amelie is acting like the teenager she is. \n\nESH, except the kids, who are victims.", "ESH, you are T A and a liar and a cheat. What a perfect recipe for a horrible marriage and kids who hate you.\n\n(Edit: changing verdict from Y T A to ESH especially after reading the update.)", "YTA - You can't ground her for an outburst that YOU caused. You can say you lied to protect her but you still lied and that comes with consequences. Now your daughter is confused and hurt and you grounding her just solidified in her mind that you are the bad guy. You soon to be ex is awful for trying to manipulate her but it's up to her who she believes and it's up to you to prove him wrong. Try to calmly talk to your daughter, tell her everything, your perspective, and let her know that you love and respect her choice no matter who she wants to stay with. She is 17. She's able to know the truth, your perspective, and she can make an educated decision.", "YTA your poor daughter is learning some uncomfortable truths and you punish her for having an emotional response to that?? That was a really bad parenting decision. You need to apologise to her and spend time really listening to her if you want any chance at a continuing relationship.\n\nEdit: typo fixed", "Unpopular Opinion: ESH\n\nYou and your husband both suck because you chose not to tell your kids about your past.  Your husband sucks at trying to turn your daughter against you, and you suck at taking your emotions out on your daughter.  Be an adult and talk to your husband instead of throwing your kids in the middle of it.", "YTA - it was a big mistake to keep the truth from her. I cant blame her for her reaction which to her, was likely life changing news. \n\nHer world is getting shattered from your divorce and now she finds out its so much more complex than that.", "ESH You and your husband did lie. You lied to former spouses and your children. You're daughter shouldn't have called you a bitch. And, your soon to be ex-husband shouldn't trauma dump on your daughter. It's all kind of sad and pathetic.", "Info: What does the part about supporting your son mean?\n\nI have no idea if I'm just reading it wrong or much too tired to understand, but I would suspect a teen is more upset about whatever is going on there than what happened before she was born.", "ESH both you and your husband by a) lying to your children and b) letting them get caught by your ugly mess of a divorce.", "Yta", "Yta", "YTA and this is what happens when you lie, especially to your children. Youre supposed to be their rock, when she found out you lied to her she begun questioning everything youve said to her, you lost all legitimacy as a parent in her eyes. \n\nInstead of trying to rebuild that trust you punished her. \n\nIt is fucked that youre husband doesnt support your trans child but that doesnt mean the whole problem with your daughter is about the husband turning her against you and them. That is a different problem all together. You dont seem capable of admitting that you were wrong. Until you do and you try to rebuild that trust with your daughter youre not going to be able to have a stable relationship with her. You dont seem capable of owning your own mistakes, all the actions you said youve taken in your post were all in service to your own self-interest.\n\nYoure capable of doing better.", "You grounded her for reaping what you sowed? \n\nY definitely TA.", "ESH\n\nBoth of you are putting your children in the middle of a nasty divorce, pulling them from one side to another like they are puppets.\n\n\rAlso, remember that in a year or less your daughter will be of age and by then there is nothing you can do to prevent her from leaving home. Direct clash doesn't seem like a good solution to maintain a relationship with her.", "YTA. Try and put yourself in her shoes. How would you have felt? She is obviously going through it. Be kind.", "ESH\n\nI don't understand how your partner telling the truth got her on his side in this argument. If its just because he said you didnt want them to know then I guess I understand but its fickle. Just tell your daughter your truth and let her decide. If she wants to believe her dad you need to accept that.\n\n>(although all I'm doing is supporting my son),\n\nI don't understand this either.\n\nLook ultimately you probably should have just told them in the first place. Kids deserve to know their parents properly.\n\nGrounding her for this is just not accomplishing anything. Basically just telling her she can't go and leave.... Like come on you must understand you have no reason to ground them. (except maybe for the swearing). They are 17 years old they aren't a 10 year old, they are almost an adult.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy husband (m47) and I (f40) are getting divorced, we have three kids together Amelie (f17), (m15) and (m4). \n\nWhen my husband and I met we both were married to other people, he was my ex's husband coworker, we met in one of their company's parties, we hit it off and we had an affair before we got divorced to start dating. Amelie was born shortly after we got divorced. \n\nWe never felt like we should tell all of this to our kids when they were growing up, mainly because they were too young. Neither him or I had kids with our ex's, so we just throw away our weddings photos and pretended neither of those marriages happened. When/ if the kids asked how we met we told them it was though common friends. \n\nWell now that we're getting divorced, Amelie has picked her dad's side. I can't really stop her from seeing him whenever she wants because our custody agreement is not over yet, so she often goes to his house after school/ spends the weekends with him. He told her the truth, he's trying to get her to believe that I'm wrong in all of this (although all I'm doing is supporting my son), he's trying to get her against me and against her brother.  She told her that he has always wanted to tell them the truth but I didn't \"allow\" it since it would make me look bad. That's obviously a lie, but Amelie believed him. When she came back home she started arguing with me about why I never told her the truth, she called a \"lying bitch\". I tried to explain to her the truth and what her dad is trying to do, she told me she never wants to see me again and such. I got sick of that and grounded her, I took her phone and sent her to her room. \n\nThis morning she wasn't talking to me, all she told me is that she hates me and will try to leave to live with her dad. My coworker thinks I was an asshole for grounding her, she's a confused teenager, I don't know what to believe really, so I'd like to read some outsider perspectives please.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "This post is totally confusing.  Are you getting divorced because you cheated in your first marriage or because your child is trans?", "YTA x1,000,000\nThe next post will be.. My daughter disowned me and I don't know why!", "YTA \n\nAnd this is only one of many reasons.", "YTA  at the moment\n\nI'd love to hear the ex's side of the story.\n\nI have a feeling we're not quite getting the truth here on what the divorce is about. From the tone of the post,  I bet there is some important information being left out.\n\nI don't trust what you're saying about the situation or your husband.", "Did he leave out the part where he was married too?", "ESH\n\nThe problem is, if you do something untrustworthy and get found out, people will stop trusting you.\n\nYou are basically saying \"yes I hid the truth before, but *now* I am being honest\".\n\nIt doesn't work like that. You lost the trust that would give \"but *now* I am being honest\" any weight.\n\nIt's a huge shame your husband got to your daughter first and so came out of this looking like he has more integrity, but you can't expect your daughter to take you at your word any more. You will need to back yourself up with proof whenever you can.", "ESH except the kids.\n\nYou did lie. And you grounded her because you got caught. Sure, she should have not called you a bitch, but I can't honestly say it was unwarranted, or untrue.\n\nAnd your ex sucks because parents should love, and accept their children.", "NTA for not telling the whole story, that part is fine.\n\nYTA for grounding her, she's 17, you are just adding oil to a raging fire. I'm kinda impress you managed that honestly. Also she's old enough to pick her side, fighting if her health isn't in danger will just make your relationship worst. \n\nNTA for establishing boundaries though, it's your house, you shouldn't accept being called a lying bitch.\n\nSo to summarize, your are two part NTA and one part YTA. \n\nLike a third of an asshole if you will.", "ESH:\n\n* Your husband is an AH for putting her in the middle.\n\n* You and your husband are both AHs for not giving her a clear but age-appropriate version of how the family was created. Now, she's learning how easily the two of you can excise loved ones from their lives, and to do that to a young person during a divorce is \n\n* You are the AH for trying to limit her access to her father. She's 17.\n\n* She is the AH for calling you a bitch. She's not the AH for calling you a liar. A lie by omission is still a lie. And I think we can all understand the outburst -- but she should not be using gendered language as an attack.\n\n* And you are the AH for grounding her and cutting her off from her support system when she's reeling, because she hurt your feelings.\n\nEither way, what kind of relationship do you hope for once she's an adult? Do you want the sort of relationship where you can both tell each other what's happening in your lives, or do you want her to conclude that you are incapable of responding appropriately to her distress? Be the kind of person who you want her to believe you are. \n\nGetting your trans son out is a good thing. But divorce is still hard on kids of any age -- and you also need to still consider Amelie's needs.", "ESH-the origin of your relationship is a clear indication of your respective levels of shit as a people but it’s too easy for your daughter to have you vilified when your ex was the other half in the affair, and also married. Ex sounds especially awful for the treatment of your trans middle child. What a mess. I hope the baby’s okay", "Nta.... But unity because she called you a bitch.  You were a liar.  What you're husband is doing is parental alienation.  Make sure your lawyer knows about it and bring it up to the court.  Document document document", "NTA - your prior marriages and how you got together are really none of your kids’ business. I do think it was dumb not to have some conversations about it through the years and to try to completely erase it like that. Realizing that parents are fully formed people with their own lives and pasts and mistakes is part of growing up, and a better way to handle it would have been to choose age appropriate honesty through the years. \n\nYour daughter can have all the feelings she wants about it, but she still needs to speak respectfully to you as her parent. Grounding her is not necessarily the most productive parenting intervention, but it doesn’t make you an asshole either. Your soon to be ex sounds like a real piece of work.", "This post is birth control in every way", "Aww man cheating and having a fight with your teenager? Your gonna get *destroyed* here.\n\n\nI’ll take the downvotes. NAH except maybe your ex. I know Reddit hates cheaters like they are bringers of the plague, but I don’t think a mistake almost 20 years ago means you are a shitty person now. And I don’t really think kids are entitled to know how their parents met, it’s not really their business. My mom told me growing up that they met in highschool, but learned as an adult they hooked up the first time they met at a party. It doesn’t matter.\n\n\n\nThe young people on here are going to tell you that you should have taken your child calling you a bitch with grace and humility, explaining to her gently why that’s wrong. And fuck that. You grounded her and took her phone, you didn’t do anything drastic.\n\nI hope your able to talk things out with her.", "ESH. Except for the children, obviously. You’re the one who wrote in, so, I’m not going to comment on your soon to be ex-husband’s transphobia, and the amount of damage it WILL do, to both your son and daughter. You lied to your child. Regardless of your intentions, when confronted by your daughter, you doubled down on the lie, and chose scorched earth. I don’t doubt that your intentions, initially, were well meaning. Yet here we are.  The truth is out. You need to sit down with your daughter, and be honest. She doesn’t need to hear every salacious detail. But she does need to hear you tell her that you fucked up. That adults are just as messy as teenagers. That adults don’t always make the right choices. That love doesn’t always last, that life gets in the way, that sometimes innocent parties get hurt by acts of selfishness. She needs to hear that very few things in life are simple black and white, that life is full of nuance. That parents make mistakes, and sometimes, in trying to protect our children, we end up doing unintended damage. Own your mistakes. You can’t move forward, hoping to have a fulfilling relationship with your daughter, if you aren’t willing to own your part. Honesty with your daughter and support of your son are mutually exclusive things, and you’re capable of doing both. I strongly suggest that you seek therapy for you and your children, both individually and as a family.", "ESH, apart from your daughter as she's just reacting to the chaos both you and your ex are throwing at her. Don't bother trying to 'correct the record', if she doesn't believe you when you tell her the truth you can't punish her into submission, it'll just push her away. Also you have to realise divorce is a lot to wrap your head around even at 17, her reactions aren't going to be perfect, they're gonna be messy - you're the parent so you gotta keep it together even when she's angry at you and calling you names. Don't play your ex's games either, take the high road and look after yourself and your family.", "yes, you are for the grounding part and being dishonest with the two oldest in lying on how the two of you met.\n\nbut, good job on having your son's back!\n\nhave a great day!", "ESH, except the teenager, you really need to get into family therapy with your daughter and stop talking about her father with her.", "All you do by not telling them is procrastinate it and turn their ire against you, like it is now.", "YTA. This is the other shoe dropping on the consequences of your infidelity. She's 17,you've had ample time to tell her the truth and you didn't.", "YTA for lying to your children. \"It doesn't come up that often\" is a poor excuse. You should have found ways to put bite-sized, age-appropriate pieces into conversations so she's not just absolutely blindsided by the reality of her life.", "Yup, YTA. You did in fact lie, and she did in fact catch you. The correct response would've been to apologize and explain why you lied. All you're doing with this behavior is driving her away. If your ex is in fact trying to drive a wedge between you and your daughter, you just played right into his hands. Stop treating her like a child.", "YTA - you lied for their entire life and are upset you got called out? Bet she goes no contact now", "ESH, but honestly you are probably going to be better off letting your oldest stay with your ex. Write out the whole truth in a letter, give it to her and keep a copy for the future, and let her go. You have two younger kids you should focus on and if you ex is just working on twisting her opinion, she's old enough that you aren't going to be able to fight for custody long anyway.", "This might be the most ESH post I’ve ever read", "ESH. I’m putting as that because I think it’s ridiculous of your daughter to only blame you for cheating on your spouse. You both cheated, so I do think her anger only being directed at you is unfair.", "YTA\n\nRegardless of why, you both lied to your kids. So her calling you a liar is valid. That bit aside, I would talk to her about being careful regarding bigoted thoughts/actions.", "YTA. If you don't want to be called a liar, don't lie.", "Ynta BUT your daughter is old enuff to hear the truth. You and your husband should have told her together. OR NOT. Your relationship is none of her business. Grounding her is correct she needs to learn boundaries. You did not lie to her you just didn’t tell her about something that’s none of her business", "YTA losing your temper isn’t as excuse and you probably don’t remember all the times you have but your kids sure will. your child is being used as a pawn and your instinct is to punish her for it. I understand protecting your son but your not in a triage situation and all of your kids could use some clarification and understanding. \nDo you think just maybe she may question her paternity and that’s why she’s so angry at you? You had an affair and got pregnant before you were divorced, that timeline may cause her to ask some, very valid, questions and it may be coming from your ex but your best bet is to tell the whole story. not your side or what makes you look good but the whole truth no matter how shitty you both may seem in it.", "ESH my aunt and uncle did this to their children and it was so cringe when *everyone* but their kids knew. It was going to come out eventually. That being said it’s the right move to support your son and divorce this guy. It’s wrong of him to manipulate your daughter, but you shouldn’t be grounding her for struggling through a hard situation and not knowing if she can trust either of her parents.", "So just to get this straight, you and your (ex)husband lied to your children their entire lives. And your daughter is trying to process the divorce, and she would like to know the truth about your history. She called you out on *your* lies, and you retaliated by taking her phone and grounding her? And you still aren't quite sure if YTA or not?\n\n\nYTA and so is your ex. You both need to do better for your children. Also, don't act surprised when your daughter chooses to live with her father instead of you.", "ESH", "I'm going with ESH.\n\nTaking this at face value, instead of trying to infer from missing info, I see the following:\n\nYou suck for not being open with your kids over how you two got together. And for punishing your daughter for her emotions. They were over the top, but still. Not a good look.\n\nYour STBEx sucks for also not telling the truth to your kids, and potentially compounding this by adding onto the lie. He also sucks for being a potential transphobe. Bigotry is not a good look.\n\nYour daughter sucks(the least) for not listening, and for her over the top outburst. If she starts acting like daddy towards her sibling, then she starts to suck even more.\n\nThe one coming out trans and the littlest are the only ones who don't suck in this stinking and steaming pile.", "YTA, you lied to your daughter then grounded her when she found out the truth?", "\n\n>she told me she never wants to see me again and such. I got sick of that and grounded her, I took her phone and sent her to her room.\n\nop, what, exactly, do you imagine grounding her in this situation is going to accomplish? if you're goal is to push her farther into camp dad, you're certainly doing a good job of it. the situation is a cluster fuck, there's no way around it, but reacting with aggression right now is not going to help you. you either need to be understanding of your daughter right now, or accept what her choice is going to be. those are really your only two options in this shit show.", "To me this makes 0 sense.\nYou both cheated didn't you? Then you got together, got married, had children and lived your lives?\n I had ex's before my children's father and I don't need to speak of them to my children...obviously.\nWhat's the difference with a marriage?\nWhy would the children hate you??\nAm I reading this wrong??", "YTA\n\nYou grounded her for having very legitimate feelings about learning the truth you've kept hidden from her. You could have sat her down and listened to her and supported her but you went to punishment.\n\nYou are doing the alienating here that you were trying to avoid.", "YTA. I really don't think this is simply about your son. What did you do?", "NTA- i can barely imagine going through a divorce for trying to protect my child from their father, then having a different child attack me because of manipulations from...their father. Absolutely devastating, so I understand why you snapped and went to grounding. As you have already discovered, though, your response was not helpful in trying to calm the situation. I hope you can figure out a way to talk to your daughter WITHOUT blaming your soon to be ex(as much as he deserves it). She'll find out the truth eventually, kids always do, and you need to stay as truthful and neutral as possible. Good luck...", "ESH\n\nTherapy seems like it'll be much more helpful to your daughter than grounding her for being upset at new facts. I'd get on that before you lose her.\n\nYour soon to be ex sucks for playing games with the daughter to hurt you", "They’re divorcing because the son is trans and the dad is a bigot. Wanting to keep your kid away from a transphobe is understandable. \n\nAnd this is very much a pick sides divorce. It has to be, because their splitting up over dad’s bigotry toward his kid. Daughter is a bigot for choosing her father in this situation.", "Seriously, she's not mad at being called a bitch but a liar, which she IS. You can't ground your kid for being honest.", "Right it's crazy to me that when something like this happens the parents first response is to take away electronics and send them to their room. Yes, that response is totally going to get them to understand, come around, and want them to be around you. HAHA NO, it's going to produce the complete opposite.", "The ex is a transphobic asshole trying to pit his kids against each other, I'd at the very *least* vote this one an ESH", "[removed]", "It just doesn't come out in conversations that often, they asked a couple times when they were younger, that's it. I told Amelie this, I told her that it's a lie that he wanted to tell them and I didn't, he wanted to \"hide\" it as much as I did.", "For real.  It messed up both sides are getting the kids involved and trying to weaponize them against each other.  Both parents are AH.", "I told her all of that, she was still calling me names, so I lost my temper", "If both she and her husband are AHs then the appropriate judgement is ESH (Everyone Sucks Here), not Y-T-A.", "Kind of hard to avoid that though, given that they’re divorcing BECAUSE of the kids. Son is trans, dad refuses to accept him, mom does. No real way to not have the kids - or, at least, the kid - in the middle in that situation.", "Sorry, I tried to make the post short. \n\nThe reason we're getting divorced is because our son came out as trans (he was born as a girl, he very recently came out as a guy. Please excuse me if I make any mistakes, he's helping me but sometimes I do get confused). My husband got very angry, he said he won't accept it, while I'm supporting my son, now he's trying to get Amelie against her brother and me", "How is her husband not just as much of a liar and a cheat as she is, though? This is as clear a case of ESH as there's ever been on this sub.", "Our son came out as trans, my ex isn't supporting him, he called our son a lot of names so I obviously got very angry and that's why I'm supporting my son and why we're getting divorced. He's trying to get Amelie against her brother.", "The divorce is about the eldest son being trans, Dad is a bigot and OP is supportive. But it's not exactly relevant to being called a liar by the daughter.", "His side of the story is that his daughter is \"sick\", she has a mental illness because trans people are just people with mental health issues, that's all he said to my son", "He told her I didn't allow him to tell the truth because I'm controlling, he's trying to pain himself as such a victim", "wouldn't be surprised if he left that out or twist it saying I was happily married but your mother seduced me, baby-trapped me and blackmailed me into being with her.", "Yeah, I'm trying to figure it out with my lawyer, he knows he won't get custody over our youngest, he doesn't want to fight for custody over our middle son, so the only one he has left is Amelie, he's playing with her", "It is not reasonable to expect someone who was raised by a bigot (dad didn't just magically turn transphobe overnight) to cut all ties with their own parent instead of taking the time to process everything on their own time, on their own terms. It wouldn't even be reasonable for the trans son. They'll go through that process on their own, it's your job as a parent to support them through it, not force them. \n\nThe sides are the son, and the dad. As far as we know, neither of them are demanding to pick sides. The couple splitting up doesn't constitute the sides.\n\nMom is making it about her. If daughter is mad at mom for lying to her her whole life, how is that going against her brother? That has nothing to do with the son being trans. That's \"Moms side vs dad's side\", which is completely unhealthy thing to push onto kids in a divorce.", "Youre their parent - “it doesnt come up in conversation that often” doesnt fly. \n\nYou should be initiating conversations about important topics.", "The better option instead of deny, deny, deny or push blame onto your husband was to apologize and explain the truth. It sounds like you went straight to your father is lying we both wanted to sweep this under the rug. Instead be a grown up and apologize for lying like you would have expected your daughter to do to you if she was lying about something. \"Look I'm sorry for lying to you about how we became a family, but at the time your father and I thought it best. X,Y,Z happened and yeah it probably didn't paint us in the best light and that did factor into our decision. I'm sorry we kept that from you.\"  \n\nHow exactly is grounding her for callling you out helping the situation? I mean you basically helped villianized yourself at that point.", "It doesn't matter. You lost the game. He got to her and told her the truth before you did. That's what happens when you lie. This is why you should've told her a long time ago. Preferably together.", "You're the parent. You can't use the \"I lost my temper\" excuse when your child calls you names BECAUSE SHE'S EXTREMELY DISTRESSED AFTER LEARNING HOW YOU LIED TO HER HER ENTIRE LIFE ABOUT WHO YOU ARE AND YOUR CHARACTER, AND LEARNING IT THROUGH THE WORDS OF SOMEONE WHO PURPOSELY MANIPULATED HER EMOTIONS AGAINST YOU. \n\nHonestly. You as horrible a parent as your ex. None of you gives a fig about Amelie. He only cares to make her hate you. You only care for her not to think you're a bad person and to punish her for calling you names.", "The conflict resolves around grounding the daughter. daughter is in no way an AH", "So what exactly has Amelie done to your son? Cause your post implies that her issue with you is that you lied about your previous marriage.", "Farmers must have moved some bulls into a field near me. Odd.", "I did not see the edit when I had commented as that hadn’t been added yet. I answered forgetting ESH was an option, but at the same time OP is acting like they’re some sort of victim in all of this so I wanted to make it clear they are TA but obviously husband is too esp after reading that update. Changing verdict now.", "That's got to be very hard. I hope the kids can all end up happier. I've got no vote, this is above my pay grade with the added information, just best wishes to all for things to be better.", "And what your daughter thinks about her brother? She seems fine with her father telling those things?", "Ummm....you are a liar. \n\n\nYou are both liars, of course. And cheaters. And he was 30 and you were 23 when you had a kid. \n\n\nWhy won't he get custody of your youngest? \n\n\nAnd it seems like Amelie wants to go with him, but you are treating kids like prizes to be won.", "Here, we are adults at 18 and at 16 you can already decide if you want to live with a parent or another.\n\nIf you managed to have any kind of bond with your daughter, you guys will come around. Don't put oil on that fire by forcing her to stay with you.", "Plus OP's edit just... convenient oh what a hero OP is for protecting her trans child. 👏 \n\nSomething is missing in this story.\n\nYTA for being a liar and then grounding ur kid for saying the truth. Way to confuse her.", "The truth that...he also cheated on his wife? Idk. Im not convinced he actually told the 'truth' when both parents cheated on their spouses, it is deranged to only blame one.", "Daughter is siding with her transphobic dad, so… ESH.", "Yep, sounds like the suddenly appearing son in this story is nothing but a smokescreen to hide the fact that OP is an asshole", "Yes, we're both liars and cheaters, but he's trying to get Amelie to think that I am the bad guy somehow? When he did exactly the same? \n\nHe's young, my lawyer told me that most likely I will get custody over him, I also have proof that he's not a good father.. however Amelie is old enough to ask to live with her dad, that's what my lawyer explained. He's manipulating her, I just don't want her to take as much time as I did to find out he's an ass.", "Not disagreeing, however let’s also keep in mind that transphobic dad is clearly manipulative. \n\nRegardless, this is why family secrets don’t stay hidden for long and usually blow up in people’s faces. I feel for all the kids, but especially the youngest and the one transitioning.", "Well if you keep losing your temper and grounding her for being rightfully upset after a very long time of lies, you can guarantee she'll cut you out of her life.", "He doesn’t have to alienate her. By loosing your temper over being confronted with the truth, grounding her and taking her phone away; yea, that will help her make a decision. \n\nYou know you have a choice. To be the good parent to all your kids. To commit you did lie. Tell her why you did it, without it being blamed on someone else. Just admit the mistake. \n\nTill then ESH. Yes, teenagers can use their mouth in a way you don’t like. But someone that just found out she has been lied to, knows her parents are divorcing and had a brother in trans; that’s a whole lot of stuff on her plate.", "Seem like most of reddit wants to call you the ass for your past actions instead of the current one you were asking about. Sorry for the mob/pitchfork mentality you are getting.", "ESH. \n\nBoth you and your now ex-husband committed affairs, and you both tried to sweep that under the rug so you wouldn't have to deal with the shame. Now that your ex has doubled down on being a shitty person (by not accepting your son's transition), that choice is coming to bite you in the ass. You can't hide or ignore that, and you can't resolve this conflict with your daughter by trying to force her to ignore it either. \n\nYour daughter is a teenager, whose whole world is being turned upside down. Her idea of her parents - as good people who love each other, who love their children, who make good choices, who know better than her what to do - has been irrevocably shaken. She's watching her father reject her sibling for being trans, she's discovered an enormous moral failing at the heart of her family exactly as that family is falling apart - she's going through probably the most traumatic things to have ever happened to her. \n\nAnd rather than support her, you're punishing her to protect your own ego. \n\nYou don't have the power to force your daughter to like what's happening or react how you want. You can't punish her into complying with your self-image,  supporting her brother, or taking your side in the divorce. You NEED to grow up and take care of HER right now. \n\nApologize to your daughter for punishing her unfairly AND for lying to her all these years. Offer her an honest conversation, where you'll answer her questions without retaliating when she's angry or confused. Offer her additional support structures, including potentially therapy, and BE  a safe space for her as she processes her grief and rage. \n\n(Your ex-husband is OBVIOUSLY an asshole, bc all transphobes are assholes. I'm sorry he doesn't support your eldest son and I hope that you're providing your son with support and therapy as well.)", "YTA\n\nparenting is hard and your daughter went overboard calling you a \"bitch\". But you ARE a liar. And if there is one thing children absolutely hate, it's being made a fool of.\n\nI am sympathetic about your plight because your husband seems to really work on your daughter to mistrust you. But taking her phone and grounding her is the complete opposite of actually working out those issues. You really need to work on building bridges, not tearing them down.\n\nDeep down, it doesn't matter to a child who is RIGHT and who is WRONG; all that matters is who, to them, is the better parent. Most children notice gaslighting only after they've grown up and no sooner.\n\nBy grounding her you worked for your husband's team. That's free real estate for him. Try the high road.", "YTA. You probably raised your kids telling them to be a good person, to do the right thing, while always hiding the horrible shit you've done because you never tried to make amends or fix the problem of why you did those things. \n\nNow, your kid has learned about something you did from someone else, instead of you being honest from the start and owning up to your mistakes to teach her how not to be. You have failed and caused permanent damage to your kid and the relationship with her. There's a chance you might be able to fix it, but few people are willing to put in the kind of work required for it, and I sincerely doubt you are one of them.\n\nBut I'm sure you'll be happy to know that your soul mate ex will likely follow you shortly as he's the same kind of person and sadly your kid will learn that over the years through more disappointment through the actions of her parents.", "Way to guarantee that your daughter is never going to be honest with you about her feelings ever again.", "ESH I think the fact that y’all are divorcing over the fact that you are accepting your son and your ex isn’t means that you are the one who was the “right” side in this divorce and it’s sad your daughter can’t see that. HOWEVER grounding your daughter over this is only going to push her away and I find it hard to believe that there isn’t at least some part of you that didn’t want them knowing because you would look bad. I think it’s weird that she doesn’t understand that her dad was also a married man who did the same thing as you so it’s hypocritical for him to say you were in the wrong when he was as well…idk the whole situation just kind of sucks for those kids imo", "A relationship that started out as mutual marital infidelity didnt work out, what a shocker. You and your husband are both AH.", "Oh my. The most major part of the story you left out is the reason you and your husband is divorcing until you add it as an edit.   \n\nI think there is a lot more to the story", "YTA for grounding her and your response.   ESH (except the kids, they're victims,) for lying cheating and being shitty in the divorce.  You have kids be better for them.       \nApologize and try to own your screw ups and be a frigging adult.  Let her know that being angry is not wrong.", "YTA\n\nYou did lie to your daughter. You lied to her her entire life.\n\nYou punished her for not taking your side. It's sad that you think there have to be sides here.\n\nThe fact is, her father is the one that told her the truth, in addition to telling her that you were the one that stopped him from telling her sooner. I don't know if that's true or not, but it is plausible.\n\nYou took out your frustrations on your daughter and pushed her away during a traumatic time.\n\nIf what you say regarding your son is true, then his father has a lot to answer for. But that's not your daughters fault.", "ESH.\n\nYour coworker is right. She's a confused teenager who's being emotionally manipulated. She has a right to be upset about being lied to growing up, even though I personally don't think you or your husband owed your kids that story. But you punished her for having emotions she doesn't have the capacity to process well during a really difficult time for her and that's not great parenting. What's worse is you acting like this only further proves to her that her dad is right, you're the bad guy. That's going to make it easier for him to get her on his side about the way he incorrectly perceives he's eldest son's situation.\n\nShe already trusts him more than you even though he refuses to accept his son's identity. If I were your son I'd be devastated by that and he really needs all the support he can get. If your ex turns you into this terrible liar in her mind, then she'll also be more likely to believe the rhetoric about supportive parents being abusive groomers. This is a terrible path for her to go down regardless of her relationship with you or her brother. I strongly suggest counseling for your family if that's possible because this stuff can be really difficult to navigate.\n\nEdited for formatting.", "ESH. Your ex using your daughter like this is absolute ahole behavior. How her parents met is not remotely any of her damn business. But you are an ahole for grounding your daughter when she is clearly being manipulated by her dad. Go get some counseling for all of you, because this is going to be messy. And above all, tell her and show her that you love her no matter what. You need to keep her out of the warzone, and the only way to do that is to not LET her or her dad engage you.", "After edit, a very tentative NTA. You and your ex-husband both cheated/ had an affair and later married, agreeing not to tell your future kids. Now you're getting divorced because he's a transphobic AH and has clearly tried to manipulate your daughter. It's worked because he hasn't admitted his own faults. \n\nFor everyone saying it's because OP lied, so did ex husband. He didn't come clean from guilt, he's done it because clearly the eldest son doesn't want anything to do with him, so he's trying to \"win\" the daughter. Petty, ridiculous, and OP you need to rise above. Sending Amelie to her room and confiscating her phone will only push her away. Explain if she wants to be treated like an adult she needs to act like one and hear both sides. Produce whatever receipts you can. And show you being supportive of all your kids. If she wants to choose dad after that, let her. She'll know you'll support her if she changes her mind after.", "ESH - leave your kids out of the divorce proceedings.", "YTA, Her reaction is harsh, but grounding her is the best thing you can do to destroy our relationship. she wants to go to her father and can NC with you", "You could ask her to sit and listen to what you have to say. Say to her she doesn't have to talk to you.. but listen and think about what you say then tell her after you told her everything you will give her time and space to think about it all. But make it clear the only reason you have not told her before was because you and her dad agreed they was to young to understand and that you both had planned to tell them everything once they was old enough to understand and be able to ask the questions they wanted to ask. Tell her you was not lying to her. Tell her your getting divorce because of her dad not liking her brother coming out and her dad refusing to support her brother. Make it clear her brother is still the same person that she grew up with he still loves his sister", "ESH and to be clear I mean you and your soon to be ex husband both suck. It’s important that you speak plainly and carefully with your daughter about what’s going on with your son, that you give her the resources to understand and to become supportive. But you can’t punish her for finding out and speaking about the truth. Please get family counseling.", ">She told her that he has always wanted to tell them the truth but I didn't \"allow\" it since it would make me look bad. That's obviously a lie, but Amelie believed him\n\nFirst, I assume that first \"she\" should be \"he\" from the \"him\" in the next sentence.\n\nSecond, it's not clear to me that it's obviously a lie. It DOES make you look bad.\n\nYou might both be AH, but there is no question that your daughter is right here, you did lie to her. It sounds like your ex-husband is also an AH regarding your trans child.", "YTA as is your husband for hiding the truth. \n\nIt’s ok to discipline your daughter for her language. She’s still a minor and your daughter. She should watch how she speaks. Learn it now before she mouths off to everyone.\n\nBUT she is allowed to tell you how she feels. if she thinks you’re a liar and she tells you so, you don’t get to ground her for that. Especially bc in THIS case, she is correct. It’s inappropriate for you to deny allowing your daughter to not only speak her mind, but feel how she feels. \n\nYou and your husband need to grow up. Idc who said what, who started what, SOMEBODY has to be the bigger person before BOTH of you end up no contact with your kids, all bc everybody was too stubborn and too assholey to be adults.", "Thank you for taking care of your son.  NTA at all.  Yes, you're going to have to sit down and talk more to your daughter about all of this, but give her some time for the rage to cool.", "INFO:  Why haven't you explained to her that you were both married and began seeing other people?  It honestly makes you both look bad, not just you.", "ESH. You could have smoothed this over by telling your daughter you weren't sure when it was age appropriate to talk about how you and your soon-to-be-ex met. Grounding her when she's angry about catching you in a big lie was not the right reaction, though.  This would have been a good time to suggest family counseling. \n\nObviously your ex is an AH because he's starting drama and is hateful. \n\nYour 17 year old is in a shitty situation and is lashing out, so I don't necessarily want to call her an AH. You as a parent need to find a better way to deal with this situation.", "NTA. Your ex is transphobic. Your daughter did not have to call you a “lying bitch.” I get that it is a confusing time, but you tried to talk to her about it. Your reasons for not telling then were to protect them. \n\nThank you for riding hard for your son. 🫶♥️", "ESH, specifically you and your soon-to-be ex husband. You cheated on your previous spouses, hid your previous lives from your kids, and now that it’s all unraveling you’re taking it out on them. Get family therapy. Not to save your marriage, but to save your kids’ wellbeing.", "NTA\nI feel like there’s context missing, but your ex is still TA for turning your kid against you because you stood by your trans kid.", "You have lived a messy, untruthful life and clearly surrounded yourself with messy, untruthful people and these are the dividends. The only people with innocence still are your poor children who are for sure gonna be messed up forever now. YTA", "All of you suck lol.", "NTA. I'm only going on the question of her calling you names. Get the child in counseling for you, her and the other kids quickly. This has been blown up by a very vindictive ex. That still means no child should think it's ok to call their mom a lying bitch. You are the parent, so take control and get the help everyone desperately needs. Good luck.", "NTA woof, ok let her go. Don’t take out your frustration on your child. tell her you will always love her and she is always welcome. here is the thing your ex will re marry they always do. She will probably be a bigoted tart that your daughter will not get a long with. She will come back after the tart give ex an ultimatum. At least that seems to be to be the play book for men on here.", "Yta you *are* a liar.  If you hadn't lied to her, literally her entire life, you'd have some ground to stand on.", "YTA. How is punishing her when she's going through not only the divorce of her parents but also finding out she was lied to her entire life going to stop her from turning against you? \n\nOwn up to your bullshit. You BOTH hid the truth because you knew you were assholes and that any reasonable person would be disgusted. Instead of dealing with the repercussions, you threw out the records of your previous lives and acted like it never happened. That's childish and pathetic. \n\nStop making excuses for yourself and for what you did - both the cheating and the lying. You didn't want to be known as the affair couple, and it's not like you were waiting to tell the kids when they were older. \n\nIf you're not willing to be honest with your daughter, let alone yourself, you'll get nowhere. Reverse the punishment, tell her you're sorry for lashing out and that you and your ex did a horrible thing to your previous partners and that you both should've taken accountability for it, but mutually agreed to destroy the evidence of your past lives and pretend nothing happened. Your husband agreed to it, and you're both culpable for the lying. \n\nTell her she can pick sides or feel what she feels, but that you both fucked this up from the moment you met and you're willing to accept the consequences for it now - and that her brother (and all the kids in general) hold no blame for the divorce or the lies or any of it. That you as the adults chose to let them be caught up in your bullshit when they didn't deserve that. \n\nThat's all you can do. None of these kids should be punished for anything. Be an adult. Don't play into your husband's bullshit and step tf up for once.", "YTA and that is obvious as soon as you mention where you met your current husband at.  \n\nShe called you what you are and you punished her for it.  If you didn’t lie to make yourself look good, then why did you lie?  I think YOU are the confused one.  \n\nAs horrible as your husband is for denying his so (if this was about you two I’d say E S H, but it’s about you and your daughter), you are also failing your daughter massively.  This post screams narcissistic mother gaslighting her daughter.", "INFO: Why did you say in the title that you grounded her because she “called you a liar” instead of because she called you a bitch?\n\nThe lying part is true; YTA / ESH if you grounded her because she called you a liar. But you would be less TA if you grounded her because she called you a bitch— it would be good parenting if you raise your daughter not to call ANYONE a bitch.", "YTA. \n\nFast forward several years. “I don’t know why my daughter went co contact with me…she won’t call or respond to emails”", "YTA. And you are continuing to enforce a climate in which reasoned, open discussion is forbidden.... \"because it would make you look bad\". She has every right to express her shock and possibly disillusionment, because you've been playing a role. And if she questions you about this role, you ground her. Start being honest. This is about you coming clean, not about whose \"side\" someone is on, or who is \"against\" who. What primitive thinking. And you punish your daughter. Wow. Apologize. Grow up.", "YTA. Your daughter is being manipulated and you played right into it. Apologize for over-reacting and discuss an appropriate consequence for calling you a “bitch,” after explaining how name-calling is a bad way to argue. Then move on. \n\nBe sure not to get drawn into trying to defend yourself to your daughter when she is pushing her father’s agenda. Make sure she knows you love her and will not participate in putting her in the middle of the parental conflict. What he has done is so wrong, but that’s not something she needs to hear (it will seem like bashing him).  Just something once or twice that it is not her job to fight her dad’s battles for him. Stick to saying what you need to say about  keeping all your children safe. Even if she sides with him for a while, she will note if you are calm and rational and keep your word to her and others. Be the grown up and she will come around in time. And never try to turn her against her dad; she has her own relationship with him. You will want to spare her the pain but she is nearly an adult and will have to figure it out herself and decide what she can tolerate.", "YTA - you are a liar, you lied to your daughter about your history, and as always the truth came out.  Your daughter is an upset and confused teenager.  Grounding her is going to accomplish nothing.  You need to sit down and actually talk to her when she is calm (not when she is yelling at you).   What you are getting divorced about now is irrelevant to the question.", "ESH.  You and your soon-to-be-ex-husband need to be better", "Sorry, BOTH AH . DO NOT INVOLVE YOUR CHILDREN IN A DIVORCE. Disgusting behaviour.", "Your ex is an awful A. Family therapy ASAP. You can’t ground her for misinformation and half a story she thinks is total truth. Therapy. Immediately.", "ESA -- You both lied, and. he revealed the truth first. She's confused and hurt -- her whole world is shaken. Mainly though this is toxic parenting -- it's not as important, the old affair and who's justified. The problem is that ex is trying to hurt you through the daughter and alienate her from you and her brother.", "honestly i just feel bad for your kids", "She’s right. You lied to herd you’re a liar. YTA\n\nYour husband is also an asshole for pitting her against her siblings.\n\nYour kids need therapy and both of you need to stop bullshitting them.", "All cheaters are assholes, you're no exception, I hope your daughter never talk to you again. YTA.", "YTA \nHow do you expect your children to believe you?", "INFO: What does your son coming out as trans have to do with the rest of your story? Like, maybe I missed something but I feel like you only included that to get some sort of sympathy points.", "YTA\n\n&#x200B;\n\n\"for grounding my daughter after she called me a liar?\" ... Why? She is right.\n\n&#x200B;\n\n\"she came back home she started arguing with me about why I never told her the truth, she called a \"lying bitch\".\" .. So she was impolite - but you never told her the truth and DID lie to her.\n\n&#x200B;\n\n&#x200B;\n\n\" all she told me is that she hates me and will try to leave to live with her dad.\" ... a reasonable solution. And at 17, she will be allowed to decide.\n\n&#x200B;\n\n&#x200B;\n\n\"Edit: our oldest son came out as trans, his dad isn't supportive at all, quite the opposite, that's why we're getting divorced. He's trying to get Amelie against her brother.\" .. There is NOTHING in your story about that - your story is just about how you lied to your daughter and were called out for it, and threw a tantrum.", "what? are you forreal? you're punishing your daughter for having an opinion? granted it maybe under false assumptions, but shes still a human being, shes going to think what she wants and punishing her for being adult enough to tell you how she truly feels is wrong as hell. YTA. you dont need to ground her dude", "YTA?\n\nIsn't this pretty obvious? Your daughter called you a lying bitch and I think that's pretty accurate given the info she has.\n\nLike you did lie, so yeah. \n\nSeems like it's pretty simple here though, 17 and 15 year old are old enough to decide where they wanna live/be, let them.", "NTA for being the non transphobic parent but sort of AH for thinking the origin of your relationship would be hidden", "I sure feel sorry for the kids, they’re not gonna want anything to do with either parent thank you after they graduate college or turn 18", "YTA, so you are a liar, and then grounded her for pointing it out? If you lie about something that big how can you expect anyone to really believe anything you say?", "Info: I don't get why it's a big deal to Amelie that you and your husband were both previously married. Why does she care?", "At 17 you probably can’t stop her from living with her dad, as most States lets kids that old choose who they live with.\n\nAnd YTA for grounding a 17 who chose her father over you.  Hopefully she finds out quickly that she can move to his place instead and can cut you iff completely when she turns 18.", "I don't think grounding at the age of 17 will have the effect that you think it will...\n\nBut treating 17 years olds SOMEWHAT like adults because they do really want that (although they don't want it 100% since they don't know what it wholly entails) will get you the results that you want. \n\nLike hey.... I didn't tell you this bc I was embarassed at what you might think... Unfortunately parents are people too and we make mistakes and don't always do the right thing... \n\nThe issue I am having with your father is x...... here is why I disagree with him... \n\nIt is not ok to call me a lying bitch. It wouldn't be ok for me to speak to you that way.... It's not ok for you to speak to a teacher that way or a teacher to speak to you that way or a boss to an employee etc... \n\nYou aren't grounded anymore I reacted when you said that but let's try to just tell eachother the truth from now on.", "everyone in this situation is an asshole. She's right, You are a liar. The only way you will ever get her to see your side is by admitting that. This whole scenario is a shit show and The kids will suffer the most.", "ESH - though your husband sucks the worst for being a bigot", "ETA, except the kids, but you’re the bigger asshole.", "When I was 15, my parents went through a rough patch and in the middle of one argument my mum yelled at my dad, “Go on, leave, you’ve done it before!” I was very confused because I couldn’t remember my dad ever leaving, and it’s then that he told me he’d been married before my mum. His first marriage had no real impact on me - it didn’t produce children, it ended before I was even an idea let alone around - but it still felt quite shocking to find out about it. I went to stay with my grandma (dad’s mum) for a bit, I asked her questions I had about it like why did they divorce and did his first wife and my mum overlap. She told me what she knew, and when I went back to live with my parents (they worked their problems out) I felt a lot better about the situation. \n\nMy point is, even though your first marriages have little impact on your children, it can still be shocking news and there was a better way to handle it than grounding her. I don’t think anyone in this situation has covered themselves in glory - your soon-to-be ex-husband is taking advantage of the situation to drive a wedge, your daughter is being unpleasant but is possibly the most ‘innocent’ as an actual teenager, and you went with punishing her rather than being more open - so I won’t go as far as to say Y T A, but don’t be surprised in you’re entering a difficult stage in your relationship with your daughter.", "ETA. This is a bit of a tricky thing because you were married, I assume your ex knew you were married, and you guys had an affair anyway. You're both kinda trash in that situation. Unfortunately, society tends to dump on women more than men (even if it's the married man, the 'other woman' is always blamed) so your daughter is probably getting a lot of that sort of communication by your ex.\n\nIs your ex conservative, or fallen down the alt-right pipeline? I can imagine a conservative man who views trans people as groomers and parents of trans kids as child abusers is not helping the situation, if that's the case.", "YTA for grounding.\n\nNTA for all the other stuff because the father was also having an affair on his partner? Tf \n\nall y’all need therapy", "N-T-A on this story, but ESH because you lied to your kids to cause the issue. - Based on your edits as to why you are getting a divorce (should have been in the original post), Your ex is a a raging AH for turning his back on his son because he doesn't approve of his transition and also completely lying to your daughter. Your daughter will eventually learn the truth, and although she is young, she is being a huge brat. Since the relationship started based on lying to your exes, I guess you should not be surprised.\n\nI hope that this is a lesson to hide the truth from your kids. Please tell your youngest when she is old enough to understand.", "ESH. Maybe don’t be assholes cheating on your spouses.\nYour daughter is in a nightmare situation. She’s still young and a trans sibling is probably confusing for her. Then her parents are fighting over her sibling and breaking up her family.", "YTA. Your daughter is understandable upset and you are treating her like a child, although she is practically an adult. All you are doing is further isolating her and causing her to have even less desire to be around you. Try treating your daughter like an adult and being open with her. It sounds like you are taking out your anger at her dad on her. I’ve lived through that and don’t have close relationships with either of my parents because of it. Get over your ego and try to fix things with your daughter before it’s too late.", "ESH\n\n- You have lied to your daughter, you can’t deny that and now she is hurt that you lied\n\n- Your daughter should not have called you what she did.\n\n- Your ex is a transphobic ah", "ETA, especially OP and the soon to be ex husband. daughter is confused and her anger is being steered towards OP.", "ESH , and badly . Damn .", "YTA on this topic, while good on you for supporting your trans child.", "YTA. You can’t punish her for calling you a liar when she is just stating a fact. What are you trying to teach her?", "I get totally get why you thought grounding her was the approach but I definitely think you should rescind. Your daughter is clearly hurt by what’s going on between you and your ex, and she’s old enough to know the truth. Your ex disclosing it just to manipulate her is obviously messed up, but you’re almost missing a great opportunity to level with her. I think you should still try once she’s calmed down a bit. \n\nSpeaking from experience in a toxic relationship between my parents - my mom was always open and honest with me. I disagreed a lot with how she handled what was happening to us anyways. But because she was always so honest with me, as an adult (almost 30) I can see where she was coming from and feel like I understand her side so much better. This has been crucial for me in my own relationships throughout the years since leaving home. Her openness with me has allowed me to heal a lot of the trauma I had from my dad and not use that trauma against the men I choose to be in relationships with. \n\nYou have an opportunity to save your relationship with your daughter here. I urge you to consider her and not your pride in this situation.", "YTA. You lied. She found out. You ground her. Wonderful parenting /s\n\nAnd yes, it if it’s true that the husband is setting her up against you, he is T A too. \n\nPS I don’t believe your divorce reason at all. That was added for sympathy. Pathetic", "YTA, you are a liar. You lied to your husband by omission. Your kids didn't need to know the whole story, but let's not pretend that you are an honest person. You're a cheater. Give her back her phone, and then tell her the truth. Once upon a time, I was a cheater. You're a product of my nonsense, and I was too ashamed of myself and my decisions to tell you. I  apologize for keeping it from you.\n\nPlease understand that your dad is also a cheater, as I most certainly didn't force him. Now that we've got that out of the way. We're going to either support your brother in his transition by respecting his gender identity, or you absolutely can and should live full-time with your dad. I love you very much and don't want to lose you, but I won't allow you to hurt your sibling. I'm leaving your dad because he decided to hurt his own child. Since you're contemplating living with him, I think it's important to consider that his love for his children is conditional.", "This family needs therapy.", "Parental alienation is very real and dangerous, OP.\n\nYour ex-husband is actively in engaging in it.\nGive your daughter her phone back. Apologize.\nThen offer to answer any and all questions honestly without saying anything disparaging about her dad. Tell her to research Parental Alienation and let her know you think it is important that she has a healthy relationship w/ both her parents.\n\nDo NOT be the reason he successfully drives a wedge between you and your daughter.\n\nYour son deserves your full support. Hopefully, your daughter will see that too. Stay the course. \n\nYTA - you could have handled the situation w/ your daughter better. I understand tensions and emotions are high.", "Why does the update about the elder son being trans and rejected by dad feel like a fabricated attempt to garner favor and manufacture a clear villain?", "YTA-you are a liar. Yeah your ex sucks and you are right to divorce him. Hes a liar too but that doesnt negate that you lied. You should never fround your kids calling you out.", "ESH\n\nBoth parents are liars and cheats. The daughter shouldn’t believe either one.\n\nAmelie (I love her name) is angry, hurt, and her world has been turned upside down. She has been lied to. However, she shouldn’t have called her mother a bitch. At the same time, OP overreacted because she’s also angry, hurt, and frustrated.", "YTA.  Your daughter is almost an adult.  You aren't going to have a whole lot of say in custody.  A kid this age should be free to choose.\n\nThere is zero reason to ground your kid.  You both held the truth from her.  For what reason? My spouse was divorced without kids prior to us marrying and having kids and my kids have always known that.  Because you couldn't keep it in your pants until your divorce?  This is the consequences of lying for many years.  \n\nI recommend family counseling and some sincere apologies if you hope to heal this relationship with your daughter.  I wouldn't tolerate any disrespect either way between the 2 teens.  I'm not saying the ex isn't an AH.  I'm answer the title question - YTA for grounding your daughter for calling you a liar and she is not.  You are a liar.  Actions have consequences.", "But you did lie to your daughter. YTA for grounding her because she called you out on what you are. Don't take your frustrations towards your ex out on your kid. Especially when one parent is already doing that.\n\nYour daughter is seventeen and therefore old enough to make her own decisions whether you deem them right or wrong. State your argument in court and let them decide, not to your rebellious teenager who you are grounding because her dad told her the truth regardless of the intentions behind it.\n\nThe question isn't \"AITA compared to my ex?\"", "Esh. You grounding her when she is acting out due to all this new info coming her way, the ex for beinf a transphobic asshole and trying to weaponise your daughter and both of you, for thinking starting a marriage this way was gonna end good.", "ESH except the kids. You and your husband LIED to your kids and are getting a divorce. Your daughter is obviously going through something traumatic, same with your other daughter you’re saying is trans. Why are Moms trigger happy when it comes to being trans and make Dad out to being the bad guy about it? You married him for a reason, I assume lust and the child on the way at the time but maybe you trust Dad enough to marry him and have kids with him so maybe consider Dad feelings in this, not just yours or your one child going through some obvious mental stuff. You shouldn’t have grounded your daughter for telling the truth…maybe she shouldn’t have called you a bitch. Take it easy on her cuz y’all fucked up this whole thing.", "> AITA for punishing my kid for calling me a liar after she found out I’m a liar?\n\nYTA", "ESH. You suck here because you grounded your daughter for being distraught about being lied to on how you and your soon to be ex met. You may not see it as a big deal, but guess what kids will paint a picture of how relationships should be around what they know. Being told oh we met through mutual friends and XYZ  your daughter has painted a mental image of what this is. To learn it is all a lie is extremely hard on someone, basically they aren't going to know what else you've lied about and are going to feel lost, hurt, and angry. \nYour ex sucks here for trying to turn your daughter against you. It's a really shitty thing to do and no one should ever do that to a kid.", "ESH except for the kids. You and ex husband have created a very toxic environment for children by basing your relationship on lies.", "This is not a simple Y T A or N T A .  Please get counselling as this really has nothing to do with you are wrong or you are right psychology babble.  I hope you work this out.", "ESH, sheesh. What can I tell you? A marriage that began as an affair? It was never going to work out. 🤣🤣🤣🤣🤣🤣", "ESH\n\nI think you need to put ALL of your kids and your own ass in therapy and you need to get evidence that your now ex is trying to manipulate your daughter to be transphobic and turn against her family, BUT you also fucking cheated on your first husband and basically pretended like you and your new husband didn't completely emotionally destroy two other people to get here and are acting like your daughter should be fine that you cheated since her dad also cheated.", "NTA-I would not tolerate my children calling me this. I would continue to have discussions with my children about this. I hope everyone is in therapy. Divorce is hard, with a lot of ups and downs for everyone.", "ESH except the kids who are unfortunately living out a Jerry Springer episode! Y'all are too messy!", "ESH. You for lying to your kids for all these years then grounding your daughter when she finds out and calls you what quite frankly you are,  and your husband for being a lying bigot who's trying to pit the kids against each other because he can't support your other child for being who they are.", "So.... who cheated this time? Both?", "Wow karma came and falcon punch the shit out of you", "Honestly it sounds like just everyones the asshole here. Dads the asshole for twisting things and being a cheater to cause this situation in the first place. You're an asshole for your reaction, being a cheater to cause this in the first place, and not attempting to see how your daughter might feel about all this. Your daughters an asshole for calling you a lying bitch instead of listening to you, but she's also a teenager so what do you expect.   \n\n\nReally everyone here sucks, and i just hope you sort it out for the kids cause they don't deserve to get fucked up over the tumoltuous life you've had.", "ESH both you and ex husband are assholes.\n\nYou both chose to hide it, no child wants to be the result of cheating let alone when both of you were married prior... You generally disgraced your kid with that. Past is biting hard isn't it you cheat 🤣\n\nEx is an asshole for causing issues with your son.\n\nNeither of you should have gotten married or had kids, what made you think you was responsible enough for kids when you couldn't keep it in your trousers in a marriage? Suddenly, you were both good people in love?\nNope, you're both very shitty people and your kids will slowly realise that. \n\nImagine punishing your daughter for finding out the truth but all you can say is YOUR DAD BAD    like for real????? Grow up, own up and admit both of you are shitty people. Maybe If you chose to explain things before a divorce and TALK to your child, you wouldn't be in this mess in the first place.", "NTA. You ex is trying to get your child to hate you, something very similar happened to my great-uncle. Wait it out. Let the daughter love her dad and hate you. She will eventually figure out that her dad is a liar, and swap sides", "But you did lie! lmao you grounded her for calling you out on your bullshit. You’re a piece of trash bye.", "ESH except for the trans kid.", "Random aside, but how does a 17 year old hear that BOTH sides cheated and comes away with only mom is the problem or looks bad? Husband’s had to have left out some details", "NTA in my opinion. If I called my mother a bitch I would have been slapped across the face and THEN grounded. Plus, you are under no obligation to tell anyone anything about past marriages. Gen X here, if it wasn't obvious. 😂", "I can't even actually give my opinion the way I want to because it will get me banned. But absolutley without doubt you are an asshole", "Wow is AITA switcheroo post #53279 where OP is YTA but puts an obvious mystery that people will ask about so they can go \"surprise the other person is racist / sexist / homophobic / transphobic / abusive / etc.\" after the initial round of voting. Fucking yawn.", "ESH. Both of you waited too long to be honest. You both did have an affair and wrecked 2 marriages. I guess this is the other shoe dropping. He is manipulating her. She is out of line for cussing at her mother. He is abusive for how he's using his children as weapons. Document everything for court as parental alienation. She's 17, so she'll do what she wants and reap what she sews... kind of like you.\n\n She is old enough to know better, and needs to know y'alls previous relationships are none of her fucking business. How you met before her dad's baby juice got shot into you HAS NO EFFECT ON HER LIFE AT ALL. Oh no!, your parents had a mutual affair and fell in love, someone get her a safe space for something that happened before she was born. What a drama queen.", "YTA, and so is your husband to a lesser extent\n\nYour daughter found out that you were lying, called you out for it, and you grounded her for it? You’re pouring fuel over a fire here. I don’t think any kid that’s justifiably angry at their parent(s) forgives them through being punished for it.\n\nUnground your daughter, apologise to her, and tell her the truth. Although I’m afraid it might be too late. Also it might be a lost cause but I think it’s extremely important that you and your husband talk and make sure that this isn’t any harder for your children that it has to be. Right now it seems like you two are competing to see who can be the worse parent, and I think you’re winning at the moment", ">She told her that he has always wanted to tell them the truth but I didn't \"allow\" it since it would make me look bad. That's obviously a lie\n\nHow is this obviously a lie? You provide no evidence to suggest otherwise and it just makes it seem like you are leaving out a lot of details to make you look better", "YTA (your ex is a bigger AH).\n\nTo put it bluntly, you are a liar.  You and your ex lied to your kids for years.  Regardless of your reasons or whether it was justified, that’s a fact.\n\nYour daughter is 17, and she’s going through a massive upheaval in her life (two, as my understanding is that her close-in age sibling who she believed to be her sister turned out to be her brother), so the fact that she’s taking your betrayal of your first husband personally, the fact that she’s making a situation that doesn’t affect her (your first marriage) about her, and the fact that she believes your ex’s version of events, is all PAR for the course.  She needs understanding and support, not being grounded.  She didn’t choose any of what’s happening in her life right now.\n\nI absolutely commend you for standing up for your son and I’m sorry your ex is being awful - about that, and about using your kids as weapons when they’re already hurting.", "ESH.  You went about this wrong.  You can't ground her for being manipulated, that's how her father wins.", "ESH.\n\nWhat your ex is doing is called parental alienation, and the fact that he's also a transphobe makes him the biggest asshole in the world.\n\nYou are an asshole because what you need is patience with Amelie, she's a confused teenager. Grounding will get you nowhere.\n\nAmelie is the least asshole here, just because, while she's a teenager, she's 17 and not 12, and she should have a degree of knowing better to at least hear you out and not use targeted slurs. \n\nTake her to family therapy.", "You grounded your daughter for calling you out for the truth? Yta", "YTA. She is a child being manipulated by an adult. You are mad at your ex and taking it out on her instead of trying to understand what you have put your kids through. Using your power over her because you screwed up is wrong.", "YTA for grounding your daughter here. But man, you're a great mom for standing by your son ❤️", "ESH\n\nI can understand grounding your daughter for calling you a bitch(though it might be a bit severe considering the circumstances leading to high emotions), but not for calling you a liar because you are. That makes you an AH.\n\nYour husband is an AH for weaponizing this lie you both shared against you and your son.\n\nHonestly, you should be clear with your daughter that she's right, you did lie to them, you can try to explain everything, but there's a high chance she won't listen to you, rightfully so. Unfortunately, your soon to be ex husband got to it first and now has control of the narrative of this over at least your daughter. I wouldn't even try to talk to her about her father's involvement in this for now, because she won't listen, just focus on how you acknowledge you fucked up and are sorry about lying to her and hope she forgives you. You should give her time and be clear you're there for her and won't lie to her again.\n\nI think the best thing to do is to give her time and be open with her whenever she talks to you.", "YTA and so is your ex tbh.  Your kid is being manipulated, you had an affair to begin your relationship and tried to hide it away.  You can't hide the truth forever.  Also, cheating is gross.\n\nYou need to file an emergency motion due to attempted (and successful, it sounds like) parental alienation.  That does not fly in court.  \n\nGet that girl some therapy.", "NTA your husband is for turning your daughter against you when you were both at fault. the affair is nothing your children need to know at young ages. you already said you would've told them if they asked although i dont see any reason they would ask. but your daughter is the ahole because instead of coming to you respectfully and getting your side she took his side completely and wouldnt let you explain. also it would be one thing to say you are a liar or you lied to me but calling you a lying bitch went to far she deserved to be punished but tbh i dont think you're going to have a relationship with your daughter until she's more mature and can see through her dads deceitfulness and she'll probably try to live with him full time because of this. keep being there for them it will get better it will just take time. but please try not to let it come between you where you will never have a relationship because she is young and vulnerable to manipulation", "NTA- i’d let her go live with her dad…. She will realize one day he just used her as a pawn ……I wonder who she’s going to come to and she needs money for college or  is having a hard time paying rent or needs food….. or what happens if she is gay or bi will he support her then", "YTA and I love that Karma is coming around on you two cheaters its beautiful", "ESH, but you made it worse.", "NTA and I genuinely don't understand the yta votes. She called you a bitch, that's worth getting grounded.", "Try to be gentle with your daughter. She is a child being manipulated by a grown man that she trusts after going through the trauma of her parents divorcing; the confusion of her brother coming out as trans and parents choosing sides, the feeling of being lied to her whole life about her parents past. Just be gentle. She is a confused teenager and it's normal for her to react so harshly. Her brain is not developed and her reactions will be much more explosive than an adult. If this is all too much for you, imagine how she must feel as a child. Please be gentle, be there for her and make sure you don't lose her.", "This is more of a dysfunctional mess than an AH situation.\n\nYou have:\n\nA trans child unsupported by one parent.\n\nA child being turned against one parent\n\nAnd\n\nA past both parents had hidden from the children, now coming out soap-opera style.\n\nIf this is even real, you don't need reddit and cute comments about who is the AH; you need group therapy and serious legal intervention to get your custody issues sorted out.", "ESH. You're a cheater who didn't want to be honest about how you met your husband, and your ex is an ass whose using your shared secret to get back at you. Instead of acting like adults, you're both trying to weaponize the kids. Grow up and act like parents.", "ESH and you both sound like shitty parents, honestly. you do have my respect for supporting your son though.", "ESH but you’re like the least in this situation. You and your husband were cheaters and you pretend your former spouses don’t exist. You MUTUALLY decided to do this so he can’t just blame you as the big bad home wrecker here. Your husband is also massively transphobic so he sucks so much more just for that. Your daughter is a kid but 17 is old enough to not only know better but to form your own opinions on things, including the gender identity of a sibling. If she wants to hate trans people because daddy says so, she’s not a good person. She’s young, but she still has a choice to not believe the things she’s being told to turn her against her brother and you both.", "ESH Everyone except the 2 children not mentioned are AH. I'm including the daughter. She's not using her critical thinking skills and also being hateful to her brother. Transphobia is not acceptable.", "Both you and ex AH, what a nice family you have there.", "I'm not reading that novel, but if you lied and grounded her for calling you out on it, you're an asshole.", "OP YTA. Your soon-to-be ex is as well.  But hats off to you with the trans smokescreen to skew the votes in this sub.  But that’s what it is, a smokescreen.  You are a liar and you punished your daughter for calling you out", "ESH. She’s a confused teen in the middle of a transphobic dad and a mom who never should have punished her for how she feels when you technically did lie by omission. She needs a parent to blame right now and ir sucks that it’s you, but grounding her won’t make this situation any clearer to her.", "YTA. You did lie", "ESH? I think you only pushed your daughter further away. But it's clear that it's the dad's transphobia which is the real AH thing here, and your daughter is siding with that. Makes her an AH as well. I feel sorry for your son.", "I'm not really surprised that you've got all these issues now when your relationship started with deception and adultery.  Fire and brimstone to you.  YTA.", "NTA- she is fine to be mad but she’s not fine to curse at you or call you names.", "Props to supporting your trans kid. But YTA for lying to your daughter and gaslighting her on the circumstances of your marriage and then grounding her for her feelings. \n\nWhat you should have done (and can still do) is sit down with your daughter, confess that your marriage started out as an affair and that you did not share that with your children because you didn't think it was their business. You love your children and don't want to burden them with your mistakes and insecurities. You are divorcing dad because he wont support your other kid and he is taking it out on the family by airing this dirty laundry to your daughter to try and win her allegiance.\n\nYou tell her you love her and that her feelings are important but that she can't disrespect you. Let her react however she reacts. Talk about how she feels. Validate her feelings, even if you don't agree with everything she thinks. If you come to a consensus, unground her and give her her phone back. Do NOT make her choose sides. Just be her mom.", "Just...stop. YTA, this is between you and your soon-to-be ex, not you and your daughter. She's right, you are a liar, and so is her father. You need to try to repair the relationship between you and your daughter and not worry about what your ex is saying. You're both hating each other right now and your kids are getting caught in the middle. What a mess.", "YTA. Karma is a bitch.", "YTA\n\n> I can't really stop her from seeing him whenever she wants\n\nYou have no right to tell her if she can see her father or not. Even if you don't agree with his views or actions. She's also 17 and soon an adult... the only thing you'll do is having her cut you out of her life. \n\nYou both lied, that's the truth. So instead of saying \"it wasn't your business and I don't have to discuss my private affairs with you\" you decided to say \"but your dad was in it too\" (not a great argument, because you're still a lier, and just because someone else lied too doesn't erase your part in it). \n\nCalling you the b-word was unacceptable, but you have a teenager who's parents are getting divorced. She needs therapy and someone listening to her, not mum on the high-horse trying to justify herself and two parents trying to pit them against each other... using her as \"bait\".\n\n> she told me she never wants to see me again and such\n\nShe's soon 18 and if she wants to live with her dad, there's probably nothing you can do against that... as long as her dad will take her in.\n\n> our oldest son came out as trans, his dad isn't supportive at all, quite the opposite, that's why we're getting divorced. He's trying to get Amelie against her brother\n\nWhich is shitty of him. But for Amelie right now you and your brother are probably the ones responsible for the divorce. (Obviously you're not, but teenager/ kids logic). Again, she needs therapy, not a battle of \"who gets her\" or \"your dad is a not-so-nice person either\".\n\nYou're the adult. You lied. So you're TA. (Obviously her Dad is too... but your daughter is not).", "Ex is an ass but in ur reaction so are u. Yes she was disrespectful in her method of dealing but she is also speaking from a place of pain", "ESH \n\nShe deserves to be grounded for speaking to you like that. Talking about her feelings and throwing around insults are not the same thing. \n\nShe’s 17 though and if she wants to be with her dad you can’t stop her. \n\nYour daughter isn’t entitled to know your personal business and your ex is way out of line for weaponizing your relationship with your daughter. She’ll grow up and see it herself one day.\n\nThat being said, keeping the fact that you were previously married isn’t cool in my opinion. The fact that you both cheated on your respective spouses is personal business and I can’t make sense of the reason you’d share that with children.", "INFO: Why is she so upset that you both were previously married before she was even born? I just feel like that's a wild thing to be mad at your parents for.", "A needs to understand that her dad violated his first marriage vows just like you did…ypu and he need to sit down with her and tell her the truth unless either he’s lying now or he just kept it a secret because you demanded it. ESH.", "\"we had an affair before we got divorced to start dating. Amelie was born shortly after we got divorced.\"\n\n\"so we just throw away our weddings photos and pretended neither of those marriages happened. When/ if the kids asked how we met we told them it was though common friends.\"\n\nSo you are a liar, you just don't like being called out on your lies. \n\nYTA", "This is called child alienation and you can take your husband to court over it. Do so. This will show your daughter the truth of what he is trying to do.\n\nHowever, you are still the one who had the affair and \"broke\" your family in your daughters eyes. Most people don't believe cheating is excusable and this is why. Its an incredibly selfish thing to do when you could have just gotten a divorce in the first place. You're naive if you think people wouldn't latch onto the fact you're a liar who only sees their own happiness, aka someone who cheats then grounds their child for being rightfully angry and saying the truth.\n\nYTA", "YTA- normally I would say a kid calling her mom a bitch is grounded, but considering that you have been lying to her for years, I give her a pass. She’s just found out her parents are getting divorced, that they were cheaters, and her brother is transgender. It’s a lot for her to cope with.", "As someone who recently learned my dad lied to me about a lot of very major shit- YTA. And a big one. Glad she’s finding out while you’re alive.", "She's not confused. She understands exactly what happened. Her relationship with you and with her father ad with her brother are three different relationships and she isn't confusing them either.\n\nYTA... for grounding her AND for having an affair AND for trying to make it about her brother.", "You and your husband are both horrible people", "ESH and your custody battle may not be over- but you’re losing your daughter. No judge is going to force a 17yo to live with the parent they don’t want to for less than a year. Most likely, the only kid who won’t have a say is the 4yo. That poor kid has to put up with you and your ex for another 14 years- try not to continue to destroy his mental health.", "ESH - and by that, I mean you and your ex. Your ex, for being a transphobic terrible parent toward your oldest son. You, for being an unsupportive terrible parent toward your daughter.", "You should be in family therapy instead of on Reddit.", "OP: AITA for grounding my daughter after she called me a liar.\n\nMe: How much you want to bet OP is a liar?\n\nOP: I lied to my children while they were growing up\n\nMe: YTA.", "If you can't handle being called a liar on something where you deliberately withheld information?  Yeesh.\n\nThere's a lot of bad juju here.  Good on you for protecting your son for the asshole dad, but lashing back at your daughter like that was a poor choice.  She has the right to vent in that situation, and you should have listened and then calmly asked if you could tell your story if she's ready to hear the other side of it.\n\nI'd still make that statement.  \"Amelie, I'm sorry I reacted poorly yesterday, you are suffering because of your parent's mistakes.  When you are ready I would like to tell my story, but I'll always love you.\"\n\nYou gain absolutely nothing by punishing her at this point in her life.", "You're both a couple of fine tuned assholes. \n\nNot enough therapy in the world to get any of this back on track. Way to mess up your entire family lineage in one generation.", "I don’t think you should’ve grounded her so maybe your a bit of an asshole for that but the ex husband is the actual evil person here. Dude doesn’t support his own kid ofc he’s gonna be lying to the daughter to pin her against both her mom and brother. \nI think you’re partially the asshole. I think the people in the comments are being biased bc of the affair.", "ESH\n\nYou for not owning up to the fact that you are in fact a liar. \n\nYour husband for trying to turn your daughter against you *and* her brother\n\nYour daughter for how she is treating her brother.", "YTA. She found out you are an adulterous liar. How is that your child's problem? I agree with him about your underage son. Seek help.", "ESH. Both you and your soon to be ex try to hide the fact you both were cheaters. You are the AH for grounding your daughter because she gels betray and hurt and she has every right to call you a liar you just didn’t want to hear the truth. Your son to be ex is the AH because he is actively causing a rift between you and your daughter and he oppose your other child choices. Both of you suck big time eventually the truth will come out.", "YTA-she’s a kid who’s parents are getting divorced she shouldn’t be grounded for expressing how she feels. Also she’s 17 in less than a year you won’t be able to ground her or really do anything anymore. So as far as her decisions go once she turns 18 she can do what she wants so I’d recommend to be careful in the mean time how you get a long. I’d apologize if I was you.", "YTA and you can’t fool any of us. this is like a little peek inside the brain of an entitled asshole.", "YTA\n\nYou punished your daughter for being emotionally manipulated by her father. I fully support your decision to stand up for your son, and I'm sorry your ex is both a bigot and emotionally manipulative. But grounding your daughter when she reacts to his manipulation is only going to push her further away. \n\nWhen you do work out custody, make sure you talk about consequences for parental alienation. \n\nI also suggest you and your daughter begin family therapy and you give her solo therapy as well. Having a neutral third perspective may help her better navigate the divorce and her father's manipulation.", "Since this situation is about you and your daughter, I will go with YTA.  Sure, she should not have called you a bitch, but the fact is (and the reason you give for grounding in the title) that you are a liar - you did lie, and for many years. Of course, your ex did as well and is trying to manipulate her, but if you want to have a relationship with your daughter, denying this truth that you have been lying for decades is not going to help you.  She already sees you as not her ally - this is not helping at all.  And your co-worker is right - she is going through a very very difficult time right now - everything in her world is changing.  If you want to actually have a relationship with her, you have to do things differently.  At the moment, she doesn’t trust you or seemingly thinks anything positive of you at all, and you have to be smart and patient about this.  Step one should be to unground her and have an honest and calm talk with her about why you kept it from her.  And then therapy for her - individual and family. \n\nAlso, you can probably do with some therapy as well.  Separate from what is happening with your son, there are parts of your post that hint at a bit of denial/unacceptance of what you did in your last marriage.  I would not at all be surprised if there aren’t things on your side that need to be addressed and dealt with in therapy.", "yes YTA for grounding her when she was feeling so vulnerable. but not a big raging asshole, just a parent who also got upset and maybe made a poor choice instead of saying, “you do not talk to me that way. go sit in your room and calm down, and so will I.”", "YTA. Your daughter deserves honesty and respect, not punishment for questioning you. Time to rebuild trust, not break it further.", "You have a kid going through a traumatic period, dealing with anger issues. Grounding her is just going to reinforce you as the bad guy. Start looking at how to build better communication with her — don’t punish her for what she is saying, but set boundaries about saying things in non-abusive ways. Give her safe spaces and ways to express herself, and don’t be afraid to let things slide when they’re said in the heart of the moment. Remember her physiology is working against her — impulse control is still forming and hormones have her amped up. Make sure she has safe third parties to talk to about things. \n\nGentle YTA, because I know it’s hard right now, but you will need to find better ways of doing things if you done want to alienate and lose her entirely.", "The marriage was based on infidelity and the divorce is based on transphobia/bigotry. \n\nThe stbx sounds insane. \n\nESH for involving your kids. Though the stbx sounds like the bigger AH.", "No, daughter was grounded for her disrespect/calling mom a bitch.", "The adults are assholes.\n\nThe kids are being manipulated and mistreated. This has therapy written all over it.", "[removed]", "You can manage your feelings without insulting someone. She got grounding for insulting her mother, not for having feelings", "Yeah I hear stories like this and hope it’s made up, just because I don’t want any real kids to be going through something like this. It breaks my heart", "They’re both lying adulterers. What else could this be, besides an ugly divorce? They were never good people to begin with. YTA OP.", ">ESH - except the poor kids, obviously.\n\nRemember daughter is siding with transphobic dad, it seems she too is an asshole.", "Would you tell your kids every personal detail about your life?", "To me it's the fact that a grown up man in his 30's (when daughter was born) thought this was a good idea.", "Setting a great example for your kids, mom of the year 🥇", "If they both suck its, ESH. \nALOT of people on here don't know how to use the acronyms appropriately.", "What is the truth? I'm so confused 🤦‍♀️😅", "Context matters. You child calls you a bitch. That is generally a *bad thing*. That you were previously a cheater *could* be a factor, but considering no one that child knows was the victim of your cheating, it seems a weak defense. And considering the parent she’s supporting was an active and willing participant in the cheating, it’s no defense at all. So we’re back to it being a *bad thing*. \n\nThen we get into the fact that daughter is choosing the side of a transphobe and might also have a tough of the transphobia herself. That is a ***very** bad thing*. Sure, the edit could be all made up. This whole story could be. But earlier, in what I assume was the OG post, OP says she is supporting her son. So since this isn’t “Let’s Play Detective,” but AITA, we should take this as fact. Daughter is actively caping for her transphobic dad, who has let it slip that mommy is a cheater and seduced him out of his first marriage and into her cheating arms, on top of turning his middle child trans. And after months of this - and being called a bitch - OP made the drastic move to ground her. Call CPS.", "YTA - I feel sorry for the kids. Shocker that she is going through another divorce. Her and her soon to be ex absolutely deserve each other. Reminds me of that meme where the wife says that they should see other people and husband said he didn’t because they’re terrible people. I am not going pretend that OP husband is any better because he’s not. Hid a whole previous life because you 2 couldn’t keep it in your pants? Your daughter called a spade a spade. Infidelity probably played a part this time too.", "Us that from teen wolf? 🤔", "100% THIS", "Agree.", "right the fact is the mother was keeping secrets and there's just a feel here that there's more going on that she's not telling us. but when confronted by her teenage daughter who's seeing her world come apart, mom's response is to punish her. YTA", "She is grounded for calling her mother a lying bitch. You don’t get to talk to ppl however you please because you are having a tough time.", "> \\[She\\] will ~~try~~ ~~to~~ leave to live with her dad.", "Because he's telling her that I didn't \"allow\" him to tell the truth, I think kids shouldn't get involved in our past relationships either", "Exactly.  While it’s fair that you never brought it up, when asked directly about it you should have told the truth.", "I thought I was insane reading through these comments and thinking this.", "i just saw that she called you a bitch. missed that part. completely out of pocket but at the end of the day shes 17 and i still dont think that warrants being grounded. just not as harsh in my last response as i didnt see she called you a bitch. i change my answer to ESH.", "What does stbx mean?", "Definitely not surprising though. People who cheat on their spouses and/or sleep with other people’s spouses aren’t exactly stand up characters. OP isn’t just YTA, she and her husband are terrible people.", "But, this is between the daughter and the mother. *WIBTA if I grounded my daughter*\n\n So no, not ESH. YTA. Daughter is just a kid going through it.", "How is OP weaponizing the kids?", "I mean. It sounds like she (as well as the father) are. They are publicly feuding and pushing the kids in the middle. And I am pretty confident this kid has heard both parents cuss. They are both trashing the other to their kids.", "This seems to be a pretty big buried lead. I imagine there's more to that whole situation. Not saying it is impossible but just because she picked his side doesn't mean she is transphobic as well.", "Daughter is a kid being manipulated. We don’t know her real feelings", ">This is as clear a case of ESH as there's ever been on this sub.\n\n100%! Neither of the parents should have lied in the first place. \n\nI don't think OP is TA for grounding her daughter for calling her \"a lying bitch.\" That's unacceptable behavior. There are constructive ways to have conversations, and that's not one of them. \n\nBut OP and her ex are AHs for lying, and ex is an AH for trying to pit his daughter against her mother, and for being transphobic (of course).", "both parents cheated with others and got together. they tried to hide it from their kids, and after one kid comes out as trans, they divorce because dad doesnt approve. dad decides to tell the truth and mom isnt happy about it so daughter calls her a liar", "i guess that the mum cheated on OG husband to be with dad. \n\n&#x200B;\n\ni dont know why the daughter thinks this is any of her business. or why she thinks she can pull some moral high ground while supporting the dad, who is arguably a marriage destroyer 🤷‍♀️  \n\n\ni dont know if any one is asshole here. i think people are trying there best and have alt of  emotion atm.", "I'm wondering this too, because quite frankly, how they met truly isn't none of this child's fucking business. Technically, they did meet through mutual friends. And in the future, she is free and encouraged to disclose the full story.\n\nFurthermore, I am confused why the daughter thinks the dad is somehow the innocent party here when is 50% the \"liar\" too.\n\nNTA but of couse everyone is calling op the asshole because she envoked the magic word, cheating. The dad has no right to use the children to hurt OP because of the divorce and this automatically makes him a far bigger AH.", "My parents met at a Cheap Trick concert in Idaho. When I was little they told me they met at a bonfire party. I think they just didn't want to say cheap trick to a little kid.", "Idk I'd want to know if my parents marriage was the result of two affairs 🤷🤷", "Except this isn't about the mother and the ex. It's about the mother and her daughter.\n\nMother is the asshole, big time.", "And unfortunately the OP is playing right into his hand. The right move would have been honesty; explaining it was both of their decisions to not say anything like it was both of their decisions to cheat.", "This", "The conspiracy theorist in me says she might have only added that as an edit to garner more sympathy after all the YTA comments & it might not be true…", ">I'd at the very least vote this one an ESH\n\nThe post is about op lying to the daughter.", "Honest question from an unintentionally ignorant place. \n\nWhere are you seeing transphobia in OP's post/situation?\n\nEDITED: I read the edit.....transphobe asshole.", "Except the ex is clearly very much OK being the AH whole OP is trying to paint themselves as not one when she clearly is.", "Maybe, but that isn't a part of what was asked for judgement about. Isn't even part of the original post.", "Yeah but letting your child walk over you isn’t exactly going to foster a healthy relationship. Actions have consequences. When I insulted my mother, sometimes she’d ground me like this, other times she’d beat me. Guess which one I hate her more for", "[removed]", "An alleged transphobe", "I agree with 98% of what you said. But I see no reason to involve CPS. What this family needs is counseling to help them navigate through the truth and the rubbish.", "A bit of a stretch. They’ve been together close to 20 years and being married without children (so probably a brief first marriage) isn’t a whole other life, just a previous relationship and probably not the only previous relationship prior to the current one. They’re entitled to their privacy and not obligated to share relationship details with their children. Someone cheating 20 years ago doesn’t make them currently a “lying bitch”. That’s quite a passage of time.", "How is their previous relationships any of her goddamn business? They all suck, including the 17 yo drama queen. How does their previous marriages effect her life in the slightest considering SHE WASNT EVEN ALIVE YET? Her mom doesn't need to take abuse from her for something that isn't any of her business to begin with. This is such a typical reddit thread. \n\nMy dad used to mule coke from Mexico into West Texas before he met my mom. I didn't know till I was 19. I didn't throw a hissy fit, even though I hate drugs bc I've seen them destroy people's lives daily (nurse). \n\n She needs to grow up and get a grip. Not everything is about her.", "You said that very well and much better than I could so I’m not even gonna bother to say anymore except your comment is perfect.", "it's attributed to the Buddha", "yep - also to be fair, her dad sounds like a giant AH as well.  i really feel for the daughter having to navigate this asshole minefield.", "Doubtful that the divorce is due to that.  Most likely lots of other things factored into it but OP is choosing the one’s that out her into a favorable light and makes everyone else look bad.", "You may believe that kids shouldn’t be involved in past relationships, but your ex has made it so that his truth will stand if you don’t express your own. If you don’t correct the misunderstanding, it’s on you.", "Then why couldn't you control him to support your son? These are the questions you could have talked to your daughter about when you had both had a moment to calm down. You can always try talking to her again for a healthier state of mind. Maybe some family counseling before she turns 18 and refuses. ESH", "Soon to be ex", "Yeah it's hilarious that they who betrayed their own spouses trusted each other to take this secret to their graves, only to start betraying again. I feel bad for the kids but I've got no sympathy for OP (or her ex husband when he gets his own comeuppance)", "Everyone DOES suck here. Op and husband lied so op sucks. Op punished kid for calling her a liar, which op is. \n\nThe kid is knowingly siding with a transphobic pardnt who is divircing rather than showing love to his kids and whi ALSO lied. No blame for dad for lying. So kid sucks here too. Even removing judgement from das, the fact yhat hate is only directed at op meand ESH", "The person i replied to said ESH. I literally said both parents are AH.  That includes op. If that wasn't clear, op, YTA.", "According to OP's comment: [https://www.reddit.com/r/AmItheAsshole/comments/14b0j39/aita\\_for\\_grounding\\_my\\_daughter\\_after\\_she\\_called/jodpoql/?context=3](https://www.reddit.com/r/AmItheAsshole/comments/14b0j39/aita_for_grounding_my_daughter_after_she_called/jodpoql/?context=3)\n\nHer daughter is also on the transphobic bandwagon...", "Daughter tells trans brother their parents are getting divorced because “she” can’t be normal, as said above in a new comment by OP. Daughter is a transphobic little AH in the making.", "Daughter is an AH. It's really not OK call people, particularly your mother, \"a lying bitch.\"\n\nAnd I know I'll get downvoted for saying that, but it doesn't make it any less true.", "No, the OP isn’t happy because husband is trying to put blame all on her, when both agreed to lie during the marriage.", "The daughter feels that way because her brain is not fully developed and she is being manipulated by adults, thrown into the middle of something that is way above her maturity level. I feel bad for her and her brother. I hope they get therapy.", "Yeah I don't think how, why or when your parents got together has anything to do with you. It happened before she was born so why does it matter? I also think it's weird grounding a 17 year old who can move out, join the army, drive, change their name and have kids all legally but that's a different matter.", "My parents met when my mom was using her cousin’s ID to get into a bar underage. I was told they met at a grocery store until I was old enough to drink.", "Cheap Trick rocks!! That was my first concert back in the 80’s…", "Your mommy's alright, your daddy's alright, they just seem a little weird.\n\n[edit: corrected a misquote]", "How we met isn't important at all to me though, that was something between us, I also never told them about any of my other ex's, I don't believe it's important", "Crazy that you seen peoples lives as a game. This “game” should’ve never existed. It’s vindictive and is going to affect his position in court with the alienation. She’s old enough that it doesn’t really matter, but children’s lives and relationship with their parents is not a game.", "Yes, the problem with lying is that you never get the tell the truth on your own terms. Someone always find out before you get the chance.\n\nWith children, parents should use the onion peel method: they should tell a version of the truth that is appropriate to the child’s age. Then, as the child grows, they can add more details.", "He did nothing to her, he has done nothing wrong. My ex is trying to get Amelie against her brother (telling her that trans people are sick) and she's also refusing to call him by his new name/ male pronouns as her dad asked her to do.", "We're definitely missing something here. A father doesn't just go nuclear like that unless this has been a building problem. Maybe the coming out was the last straw, he's disgusting for that btw (the father not the son), but I dunno what this has to do with calling the mom a liar? Where did that come from!?", "The ex lied to his kids for years and now is trying to turn one kid against the other *and* turn her against her mom. \n\nESH.", "The daughter who refused to listen then called the mother a lying bitch?\n\nI dunno about you, but if my daughter called me a bitch she'd be grounded too.", "Not really... THEY made the mutual decision to hide it so if her kid wants to believe the poison she's being fed, she gets her supply cut off.", "So it's OK for a child to call their parent a lying bitch?", "Imagine defending someone who called her own mother a bitch", "Yeah he's the entire asshole of THAT story", "I mean, strip that way and you still have a) a dad who lied to his kid for years who is now b) trying to pit one kid against the other + against mom. \n\nStill ESH.", "> (although all I'm doing is supporting my son), he's trying to get her against me and against her brother\n\nOP put this in the main post so put your tin hat away.", "This subreddit needs a specific term for the surprise edits that add almost impossibly sympathetic details painting OP in a better light.", "That was the thought I had as well...", "It’s always a possibility. Even more so on the internet (especially Reddit) as much of what’s online is false or misleading.", "well, no, both parents \"lied\" by omission.", "It's in OP's edit: \n\n>our oldest son came out as trans, his dad isn't supportive at all, quite the opposite, that's why we're getting divorced. He's trying to get Amelie against her brother.", "OPs edit states that the divorce stems from the fact that her oldest child came out as trans and the husband is/was not supportive.", "Read the edit.", ">Edit: our oldest son came out as trans, his dad isn't supportive at all, quite the opposite, that's why we're getting divorced. He's trying to get Amelie against her brother.\n\nOP edited this in.", "So you're saying that being okay with being an asshole makes you... not an asshole? Sorry, I don't follow.", "That part was sarcastic.", "Ehh technically, it’s still is lying by saying that you met through mutual friends, is not giving the full story that is a liar.You didn’t meet through friends you were married and you met because your husband coworker regardless, this whole situation is a mess. All I can say is OP lashing out at your daughter is not going to help her understand the situation .if anything it just alienates her more.", "I was married for five months with my ex husband, my actual husband was married for longer, I think three years", "Holy hell. You’re a whole newsstand with all these issues.", "The general US population ignored trans issues until the past year or so. It wasn't until Republicans started taking away trans rights and vilifying their existence that most people even thought about trans people. Now bigots are obsessed with children's genitalia because it's never been about keeping children safe (because trans people pose no harm to children).", "Why do you doubt it?", "If you've ever raised kids with a narcissist you would understand that this isn't abnormal. Idk if OP is being honest, but I can definitely say I've seen narcs say horrible things about one child and the other child doesn't stand up for their sibling because they don't want their parent to stop loving them the way the parent stopped loving their sibling.", "She's believing everything he's said about her brother, she's refusing to call him by his name or male pronouns, she thinks he's sick too", "Yes but this is one of those comments that personally just seems like it benefits the image of OP. I would personally like more context other than \"She believes he's sick too\". There's way more to that story than this comment.", "We don't have enough information to suggest that the daughter is siding with the transphobic dad in regard to the transphobic stuff, specifically, though.  Just that she doesn't want to live with her mother.  A non-transphobe can agree with a transphobe about things unrelated to transphobia and not become transphobic themselves.\n\nEdit: never mind, I just saw a comment from OP saying that the daughter is refusing to call her brother by his preferred name and pronouns.  But that's also assuming OP is being honest about that, which, clearly...", "So that automatically makes him wrong about everything else? Is transphobia the center of the deception?", "I’d take that statement with a grain of salt considering the kind of person it’s coming from.", "Surrender, Surrender but don't give yourself away...", "Yeah, always funny how updates like they come out after many YTA’s.", "Totally agree. Seems fishy.", "It's not important to you but it sounds important to your daughter. Since you didn't tell her sooner, own your part, validate her feelings and be someone she will want to keep in her life.", "It's not important! Yes, they'd ask how you both met, but you do not need to tell them the full truth until they're older and it's gets brought up or you simply want to share...\nIt's not a big deal ATALL in my books. Quite frankly, I find it weird that this is even an issue to your children.\nDid you make sure they knew you lied on a math test at school?\n\nHowever, im starting to believe I may be weird for thinking this way due to the number of comments you're getting about 'lying' to your children.\nThis is the most simple but weirdest post I've seen so far.", "Most children ask how their parents met. You’re treating her like she’s 8. She’s going to be an adult soon. You’re ruining any sort of relationship you could have by playing this game with your ex and keeping your kids in the middle of it.", "It doesn't matter if it's important to you, it's important to her. You sound incredibly selfish \"well, it didn't matter to me so.\" No wonder your daughter wants nothing to do with you", "That’s all fine, except you lied to your children and that is where you went wrong. When parents lie and then the lie is uncovered later it forces the kids to a place where they start questioning everything you ever told them. It’s very disorienting to them.", "One part came clean though.", "Don’t know why you would want your daughter around your son if she’s repeating transphobic vitriol. Sounds like the best thing for all of the kids right now is to keep them separated until they can start therapy.", "That sounds weird. She either is the dumbest 17 y/o who still listens to her dad or she has learnt some transphobic traits and is going down from that. I'm guessing she refuses to accept your son for what he is and you don't like that so you push it all on the dad instead.", "And you think grounding someone who is almost an adult will fix things?  The second she turns 18 you will be cut off.  And depending on what State/Province your in, she already has the right to choose to live with her father instead.", "Yeah, something isn't adding up and OP is definitely hiding something.", "Transphobic Dad is trying to pit his daughter against his eldest son because he's transphobic. Mom supports eldest son. Dad needs a reason to get daughter to hate mom/brother. Dad says Mom is a liar. The lie is that Mom solely hid the origins of their relationship - but they both decided to not tell their kids how they first got together. Idk why you're trying to rationalize with a transphobe. Well, I do know why nevermind.", "Yes, they do when it comes to trans issues. Dad is transphobic. He doesn't see trans people as people. His supposed daughter revealed himself to be a son. From his hateful POV that child of his is \"lost\" not unlike if they were dead. If son sticks to his identity, he's dead to dad. \n\nErgo dad is going nuclear. \n\nThis shit adds up", "They both lied to them. So it’s pretty hypocritical calling her out for calling her a liar", "So because the ex is trying to manipulate the kid the daughter is the asshole?", "The parties directly relevant to this AITA scenario are the mother and the daughter. The ex is a massive asshole, but in the overall situation, not the AITA for grounding situation. If anything the transphobia makes the grounding stupider, since it just pushes the daughter to support the transphobic asshole ex.", "But that's not what the conflict in question is. The question was is she the asshole for grounding her daughter for calling her a liar. And yes, YTA. You think punishing your daughter for being manipulated is going to magically make her less easy for her father to manipulate? \n\nOP also did in fact lie to her! Both my parents were married before I was born, why would you hide that?", "Except, the issue is between the mother and the daughter.\n\nFor your outline to work the person the mother had been an asshole to would have to be the father.\n\nYou're essentially stripping the daughter of her agency in the situation. Which makes you the AH", "And that's a reasonable argument that really opens up a whole realm of debate about varying tolerances for parental respect and lines the mother needs to draw for herself.\n\n\nMy issue is just with the person I responded to trying to make this a mother vs father issue when it's clearly framed as a mother vs daughter issue", "The mother was lying though. Being the parent doesn’t always make you right and doesn’t give you the right to treat your child however you want. She got called out and didn’t know how to react so she basically pulled the “because I said so” card. Her daughter is 17 and not a child anymore, the mom needs to grow up and start treating her daughter like an adult, because she basically is one.", "Or you have two parents who lied to their kids and two parents trying to pit the daughter against the other parent.", "Fair enough, I guess I see the conflict as daughter vs. mom rather than mom vs. husband, so that’s why I would pick YTA even though I agree mom + dad suck. I don’t blame the daughter for acting out", "The thing is this is not about the OP and the ex. It’s about how the OP interacted with the child that is what does not make it ESH. \n\nAlso OP did lie to her kids even if the ex told the child about the lie to spite OP. OP is a liar and the child is just stuck in the middle  I don’t fully trust what OP says is truthful as she has already admitted that her affair turned into a marriage where she wanted to hide everything from everyone one and lie about it.\n\n How can we say she’s not trying to spin her self to look better and saying it’s the ex that’s turning the kid against me.  I am betting both are using the child as a pawn but this situations that the OP is talking about makes OP the AH.", ">well, no, both parents \"lied\" by omission.\n\nAnd only in the update is the husband even mentioned as transphobic. I doubt this is true or op would have mentioned it in the post.", "No I'm saying that the Ex's AH status isn't in question. Typically these posts are about either/or which one of us is the AH situations. In this one the Ex is deliberately and openly being an AH. While the mom is trying to prove why she's not one, and it isn't working.", "The fact that you think this makes a difference is crazy.  \n\nYou and Hubby #2 are both AH.  Not just for the cheating, but also for dragging your kids into this toxic mess.\n\nGrounding your daughter because your poor little feelings got hurt for being called out on your past behavior is still an AH move.", "Because a divorce is never due to a singular issue.", "He's manipulating her by......talking to her? While you ground her.\n\n\nIf you're worried about her only getting his side, then talk to her by validating her feelings, admitting you and your husband both fucked up, and talking to her about her feelings and answering questions. Instead, you ground her.", "Amelie blames out divorce on her brother instead of blaming it on her dad being transphobic. She told him we're getting divorced because \"she can't be normal\" (Amelie doesn't use the male pronouns with her brother) and dad is right about everything he told me son", "It sounds like the transphobia is his motivation to split the family. ie. us vs them.", "So... yes, yes it does when you're manipulating your child to hate her mother so you can be more justified in being transphobic towards your trans son...", "When I wrote the edit there were like three comments and they were asking about it, so I edited the post to make it clear. I don't expect to not be called an asshole because of that, it's just that I failed at being clear in my original post and people wanted to know better.", "No, one part spun a different lie. Very different from coming clean.", "Came clean and LIED about the other parent wanting to be the only one to hide it?", "Y'all are severely underestimating the power of hate. Transphobia is clearly the driving factor in this story and OP made a serious misjudgement by not making that issue clear from the start. The father hates trans people and is dragging OP through the mud (despite doing THE SAME DAMN THING) to discredit her and gain the eldest child's favor.\n\nESH here because OP DID lie. But honestly? The father is a despicable human. Easily the biggest AH of this story.", "It was not a lie, they did meet through friends.", "The daughter is an asshole for going along with the dad's transphobia from the looks of things.\n\nA 17 yo is not a little kid anymore, that's nearly an adult. And it's definitely old enough to know about bigotry. OP explained that they're getting a divorce because dad is refusing to support their oldest child who came out as trans. Despite this, daughter seems more than happy to hang around him and even wants to go live with him. \n\nYes, both parents are assholes for their continued lying and whatever this whole situation is, but a 17yo choosing a transphobic parent over her little brother is also asshole behavior IMO. ESH.", "How is it stripping the daughter of her agency to point out the shitty behaviour of her father?? \n\nI'm told all the time on this sub 'blah blah it's about the overall situation not just about the question in the title' so, this time I'm going to use it 🤷‍♀️\n\nThe guy is a transphobic ass using his kids. ESH, and that's all I'm going to say. \n\nAlso, nobody is voting on me, so your last bit is just kind of funny.", "Witaf", "I think not including the father's actions is a huge mistake here. He is manipulating Amelie and turning her against her brother and mother.\n\nThis isn't a teen randomly lashing out, this is a teen whose father is feeding them nonsense in order to turn her against her mother and brother.", "Except the issues between the mother and daughter are directly because of the issues between mother and father, they cannot be separated without losing the actual, genuine situation. The world is not a vacuum. OP’s soon to be ex is a transphobe, trying to turn their daughter against mom and brother.", "They were both lying though. They each pretended they hadn't been married before. They both knew she was married, he was her husband's co-worker!", "[removed]", "The husband was also married when he started an affair with Amelies mother so why is the mother the 'lying bitch' but not the father?", ">The mother was lying though\n\nGood reason to call the mom a liar. But not a bitch.\n\nDoubly so when we don't know what the father told Amelie: quite possibly only a half-truth to make Amelie believe only she cheated on her spouse prior to getting together. We know the father's lying already by implying it was only OP who didn't tell the kids, so who knows what else he lied about.\n\n>Being the parent doesn’t always make you right and doesn’t give you the right to treat your child however you want.\n\nFully agreed, and I never said otherwise - which is why I'm criticizing the father so much.\n\nBut a child can't expect to call their mother a bitch and not face consequences.\n\n>Her daughter is 17 and not a child anymore, the mom needs to grow up and start treating her daughter like an adult, because she basically is one.\n\nHer daughter is still a child. 17 is not old enough to be treated as a full adult. They can still be easily manipulated.\n\nTo be clear here: I don't think OP's reaction was ideal, but I can't fault her for grounding her daughter after she called her a bitch and refused to listen to her.", "The conflict is absolutely 100% mother v daughter. Pretty sure the daughter would freak out against parents and call them liars no matter what. It’s really pretty fucked up that they hid this imo.\n\nThe husband is shitty if OP can be believed as innocent.", "I don't think you can really just take the conflict between mother and daughter in isolation here because the father very much is a part of the conflict since he's the one who lit the fuse.\n\nThough yeah, mom was definitely too harsh on daughter. I can understand reprimanding daughter for calling her mom a bitch, but the mom deserves to be called a liar and the whole grounding is definitely too much given the circumstances.", "Regardless you don’t get to call your mom a bitch with no consequences just because you’re mad.", "The OP consistently mentions the son, just not outright why he's so against  the son.", "The reason I tagged onto the top comment was because the tone of a lot of the comments on here were very much making the ex out to be the 'good guy' coming clean or whatever. That's why I wanted to point out the issues on his side.", "It can be when one parent is transphobic and your child is trans. That's a serious dealbreaker.", "I mean, a kid coming out as trans and one parent being supportive and the other thinking trans people are sick is probably a big enough issue to lead to a divorce...", "Telling her that I didn't allow him to tell the truth and that I'm controlling isn't manipulative? I tried talking to her, more than once, she's set on believing whatever lie he tells her", "Her current actions are to ground her kid instead of talk about it and admit her mistakes.", "Except it isn't, the entire story is around OPs lies and the transphobia came up after OP realised she wasn't being seen as a Saint. Even then she doubles down on the \"my daughter called me a liar\" angle.", "Hey guys, look! I found Kenobi!", "Because the father is not one of the main parties in this discussion, he is an influencing factor.\n\nBy reducing the role of the daughter and magnifying the role of the father you are stripping the daughter of her agency in the situation.\n\nI was trying to be funny, so thanks.", "Except unfortunately, it's not nonsense at all -- this is a teen whose father is feeding them a bit of spin on what *OP admits to us is* *the truth* in order to turn her against her mother.", "If you can believe OP.  I think there's way more to this because the situation with her son seemed to be an afterthought.  If true it would have been mentioned earlier in the post and in a little more detail.  She sounds like a narc.", "That's exactly why it's a YTA. The daughter is being caught up in a fight between two assholes.\n\nI would argue that the daughter is the acting agent and is being manipulated by an asshole but is not herself an asshole.", "Right, but putting the father as the agent instead of the daughter is fucked up. And the daughter is made not an asshole by the father's manipulation", "This isn’t about mom vs dad. This is about mom vs. daughter. She was an AH in the way she interacted with her daughter. I am not defending the father but it doesn’t excuse the reaction of the mother.", "Not saying it does, but relationships change and you don’t get to just pull the go to your room card anymore. The daughter was justifiably upset and grounding her was def an AH move. You could maybe do an ESH, but I’m going to give the daughter a bit of grace based on what she’s going through.", "No, she deserved to get called a bitch. If parents are acting like AH's and bitches, they deserve to get called out. And yes, by their own children. I called my mother a bitch a few times and was grounded strictly for that, despite my reasons for doing so being more than valid. In my therapy sessions the last few years, my therapist confirmed me calling her that was justified, and my mom punishing me for basically telling the truth was abusive", "The conflict between mother and daughter only exists because of the conflict between mother and father. Mother and father only have a conflict because father is a transphobe. The father is the root cause of this issue. If he were accepting of the trans child, he wouldn’t be in the middle of a divorce. If they were still together, they both would have kept up the same story", "That's why I find it sus", "your post says you wouldve lied to them if not directly then by omission if they had asked how you two met. i am not sure you are a trustworthy narrator here", "Well…*did* you ever have the conversation where he suggested that you guys be honest and you refused? If that happened even once, then he’s telling the full truth.\n\nBut even if that never happened…you are *still* the bad guy. \n\n“He’s trying to get Amelie to think that I’m the bad guy somehow?” - your words. Are you incapable of understanding that lying to your daughter has led to consequences? YOU did that, which makes YOU the bad guy. Your husband can also be the bad guy, but that’s irrelevant. YOU decided to actively conceal the truth about a previous marriage from your kids. That’s why your daughter is angry at you, specifically. Your cheating didn’t really affect her, but your lying did. You violated her trust in you.\n\nSucks if your husband is trying to weasel out of his share of the blame, but you have got to accept your slice of the responsibility pie.", "OP mentioned that she’s supporting her son and that her ex is trying to turn their daughter against her brother before the edit, so there isn’t any proof that she’s making up that her son is trans for internet sympathy. \n\nAnd even if her son wasn’t trans, her ex is still manipulating their daughter, which is why this is an ESH situation.", "He is a huge influencing factor. Ignoring how he is attempting to control a child is actually unfair to that child.", "Ok, well, I'd say the 16 year old is also an AH for siding with and wanting to live with a transphobic AH. So, ESH (mom, dad, and daughter).", "He is literally manipulating her???", ">She told her that he has always wanted to tell them the truth but I didn't \"allow\" it since it would make me look bad. That's obviously a lie, but Amelie believed him.\n\nThis is, according to OP, a straight lie that Amelie's father fed to her in order to turn her against her mother.\n\nWe also don't know if the father told an accurate version of \"the truth\", or if he twisted it to make OP look worse.\n\nCalling it \"nonsense\" is an understatement.", "I didn't render a verdict, actually, but mine would be ESH.  \n\n\nWhy? Because Dad lied too but Amelie won't hear it. OP tried to explain but Amelie already picked a side based on one side of the story.", "I would argue there's virtually never a good reason to call someone a bitch to their face....that is a word intended to be an insult and nothing more.\n\nYou can be righteously angry without outright insulting someone.", "No, he never did that. Last time any of them asked about how we met she was like 10 years old. I don't think a ten year old should know everything. However, what I'm trying to say is why am I the bad guy but he is not? He was married as well, he also had an affair, he also left his ex wife for me, I don't get why he gets a pass for her", "That's exactly why I'm saying the daughter isn't an asshole and that in the situation as described by op eg Mother vs Daughter. The mother is the asshole.", "That's what I'm saying", "To be fair, we don’t know if the mother is telling the truth here either. Both parents have a history of lying. There is his truth, her truth and then the actual truth…something that I don’t believe we’re getting in this post.", "As I said, it's putting spin on the truth, and that's exactly what makes it effective.", "Agree to disagree", "You can. \n\nBut why? The literal point of an insult is to hurt someone. Being precious about certain ones is ridiculous. Obviously calling someone a bitch is insulting. That's the entire point. You insult someone to hurt them. Often, because they already hurt you. That's the entire point of it. What else do you think insults are for?", "All you can do is accept your part in lying to your daughter. Trying to push blame back on your ex - no matter how badly you want to do it - will backfire. It’s only going to make you look as wrong and dirty to your daughter as your husband looks to you, and that’ll push your daughter further away. \n\nApologize for the lying and for your temper and subsequent grounding. Be completely open about what actually happened, including your failures. Let her know you love and support her, and then let it go. The second you try to make this a competition between you and your ex, you’ve lost.", "Often people use ESH to say that multiple people are AH not just the people directly in the situation. Also although she is a kid, she is 17 and being transphobic.", "But you are a liar and you were having an affair, where she was conceived in all of this aside. A lie of omission is still a lie. Hiding it just makes you look more guilty, as does grounding her for showing her feelings.", "YTA liar is pretty accurate and you shouldn't be grounding your daughter because your angry. It may be justified grounding her for calling you a swear word.  Really I think you should have proper rules. Prison wise hopefully you don't get a long sentence because the judge didn't get enough sleep that night.  Justice and judgments not meant be like that.", "YTA for grounding her. You DID lie, be honest. The fact that you were BOTH affair partners is entirely separate from the trans issue you finally mention at the end. These both require actually having respectful conversations with your almost-adult daughter about. Don't be childish and try to play the authority card and \"ground\" her. You may have already lost her. \n\nExplain how you and your ex got together - don't be judgmental, just give her facts. And explain the core issue about supporting her brother that matters to you and triggers the break-up. Then it's all her decision.", "It’d be better if your kids just end up hating both of you and your ex husband and both of you exist alone and hated until the end. Yta and so is your husband.", "ESH\n\nI mean how your relationship began was not pretty at all but lying about it was never going to be good in the long run. You can take your ex-husband to court over parent alienation. You both chose to lie and now his transphobic behavior earns him a divorce, so he's trying to be as nasty as possible.\n\nYour daughter is obviously distraught with the divorce and whatever your ex is saying to get her on his side, but she has no right to cuss you out (calling you a liar though is fair). And the fact she's deadnaming your son and choosing to be transphobic like your ex is making her a AH too. I mean she is being influenced but she's a year shy of 18. She knows better.", "YTA for losing your patience while she is trying to make sense of all the new found facts. Clearly she is overwhelmed and cannot see things without the perspective her father has given. You should have given her some time to calm down and told her things from a neutral perspective, without trying to defend yourself.", "Un popular but her daughter deserves punishment for calling her a lying bitch.   You should be cursing at your parents.", "YTA. You could have had a constructive conversation with your daughter and instead decided to take out your insecurities and shame out on her. You shouldn’t have lied to her in the first place, but the least you could do now is apologize and own up to it. It’s good that you’re supporting your son, but you majorly messed up on your relationship with your daughter with this one.", "So let me get this straight OP\n\nYou hid details of your life from your daughter, and when your now ex husband told her the truth, she came to you thinking you're this awful person.  Your immediate reaction to that is to exert your authority over your daughter and punish her.\n\nDo you not see how all you did was justify what her dad was telling her?", "YTA because you grounded her for an opinion she had of you. can you even do that? lol. technically you are a liar...  but so is you ex husband, so i dont understand why your daughter only has a problem with you. why does your daughter even care what happened before she was born? if my parents told me this information i honestly wouldn't care. i'd just be thinking well thank God it turned out the way it did and i'm here. just don't let her make a huge deal out of the issue. if she tries to start an argument over it just blow her off. if you don't let it be a big deal she'll start to feel stupid and immature for bringing the issue up.\n\ni honestly believe your daughter just wants an excuse to take her father's side in the divorce. she doesn't care about your past, she's probs just gets more attention form her dad and doesn't want to deal with the all the attention going to her trans sibling as he makes this transition. it can be a big change in the family. maybe she just need the \"normalcy\" and attention her father can provide her rn.", "YTA to you and your soon to be ex husband. You're both AH's\n\nYou seriously grounded a child for being upset at discovering that she was the result of two cheating AH's who had an affair? Jesus chrsit listen to yourself. Yeah, it does sound like the soon to be ex is influencing her, but then again we're only hearing your side\n\nOn top of this, you cheated, as well as he, and kept it hidden all this time? Idk, it's a little twisted, but, Karma? Suck it up. Lie in the bed you've made", "YTA here for retaliating against your daughter.\n\nYou are a liar. You orchestrated a continuous deception for the entirety of your children's lives. You thought it was the best course for your family, but it blew up in your face. That's not your daughter's fault, though it appears to be mostly your (soon to be ex-) husband's fault.\n\nYou blundered here. Hopefully you can bridge this gap with your daughter, but not by denying your own wrong doing.", "YTA. Accept you are getting divorced, stop worrying about that now and put your kids first.\nOne a side note I don't really see why it matters to you, your ex or your teenager how she was conceived. The only thing you need to make ear to her is she is loved. Pretty simple. Start with an apology.", "Okay, but how you reconcile wanting to validate your child's feelings without letting them slide for calling you a lying bitch?\n\nIf the ex made everything up full stop, and there was no affair, would the mom be more entitled to punish her daughter for using this language?\n\nIf the daughter's partner broke up w her, and the upset daughter wanted to vent to her mom, and her mom said she would be home at 5 but got home at 6 and was called a lying bitch, would punishment be appropriate then?\n\nI am adult male, but I would assume if myself or my siblings used this language to my mom, whether as kids or adults, it would permanently affect all of our relationships.", "> You can't be mad at your kid for calling you a liar after you admit you lied to your kid.\n\nExcept she wasn't lying. The daughter called her a liar, not about lying about her previous marriage/how they met, but because the dad said \"I always wanted to tell you the truth, but your mother made me keep it a secret\". When mom said that's not true, the daughter called her a liar. We have no reason to believe that's untrue. Therefore when OP was called a liar, it was not correct.\n\nAlso, what's with all the people mad that the parents hid the truth about how they met? Why should they tell their kids \"Oh yeah kids, your dad and I met when we were married to other people and we started fucking each other. Yeah our relationship started as an affair! Alright, now lets sit down to family dinner!\"  If that was how my marriage started, I'd never tell my kids either because IT'S NONE OF THEIR FUCKING BUSINESS.", "You don't get to call your mom a lying bitch without getting in trouble lol", "I think she grounded her for the “bitch” part", "I don’t see why the parents owe their kids any explanation about a long ago relationship. If my teens got mad at me about a previous relationship I’d tel them to stop being so entitled. She shouldn’t have grounded her daughter, like have a conversation but with the little info we have that seems to be the problem", "You’re being unfair, I think.\n\nThe “truth” isn’t the problem. OP’s ex’s version of the truth and attempts to poison the daughter against the mother is.\n\nAnd she didn’t ground her 17 year old daughter over the truth. She grounded her for calling her a “lying bitch” and behaving like an angry teenager who is being manipulated by her homophobic dad.\n\nThe teenage daughter is immature and acting out. Mom is doing the best she can under rocker circumstances. \n\nFrankly, your take on this is ill-informed.", "Teen wolf??????", "This. OP, apologize to your daughter. Be honest. Tell her you both lied, but you're ready to tell her the truth and answer all of her questions. If you have any pictures from the past or any proof, emails, whatever, print it all out and show it to her. (As long as it's age-appropriate.) \n\nYour daughter's world has been turned upside-down. She's looking for answers, and your ex is giving them... if not incredibly skewed answers. So, what should you do? Punish her for wanting to learn the truth? No, give her as much of the truth as possible, so she doesn't continue to go to her dad for answers. Tell her moving forward you will be honest with her. Answer her questions until she runs out of them. Volunteer to answer any other questions she might have.", "It’s never ok to call your mother a bitch wtf", "Well this daughter also taking sides and being brainwashed against her brother who is trans by his bigoted father. This divorce is only happening because her son came out as trans. So yeah emotional responses prob happen here I think. ESH for me cuz I will not call her an AH for supporting her trans child.", "Well, he's a cheater too, should she not talk to any of her parents? I know it's wrong, I apologized to my first husband when I told him, we were on very bad terms for a while but after some years he had forgave me. I just don't want her to be manipulated by him anymore", "Honestly in moments like this id continue to have a calm discussion. This child is in a rough situation. She has parents fightings and trashing the other while also sharing their lies. Id explain my side while being honest. This isn't because mom took her toy away.", "Honestly that sounds like words straight out of the dads mouth. Im pretty sure in most states what the dad is doing is illegal if youre in the middle of a custody battle and its called alienation or something. \n\nYou arent allowed to manipulate your kids and turn them against the other parent. People are calling OP an AH but I really dont see how they are. This is a fucked up situation where the ex is pouring gas on the fire of a late teenager riding the emotional rollercoaster of parental divorce\n\nIts no surprise hes a transphobe too", "She's 17. I can't wait for her to go to college and get out of this household.", "So much this!", "Did she explain why she thinks she has any right to that information? I understand she's shocked and that was deliberate on your husband's part, but does she expect a comprehensive list of all of your relationships before she was born?", "You lost your temper and felt desperate to get control of the situation so you fell back on the tried-and-true parental choice to punish your kid. Definitely not the best choice, but I think you know that. \n\nYou could have sent your daughter to her room to cool off with the understanding that you’d talk to her when she wasn’t so upset, but you didn’t. Instead, you were hurt and you chose to lash out with intention to hurt her back. You probably had some embarrassment and maybe guilt or shame that contributed to your knee-jerk response. \n\nI don’t mean to insinuate that you need to accept being called a bitch, but your daughter was spinning out and needed something other than a punishment at that moment. At her age you can’t just depend upon grounding or other punishments to shut down a situation you don’t like, because it’s simply not effective for the intended purposes. What do you think you actually taught her by punishing her?\n\nYou can’t make her “see” what you want her to see if she isn’t willing to look, and she isn’t going to look if you continue to shut her down with punishments instead of supporting her as she questions everything. She’s had several bombs dropped on her lately and is naturally questioning everything she’s known. She definitely could have handled it better by refraining from the name-calling, but remember, *she* is a teenager. Support, not punishment.", "You’re the adult and the parent.  Be better.", "You definitely made a mistake losing your temper. Adults aren’t perfect. Just apologize to your daughter now that you both have had some time to cool down, return her phone and have an honest discussion with her.", "She called you a “bitch” because you’re acting like one, and a “liar” because you did lie to her. At least someone is the family is telling the truth. You are NOT the victim here, your children are. YTa", "The daughter is 17 if she wants to live with the dad no court is gonna block that.", "Even then. I still find it weird for your child to act out about it.\nMy parents cheated on each other all the time...alot.\nThey had fights where I had to hide and hear it all every other week.\nI didn't care about the cheating because it wasn't my business. \nSo, to be this mad about a relationship that happened before the child was born, it just seems crazy to me.\nWhether you 'allowed' him to tell her or not.\nWhy did it even NEED to be told?\nI have no advice, just fascinated by why it's a big deal in any scenario.\nI'm hope things get better for all you guys fast!", "Problem is by 1) pushing for sole custody of all children she sees that her dad is going to end up all alone. 2) you don't let her air grievances with this situation while her dad has the capability to do so.", "So you want to manipulate her instead..? Drop the bullshit.", "Is everyone defined by the worst thing they've done in their past?", "Don't forget to mention that OP is using her trans son as a cop out to justify her forcing her daughter to pick between the two parents, with the argument \"he's turning you against your brother!\"\n\nLike, have faith in your kids relationship with each other. They can talk this shit out themselves. And if they come out well, that's why Coming Out is famously hard to do. It shouldn't have to be, but fact is you have friends that are bigots and either you don't come out and keep them, or figure out they were never real friends/family anyways.", "I disrespectfully disagree, lying is an insane way to build a foundation in any relationship, how your parents met matters because you might not know this based on your comments but the way parents relate, their relationship, shapes the way their kids view love and romantic relationships, it matters cause they lied, and were dishonest, finding out your parents had an affair and cheated on their respective partners, lied for your entire life is insane, and the fact that y’all can’t understand how your parents being dishonest for years ruins a relationship is crazy, she is an asshole, I’m not going to shame her for cheating cause I personally believe things aren’t black and white but they were wrong and everyone is giving good criticism and it’s not because “she used the magic words” some people see their parents as more than just parents, they are people who we look up to….so Yh, your comment was quite stupid actually", "Dad is a marriage destroyer twice over", "uh, are you okay?  They *both* destroyed their original marriages to be with each other following an affair. They are both homewreckers", "I would expect to be grounded for calling my mother a lying bitch when I was a teenage. She can be angry, but she needs to learn to express it in a more healthy way, and consequences are how people usually learn.", "> Actions have consequences.\n\nAnd the mother is learning that lying to your child for over a decade has consequences.", "This. Unless her father was your first ex, it’s really no one’s business.  \n\nIf I’m understanding correct, she’s not upset the two of you cheated, she’s upset because she thinks she had a right to the info.", "If they don't bother at all to become better, yeah", "Yes. I wonder if he managed to squeeze out a few crocodile tears when he was telling her how much it hurt him to keep this secret all these years. ESH", "I mean sure if you believe what the cheater is trying to say yeah", "The onion peel method is a really good way to explain it, as a visual it works well, I like it.\n\n(Now I want to rewatch Shrek though)", "I would completely change how I view my parents if I found out that not just did they have an affair, but that I was the product of an affair. You can dismiss it all you want for yourself, but don’t deny that objectively or is not relevant.", "My parents will celebrate their 40th anniversary this summer. They never ever lied to us about their past. In fact, the puppy love they had before, where and when they met, how they begun to know each other, their first dates, etc., they were always very open and transparent with us (details being kept age appropriate when we were kids obviously!). \n\nBecause this is how you teach kids that family and relationship should be built on trust and respect. By example. (Of course, my parents have no reason to be ashame of themselves and know we are smart enough to ask family and friends if we have unanswered question, so there is that).", "How you met might not seem important to you, but to someone who is wants to trust you (like your daughter) it is clearly important. \n\nStarting a relationship by cheating is indicative of someone who can lie & is not trustworthy, so by continuing to lie about it you further solidified that you were still not trustworthy. That is what I would take away from that, as a child in that situation.\n\nAlready that was shaky ground, but then, when she found out the truth & addressed this with you, you punished *her.*\n\nInstead of owning the fact that you lied & apologising to her, which would’ve shown growth, maturity, & that you might have changed & become more trustworthy, you doubled down & punished her. That isn’t how you mend fences. All you are doing is pushing her further away. \n\nYou are the adult here. You should be able to take accountability for your actions, & apologise to your child when they find out you’ve lied to them their whole life.\n\nThis may sound harsh, but I really hope you listen to some of the people here who are sharing their perspectives, so you can mend the relationship with your child. \n\nI know what it feels like to be the child in this scenario. I found out one of my parents lied to me my whole life about something important. My parent cannot take accountability, they simply seem unable too, & I will never get an apology for this. I no longer speak with that parent. Please hear me when I say you are potentially jeopardising your relationship with your child. If you care about her, try to meet her where she is, take accountability, & make amends.", "I remember vividly when my mom told me that she had been married before. I think I was 12. She had gotten married very young, a decade before she met my dad, and the guy turned out to be an alcoholic so she left pretty quick. I was SHOCKED, and very surprised why my mom had never told me before— I guess she thought I wouldn’t understand. But I felt like she had hid a chapter of her life from me. It also felt strange that everyone else in the family must have known this about her except me. \n\nMy mom probably should have told me earlier, but she handled it right— she told me when she thought I was old enough to understand, didn’t try to hide anything, and was open about the relationship before. She even later showed me pictures of her first wedding day. And this didn’t come out in the context of a contentious divorce— my parents are/were still together.\n\nI understand why your daughter finding out in this way was upsetting to you, and why what she said was hurtful. But if you can’t understand why this information would be important to your daughter, you’re not exercising enough empathy. (And I think you know it IS important, because otherwise, you wouldn’t have hid it). I don’t think any person in their right mind would have taken that discovery much better than she did.", "Apparently, it’s pretty important to your daughter, though.", "This is what parents need to realize. At some point their kids will be adults who will be able to think and reason and so on. They will evaluate things from their childhood.", "Thanks for clarifying, I had the impression they would have been short marriages. Divorcing without children is comparatively simple and I can totally see why you’d put that past, short relationship to rest as a bit of a “non-event” and move on with your life.", "Holy shit you couldn't go five months without fucking someone else?", "You cheated after 5 months??? Wow you're a piece of work", "There’s a difference between protecting your privacy and being a chronic “liar”. She may not have considered it to be any of her child’s business or may not have thought her child was old enough yet to have a discussion about the complexities of marriage and relationships. Keeping in mind that children will share this knowledge with their friends and therefore possibly the parents’ friends is another consideration.\n\nIf a five year old asks “where did I come from?” do you give them a play by play of what sex was like when they were conceived and then show them a video of the birth? Or do you choose age and privacy appropriate words to explain how they were conceived and born? Not giving full details or withholding private information from children doesn’t make someone a liar.\n\nThis might have been something she planned to discuss once her children were old enough to start dating seriously themselves and mature enough to discuss marriage, commitment, cheating, dysfunctional relationships etc. which would be a more appropriate time to pass on any wisdom learned from her previous relationships.", "Lmaooo yes they very well can and especially if they’re transphobic", "Tjen she is a bigot like her father. What both of you did is wrong, not telling your kids you were married is wrong. \n\nBut in this case your daughter needs therapy and so does your son seeing how his father and sister reacted.\n\nAt the end of the day is easy for me to say it but I would tell your daughter ok, if at her age she isnt able to accept a trans person on her family... Just stop being a family", "They're both cheaters", "Classic reddit to label only the woman as a lying cheater who can't be trusted when the man did just as much lmao", "She's not a product of an affair, I don't get why would she believe that", "True! They're both trash... I can't really sympathise with them\n\nEdit: I can, however, sympathise with OP for divorcing trash hubba because of his transphobia", "I honestly don't believe a word that comes out of OP's mouth on that part. She's already proven herself to be untrustworthy", "It’s worse, actually - the literal honeymoon was barely over before she started cheating.", "Considering she’s now been married for almost two decades and cheating is not why they’re getting divorced I’d wager that yes, she could.", "So we agree on the same thing I just worded it differently. I’m not saying, she should’ve told them when they were young I’m saying eventually she should have told him.", "That seems to be the plothole in this story.", "Guess I should be lucky my dad is rather understanding of most things. It’s inconceivable to me a father could be that callous to their own child.", "> Just stop being a family\n\nThat seems to be what she voted for already.", "So brother is trans>dad reacts to it>divorce happens>sister blames brother.  She is blaming what (in her mind) is the root cause of your divorce.", "Your daughter is going through 2 divorces right now you do realize. Not only is her life falling apart bc her dads a transphobic asshole but she finds out you yourself are also a homewrecker so now she knows both of her parents can’t be trusted. Good on you for being there for your son but you don’t get to punish your daughter for having a moral reaction to your shady secrets. Do you have any idea how sickening it is to know you were created bc both of your parents ruined their marriages", "This is probably one of the stupidest things I've ever read. Your (you and your husband) problem is deeper than him being transphobic, and you fail to acknowledge that. It makes me sick, how one sided the first sentence is.\n\nHe is an asshole for putting his incredibly stupid beliefs over his child. You are an asshole because your other daughter is just a trophy you need to win. Instead of admitting your faults and being honest with your daughter, showing her some love and trust when all your children need it, you just need her on your side against her father.\n\nOne of my friends had a coming out and is recently going through therapy. He was pretty much determined and reconciled with everything, but his two brothers had a really hard time understanding everything. It can be really difficult for siblings too and you should know that.\n\nSo don't you fucking dare to hide everything behind your husband being transphobic. Pull your head out of your arse and be honest with your own children for once.", "Okay, if that's the case that sucks. But it seems like daughter is mad in general, probably very confused, and instead of a rational reaction from mom got typical disciplinarian tripe and has likely doubled down on whatever misinformation she may be being fed. This situation sucks on stilts, man.", "The wording in your post read that way.  But the fact that you focus on that and not everything else that I said is telling. And it doesn’t change my point - if I found out that my parents’ relationship started as an affair, I completely would change how I view them. Including their role as any kind of authority figure. Like it or not, the origins of your relationship with your ex are relevant to how your daughter views you, as both a parent and a person.", "_\"We had an affair before we got divorced to start dating. Amelie was born shortly after we got divorced.\"_", "Yes she is. You were having an affair, and she was born shortly after you got divorced from your first husband. Unless she is your first husband's daughter, she is the product of an affair.", "Edit your post to clarify the timing of your daughters conception and birth or people are going to still jump on this.", "Yeah, no. They did not meet through friends. They met through her HUSBAND. There's a big difference.", "I agree. It’s not a lie. But also you’re parent’s marriage isn’t your, as a child’s business, in this context.  What happened before you were even alive is not something you get to be mad about. \nEveryone needs therapy in this family. Every, single one.", "Not just that, how is everyone justifying that a Child calls her mother a bitch? If i do that i get the hell coming", "They didn't specify the daughter supported the father's xenophobia. Given that OP has lied before, they could be lying about their husband as well.", "My dad got a girlfriend it also wouldn't surprise me if he was transaphobic  The guts my Dad I'm not going to cut him out my life. Its abit harsh to expect somine to disown there famly.  Besides the mum is pretty much a liar.", "The father is a liar but this is a question about whether the mother was an AH when she grounded Amelie for calling her a lying bitch not whether the father was AH for lying to his daughter. She was lying and she wasn’t happy to get called out on it.", "When your parents don't act respectfully and lie to you about it, they have earned negative respect.", "Being a parent doesn't make assaulting your child acceptable.", "I’m 47 and I cannot even entertain the idea saying that to my mother. She deserved far more respect than that.", "But it's none of the children's business.", "This is sadly what happens when 2 liars are fighting. There is always one who goes out to say partially the truth to the people they lied to, to keep their trust. Play a very stupid game, win a very stupid price.\n\nNot saying your ex-husband isn't a disgusting person, But that doesn't excuse that you also lied to your kids all their life. And it's hard to rebuild trust after that.", "When you tried talking to her, what did you say?\n\n\nUltimately, being the first to tell her is going to count for a lot. Especially to a 17 year old who likes to themselves as a mature adult. But it sounds like you're just arguing with her that her dad is trying to manipulate her instead of admitting you fucked up, too.\n\n\n\"Hey, we fucked up. We both did a bad thing and we both decided to cover it up, that's bad. But we both love you and are here for you if you want to talk about it.\"", "YTA. Instead of owning up and admitting that you were wrong in punishing your daughter for  being angry about being lied to all her life. All I see you doing is commenting constantly is about how her Dad is manipulating her. No accountability for your own actions towards her.", "Her dad is also a home wrecker? They were both married and cheated on their partners with each other.", "I got pregnant with her after both our divorces were over, so I really don't get it", "I got pregnant with her after I got divorced", ">What happened before you were even alive is not something you get to be mad about\n\nIf it goes to somebody's character as a person it does and more so if they lie/mislead you about it once you are alive.", "The parents made it her business when they started using their past as means for her to pick which one to live with", "I disagree, they lied to those kids every day of their lives. It doesn't matter that it wasn't their business, they still lied and now the kids know. They destroyed any credibility or trust those children had in their parents and left them adrift. Now they are both using the children as ammunition in a divorce... It is awful for those kids. Sure the dad is a worse villain, but that's cold comfort when their mom has also lied to them every day. Now the kids have no one to trust", "Right?!?! I see posts where kids call their parents that, or partners! I'm like \"Ohhhh hell no!\"!!!", "Her mom was a cheater so it's not like it's a lie to call her thay", ">Given that OP has lied before, they could be lying about their husband as well\n\nBy this argument we should disbelieve the entire post. We can't trust anything the OP says so there is no basis for any ruling whatsoever.\n\nNot telling your children that you met your husband through an affair is different from lying about your ex not accepting your trans son to a bunch of internet randos.\n\nThere is no reason to believe that the OP is lying about the reason for their divorce.", "Transphobia.\n\nAnd third paragraph states that ex is trying to turn the daughter against her AND THE BROTHER.", "But she's already disowning the brother? It's fucked she has to choose and the Dad shouldn't be making her but she's choosing the bigot.", "Not accepting blatant disrespect is not pulling the mom card, it's expecting the respect that's due to her.", "All of that has literally nothing to do with the topic. The parents lied to their kids (which is the cause of the daughter’s dissatisfaction) before any of that occurred. We have no idea which of them to believe as far as blame goes. General evidence points to the father being shitty and probably lying about how it’s all the mom’s fault. But both of them still lied to their daughter. So no matter what, it’s YTA. Because the daughter is angry about something just and expressing herself, and OP is asking if she’d be TA for punishing that expression of emotion.\n\nTldr: the father doesn’t matter for judgement, the topic is the mother and daughter.", "Correct which means her entire life has been a lie. She believed her parents were normal people. Now she finds out they’re both not so much. She needs someone to blame for her parents divorce so she blames her brother bc mom is protecting brother and daughter wants to feel like someone cares about her too so she sided with dad and places the blame on brother when really this divorce is bc of dad but finding out both of your parents have ruined their marriages before it’s a lot to take in and not something she should be punished for. The grounding should be for the transphobic comments which isn’t related to cheating parents at all. Op punished her daughter for having an opinion on what kind of person she is. Op needs to realize her days of her daughter thinking the sun shines out her ass are over", "It’s the ambiguity of the word “shortly.” People are reading “born shortly after” as happening a few months following the divorce, rather than 9m+. While the ship has already sailed a bit here, you can ease the ambiguity in the future by instead saying Amelie was *conceived* shortly after the divorce.", "That's not what you said in your post.", "It is wrong to call her mom a bitch. \nDad lied for years too. He's just now changing the narrative to look good.", "As long as you think it's okay for the daughter to call her dad a lying bitch too.", "[deleted]", "Reading through she doesn't seem to have disowned her brother", "She lied to her daughter about an affair. Anybody who does that deserves at least the liar part.", "You are the female role model. Every right and wrong you have ever taught her was just thrown out the window so she feels she can’t trust you and needs atleast one parent to lean on. Your son has you to lean on which means she has no one bc you are too busy protecting your son from his father. You all need therapy and you don’t get to demonize your daughter for having an opinion about you being completely dishonest about your past and how she was concieved", "Shortly after?", "Thats exactly what she said in her post.  She got pregnant shortly after her divorce. When she and her hubs were dating aparently.", "LOL yeah every post on this sub is \"according to the OP\". If you're gonna not believe anything in the post then why are you even in this sub?", "She's siding with and going to live with the transphobic Father, how is that going to maintain a relationship with him? How is that not disowning him, you can't have both.", "Hey bud, that’s called lying 💀", "I guess my point is there's never really a good reason to insult someone or to go out of your way to hurt someone's feelings. \n\nBut if you wanna be known as an asshole, certainly have at it. Your prerogative, I guess.", "This thread is now locked due to an excess of rule violations. \r\n\r\n[Sub Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/) ||| [\"FAQs\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)", "You ARE a liar, as is your soon-to-be-ex.  Also, YTA", "I'm shocked the affair couple is getting a divorce lol. \n\nYTA for this and for feeding into your daughter's mental illness. Good for dad for pushing back on this cult. You're only going to make your daughter's mental health worse, so congrats (:", "NTA.\n\nIt's certainly within your rights to ground a child for disrespect.  That's the least important part of this situation.\n\nHowever, grounding her for being disrespectful just plays into your ex's plans.  He wants her on \"his side\" so he is trying to make you the bad person.  Grounding her just makes her want to go live with him more.  And frankly at 17 any judge is going to say she can do what she wants.  I suggest you return the phone, lift the grounding, and start treating her as if she was already 18.\n\nYou can admit that both you and your ex did not tell the truth about the start of your relationship.  Then you can say it's not something a young child would understand, and it is simply hard to decide when to tell the whole story.\n\nBless you for standing firm for your middle child.", "NTA.\n\nThe sanctimony in this thread is hilarious. Don't worry about the judgment, you didn't owe your children an explanation, and your daughter is upset about the divorce, not that she didn't know you two had an affair.", "What is your goal in all this? To have a relationship with your daughter or to be “right”? Grounding her sounds like the surest way to make sure she never talks to you again as soon as she doesn’t have to.", "ESH", "ESH, karma never fails huh", "Why is it obviously lol I did he said that?  What goes around comes around. YTA", "This is clearly ESH. \n\nYou both were awful cheaters. Now he’s twisting it to be your fault, which makes him an extra AH because he is responsible for his actions. \n\nAnd you’re divorcing because your son is trans and ex isn’t supportive. You’re protecting your son, BUT if your daughter is taking dad’s side and also taking his transphobic stance, sorry but she’s 17, you need to protect your son from bigot and bigot junior.", " The only answer here is ESH and family therapy is needed.", "Get off Reddit and speak to your custody lawyer, whatever their title is.", ">I can't really stop her from seeing him whenever she wants because our custody agreement is not over yet\n\nThis line just says so much about her personality. The daughter is 17, it's not like OP gets the final word lol", "I’m not seeing how this any of the kids business. It happened 20 years ago, no previous children, no ties to the exes. I don’t think the kids need to know anything. The husband got nasty and decided to tell them and now he is putting his children against one another. That’s the drama of it", "They both had an affair, but the kid thinks her mom is too blame for everything... me thinks he painted everything BUT the truth.", "Agree just want to add the dad is TA too.", "the daughter's about to turn 18, so the custody agreement really doesn't matter. grounding her is only cementing her choice to stay with her dad once she has the choice.", "Accept the anger? So it's acceptable to just go around calling people names and cursing at them because you're angry? Good to know because I think I need to have a conversation with my boss asap.", "Some people here thought she was a \"product of the affair\" so someone else advices me to make another edit so people won't get confused", "She wasn't conceived during the affair, it was after we both got divorced", "I don't see how OP is trying to weaponize any of the children, could you explain that point of view?", "Why does she suck? Why would it even matter to these kids that their parents were married before they met each other?", "E S H implies the daughter is an AH as well, which she isn't. So it's YTA for OP and the soon to be ex", "If she wasn't a product of the affair, why did you describe her as being born \"shortly after the divorce\"?", "Your marriage is the product of an affair though.", "Daughter is a hateful 17 yo. Still an asshole", "I am always SOOOO suspicious of \"updates\" like that...it seems they only come after verdicts posters don't like.  \n\nI mean, if it's true, it's pretty important information to include  from the start. \n\nOP is YTA, largely bc I'm not convinced by the \"updates\"", "The dad was married and had an affair and left his first wife too.", "I'm surprised so many people are saying she should have told the truth. Why are they obligated to tell the kids something that happened before they existed?", "Perfectly normal TK hide something like that from kids. But the daughter calling her mom a bitch is not. Grounding absolutely deserved.", "they both lied. They both had an affair and both were assholes. \n\nHowever here, it's so obvious husband and daughter are AHs", "You are so one sided", "yeah I’m very confused, why does her parents past relationships matter so much, especially when the daughter doesn’t even know any of the other spouses? it happened 20 years ago, people change and grow up.", "how come the 17yo gets a pass for being transphobic and calling her mom a bitch at 17, and OP doesn't get a pass for cheating when she was just 5 years older? \n\n23 year olds make stupid mistakes too. the ex was a lot older and more mature at that point. not sure why his cheating isn't considered just as bad, if not worse than hers.\n\ni really don't get why the kids needed to be told about the circumstances of their meeting. i don't feel like i have the right to know about every bad thing my parents have done!", "I have an incredibly strong feeling that this woman just plays the \"but he's transphobic\" card over and over to cover her shit.\n\nThe daughter obviously has no idea what is going on, so she just trusts her father. Instead of trying to get her daughter to understand what her sibling is going through, and instead of bringing them together, the mother grounds her daughter for her own mistakes, which further divides the siblings.\n\nHe's an idiot who doesn't love his child enough to put him above his stupidity (transphobia). She's an asshole for treating her other daughter like a thing that she needs to win to prove her husband is idiot. The daughter turning transphobic is the mother's fault too.", "The daughter is blaming what in her mind is the root cause of the divorce. If it wasnt transphobia and was some other thing that would be the issue at play.", "I will just point out, that information came from an edit\n\nRule of thumb on this sub. If information is provided within edits, that would change some peoples vote, take it with a grain of salt. That information had no reason to have been left out of the main post, and was added much layer, when people had already mass voted YTA", "Actual brain dead take its mindblowing. You literally know nothing about the dad other than an edit made by a women clearly not known for telling the truth and living an entire lie to manipulate her children. It’s actually mindblowing how all she has to say is “transphobia” and it’s like your brain shuts off. \n\nYou the type of person to blame a child born in a cult for not supporting gay people.", "I agree. Plus, the daughter called her mom a lying bitch! I couldn't talk to my mom like that now and I'm in my 40s! ESH is the right answer.", "But that’s not the question…everyone seems to forget to answer based on the question, not the story. Yes the husband is an asshole for that. But it’s not the question", "Then don't lie egregiously to your kid for all their life.", "If you were a cheater you would deserve to be called such", "So where are the consequences for the father lying for over a decade, as well?", "We live in Mexico, it's very bad here. I honestly did wrong because I ignored all of this, my son (before he came out) would tell me some stuff, but I didn't have much information. Now I know how bad it is and I feel terrible for trans people here", "I will point out that the post was posted 5hrs ago and I responded 4hrs ago. The post only had 200 upvotes when I first saw it, and the edit was already up.", "Yeah, the husband sucks for sure and the situation is bad. But, regarding her daughter, she 100% handled this poorly and is punishing her daughter when she is understandably upset about the situation. Punishing her for this will only push her away even more and is the only thing that makes mom an asshole too.", "Correct, they both lied and ESH.", "Why is it any of your concern what two adults did before you were even born? People are ragging on op for not telling the kid they were married before. Why does it fucking matter? Frankly, it's none of kids mfin business. 🤷‍♂️", "When it comes to lying, this seems like a pretty reasonable thing to keep secret from your kids.", "So kid, being nearly an adult, should ABSOLUTELY be held to a higher standard than you would a child throwing a temper tantrum. It doesn't say that kid *tried* being civil and was stonewalling by op, it states that kid jumped headfirst into the fuckhead well and went straight to 11.\nDid op handle it correctly? No, likely not.\nHowever, one of the best conflict resolution resources is removing yourself from a high tension situation and letting both parties in conflict cool down. After telling kid to go to room and giving time to calm down, op should have tried to initiate civil conversation to rectify situation.  But kid should not be allowed to be disrespectful due only to having big emotions.", "I stand corrected. Ty for the information. I'll still personally always take edits with a grain of salt, but that does make it less likely to be the case that it was an intentional lie to change votes\n\nAt the end of the day, both parents are still both AH's. And I hope the daughter is only being twisted, and doesn't actually hold hateful views towards her brother", "It does not matter. I don't understand why people feel that children have the right to have an opinion on complex adult relationships. If she was older and her parents used that information to guide her through the same kind of situation then that's acceptable, otherwise it is their business.", "Probably because of the part where OP says that husband told her daughter that he wasn't allowed to tell the truth so all the fault is going to OP.", "You earn respect.\n\nYou also earn disrespect.", "Sure, but when your child finds out and says you lied to them you can’t go all shocked Pikachu", "Why is it anyone else's business what happened before kid was born? Op doesn't *OWE* kid any access to her history.", "once a kid starts calling anyone a lying bitch,..it stops veing a conversation.", "Some parents need to hear it. Preferably once you no longer rely on them though. My mom used my credit and destroyed it without my permission, she deserved the chewing out she got for that just like anybody else would if they stole somebody’s identity.", "Especially when the parents didn’t seem to outright lie they omitted the truth. But also at what age do you tell your children you have an ex husband who’s completely out of the picture that you cheated on with their dad? Not really an appropriate topic for a toddler. And It’s not like the dad didn’t know about the husband either. \nEdit: or cheat on his own ex wife", "I think she should. He deserves it to and also more for being a bigot", "As opposed to what? According to the President of Burkina Faso?", "CONGRATULATIONS, WELCOME TO AITA!\n\nWhat do you want, a cookie? Ffs, what are you even doing in here if you're going to spin a tale in your own head to fill your own narrative?", "Withholding information that isn't any of kids' business does not make op liar. Op doesn't *OWE* kid a damn thing in the way of, \"Oh, this is my past. These are my mistakes,\" etc.", "Sorry but no. Daughter is OK to be angry. But it takes two to tango. Dad is lying out of his ears and you and daughter are both painting it as OP being the mainline factor.\n\nIt takes 2 to cheat. He was a part of it and now is trying to save what face he can because if he doesn't he knows his relationship with his daughter will be irrepairably damaged. \n\nI'd apologize yes. But I would not accept anything until the yelling has died down and they speak like two people that have common sense. ESH at best.", "I agree that the mother is lashing out and that she's the asshole here, but it doesn't really seem like the parents previous marriages is any business of the children here. It seems like the dad did bring that up just to stir up drama, really.\n\nGrounding a 17-year-old is a little bit laughable in itself, especially when there is custody up in the air and When she'll be an adult in less than a year.", "Best take in this whole shitshow", "wow - just checked - it was def used in the teen wolf tv series (never knew it was a tv series - michael j fox will always be teen wolf to me!)", "Exactly. It's not anyone else's business what happened in people's past. Unless they *CHOOSE* to share that with people.\nKid isn't excused for shitty behavior just because kid feels justifiable in anger.", "English is not my first language, I thought shortly after the divorce would be easy to understand as she was conceived after the divorce was done", "As I stated above ESH means OP is still an asshole… so. Bases covered.", "NTA, She may be a confused teenager but, I don’t understand what you and your ex’s previous love lives have anything to do with your current children. They’re not related in any way. Why does your daughter care so much about how you got together? It’s really none of her business what you did in the past, (unless her father is someone else.) Stand your ground, calling you a lying bitch is unacceptable, and she should be grounded for that.  Maybe she thinks you treat your son special because he’s trans and she’s jealous? When she’s calm, maybe you can ask her why she has an issue with her brother? It is hard to be Trans, and you’re doing the right thing sticking up for your son and protecting him. You got this mama! 💪", "Being in a bad situation and being \"justifiably angry\" doesn't excuse shitty behavior. Kid is nearly an adult and so should be able to act civil and actually *attempt* to find out other side of the story. But it doesn't say that happened.", "I despise my mother for what she did to my family, tearing it up, making us poor with bad choices and bad gambling habits, for not caring that I had childhood asthma and still smoking a carton of cigs per week around us.\nAnd even with all of that, I still wouldn't disrespect her by calling her names and throwing a temper tantrum like op's kid.", "NTA you should have put the edit in the optional post and you will had a different answer from most people.", "Not the asshole!", "I already did, we spoke yesterday after all of this happened", "But it's the daughter an AH? Because the conflict here is been mother and daughter", "Yes, but again this isn't about the ex...of course the ex is an AH.\n\nThis is about the mom and daughter.", "> you still have a) a dad who lied to his kid for years\n\nboth parents lied to their kids about how they met", "Her feelings never require disrespecting her mother.", "Her mother has disrespected everyone as well. I'd debate the daughter has done far far less wrong than both her parents. Id be pissed as well.", "See I get it but that’s just not true.\n\nThe daughter is absolutely a victim. The party here is the mother and the daughter. The ex in my opinion isn’t a party to this dynamic.\n\nIn this case ESH, would mean the mother and daughter are shitty. Which I simply don’t believe.", "I don't think the kids are to blame for anything here so I wouldn't go ESH but both parents are major AHs here.  Affair / cheating / Didn't have kids so we just through out the photos and then lied to the kids for all their lives.  The parents have acted horribly.  No wonder they walked from two marriages for an affair and then are now getting divorced again.", "Okay I will, thanks", "I'm going to play Obiwan's \"from a certain point of view\" card on this one.  \n\nYour relationship with him began as an affair. Your divorces were finalized and you conceived her from the same relationship that began as an affair.  ergo, she is the product of an affair.  \n\nIt's kind of a nuance but she's not completely wrong in the belief.  It depends on how you consider the relationship.", "I see, I didn't know the word \"conceived\", I'm guessing it means \"concebida\"?", "YTA\n\nYour daughter called you right.\n\nEdit: Y T A\n\nEdit: Y T A", "You don't deserve her or the other kids either.\n\nHow many homes have you wrecked at this point? At least two going by the story you posted...", "YTA you lied that makes you a liar. Don’t use the “because I said so” card like do you realize how annoying that is. Daughter is 17. I get not wanting to be called a bxtch—but your behavior caused it. I couldn’t imagine getting grounded over how I felt.\n\nBoth parents suck imo.", "YTA. Assume what you did and talk to your daughter. You are gaslighting the relationship and making things worse. You are abusing your power as a parent and that will separate you both even more.", "You’re just pissed because she called you out for literally lying to her her entire life. YTA", "YTA: You just told her to obey without question. What you should have done is sent her to her room to cool down then talk to her calmly, admitting any fault you had in the situation and have an open conversation about her feelings.", "Well she’s old enough to choose which parent she wants to live with sooooo there’s that", "YTA you’re obviously leaving out information to make yourself look better, including calling him a transphobe to get half of Reddit on your side by default", "Your entire marriage was based on a lie and infidelity.  Who would have ever guessed that your marriage to your affair partner wouldn't end well......   When your entire life, marriage and family is built on lies, no wonder your children call you a liar.  They aren't lying.  YTA", "Got up to “we had an affair,” and stopped reading. YTA", "I mean she didn’t lie lol. You are a liar. Your ex is a lair as well. You both are liars to the children. Y’all decided to not tell the truth of how y’all met. How are you mad the truth she called you lair? Though whatever her dad is feeding her doesn’t count.", "YTA\n\nDidn't have to read further than \"affair\".", "So I guess honesty *IS* the best policy in *ALL* situations, huh?  YTA. Throwing away old wedding pics because they’re irrelevant now was pretty hilarious.  It also shows me there‘s a pattern here….", "\"I got sick of that and grounded her, I took her phone and sent her to her room\"\n\n\nYTA. You got sick of her being angry from finding out the truth. Regardless of whether her dad is lying about you being the one who stopped him saying anything, you both lied from the very start. You're punishing your daughter for having emotions about your lie. You're punishing her for your actions.", "YTA- Either you apologize to your daughter or in one year when she turns 18 you will never see her again.", "I mean, you are quite clearly a liar. Not sure why you're upset for being called out. YTA", "YTA.. you’re way worse than what your daughter called you. But.. you have to already know that, right?", "YTA your daughter should not have to suffer the collateral damage of your divorce.", "AGREEED! Hiding and lying an entire former marriage from your children is literally not a problem! Cheating on your husband with his coworker and just waiting to sign the papers so you could pop out a kid guilt free is queen energy and honestly I couldn’t ask for anything more from my own mother. Personally being honest with your children is really overrated. Imo I don’t see why she should care about her mother at all!"]}