{"id": 19847, "submission_id": "14b890d", "title": "AITA for cancelling a get away with my partner for our anniversary because he invited his family that has mocked me?", "selftext": "Throwaway account because my bf follows my main.\n\nI (24m) and my bf (26m) have been together for 3 years. We have planned a trip to go to his cabin, he is one of the owners of this cabin and we planned to go for our anniversary. I have been there before and honestly it is magical to be there and it was he’s idea to go there for our anniversary.\n\nHe told me that his family, particularly his cousins wants to join us and celebrate with us. I find that rather weird and I’m honestly uncomfortable with it, especially since his cousins have mocked my mental illness and has gone as far as letting everyone in their family know about and has told my bf that he shouldn’t be with damaged goods. Right in front of me. To my bfs credit he tore them a new Ahs in front of me, and one of them was on the verge of tears. \n\nThey have since apologized and tried to fix our relationship but I have always kept my distance. Now they want to come with us on our get away and I told my bf that I won’t come and that they could have their celebration with out me. He said that he wouldn’t go either and we could stay home and be together that day. His cousins are calling me every name in the book. They told me that they were right about me being damaged goods and that this would have made a huge impact on our future relationship. My bf is on my side  and has told them off,  but I’m starting to get cold feet and thinking I should just suck it up to keep the peace. \n\nAITA?\n\nEdit: I saw that I wrote it wrong, he told me that they wanted to come as well and since one of them is the co owner he can’t stop them thats why he told me to see how I would feel about that situation.", "created_utc": 1686949938, "permalink": "/r/AmItheAsshole/comments/14b890d/aita_for_cancelling_a_get_away_with_my_partner/", "score": 724, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I think I might be the Asshole because I’m causing a bigger problem then it has to be and my bf is close to his cousins and I might have caused a drift between them.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA \n\nWho Joins a couple on their anniversary,  especially if they are cruel and don't like that person? \n\nSomeone intent on making that individual miserable and ruining their anniversary, that's who.", "NTA!! Love to see a supportive partner that has ur back. F them and have fun on ur anniversary and don’t give them a second thought!!!!", "NTA. Who celebrates their anniversary get-away with family (that are part of who you want to get away from)? Your bf is being particularly clueless here, or maybe he just couldn't reserve the cabin alone without family tagging along. Pick a different weekend or go somewhere else to celebrate.", "NTA.  I think this situation has proven that his cousins are still to be kept (at least) at arm's length.", "NTA - in spite of the family drama, who the hell wants a bunch of folks around on your anniversary. You have a great partner and his cousins can kick rocks. Enjoy your anniversary at home with your partner-at least it will be peaceful.", "MTA. It's unfortunate that your partner didn't shut that idea down right away by telling them that your anniversary was a private celebration. Now it's put you in the position of having to be the bad guy. You shouldn't have been put in that position since anniversary vacations are for the couples who are celebrating. \n\n I don't get the impression that your partner invited them come up but that they invited themselves and he reported their interest to you. It's time for your significant other to step up and tell his family that he erred in not pointing that out right off the bat, and that were way off base to suggest such a thing in the 1st place.", "NTA- if the cousins wanted to show they’ve changed maybe they would have let you two have the cabin alone but what they really showed is that they haven’t changed at all.", "NTA\n\nI find it weird that they invited themselves on the anniversary get away in the first place.  Most people I know would stay away from a trip like that - unless personally invited by the anniversary couple!\n\nThat they quickly turned back to being mean and nasty again so quickly after they heard the news that you two wouldn't be going to the cabin simply shows that their apologies and attempts to 'fix' the relationships weren't genuine in the first place - sounds like someone in the family told them to do those things to 'keep the peace'", "1) If they \\*really\\* got the message when he told them off, maybe over time you could feel out whether it's really necessary to reject them forever.\n\n2) That aside, I can't get past the fact that he would invite \\*anybody\\* to an anniversary cabin getaway. Who cares if somebody else wants to go? What does that have to do with anything? It's an anniversary getaway for you two, not for you four or six or whatever.\n\nNTA, but again, there may be a point at which you should ease up on the cousins. Maybe.", "Did he tell your cousins that it was you that didn't want to go? If yes, he should be a bit more tactful next time with how he answers to the cousins. Because letting the cousins know you didn't want to go only opened you up to get attacked by them. Its his family, he should be shielding you from unreasonable criticism.", "NTA   \nThey don’t try to mend the relationship if they cannot accept your decision of not wanting to spend time with them or your feelings towards them given the past, and their current behavior definitely proves it. Why would you want to be subjected to such poor treatment? Anyway, why would they want to join your and your partner’s anniversary getaway? That’s super weird to begin with.\nGood that your partner supports you though. Have a great anniversary just the two of you!", "NTA\n\nI see two options here:\n\n1. Have bf gently explain to cousins that it’s meant to be a private getaway for an anniversary (since apparently they don’t understand anniversaries. Seriously who asks to come along to a couples anniversary trip????? Lol) and ask if they’d mind letting you two have the weekend alone, and then maybe plan a bigger get-together with everyone for a later date. \n\n2. Let them get over it on their own (they’re the assholes here, I’m glad bf sticks up for you, just be cordial with them at family stuff when you can’t avoid them) and if it’s in budget see if you can find another cute little getaway at an Airbnb or hotel or if no budget, stay in and turn the living room or backyard into a blanket fort and have wonderful quality time", "This is a strong NTA. These cousins were very mean initially, and while they tried to repair the relationship, they undid everything and were very cruel toward you. I'm glad your partner is sticking by you, but you don't have to do anything you're not comfortable with, and their actions have made it even more clear that your well-being is not on their list of priorities.", "Isnt it weird that someone else other than the couple that want to celebrate a milestone in their relationship want to tag along? I find that weird. To me, there was an ulterior motive.", "NTA. I'd cancel to rather than spend time with people like that", "NTA - they're just cousins. If it was a brother/sister, I might suggest you do something to try to keep the peace, but cousins? F that...", "NTA. Kind of seems like your boyfriend is though for inviting them on a trip celebrating your relationship and also for inviting people who treat you horribly.", "NTA\n\nWhy did your boyfriend want to spend your anniversary at the cabin after he found out his cousins were coming??\n\nHe should have made a decision with you, instead of throwing you under the bus.", "NTA\n\nTell them you didn’t want to spend your anniversary with anyone other than your SO. They had a chance to prove to you they were truly sorry and look at how they acted, they never were sorry and were probably planning on ruining your trip!", "NTA.\n\n1) you don’t have to be around people who abuse you\n\n2) why the fuck would family come on a anniversary weekend?", "NTA, his cousins did it to start drama.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nThrowaway account because my bf follows my main.\n\nI (24m) and my bf (26m) have been together for 3 years. We have planned a trip to go to his cabin, he is one of the owners of this cabin and we planned to go for our anniversary. I have been there before and honestly it is magical to be there and it was he’s idea to go there for our anniversary.\n\nHe told me that his family, particularly his cousins to wants to join us and celebrate with us. I find that rather weird and I’m honestly uncomfortable with it, especially since his cousins have mocked my mental illness and has gone as far as letting everyone in their family know about and has told my bf that he shouldn’t be with damaged goods. Right in front of me. To my bfs credit he tore them a new Ahs in front of me, and one of them was on the verge of tears. \n\nThey have since apologized and tried to fix our relationship but I have always kept my distance. Now they want to come with us on our get away and I told my bf that I won’t come and that they could have their celebration with out me. He said that he wouldn’t go either and we could stay home and be together that day. His cousins are calling me every name in the book. They told me that they were right about me being damaged goods and that this would have made a huge impact on our future relationship. My bf is on my side  and has told them off,  but I’m starting to get cold feet and thinking I should just suck it up to keep the peace. \n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. Its a romantic get away for your aniversary, and with theyre response they are proving that they are not really change they way to think. \nKeep your distando with they.", "NTA. Who wants to be around a bunch of people who make fun of you on your anniversary?? And why do these folks think it's a cool idea to celebrate your anniversary together? That's just odd.", ">They have since apologized and tried to fix our relationship but I have always kept my distance.\n\nWell, I guess you learned how sincere they were about their apology. They are really sorry until you refuse their demands, and suddenly they detest you again. You don’t need this behavior in your lives. Enjoy your time with your bf and keep your distance from the actual “damaged goods” - people who try to hurt other people. Life is short enough without wasting the time we have on such behavior.\n\nNTA", "NTA. Either this family has a very weird sense of boundaries, or the cousins were intentionally tagging along to ruin your trip.\n\nI'm shocked your boyfriend didn't tell them that he'd prefer privacy on a romantic getaway weekend. If they co-own the cabin, he can't exactly ban them from the place, but he can certainly tell them off for being rude. \n\n>His cousins are calling me every name in the book. They told me that they were right about me being damaged goods and that this would have made a huge impact on our future relationship.\n\nSounds like they made up their minds about you already and now they are just revealing how spiteful they are. Is there some reason why you're still talking to them?\n\nYou shouldn't have to defend yourself from the boyfriend's family. He should be taking care of that for you.", "NTA but what’s the long-term plan here?", "I thought the whole point of a “getaway“ was to get away. And the fact that they are co-owners doesn’t mean they just get to barge in when someone else is using it. Boyfriend needs to develop a spine or some such. Weird that he’s even on good terms with them after the shit they said to you.", "NTA\n\nWhen celebrating an anniversary, it should be a happy occasion so I wouldn’t blame you for not wanting them there. Also, who joins in on a getaway meant to celebrate TWO people. It’s not like this is a family affair. They also went right back to mocking you when you said you didn’t want to go. Clearly, they aren’t genuine in wanting to mend anything with you and probably aren’t actually apologetic. They don’t sound like people you need in your lives, so I suggest being civil with them (for sure they’ll be at family events) but maintaining your distance (don’t talk or interact unless you need to). It doesn’t matter if they’re your partner’s family, not all family is worth having around.", "NTA. Never \"fix\" a relationship by letting them walk all over you.\n\nIf you don't set boundaries now things will only get worse. Trying to force their way into the private anniversary celebrations of you and your boyfriend is not something people who want a healthy and respectful relationship do.", "NTA. There no real altruistic reason for them to invite themselves on a couples anniversary trip. Sounds like they wanted a cheap get away with you and BF picking up the tab for food and drinks. Probably cleaning up after them too.", "Your bf needs to sell his interest in the cabin and you guys get your own deal going.", "NTA- it doesn’t matter that the family are co-owners. It’s super weird and intrusive to invite yourself along on someone else’s romantic getaway. They have no manners.", "NTA. You are not obligated to put yourself in uncomfortable or distressing situations for any reason. Not to keep the peace, not to make your boyfriend happy, nothing. Why would you spend time with toxic people??", "NTA. The cousins are handling it wrong and sound like not good people .Im wondering if maybe they want to join because it's a proposal on an anniversary and not just a simple getaway and that's why they made a comment on your future together. Your boyfriend might have invited family to celebrate together.", "Nta. They are.", "NTA\n\nLike many others have said, it’s weird to have anyone at your anniversary get away but your SO. I was going to say that you shouldn’t have kept your distance after they apologised and tried to fix the relationship, but then you mentioned how they reacted to you not going and I think you were right to keep your distance after all", "Let’s see what happens, our anniversary is on Monday and we have already taken out 4 vacation days, might give an update then.", "Added it to the edit", "In case the OP edited it after you commented, he said his bf basically informed him that they indeed invited themselves along and that he can't stop them because one of the cousins is also an owner of the property, and it seems like he was letting him know to see if he still wanted to go\n\nEdited because I used incorrect pronouns", "My bad I see that I wrote it wrong, he told me that they wanted to come as well and since one of them is the co owner he can’t stop them", "Tbh I’m not. Haven’t talked to them for a long while, my bf even encouraged me to not talk to them they. Just have my phone number as in the beginning I thought they were nice but ye", "May I suggest going somewhere else? It doesn't even have to be an full on travel with hotels and everything if you can't afford it, but maybe spend the day together and get a nice dinner?", "Then it's still a bit odd that he wouldn't be making other plans, anyway. A cabin with cousins doesn't serve the purpose of being a romantic anniversary spot.", "Reading your post and also this comment leads me to believe he told them about the trip as away to inform them that the cabin would be occupied. And instead of them wishing you well, they’ve decided to intrude as away of ruining the trip. You’re wise not to go, I don’t think you’d have a good time.", "Other than showing BF the awful messages, I think your best bet with those cousins is to drop all contact or go with the grey rock method.", "This is not on the boyfriend, the cousins invited themselves because its a co-owned cabin.  When OP said he ~~she~~ wouldn't go if they went, the boyfriend had his ~~her~~ back.  As for other plans for a get away, the cabin was essentially no cost get away, they may not have the finances to go anywhere else\n\nEdit: missed they are both males.  Thanks u/Marble_Narwhal", "Ye don’t know what to tell u, being a co owner he can’t have much say when others would want to be there 2", ">When OP said she wouldn't go if they went, the boyfriend had her back.\n\nI missed this part. And yeah, they may not have finances for other options, but I still wouldn't personally want to try to have an anniversary celebration with people intruding.\n\nIt's like if they wanted to take a shower together, and a cousin was in the bathroom. Private shower ruined. I wouldn't take a shower then.", "Both are male, comrade.", "Yeah, but the point is to have a romantic getaway for your anniversary.\n\nIf the cabin has cousins who don't care about your privacy, then it's not a romantic getaway.\n\nIn that case, I'd be making other plans.", "NTA\n\nSee, someone who is really sorry would understand that trust doesn't form overnight, especially after you hurt someone.\n\nThey are not entitled to your time and the truth is that it sounds like they invited themselves to your anniversary and your boyfriend was nice enough to ask.\n\nAnd, just like before they revealed themselves to be entitled, judgemental, conceited, self absorbed AH's who will immediately low blow you the second they don't get their way.\n\nHaving contact with them is the social equivalent of stepping in a huge pile of dog sht.", "NTA anniversaries are for sexy time. No one wants cousins that bully you their screwing up the whole vibe.", "Thinking that co owning with cousins is a bad idea. Someone needs to be brought out ...", "NTA\n\nThe only ones that are \"damaged goods\" are those rotten cousins. You have a great BF that is willing to defend you and stand by your side.", "NTA cousins are being cock blocks. Also make sure you show your partner the comments they're making", "NTA\n\nYou’re not causing the problem.  The asshole cousins are.  Why the fuck do they want to go on your anniversary getaway to begin with??   You are right not to go!!", ">They have since apologized and tried to fix our relationship but I have always kept my distance.\n\n>[...]\n\n>They told me that they were right about me being damaged goods and that this would have made a huge impact on our future relationship\n\nSuch a sincere apology, I can see how really and truly they meant it. Clearly you wanted some alone time on your anniversary, and you deserve it. Enjoy your time together and hopefully you can go to this cabin another time when AHs aren't around. NTA", "why do they know your mental history in the first place? NTA but they are for inviting themselves to an anniversary (weird) and for just generally being assholes", "I don’t think they were trying to repair anything ever. They knew they weren’t welcome to join on an anniversary celebration and used it for more ammo against OP.", "Do something else. If you go down the road of \"keeping the peace\", you'll soon find yourself living someone else's life.\n\nIt's a losing strategy.", "missed that - thanks", "NTA. Who goes on someone else's anniversary getaway? Its a bit creepy.\n\nDon't the co-owners of this cabin have designated weeks or times to use it? Maybe the cousins should buy out the boyfriend's share>", "I can't think of any kind or reasonable reason for someone that doesn't like you to want to join you on your couples anniversary trip. Especially when they weren't invited! Nothing good could come from \"keeping the peace\" and still going. I agree with the other comments suggesting going somewhere else. NTA  \n\n>His cousins are calling me every name in the book. They told me that they were right about me being damaged goods and that this would have made a huge impact on our future relationship.\n\nHun I know this is hurting you now but you aren't proving them right about anything, they are showing you you were right to not be around them. You knew not to trust them and the first chance they got they showed their true colors again. Block them and stay away!   \n\nAlso, anyone who makes fun of an illness and calls someone damaged goods  because of it\n is an AH from another realm", "NTA, firstly it’s a bit weird to want to go with a couple on a trip when that trip is to celebrate the couple’s anniversary.\n\nSecondly, why should you give your time to people who aren’t nice to you and don’t respect you!\n\nI am glad that your BF is standing up for you though.", "Having someone follow my reddit would be a deal breaker\n\nIf this man doesn't cut these cousins out completely break up with him", "NTA it was very dumb of him to invite additional people.", "NTA, any chance your boyfriend was planning on proposing and his cousins caught wind of it and decided they, as co-owners, were coming too to prevent it?", "Or they wanted to force a breakup.", "I saw the edit and even as the co-owner I think it’s weird they want to join. Part of me thinks they did it because they knew it would make you uncomfortable. To those boneheads, by backing out, you’re the bad guy for not wanting to hangout with them\n\nNTA", "I mean, if the cousins are literally calling you names right now for wanting to stay home, they are sort of proving your point.\n\nDo they just like parties and wanted to hang out and drink with bf?\n\nAnyway, NTA", "NTA. Your boyfriend was weird when he thought bringing other people to your anniversary trip was a good idea. They obviously are not really trying to fix their relationship with you. You owe them nothing.", "Is he planning a proposal and wants everyone there? If not - laaaaaaamme.", "NTA - So they supposedly apologized for calling you \"damaged goods\", then called you every name in the book? They are not sorry. Avoid them, they are cruel AH's..", "Nta. With multiple co owners, aren't there agreements in place for requesting private weekends? Or is it always any of the owners can show up whenever they want?", "NTA. Forgiveness is a gift, not an obligation. You don't owe BF's cousins your forgiveness, let alone your company. The fact that they reacted as they did, with further insults, shows that their previous apologies were a face-saving lie. \n\nIt's goof that your BF stood up for you and was willing to stay at home with you. He sounds like a keeper.", "His family confirmed that you made the right decision.  NTA", "NTA. His cousins are trying to make YOUR anniversary about THEM by inviting themselves along. \n  They have already dissed your relationship before so they don’t deserve to celebrate it with you guys on your special day. \n \nAlso, props to your partner for consistently prioritizing your feelings and not allowing his family to pressure or manipulate him into inviting them anyway.", "Anniversaries are not “family” holidays. You are not obligated to include family on anniversary dates or trips, and should not have to defend your decision, it’s a ridiculous request on their part.", "NTA. Also your boyfriend is amazing for having your back and staying with you without making you feel bad at all. I love how healthy your relationship sounds. His cousins are 100% TA.", "NTA You are under no obligation to hang out with toxic in-laws, especially on your anniversary.", "NTA. But I believe you are making a problem where there isn't one. Your boyfriend's family mocks your mental illness; your boyfriend stood up to them for you. Those same relations want to horn in on your anniversary get-away weekend. You don't want to go. Your boyfriend IS ON YOUR SIDE in this matter, too. He's fine in spending the anniversary WITH YOU no matter where you are. Congratulations.\n\nYou are in a golden position of having a love interest who stands up for you; who chooses you. How his family feels about his loyalty towards you is none of your business. People talk. People complain -- it doesn't mean there is any validity to it.\n\nDon't take on problems that you don't have.", "NTA", "Even if the cousin(s?) is a co-owner, your bf should still be able to have occasional time at the cabin without the cousin there. That’s one of the perks of owning a cabin.\n\nAnd a cousin/co-owner who was that level of antagonistic in the past towards you, who knows that your bf wanted to celebrate an anniversary with you in the cabin, who then contacts you to continue the antagonistic insults- yeah, that cousin was looking for a way to hurt you and embraced this opportunity with open arms. The others joining in is just the cherry on top of asshole behaviors.", "He told them he's going to propose is what happened.", "Nta \nI can understand not wanting to be in the same vicinity as those people who locked you for your disability", "NTA, especially because you've been proven 100% correct. If they took this in stride and didn't lash out like such evil assholes then this actually could have shown a change of heart, but has instead proven that the apology was all show.", "NTA. Yeah, sounds like BF isn't as considerate as you make him out to be. Those people haven't changed. He doesn't care. Reads like he's just thinking time = healing. Unless he's willing to cut those fucks out, why have a future with this man if it's clearly going to mean a concurrent future with those fucks.", "NTA. They decided to go intentionally to stir up drama. You are doing the right thing by avoiding the situation and I'm glad it seems your bf stands up for you. Go do something else on those days off together.", "NTA\n\nWho the fuck decides to invite themselves to someone elses anniversary? Them getting upset that you won't give time meant for your relationship to them reinforces the fact they suck.", "You are 1000% not the ass hole. The way they acted after you said no shows how much of horrible people they were. You dodged a bullet not going with them on a trip. And especially on an Anniversary, you shouldn’t feel uncomfortable in something that’s meant for you.", "Exactly they had disgusting intentions. Now they are mad OP cancelled the trip because now they won’t get a chance to mock and ridicule her. They revealed their real and true intentions when they started calling her names again for cancelling, and trust me OP that’s what they were gonna do every day in the cabin.", "Agreed. They have no desire to keep the peace with OP. NTA", "Mocked not locked sorry", "On pride month 💀", "It Is your anniversary. You should be alone. You are not the asshole.", "NTA\n\nTheir willingness to declare, \"I was right\" proves just that they weren't actually apologetic. They did so out of diplomacy, but the first thing they did when their actions fucked them over was to try and hurt you.\n\nDon't live your life seeking approval from people who've already decided to judge you unfairly. You'll always be disappointed by their decision making skills in the end.", "Yout bf needs to cut ties with his cousins, they only have ill intent in mind with this trip.\n\nHow old are the cousins? Sounds like a bunch of kids", "NTA - how are you supposed to have lots of loud sex in a cabin full of people.\n\nHELL NO. Then ad in the fact that these people are jerks.", "It's supposed to be for your anniversary... if you decide not to let them push you around... have the loudest sex you can manage so they're fine by morning. \n\nBut nta", "I see no indication in their behaviour here (inviting themselves along to an anniversary getaway, wtf) that the cousins are anything other than bullies.", "Hahaha to be fair I was the one that wanted to date for 6 months before we became a couple and when he asked me again to be his bf I said yes,didn’t really think about pride at that time since I had only dated women before my bf.", "Nta.  Ur trip.  Alone.  Just u 2", "NTA on the grounds that it was your anniversary. Why would they want to tag along for that? Co-owner or not.", "They’re showing their true colors by going straight back to the insult they know hurt you as soon as the couldn’t *checks notes* crash your anniversary? What if you guys had planned anniversary sex marathons. They certainly aren’t invited to that. When I hear anniversary get away, my last desire would be to be with someone on theirs.", "NTA.  I wouldn’t want guests for my anniversary either.  If you decide to go to the cabin, have the loudest, most explicit, dirtiest intimate time as possible.", "NTA\n\n&#x200B;\n\n**Cancelling when family plans to come to your anniversary is the reasonable solution.**  \n\n&#x200B;\n\n\"but I’m starting to get cold feet and thinking I should just suck it up to keep the peace.\" .. NEVER do that - when you are being abused, ESCAPE.\n\n&#x200B;\n\n\" His cousins are calling me every name in the book. \" .**. Go no contact with them. Do not allow them to abuse you. Why haven't you blocked their numbers yet?**\n\n&#x200B;\n\nMake a proposal to your husband -: since the cabin is jointly owned, eihter have him agree with them on a shedule where each of you use the cabin alone, or ask him to sell it since you won't be able to use it anyway.", "NTA but your bf is. He didn’t need to tell them you are the reason he isn’t going. He could have said he decided to do something else but instead he chucked you under the bus.", "Might I suggest loud sex and over the top public displays of affection. If your boyfriend is on board that should discourage them from wanting to join you in the future. Hey I’m petty", "I absolutely agree 100%, but op is a him. Regardless of gender op your NTA, plan something different and ask your awesome so, who rocks for properly reaming his ah cousins, to keep it hush until after your anniversary. Then post a bunch of amazing pics of your fabulous time so the ah cousins can see they didnt win, they didn't ruin your time!", "INFO: can you tell the cousins that y'all are having a nekkid buttsecks filled weekend of debauchery in celebration of your anniversary at the cabin and that if they want to come there need to supply their own barrels of lube?", "My mother had a statement she'd use whenever one of us kids went out on a date, more for my sisters than for me (m), but still relevant.\n\n\"Don't do once anything you're not willing do do forever.\"\n\nOnce you compromise the first time, why not the 2nd? or the 3rd? or the 45th?\n\nBe very careful what you decide you're willing to compromise.", "This very well may have happened and would explain a lot.  I hope you didnt just spoil the surprise for OP.", "Rubbish.\n\nIf you co-own a holiday place then there should be some level of understanding that sometimes people will want to have it to themselves for a few days and they should be able to block that out (within reason).\n\nSounds like it's time for all these co owners to sit down and work out some rules."]}