{"id": 19842, "submission_id": "14b4trk", "title": "AITA for being upset after getting kicked off a vacation?", "selftext": "I (23F) went on vacation with my boyfriend - Logan (24M) - and his dad - Rob (60sM).\n\nRob recently got a payout from legal thing (keeping details vague for privacy), so he asked Logan to road trip with him.\n\nLogan is currently unemployed. He and I were best friends for years before we started dating and I have always been well acquainted with his family. Logan and I have been dating for 4 years, and I've known Rob for 8 years.\n\nI asked Logan if I could fly out to meet them at certain point on their road trip. I had a bunch of PTO I hadn't used, so it seemed perfect. We talked to Rob about it, and Rob was happy. He told me that he would pay for everything on the trip, including my food costs, and I insisted on buying my own flights.\n\nI flew out to meet them, and it was awkward. They'd been traveling together for two weeks already, so I took Rob's annoyance to be because he was sick of traveling. I decided to pay my expenses because Rob seemed annoyed he had to pay for me, but then he got mad at me.\n\nMy third night there, Rob went to bed and Logan and I went out to explore a little bit. I got into an accident and had to go to the hospital. I broke my shoulder and my jaw.\n\nI only had a few more days left on the trip. I talked to the doctors, and they assured me that I would be fine to travel for 3 more days and then fly home.\n\nRob picked Logan and me up from the hospital, and as soon as I got in the car he said I needed to fly home. Logan brought up what the doctors had said, but Rob said it wasn't up for discussion.\n\nLogan asked Rob to drop us off somewhere. I think because Logan wanted his dad to calm down before we spoke more. Rob was outwardly very upset, but he agreed to drop us off. When we met up with Rob again for dinner, he started yelling at me in the restaurant. He said something like, \"this is my trip, and you're an uninvited guest. It's time you go.\" Rob made a jab about my parents, and I replied that my parents would never yell at me, especially in a public place.\n\nI booked a hotel room for myself and told him I was going to stay, with or without him. Logan didn't say anything other than to bring up again what the doctors had said. I talked to Logan about continuing his trip with his dad, but Logan insisted on staying with me. We continued the vacation for two more days and then flew home.\n\nRob cut his trip short and ended up driving back home a couple of days after Logan and I flew out.\n\nRob invited us over for dinner, and I refused to go. Logan is understanding and supports my decision. I told my family about everything that happened, and they are extremely upset by it. They think that Rob kicking me off the trip was horrendous. My parents are upset that Rob would treat me that way.\n\nPersonally, my feelings are hurt and I feel like Rob took away my autonomy. Logan is very supportive of my need for space, but I still feel bad about it.\n\nAITA?\n\n&#x200B;\n\nEdit: I'm getting a lot of comments that I invited myself on a father/son trip, so I'd like to add some context. The road trip they planned was supposed to be 2-3 months long, and I was supposed to join them for six days. I was not the only friend of the family that was to meet them along the course of their trip.\n\nI had previously been invited on a different trip but couldn't go because I didn't have enough PTO, and when this trip came up, I mentioned to Logan how much PTO I had. (I also do not feel entitled to be invited on every trip, I'm just saying why I brought up how much PTO I had in the first place). Logan was excited that I could join them and he asked Rob if I could meet up with them. I was not with Logan when he asked specifically because I wanted Rob to feel comfortable saying no. They were going to a location important to my family's heritage, and Rob told me directly that he was very excited to experience seeing it with me. I had no indication that Rob did not want me on the trip.", "created_utc": 1686941586, "permalink": "/r/AmItheAsshole/comments/14b4trk/aita_for_being_upset_after_getting_kicked_off_a/", "score": 529, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I got into an argument with my boyfriend's dad about being told to leave a vacation after I got injured and I'm now refusing to see him. I may be the asshole by holding a grudge about the situation.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "There’s something missing here.  The story jumps straight from Rob being happy and paying for everything, to Rob being annoyed and mad.  Then you’re in a random accident with multiple broken bones and Rob is even more mad.  Either you’re leaving things out, or something happened on the trip before you joined it and Logan isn’t sharing that with you.  Either way, not enough INFO.", "If all is as you’ve presented in the post and the comments, I’m thinking NTA. \n\nFirst. You’re not supposed to fly for at least 48 hours after a cast is put on. Google, it saves lives, lol. Regardless, I don’t think it’s reasonable for an adult to get mad at someone for being hit by a car. Even if the person wasn’t a welcome visitor. Compassion should exist for the person that’s been in his sons life all this time. \nOne of my kids friends drives me NUTS and always invites herself along, even when she’s not welcome. But you better believe that as an adult, if I see someone get hurt - even someone I barely know- compassion comes first. \n\nIf you really made sure Rob was asked in such a way that he could have said no, and he agreed to you being on the trip, then you were just taking him at his word. \nAlso, if other people met up with them on different legs of the journey, it isn’t reasonable to be upset with you for also visiting. \nIf Rob suffers chronic pain and mood swings, it could simply be that days and days on the road started to wear on his nerves and he should have handled it better. \nI don’t know how many times I’ve thought “hey, let me do this activity with my kid. It sounds so fun.”  Then I get in neck deep and wish I’d done ANYTHING else with my time.", "INFO: Why did you want to stay on this trip after you broke your jaw and shoulder? You likely wouldn't have been able to eat or talk properly or move around comfortably, much less do whatever tourist things they had planned. And I'm sure would you have been in intense pain. Why would you insist on staying?", "NTA - In one of your comments, you kind of state that Rob can change moods quite quickly (not only on this trip). Sounds as if that happened and you dealt with it as best you could. He did seem happy to have you join them for a few days before the trip. Perhaps when things calm down, you can discuss this calmly.  Hope you are healing from your injuries.", "NTA and I’m going to guess that you can chalk most of Rob’s behavior to a mix of traveling fatigue, chronic pain, and just normal grumpiness and irritability that people get when they are out of their normal element for too long. \nI wouldn’t take it personally and I’m betting that now that he’s been home and chilled out, he’s probably wanting to apologize. It could be the reason he invited you for dinner, to try to make amends. \nI don’t think it’s that weird for people to blow up on each other while traveling. I’ve had my worst fights with friends after being together too long in unfamiliar places.", "NTA\n\nHe sounds like he has a mood disorder and has no desire to do anything about it because terrorizing everyone else is easier than being a decent person.\n\nMy mother is like this. Moans about how nobody loves her, but when anyone comes to visit she bounces between mildly nice and outright hateful monster.\n\nRob really just has no idea how lucky he is that he son even tolerates him.", "NTA. Logan is really quiet for being the one most likely to have all the information to make this make sense.", "NTA - You inquired and communicated well. Rob had many opportunities to say no or reduce your travel time. Does Logan have insight as to why his father's behavior changed?  I am sorry you were injured and endured him yelling at you at a time you were in pain. This is a person to not fully trust what they say or promise. Best to you.", "NTA - I don't know why everyone is expecting you to be a mind reader here or future teller? You asked to join for a duration of the group, everyone said yes and was excited, and then you were treated poorly just for showing up and being there.... It's not like they said no and you forced your presence on everyone. You shouldn't have been treated rudely because the trip wasn't going as expected.", "NTA but I don’t understand how he took your autonomy away?", "NTA - and good for both you and Logan.  do you think Rob made the offer but didn't think you would really do it?  it sounds like something else is going on with Rob to make him act that way.", "How did you know rob was happy about you joining the trip? Was it something Logan just said? “Oh rob is happy about you joining”. Or did he say “I’d be happy to have you join us”", "Wait, you broke your jaw, and a little while later you’re going out to dinner?   I thought breaking your jaw was a big deal.", "Info: How did you get hurt?  If you were doing something stupid, I’d be pissed and tell you to go, too.", ">\"this is my trip, and you're an uninvited guest. It's time you go.\"\n\nI feel like this explains pretty succinctly why he was upset. You invited yourself on the trip and basically completely derailed the trip he had planned with his son. I don't want to call you an asshole, but I also don't really understand what you don't understand about the situation. \n\n>I feel like Rob took away my autonomy.\n\nWhat? How? By telling you to leave?", "Personally, I would date Kendall, rather than Logan. That said, the patriarch was awful to you, so NTA.", "Wait, you broke your jaw, and a little while later you’re going out to dinner?   I thought breaking your jaw was a big deal.", "NTA I'm not sure what could have happened in those 2 weeks or if maybe Rob felt obligated to let you come but it's not like you were trying to hijack their whole road trip.", "NTA.", "Reading between the lines of this I feel like YTA.  I think Rob wanted to have a vacation with his son and you crashed the vacation.  Seemed like Rob was ok with it but something must have happened to make him upset, my guess is your coming turned the dynamic into him being more the third wheel.  Then you got into an accident and broke your shoulder and jaw and can't figure out why that might ruin his vacation.  Why wouldn't you just fly home? It's not like you would be enjoying a vacation with those injuries.   Instead, you ruined the trip for the other two by making Logan pick sides.  There seems to be quite a bit you are leaving out of this story but it sure sounds like your family and Logan are giving you a free pass to not own up to your part in all of this.", "Confused on how you broke your jaw and shoulder, got out of hospital, didn’t need to see a surgeon, went to dinner, had enough strength to argue; stayed for 2 more days and then went home and still continued this?\nDid you ever see a surgeon? You should take better care and let the boys handle this. His dad is upset about something and probably his son.", "NTA\n\ndid he really kick you off of the vacation because you got injured? or am i horribly misreading this?", "INFO \n\n>He said something like, \"this is my trip, and you're an uninvited guest. It's time you go.\"\n\nAre you sure you were invited because Rob doesn't think you were?", "NTA based on the edit and other comments you’ve made. You said Rob is prone to flipping a switch and changing his temper suddenly, and it seems that this had happened on the trip well before your arrival. Everyone who has the context and still thinks Y the A H probably hasn’t experienced a parent with that kind of temper.", "NTA- I don't get all the Y T A's, if Rob was not okay with you joining them for a brief period of their trip I doubt a grown-adult would say \"yeah of course!\" And even WILLING to pay for ALL if not MOST expenses during your stay. If anyone reads OP's edits this isnt uncommon for Rob to become irritated or have moodswings and tbh sounds like something my dad would've done who is manic bi-polar and flips like a light switch half the day. I just hope for OP and her BF's sake they either try and have a civil conversation with him about what happened and he can either explain and talk to OP and they can resolve the tension or OP and their BF set some clear boundaries with Rob until then.", "Interesting how the story has changed SO drastically to favor OP and villify Rob.", "It’s sucks you got hurt and rob was like that, but I’d guess he wanted the time just with his son and didn’t feel like he could say no when you asked", "YTA.\n\nYou pushed your way onto a father-son trip and changed the dynamics of the trip. It seems likely that this change made the father a third wheel on the very trip he planned and was paying for.\n\nFinally, you had serious injuries. How would have staying on a trip with a freshly broken shoulder and jaw played out? You wouldn't have enjoyed yourself and everyone would be forced to cater to your serious injuries. \n\nIt was time to go home. Any sensible person would have gone home immediately. \n\nDon't hold a grudge here. Being asked to go home under these circumstances wasn't outrageous. In fact, it was the right thing to do.", "Sounds like a clash of “ask” vs “guess” culture to me.\n\nYou asked thinking they would just say no if they/Rob didn’t want you to attend.\n\nMeanwhile you asking meant they felt obligated to say yes. It made them resentful b/c they felt like since you weren’t directly invited it was obvious (to him) what this trip was - a father son trip.\n\nI think ESH is the best option.\n\nYou for inviting yourself along.\n\nLogan for not being a better “translator” between parties.\n\nRob for his massive overreaction and apparent inability to just say “no thanks” to your request.", "YTA\n\n***You invited yourself*** to a segment of a family vacation.\n\nRob was resentful about your presence - he had planned this trip with his SON and you decided to jump into it.\n\nYour parents, instead of being upset at Rob, should be embarrassed that they never taught not to invite yourself places.\n\nGood Luck", "YTA you never should have put Rob and Logan in the awkward position of inviting yourself on a father son trip.  Obviously they said ok to not be the bad guy but didn't really want you there.  If you were wanted on the vacation you would have been invited without you needing to ask.  This is why it is rude to invite yourself.", "What? Totally YTA! You inserted yourself into a father son trip and are pissed because dad doesn't want you there, and son would rather go with you\n\nWow.", "Fucking Logan", "YTA. Why in the world did you even think it was okay for you to invite yourself on a father-son trip?", "MAYBE ... Rob hadn't realized how expensive his trip would be and that's why he was upset/grumpy when they picked you up?\nThings cost more these days, especially traveling. As an older person maybe under-estimated how his settlement $$ wouldn't take him as far these days.", "ESH - you shouldn't have asked to go on the trip in the first place, but Rob had every opportunity to say no.  Hell, he could have had Logan tell you that he changed his mind when his chronic pain started flaring and ask you not to come out.  Instead, he said yes, gave you every indication that you were welcome, and then was an ass to you while you were there.  \n\nI'd just distance myself from Rob and try to stay out of the father/son dynamic he has with Logan.", "Leaning towards YTA. We have no details on your injury other than it happened. It kind of sounds like that put Rob over the edge…he went from a trip with his son to having to worry about you guys not entering a hospital when he isn’t around. Was it a dangerous accident? Were either of you in real danger? Whose idea was it to do whatever you were doing? Need more INFO", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (23F) went on vacation with my boyfriend - Logan (24M) - and his dad - Rob (60sM). \r  \n\r  \nRob recently got a payout from legal thing (keeping details vague for privacy), so he asked Logan to road trip with him.\r  \n\r  \nLogan is currently unemployed. He and I were best friends for years before we started dating and I have always been well acquainted with his family. Logan and I have been dating for 4 years, and I've known Rob for 8 years. \r  \n\r  \nI asked Logan if I could fly out to meet them at certain point on their road trip. I had a bunch of PTO I hadn't used, so it seemed perfect. We talked to Rob about it, and Rob was happy. He told me that he would pay for everything on the trip, including my food costs, and I insisted on buying my own flights. \r  \n\r  \nI flew out to meet them, and it was awkward. They'd been traveling together for two weeks already, so I took Rob's annoyance to be because he was sick of traveling. I decided to pay my expenses because Rob seemed annoyed he had to pay for me, but then he got mad at me. \r  \n\r  \nMy third night there, Rob went to bed and Logan and I went out to explore a little bit. I got into an accident and had to go to the hospital. I broke my shoulder and my jaw. \r  \n\r  \nI only had a few more days left on the trip. I talked to the doctors, and they assured me that I would be fine to travel for 3 more days and then fly home. \r  \n\r  \nRob picked Logan and me up from the hospital, and as soon as I got in the car he said I needed to fly home. Logan brought up what the doctors had said, but Rob said it wasn't up for discussion. \r  \n\r  \nLogan asked Rob to drop us off somewhere. I think because Logan wanted his dad to calm down before we spoke more. Rob was outwardly very upset, but he agreed to drop us off. When we met up with Rob again for dinner, he started yelling at me in the restaurant. He said something like, \"this is my trip, and you're an uninvited guest. It's time you go.\" Rob made a jab about my parents, and I replied that my parents would never yell at me, especially in a public place. \r  \n\r  \nI booked a hotel room for myself and told him I was going to stay, with or without him. Logan didn't say anything other than to bring up again what the doctors had said. I talked to Logan about continuing his trip with his dad, but Logan insisted on staying with me. We continued the vacation for two more days and then flew home. \r  \n\r  \nRob cut his trip short and ended up driving back home a couple of days after Logan and I flew out. \r  \n\r  \nRob invited us over for dinner, and I refused to go. Logan is understanding and supports my decision. I told my family about everything that happened, and they are extremely upset by it. They think that Rob kicking me off the trip was horrendous. My parents are upset that Rob would treat me that way. \r  \n\r  \nPersonally, my feelings are hurt and I feel like Rob took away my autonomy. Logan is very supportive of my need for space, but I still feel bad about it. \r  \n\r  \nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "What accident did you get in exactly?", "NTA - but there’s a good chunk of missing info.", "INFO: what was the accident? Was it something that happened to you while you were drunk or high? We’re you treating this like a party beach vacation when it was more of a father son calm road-trip?", "INFO I don't know what's going on here INFO", "NTA\n\nRob was asked if you could join them.\n\nWow! What a weird and violent reaction! (Verbally)\n\nIs this behavior new to Rob? When people have sudden personality changes, it needs to be brought to the attention of medical professionals.\n\nPlease ask Logan to bring this up to his mother.", "INFO: When did you start paying for yourself? Does rob usually like paying for things and hanging it over people's heads?\n\nSounds to me he was miffed you didn't let him pay after he said he would. Tied in with griping over paying for you at dinner it makes it seems hes one of those awful people who will pay for you but make you earn it by suffering through their martyrdom and then if you deny them that opportunity you're the bad guy. \n\nI could be way off base but thats what I'm getting here. Overall I think NTA.", "Everyone is the asshole\n\nThat’s it no explanation needed!", "NTA. Do yourself a favor and concentrate on healing. You poor thing. Get well soon. Rob sounds like an awful potato.", "Sometimes people think they can just move on without apologizing and some assholes will put it on you tell you to be the better person and just move on to “keep the peace” I am of the firm believer that actual apologies and conversations are necessary an invite to dinner is not enough", "NTA - There is no justification for how he spoke to you or how he behaved. None.", "YTA you had broken bones. It was time you flew home!", "I can try to give more context. I couldn't because of the word limit, but I'm also not sure what other information might be helpful. I don't really think that I left anything out, at least not on purpose. \n\nRob is just kind of like that as a person. One minute, everything is fine and the next, he's got a bone to pick with the world. \n\nWhen my going on the trip was discussed, he was definitely excited to share the experience with me. Logan mentioned to him that they had planned a stop on the trip that was very important to my family's heritage. I was uncomfortable at the thought of him paying for the entire trip, but he said that he was already paying for things and adding me on to that wouldn't be an issue for him. \n\nLogan and his dad don't always get along super well. The first two weeks of their trip were stressful, from what I've gathered from Logan. Rob deals with chronic pain, and that started to flare up during the trip. He started being hateful towards Logan, which Logan says he didn't feed into and was understanding of. Logan has told me that nothing out of the ordinary happened before I got there.\n\nWhen I joined them, Logan and I started going off without Rob. I asked Logan about spending more time with Rob, and Logan said that even when I wasn't there, Rob preferred to explore more on his own than with Logan. I paid for my own food and expenses when we weren't with Rob, and Rob confronted me about it. Rob still insisted he pay. But, when we got dinner together that night, Rob made a comment about buying my dinner (I had a salad and a soda, considerably cheaper than Rob and Logan's meal costs). \n\nI think everything that happened after I got hurt is covered, but I'll answer any more questions that anyone has.", "He did seem happy to have you join them for a few days before the trip.", "In the edit, I mentioned a place that's very important to my family heritage. We hadn't yet been to that place, and I wanted to stay on the trip to see it. It was local to the area we were staying it, so it wasn't out of our way or anything. There was a 4 day event that Rob wanted to attend, so we had been doing that instead. That leg of the trip didn't involve any travel until the same day my flight was scheduled.  \n\nRob has issues with mobility. I had brought up with Logan that I would be slowing down their ability to travel, and Logan said that with Rob's existing mobility issues, I wouldn't be slowing them down at all. Nothing they'd planned was physically demanding. I also am not in that much pain.", "Thank you for the well wishes. It's been about a month since the accident, and I'm healing well. \n\nI've asked Logan, and Logan said that \"that's just how Rob is sometimes\". Logan couldn't pinpoint any moment where things changed, and thinks that Rob might have just been exhausted from traveling so much.", "Rob literally offered to pay for OPs expenses. I'd say that's a pretty good indication.", "Rob told me directly that he was excited his \"other son\" would be joining the trip, and I felt that he meant it. Rob has called me his \"other son\" as a joke for years because I often join in on the manual labor he asks Logan to do and as a way to express that he feels like I'm part of the family.", "Logan and I were riding bikes and I got clipped by a car. It wasn't dark outside, I was wearing a helmet, and I was in a bike lane.", "Except they talked to Rob about it before she even went and he was happy enough to offer to pay her expenses. If he was gonna be upset at her presence that was the time to be mature and say “Sorry, I just want to do a father son thing.” Its childish to approve an invite then act like a dick when they arrive. It’s not an insane thing to ask to join your long term boyfriend for 6 days out of a three month trip.", "Read the edit", "You should read the edit", "I was always a Logan fan but I had a secret spot for James in my heart. Carlos just reminded me too much of my brother.", ">you crashed the vacation. \n\nRob happily agreed to it beforehand and even said he'd pay. Learn to read", "You should read the edit", "someone happily offering to pay for your entire trip doesn't really sound like not wanting them there man learn to read", "If a grown man can’t say no, it’s a him problem. Come on. He was even excited about it.", "https://www.reddit.com/r/AmItheAsshole/comments/14b4trk/aita_for_being_upset_after_getting_kicked_off_a/joe5nfh/?utm_source=share&utm_medium=ios_app&utm_name=ioscss&utm_content=1&utm_term=1&context=3", "What he expressed to me was that I needed to leave because I got hurt. I partly wonder if he actually was just annoyed with Logan and I being there, and he wanted an excuse to get rid of us.", "I can't remember specifically what he said, but the broader context of the conversation was that he was disinviting me from the trip now that I had been released from the hospital.", "? What's changed? All I've done is give more context that I couldn't originally include in the post because of the word limit.", "Ahh I remember reading about this \"ask vs guess\" thing. Askers will feel free to ask for whatever crazy rude inconvenient things they want, and are supposedly fine with being told no. Whereas Guessers will only ask for something if they are very sure it's a reasonable thing to ask for and the other person will say yes -  and if the answer isn't yes then the other person is rude for refusing.\n\nThe problem is, not all Askers are being okay with being told no. Like you say, she's probably asking to come on the trip assuming she's actually being a Guesser and it's a foregone conclusion that she is welcome. And she probably would have been offended to be told no. Rob caught onto that and felt guilted into allowing her to come, since in this setup, OP and Logan were under the impression that the default answer should be yes, and would feel that Rob saying no would be unreasonable. Even though it would in fact have been totally reasonable from an outside perspective.", "How is this her fault? She asked, and he could have used his big boy words and said no. And no matter what, it was never ok to treat an injured person this way. Talk about adding insult to injury. \n\nOP is NTA", "That's a fair reading of the situation, I suppose. They'd planned a two month long road trip and I asked to join them for 6 days.\n\nThe context around that is that I had been invited on a previous trip, but I couldn't go because I didn't have enough PTO. When this trip came up, Logan specifically mentioned that he wished I could come because they were stopping at a place that's very important to my family heritage. I mentioned that I had enough PTO to go for a short while, and Logan was excited and said we should ask his dad. So we asked.", "Alternatively. Rob could have acted like an adult and said he would rather it stay him and Logan. But he didn't, he even offered to pay for all of OPs expenses to the point where OP had to insist on paying for their own flight.  And then Rob had a toddler tantrum when OP was a slight inconvenience.", "Logan and I were riding bikes and I got clipped by a car. It was in a pedestrian area, and I was following all laws and wearing safety gear. It wasn't a dangerous accident at all; the woman who hit me was going very slow, she just happened to take a turn too tight. What hurt me was falling off the bike and hitting the pavement, I didn't have any injuries caused by the car. It was just a random accident that could have happened to any of the other dozens of people riding bikes. \n\nIt was Logan's idea to go on a bike ride. Rob had gone to take a nap at the hotel and Logan and I had a few hours to kill before meeting up with him again.", "I've replied to a few other people with these details -\r  \n\r  \nLogan and I were riding bikes and I got clipped by a car. It was in a pedestrian area, and I was following all laws and wearing safety gear. It wasn't a dangerous accident at all; the woman who hit me was going very slow, she just happened to take a turn too tight. What hurt me was falling off the bike and hitting the pavement, I didn't have any injuries caused by the car. It was just a random accident that could have happened to any of the other dozens of people riding bikes.", "Logan and I both don't drink. I'm not someone who drinks/parties as is, and I didn't drink or party while on vacation. \n\nI've replied to a few other people with these details -\r  \n\r  \nLogan and I were riding bikes and I got clipped by a car. It was in a pedestrian area, and I was following all laws and wearing safety gear. It wasn't a dangerous accident at all; the woman who hit me was going very slow, she just happened to take a turn too tight. What hurt me was falling off the bike and hitting the pavement, I didn't have any injuries caused by the car. It was just a random accident that could have happened to any of the other dozens of people riding bikes.", "You're either extremely adept at being misleading, or NTA. It kinda sounds like the trip wasn't going that well and then you gave your boyfriend a reason to escape his father that his father took personally.\n\nHas Logan ever mentioned abusive or gas lighting type behavior when he was growing up?", "With the idea of chronic pain flaring up and the plan to be on vacation today trip for two months with a potentially prickly person, this kind of jives. There's a difference between expectation and actuality on these types of vacations.\n\nAs a chronic pain sufferer, I give family and friends a quick heads up on my pain level the is impact on my my mood and what I'll be able to handle. I suggest talking with Logan and asking him where Rob's head is at with the invite. Like Rob might not see it as negative or terrible as you've viewed it. His behavior was really terrible, but that could change the way he remembers it if he was lashing out. Doesn't excuse his poor behavior. Protect your boundaries.", "Honestly, Rob having chronic pain explains it all to me. Pain can make people incredibly mean and nasty, even when they're the nicest person normally. It sounds like Rob has a history of getting nasty, and I'm vetting it's when his pain is bad. A long road trip likely wasn't kind to him, and he was lashing out at the easiest target.", "My only unanswered question is how the accident happened. If it was the result of intoxication and you have a habit of overindulging, or if you were participating in risk seeking behavior, I think asking you to find another ride back is pretty responsible behavior, though I think he should have said that explicitly. If it was truly a fluke, which certainly is possible, his behavior is unwarranted.\n\nThe way you avoid saying what happened that caused the injury puts up my radar around substances, but I’m around a lot of addicts so I may be biased.", "Could Rob be addicted to pain meds?", "So, you were going for six days. Day you fly in, the 4 day event Rob wanted to go to, and flying out day. When exactly were you going to the “place important to your family heritage”?", "I feel like this is it. \"Logan said that with Rob's existing mobility issues, I wouldn't be slowing them down at all\"\n\nLogan speaking for Rob because he cares about you dearly and wants you there. Maybe even in spite of what's best for Rob. You getting in accident sucks and I'm so sorry it happened. But I imagine the hospital visit took up a whole day where Logan was with you and Rob was on their own waiting to pick you guys up. The circumstances suck cause you had finally had enough PTO and were already there but I really feel like you should have left after the accident. It sounds like Logan is very used to Rob's behavior and brushes stuff off and pretty much did the brushing off for you. \n\nI don't think you're an asshole but you prioritized seeing this thing (which you know Logan is probably going to stick by you during) over allowing Rob to get back to his father/son trip without having to worry about the newly VERY injured party.", "[deleted]", "Damn that really sucks, I’m sorry that happened to you, and I hope you are able to make a full and swift recovery.", "Hope you feel better!", "Oddly, Kendall looks a lot like on of my brothers 😂", "Yeah I know she was hit by a car. But I’ve had jaw surgery lol and there’s no way in hell I’d be going out for 4 more days. I’m not saying she’s lying, I’m saying she needs to relax and take care of herself. Leave those dudes to argue alone and take care of her health.", "Sounds like he wasn’t ok with you joining them but didn’t feel he could say no for whatever reason. In any case, NTA. His behavior was horrible.  I hope your recovery is going well!", "How did you get injured?", "It’s definitely true that not all Askers are OK being told no. I just think that probably makes them an AH. Much like any Guesser upset that someone couldn’t read their mind and therefore they didn’t get what they wanted.\n\nI was definitely raised in a Guess household. My spouse was not. Now I think I’m kind of a hybrid.", "Exactly. This reads to me that Rob is just extremely immature. If he didn't want OP there he shouldn't have offered to pay their expenses.", "She could have even a modicum of social awareness by not asking to crash a father-son trip she wasn't invited to.\n\nFurther, she could have been more aware of how her presence was impacting the trip. This wasn't a trip with her boyfriend. This was a father son trip that she was crashing.\n\nThere is a zero percent chance that her socially clueless sellf wasn't directly changing the itinerary, the time the father and his son were spending together, and the focus of the trip at large.\n\nThen, she broke her shoulder and jaw, and she still wanted to continue to impose on this trip that she invited herself to.\n\nFinally, she gets butt-hurt and is holding a grudge because the father did the sensible thing and told her to take her injured-ass home.", "Just because you were invited once before does not make every trip an open invitation to you.\n\nSounds like Rob wanted an uninterrupted father son trip. Couldn't say no to his son (you'd be writing a different AITA if you'd been told no to begin with or if Logan decided not to ask him), because he wanted/knew he would have the rest of the trip to spend with his son, and for the sake of being nice said yes.  \nWhen you arrived, the interruption hit Rob more than expected.  \nThen with you injured, the trip would slow down/ be different even more.\n\nTo top it off Logan chose you over his dad.  \nCompletely ending the father son road trip.\n\nDo you see what inviting yourself did?\n\nNow Rob is inviting you both to dinner. Heck he could have been wanting to make amends for the way he acted.   \nBut no, you & your autonomous self want to stay home.\n\nYTA", "Then you are both AHs for changing a father son trip.", "Ehh I think then we’d be reading an AITA post where OP is hurt Rob wouldn’t let her join the father-son road trip.", "Then NTA. Seems like the dad was going through something. I think you should be careful not to take out what happened on your boyfriend. He had no control over it and sounds like he had your back as much as possible. He didn’t choose his parents. I’m sure the dad will come around to what happened.", "I'm not super comfortable sharing certain aspects of their relationship because it's not my story to tell, but I will say that I've witnessed Rob say/do things most people would consider crossing a line. I've only addressed this with Logan, and his take was that he knows how his dad is, but he has a desire to have a relationship with Rob.", "Sounds like he wasn’t ok with you joining them but didn’t feel he could say no for whatever reason.", "I have a family history of addiction and avoid any substances stronger than caffeine. I totally understand the scrutiny, though. \n\nLogan and I were riding bikes and I got clipped by a car. It was in a pedestrian area, and I was following all laws and wearing safety gear. It wasn't a dangerous accident at all; the woman who hit me was going very slow, she just happened to take a turn too tight. What hurt me was falling off the bike and hitting the pavement, I didn't have any injuries caused by the car. It was just a random accident that could have happened to any of the other dozens of people riding bikes. \n\nThe woman who hit me was elderly and extremely apologetic. \n\nI was sober during the accident, and I'm a very risk-adverse person.", "The 4 day event started the day I flew in. The place that was important for me was going to be an all day thing on Day 5. \n\nI also want to note that I insisted on ubering to them from the airport so they didn't have to leave the event to pick me up.", "Or …hear me out… people can use their big boy words and say they don’t want her to join the trip before it happens", "She didnt kidnap their vacation, OP said it was a really long one and other family friends would aslo meet them during the course of it. If Rob didnt want her there, he should have just said so or made an excuse, he didnt and instead expressed that he was happy that she would go.", "I've replied to a few other people with these details - \n\nLogan and I were riding bikes and I got clipped by a car. It was in a pedestrian area, and I was following all laws and wearing safety gear. It wasn't a dangerous accident at all; the woman who hit me was going very slow, she just happened to take a turn too tight. What hurt me was falling off the bike and hitting the pavement, I didn't have any injuries caused by the car. It was just a random accident that could have happened to any of the other dozens of people riding bikes.", "I was raised in a mostly Guess-leaning household but I am on the super extreme end of Guesser, I don't ask anyone for help unless like, my house is flooding or someone died. I do get resentful when Askers ask me stuff like \"hey can you take off work tomorrow and pick me up at the airport in the middle of rush hour!\" Like, are you fucking serious?? Yes I do think it's rude to ask for ridiculous things like that instead of the Asker just paying $50 for an Uber. \n\nI understand some people think \"no harm in asking,\" but I disagree. I do think there is harm in asking for unreasonable favors. It shows that the Asker feels so dismissive and disrespecful of your time that they would even ask you such a thing just so THEY could save $50, and it also feels like they are trying to unfairly exploit your relationship for their gain at your expense.\n\nBy the way, the airport example actually happened. I told the person no. They freaked out and said I was being uncaring and unsupportive, and didn't talk to me for months. I'm now.. very low contact with that person, lol.", "^^This is it right here", "Logan has been a godsend during this whole thing, and I've made sure he knows how much I appreciate him.", "Seems pretty straight forward to me, in that case. If your accounting of the conversations are accurate, you basically have the option where Rob was a jerk by telling you it was going to be fine knowing he wasn't happy with it, or Rob is a jerk because he decided after you were there he wasn't happy with it and then you ended up making him change his itinerary.\n\nTo all the people who are eager to shred you for daring to show interest in visiting them on their trip: grown adults can use their words and you don't have to assume this was some sacred pilgrimage or that she used her feminine wiles to manipulate an invitation.", "So you know the relationship between Logan and his dad is rocky, and you know Rob can have mercurial mood changes, and you still thought “It would be great if I tagged along on this trip!” Idk seems like this was a shitty idea start to finish.", "Fair enough. A resounding NTA. I’m sorry that all happened, what a terrible vacation", "Definitely turned out to be the most expensive vacation I'll ever take. \n\nThank you for the empathy."]}