{"id": 19853, "submission_id": "14bbw9o", "title": "AITA For reminding my parents that I’ve “learned my place” and it’s not my role to be his parent when they are desperate and have begged me to help with my out-of-control brother?", "selftext": "For the sake of this post, my brother will be named “Miles.” Miles has had behavioral issues since he was a little kid. It was easier in the moment for my parents to just let Milo have his own way, which after years of doing. essentially taught Miles how to get what he wanted. He could have an actual behavioral disorder, and I’ve told my parents to take Miles to a psychiatrist many times. But every time, my parents have refused, told me I’m not Miles’s parent, and to learn my place as his sibling. Same reaction every time that I’ve told them to either start enforcing boundaries or seek any kind of outside help for Miles.\r  \n\r  \nMiles is currently 16 but I moved out when he was 14. My parents still regularly update me and the rest of the family on his behavior. Since he hit double digits, I’ve lost count of how many times the police have brought Miles home because he was caught shoplifting/vandalizing property. Or the times that he’s been sent home early/suspended because he did something stupid at school. This year, Miles’s school didn’t formally expel him but basically requested that my parents enroll Miles in a different school next year because the current school “can’t meet his needs.” Miles has been acting out even more because he knows in August that he’s going to be stuck at a different school where he doesn’t have any of his friends.\r  \n\r  \nMy parents came to my place recently and told me that they want my help because they can’t control Miles anymore. They say Miles doesn’t respect them at all and that they’re hoping Miles will respect me more and see me as an authority figure. I told my parents that this makes no sense, they’ve made it clear to both me and my brother that I’m just his sibling and that I’ve never had any authority over him. I reminded them how they didn’t want my help or input back when Miles was younger and more manageable. If they truly can’t handle him, then they need to turn him over to professionals; Bootcamp, in-patient therapy programs, boarding school, I know they have the money for it. But I’ve “learned my place” as Miles’s sibling and that it’s not my role to be his parent.\r  \n\r  \nSome other relatives have reached out and told me that my “learned my place” argument was “petty and childish” because Miles isn’t a little kid throwing tantrums anymore and my parents are desperate because normal teenagers don’t get in constant trouble the way Miles is right now. They told me that I’m the best person who could help Miles because teenagers don’t respect/listen to older family members regardless. And because I’m closer to Miles’ age, he’ll see me as more relatable and will be more inclined to listen to me and my opinion. Or what I’m predicting will happen; Miles isn’t going to magically turn around after living with me and then I’m going to be held responsible if he does something stupid. I know that I’m coming across as very callous, but my help wasn’t wanted before so I don’t see how Miles should be my responsibility now. AITA?", "created_utc": 1686959954, "permalink": "/r/AmItheAsshole/comments/14bbw9o/aita_for_reminding_my_parents_that_ive_learned_my/", "score": 243, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1. I am refusing to help my parents with my out-of-control brother\n2. I know my parents are desperate. And family members are saying that I am the best person to help, because teenagers don't respect older family members regardless. And because I am closer to my brother's age, he will see me as more relatable and respect me more.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Oh gawd NTA!\n\nNot your circus, not your monkeys.  They are the parents.  It is up to them to figure out how to deal with Miles.  \n\nTell anyone who wants to butt in that you are not a professional who is qualified to help and you are not Mile's parent.  If they care to help the parents then they are certainly welcome to go to them, not you.", "NTA. Your parents may be desperate, but their belief that YOU can turn Miles around is delusional. \n\n\"NO! I've been telling you for years that Miles needs professional intervention, and I AM NOT IT! I won't be a party to your attempt to ensure that Miles doesn't get the help he needs. I am neither trained nor skilled in dealing with someone with his issues, and if you make it *my* problem to solve, nothing will change, and Miles will end up in jail. So, I am having no part of this. Ruin Miles' life if you must, but don't make me complicit.\"", "Woah, woah, woah. NTA.\n\nThey are putting you in an unwinnable position and it is NOT (nor has it ever been) your place to be the mature parent. Your extended family is acting like mom & dad's flying monkeys by telling you that you were \"petty\" for reminding them of their words and for trying to guilt you into taking on a role that was never meant for you. \n\nStay strong. And get some support. This might get messy.", "NTA. It’s not like the behavior issues are new, they waiting until he was damn near an adult to seek help. It is NEVER the sibling’s responsibility to pick up the slack of their parents. \n\nPlus, you’re right, he’s a liability. If he acts out in an extreme way because he’s upset that he has to live with you, you’d be responsible.", "NTA.  After many years of not fulfilling their obligations and telling you to mind your own business...\n\nNOW they want you to handle their responsibility willingly?\n\nIt's not callous at all to tell the parents to take a long walk on a short pier.  Your brother is exactly what they wanted him to be.  That's not your problem.\n\nIf you wanted to TRY to help your brother, that would be a valid choice for you to make.  But you are not qualified, so others trying to strong-arm you into doing something are clearly assholes...", "NTA!! \n\nIt sounds like things were probably easier for them when you were still home and able to deflect, but now they're all alone with him and he's almost an adult. \n\nI think it's crazy to blame the fruit of their shitty parenting on you!", "NTA. You are 100% correct - your brother needs professional help. You do not have the training to handle him. It's not fair to you for your parents to try to foist responsibility of your brother onto you because they failed. It sounds like all they want is to make the problem go away the easiest way possible - give it to you. And, I suspect their resistance to professional help is from an old, ingrained stigma attached to psychiatric care (and, by association, to the families of those who receive this care).", "NTA. You are not the parent.  This mess is not your responsibility", "You are not Miles's therapist or parent. It's astonishing the gall your parents have trying to dump your brother on you because they don't want to deal with an issue they have allowed to fester. NTA", "NTA - The reality is that you are NOT Miles' parent.  You are his brother.  Even if they hadn't told you before to learn your place, the fact that you aren't his parent means that this isn't a role you have to serve.  Your parents may need to seek professional help, but your brother's behavior is NOT your problem to fix.", "Nope, not your problem. Let them figure it out.", "NTA. Your parents failings should not fall on you.\n\nRegardless as to whether your brother has any kind of behavioral disorder or not, your parents have already failed him. They have blindly let him run riot for his whole life and not he's being asked to change school, they want you to step in. \n\nYou have your own life to lead, and being parent to an unruly teen that your parents can't control is not it!", "NTA.  Unless your parents are psychologists,  they have no clue how relatable you will be to him. \n\nYour parents enabled his behavior and ignored your suggestions because you weren't his parent.  Now they are trying to get you to be a parental figure. \n\nYour brother is a thief and a vandal and has never had boundaries enforced. He could be a danger to you. \n\nYou're right about suggesting other options.  I don't think you have the training needed to help him. More importantly,  you shouldn't have to. He's not your child or legal responsibility. He's your parents' responsibility and also the result of their bad parenting.  Your parents need therapy as much as your brother.  They need to learn how to cope themselves.  Not suggest you allow a disturbed individual into your home.", "NTA. You made your case to your parents. What do they expect you to do? Let the kid move in.", "NTA. Your parents dug their graves and now they have to lay in them. They're exhausted from dealing with a problem of their own making and want to push it onto you so you can take the brunt of it. Your brother does need a lot more than just a close figure to listen to, he needs professional help (like you suggested but your parents ignored you). Everything you said is correct and any relative trying to pressure you into taking him in is hiding behind the excuse of 'he wont won't listen to me im I'm too old' so they aren't expected to take him in.", "NTA, you tried helping and giving them solutions before, but they refused the help then & honestly \"learn your place\" is something I could never imagine telling my own daughter no matter what the context (unless she's talking shit while we're playing a game, I might jokingly say it as I whoop her in said game). \n\nYour parents reap what they sow, you offered them good advice, once again. And they once again ignored it. \n\nOne of the worst things you can do with a troubled/troublesome teenager is to try and have a younger family member intervene, especially if said teenager clearly has issues that require professional help. \n\nStand your ground, ignore the extended family who think you're being childish or tell them that you've tried before & the way you were treated due to it, makes you not want to try again.", "NTA not your son not your problem, they made that clear years ago. They should've gotten him professional help a long time ago. This is all on them not on you. Keep doing what you're doing.", "NTA. I would offer to give your parents sane advice on how to proceed with Milo in exchange for a sincere apology for treating you like shit when you were a kid. You tried to give them sane advice years ago and they snubbed you. If they are ready to listen to your opinion and take your advice, then they can have it. But that’s all you are offering. You are not stepping up as a parent, especially after their past treatment of you.", "NTA and wow, I am sorry your parents suck so much. They're trying to pin 100% of the responsibility for Miles' behavior on you while giving you 0% of the power to actually do anything. If they were ACTUALLY interested in helping their son, they would be banging down the door of any behavioral therapist who would take him. A sibling is not a substitute for professional help, so that shows they aren't really serious about finding a solution. They just want a scapegoat, and they're already starting that process by badmouthing you to the relatives who called up to complain.\n\nThey've failed both of their children frankly.", "Do not have Miles in your home under any circumstances, your parents need to deal with him or as you say outsource him to professionals. NTA", "NTA\n\nYour parents created him, \nRejected your help when you offered, told you to learn your place.\nAs you pointed out, youve learned your place.\n\nYou should not do what for your parents are asking because you are correct, they will blame his lack of turning around on you.  Then rather than them complaining about what a little shit he is, suddenly they will be complaining that you shouldve done X or Y or Z and that would have surely caused him to change.  But if they know X Y and Z they can do those things now.\n\nBut he has been in this pattern of bad behavior with no consequences for his entire life- 16 yrs.  So that pattern is very deep and wide in his consciousness, and will require massive effort skill patience and stamina to help him change his pattern of living to be constructive rather than destructive.  He isnt exactly feral, but he is not far from it.\n\nSo i second your recommendations to your parents - he needs more intensive oversight than you can provide.  \n\nThey need  to check into boot camp, some type of intensive IP therapy /behavior modification, wilderness program, Outward Bound, military school or the like. \n\nHe didnt get like this overnight. It took 16 yrs and  he is not going to change overnight. It will require a long term commitment from your parents and the patience to see it through.  \n\nAs your parents now realize, he is past their ability to redirect him, and he is past your ability to help him as well.  \n\nYour parents created him and they will have to be the ones to facilitate the long term process of helping him change so he can become independent and support himself in life", "NTA with a caveat. Using your parents words \"learn your place\" against them is a little petty, but the underlying point is sound and valid.\n\nMiles has been taught you are not an authority figure and that can't be changed now. He's also been taught your parents outrank you, so anytime he doesn't like your rules he'll go running back to them.\n\nThe idea that he'll obey you because you are closer to his age is also absurd. Peers aren't authority figures, they are peers, so your age is a detriment to trying to reign him in. \n\nYour parents need professional help, or at least a family member with more authority than your parents. Like a strict grandparent, aunt, or uncle.\n\nYou are not an ahole for refusing to voluntarily accept responsibility that isn't yours, especially when your earlier efforts at assisting were rejected.", "NTA. You tried to warn them. You are right, he needs to be sent to professionals, and yeah they are going to blame you for his actions.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nFor the sake of this post, my brother will be named “Miles.” Miles has had behavioral issues since he was a little kid. It was easier in the moment for my parents to just let Milo have his own way, which after years of doing. essentially taught Miles how to get what he wanted. He could have an actual behavioral disorder, and I’ve told my parents to take Miles to a psychiatrist many times. But every time, my parents have refused, told me I’m not Miles’s parent, and to learn my place as his sibling. Same reaction every time that I’ve told them to either start enforcing boundaries or seek any kind of outside help for Miles.\r  \n\r  \nMiles is currently 16 but I moved out when he was 14. My parents still regularly update me and the rest of the family on his behavior. Since he hit double digits, I’ve lost count of how many times the police have brought Miles home because he was caught shoplifting/vandalizing property. Or the times that he’s been sent home early/suspended because he did something stupid at school. This year, Miles’s school didn’t formally expel him but basically requested that my parents enroll Miles in a different school next year because the current school “can’t meet his needs.” Miles has been acting out even more because he knows in August that he’s going to be stuck at a different school where he doesn’t have any of his friends.\r  \n\r  \nMy parents came to my place recently and told me that they want my help because they can’t control Miles anymore. They say Miles doesn’t respect them at all and that they’re hoping Miles will respect me more and see me as an authority figure. I told my parents that this makes no sense, they’ve made it clear to both me and my brother that I’m just his sibling and that I’ve never had any authority over him. I reminded them how they didn’t want my help or input back when Miles was younger and more manageable. If they truly can’t handle him, then they need to turn him over to professionals; Bootcamp, in-patient therapy programs, boarding school, I know they have the money for it. But I’ve “learned my place” as Miles’s sibling and that it’s not my role to be his parent.\r  \n\r  \nSome other relatives have reached out and told me that my “learned my place” argument was “petty and childish” because Miles isn’t a little kid throwing tantrums anymore and my parents are desperate because normal teenagers don’t get in constant trouble the way Miles is right now. They told me that I’m the best person who could help Miles because teenagers don’t respect/listen to older family members regardless. And because I’m closer to Miles’ age, he’ll see me as more relatable and will be more inclined to listen to me and my opinion. Or what I’m predicting will happen; Miles isn’t going to magically turn around after living with me and then I’m going to be held responsible if he does something stupid. I know that I’m coming across as very callous, but my help wasn’t wanted before so I don’t see how Miles should be my responsibility now. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA tell your parents that you can't help him either and they need to send him to a good boarding school with discipline and therapy. After they agree, then talk to your brother and get him to also agree.", "NTA, they didn’t want you when you flagged it when you were younger so they shouldn’t expect it now", "They think he will listen to you? Hahaha Hahaha,  not!  NTA.", "NTA.  They are reaping what they sowed.", "Your relatives are right: Miles isn’t a little kid throwing tantrums anymore. He’s a big kid throwing tantrums. NTA.", "NTA.  He needs medical care.   (to be clear, not a 'boot camp', those are just state sanctioned child abuse hell holes).    He needs a doctor, a psychiatrist, a therapist.    And that's your parents' problem, not yours.  Do not allow that child in your home.", ">Some other relatives have reached out and told me that my “learned my place” argument was “petty and childish” \n\nI can't stand when people not involved in a situation are the first to tell you what to do.  Tell them that since they seem to have a better understanding of the situation than you, then you are sure they will step up and take in Miles to help your parents out.\n\nNTA", "NTA\n\nI hope your parents don’t have a key to your house because I bet you will come home and he will have taken over a bedroom.", "You to parents:  \n\n\"The only sentence I'm willing to hear from you that contains the word 'Miles' is 'We've taken Miles to see a psychologist.'  As far as I'm concerned, your failure to do so sooner constitutes medical child neglect.  Miles is clearly disturbed, and soon he'll be 18 and beyond your reach, with terrible problems you didn't bother to get treatment for.  I won't collude in your terrible parenting.  And therefore, if you so much as mention Miles again in a different sentence, I will block you.\"  \n\nNTA", "Would they refuse to take a kid with cancer to a doctor but insist you somehow cure him?  This isn’t much different.  NTA", "NTA", "NTA", "NTA stay out of it because either way it will bite you in the butt. Because if you do try to help, and it doesn't work, that's a whole new argument that will be made that you didn't \"try hard enough\" or your \"incompetent\".\n\nSadly they made their bed and now have to lie in it.", "NTA", "NTA. He needs professional assistance. \n\nStand your ground. Anyone who doesn't like it can volunteer themselves instead.", "NTA\n\nNot your child, not your problem.", "NTA. Lol.  Well well well, if it isn't the consequences of their own actions.", "NTA - Keep your distance from these irresponsible people", "It’s a mess but not one of your making,nor one you can fix. NTA …  \n\n ( and NYP ..Not Your Problem.)", "NTA.\n\nAll other issues aside, your brother is clearly in need of professional help. If you get added to the mix, it's likely that the least bad thing that will happen is that your parents will blame you for not turning Miles's life around.", "NTA. Your parents dropped the ball with your brother, and now they want you to fix their mess? \n\nNo way, José. \n\nThis kid needs big-time psychiatric treatment.", "NTA\n\nYour parents didn't get him the care Miles needed and thereby contributed to his current behavior.  It isn't your responsibility to make an effort to fix your brother your brother when your parents have screwed him up.", "NTA in the least! Miles is NOT your responsibility. You are not his parent. And you, in my opinion, gave your parents several good options since they can't handle him. Anyone in the extended family trying to guilt you into doing more should take over for your parents since they seem to know soooo much.", "NTA. He's not your responsibility, and you tried in the past. Sounds like he needs to be evaluated by professionals and then either get therapy/meds or if there's nothing wrong he needs to go to an alternative school or military academy.", "NTA for not taking responsibility for him & not letting him move in, and you are right that you cannot and should not be expected to be the parental figure for ur brother. That being said, could you still be a friend to him? Obviously this is 100% ur choice & I dont know how u are now & what water is under that bridge, but maybe its a place to start & even offer as a deal to ur parents? Something like, ok I'll agree to take him out for dinner/coffee/whatever once a week  if u get him to a psychologist?", "NTA - they had every opportunity- and indeed responsibility, to address his behavior when he was young. Their lack of parenting has resulted in him being too far gone, and certainly no good can result from him living with you. Your use of “you know your place” is brilliant as a rejoinder. Parents - you reap what you sow. Now it will be ten times harder and he will still probably end up in prison.", "NTA. But get door cams and and new locks because they will probably try to drop him off at your home with luggage and force him on you", "NTA Good boundaries. This would be nothing but a nightmare for you. It's not your responsibility to fix what they didn't do.", "NTA. You tried to get Miles help when he was younger but got shot down. You aren't responsible for the way he is. Your parents have that dubious honor :) You are not obligated to try & straighten him out. Not your circus, not your monkeys.", "NTA    your parents made a monster, it's their responsibility to make him better. \n\nI would honestly block your whole family, maybe not forever, but definitely until they stop trying to foist your brother on you.", "NTA - Keep your boundary. Yes: *Miles isn’t going to magically turn around after living with me and then I’m going to be held responsible if he does something stupi*d.\n\nDo not waiver. You have everything to lose: physical harm, blamed for his actions (damaged property, assault). losing your life because you dedicate it to Miles.\n\nYour parents are desperate but they contributed to his current behavior by not seeking mental and physical health strategies and help throughout his life. I agree, he may have a valid disorder but you can't fix this. They won't support it and Miles will not agree. Folks like Miles unfortunately end up in youth detentions or jail (later). If he has violent actions he may need hospitalization when he encounters someone who won't take what he's dishing.\n\nYour family accusations of  being 'petty and childish' is not true. You were invested in the family. They chose to dismiss your input. You are obliging their wish.  Now is the time for them to humble themselves and seek professional help.", "NTA. Your parents are doing everything *except* getting Miles the help he needs. You are not a substitute for them or for professionals.", "NTA. Know how to help? Tell them to call 911 when he is out of control. Not your problem.", "Wait they want you to completely move him in with you?? I thought they meant have a heart to heart with him which you would still be NTA for saying what you did, but that is asinine that they would ask for such a sacrifice even after constantly shooting you down. Lazy parenting. I'm glad you're out of that household. My brother was the same and i love him but I'm so glad I stepped out of his life then. Stand your ground.", "NTA. Miles is not your burden. Now all of the sudden it’s too much for your parents to handle so they get to phone you in? \n\nWhat about your wishes? Do you not get a say in this? \n\nAs someone who works in the adolescent mental health field, it’s astonishing that they’ve gotten this far without resorting to any services. \n\nConnect them with inpatient behavioral services and do yourself a favor and distance yourself from anyone accosting you for not “helping out”.", "NTA.  I'd go have a chat with your brother.  Miles, your behaviour is a serious problem.  It's going to lead you to places that are dark and unpleasant.  I have honestly hoped that our parents would let you go to therapy etc for years as I want what is best foryou to be happy and healthy.  Know that if I can help you, you can reach out to me at any time, but also know that I am not your parent and at this point will not take that roll - even if our parents wish for that.", "NTA. They just want to dump Miles on you. It’s sad and not your duty to parent a sibling", "Not your kid, not your problem. Your parents made their bed, and now they got to sleep in it. NTA. Stay strong", "NTA honestly you gave them some good advice. I suspect ADHD. My son has it. He was never expelled however, I was asked to place him elsewhere. So I told him since he didn't respect authority he was going to behavioral school. He hated that as well.", "Nta.  You've given your parents good advice.", "Wait, are they trying to see if Miles can come live with you? So after denying your help for years they just want to drop their problem on you. I wonder why Miles is this way…", "Blimey. Absolutely NTA. Regardless of them dismissing your offers of help before you are his sibling, not his parent & frankly it’s ludicrous to try & get you to suddenly step in & parent him.", "NTA. They made the monster and now it can eat them. They are the causation of this issue. Refusal to discipline, understand and seek help for your brother has created such a disservice to him. He needs professional help and, at this point I am not sure it will help. As far as the “rest of the family”, that has something to say, they can open their doors for your parents and brother. I am so sorry you have to deal with these people, you deserve better parents. As a mom, I send you a hug. Please limit their access to you for your own mental health. And anyone else that agrees with them.", "NTA!!!! I have the same situation with my younger sister and basically disowned her out of my life because my parents expected me to parent her after they let her get out of control. I told them I never asked for a sibling and I am not the one who gave birth to her so parenting her is not my job. She's now in her late 20s and no better. Only difference is I refuse to engage at all with anything relating to her", "You don’t sound callous, you sound reasonable! You’re not a professional bad-boy wrangler and this is not your child to save. My prediction is that everyone involved knows damn well that you can’t fix Miles but they are tired and want to pass the buck and let your shit get destroyed for a change!", "NTA.\n\nIf you want to help, start a group chat with the family members who are involved in this. Express your concern that your parents spend more time talking about Miles’ issues or latest actions than addressing them.\n\nThey’re still refusing to help their son, despite the multiple times he’s shown them that he’s not ok. They claim to be “desperate”, yet they’re still not at the point where they seek professional advice?! This makes no sense. Point that out to everyone. \n\nYou want the best for Miles, you’ve been concerned about him for years. You don’t understand why they’re refusing to get him qualified help. It’s bizarre to you that they‘ve tried nothing, & claim to be done with their struggling child. And now think you should take him in & fix him, as if he’s subhuman. They’re twisting themselves inside out rationalizing abandoning him, & forcing him on you. \n\nThey need to find a psychiatrist that specializes in adolescents & behavioral issues. The two of them should go see the dr, get advice on how to handle Miles. Despite seeing what their lazy parenting approach has done to Miles, they’re continuing it.", "Yeah obvious NTA.\n\nIf it were me, I'd give a single \"not my problem\" and not reply to anymore messages or calls about this issue.\n\nActually, if it were my I might have already blocked their number.\n\nThey made their bed.", "Your parents are coming to the realization that *they* aren't the help that Miles needs. Which is good: that's progress. Unfortunately, instead of involving pros, they're now trying to turn to you. That's bad, and will not prove to be progress, nor will it be any help to Miles. Hold your position, OP.", "> try to foist responsibility of your brother onto you because they failed\n\nI hadn't considered this before reading the responses on here. I always knew I would be legally responsible if Miles does something stupid (I am honestly baffled that the cops were not called after the incident that lead to Miles being kicked out of his current school.) But I also realize that they'll probably blame me if Miles doesn't magically turn around while in my \"care.\"", ">Regardless as to whether your brother has any kind of behavioral disorder or not\n\nIt's possible he could but they've never taken him to a psychiatrist. What they should do is see if he has an actual disorder. If he's diagnosed, send him to an in-person therapy camp/program. If he's just spoiled, send him to boot camp. But that's something they would have to willing do and look into.", "If the parents are indeed psychologists, obviously, they didn’t pay attention in class.", "Exactly right.", "Those troubled teen industry programs are full of horrifying child abuse and neglect that parents pay a lot of money for. Don't recommend ops parents send the brother there.\n\nThey need to have him professionally evaluated and get professional (science based) recommendations for next steps. Maybe involve social services if needed.", "And this \"change\" will likely not happen adequately by the time he's 18yo. And can then decide he wants nothing to do with the \"correction efforts\" & stops participating. Leading to some very unpleasant accommodations.", "OP telling the brother about any plan is not his responsibility.", ">He’s a big kid throwing tantrums.\n\nI'm honestly baffled that his more recent \"tantrums\" (especially the one that lead to him getting kicked out of his school) haven't landed him in jail, or at least juvie.", "They don't have a key to my apartment, thank god.", "Absolutely. The fact that the parents are bad mouthing OP already to family members shows they're looking for scapegoats, not serious answers.", "My parents don't do any work in mental health. They're actually the type of people who say to others that having mental health issues isn't something to be ashamed of but would be very embarrassed and would try to hide if they or a family member had mental health issues.", "Technically, none of this is OP's responsibility. The brother **might** be more agreeable if the news is told by the sibling. Getting the parents to agree to boarding school seems more of a challenge than forcing the brother to go.", "Your parents may be doing something behind the scenes to prevent that from happening. Or, it could just be uneven (possibly racist, to your brother’s benefit) application of standards for behaviour.", ">they're looking for scapegoats, not serious answers.\n\nI hadn't considered this before reading the responses on here. I always knew I'd be legally responsible if Miles did something (I'm honestly baffled that his school simply requested him to leave instead of calling the cops over his most recent incident there.) But I also realize now that my parents would blame me for Miles not magically turning around while in my \"care.\"", "Yeah, you can’t set yourself on fire to keep others warm. Doing this would certainly make OP’s life difficult and with probably little reward because they’ll just go back to letting Miles get his way and enable his bad behavior. NTA", "Even from what little you've shared, they are clearly manipulators and have been for at least your entire life. They have no interest in solutions, just ways to avoid responsibilities and to blame someone else for their faults. There is no reconciliation with this kind of person.\n\nIMO, disconnect completely and move on with your life. They will continue to find ways to use and abuse your trust and good will, because to them those qualities are a weakness to be exploited. Find better people to spend your time with.\n\nMy family was similar."]}