{"id": 19857, "submission_id": "14bcs78", "title": "AITA for not letting my neighbor use my garbage can?", "selftext": "For context I live in a basement apartment and the top level is a house. I’ve lived here since April with nobody in the house up top but a large family moved in about two weeks ago. \n\nI got home from work last week and there was a bag of trash by my trash can, I knew it was the neighbors. I picked it up and put it in my trash can, no big deal but kindof annoying they put it over their fence onto my side of the driveway. \n\nI come home from work later in the week and my bin has been left open with two big bags of trash that weren’t mine. I simply removed the bags and set them on the upstairs neighbors side of the fence. \n\nWell today I got home from work and neighbor lady starts screaming at me about “why didn’t you just knock on my door to tell me you were moving the trash instead of putting it in my yard”, calling me a bitch and all the likes. I simply said she could’ve not put her trash in my trash can, “but hers is full” - I don’t care? I pay my own trash bill and you shouldn’t feel entitled to dump your stuff in my trash can. AITA for putting her trash on her side of the yard without speaking to her first? \n\nTLDR: Neighbor put their trash in my bin, I put it back on their side of the Fence, she lost her mind about it.", "created_utc": 1686962437, "permalink": "/r/AmItheAsshole/comments/14bcs78/aita_for_not_letting_my_neighbor_use_my_garbage/", "score": 47, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I told neighbor lady she simply had no reason to use my trashcan, she ultimately told me she told her child to do it and I said that I didn’t care, it was still wrong and it’s my property not hers.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA I had a neighbor who used to get up in the middle of the night before collection day and sneak her garbage in other people's bins because she was too cheap to pay for her own service. She didn't stop until a bunch of neighbors got doorbell cams and confronted her, it was hilarious.", "NTA, it's your bin, not hers. If she needs more bin space then she can either ask the council/landlord/whoever to upgrade or go to the dumpster and throw it there.\n\nHope this helps!", "NTA. Space in your can does not mean space for her trash. It means space for your trash. If hers is full, that’s her problem. Especially since you pay for that service.", "NTA. Why didn't she knock on your door before putting her trash in your bin", "NTA\n\nI have never had any problem with a neighbor coming over and asking if they can put an extra bag in my trash can or recycle bin. I always say yes. But if someone just started filling up my bin? I'd start putting it right back on their front doorstep.", "NTA, they should have asked, I come from a large family and we had that problem before and all we did was ask the neighbour and they were more then happy to put one bag one time in their bin on bin day", "NTA - Knocking on the door and having a discussion may have been a better way to handle it, but the way you handled it doesn't make you TA at all.  You pay for your trash, and she should pay for hers.  Letting her put stuff in the can the first time was neighborly.  Her taking advantage of it repeatedly is entitled.", "NTA. If you don’t start setting boundaries with them now it will get worse", "NTA. She put silently her trash into your bin, you removed it silently and returned back to her.", "NTA. You were just following their lead; they never spoke to you RE: using your trash can. They were fine doing it to you. You might want to mention something to the landlord to give them a heads-up in case that family tries to complain about you. Not that the landlord needs to do anything, but let the landlord know they are not friendly or neighborly. Her yelling was ridiculous And uncalled for.", "NTA\n\nIt's your property and you have the right to decide who uses the trash can. Your neighbor doesn't pay for it, doesn't own, and is rude to you so theres really no good reason for her to be using it.\n\nBesides her using your trash can is just going to lead to problems. What if she breaks something in your yard throwing bags over? What if her bags are ripped open and you get trash in your yard? What if this leaves no room for your trash? Yeah as someone else said you did the right by setting the boundary early and she needs to respect this.", "NTA.  Eff her.", "NTA - She has her own trash can. Maybe she shouldn't be throwing so much away if her's is full  and (assuming you're in the US) trashcans are dumped weekly. Also, if you don't let her use \\*your\\* trash service and \\*she\\* calls \\*you\\* slurs, she's the A-hole. \n\nI think any way you twist this story, OP is NTA", "NTA. She has her own trash can. This is really simple.", "NTA. She's just mad she didn't get by with it.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nFor context I live in a basement apartment and the top level is a house. I’ve lived here since April with nobody in the house up top but a large family moved in about two weeks ago. \n\nI got home from work last week and there was a bag of trash by my trash can, I knew it was the neighbors. I picked it up and put it in my trash can, no big deal but kindof annoying they put it over their fence onto my side of the driveway. \n\nI come home from work later in the week and my bin has been left open with two big bags of trash that weren’t mine. I simply removed the bags and set them on the upstairs neighbors side of the fence. \n\nWell today I got home from work and neighbor lady starts screaming at me about “why didn’t you just knock on my door to tell me you were moving the trash instead of putting it in my yard”, calling me a bitch and all the likes. I simply said she could’ve not put her trash in my trash can, “but hers is full” - I don’t care? I pay my own trash bill and you shouldn’t feel entitled to dump your stuff in my trash can. AITA for putting her trash on her side of the yard without speaking to her first? \n\nTLDR: Neighbor put their trash in my bin, I put it back on their side of the Fence, she lost her mind about it.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA, also neighbors can really suck, so sympathy.  If she produces that much trash, she should get a second trash bin, not steal services that don't belong to her.  Tell the landlord that the lady is leaving trash where it doesn't belong.  Most landlords have policies about that.  Considering how expensive it is to live in an apartment, I am not donating to anyone!  I pay for trash services, so I would be livid if a neighbor was doing that to me.", "Hahaha NTA. I'm sorry, but this kind of entitlement really grinds my gears. You were decent to let it go the first time, and she should have asked from the beginning. I can't believe she just popped it over the fence as well...", "NTA She put it on your side without saying anything.", "No, you're not the asshole. Speak to the landlord about it. They didn't tell you that they were going to use your trashcan. Sorry you have asshole new neighbors.", "NTA. Move along.", "NTA. Sure, maybe talking first would have been *better* but it isn't necessary either. They should have asked.", " NTA, you don’t have to travel to her in order for her to be a b****, you did what was easiest for you and still got her VIP treatment! Tell the landlord!", "NTA. You could have asked  why the fuck she didn't talk to you before stealing services from you", "YTA. I’m never going to understand how people can be so precious about the empty space in their bin.  As long as it’s not the wrong content or overstuffing it. \n\nOnce on public land it’s a free for all.", "Ok, your neighborlady is for sure TA...but im a bit sympathetic.\n\nOur city has 3 sizes of cans and theyre a specific style - you cant just buy whatever bin AND pickup for trash is pnly every other week. The extra bag tags are only sold from like 11am-2pm on weekdays at one location (my work hours). And theyre $10 per bag anyways. Its a racket.\n\nWe have the biggest bin, but sometimes we foster kittens and run out of space (or we miss a pickup and then are 2 weeks behind...). Ive definitely eyed up my neighbors bins the morning of pickup day...havent done it yet though. But its tempting. Lol", "In cases like this, I'm sure that just asking nicely would've yielded much better responses in the long run. Some people are willing to help out if you just talk to them. Communication can solve so many problems if people would just engage each other.", "And to ride her wave, she could’ve knocked to ask if it was okay to put the trash in there? But I digress", "I felt mildly guilty bc she did yell at me that she told her 7 year old to do it. But then I realized she’s even worse for telling her kid to go disrespect someone else’s property and now idc", "Absolutely.  She should have knocked and asked."]}