{"id": 19872, "submission_id": "14bhf7o", "title": "AITA for saying that I don’t want kids in front of my brother and sister in law who just had a baby?", "selftext": "My (F17) brother (M31) and SIL (F31) just had a baby boy almost a week ago. They struggled to have children for a while and ended up doing IVF to conceive. \n\nAfter they got home from the hospital, I went with the rest of my family to my brother and SIL’s house to see the baby. When I was holding him, my mom said something like “You’re gonna be such a good mom. I can’t wait for you to have kids.” And I just laughed and said that I’m not going to have kids. \n\nWhen we left their house, my mom said that it was rude for me to say I wasn’t going to have kids after my brother and SIL went through so much trouble to have their baby. But I’ve told my mom multiple times that I don’t want kids, so she shouldn’t have brought it up at all if she thought it would offend them. \n\nI think the only reason she made the comment about me being a good mom is because she always tries to convince me to have kids. She tells me that I’m probably going to change my mind about it, that I’m never going to find a husband because most men want kids, and just straight up says “You have to have kids”. \n\nMy brother and SIL didn’t even seem offended by my comment, I think my mom was just getting offended for them. And I don’t think it’s a bad thing to not want children and to tell people that. \n\nAITA?", "created_utc": 1686976538, "permalink": "/r/AmItheAsshole/comments/14bhf7o/aita_for_saying_that_i_dont_want_kids_in_front_of/", "score": 973, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I said that I don’t want to have children in front of my brother and sister in law who just had a baby that they struggled to conceive.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA.  You didn't say you hated kids or babies are smelly or people who have kids are terrible to the environment or really one of any dozen of things you could say that WOULD be offensive.  You just don't want kids.  Fine.  \n\nYour mom is offended because she wants you to have kids and you don't want to have them.  Well, she doesn't get control of that decision.  So that sucks for her I guess.", "NTA - the only way I (I'm currently 7 months pregnant and struggled to get pregnant for context) I can see this being offensive is if you completely out of nowhere on meeting a baby went on a long tirade about hating kids and never wanting one and how people who have them are stupid etc.\n\nYour mum brought it up, you quite politely replied with an honest answer that gives no general judgement about your family members deciding to have children. I genuinely see no issue. Not everyone is required to want kids just because other people want them and sometimes struggle to have them.", "NTA\n\nShe wasn't offended for them. She was using them as an excuse to get mad at you for calling out her BS. You are absolutely right. If it's such a touchy topic for them, why on Earth would she bring it up in front of them knowing you don't want to have kids? Also, I know tons of people, of all genders, who don't want children. Your mom is sorely misinformed about (for lack of a better word) breeding norms in humankind now.", "NTA. She already knew you don’t want kids but pushed the conversation in that direction anyways so you corrected her on it pretty straightforward. I doubt she’s actually upset because it was “rude” towards your brother and SIL, i’m confident she’s the one offended by it.", "Nta. It's becoming pretty normal to not want kids. My partner and I don't want children because we're both career oriented and we both very much enjoy our lifestyle, we go overseas twice a year, do weekend trips etc. (Something both my siblings and her sister are incredibly jealous of because they can't travel)\n\nI'm also very happy to be an uncle, baby sit my nephew and niece (I'm also her godfather).\n\nYour brother and SIL definitely aren't offended. Your mother is upset because she wants more grandchildren and obviously doesn't agree with your views that women can actually not want children.\n\nPlenty of men don't want children either. Don't let your mother make passive comments such as that and I would keep reaffirming your stance not wanting children.\n\nWho knows, in your 30s you may change your mind- but it's for you to change your mind, not your mother or any future partners to pressure you to do so.", "NTA - to thine own self be true", "NTA. It’s not like you jumped out of the blue to say you don’t want kids. Your mom tried using her words to manipulate and control you, and it’s not working so she’s calling you rude. Even if you did want kids- 17 is NOT the right age to be thinking about it. \n\nMy mom does the exact same thing. When I was 20 I was really into going to the gym and my curves got bigger as a result. Well my mum said I was getting fat, and my fiancé (don’t have one) would think I was ugly if I couldn’t even shed a few pounds (we use metric not imperial here) then I wouldn’t be able to fit in my wedding dress (I haven’t even bought it yet) \n\nMost of the time this comes from women who have lived their lives being pressured into the standards of others, and are jealous that you live in a time when you don’t have to do that. I’d say just ignore her when she says it, that’s what I did and it worked. Good luck!", "NTA. Why is your mother so hung up about her 17 year old wanting kids anyway? You're still a minor.", "NTA your mom is just mad you stood up for yourself. She probably thought she could keep you from arguing by talking in front of others", "NTA.  /r/childfree is your support group", "Sane people with kids aren’t offended because other people prefer not to have kids. NTA.", "NTA. you were just voicing your personal opinion when a comment was made regarding your future. if you do not want to be a parent that is absolutely fine, and the mom shouldn’t be that upset you that do not want to have children especially when you have told her multiple times and she is already getting grandchildren from her son. you are perfectly valid in your sentiments and your mother will hopefully understand your perspective.", "NTA.\n\nI promise they are in the newborn stage of asking THEMSELVES why they had kids… \n\nThey don’t find you rude.", "NTA\n\nMy mother still struggles with the fact that I (F 31) do not want to have children. She keeps telling me that one day I will want them and be ready. Just stick to what you want and your mom will have to get with the program eventually. You could ask your brother and SIL if it bothered them. But, since you didn't say anything bad about their baby. I'm gonna say they probably aren't offended.", "NTA.\n\nAnd as for that \"probably going to change my mind about it\" thing: we're in our mid-50s and have been married for decades, and still don't want kids.  It is far from inevitable.", "NTA", "NTA", "NTA", "Nta. You didn't say anything offensive, just stated your preference when *she* brought it up. Remind her that if she doesn't want you talking about being child -free, she shouldn't bring the subject up with you", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy (F17) brother (M31) and SIL (F31) just had a baby boy almost a week ago. They struggled to have children for a while and ended up doing IVF to conceive. \n\nAfter they got home from the hospital, I went with the rest of my family to my brother and SIL’s house to see the baby. When I was holding him, my mom said something like “You’re gonna be such a good mom. I can’t wait for you to have kids.” And I just laughed and said that I’m not going to have kids. \n\nWhen we left their house, my mom said that it was rude for me to say I wasn’t going to have kids after my brother and SIL went through so much trouble to have their baby. But I’ve told my mom multiple times that I don’t want kids, so she shouldn’t have brought it up at all if she thought it would offend them. \n\nI think the only reason she made the comment about me being a good mom is because she always tries to convince me to have kids. She tells me that I’m probably going to change my mind about it, that I’m never going to find a husband because most men want kids, and just straight up says “You have to have kids”. \n\nMy brother and SIL didn’t even seem offended by my comment, I think my mom was just getting offended for them. And I don’t think it’s a bad thing to not want children and to tell people that. \n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA - You are allowed to choose not to want to have kids & you can flip between that choice as many times as you want to until you are in at the right stage & deciding if it's right for what you want. Your mum will have built up the dream image of her grand children, but life doesn't always work the way you expect. As long as you are living a healthy life & doing what you want to do, she should be happy for you, whether that's with children involved or not. She has her grand child now from your brother, so she can't say she won't ever experience it.", "NTA! I am 37 and have been saying my whole life that I don't want kids and no matter how many times my mom and my Italian aunties have told me I would change my mind, guess what? I have not changed my mind. You did not disrespect your bro and SIL's fertility struggle by not wanting to have your own. It sounds like they are well adjusted and absorbed in caring for their newborn and did not register your comment. Not everyone has baby rabies and is obsessed with having them. (Liking babies is fine, wanting them is fine, I have a big problem with people who are obsessed with OTHER PEOPLE having babies! Mind your own business overbearing moms/aunts/grandmas!!!) I have a bunch of nieces and nephews and I will take being the 'cool aunt' who gets the best toys over being a mom any day! Kids are great, but, only if they are not mine and I can give them back. My uterus is purely decorative!", "NTA.\n\nYour mother is just looking for a chance to berate you. Why mothers do this no one will ever know.\n\nGo LC on her and see if that stops her from enjoying getting up on you.", "NTA, and IVF mama here. Hearing someone say they don't want children doesn't offend me. Everybody doesn't want kids.", "NTA \nYou said your said you thoughts\nYour moms upset Because that’s her dream", "Your 17. I'm 31 with kids that were not easy to have. If my 17 year old sister said she didn't want kids I would feel relieved. Nta", "NTA. She's just doing everything she can to slowly guilt you into it", "NTA\n\nIt isn't rude. But noone will believe you.", "NTA - Didn’t make a blatantly rude comment and it was on topic. Just gotta respect your wishes on just not having kids", "NTA\n\npretty weird thing to say to your SEVENTEEN year old to begin with. but also not everyone wants children. that’s fine. it’s not like you said something mean or offensive about babies or parents", "Nta. However I think there could be compromises made such as withholding certain information during certain times. Maybe your mother didn’t think it was the appropriate time and place to express that. There are phrases you could say that express neutrality like “awww really?”(if she complimented you, she’s expressing to you that you appear comforting and nurturing to the baby). Flat out dismissing the compliment could be what also upset her in this case.", "NTA\n\nYou didn't say anything offensive or rude about their baby or kids in general for that matter\n\nIt's not offensive to not have kids. As someone who doesn't want kids as well I don't understand why people can't get their heads around the fact that some people just don't want to have kids. Your body, your choice you know", "NTA your mom keeps trying....she is trying to guilt you into deciding things her way, This is just one more manipulation tactic. Shut it down and let her know \"my body, my choice\"", "NTA", "NTA. From a young age, such as yourself, I knew I didn't want kids.  My mom tried to guilt me in my early 20's by saying \"who's going to take care of you when you're old?\".  To which I replied \"all the money I've saved by not having them\".  When I married my husband, who also didn't want kids, she let it go.  If you change your mind when you get older, no biggie.  As females it's our choice, not the previous generations to make it for you.", "NTA. It’s not like you told them having their kid was a mistake or something like that, you only stated something about yourself. Just because they had problems conceiving doesn’t mean every person NEEDS to have children just because they can. The whole you’ll change your mind is a giant pile of BS.", "NTA. \n\nMy brother has two kids. I have stated time and time again that I don't want them. Thats doesn't mean I don't love my niece and nephew. I spoil them, take them to museums, pumpkin patches and such. I would do anything for them but kids have never been in the cards as far as I'm concerned. \nIt's not like you said you hate their kid but some people are born to be parents and some are there to love and spoil their kids and give them back.", "YTA \n\nA lot of people with fertility issues hate when people who are fertile talk about not wanting to have children. And your mom is right, you’ll most likely change your mind in the future. After all, your body is made to carry and birth children.", "NTA. You just sound kinda young, no offense. I think where your mom's coming from is that you said it in front of a couple who went through something hard as shit. It can be the hardest thing people go through. It sounds like she just thought you'd have a little more self awareness. Your mom is being a bit extra about it but your response is the kind of comment I'd probably just keep to myself in the future if I was in front of someone who just went through something as hard as IVF. There's just a time and place. I know you don't mean it any kind of way, but people are sensitive as shit with fertility issues.", "NTA\n\nAnd, it’s ok to just say something like: “mom, stop discussing my hypothetical reproductive future please. I don’t like it when you do that.” And change the conversation. \n\nYou might change your mind, you might not.  But there’s no reason for you to have to keep relitigating it in your teens.", "Exactly, it’s not like I said anything bad about kids. I love kids and I love my nephew, but sleepless nights and lack of freedom doesn’t sound fun.", "Right? And also i find it very weird trying to push a 17 yo to have children, even if it is in the future. The last thing a teen is thinking about is having children.", "I don’t understand it either. Especially considering I have 2 other adult siblings who want kids, so she’ll get plenty of grandchildren.", "Mom wants a do over baby. I wonder if she has a good relationship with DIL. I'm guessing DIL isn't a doormat. OP, NTA at all. I've said since I was 10 years old I didn't want kids. I'm 33 and have two dogs. That's enough responsibility for me.", "I don’t give a fuck about what my body is “made to do”. Women aren’t just baby making machines and I actually plan on getting a hysterectomy as soon as possible.", "She didn't 'talk about it' she answered a question honestly.  She may change her mind in the future or she may not. I'm 53 and knew early on that I didn't want kids and never changed my mind. Her mum is TA for asking a question repeatedly and not liking it when she is given the same answer.", "That's a gross take. Just because someone's body can do something, doesn't mean they should or have to.", "Nonsense. Mum should not have asked the question in front of people who have fertility issue if she thought they might be offended. She is an adult and should have 'self awareness.'  She knew what the answer was likely to be as she's asked the question before. OP shouldn't have to lie so people wouldn't feel upset.  None of this is on OP.", "If only saying things like that would actually make her stop. She also body shames me all the time and I’ve told her multiple times to stop because it hurts my feelings, but she doesn’t", "I'm in the position of your brother, I'm 28f and pregnant with my first and my little sister 17f has always maintained she doesn't want kids. I've noticed my parents ramping up the \"you'll change your mind\" comments to her since we announced and she's stayed strong saying she doesn't want them in front of us. Let me tell you, the only people I consider AHish are my parents, I tell them to leave the poor girl alone! NTA OP :)", "Are you the only girl? \n\nOr are you the golden child? \n\nThat could be why she specifically wants them from you.", "The mom didn't ask a question, she made a comment about it. OP doesn't need to lie. She just needs to change the subject. This is about social skills in a certain time and place, not about OP being at fault. Yes the mom should also have more self awareness, but that's beside the point.", "Still not on OP.  Mum knew how she felt about kids. She shouldn't have made the comment if she didn't want OP to respond honestly. OP just didn't give in to her manipulative behaviour.", "Yeah I said she's NTA. And her mom sucks. Still a socially awkward comment that OP made in that setting. She can be the better person than her mom, and not fall into her manipulative traps.", "NTA. I have been vocal about not wanting kids for years. People first reaction is always, \"You hate kids?\" Or \"why don't you like kids?\" Which isn't the case at all. It seems pretty normal to most people that if you don't want kids you're some crazy person who hates kids and everyone who has them. Not wanting kids is a personal choice. The same as having them.", "NTA. Your SIL and mother pushed, knowing how you felt about having children. You respect and  celebrate their choices, but they are disregarding yours. They are the AHs.\n\nBeing childfree is just as valid as choosing to be a parent. And certainly a lot better than creating new humans just because other people say that \"you have to have kids\". \n\nIn my experience as a childfree woman approaching 40 with many friends and relatives who have children, it's always the ones don't seem very happy with their lives who try to convince me to join the club. The ones who are rocking parenthood also understand that it's not for everyone. They're the ones who respect other people's choices, and therefore respect their own children, which makes them better parents.", "NTA, Why is your mum obsessed with you having babies?", "NTA. Good lord. We need to stop getting offended when people make different life choices than us. Your brother and SIL are perfectly entitled to want a baby, take the steps to have the baby, be happy with their decision while also simultaneously respecting your right to make different choices for yourself. You, on the other hand, should also be perfectly entitled to make your own life decisions, while also being happy for your brother and his wife in theirs. Let me also give you an unsolicited word of advice. NEVER let anyone talk you into a child you don’t want.", "NTA. Jesus your mom needs to take a chill pill. \n\nWhy is it that society believes everyone needs children to be happy and succeed in life. As a mother myself I would love my children to be happy and free and do what they want to do with their lives. I don’t want them to be forced to have a baby to keep someone happy. That’s just wrong. \n\nYou’ll find the person for you - someone who has the same mindset at you. Just be truthful to who you are and stand firm on your beliefs. And if you one day think that you might want to have a child, that’s also okay. But it’s your choice. You are the one who makes your own story.", "NTA at all, not even a little bit. Your mother is a massive AH trying to force what she wants for your life on you. Don’t fall for it. I lived this same hell - I was raised in a Catholic family where all women do is marry an awful man and breed. I’m 39 now and no kids. I’ve been saying I didn’t want them since I was 5. Their fault for not listening. Stand your ground and say it loud and proud. Your brother and SIL won’t have been offended in the slightest.", "Your mom is projecting. You were fine. NTA.", "NTA\n\nWhat your mom did was triangulation to manipulate you. First when you were holding the kid and then when you left and she called you rude. Both times she was using others to try and sway you. It's gonna suck because she is probably gonna use the grandkids to try and talk you into having kids. It wouldn't hurt to sit down with the BIL/SIL and give them room to express their emotions with you. Those with Infertility and those childless by choice usually have more in common than you would think and can be very supportive of one another. They could be very helpful at keeping mom at bay.", "NTA but it's a kindness not to talk about not wanting to have kids around people who have struggled to have them. If your mother says something like that again in front of people, just ignore it. You don't have to respond. Throughout your life you will encounter people desperate to have children who can' have them. You don't need to bring up that you don't want children in front of them. It's about talking about things appropriate to the situation at hand. If you're with people, like myself, who are childfree by choice, the have at it. Otherwise, just comment on how cute the kid is or say something more socially acceptable like \"don't hold your breath\" in a light hearted way.", "It’s not a bad thing to state your position and unfortunately, your mother is ignoring what you’re saying. \n\nShe’s offended because she takes it as a form of rejection when you say you don’t want to have kids.\n\nNTA", "NTA\n\nWho tells a 17yo that they’re gonna be a good mom? Especially when the KID has made it clear they don’t wanna be a parent? Ew.", "NTA. I have an 8 year old son who says he doesn't want children when he's an adult and has asked if he must have them. I always reassure him that he don't.", "NTA I struggled to have my first 2 years it took lucky we fell just before the IVF process and now have 2 beautiful girls and honestly someone saying they don’t want kids is not offensive. I think it’s individual decision. As for men most men I’ve ever spoken to never want kids it’s more driven by the women some men really want kids but not all are bothered and some like yourself completely don’t so the married comments a load of rubbish. \n\nYou are 17 why they putting so much pressure on you about kids. Enjoy being young and free.", "NTA. Honestly, the thing that made me the most pro-choice was having my own extremely wanted children. Pregnancy and parenthood are no joke, and they definitely should not be forced on anyone. If you don’t want children, do not let anyone convince you to have them. Your want to be a parent likely will not change, and your children will always know it.", "NTA 42 year old, no kids, still haven’t changed my mind.", "NTA - you didn’t say anything hurtful. They also were successful at ivf, so it wasn’t like you were flaunting not wanting to have a child while fertile in front of someone longing for a child.", "NTA. Your brother and SIL both went through so much to have a child because that's what they wanted. The fact that they didn't take offense shows that they have enough empathy to understand that just because they want something doesn't mean everyone else does or should want it too. \n\nIt seems like your mother only wants you to have kids because she wants you to conform to society's expectations of your gender and sees reproducing as being part of that. The reason I come to this conclusion is because your brother just gave her a grandchild, and because she specifically cited desirability to male suitors as a reason for you to want children. (FYI, if you do want to marry a man, there are plenty of childfree men out there).", "NTA. Your mother is still trying to guilt you into having kids. She should be patient and wait to see what you do with your life. Some people your age may say 'I'm never having kids' then end up having kids. You may change your mind yet, but not if she keeps pushing. All she is doing is making sure you stick to your word.\n\nDon't get me wrong with this comment. Not saying you will change your mind, just that it is a possabily whilst you are young. Live your life as you want, not how your mother wants you to live it.", "NTA\n\nShe asked. So she got an answer. It shouldn't hurt other people that you dont want kids. It sucks they had to go through so much trouble, but that situatjob isn't connected to yours and therefore they shouldn't feel bad if you don't want kids. \n\nAnd for the love of God I hope your mother stops asking cause coming from someone who also doesn't want kids, the constant asking is annoying", "Nope definitely NTA. I have 2 kids and my sister doesn’t and will not have any. Your mom is being a shit stirrer.", "NTA\n\nMy wife and I are happily child free.\n\nYou said nothing judgmental or rude. You were honest, your mom is the A", "19F here. I have mentioned, in front of my cousins who have kids, that I don't want to have kids, while holding their kids. I'm the Cool Aunt™ and you can be that if you want to or not be involved or whatever you want.\n\nNTA", "NTA its your choice. If brother and sil weren't offended then mom's the ahole for pushing the issue.", "NTA And your mum needs to understand that it’s your decision alone and that the more she pressures you, the less you may want kids.\n\nIt’s far too early to take your decision for granted, but she needs to respect it anyway and not try to convince you otherwise.", "Hard NTA. You’re 17. Your objective is to discover the world, get an education, travel, make friends and meet people. \n\nWhy is your mother pushing the baby agenda so hard for a teenager? You might change your mind and you may not. But her mindset is weird.", "NTA, you are 17, and have a whole life of experiences in front of you. Your brother is in a very different place and obviously delighted with their healthy baby.  You may change your mind one day, that’s ok. You may continue to feel this way, enjoying your nieces and nephews but not wanting to do that yourself, and that’s ok. You may decide to adopt - also ok!\n\nAt 17 there is so much ahead of you! Your mom is a different generation, she has kids she loves - and wants that for you I guess. That’s ok, but she shouldn’t push that on you.  \n\nMy daughter is 17, is on a contraceptive implant and starting an engineering apprenticeship- she doesn’t want babies either!!  She is a wonderful person and would make a great mom - IF THAT IS WHAT SHE CHOOSES! It isn’t my decision, my role is to support her in what she wants", "NTA. Your mum knew better than to play \"fuck around, find out\" but still did it anyway thinking she could change your mind and got embarrassed by her mistake when you put her in her place.", "NTA. You can like kids and still not want any. Also, your mother now has a grandchild, isn't she being too greedy lol", "NTA, you not wanting isn't the reason some people have a hard time having some. It's not related at all and will never be. Your mom is just pressuring you and it's completely inappropriate, maybe you'll change your mind, maybe you will not and at the end it's your life. \nAlso, finding a husband and having kids isn't the happiness recipe for life, especially when it comes from social pressure.", "I've never wanted kids - and my family has pretty much always known that. And honestly it's a win for all of us. I love the hell out of my nephews, spoil them, and give them back. My sis and her husband get free babysitting, and the boys have more adults that love them and look out for them (and buy them cool dinosaur toys).", "NTA, I am almost 40 and I have known since I was about 15 that I don't want children.\n\nIn this case your Mother brought it up, and you simply pointed out something she should have already known.", "You’re 17. This shouldn’t even be a topic of conversation.", "NTA, saying you don't personally want kids should not offend your brother and his wife. It's not like you said anyone who has kids is an idiot or something like that.", "\"you have to have kids\" 🤮 NTA", "r/childfree NTA", "Your mom is pushing you to have kids, but you are still a kid yourself......\n\nNo offense to you. \n\nBut you are only 17. Having a kid should not be on your radar. And your mom pushing it so much at such a young age is honestly a little weird. \n\nBut she mey be right, you will change your mind. Or you wont. Either way, that is up to you, years from now.\n\nNTA", "NTA\n\nYou've told them, they know. You don't owe anyone kids - not your mother, not the world. I didn't struggle with infertility but I did with miscarriages and I would never be offended if someone said they didn't want kids. \n\nI have many, many friends who said when we were teens that they didn't want kids. Now we are nearing our 40's and they are still very happy with their decision. They have healthy relationships and are living the life they wanted. You can still be successful and live a very happy life childfree.", "NTA,\n\nSounds like she was just sad her plan didn't work and hoped how sight of a new born baby didn't do the trick to change your mind. (AS IF this would be a go-to cure for \"hell-no-no-kids-for-me-itis\")  \n\n\nofcourse, that's HER problem. I'm sad people still think ***all*** adults would want to have kids someday.   \nI would have less contact with your mom.", "NTA\n\nYour brother and SIL really have nothing to do with this. The beef is entirely with your mom who seems upset you want have kids. You simply stated your opinion in a calm way. You didn't say anything rude", "NTA - it is not offensive to people who have children that you don't want one (or at least it shouldn't be!) \n\nJust as a heads up, youre probably going to be having this conversation with your mother for the next 20 years. \n\nPeople who have kids just can't understand when someone else doesn't, especially when women don't.\n\nTo be fair, you are young and you might change her mind, but it's worrying she's pushing it now when you arent even an adult. \n\nThere are plenty of valid options on life other than traditional family and it's genuinely none of her business what you want.", "You're 17.  Why would you want kids now.  Maybe you will want them when you're 25 or 30 but for now you are NTA", "NTA\n\nEven IF it's true you might change your mind someday, at this moment in time you do not want them. There's absolutely nothing offensive about that.", "NTA because your family seems to be honest with one another. However, it would be nice to send text to your brother and SIL and just clarify - saying that you’re stoked for their little one and your comment was made directly to your guys’ mom who has been oddly pestering you about kids and it wasn’t ok to make the comment she made. Your mom is doing what lots of moms  do - and it’s not ok. You can always write your mom a letter and explain that you’re really upset by her continued comments and that you would like her to at minimum work on not saying things to you about having children.", "INFO: were your SIL or brother the slightest bit upset? Were you making mean faces at the baby and calling him names?\n\nMy best friend is pregnant with her second and I’ve had to stop mentioning not having kids because it always starts with her yelling “DON’T” and leads into her working herself up about how absolutely miserable pregnancy is and she can’t believe anyone would do this to themselves if they weren’t absolutely ecstatic to have children. For the record she is a fantastic Mom.", "I think the real AH is your mother.\n\n\nIt's fine to not want kids. It will most certainly make the chances of finding a partner smaller as most people indeed want to have kids, but you still have chances.\n\n\n\nAlso, in case you are considering for tubal ligation surgery (which is what I would suggest for women who absolutely do not want children) wait a few years for 1) to be completely independent, and 2) to be sure 100% as it is a surgical procedure that has extremely low chances of being reversed due to the position of the organs.\n\nAlso, avoid sex as even with sterilization surgery, pregnancy could still happen (if there was an error during surgery for example).\n\n\nYou are NTA. Just ignore what your mother says. Some people are just like that.\n\nJust be happy that you are an aunt even if you never become a mom.", "NTA - It is A-OK to not want kids and be honest about it in this situation. Sounds like you'll be a great aunt, too!  \n\nThe only way I think it's mildly offensive is when people say \"No offense, I just would never want kids.\" Somehow, that usually comes across just as hell.", "Sane people with kids aren’t offended because other people prefer not to have kids. NTA.", "Exactly. OP's mom just wants grandkids but it's not mom's call. NTA OP", "Seriously. As a child free person, I hate the stereotype that mom is throwing out. I love lids. They're fun. I can change a diaper and babysit in a pinch. I just don't want kids of my own. I want to spoilt noeces and nephews and friends kids with the loudest toys possible and know that because I love them and they love me, their kids are safe with me. Mom is being a weirdo.", "Yep 33 year old man here. Been single since I was 18 and have no desire for a relationship or kids. It frustrates the hell out of me that people (i.e. my parents and work colleagues) act like this is wrong and they are worried about me. I do not get it, I'm perfectly content with my life at the moment, but apparently bring single and child free is wrong. Urgh people suck sometimes.", "I was thinking this as a parent of a near 15 year old. Why are they pressuring her already about having kids?", "That’s exactly how I feel. I even told them I’d love to babysit my nephew anytime. I enjoy being around children, I just wouldn’t want to have to take care of one 24/7.", "I have said I didn't want kids ever since I was a kid. Plenty of people told me I'd change my mind by 25 then by 30. I'm 33 and I still 100% do not want kids. I've never been pregnant and I never will be. I. Don't. Want. Kids. Luckily my fiance doesn't want them either. Some people just don't want to and that's completely ok. The earth is over populated anyways. It is very AHish of you to make that comment about her body being made to carry and have kids. That's a disgusting mentality. Women are more than just wombs. We are people too, who have our own personalities and ideologies. Not everyone is the same. Not everyone wants them. Nothing wrong with it but there is something wrong with you telling a woman she will change her mind, after all your body is made for it. That's gross on so many levels. \n\nAlso people with fertility issues who hate people who do not want kids are projecting their problems onto other people. That isn't the other person's fault. The people with fertility issues need to work on themselves and figure out their issues instead of projecting it onto other people.", "She has told her mom she doesn't want kids. You don't have to accept an unwanted complement from someone. Especially when it would seem that the mother is just trying to browbeat OP into agreeing, anything other than a dismissal could be seen as approval.", "Why only for now?\n\nIf OP said they same thing at 25 or 30, they would still be NTA", "I would go full-on with your mom about this one. “24/7 caregiver responsibilities that include wiping a dirty ass, cleaning up vomit, paying for everything they need, and doing it all unpaid? What sane person is signing up for *that* job?”\n\n(Spoiler alert: I have two kids whom I love more than life itself. 😁 This doesn’t change the fact that it’s a crazy job that - on paper - seems like the worst opportunity in the world.)", "I have 3 siblings, all of whom have or want kids. I’m extremely open with them about not wanting any myself, and they do not care whatsoever.", "Also having a niece or nephew is fun. You get to do all the fun aunt stuff and then send them home afterwards to be their parents' problem", "I don’t have kids and I’m a rockstar aunt. It’s actually rather priceless to have another family member, an adult that can be trust almost like a third parent. You’re m9m has issues. I’m going to assume she hasn’t taught you boundaries. You’re going to need to learn quick, since you’re almost an adult. Otherwise she’s going to just keep steamrolling you the rest of your life.", "You did nothing wrong. My grandparents still bring up me having kids. I'm in my 30s and I have stated my no kids since I was in my teens. I'm at awesome Aunt. You be the awesome one too", "No offense but at 17 you've probably got your hands full trying to take care of yourself. At least I did at that age.", "Start telling your regular doctor now that you don't want kids and keep telling them once a year. If in the future you're still sure and want your tubes tied/removed, there'll be a record of you always being sure it's a hell no.\nIt greatly helped me, by the time I was old enough to get it removed they all knew yeah we saw this coming", "I’m not saying she has to. I’m just saying that humans and every other organism typically have get the urge to reproduce eventually, considering that’s what they’re made to do.", "you are a godsend! i do not want kids, but every cousin & my SIL have ALL made comments about me not being serious. one cousin, who is only a year older than me, even said \"when your biological clock kicks in you'll change your mind so fast\". unfortunately there are a lot of people who still believe that a person's ultimate happiness in life hinges on whether or not they have children.", "I have no kids, but I most certainly would love to do all that you listed that a parent should do for them + more lol \n\nKids are great. \n\nSome people do not want to have kids and that is okay. Sterilization surgery and avoidance from sex are important for these people.\n\nSome people want to have their own kids and that is okay.\n\nSome people do not want to have their own, and to instead adopt.", "I’m neither", "Even if we’re talking evolutionarily that’s not necessarily true. Humans are a social species, meaning it’s a lot easier for us to ensure our genes get passed on without reproducing ourselves. By keeping our siblings’ kids alive and not making more, our genes are passed on and there isn’t an increased strain on resources. \n\nThat’s also likely/partially why women (and female elephants) go through menopause, it takes less resources to care for grandkids/nieces/nephews than it does to keep making a bunch of kids and hoping some of ‘em make it.", "NTA. For what it's worth, I'm a middle aged adult who wanted kids but couldn't have them, and I don't think what you said is rude in the slightest. You didn't insult anyone, and you were perfectly lovely to your brother's baby. This sounds like your mother's personal hang-up. If you don't want kids, don't have them! It's your life, and you deserve to live it how you wish. A lot of people have kids because they feel like they \"should\", and then regret it horribly. You're smart!", "NTA OP, I have two kids and I couldn't love anyone that much, but they are both autistic and our life would have been so much easier without them. Don't let anyone pressure you in making these kind of decisions. Live life your way and enjoy it to the fullest.", "NTA, but be ready for a lifetime of bullshit people saying bullshit things about your decision not to have kids.  I'm amazed by how many people seem to think is any of their business.", "You might change your mind. But you probably won't. And there are plenty of men who don't want kids. Don't ever feel pressured to have kids to make someone else happy.", "NTA at all. For goodness sake you’re 17 years old. Most parents are doing everything they can to keep their daughters from getting pregnant at that age. I realize your mother meant when you’re older you’d be a great mom, etc. but why does this even have to be a discussion at 17? And telling you that you’ll never find a man?? That’s terrible. My cousin (40M) and his wife (35F) have always said they don’t want kids and everyone has accepted this fact. They are both amazing with their nieces and nephews, they are financially well off. Total stability in their lives. They would make the most wonderful parents ever! But it’s nobody’s business whether they should have children or not! I’m so lucky to have them be in my children’s’ lives. My kids adore them! But I would never ask them about having kids and especially never shame them for their personal decision!", "NTA and as a woman who wants no kids with a mom who wants grandkids: please never let yourself be preassured into anything.\nSo many people have told me \"oh you will change your life\", \"it is just a phase\", \"I didn't want any either but I changed my mind and so will you\". It's okay to not want kids and you will find a partner who feels the same.\nIt's very important to always be upfront about it tho, some people like to agree to not wanting kids because they think they can change you.\n\nEither your mom understands and respects your decision or she can live with seeing you less once you are grown up. Give her this choice and she will probably back off a bit", "NTA\n\nIt's not like you said seeing their baby made you never want to have kids. *That* would've been rude. \n\nIt's possible you'll change your mind but if you're sure at this age and have always felt that way then probably not. I was adamant at 13y that I didn't want kids and wouldn't be having any. Most people told me I'd change my mind when I got older. They were wrong, I'm 30y now and nothings changed.", "NTA if she knew you didn’t want kids why would she bring it up?", "“I can’t wait for you to have kids.”\n“Well then I have some great news for ya mom— you’ll only have to wait a few more months!”\n\nReally though, if humor won’t work, ignoring her is probably the best approach.  Or something like “you want me to have kids?— Noted.”  But your insistence that you don’t want children is really just prolonging a pointless conversation.  Pointless because what she wants is ultimately not part of your parenthood equation.  \n\nDon’t feed this conversation.  But also, don’t ascribe the worst intentions to her (as many responders seem to be doing).  Getting old is tough and confusing.  And your def NTA.", "NTA, your mom is though. Her comment was clearly manipulative and completely uncalled for", "NTA. Your mother is trying to manipulate you.\n\nIt took years for my husband and I to have our daughter. We each have sisters who don't want kids. It made zero difference.", "NTA. Some people just do not get folks who don't want kids. As for her comment about not being able to find someone, I'm in a relationship that's approaching ten years and we've both been open about not wanting kids from the beginning. We're in our thirties now and that hasn't changed a bit.", "NTA - Ive had a million niblings, and whenever I hold a new one, guaranteed someone tells me Im next, and my response is always that I dont want children. This has never offended any of the parents 😂❤️", "NTA. Your mother is simply projecting. She felt hurt by your comment and wants to justify it to herself by thinking that everybody else was as well", "Nta. She obv wanted you to feel bad so that she wouldn’t have to see how rude she was herself. It’s rude for fam to push life agendas onto you, especially so young. When my mum made similar jokes while I held my baby nephews, I simply told her that my nephews are my children. She backed off eventually.", "\"Most men want to have kids\" !!!???\n\nIt was true for boomers.", "NTA. I’m 26F, and remember very clearly having the same thought as you at that age. Unlike a lot of folks, I’m not gonna sit here and say you’ll change your mind. I’ve heard that from my own mom since I was 15, and 11 years later I haven’t wavered, even after meeting the partner of my dreams (who also doesn’t want kids, funny how that works out….)You may change your mind, you may not. My close friend that was violently child-free at your age just had her first kiddo this year, who she is head over heels for. Both outcomes for your future are perfectly fine. \n\nYour lack of desire to have kids of your own does not negate their struggle and deep desire for a child and it’s silly of adults to not see that when you, a teenager, clearly can. Do not let anyone manipulate you in to that. Your uterus, your decisions on what takes up residence there.", "NTA i'm currently rocking my desperately wanted 10 week old IVF miracle who took me 2 1/2 years to make  and I'm still telling anyone who will listen not to have a baby. 😂  \n\nThis shit's hard work!", "The heck? The only time I can see it being offensive for a person to laugh and say they don't want kids is when someone has just lost a child or a wanted pregnancy, or potentially when they're really struggling to get pregnant and confiding in you about it. I desperately want children and have been having fertility problems. Neither of my siblings wants kids. Why on earth would I feel offended that we have different wants? Their wishes don't impact mine in any way. Maybe that's the reason your mom was upset--from her POV you not having kids hurts HER. She needs to get over herself, it's not her life and she has a new grandbaby to fuss over. NTA", "hey op, I'm in a similar situation as you. I've made it clear to my father that i don't want kids (or to get married for that matter) when i grow up, but my father just keeps repeating that frustrating dialogue of \"you'll change your mind when you grow up\" like I'm going transform into a different person ten years into the future. stay strong and ignore them, they're just doing it because they can't imagine not completing the so-called \"duties\" of reproducing and continuing the family. just do what you want.", "NTA. But if I were you, I would try to get in the habit of simply not taking the bait. When the subject comes up, just say nothing. Your response to, “You’re gonna be such a good mom” could have been silence or a redirect. “SIL, how are you feeling?” Or “What an adorable outfit!” Or “Who would like to hold the baby next?” Every time you announce/remind that you do not intend to have children, you open yourself up to criticism and judgment. (Just a little advice from someone much older and maybe slightly wiser.) 😊", "NTA but your mom is pressuring 17 years old to get pregnant and that should tell you a lot about her twisted mind.", "You’re 17, there’s zero reason to even think about kids", "Your body your choice", "NTA\n\nIt's not rude, kids aren't for everyone and you are 17, you shouldn't be having to commit to having kids or not anyway. \n\nYou can even like babies and not want to have any, I have plenty of childfree people in my life that love spending time with my son, but would never have one of their own and I 100% respect that!\nSaying you don't want kids isn't saying you hate their kid", "NTA\n\nIt's weird as fuck that people try to force others to have kids.\n\n\"You know what I think would be fun? If you compromise on your career, lifestyle, and all future relationships in order to take on a minimum 18 year responsibility that lands you in jail if you fuck up, and also costs more than a Lamborghini.\"", "NTA what has you having/not having kids git to do with their fertility?", "NTA. \n\nIt’s your decision as to whether or not you would like to try to bring new life into this world. \n\nDon’t let anyone try and guilt you into it if you do not want to. \n\nIf they have a problem with it - that’s all it is… THEIR problem not yours.", "I have a newborn in my arms right now, my sibling says it all the time that they don't want kids, and actively mimes adding to the list, of why they don't want kids every time something traumatic comes up about the pregnancy, birthing and child rearing process.\n\nIf I was your brother, I would be more likely to offended at your mother for forcing a topic to repeatedly be brought up even though the answer is already known.\n\nNta.", "There's a lot of preassure for women to have kids, unfortunately. I have no idea why some people find it so difficult to accept that some people make other choices than them, but this is something you'll experience from people you hardly know. I never wanted children, and never had them. For a while I was getting so many comments that I \"needed to get children\" from randos that I actually started to say we couldn't have them. Mind you, only I got these comments, not my husband. \n\nYou might change your mind, you might not. But you'll be having this discussion till you're about 40, so prepare some good answers for it. And your mom needs to back off.\n\nNTA", "NTA", "I think your mom is expecting your brother not to have any more kids due to the difficulties of this last baby and might be looking for you to have more babies", "NTA. Your comment was fine. Your mom is blowing this way out of proportion and sticking to outdated and unrealistic beliefs", "NTA, your mom said something because you offended her. And over something which she should have known not to get her hopes up. My mom does this all the time with me, and I honestly wish my doctor would just tell me I'm infertile so I could tell her my body will literally not allow me to have kids and she can be shut down medically.", "NTA \n\nYou’re 17. You shouldn’t even be thinking about having kids regardless, why would your mom be discussing it at all? You might want them one day, you might not- plenty of people want kids at 30 but didn’t at 17, and plenty of people who don’t want kids at 17 never want them. There’s no right or wrong answer and as long as you continue to follow what your heart tells you, that’s what matters. \n\n\nMy point is, you’re allowed to say you don’t want kids. You are allowed to not want them. You are allowed to change your mind one day and if you do, it doesn’t make your current wishes any less valid.", "NTA. In that context I probably would have just smiled or whatever and moved on then later set mom straight. I think having kids is totally irrational, and I say that out loud sometimes when it comes up, but I’m very careful about who my audience is. I’ll give you a pass since you’re so young, but in future just realize having kids is a super sensitive topic for a lot of people and it’s often best to just stay silent or neutral.", "NTA - your mom is a bully and i can say with confidence, some men dont want kids either and people without kids live just as happy and fulfilling lives as those who have kids\n\nthe important thing is to do what matters most to you, what will bring you meaning and what will make you happy, your mom is forcing some archaic values onto you thinking she has failed if you don't do it her way, but that is her problem not yours.", "Its absolutely nobody's business how you choose to live your life. I'm the same. I don't want, and never have wanted kids but I'll spend time with my neice. NTA", "NTA. As a now 32 year old guy, my mum still makes comments from time to time about wanting grandkids but I've always been firm in not wanting kids. The outdated mentality of \"you have to have kids\" will probably never really disappear but there's nothing at all wrong with not wanting them and expressing that regardless of anyone who does want them struggling to have them.", "My son told me when he was little that he never wanted kids. Of course I said he’d change his mind when he grew up. He & his wife don’t want any children. He had a vasectomy to prevent accidental pregnancy. I’ve never said anything to either one of them because that’s their decision, plus I’m older& wiser now. \n\nNTA. Shame on your mom for pushing you.", "April Fools next year: mom! I’m pregnant! \n\nNTA.", "NTA: I'm still young(16-17NB) but I don't want to deal with the whole doing the thing to get pregnant talking about it makes me uncomfortable there is nothing wrong about saying you don't want them", "Your mother is wrong. \n\nI'm 44, my Wife is 41, we never wanted kids, life is good.", "We have a 6 year old and have struggled ever since to have another including trying (and failing) IVF multiple times. We are now heading into third trimester with a pregnancy. \nGoodness me, people who don’t want children aren’t even slightly offensive!!! In fact, given how bitter I’ve felt over the past 6 years when anyone announces a pregnancy, my friends who don’t want children have often been my refuge!!!", "NTA. Being CF is getting more common now days and your brother and SIL I bet have many friends who are child free, hence why they seemed (and probably are) fine with your comment.\n\nAs for your mum, she's going to treat you like a child who doesn't know what she's talking about as you're 17 and female so it's hard wired in society to have us have kids.\n\nMy best advice is don't ever engage with her comments. Don't react in the future, it's just not worth the headache. If she has deep discussions with then yes defend your choice but ignore a passing comment as you just don't need that.\n\nAs a CF woman, it's actually pretty easy to find a CF men, infact my boyfriend said he's always known he was CF but thought all women wanted kids so he'd just have to. It's been long \"accepted\" for men to just abandon kids unlike women so men have a easier time accepting and society accepting their CF.\n\nThe good thing is she is in no control of your body so as much as she may wish it, her wishes won't result in a child, just do what's best for you.", "NTA my (32f) sister (42f) had her first wheb she was 31 abd I was 21. I have always maintained I didn't want kids. My BIL seemed to make it his personal mission to convince me I would change my mind. 32 now, in a loving relationship. Guess what? Still child free. Honestly peoole expect kids to make career decisions at 16 that could affect the rest if their lives but then wanna claim young people don't know their own minds.", "NTA Your mom is trying to weaponry your siblings struggles to pressure you into having children. Not cool.", "i decided i didnt want kids when i was around 17. everyone and their mother kept telling me \"oh you are too young to decide that\" \" you will when you meet the one!!\" \"you will change your mind when you are older\" .  im 28 kids free and i still hear the \"when u meet the one\" one 😭😂 some people just refuse to listen to us tbh", "NTA. if anyone was being offensive it’s your mum for saying how *you* are going to be a great mum based on holding a kid, whereas the actual new mother, who is actually raising a kid *right now* is just there. \n\nObviously it was just part of the pressure campaign with no thought whatsoever to how her words affect anyone but you in the moment. \n\nIf she’s so keen on grandkids she needs to live in the moment with this one, rather than focus on how to get the next one.", "nta", "NTA\nI think your 14 yr age gap with sis is telling. Your mom wanted kids, possibly more kids. Is it just the 2 of you? It might be vicarious living. If there is a lot of you then she might have taken it as a insult to her life choices. A 17 yr shouldn't be thinking about having kids.", "NTA, and just know ALL your reasoning was perfect.\nYou seem to know exactly what is going on\n\nI was also told by my kid they felt like they do not wat children. I told them I was proud they realised it was a choice, and if they'd ever change their minds and did have a kid, It would be such a reassurance to know that that would  be a well thought out choice as well, and not because it was 'expected'. So I could not be happier than when they live their lives the way it makes them happy. Sure, being a grand parent would be fun. But you know what is even more fun? Knowing my kid is happy and living their best life. \n\n\nI also actually have seen people change their minds, but I promise you it was not because they were told to do so, lol\n\nYou have a right to your opinion, and mom better get used to the idea.", "As a mother of two kids I love so much I would die for them I say NTA. Honey, if you dint want them that's just fine and don't let anyone tell you you're missing out on something. We're just jealous you get to sleep. Lol", "Ever since I was a little kid in the single-digit ages I always said I didn't want to have kids. When we played house I was always the auntie. I told anyone who would listen that I wanted to be a cool aunt who lives in a condo with my dog so I wouldn't have to do any yard work. My mom and my aunts claimed, all through my childhood and young adulthood, that I would change my mind someday once I got married and was \"ready to settle down.\"\n\nI'm turning 37 this year. And guess what? I don't have kids, and I don't want kids. I am the cool aunt that takes my siblings to the trampoline park and the video game museum and fills them with ice cream. I live in a condo with my dog and I don't have to do any yard work. And I did, in fact, find a man who also did not want children and we are very content DINKS.\n\nSome people, for some reason, get offended when you make life choices that are different from theirs. For some reason they feel like you are silently judging them or something. That's their problem. NTA.", "NTA their struggle to have kids has nothing to do with your choice to have children in the future. Your mum is being ridiculous", "NTA\n\nAnd don't worry : there are plenty of guys out there who don't want kids, either.", "NTA\n\nYou didn't say it angrily, it was a response to a remark your mother made. And you have been clear about not wanting children. You did not say this to hurt your bro/SIL and clearly they don't care about your remark.   \nYour mother seems loving and caring, a bit insecure and very traditional. That's alright and one day she will accept you don't want kids. You just have to repeat it over and over and over again. Yes, you will find a man obviously, a lot of men don't want kids either.   \n\n\nMy daughter doesn't want children and has always said that. Even now, being in a steady relationship with a man that wants children, she is still saying she doesn't want kids. Now, because I want grandchildren, I told her she has to get a dog that I can babysit. That is the least she can do for me. It might be a stuffed dog, but I will smother it with love anyway. (yes, my daughter and I joke about it)", "NTA. Tbh, I think your mum is incredibly rude. Imagine meeting your grandchild for the first time and pulling this crap.", "NAH. You made an innocuous comment, your mother wants more grandchildren. It is normal for a parent to want more grandchildren. It is what it is.", "NTA but I also wouldn’t hold you to that desire. I didn’t want kids either until I turned 25.", "NTA. People will continue to tell you about your biological clock and insist you'll change your mind until you're about 40. You might even change your mind, and that's okay too, but kids aren't for everyone and that choice is no one's but yours. Believe me when I say people who've gone through infertility struggles understand the importance of bodily autonomy.", "NTA\n\nYour mum seems baby-obsessed, and also is lying to you. Many, many men don't want babies.", "NTA, but this is probably a subject that you need to deflect.\n\n- “*You need to have kids*”\n\n- “*Okay let me think about it.*”\n\nLike most parents, your mother probably believes in some form of cross-generational duty. You wouldn’t be there if she had thought like you, right? So why should you be doing the same to your hypothetical children.\n\nAlso, your parents made a lot of sacrifices so that your might get a better chance at life. They are not ready to be told: “*Sorry, the family line stops at me.*”\n\nI am not trying to change your mind, but to play devil’s advocate and help you get in their shoes.", "NTA. \nRude of your mum to assume you’ll want kids. \n\nNot sure why everyone’s assumed to want to have kids. Really irks me when I’m asked when I’ll have them. Never, is the most likely option, the cost money and I’d be a shitty parent.", "NTA.  Nobody has to have kids.  I’m not.", "I am still amazed at the things people try to make an issue.  You’re only 17.  Would your mum prefer you to be barefoot and pregnant at your age?\n\nShe’s projecting.  It’s nothing to do with your brother or SIL.  Maybe it’s the fact your brother had so much trouble and your mum didn’t think she’d ever be a grandmother and is still worried.  And yes you are young.  You may change your mind in the future.  But shit, your mum should stop trying to wish your youth away and just enjoy the grandchild she has.\n\nNTA obviously.", "NAH.\n\nIt’s not uncommon for people who have had to work hard for a baby (e.g. IVF) to feel slightly resentful of those who can have babies but don’t, or people who complain about their babies. Your sister could have confessed to having these thoughts to your mom.\n\nIt wasn’t out of line for your mom to tell you that it’s a potentially upsetting comment, when you could have played it another way. I don’t think what you’ve written implied your mom is baby crazy or anything. But no, I don’t think you were rude, so NTA either.", "It isn't rude to say you don't want kids.  Timing may not have been the best but nta.  Also, you don't have to have kids", "NTA I was honest to my brother and straight up told him his kids put me off having any. Don't get me wrong I love my niece and nephew and helped my brother practically raise them for the first 5 years. Niece wasn't to bad bud nephew was a nightmare. Then I met someone and got her pregnant by accident (2nights with no protection). He's 16 in a couple of days and I wouldn't swap him for the world. \n\nYour definitely not the a hole for speaking a truth you've said openly before. But you never know what the future holds. Never say never as they say", "NTA, your mom is projecting some old school, baby making propaganda. You do you.", "You are so young and it’s so weird your mom is fixated on changing your mind and forcing the idea on you. You did nothing wrong and didn’t say anything rude. Nta", "NTA. I'm child free myself - had tubes zapped some several years ago, no regrets - and I find the double standard interesting.\n\nPeople will gladly post to all the world \"we're trying for a baby! 😁\" like it's something romantic and cute. Great to know y'all are raw-dogging every night, cool, cool...\n\nAnd *yet\" if one of us CF folk simply say \"I'm not having children\" then the reactions get extreme. As you've seen from your own mom, OP.\n\nI'm sorry you're going thru that. Your desires are 100% valid and, imo, your response was perfect.", "If an adult is offended by a 17 year old girl saying  that she doesn’t want kids without belittling others having kids, the adult is the A and a weirdo. NTA", "Nta. Tell your mum to get off your business. Alsp remind her that its not the 20's anymore, and no most men do not want kids, and no a woman does not have to have kids if she doesn't want them.", "As someone with 3 kids. Not wanting kids is a perfectly valid stance. Don't let anyone pressure you jnto it. The worst parents are the reluctant ones.", "NTA. I'm 40+ and knew I didn't want kids from when I was around 5. Married, still no kids.\n\nI've found that replying to 'When are you having kids?' with 'Never, thank goodness!' Throws people a lot because you are expressing gratitude about not having any and they tend not to have a comeback to that!", "YTA. You need to know your audience and your statement was inappropriate and insensitive to your family who just went through hell to have a baby. Having kids isn’t for everyone and I understand and respect that, but some people truly would give anything to have a child and suffer more than you can imagine to create their family and comments like yours just aren’t it. Take this is a learning lesson and grow from it please", "It's both heartbreaking, and enraging, how some parents push the idea that women must have children, on to someone who is still a child herself. \n\nA receptionist at a realty office was making small talk while helping me, and she referenced children being in my future. I smiled and said my husband and I weren't having any. The way this young woman latched on to my response, like it was an oasis in the desert, surprised me. Turns out, she was only 18, and her mom had already been pressuring her for years about how she had to have children, otherwise her life would be misery and despair. \n\nI immediately asked if she had time to talk. For the next 30 minutes, I listened to her share the views her mom kept pushing, while I reassured her that she could choose her own path. Apparently, I was the first person that validated her desire to be child free, and told her she could still find happiness with a like-minded partner. My heart hurt for her in that moment. \n\nNo one should have to feel the way that young woman did. I still remember how big her smile was as she thanked me and gave me a hug goodbye. I hope she's living her best life.", "This. My mother outright called my wife and I selfish for not having kids. What she means is she's selfish because she just wants to be grandma. No consideration at all for our mental, physical or economic well being. NTA op.", ">why on Earth would she bring it up in front of them knowing you don't want to have kids?\n\nHonestly I'm guessing either to be petty or she thought OP holding the baby would suddenly make her want to have a baby herself, which is stupid lol.", "Not trying to change your mind or anything but why can't your relatives travel with their kids? I grew up in Europe so it's probably much cheaper to travel (especially in eastern Europe at the time) but my parents took us to at least two vacations outside the country and a bunch of weekend trips each year as long as I can remember. I remember a trip to Portugal when my little brother was less than a year old and I think when I was a baby my parents even took me along to Tanzania.", "Please remember that 17 isn't a minor everywhere.  OP did not say where they lived.\n\nYou're not a minor at 17 in the UK for example.", "My aunt hit me with that question as well ahah, my answer was the same too. My mother on the other hand… I think she knew when she saw me putting Barbie clothes on my dinosaur toys and tossing the Barbie aside lol. Idk. She has long since accepted I wouldn’t be a “girly girl”. \n\nI wonder if she’ll try pushing as I get older? I’m 21 now. Though she probably knows that the moment I get my own house, I’m filling it with either bunnies or dogs.", "When I was 5, I remember saying that I didn't want children. I'm 47 now and still feel the same way.", "Exactly, my future SIL and her husband don't want kids. They're both in their 30s and have been together since high school, and they've never changed their minds. I've always wanted to adopt an older kid (4y+) since I'm not fond of babies, and the same goes for my partner. Maybe one day you'll change your mind, maybe you won't. But your mom pushing you constantly isn't going to suddenly change anything other than making you more annoyed.", "It's because for some reason society thinks a woman's job is to repopulate the world . We can't possibly never want kids because it would go against our womanly nature, motherly urges, and just not be normal . Over time people will continue to try to convince you your feelings are not valid. \n\nThe amount of times I get asked when my husband and me will have kids is far to many we just tell them we have cats and we have no energy for kids due to the cats.", "NTA, your Mom needs to chill.", "OP, you are NTA, but your mom is being a major A. You've made your stance clear and she should respect your decision. \n\nTo share my story...I am 46 and don't have children. Up until I was 24, I wanted 5. Then I turned 25, and something changed. I decided I didn't want them. I have 12 nieces, 2 great nieces, and a great nephew. I loved those children with every fiber of my being. They are mine. But...no desire to grow a human myself. \n\n\nFor the most part, my family respects it, but some STILL ask me when I will have children. I have started telling them I will have one when they impregnate me. Harsh, but they get the point. \n\nI say all this to say, keep stating your boundary, and let your mother know she is disrespecting you.  She will get over it. 🫶🏾🫶🏾🫶🏾", "Yes, this is very much your mum's issue - she's using your brother and SIL as a proxy for her own upset/offence.\n\nFwiw, I also knew I didn't want kids at 17; I'm 42 now, still don't want kids, and have been with an excellent man who also doesn't want kids for over 15 years. So while you may change your mind, take it from me that if you don't, you'll find someone who feels the same. Your mum is just lashing out.", "You are NTA. Your body your choice and sorry to read that mum got offended by your choice. You do you and don't listen to her", "You didn't say anything offensive, you didn't even bring it out of nowhere, your mom knows you don't want kids so I think she just brought it up to be petty, or maybe she thought you holding the baby would make you suddenly want a baby yourself lol. Anyways NTA.", "At 17, sleepless nights and lack of freedom absolutely should NOT sound fun. Not having kids is a perfectly acceptable life choice. Everybody saying you’re gonna change your mind is extra annoying because if one day you do decide in your 30s hey ya know what YOLO Im gonna have a kid, they’re going to be unbearable with “I told ya so”. My best friend always has said since we were literal children she doesn’t want kids. She likes kids she plays with kids she just had no interest. Now in our early 30s after building her career and having spent a lot of time with my two very young kids, she IS reconsidering. But she’s still not sure, and her mom always gets on this crazy high horse about it, and it’s so frustrating. Why people always feel the need to pressure young people into having kids is beyond me, it’s a very personal decision. Enjoy being an aunt! And if you never have kids I hope you live a life full of travel, adventure, and restful nights. NTA.", "If she is, that will be at least partly thanks to you", "Not to mention she already has a grandchild", "Lids are awesome 😎", "Honestly my mother pressures us in the same way, but we're late 20s and I shut that shit down every time.\n\nA 17 year old? It's definitely weird to pressure her to want children.\n\nWomen should be encouraged and supported to move into other directions that isn't parenting (nothing wrong with those that do want to be parents) but nothing's wrong with girls that choose their careers.\n\nMy partner is an electrical engineer, I dated her since we both were at uni and proud as heck of her", "Yeah it’s entirely plausible that someone who is right now 17 may change their mind later about having kids but there’s plenty of time for that to happen", "Depends on how many kids and cost of travel I guess? I assume that prices are also jacked up due to school holidays which doesn’t help things. When I was booking a cruise trip with my friends, took a peak and damn was the school holiday time period jacked up.", "Even if she does change her mind, (and there's no reason why she would), it certainly won't be because her parents hound her about it.", "My daughter has maintained that she doesn't want kids since she was about 15. She is 28, no kids and no plans for kids.  I never told her she would change her mind. I believed her.  I honestly hate when people do that stupid knowing smile and say \"awww, I am sure you will change your mind one day\" 🙄", "I'm really worried about these people who think it's okay to push wanting kids on 17 year old girls. First of all, the girls can decide what to do with their own darn bodies. Secondly I've lived through two pregnancies (I'm happy to still be alive after the second one) and would not recommend the experience. You've gotta be darn sure that you want kids to risk your life and go through that. And lastly, these girls are 17. Can we all just let them be kids for a while longer.", "Ha, this. My feeling is that you have to really *want* kids to do it - I don't have kids in part because I don't have that drive, and I couldn't live with myself if I was one of those shitty half-arsed parents. Kids are people, after all, who deserve parents who will give their whole heart to raising them.", "I have many, many friends who said when we were teens that they didn't want kids.", "Exactly. Whenever I feel the urge to hang with a kid, I have a wide selection from which to choose and a rack of parents who would thrust them over my doorstep and disappear into the wind so fast, lol.", "Thank you, that's a lovely thought, and very kind of you to say 😊 (And thank you for the award!)", "It's incredibly rude and invalidating for some random person to say, \"You might change your mind.\" as if some random stranger knows you better than you know yourself. \n\nLet childfree people just say they wanna be childfree in peace.", "Yesss, it's annoying AF. I'm 37 now and people are finally believing me when I tell them I don't want kids.... the same thing I've been telling them for the last 15 years. It used to be \"you'll change your mind\", now it's \"what a waste, why not!? Who's gonna take care of you when you're old!?\"", "Sorry, I can't help envying you.", ">”what a waste”\n\nA waste of WHAT, exactly? That is so gross. Women and people in general are more than their reproductive potential. What The hell.\n\n> “who’s going to take care of you when you’re old”\n\nWhat a terrible motivation to have children! Ew. Children are not baked in carers. They are humans with their own lives. Why Rob them of their prime forcing them to look after elderly?!? \n\nLawd I hate those sorts of “reasons”. Ugh. I am so sorry for you.", "I'm the same age and I still have a few stragglers who are holding out hope. But they're also the conservative type who think a woman's life is basically over if she's 40+, so I'm guessing I have 3 more years of nagging until I'm freeeeee", "Ugh, I’m 39 and a coworker is constantly along the lines of “you don’t know what life has planned for you” and I say in return, yeah I’m pretty sure kids aren’t in the plan, she’ll double down, “you never know!”… and one day I was just like”jeez, I really hope not, I’m almost 40 and couldn’t imagine keeping up with a kid now!” She just kinda blank stared at me, realizing we’re the same age (her kid is about 17 I think). Honestly, I think they’re jealous of our freedom. Misery loves company kinda thing.", "Right?! They think my life is wasted because I didn't use my uterus 🤯 like, my other contributions to society and my other accomplishments don't matter at all unless I have kids. It's gross. And yep, if I had a penny for every time someone asked me who's gonna take care of me when I'm old because I have no kids, I'd be rich now. In Asian culture, the mentality is that you owe your parents forever Cos they raised you, hence you're obligated to take care of them when they're old.", "Those are leftovers from time periods (sadly not yet long enough past) where having a child WAS having someone that theoretically would take care of you in your old age, as most people had no other option.   \nSadly, people have a very strong inertia when it comes to such deep-reaching cultural changes. You'd think nearly 100 years (or nearly 4 generations) would be enough time to get the job done, but some of these views have very strong roots.", "Many parents do expect that you will take care of them. I am having that now. Between taking care of my family,  working, and helping him, I have no life. I git asked what my hobbies were the other day. I had no answer.", "Hahaha you made me chuckle 😂😂 luckily I don't live near any extended family anymore and make it a point to never go home during major occasions so I don't have to field all these stupid questions. It's exhausting being around people like that. All my close friends now are child free, and I have friends all the way from their 20s to their 70s. It:s awesome, none of them pester me about kids! 😂"]}