{"id": 19892, "submission_id": "14bmznz", "title": "AITA for trying to dictate how my fiancé should spend her money when we are borderline living in poverty?", "selftext": "I 29 M and she 30 F have known each other almost a decade. Rocky relationship in our youth but we both lived and matured(some). We have 2 children together and recently decided to give our relationship another try. Shes a recovering alcoholic, and her new vice to fill the void is smoking. she averages 2 1/2 packs a day.\n\nNow, i dislike smoking but i wouldn't make someone quit because i think its unhealthy and bad. BUT, when buying cigarettes becomes more important than food for our children, gas, or even rent. I felt the need to voice my disdain with the habit.\n\nWe are fucking broke man. I sat down with her and did the math about how much she spends on cigarettes a month. 1/3 of her paychecks EACH MONTH GO TO CIGARETTES. somewhere between 300-500 bucks. \n\nWe have been late on rent every month the last 4 months. Currently have a pay or quit on the house and im paying the majority of the rent and everything else around the house because she took a cut in hours at work and continued to spend her money on cigarettes. \n\nIm being honest when i say i approached this topic like an angel. when nothing changed i stopped being as nice about it. I started telling her she's being selfish and putting her precious cigarettes before the wellbeing of herself and her family. That she's making more time for smoke breaks than she is spending time with the kids. Im becoming a nag and its stressing me out. Before she thinks about feeding or changing the kids she goes out to smoke. She spent her last 20 bucks on cigarettes, then borrowed from her brother later that night to buy another pack. Im pissed off because it feels like the more she spends on cigarettes, literally lighting money on fire, the more responsibility falls on me to cut any costs i can from myself and things \\*i\\* want.\n\nI like to game, id love to buy a couple of steam games for myself. Riot point in league or whatever the fuck. but i don't because someone has to be able to put gas in our tanks and food in the fridge for the house.\n\nAITA for telling her she needs to stop spending as much on cigarettes because she doesn't make enough to live reasonably and also support her habit to the extent she does now. Then getting more and more upset when she won't make any meaningful effort to change.", "created_utc": 1686995686, "permalink": "/r/AmItheAsshole/comments/14bmznz/aita_for_trying_to_dictate_how_my_fiancé_should/", "score": 49, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1)the action of telling another adult human with their own autonomy how they should spend their earned money, then becoming hostile when the action never changed.\n2)is it righteous anger or unjustified. Is it just her money and i need to cope or am i right to be upset?\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA, while addictions aren’t something you can just drop and be done with it is fair to be upset over the fact that the addiction is causing extra weight to be left on you. So voicing your opinion is perfectly fair in this scenario as long as you remember that it isn’t as simple as “just stop smoking.” I wish her the best with recovering.", "NTA, I use to smoke 40 a day and now I mainly vape after quitting for 2 years. If she’s putting cigarettes before food or rent then she needs to see a professional because there is a bigger underlying issue there", "NTA. Yes it’s an addiction but it’s not an excuse. You have every right to be upset with her for how she is spending not just her money but money that’s supposed to help support your children. \n\nWithout professional help it’s only going to get worse. She traded one vice for another. She’s putting her addiction above everything else in her life including her family and basic necessities.", "NTA. She needs to realize get priorities and like you said, feeding the children and being able to get to work are above smoking. \nMaybe challenge her to a single pack a week for starters.\nYou may have to make threats that you can backup otherwise.", "Your partner sounds like an addict. Feeding addictions are the canonical example of what economists call “Inelastic Demand”, meaning they need to have what they’re addicted to, and if prices go up, they’ll still pay. I mention this because you seem to be thinking about her smoking as something she can quit any time she wants to, and that makes her choices really confusing to you. I think you’d have a much easier time understanding her behavior if you thought of it more like alcohol. You knew her when she drank - could she quit drinking because it wasn’t in the budget?\n\nI think your frustration is valid. Addicts spending critical family resources to feed their addiction is a story as old as addiction. You’re left with some very hard choices. \n\nI think the way you understand her maybe needs some work. But I think you’re earnest and trying. So NTA.", "NTA. \n\nBut YWBTA if you choose your relationship over your children. She has proven that she does not put them first. It is nice to think that with nagging she will change. She might. Or might not. \n\nFact is that your childrens needs (home, food, transportation) are in danger because you are choosing to depend on the income of someone unreliable. Do not do this. You fail your kids by relying on her for income right now. She is just to untrustworthy for that. She should provide her share but fact is that she does not. And your kids deserve that that that share is picked up. So, pick it up.\n\nI don't know how you are going to do it, but make all changes necessary to be financially independent. Deep clense your budget. Cut out all unnecessary spending on your end. Talk to your boss how your paycheck does not cover your bills. Try to move to cheaper living, or get a roommate. Watch some budgettering youtube channels. Live by the \"there is always a cheaper option somehow\"-motto. Just make the finances work.\n\nYour children deserve a home and food. Don't you dare prioritize anything else.", "My girlfriend was like this when we met.  I got her into vaping, which saved me a bit of money.  Then after the cig cravings subsided a little I was able to help her quit all together.  maybe a similar approach could help you financially?", "NTA for sure. You two need to come up with a plan on how to spend your money and how to divide up expenses. IMHO the best way is by income. If you both earn the same, you both contribute equally to the shared expenses- rent, food, utilities, kids things. Money left over is available for personal things like coffin nails.\n\nIf one earns more, that person contributes more. One earns twice as much , that person pays 2/3 of the shared expenses.\n\nIf she refuses to be responsible, grab the kids and leave.", "NTA smoking is disgusting and expensive but why not vape it's cheaper and can work on reducing nicotine", "NTA - You can’t force her to quit, but you can definitely show her the numbers and ask her to cut back", "NTA\n\nBut… the problem with an addiction is that people usually use more when they get stressed. And nagging ads stress, so your efforts here likely have a negative effect on what you hope to achieve. \n\nInstead of trying to talk her into quitting, I think it may be more effective to try and talk her into finding help with cutting down (I’m sure you can find free programs online), or trying to talk her into vaping (which is a lot cheaper) instead.", "NTA, she’s wasting your money on absolute garbage that does nothing but harm. Cigarette use kills more per year than covid for the entire pandemic. Priorities!", "Nta. There's a difference between forcing her to stop and cutting down and it's effecting your life.\nI'd give her a portion of the bills, she has to be responsible for paying and I mean put it on her name. And she can bail herself out then. Might shock her rather than you picking up the pieces", "NTA for setting boundary. Are the asshole for thinking you get to ‘dictate’ as you wrote in title. Move on if you aren’t happy!", "Put a patch on her! Jesus. NTA. I agree with the other poster, her problem is bigger than cigarettes if she will spend rent money on them.\n\nI used to be a committed pack a day smoker.\n\nI'd roll my own before I'd endanger my bill money.\n\nIf you're in a position to lay down any laws, law down that law. Home rolled only.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI 29 M and she 30 F have known each other almost a decade. Rocky relationship in our youth but we both lived and matured(some). We have 2 children together and recently decided to give our relationship another try. Shes a recovering alcoholic, and her new vice to fill the void is smoking. she averages 2 1/2 packs a day.\n\nNow, i dislike smoking but i wouldn't make someone quit because i think its unhealthy and bad. BUT, when buying cigarettes becomes more important than food for our children, gas, or even rent. I felt the need to voice my disdain with the habit.\n\nWe are fucking broke man. I sat down with her and did the math about how much she spends on cigarettes a month. 1/3 of her paychecks EACH MONTH GO TO CIGARETTES. somewhere between 300-500 bucks. \n\nWe have been late on rent every month the last 4 months. Currently have a pay or quit on the house and im paying the majority of the rent and everything else around the house because she took a cut in hours at work and continued to spend her money on cigarettes. \n\nIm being honest when i say i approached this topic like an angel. when nothing changed i stopped being as nice about it. I started telling her she's being selfish and putting her precious cigarettes before the wellbeing of herself and her family. That she's making more time for smoke breaks than she is spending time with the kids. Im becoming a nag and its stressing me out. Before she thinks about feeding or changing the kids she goes out to smoke. She spent her last 20 bucks on cigarettes, then borrowed from her brother later that night to buy another pack. Im pissed off because it feels like the more she spends on cigarettes, literally lighting money on fire, the more responsibility falls on me to cut any costs i can from myself and things \\*i\\* want.\n\nI like to game, id love to buy a couple of steam games for myself. Riot point in league or whatever the fuck. but i don't because someone has to be able to put gas in our tanks and food in the fridge for the house.\n\nAITA for telling her she needs to stop spending as much on cigarettes because she doesn't make enough to live reasonably and also support her habit to the extent she does now. Then getting more and more upset when she won't make any meaningful effort to change.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA...hubby smoked cigarettes since he was 14.  We join assets and I pay the bills.  He gets an allowance for cigs and fast food or whatever else each week.   Once he realized half of his allowance was going to cigs...he switched on his own to a vape and only uses three of those a month.  Now he can spend more money on fun stuff.  The allowance system is great!!!", "NTA. If kids weren't involved I'd say run.", "Sounds like getting back together was a massive mistake. NTA", "Very much NTA.\n\nEnsuring you have a home, food, and financial stability are pretty much the plain basics to quality of life. Without these things, it's not going to be pretty. Especially considering you have two dependant children.\n\nSomething I feel like I need to mention is the damage second-hand smoke does to developing children. Children raised in a home with a smoker are at \\~4x likely to become addicted to tabaco themselves. And, which I can attest to through personal experience, growing up in an environment with a lot of carcinogenic airborne particles is linked to a increased chance of developing lung damage or asthma in young children's developing lungs. I know you said that \"I wouldn't make someone quit because i think its unhealthy and bad\", but maybe you should consider it. Smoking isn't just a personal choice when it hurts the people around you. Not to mention, of all the ex-smokers in my life, I am yet to meet one that regrets quitting, so your fiancé probably isn't going to hate you for trying to help her once she is on the recovery side of this.\n\n(Sources: [https://www.tobaccoinaustralia.org.au/chapter-5-uptake/5-7-the-home-environment](https://www.tobaccoinaustralia.org.au/chapter-5-uptake/5-7-the-home-environment) , [https://www.nationalhealthexecutive.com/articles/children-more-likely-to-smoke-if-their-parents-are-smokers#:\\~:text=Research%20into%20smoking%20influences%20on,if%20their%20main%20caregiver%20smokes.](https://www.nationalhealthexecutive.com/articles/children-more-likely-to-smoke-if-their-parents-are-smokers#:~:text=Research%20into%20smoking%20influences%20on,if%20their%20main%20caregiver%20smokes.)) )\n\nWanting to play a game to help you maintain your happiness? That's not going to increase your risks of cancer in both yourself and those around you, whilst consuming 1/3 of your pay check. 100% NTA. Could nicotine replacement therapy be an option? I've heard vaping can be an option when it comes to weening yourself off tabacco, but I'm no doctor.\n\nGood luck.  \n\n\n(Edit: spelling)", "Her priorities are definitely skewed here, and smoking's bad, etc. etc. \n\nOther posters will cover that enough that I don't feel the need to add to it.\n\nOne suggestion I have , is that if she's unable to quit immediately , or cut down, is that she switches to rolling her own cigarettes, the cost is a fraction of what commercial cigarettes cost.  This would at least help to stop the financial hemorrhaging...", "NTA, she is an addict. I don’t think being upset with her is going to help. She needs resources and maybe medication.", "This is really bad … I’d bring it up with her family and friends because she is not listening to you \nTo put smoking before your children and partner is extremely selfish and neglectful… she definitely has a addictive nature if she did stop smoking she would just get a new addiction… is there anywhere you can go to get free therapy for her ?? So NTA !!!", "I also agree about vaping. A good selling point is that it can be done inside. Elf bars are the most popular disposable kind.", "ESH\n\n&#x200B;\n\nMake a new agreement: She needs to cover half of the rent, and half of other costs. THe rest is hers to decide.\n\n&#x200B;\n\nAnd if you can not reach a compromise there - she needs to work more or spend less - end the relationship.", "NTA. But I might not be the most objective person. Hubby and I just got into an argument about this the other night. I had another pair of shoes delivered to the house, this has made 5 pairs I bought this year including the pair I bought for him. He complained how we aren’t saving money. I told him that each pair cost less than a carton of his cigarettes.", "NTA - Time to file for divorce, take the kids and get out of this house.", "Im trying to move from 2 pack a day to vape may i dm you?", "Absolutely. in addition, she seems to be choosing the habit over the family. Another reason to seek help.", "Totally agree and I think it's worth bearing in mind that at 2.5 packs a day not only is that a huge amount of money upfront but you're looking at an individual who will more likely as not find themselves less able to work in future and facing expensive health costs - even in country's with afforable/free at the point of care healthcare, long term care for disability tends to cost money. \n\nA recent family reunion, where multiple members of the family hit 70 during the pandemic, really drove home to me the devastating impact of smoking, even on the ones who quit years ago. We've got a partner with congestive heart failure who couldn't come, another relative with  COPD/emphysema, several cancers the probability of which were raised by smoking, and you could see the difference in ageing and health between those who smoked (even if they'd quit) and those who never smoked. It was really quite stark and I don't think any of them were ever on a two pack a day habit. \n\nIt may sound cold, but I think it's reasonable to at least question tying yourself to an individual who is sabotaging a secure future in this way.", ">Maybe challenge her to a single pack a week for starters.\n\nI agree with you that this needs to get under control, but you're talking about going from 50 cigarettes a day to 3 cigarettes a day.  She probably won't be able to do that.", "This comment needs to be higher. OP, is it time to consider ending the relationship again? Are there welfare supports available for single parents where you live? It may be easier to live as a single dad than with a woman who isn't being realistic about your finances.", ">I'd give her a portion of the bills, she has to be responsible for paying and I mean put it on her name. \n\nHow does that work? Where I live, you can't unilaterally opt out of being responsible for bills that you're responsible for. You're either contractually (rent, credit cards, etc) or statutorily (utilities, tax, etc) on the hook for them.", "Yeah no worries", "You can't opt out but you can change the name of the person responsible for them like me and my OH split our bills so all the water bills, tax and car are in my name so if I default it's.me.they go to. And he has gas, electric, tax etc which have him as the account holder so they'd be contacting him for default payments.", "That's my point though, you surely can't change the name of the person responsible. You can try to change the point of contact, but ultimately the creditor will go after any and all people associated with the debt."]}