{"id": 19916, "submission_id": "14by5mg", "title": "AITA for telling my girlfriend not to climb a particular problem?", "selftext": "A few months ago, me and my girlfriend (both 23) saw someone go bouldering on tiktok and gave it a go. Long story short, it's something we both like to do together as well as separately and I have fallen in love with the sport. I typically go 3 times a week on my own and she'll go 1-2 times on her own. We also go once a week together. \n\nToday, we went to our local gym and there's a red problem (V3) which took me many goes to climb because it had small footholds and finger holds and was on an incline. It was difficult for me as a 5\"8' guy, so it would probably be harder for her as a 5\"2' since the last move is quite a reach for me. \n\nMy girlfriend saw me send the problem and asked me to watch her give it a try for tips. I said that she probably shouldn't do it because she isn't confident with small holds and the incline is a lot and it would be scary. She walked away and didn't really climb with me for the rest of the session. \n\nIn the car ride home, I asked her why she stopped climbing with me and she said I made her feel discouraged and like I thought I was better than her. I apologised but said that it was because she's said she struggles with incline and I was just looking out for her safety. Was I an asshole for that? I thought it was an act of kindness.", "created_utc": 1687026724, "permalink": "/r/AmItheAsshole/comments/14by5mg/aita_for_telling_my_girlfriend_not_to_climb_a/", "score": 177, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I said my girlfriend shouldn't climb a problem I sent because I thought she would find it scary and unsafe when I could have just let her find that out on her own\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YTA\n\nI'm a climber.\n\nYou were climbing indoors. It's multitudes safer than outdoor bouldering. Just spot her if it's less secure and a fall could be bad. How else do you think people get better at climbing?", "YTA There are things you could have said without telling her not to do it. She asked for tips. You could give some without completely discouraging her.", "in this instance - YTA - instead of gatekeeping, you should have just let her try it.", "Huge dick move. I've been climbing for 25 years and wouldn't ever tell someone not to even try a problem because *I* thought I knew best for them.\n\nI once led a trip of total beginners to Smith Rock in Oregon and didn't tell them a single grade. If they thought a line looked cool, I put a rope on it and let them try. One kid sent a 5.11d and he'd only been climbing for a week. \n\nShe specifically asked for your help because you're a stronger climber and you crushed her ambition *and* refused to help. YTA.", "YTA.  The gym is probably the best environment to test one's capabilities and limits; you shut her down and discouraged her.", "YTA\n\nRock walls are there in part to build confidence.  You seem to be there to shoot her confidence down.  Bottom line, she asked for your support and you told her she shouldnt  (translated couldnt) do it.\n\nThis may be the reason you guys go climbing so much but only go once a week together.", "YTA you didn't need to tell her not to do it. You could've just told her it was difficult and if she wanted to give it a try then it was upto her to do it why tell her not to.", "YTA - You are in a safe setting (vs in the wild). Indoor training is to build confidence; stretch yourself to new heights. Why not encourage her to give it a try?  You don't need to be a downer detailing why she can't succeed.  I suggest she invest in a coach who can expand her skills. Be curious if you do this behavior in other parts of the relationship.", "YTA\n\nTimes 10. \n\nAlso a climber here. \n\nThe whole point is to try different things, and to try things you find a little difficult to get better. \n\nYou're supposed to tell her to keep her hips as close to the wall as possible, and keep as much pressure/tension on the feet. \n\nYou're NOT supposed to discourage her.\n\nThe whole point of the mat is so you can fall on multiple occasions. You're also supposed to learn how to fall SAFELY.", "YTA - but not on purpose.\n\nShe is not in danger at your local gym, this is the perfect place for her to try to push herself. Saying that you were looking out for her safety probably felt like a cop-out. You’re not out in nature on actual rocks, you’re in a gym with gear and padded floors.\n\nAlso, telling her “you aren’t confident with small holds” is a bit hypocritical. How is she supposed to be confident when her partner is basically like “yeah I doubt you can do it” \n\nYou need to let her try challenging things and ENCOURAGE her to do so. Who knows, us short girls can be nimble, she could do a lot better than you think.\n\nI don’t see any reason here for what you said to her, there’s was no reason for you to stop her from doing it besides reasons that actually only benefit you. YOU felt like she’d struggle, YOU felt like it wasn’t safe (again that doesn’t make sense, you’re at a gym), YOU felt like she couldn’t do it.\n\nShe was confident in herself and you shot it down.\n\nEdit: spelling", "YTA. \n\nNext time just tell her to be careful on the last one as it is a bit tricky.", "YTA. She knew it was probably above her level and she wanted to give it a try anyway. She was looking for encouragement and you told her to give up before she even started because it’s “too scary.” Go apologize and try to be more supportive in the future.", "YTA - from a fellow climber.\n\nClimbing is a lot about encouragement. My friends and I actively encourage each other to try things outside our comfort zone indoors because that’s the only way we are going to improve. There’s a lot of falling and failing and that’s how you learn.", "YTA and yes you did discourage her and thought you were better than her. She was right and I hope she goes back without you to try it on her own or maybe she can find someone who will actually support her to climb with.", "YTA you could have warned her about the large reach, as height does affect difficulty. What you actually said was condescending and unhelpful.", "Yta stop being so negative all the time it brings down everyone", "YTA. She didn't ask you if you thought she should try it, she asked you for tips. You could've just graciously given them to her rather than try to discourage her and let her give it a try.\n\nWhether you realize it or not by doing that you likely made her feel extremely small.", "While I don’t think you meant to be AH, how you dealt with the situation wasn’t supportive. So YTA.\n\nWhen you told her the climb was difficult, she understood your concern and asked for your help by watching out for her. From her perspective, she wanted to try something with you and continued to discourage her. \n\nWhile it’s understandable to be concerned, I figure there are measures to ensure that she isn’t seriously hurt. So why not allow her to try it out?", "YTA...softly. You don't encourage someone to get better by telling them its too hard. It's the same thing you do with toddlers; you let them explore and figure out their body mechanics without harping, because its measured risk or something like that. I read it in a child development book. She can't get stronger or more confident if she doesn't continue to push her boundaries. How is she supposed to get better with inclines, if she doesn't...get better at them. To get better she has to keep trying and failing and trying and failing, until she tries and succeeds. Be her cheerleader, not her naysayer", "YTA. How will she ever learn and get more confident if she never tries? I'm 5'1\" and I've climbed with my 5'10\" husband and, while he was generally better at it than I was, he was supportive and encouraging when I tried new routes. Actively discouraging her is pretty shitty.", "YTA. You made it about her mental state--confidence, \"scary\"--instead of about the real, practical issue you saw (the last move might be too far for someone of her height).", "NTA, but perhaps it didn't come out quite right the way you said it at the time. The way you explained it to us sounded entirely reasonable.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nA few months ago, me and my girlfriend (both 23) saw someone go bouldering on tiktok and gave it a go. Long story short, it's something we both like to do together as well as separately and I have fallen in love with the sport. I typically go 3 times a week on my own and she'll go 1-2 times on her own. We also go once a week together. \n\nToday, we went to our local gym and there's a red problem (V3) which took me many goes to climb because it had small footholds and finger holds and was on an incline. It was difficult for me as a 5\"8' guy, so it would probably be harder for her as a 5\"2' since the last move is quite a reach for me. \n\nMy girlfriend saw me send the problem and asked me to watch her give it a try for tips. I said that she probably shouldn't do it because she isn't confident with small holds and the incline is a lot and it would be scary. She walked away and didn't really climb with me for the rest of the session. \n\nIn the car ride home, I asked her why she stopped climbing with me and she said I made her feel discouraged and like I thought I was better than her. I apologised but said that it was because she's said she struggles with incline and I was just looking out for her safety. Was I an asshole for that? I thought it was an act of kindness.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA for your delivery, not your reasoning. You didn't mean to come across the way you did.\n\nWork on your communication together, she asks for pointers, just let her have em. I don't think you will do this again tbh unless you don't try to improve communication.", "YTA", "mild YTA, you were well intentioned and saying it based on valid concerns, but I can see how the way you said it (and telling her not to do it vs just giving her heads up on the things she might want to be aware of it) was dismissive and made her feel belittled, esp since you're both serious climbers. \n\n Honestly as a tall person I often accidentally find myself trying to grab things or carry heavy things for my smaller friends just bc I assume it's easier for me to do it and I've been trying to be more mindful of how that could come off as implicitly dismissive of their abilities. sometimes esp with the gender dynamic it can be important to think about the other person's perspective", "YTA. \"I don't think you can succeed so don't even try\" is an incredibly cruel thing to say to someone for anything where an incredible amount of money or someone's basic safety isn't on the line if they fail.", "YTA. You may have meant well but it came across as condescending. Are there not safety measures in place at this location, such as harnesses and padded mats? She's an adult. She's capable of assessing risk and her own ability. Let her do her thing.", "YTA. You have no business telling anyone what not to climb in an indoor gym", "YTA. \n\nI don’t think you intentionally meant to hurt her feelings but if she wanted to try something then why not encourage it? Even if she didn’t succeed and found it difficult it’s all a learning curve and she’ll only improve by trying and learning from mistakes, just like everything in life.", "YTA. \n\nYour girlfriend: can you spot me so I can practice something I'm trying to get better at?\n\nYou: no, you're not good enough to practice", "YTA\n\nYes, you undermined her.  She was asking for advice because she *knows* it's more of a challenge for her than what she usually does.  She was not looking for discouragement.  But that's all you offered.", "YTA", "NTA\n\nBut keep in mind it's very hard to tell people \"I can do this because <XYZ> but I believe you should think twice about doing the same, because <ABC>\" without them hearing \"I'm just better than you.\"", "This, it's bouldering for fucks sake. Worse that could happen is she drops from two metres onto a crash mat. And whilst height does help for reach, being lighter is also an advantage. Not everyone solves the same route in the same way.", "Yes I get that, you have to do hard climbs to get better. There were just volumes and slabs on the problem next to it which I thought she might fall into if she slipped off the hold", "Exactly. OP could have said “I found that one really hard, the footholds and finger holds were really small and the last move was a big reach for me. Any creative ideas?” Or similar. Also, just as his taller height might give him some advantage, her smaller fingers might help her with smaller holds.", "Usually we go separate because of work schedules, we'll go together on the weekend", "Yes, it's not as dangerous as bouldering out in the wild but it's not without danger. Source: currently recovering from a broken arm from bouldering in a \"safe\" climbing centre.\n\nI agree he's an arsehole though.", "I just thought there was a risk of her slipping if her foot wasn't right and there were volumes for another problem right next to us, it was more about that than falling onto the padded mat awkwardly. I see I made a mistake now though", "Inless someone is in immediate, serious danger if they should fail, or the cost of trying and failing would be more than they can afford... why do you feel the need to tell people they shouldn't try doing something you think they may fail at?", "Take an intro to bouldering class and learn how to spot effectively. She can also just bail whenever.", "Or were you worried she’d do better than you? SMH. Your point doesn’t seem very supportive or encouraging.", "Maybe you’ll go together, but maybe not anymore since you have shown you can’t be supportive.", "Yeah totally. Thinking you're invincible just because you're indoors is going to lead to injury.\n\nThat said, it's the place to try stuff. I suggested that OP learn how to spot effectively.", "Yeah I should have clarified better! \n\nDefinitely doesn’t eliminate possibility of injuries, but less possible than in the outdoors. And is the safest place to learn! \n\nThanks y’all, I definitely don’t want anyone to take it as “nothing bad can happen since you’re inside”", "People get hurt doing all sorts of mundane activities. Bouldering is slightly more hazardous then riding a bike.", "And I hope you heal quickly!!❤️", "Yeah I totally get the sentiment, just bad delivery.\n\nI’d deff have a talk with her and explain that you know she can do it and you were just worried about the first time but should have encourage her to go for it. These things happen! It’s how you communicate after that matters🙂", "I bailed once and I was barely off the floor. Got my hands and feet on the lowest holds and just fell backwards like a turtle on my back.", "My top tip: if you fall, don't stick your arm out. That's also exactly what they tell you in the safety briefings but somehow, in the moment, it escaped me.", "I’ve slipped off the wall from pretty high up before. As long as you know how to fall properly, you should be completely fine in an indoor gym.", "Noted 📝🫡\n\n*as I sit from the same spot I will be sitting in all day with no intention to ever climb anything*", "It’s really hard to stop automatic actions like sticking and arm out as you fall, no matter how many times safety briefings cover it!", "There are even places that offer classes just about how to fall. I used to be the \"dummy\" for demos for my karate studio's fall classes because I was ready to toss up in the air lol", "Someone told me this tip when I was a kid and I thought it was great fun to just fall for no reason just to show I could land without hurting myself.\n\nThat practice has come in handy more often than I expected as an adult but even for me when I start falling my instinct tries to stick my arms out and I have to override it."]}