{"id": 19918, "submission_id": "14bxhst", "title": "AITA for not taking a former friend out who is now disabled?", "selftext": "This young man is someone I trained parkour with in a group of acquaintances, about 10 years ago. I'm 43 now and I think he's in his mid-twenties. Even when we trained together, we weren't particularly close. Since then we drifted apart, lived in different cities, contact faded.\n\nRecently, he contacted me again. He told me he's suffered a brain trauma, and is now in a wheelchair, which much diminished capacities, both physically and mentally. We chatted a little, and then he asked if I would come by and take him outside with his wheelchair to go places and have some fun.\n\nI declined. It felt too artificial. I didn't know him all that well all those years ago, nor do I really know him now. It just feels so strange, to go and pick him up. I get the sense he's very sad and lonely, reaching out to former friends. But to me it just feels too forced, too awkward.\n\nSo, am I the asshole for declining to come by and take him out for an afternoon?", "created_utc": 1687025006, "permalink": "/r/AmItheAsshole/comments/14bxhst/aita_for_not_taking_a_former_friend_out_who_is/", "score": 394, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I think I may be the asshole, because I declined to take a disabled former friend out to have some fun. That is the action you requested I described, or in this case the inaction. As for why it might make me the asshole, well, I feel that in general people give more sympathy to disabled persons. It is not clear to me if in this case my own reservations weigh more than those sympathies.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NAH he tried and if he didn't insist or wasn't rude about it, it's OK. It's your right to decline politely. The end", "NAH. I don't understand all the N T A votes. Wheelchair dude is in no way TA for reaching out.", "NAH. You didn't say no because he's disabled, but because you were never that close and you drifted even further apart since, so it would feel awkward and forced. The guy is not an asshole for reaching out either.", "NTA, but I hope you were really tactful about how you declined.", "NTA - But I hope you were super polite about it.", "NAH, but you’re not exactly a hero.", "NTA\n\nAs a rule, be honest and polite but don't pity him.  \n\nDisabled people including myself don't like to be pitied because of our disabilities.", "Nta, but you obviously are feeling guilty. Can you look into services in the area for him? Then maybe meet with him once and explain that your life is too full for continuing relationship, but you would love to spend some time helping him find resources in the community so he can meet people and get the help he needs.\nI do not blame you at all for not wanting to be in this position. But it does sound like this guy could really use a friend.", "NAH because I have a feeling that the brain trauma alone explain his lack of social grace.", "NAH. But it doesn't reflect well on you.", "kinda yeah...reaching out to be friends and getting shot down sucks.", "NTA: you were very polite. He needs a friend and it’s in your right to decline but you are definitely NTA in this.", "NTA, but maybe try just chatting with him via text or Discord or something.  There's a middle ground between \"ignoring his existence\" and \"taking him out\", you know?", "[deleted]", "YTA. He's in a wheelchair. Give up an afternoon and take him out.", "NAH, but... if you don't harbor any I'll feelings towards him why not spare some time to another fellow human being? I think he is so courageous to have approached you, he is dealing with some major changes and is trying to adapt in a very positive way, as in reaching out to people who shared common interests and trying to have some good time to balance out all the hardship. After all, he's not hogging your phone crying and leaning on your shoulder, he just trying to have a normal-ish day with someone he probably admired back in the day. Don't you think it's worth leaving your own daily domestic comforts for a DAY to give that to this young man who is going through so much? If you were in his shoes you would like that, or you even have the courage to ask for it? Honestly OP I think you could have just as much of a good time as him. Your heart is big enough, it can fit him too for a day.", "YTA: If you were approaching someone and they said no, how would you feel. Just because you don’t know someone well doesn’t mean they don’t look up to you. You were 10 years older than him at that time, kids always look up to grown ups. Maybe in his mind you were kind and a good guy and a friend. Otherwise he wouldn’t have asked you.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nThis young man is someone I trained parkour with in a group of acquaintances, about 10 years ago. I'm 43 now and I think he's in his mid-twenties. Even when we trained together, we weren't particularly close. Since then we drifted apart, lived in different cities, contact faded.\n\nRecently, he contacted me again. He told me he's suffered a brain trauma, and is now in a wheelchair, which much diminished capacities, both physically and mentally. We chatted a little, and then he asked if I would come by and take him outside with his wheelchair to go places and have some fun.\n\nI declined. It felt too artificial. I didn't know him all that well all those years ago, nor do I really know him now. It just feels so strange, to go and pick him up. I get the sense he's very sad and lonely, reaching out to former friends. But to me it just feels too forced, too awkward.\n\nSo, am I the asshole for declining to come by and take him out for an afternoon?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", ",", "NTA.  As you say, he is looking for a friend (more likely, a free caregiver).  There should be public services available to help him, but he is not your responsibility to interact with.", "Most probably forgot NAH exists as a voting option since so many posts are Y T A or N T A.", "But this guy actually asked for help. Helping wouldn't be pitying him when he's specifically requested it.", "Why? Because you think people have an obligation to come up with fun social excursions for a random person they knew ~10 years ago and were never close with?", "Nobody is obligated to come up with fun activities and social excursions for a random acquaintance they were never close with and knew ~10 years ago. OP’s only obligation in this case is to not be a dick to the guy.", "The fact that people generally don’t like hearing “no” is irrelevant. Nobody is obligated to come up with fun activities and interact socially with random people they knew ~10 years ago and were never close with.", "No way dude. OP is not responsible for how this guy handles rejection. It would be a nice and kind gesture for OP to accept, but he’s not obligated to do so.", "That's an absolutely wild leap to take about the caregiver thing. This man committed the cardinal sin of -checks notes- *reaching out to an old contact to attempt to rekindle a friendship*. He is not an AH for that.\n\nNAH.", "If OP had an obligation, then they WOULD be TA. But they had a chance to be a mensch and didn't. The injured dude certainly isn't an asshole for reaching out.", "Did I say the injured guy was an asshole? No.", "Maybe rather than fighting on reddit you could go out and help someone?", "That's what a N - T - A vote means in this case.", "Did I vote NTA? Also no.", "Is there a reason you're arguing so aggressively in the comments on this post?", "This is seemingly embarrassingly pedantic. So what is your vote?", "I’m not sure why you think people have to justify what posts they comment on to you, a random Redditor, but they don’t. You’ve tried and failed to “gotcha” me twice, so maybe just stop.", "With all the arguing you are doing in the comments I'm starting to think you're OP's alt account.", "Gets disagreed with. Tries and fails to gotcha person who disagreed with you twice. Accuses person you failed to gotcha of being OP. You clearly spend way too much time on Reddit. Consider going outside or something, instead of trying to instigate fights because someone disagreed with your opinion. Pathetic 🤣", "NAH, my opinion is dude probably just lost a lot of people and is searching for people he has any connection with to form a friendship, you're also not obligated to work towards a friendship or to hang out with him.", "NAH. He's not an AH for reaching out so long as he didn't push. You're not an AH since y'all weren't close. Might not be the end of the world though if you did and you may find a new friend. A couple hours of your time might mean the world to him if he's reaching out", "Nah, he can ask and you can say no. People change but you don't need to be close.", "Yes.\nYou are the AH.", "NAH", "NTA\n\n&#x200B;\n\nHe is basically a stranger.", "NAH but I feel so bad that he's lonely. That's gotta be a hard life. If you feel inclined, maybe you can look up some resources or activities for people in wheelchairs or with TBIs and let him know about them.", "I know there's a difference between helping and pitying.\n\nI added the pitying part because a lot of people tend to pity disabled people in this type or similar situation.", "Sounds like you didn’t train him well enough.", "Yes, politeness in my reaction I felt was key and I was indeed polite when declining. Thanks for your reaction.", "This is why I felt unsure. I don't think he's an asshole at all, it's perfectly ok to ask this question, but I am not quite sure if declining is ok. I think it is ok of him to ask, but seeing as we are not at all close friends, I think it is ok for me to decline. But the wheelchair and mental issues make me doubt myself. What do you think?", "Thanks for your reply. I guess this is really my deeper point. I feel if I spend any time with him, it will obligate me to keep spending time with him. Like, if I say yes once, it sets an expectation to keep saying yes.", "This is exactly what makes me feel doubtful, you pinpointed what I'm thinking better than I expressed it myself. He indeed is not begging, it's just a polite question. I do think he admired/admires me. A day is not much in any person's life, yet I feel it is too wrought, too forced. I have, now that you mention it, indeed confirmed to him that it is very courageous to reach out like that. Maybe my underlying problem is that if we get together for one day, I will be obligated to do so every month. I don't know, it feels very complex.", "Thank you. Yes, I thought long and hard about the exact words to use in my reply, and was not blunt or hurtful in any way. I told him I think it's very courageous to reach out like that and that I'm sure there's lots of the old friends who are much closer to him than I am.", "Thank you for your opinion. I too feel bad for him. It's one of the reasons I reached out to the internet to see what is what. I too feel bad that he's lonely. My thought is that if someone feels lonely, someone should help. I just don't know to what extent I am obligated to be that someone. Though I will indeed think about what resources are available that could help him. That's a solid piece of advice thank you for that.", "Thanks for your opinion. Yes, I was indeed very kind in my reply. I thought long and hard about how to react. I told him I think it's very brave to reach out like that, and that there's at least a few people who are much closer to him still than I am now.", "Oh, that is quite a good piece of advice, thank you. Yes, I did consider this. I know there are some people in his life that could do this with him, and I just feel hesitant to take that step. If I help him get support, I become the friend he thinks I still am but I know I never was, which will inevitably lead to his disappointment, which I think he no longer has the mental capacity to understand. It's really very sad.", "This is actually a very big part of what makes me doubt the whole thing. If I compare it to dating, the act of reaching out confirms that you accept the risk of being shot down. But this applies to mentally undiminished people. And he is clearly not. I can see that he is mentally not as sharp as when we were acquainted. But I don't know if or how that changes my obligation to not shoot him down. I have been very kind and thoughtful in my replies, if that helps. I would love to hear your thoughts, I think I could learn something.", "Would you mind expanding on your opinion? Why does it not reflect well on me? I truly would like to get to the bottom of this, or at least to get more insights from other people. You say 'it doesn't reflect well on me', and I can feel that, but I don't exactly understand why. What are the details at play here? I do hope you will take the time to reply, it would be very interesting to learn from your input.", "That's a good piece of advice, thank you. Yes, I did reach out myself once or twice in the past few months. It feels like he attaches more value to our friendship than I do, which is not a sin or anything. So I made sure to say hi once or twice when it had been a week or two since he contacted me. Though honestly he did not push it at all. Yes, I feel perfectly fine keeping it low key and just chatting every now and then. That's actually a very good point thank you. It is indeed not either nothing or everything. Oh, thank you.", "This is something that is difficult for me to understand. I have a rather high IQ, as well as a certain degree of autism. I truly do understand that no one, regardless of ability, likes being pitied. Do you have an insight as to pity in terms of mental disability? It feels to me, and I truly do not mean to be disrespectful, that being irked by pity depends on your mental ability to being irked. If a person is 'ahum' 'merely' physically disabled, they are still fully able to be irritated by other people pitying them. But I don't know what the situation is if a person is both physically bound to a wheelchair and mentally diminished in capacity. I do think that regardless of how it is perceived, respect and kindness must always be given. So I do, that is without question. I respect everyone, regardless of how my respect is received. I would really love your feedback on this, this is a very difficult question for me to answer on my own.", "I have a rather high IQ and a good measure of autism. I find it very difficult to understand this. I also, at a basic level, feel the traumatic brain injury mostly if not entirely explains the current situation. All the years when he didn't have a TBI he did not reach out. But the fact that after the TBI in some recesses of his brain he thinks of me, makes me feel like I have had a positive impact on him and he want s to reconnect with that. But it also feels like if I'm thirsty and you're thirsty and I have a sip of water and you don't, why should I give you mine? It feels like you have a good take on this and I would love to hear from you, so I can learn.", "Thank you for your reply. How do you feel the fact that he's a wheelchair user and has diminished mental abilities affects the idea that he's basically a stranger? We were many in that group that we both trained in, a few I still know well today. Having drifted apart from the others makes me inclined to decline their reaching out, but being in a wheelchair and being mentally diminished, I don't know how that affects things. Would you mind sharing your thoughts?", "Thank you for your reply. In fact, this is an aspect I had not yet thought about. Yes, we trained parkour together, and I, being older, naturally fall into the role of trainer/coach. He was fifteen or so when we did sports together, so at an age where you still look to adults for role-models. Freerunning is a very individual sport though, it really asks that you yourself judge and estimate your abilities. Our relationship was never really that of trainer/pupil. Though I understand that it naturally flows into such divides. I do not think however that the current situation reflects how well I taught him things. Having a traumatic brain injury is out of my control. I could have taught him perfectly, but the TBI could have caused him to forget everything. Maybe, if I had taught him even more, the TBI would have done the same damage but left him at a higher level. I do not think that is my responsibility. But I get your point, it feels like he attaches more worth to our relationship than I do. Which I also do not feel like it puts any blame on me.", "It really depends on your level of comfort, honestly. He's obviously feeling lonely and isolated to reach out to someone he barely knows for companionship like this. One the one hand, it would be a kind thing to do, but on the other hand, you'd likely be setting yourself up for him to continue to ask.\n\nSpending time with him would be a good deed, but a single afternoon, or even an afternoon a month if you're feeling generous is unlikely to change his situation. If it were me, I'd probably try to find out a little more information about his situation, and then see if I could source any resources or day programs for him. He needs to make genuine connections with other people that are compatible with his new reality, and that's just not you.\n\nEdit: I have a child with an intellectual disability, and there's a world of difference in the quality of the social interactions between her and people who are just being nice to her, and actual peers who are on her level and genuinely look forward to spending time with her.", "It's always ok to decline regardless of the other person's circumstances. I'd argue to accept out of some feeling of obligation would be the more asshole move tbh.", "I get what you're saying, but an afternoon for you could mean the world to him. I'd consider reconsidering. I've had to smile and nod through enough worthless meetings to lean towards dealing with this acquaintance for a couple of hours. It's certainly okay to say no, but it's not a bad idea to say yes.", "Cross that bridge when it comes to it man. He may never reach out again, the whatever bond you dudes have may naturally fades away, you may really enjoy his company and friendship, who knows. Wheelchair bound people are actually very independent, and society advanced bounds in facilitating everyday shit for them. I might be wrong but I guess he just wants someone who saw his old self and partook in the same hobbies as him to actually remember who he is/was and come to terms with his past/future. Don't feel forced to do anything but don't overthink either. He came out of his comfort zone, maybe you can too. It's actually really fun to get to know other people in a deeper level, you get to know better about your very self and you know improve in a very organic way. Excuse the esoteric angle but wiser people say God inhabits each one of us and the same God who inhabits you inhabits him. Help the brother out, keep the good will flowing, I'm sure it'll come back to you.", "I mean, you don’t have to commit all day to him. You could just go out for a meal or a coffee to catch up for a few hours. I would bet he felt far more awkward asking you than you would if you said yes and hung out with.  \n\nYou’re not obligated to, but what have you got to lose aside from feeling a bit awkward? If you go and don’t like it, you don’t ever have to take him out again. You aren’t making a commitment to anything more than lunch. \n\nBut you might actually have an enjoyable time and I think that is something of value to both of you.", "you dont have any obligation. Im just a friendly person. If someone wants to reach out to me and want to be a friend, I would probably reciprocate and be friendly back. It never hurts to have a friend, and sometimes we can be super lucky to find real friends in life that are a treasure.\n\nMy fiance works with kids with down syndrom and autistic children. We've come to the realization that, no matter how much help they may need, they truely are a gift for us to know and apreciate. They make the world and us a better place for existing (not that there arent assholes in the bunch occasionally).\n\nAnother story.... I was a kid and worked with my dad in construction.  He got alot of jobs here and there with a guy who ran multiple homes for seniors. At first I felt uncomfortable around them, cause they used to see a kid they really wanted to interact with me, and ask a ton of questions ,and old peopke are just...well reeealy old. But one day I decided to start asking question of my own,... and these old peopke had freaking amazing jaw dropping stories and lives. Ww2 stories, stories of the depression, stoeies of some crazy shit. If you ever see old people, try having a cpnversation to find out who they are, it just might blow your mind,..it certainly did for me.", "Your opinion resonates with me. I do indeed feel I cannot be expected to be obligated to come up with things to do. For close friends I have now, maybe, but for people who were never really close to me, and who I knew a long time ago, this is debatable. My worry is the wheelchair thing. I honestly don't know if being in a wheelchair and having this diminished mental capacity overrules my initial feeling to not comply with his request. It feels like you have a good idea about this and I do hope you reply with your thoughts.", "It would have been kind to spend some time with him. It sounds like he is having a really hard time and it would mean a lot to him. You don't mention any reason not to beyond not feeling that he was ever a close friend.\n\nIt doesn't make you an asshole, but you have a chance to do good and think it's \"too awkward\".", "It really depends on their own mental disability. Treat them as you would yourself. \n\nI have mild cerebral palsy. I absolutely hate being pitied for my disability which has happened.", "I’m sorry, I was being facetious. I absolutely don’t think you are in any way responsible for his TBI. And I don’t think you’re TA in this situation. I think it’s NAH.", "This actually sums up how I feel quite well. I think he, at some basic level, is not asking for me to spend time with him, once or once a month, but for help finding the help he needs. I don't think I am able to do that. I do feel afraid that if I accept once I do set myself up for accepting each time. I can think about who I know who could maybe help him better than I can. Oh, I really appreciated your feedback, thank you very much.", "That is more or less also how I feel. If I had planned to watch paint dry, that was my plan, and as such it is my priority. I get this for able people, but I feel pangs of doubt as he is rather diminished both physically and mentally.", "Thank you for this insight, I actually think it has a lot of merit. Others have pointed out that agreeing to hang out once does not mean you agree to hang out a lot of times. I can cross that bridge when it comes to it. Do you think if I agree to hang out once it obligates me to do it every time he asks? I would appreciate your thoughts and hope you will reply.", "This is actually a very helpful comment, thank you. I'm not a godly person, but that's not the debate. I do understand what you mean. I can hang out with him once now, and then see how to respond of and when he asks it again, or why not, ask for it myself if I am so inclined. He did indeed step well out of his comfort zone, so why not me too. I also liked your point that my seeing him might help him come to terms with his old self and his new self. Thank you for this contribution, I will definitely give it my thought.", "That's a good point, I do indeed not have a really obvious reason not to. I do think I feel hesitant to do it once, as that might obligate me to do it every time he asks.", "Do you know anyone in the social work field? He needs a caseworker if he has no one advocating for him. And if you're in a city, there are usually day programs for adults with disabilities where they get to hang out and watch movies, go on day trips, and generally spend a bunch of fun time with people like them. Not saying you need to find these resources for him, but if you're reaching out to someone who can help, its always good to have an idea of what you need help with.", "I don't think so, but you'll also have more information about how you feel about it. I do a lot of different kinds of volunteer work, which started in high school just spending time with seniors in nursing homes. It was required for school but taught me the value of just sitting and talking to someone and making them feel seen and heard for a while. If it's just once, that's more than enough and more than many others would do. Maybe it's not so awful and you start a new, different relationship than you had in the past, and in that case see what works for you. Maybe it's an afternoon once or twice a year. Maybe it's occasional texts or playing a game online here and there. It's okay to say no at any time but I feel like you posted because it didn't feel quite right to say no. Lean info that, it's rarely wrong to do the kinder thing.", "NTA.  You weren't close to begin with and you haven't been in contact for years.", "Where's he located?  If he's near Boston I'll take him out, if he's up for it.", "I don't think most people really understand the designations", "Probably the case.", "And that's fair, you're not obligated if you really don't want to (and doing out of pity would be almost worse in some ways) and you're not an AH for saying no.", "That is a very valid point. If  you are able to communicate with those people, I would try to reach out. I wonder if they know that he is calling virtual strangers seeking companionship. They are likely overwhelmed by the changes his life's brought to theirs.\nGiven that you know there are people in his life helping him navigate it,  I wouldn't feel too bad just walking away. . It just a hard situation to not feel guilty about.", "It shouldn't affect the idea that he's basically a stranger at all.", "There's comments about how brave and good it was for him to reach out but also, how cool that he chose you to reach out to. Especially as you describe how you knew each other, you must have left an impression as a kind and helpful person for him to ask you now. It sounds cheesy but I've gotten far being the person that others believe me to be. I'm weirdly (to me) in a position of respect and authority and have consistently found it worthwhile to take the time to meet with, listen to, talk with, learn from, and mentor people. I'm a hardcore atheist but people are (very nearly) always worth it.", "Not the person you asked, but no, hanging out once does not obligate you to hang out again. Try it and see how you feel about it. \n\nYou are quite a bit older than him. Maybe he sees you as a role model or in a big brother type of way. He definitely sees you as a connection to his previous life. He might just want to connect to his past, but that doesn't mean that one encounter results in a long-term commitment to him. You will always have a chance to decline further engagement. \n\nAlso, you say he seems to have mental impairments from his head injury, but his ability to communicate may be impaired so that it presents as such when that may not be true. Just a thought from someone who deals with the special needs population daily. It may not change the outcome, but it may change how you go into your encounter should you choose to. \n\nJust don't feel pressured to meet with him only because he is disabled. He doesn't want that. (Not saying you are, just putting it out there)", "NAH\n\nHe does sound lonely but he's essentially a stranger to you.  You had a connection years ago... but you haven't had contact for a long time.\n\nI'd feel quite uncomfortable too.  But I'd probably feel uncomfortable in this situation even if they weren't disabled.\n\nI also wonder if his brain injury has meant he's lost some inhibitions and lacks the insight on what the situation calls for.  A normal interaction might be a few phone calls and then a catch up.  Not an immediate instruction to pick him up and take him out.", "Nah. It does seem odd to call a former acquaintance out of nowhere but i am going to assume he is very loney & desperate. If you happen to someday be in his area w time to kill, it would be great. If you could pick up the phone & check in from time to time, that would be incredible. But you are not required to do so. What has happened is very sad but its up to you rather you want to help.", "NTA", "I hope you update us on how it went if you do hang out!", "NAH but it would probably mean a whole lot to him if you ever do decide to spend a bit of a day with him", "NAH, there's nothing wrong with him reaching out, nothing wrong with declining. As long as both sides were polite and nobody tried to insist on anything then there doesn't need to be an AH", "This. Many \"friends\" won't stick around long term if you become disabled. He may have already tried reaching out to the people he thought were closer friends, sadly. I don't think it would hurt to spend an afternoon and see how it goes, but yeah, no obligation.", "How is the guy in the wheelchair the ah here?\n\nThis isnt a n ta this is a NAH", "You won't know if you never try, and seeing him once doesn't obligate you to ever see him again. \n\nDo you feel obligated to continuously see everyone you've ever hung out with in your life? If you meet up with a new acquaintance for coffee and don't hit it off, do you continue to have monthly hangouts with that person? If you go on a blind date and don't hit it off, do you simply continue to date them? \n\nNo? Then why would you assume so here? That's like saying it's better not to casually meet up with anyone new ever because otherwise I'd have to see them monthly. \n\nIt's kind of weird that you would think you would \"have to\" just because he's disabled. That assumes that having a disability automatically makes a person some kind of charity case rather than someone you could possibly have a possible friendship with."]}