{"id": 1992, "submission_id": "yrr7av", "title": "AITA for making a teacher change my son's grade?", "selftext": "At my son's school parents can log into the school website and see grades. I saw my son had a zero on an assignment and confronted him. He didn't want to tell me why he had a zero, but I insisted. He admitted the assignment was a family tree he was supposed to present to the class but refused to.\n\nHe told me he asked his teacher if he could do his tree on someone else, like a historical figure. The teacher said no, that most historical figures and celebrities have family trees online he would be able to copy. My son did the tree for our family, but he refused to present it. He emailed the tree to his teacher instead. However, the teacher said the assignment was to make and present a tree, and her grading rubric was based on the presentation, so if he didn't present he would get a zero.\n\nI was pretty upset. You expect your kids to not always be upfront with you, but why on earth didn't this teacher contact me when she realized this assignment was problematic for him? And why didn't she grade his work? Why is the presentation 100% of the grade? I would think a complete tree, if done correctly, is at least worth a C.\n\nI contacted the principal to explain my concerns and ask for a meeting. I had the meeting with the principal, teacher and guidance councilor. The teacher explained her reasoning, and I said that my son's embarrassment over some of his family members shouldn't impact his grade. He shouldn't have to choose between exposing himself to his peers and a poor grade.\n\nThe principal asked to see the tree my son emailed to the teacher as well as the grading rubric. The principal said she didn't like the assignment and told the teacher to reformat it if she wanted to use it in future years. She also said she would grade the tree and have the assignment grade changed. The teacher protested, asking what the issue it with her assignment. The principal said they would talk about it after I left.\n\nAs I was leaving the teacher asked me to contact her directly in the future when I have a concern. I explained that I didn't feel comfortable doing so, because of her actions and failure to communicate with me when the problem first arose. She tried to blame my son, but I pointed out that she is the professional and he is eleven. She said I needed to teach my son accountability and not try to blame everyone else when there's a problem. I was mad, so I left before I could say something mean. I know she thinks I'm an asshole because now her assignment has to change, but I feel she brought this on herself.", "created_utc": 1668112799, "permalink": "/r/AmItheAsshole/comments/yrr7av/aita_for_making_a_teacher_change_my_sons_grade/", "score": 8400, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I went to the principal to complain about a teacher and get my son's grade changed. I could have tried to resolve it with the teacher first, but I chose not to, because I didn't have faith in her ability to be fair.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "FUCK FAMILY TREES. As a former social worker in the foster care system, I am LIVID that these are still a routine assignment. They bring up so much trauma for so many people\n\nAnd the fact that there was no wiggle room for him to present it in a different way when there was clearly an issue? You go mom! I’m on your side! NTA", "NTA. My knee-jerk reaction when it comes to parents pressuring teachers to change grades is that it's an AH move but... this isn't an entitled parent deciding that Little Timmy should have a good grade whether he deserves it or not. This is an issue with a child having a problem with the content, and the teacher not even trying to work something out/bring up concerns to the parents. Totally different.", "NTA\n\nMy son has had this assignment twice now (once in middle school and once in high school) and both times the assignment and rubric showed an understanding there are non-traditional families out there, and students who may not have access to family history. The fact that the teacher has gotten to 2022 without her assignment reflecting this, means she's probably hurt quite a few students along the way.", "NTA. I’m a biology teacher, so students have to study family pedigree charts. I purposely don’t have students create one for their own family because there are a ton of situations that students may not want to talk about in class (there are definitely people in my family I wouldn’t want to include). Should you have talked to the teacher before escalating it to the principal? Probably, it’s super frustrating when parents immediately go over your head when it’s something you easily could have fixed if you knew about it. But this teacher doesn’t seem like she’s entirely reasonable anyway and you probably would have ended up escalating it to the principal anyway.", "NTA. How long has this person been a teacher? The lack of understanding and empathy is crazy. She outright refused to be accommodating. I agree, if she felt so strongly about it she should have reached out to you. But also she shouldn’t have felt so strongly about it anyway because there are so many reasons why that assignment could be difficult for a child and she should have anticipated that.", "NTA - family trees are actually banned from hundreds of school programs now with several schools and teachers coming up with other ways to discuss what heritage paths look like (including your suggestion of a famous person)  \n\n\nAlso, you're going to have a ton of issues with this teacher for the rest of the year bc she obviously had it out for him (which I don't feel is the truth when parents say it 85% of the time) and then to come at you. It's obvious the principal is clear on who is on his staff, but your son is still going to be in that class every day - can he be moved?", "NTA. How could she have not foreseen the trouble it’d cause for students? Especially students with family issues or absent parents? Your son did his assignment anyway and she gave him a zero. You have every right to be pissed in this situation.", "NTA, at all. Former teacher here, you absolutely did the right thing. The fact that the teacher still couldn’t see the problematic nature of her assignment and had to be talked to after the meeting speaks volumes. Good teachers can recognize the need to alter (sometimes even scrap) assignments based on the classroom community. \n\nI hope your son sees how it’s ok to make changes when warranted and I hope the teacher is professional going forward.", "Sounds like your kid did a good job trying to advocate for themselves, offering an alternate assignment. Make sure you also congratulate them on that!", "Well, you surprised me.\n\nWhen I heard that you had made a teacher change your son's grade, I expected this to be a story about how your son got a B+ on a term paper, and you, determined that your kid is going to Harvard, went into the classroom and intimidated the teacher into giving your son an A+.\n\nBut this is not what I expected. I don't like the assignment. A student should not be required to divulge their family tree to the class. What about adopted kids who don't even know their biological parents? What if they're descended from slave-owners, or Nazis or something similarly shameful?\n\nI see nothing wrong with what you did and I see the principal as having proffered a good solution.\n\nThe teacher is entirely in the wrong. If there was a problem, she should have contacted you. Also, she seems to have a hard time dealing with correction, as the principal raised valid concerns about the nature of the assignment.\n\nYou had a good response to her demand that you contact her, not the principal, when there's a problem. She didn't feel comfortable contacting you, so why should you have to contact her?\n\nNTA.\n\nETA The title is wrong. You didn't make the teacher change the grade. The principal volunteered to grade the assignment.", "NTA and way to go for not only standing up for you son but also listening to him . So many parents I know would of flipped out at the sight of the zero and took the teachers word for it but you didn’t you let your kid explain why he didn’t and trusted him!! You have no clue how far that will go in your guys relationship . My mom was like that and it allowed me to be open and honest with her .", "NTA\n\nBut you need to follow up with the principal. Her comments are a clear indicator that there will be retaliation to your son. \n\nI am an educator. I work with teachers. There are some truly wonderful ones. But their are some that shouldn’t be allowed within sight of children.\n\n- this assignment is terrible. No adult should be required to disclose personal familial information for a school assignment. \n\n- she should have a.) asked your son why he was uncomfortable with the assignment b.) pulled herself out of whatever rosy bubble she lives in to understand some people have issues in their family c.) contacted you at the 2nd request not to present the family tree\n\n- she has taken zero accountability for her poor judgment and questionable teaching skills", "NTA. How the teacher could not foresee this being both personal and problematic is wild to me. Example: The kid who doesn’t know who his father is should have to divulge that to the entire class? There are so many scenarios in which the family structure could be a source of pain or embarrassment to a child, especially one in the tween spot of old enough to sort of understand and young enough not to really grasp nuances of certain family issues.", "NTA family trees are actually pretty insensitive. So many kids have non nuclear families that are hard to explain esp at such a young age.  Some may have abusive family or may be adopted and not know a lot of their family or they may be estranged from family.   There's actually a lot reasons a kid may not be comfortable presenting this kind of project and to refuse to have alternatives for those kids is pretty narrow minded", "NTA. If an 11 y/o boy is that embarrassed by his family tree then clearly she should have looked into it. It’s not about accountability, he did literally everything she asked except present his embarrassment to the class. She should have given him at least something for turning it in but definitely not full credit. For everyone saying “Y T A” or “go to the teacher next time” literally the teacher would have given her a hard time and probably would have denied her son a better grade. Teacher sounds like she needs to learn a little sympathy and not be such a hard ass on 11 year olds.", "NTA - If the presentation portion was 100% of the grade, why would it matter if he copied something from online? If it matters whether the tree is his own work, then why didn't he get credit for that part? \n\nYou could have gone to the teacher first, but it sounds like your son was proactive in speaking up for himself and had already suggested all of the alternatives that would have been reasonable within the teacher's parameters and the teacher shot them down. I doubt the teacher would have reacted any differently if you had made those suggestions and you still would have ended up going to the principal.", "NTA- You made a decision to have a group discussion with the administrators and teacher. Probably not a poor decision given that the teacher was already defensive regarding the zero.\nThere was obviously something wrong with the assignment, if the principal felt it needed to be handled differently. \nAs for the people calling you an A H because you made them change his grade… that is not factual. You asked for a review of the assignment and the grade. You stated the reasons behind your child’s unwillingness to participate in the presentation. It is the principle that made the teacher change the grade. You stood up for your kid, good for you. You didn’t teach him entitlement. You taught him conviction and you taught him that you will have his back when he is right.", "NTA, I would absolutely hate to do a family tree for an assignment. That's like a teacher asking me to shame myself in front of the class. I'm glad the principal told her to reformat the assignment.", "NTA! You’re awesome! You advocated not only for your child, but for any other child who may have trauma or privacy concerns regarding the family history. \n\nI was targeted and bullied once in a writing class as an adult because I refused to reveal personal information about my family. NO ONE has the right to force me to talk about that. No one.", "NTA and I agree that the correct response, at the very least, to seeing your son struggle would have been to reach out to you and let you know what was going on. Her lack of empathy and prioritizing being right do not paint her in a good light", "Yeah no you are NTA at all.\n\nFamily tree exercises still exist? I would think teachers would be mature enough to realise not everyone has a perfect family, or a family at all.\n\nYou imo handled it perfectly. The teacher, telling you to not go through the principal, yet being agressive instead of understanding shows she took no accountability for that. Just one of those people.\n\nYeah, you prolly should have contacted the teacher first, but given her attitude she showed later, it wouldn't have made a difference in hindsight.", "NTA. I can’t believe it’s 2022 and teachers are still pulling this shit with family tree projects. There are SO MANY issues with projects like this, and the publicizing makes it ten times worse. You are an excellent parent for standing up for your kid on this one—and if it was so important to the teacher that you contact her directly, she should have done so in the first place once giving your child a zero.", "NTA. These types of assignments really do need to be treated with mindfulness. We're well aware by now how many children come from all types of backgrounds and asking them to present personal information about themselves and their families without offering a reasonable alternative - like doing a historical figure's family tree as your son suggested - is really not okay. Maybe some kids don't want to share that they're adopted, or that their brother is a known criminal, or they're not comfortable with having a blended family, or so many other possibilities.\n\nIf your son wasn't eleven though, I would've suggested he make it all up and use the Targaryen family wreath as inspiration.", "NTA. As a former foster parent this assignment would have put me through the roof. It's not a good assignment. And no one needs to think too long or hard to figure out why.\n\nAnd the teacher set the precedent on the communication. If I were your child's teacher and they were adamant against presenting I would have reached out to the parents to find out why.\n\nHonestly, this teacher sounds incredibly obtuse. The fact that they also questioned their own Principal as to why the assignment is inappropriate shows that pretty clearly.", "NTA, you did good. It's a problematic assignment and the teacher should have known this. After your son didn't want to do it on his own family, she didn't realise that there was a problem. Not even after he refused to present it but still emailed it, she did not understand the problem. She went as far as punishing him with a zero.\nA bad teacher. You definately did good to include the principal.", "NTA, at all. Whether or not the teacher was within her rights to give a poor grade is kind of beside the point. (Even though I think she clearly shouldn’t have given a 0.) For something like this, where the student has obviously tried to do the assignment but is uncomfortable for one reason or another, she should have reached out to you before giving a 0. So, you had a reason to be upset… and I’m not sure why she thinks you should have reached out directly to her when she didn’t give you the same courtesy.", "NTA. Good! For! You!\n\nI was prepared to say Y because I assumed this was a classic case of helicoptering/karening (helikarening?), but you are right on target and a wonderful advocate for your child. I’m surprised and glad the principal saw reason and can make this a teachable moment for the teacher. Sounds like she needs some additional training. \n\nAlso, as much as we’re addicted to drama, no we really don’t need to know what was on that tree. So settle down y’all.", "NTA. Oooooh man ngl as someone who's mom and husband are both teachers I was entirely prepared to give the opposite judgement based on the title. Family tree assignments are so problematic though. They can even be really harmful to kids if there's some sort of family trauma or cases of abuse or for any number of other reasons. And then forcing the kids to present those details to the whole class? Yeah no. Even relatively common things like divorce can open a kid up to bullying. Teachers should know better. I think you handled the situation very well OP.\n\nETA: going over someone's head to their boss isn't the nicest way to deal with an issue, but in this case I think it was warranted. She brushed off your son's concerns and refused the very reasonable accommodation he asked for. That's worth taking to the principal in this case.", "NTA\n\nI am a teacher. You did the right thing. The teacher isn’t taking into consideration how this assignment could impact someone who is adopted, who lost a parent and can’t ask them, or for any other reason someone might not be able to access this information. The idea to do a historical figure was a good one and, honestly, should have been offered to students from the start. Hopefully this teacher will make that modification for future classes.", "NTA I thought you were gotta suck but it’s not fair to force any child to talk about their family. There are so many reasons this could cause upset and distress beyond just embarrassment. What if someone had a recent death or had to speak about an abuser in their family. A family tree should only ever be an optional assignment for a child. I can’t imagine not given a child that young an alternative assignment if they asked for a fair accommodation. I do this for university students when appropriate so why not an 11 year old", "**NTA!** I was ready to say you were the ass because I detest when parents get involved unnecessarily because they don't like their child's grade. However, it sounds like your child did everything he could to mitigate his struggle with the assignment and to meet the requirements still. This particular teacher seems too defensive and not in tune with her students.\n\n\"...not try to blame everyone else when there's a problem.\" My response would have been, \"We're not blaming everyone else. We're laying the blame directly on you You caused this with your inflexibility and poor communication. Do better!\"\n\nIf the teacher had pulled that after meeting crap with me, we would have been marching right back into the principal's office to discuss appropriate communication.\n\nEdit to add judgment", "NTA\n\nYour son did everything right.  He talked to the teacher about alternatives and gave her what he could.  She decided to be a shit teacher and not look at the issues he had.  He wasn't refusing to present.  He refused to present his personal information.", "NTA.\n\nThere are so many legitimate reasons a kid might not want to share his family tree that I'm shocked the teacher is still that clueless.\n\nAnd if the teacher gives the kid a zero after he made his concerns clear, asked for an alternative option, and sent her his work--without contacting mom--then I see no reason for mom to try to contact her, as this teacher clearly isn't interested in open communication for the benefit of the child.", "NTA\n\nTeachers are not infallible, unquestionable pillars of knowledge. \n\nSounds like you had a reasonable concern/request and went about it the correct. Way.", "NTA based off the title I was prepared to go the opposite but you did everything right here. This is a \"privileged\" assignment to give out to the class, whether through adoption, family drama or whatever. This is an assignment that could make many feel uncomfortable which is why the principle's scrapping it. \n\nFor those saying that you should've gone to the teacher 1st, I typically would agree but with how reluctant your son was. Reaching out multiple times to discuss the assignment, and she did not get in touch with you. & how resistant she was in the meeting you clearly went with the best course of action.", "Ok…so, I understand the look up and copy aspect.  However, he made the tree she wanted, but she also wanted a presentation. Well, **she** should have suggested he present a historical figure’s tree, and just give her the actual one.\n\nBut, seriously, suppose he didn’t *have* any of the information?  Principal was right.", "NTA. The assignment is inappropriate and frankly ignorant. What does she tell students who were adopted without knowledge of their family history to do? She should have given alternatives for everyone to be able to participate safely. If she couldn't consider that not everyone would be comfortable with this assignment even after seeing his work, going to her supervisor makes total sense. I agree with everyone saying your son will be massively impacted by seeing you stand up for him. My parents stood up for me against a shitty teacher and it's not something I will forget. Great job parent ❤️", "NTA\n\n> She said I needed to teach my son accountability\n\nAccountability?\n\nHe accepted the zero. \n\n> and not try to blame everyone else when there's a problem. \n\nThis was an inappropriate assignment. No student should be forced to reveal personal information for a grade. And your son was smart by offering a solution that he felt comfortable presenting (doing a fictional family tree could be fun too) it was the teacher that rejected it.\n\nMaybe the teacher needs to accept her own accountability for a bad assignment. Should you have gone to the teacher first? Maybe; but I don’t think it makes you an asshole for going to the principal.", "I fucking hate the family tree assignment. What about the adopted kids? Are they going to get in trouble for not presenting “blood” relatives or those who have caregivers step in to fill a parental role? This assignment never goes down well for multiple kids. Thank you for speaking up because it was honestly the worst having to do this as a kid. NTA", "I’ve been under the impression that a lot of districts had phased out assignments like this, similar to how they don’t have students make Mother’s and Father’s Day cards as much anymore. I know my child would have had a difficult time explaining the situation to the teacher, who also doesn’t sound like she would have accepted anything less than every single identifiable detail about why he was uncomfortable, and may have felt weird bringing it to my attention as well. \n\nHaving said that, I fell that you’re NTA in this situation. As much as it probably would have been preferable to speak directly to the teacher and not go to the principal, it sounds like it wouldn’t have gone well. The teacher showed no compassion after the fact and doubling down the way she did was inappropriate.", "NTA, family trees are problematic assignments and shouldn't be part of any curriculum.  Families have many different ways of forming, so the \"traditional\" family tree isn't feasible for many people.", "NTA. Family history should be private and not be forced out in front of a classroom. Also… i feel like this was the right thing to do especially if the principal thought this project needed to be reformatted", "NTA. Good on you for backing your son. As for the teacher asking you to contact her directly in the future…hell nah! Your son did the tree and emailed it to her. She could have discussed the issue with him and then got him to present it to her one-to-one so he wouldn’t have to be embarrassed or called you to talk about it. Principal was definitely the right person to speak to and now hopefully other children won’t have to suffer with the same issue.", "NTA  Semi-retired teacher here.  \n\n\nDuring my first student teacher assignment in '83, my mentor told me that the school used to give kids a family tree assignment but stopped after a parent became upset - the school was a Catholic school and the parent was divorced.  \n\n\nFor that reason, I have never issued 'Draw up your family tree' as an assignment.", "NTA. It feels icky that my younger kids could \"out\" their eldest sibling as being their half sibling, and unfair. \n\nLike that's her issue to share with her peers. Not her siblings.\n\nOr kids not knowing who dad is.\n\nAlso its not like the teacher showed anyone how to incorporate foster families, non nuclear house holds etc.q", "NTA family trees are bullshit assignments. Not everyone has/wants contact with their extended family. I don't know most of mine and I don't care to. Had to do a family tree assignment when I was 13. My grandfather on my mother's side was a foreign exchange student from Egypt back in the 60s and has no idea he even has a child here in the dates. We only have a first name for him. Teacher knocked points off because \"somebody HAD to have more information on him\" I just didn't try", "NTA I have problematic family history myself. In this assignment alone, the teacher lacked foresight. \n\nExamples:\nAssault resulting in a child.\nSlavery in the family history, where there is no information. \nAdopted children.\nBroken family where no information is given at all about one parent. \nFamilies where a sperm donor was used.\nDeath, often tragic in the family.\nWhere a direct ancestor was a criminal or a murderer.\nWhere family members (cousins) marry and produce offspring.\nLastly, where a family member is famous through no fault of the child for any reason.\nAlso, children of severely broken homes or foster care situations. \n\nI am certain there are more reasons for a child not wanting to present a family tree. The teacher was less than stellar in this case.", "NTA. Your kid did the tree as required and offered to do a tree and presentation on someone well known in order to not present his own information. The teacher seems to have a problem with understanding that not everyone is proud of their ancestors and that there can be negative consequences of revealing who your ancestors are. What was her plan if she has a foster child with no access to their family history?", "My foster sibling had a similar assignment and my mother went nuclear. The teacher also couldn't see anything wrong with the assignment because nobody else had issues with it. I don't know the story of how it went down but I know sibling ended up getting 100% even though she skipped parts of the assignment.", "NTA. When I was 15, my Spanish teacher had us make these memorial things for Dios de los Muertos about someone who passed. He also offered an alternative assignment that was not death-related, no questions asked. This was in the six weeks between when it was clear my grandfather was dying and when he died, I think before my mom told my teachers. Almost 15 years later and it still means the world to me and is one of the reasons I consider him a great teacher.", "NTA and since they will reformat this assignment  you talking probably will help future students avoiding problems with it.", "NTA, and honestly, I’m so over these family tree assignments.  Not everyone can do them and teachers need to be aware of that and have something in place for children who may be adopted, who don’t know their biological family tree, etc.  I had to do one in high school and actually *couldn’t* because it required taking photos of dead ancestors to compare your features to.  The problem was that my maternal line is wholly indigenous.  We only have photos of my kokum (my mum’s mum) and memories of kokum’s *okawimaw*, and the only thing we know about my mum’s biological father is that he was indigenous too and abandoned them.  Almost everyone else in my maternal family was dead due to complications arising from being in residential schools and the resulting trauma (drugs, alcohol, and one aunt was murdered and is among the MMIW).  At the time we had no photos handy.\n\nI explained this to the teacher and asked if perhaps I could trace my dad’s family back an extra few generations to make up for it, as my great-grandmother on my dad’s side was *meticulous* with records and kept very detailed ones of everyone up until she died around the same time this assignment was released, so I had photos going back to the 1800s, all labelled.  \n\nThe teacher said no,  threatened to fail me, and wouldn’t offer any compromise.  I took it up the chain because it was unfair, not everyone has perfect ancestors with pristine photos and not everyone is lucky enough to even know who their biological parents and grandparents may be, and my parents got involved and the principal came down on the teacher, and though she told me I didn’t have to do the assignment, she took it out on my sibling when they landed in her class.  Subsequent family members who came through her class also got treated poorly and ended up switching classes.\n\nSo if you have any other kids just be wary of that, OP.  If this teacher is going to do assignments like this, the principal is right: she needs to change it.", "NTA", "NTA. It doesn't take a college degree to figure out why a child might be embarrassed by their family tree, especially once its been emailed to her. The teacher had drawn an arbitrary line in the sand that was unreasonable. My son has his own wee things going on & part of his English grade is a presentation - the teacher offered for it just to be done to her. I'm not saying that would've worked here but a little flexibility when you can see a child is trying goes a long way. He did the work. Id have went over her head as well.", "NTA he did all the work, you are right in thinking the presentation shouldn't be 100% of the grade. The teacher lacked common sense and compassion in thus case.", "NTA\n\nI'll admit I came into this thinking you would be but this teacher is really outrageous and then has the nerve to tell you not to go to her superior. She definitely feels that you went over her head, and rightfully so. I don't feel like she was listening to your concerns and her grading for an 11 year old is ridiculous. I think teachers need to realize that there are students who would not be comfortable presenting, let alone presenting something that they didn't feel comfortable doing at all. The fact that he handed in anything shows he cares, and that should have been enough for the teacher, especially after he had alredy expressed this to her!", "NTA. Your son tried to do the right thing - he asked to do the family tree about someone else, and when this was denied, he did the work but refused to present it. It was clear that he wasn't comfortable discussing some of his relatives in class.\n\nIt's fine for your son to have this concern, and it seems as though he made a reasonable attempt to discuss it with the teacher.\n\nThe teacher just blew him off. She is the problem.", "NTA.\n\nI am really into genealogy. I can trace my ancestors back six generations in all directions. Thanks to DNA I know that my grandmother’s grandmother was not the biological daughter of the man named on her birth certificate.\n\nMany people are not in my situation. There are children who have zero contact with their parents for very good reasons. There are many children who do not know who their fathers were. There are some who do not know who their mothers were. There are some who know perfectly well who their biological parents and grandparents are, and have very good reasons not to want to share that information with anyone.\n\nThe teacher’s assignment was utterly unprofessional, and her attitude to being called out on it was worse. You were right, the principal is right and most of all your son is right. I hope that this teacher finds another line of work to which she is better suited.", "NTA.   Learning to stand up and deliver presentations is an important life skill.  So I can see where the teacher is coming from.  That said I am a teacher and when I have a student that refuses to present a project I give them the option to record their presentation at home and email me their work.  I then watch it (no one else sees it) and grade it.   I think simply giving a zero because the student refuses to deliver the presentation is not fair.   Unlike many, I don't care that you complained to the principal first.  Pretty common.  I am amazed that the teacher would argue the toss with their boss,  the principal,  in front of a parent.", "Your son did take accountability and was responsible by emailing the teacher. He wasn't going to argue with her about him not presenting. If he did, she probably would have said he had attitude problems. You both handled it well. He did as much as he was able to and then you stepped in to advocate for him. NTA", "NTA. The family tree assignment can be a lot of fun for some kids and an absolute nightmare for others. It should never be a mandatory assignment but one of a few options students could choose from. \nYou could have approached the teacher before you went to the principal, but based on your description of the events, I have doubts that you'd have gotten very far.", "NTA and well done on supporting your son. Sometimes its said that kids are too soft these days but if something is unjust your job as a parent is to help him and teach him how to confront those situations", "NTA I've never understood the point of doing a family tree at school. Even at its best it is problematic for at least a few kids. Adoption, estrangements, unusual family situations end up being things that label a kid as different and single them out for bullying.", "NTA. Your son did do a family tree - at the very least, he should have been given partial credit. He did not want to present his family tree to the class because something about it embarrassed him (notorious criminal, embarrassing name, etc), even offering a compromise by doing some other person's family tree & presenting that. His teacher bulldozed over his boundaries and gave him a zero. When the principal saw your son's family tree, he obviously saw the reason why your son did not want to present his own family tree and agreed with his decision. Then he had to explain what the problem was to the teacher in private because she was either clueless or didn't give AF. The fact that she dug her heels in indicates the latter.", "NTA. I’m a tutor, and studying education to be a qualified teacher. Every. Single. Unit I have completed has had a significant emphasis on inclusion of all students from all backgrounds. His teacher has followed none of that, and didn’t problem solve when an issue with her lesson plan came up. They sound like a terrible teacher", "9 times out of 10 I'm usually on the teachers side. This one I back you 100% NTA. Teachers have to be considerate of circumstances and if a child approaches the teacher with a legitimate issue then she should try to come up with a compromise. This teacher just sounds heartless.", "NTA\n\nThis assignment could easily be embarrassing and difficult for other students to do (myself included at that age.) The fact that the principal also told the teacher that they saw an issue with the assignment just cements it. It's not difficult having empathy for people. I was working towards a teaching degree and I have done some substitute teaching for my county a few years ago. What I saw during that time made me change my mind about it. Not because of the students, but because of the way the teachers were treating students especially, special needs students. It boiled my blood hearing a teacher call a kindergardener with ADHD a trouble maker. Or seeing the video of a Principal and teacher drag a special needs student down the hall by their feet.", "Teacher: \"She said I needed to teach my son accountability and not try to blame everyone else when there's a problem.\"\n\nReply: You should heed your own advice. You are the teacher. This is your job. You are showing lack of accountability and trying to blame my son for your poor assignment and then me for not going to you. Shame on you. I will continue to go above your head since any sense spoken to you falls upon deaf ears.\"", "This teacher sucks. NTA I would have done the exact same thing in your position. Though I might have emailed the teacher first, I don’t think you had to. The way you did it helps future kids, too!", "NTA, the way the teacher acted after being confronted says enough really. She's the asshole especially for trying to coerce a child into relinquishing his right to privacy.", "NTA. I get where the teacher is coming from in the sense that public speaking is something kids have to do. But in this case, once she was made aware of the student's issues, she should have tailored the assignment, either by giving the students a choice of assignments to do or by giving him permission to be not entirely honest with his family tree. You did the right thing in going to bat for your child.", "NTA. Why do teachers still give these kind of assignments? When I was a kid we had to do something for Father’s Day. I begged the teacher to excuse me and she didn’t. I cried while doing my assignment. FYI I’m adopted and my mom was a single mom. When a classmate asked me why I was crying I said: because my father is He-Man and he’s so busy saving the world he’s forgotten about me lol", "NTA. If this assignment ever occurs for my child they can not include my birth unit as she's an unsafe person. I dare a teacher to do a damn thing about it.", "NTA. This is a violation of your family’s privacy. What if the teacher had assigned kids to write up a detailed history of family heath conditions? Teachers can ask for anything they want because they have the power to assign a grade to it. \n\nMy oldest kid’s teacher had a great twist on this assignment: make up a family tree with celebrities. That was way more fun that actual relatives.", "NTA\n\nI love making family trees, however I also had a relative who, if I had to share with the class, is well known enough that I would hear about it to no end, and I mean in a bad way. Having this as a project in school is messed up, and while I tend to recomend going to the teacher first, due to her antagonizing of an 11 year old an not communicating with you, I can see why you made the choice to go to the principle, and regardless of the validity, I would be hard pressed to call you an asshole for it", "Holy crap I so came here to say you were, but you are so so NTA in this situation. Well done for advocating for your son. That teacher needs to get in the bin.", "Teachers need to be better at assigning work I remember when I was in high school my long term substitute teacher tried to assigned us an essay on what life was like for families during the Great Depression in America I raised my hand and was like I’m second generation immigrant and then like 10 other people raised their hands the whole assignment got scrapped for a different one.", "So, so, SO NTA\n\nThere could be lots of reasons why they didn't feel comfortable talking about their family tree in front of their class. The son's reaction says to me there is an aspect of this assignment that is painful to them or that they are afraid to be made to feel bad about their family. OP hasn't said what about the assignment was botheringtheir son, and honestly it's none of our business. \nYou would think their repeated resistance on such a specific type of assignment would raise some sort of red flag and encourage the teacher to think or at contact the parent for more context. Sure, maybe OP could have gone to the teacher first, but based on the conversation described, they were unlikely to have understood why this assignment might have been insensitive to some children. \n\nNTA, teacher is kind of TA, hopefully the principal can explain it better to them and they'll grow as an educator.", "Nta. Wild that she was telling you to teach your son accountability when she seems to not be taking any herself. \n\nEmpathy and understanding are the cornerstones of education… at least they should be. If the teacher can’t conceptualize why a child may not want to present a family tree for personal reasons, that’s on the teacher.", "NTA. Family trees in schools are so problematic. Not everyone knows their families, or can say they are safe, good people. The principal has their head on straight.", "NTA- presentation should only be part of the grade not 100% of it", "NTA, and I teach. \n\nI have in the past offered to let shy or anxious kids present to just me after class. Or she could have changed her rubric. From your telling, it sounds like your son was pretty professional about it for an eleven year old. He asked for a compromise, and then did part of the project.\n\nI never give a zero if a student turned something in (unless they cheated but that’s not the case here) bc I want to differentiate between the kid who at least put pen to paper and one who did nothing. If you get a zero for trying, why try? Your son completed the project and deserved some credit.\n\nBy her logic, a student who only talked about his or her family tree but had no tree to present would have no points deducted bc the rubric was just the presentation.", "NTA. In this day and age this is an assignment that needs to be modified. She can still let those who chose do a family tree, but it is insensitive to students in foster care, in blended families, adopted, who are from single parent families, etc.", "NTA, even though it’s been while since I was 11 I still remember hearing assholes bullying for different family members.", "NTA. No one, especially a child should have to be forced to share info about their personal lives with anyone. The child was uncomfortable with the presentation...the teacher knew this...she should have contacted the parents knowing it was a personal matter. Also he did do the assignment...just not present, so the grade should not have been zero.\nAs for everyone saying the parent should have gone directly to the teacher...the teacher doesn't seem to believe she was wrong about her assignment so either way the matter would have most likely ended up by the principal.", "Teachers often complain that parents are not involved in their kids school careers, but when you are these same teachers see you as a “problem parent”. I be 3 kids, 2 of which had very little problem with school and I never had a situation come up where I had to go to bat for them. The other one though was a square peg in a round hole and i had many meetings with teachers and principals. Typically I was just trying to find out what really happened. I was regarded as the problem, but usually i was able to see where they were trying to cover for being inconsistent.", "NTA. It's been the best practice standard for years now not to do school projects based on family trees. It isn't an inclusive teaching practice for students who are adopted or in foster placement.", "NTA\n\nNo. That assignment is fine on the surface but to not have an exception clause is really awful. Kids should opt be required to expose their family tree if they don’t want to. What if a student is in care due to the parents being in jail or rehab or dead? What if a student has two moms or two dads or a trans parent and doesn’t want to be targeted?", "NTA \n\nThe kid explained his issue to the teacher. Did the physical work and turned it in, that should merit some grade above an F, even if it is a D... you are correct that she is the professional and could have sent a note to you or something when he said why he had such an issue with the project being presented in front of everyone.", "NTA -- You are the type of parent every child needs. So proud of you.", "Nta these assignments should not take place in school its a whole load of trauma for kids who are adopted, in the care system, have absent family members, have family in prison and so many other reasons. The idea of the lesson is learning a family tree which you can do with looking at a famous family.", "NTA. The teacher's standards are way too high with failibg the assignmrnt simply because your son doesn't want to present. I would give at least a C or even B- for completing and emailing it. I don't think it's reasonable to give a zero for not presenting.", "NTA thanks for sticking up for your kid.", "NTA, at all that teacher's lack of foresight is bad, arguably understandable teachers do make mistakes, but once your son explained his issue to her she didn't try to work with him at all.  Then when she got called out on it she tripled down.", "NTA. The teacher made up an assignment that is indeed violating people's privacy or forcing them to lie about their relatives. The fact that the principal recognizes it is a point in your favor.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nAt my son's school parents can log into the school website and see grades. I saw my son had a zero on an assignment and confronted him. He didn't want to tell me why he had a zero, but I insisted. He admitted the assignment was a family tree he was supposed to present to the class but refused to.\n\nHe told me he asked his teacher if he could do his tree on someone else, like a historical figure. The teacher said no, that most historical figures and celebrities have family trees online he would be able to copy. My son did the tree for our family, but he refused to present it. He emailed the tree to his teacher instead. However, the teacher said the assignment was to make and present a tree, and her grading rubric was based on the presentation, so if he didn't present he would get a zero.\n\nI was pretty upset. You expect your kids to not always be upfront with you, but why on earth didn't this teacher contact me when she realized this assignment was problematic for him? And why didn't she grade his work? Why is the presentation 100% of the grade? I would think a complete tree, if done correctly, is at least worth a C.\n\nI contacted the principal to explain my concerns and ask for a meeting. I had the meeting with the principal, teacher and guidance councilor. The teacher explained her reasoning, and I said that my son's embarrassment over some of his family members shouldn't impact his grade. He shouldn't have to choose between exposing himself to his peers and a poor grade.\n\nThe principal asked to see the tree my son emailed to the teacher as well as the grading rubric. The principal said she didn't like the assignment and told the teacher to reformat it if she wanted to use it in future years. She also said she would grade the tree and have the assignment grade changed. The teacher protested, asking what the issue it with her assignment. The principal said they would talk about it after I left.\n\nAs I was leaving the teacher asked me to contact her directly in the future when I have a concern. I explained that I didn't feel comfortable doing so, because of her actions and failure to communicate with me when the problem first arose. She tried to blame my son, but I pointed out that she is the professional and he is eleven. She said I needed to teach my son accountability and not try to blame everyone else when there's a problem. I was mad, so I left before I could say something mean. I know she thinks I'm an asshole because now her assignment has to change, but I feel she brought this on herself.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA", "NTA\n\nIf the teacher is going to do an assignment regarding families, she needs to be contentious of the fact that that may be an uncomfortable topic for some of her students and be ready to accomodate.\n\nHowever, you need to have a serious think about why your son was uncomfortable coming to you for assistance, and disclosing to you this issue with the assignment and his teacher.", "NTA - If I had to make a family tree it would be a TWIG. I know nothing about the dude who knocked my mom up and wanted her to abort me. And my moms side of the family are a bunch of racist a-holes. So we got a tree of my mom, brother and sister. I'm sorry your little dude had to deal with that.", "NTA - assignments like this are problematic for so many reasons. I grew up estranged for my paternal family and my mom never met her father so we had no information on his side of the family for most of my life. I would have felt so much anxiety trying to explain to a group of 11 year olds why I had 6 half siblings and no grandfather.", "I had this assignment when i was 14, the requirements were it had to go back 4 generations on both maternal and paternal sides -- i have zero knowledge of the paternal side so i just made it all up! Fake names, fake dates, everything. i'd explained to the teacher and she didn't want to hear it about how the project didn't work for me so i decided to \"make it work\" like she said!", "NTA - Your son is not the one who needs a lesson in accountability. Watch her, it's early in the year and she sounds like the kind of petty b--- who'd take it out on the kid. Edit- also, your kid tried to problem solve on his own with the historical person option. That's a great kid. You should be proud.", " \nNTA. A lot of kids have issues presenting in front of large numbers, especially when most kids can be very judgemental (this is speaking from experience). And that’s not including the fact that with this particular assignment, a lot of kids have family issues/problems with certain family members. No kid should be forced to do public speaking if they’re uncomfortable.\n\nThe fact that your son was responsible enough to email his assignment to his teacher is enough for it to be graded. Her assignment needed to be changed. You did the right thing. NTA", "NTA, some people should not be teaching children and she is one of them", "NTA. Email the principal and say \"thank you for the meeting. Afterwards the teacher said XYZ to me. I didn't respond but I am concerned that she continues to paint this situation as my son being in the wrong, rather than her assignment rules and marking rubic being inappropriate. I thought you might like to be aware of that in case she needs any further feedback from yourself on the appropriateness of the assignments she sets and the way she communicates with students and parents.\"", "NTA\n\nAside from family issues, this is not a friendly assignment for children with speech and language difficulties. Thus isn't a very accessible assignment.", "NTA", "NTA.\nThose assignments are outdated and hurtful. And only teach kids they don’t have right to privacy. It lead to adults snooping in others business and kids to be bullied.\n\nYou did the right things, I would advise to speak with your kid and keep an eye on the teacher, idk but she could be just mean to him in class out of spite.", "NTA. Basing an assignment fully on presentation is bs. What about students who do present but aren’t the best public speakers? Ik everyone on here is full pro teacher, but there are some teachers, especially older ones, who are just AHs and on a power trip. Your son did go to the teacher first and she wouldn’t listen. There was no reason for you to go to the teacher too if she couldn’t listen to her own student. Good job sticking up for your son.", "NTA. Teacher sounds like she’s on a power trip. Needs to get a grip.", "NTA", "Thought this was gonna be an easy YTA from the title, but nah. You had all the right to bypass her, after all, she bypassed you when she ignored obvious issues your son had with the assignment.\nNTA.", "NTA, good job momma bear!!!", "I was about to say Y T A  from the title because usually the parents are unreasonable but tbh he should have just gotten a 0 for the presentation part. She should have graded the tree, as you mentioned. NTA", "I feel like it's an NTA\n\nThe kid might be suffering from social anxiety and might not feel comfortable enough to speak out in front of the whole class. This is something I suffer from too and believe me when I say it, it isn't good at all. \n\nThe person suffering from it may seem normal from the outside but on the inside he/she may want to hide somewhere and feel like crying (in most cases my have a mental breakdown as well) \n\nYou might need to look up for a therapist and work with him to break that shell. But remember if he's indeed suffering from social anxiety, he himself needs to accept that he needs to overcome it because it can affect his day-to-day life.", "You’re right, the assignment needed adjustments. Also, as a teacher, I want you to always contact me before you contact my boss. It’s just professional courtesy.", "As a teacher, I say NTA. While I agree that you should have at least attempted to speak to the teacher before going to the principal, it does not sound like that would’ve done much good in this case, so y’all probably would’ve ended up in the meeting with the principal anyway.", "You are going to let your son go back into a room with the AH? Like where is her accountability, she tried to correct a parent after her superior told her to change her ways like tf.", "NTA. I’m curios to know what exactly the birth and death dates have that would expose your son. But it wouldn’t change my decision and isn’t actually my business so yeah.", "Info: Why did your kid feel uncomfortable with presenting the assignment?", "NTA", "NTA", "NTA", "NTA - Keep up the great parenting", "Punishing a student for not disclosing personal, biological information to everyone seems not just cruel, but potentially illegal.  She should have made other arrangements when the project made your child uncomfortable.\n\nHer response to the situation rubbed me the wrong way, I would honestly look into legal action.  Idk if there’s anything there, but she shouldn’t be a teacher, maybe she should go get a job at 23andme if this is her hill to die on.\n\nEdit: NTA, obviously", "So many people don’t have access to that information…", "As a teacher I have to say YTA. As soon as I saw you went straight to the principal. That’s an AH mover for sure. Always contact the teacher first. You just wanted to get her in trouble. No other reason to do this.", "I really don’t get why you didn’t talk to the teacher first. However I feel like there might be a cultural or generational divide between me and many other commentators. To me the explanation that she should’ve contacted you made zero sense. That’s just not how schools work in my experience. Teachers only contact parents in severe cases, one act of pre-pubescent rebellious act of bot handing in assignment would be dealt with exactly like that teacher did: 0 points.\n\nBtw I get that your son had reasons against the assignment but without him communicating that he wasn’t comfortable the teacher had no chance to know that it wasn’t just a refusal because of 11 years old. \n\nSo I go with INFO: Is the expectation that the teacher contacts you directly before grading reasonable for the school? Is this how things are supposed to be handled (not in an ideal world but in the reality you live in)?", "I would've just made up a fake family tree... doubt the teacher would've checked its accuracy. NTA", "info: how would presenting the family tree be exposing himself?", "I don’t know who TA is because I want to ask you, OP, do you know why you son did not want to present his tree at all? Did anyone ask him why?", "NTA. Presentation is always only a portion of the grade- not the whole grade. If it were the whole grade then he would have been made to just give a speech rather than make the project itself. Also, most teachers are fine with making exceptions for students who don’t want to present in front of their peers. Not every student is comfortable with it and it causes a lot of anxiety. The fact that she was blaming him for being uncomfortable to the point of failing him instead of reaching a compromise is a bit ridiculous. The fact she didn’t reach out to you when there were signs that the reason he didn’t want to present were *because* of who he was doing the project on is shocking to say the least. I don’t understand what his issues with with your family are and that’s your business, but as an adult and a teacher that would have concerned me enough to reach out. I understand a teacher’s autonomy in their own classroom but it’s clear this one was trying to sneak something under the radar and you caught her. I thought that teachers had to get their assignments approved by administration before using them in class- it’s possible that she didn’t for this one and used it anyway. Her asking you to contact her directly after this instead of the principal would also make me uncomfortable as it feels like she’s trying to manipulate the situation. This sounds eerily similar to another story where a teacher tried to force a student, who was adopted, to do a family tree on their biological family, who they had never met and who were a different race than their adoptive family.", "I totally understand both sides of this. As a student teacher I had an assignment where the world had been taken over by zombies and the kids couldn’t use technology to write their essay (they were super dependent on their chromebooks). I was brand new to teaching and a parent went to the principal and said the essay went against her religion. I was so embarrassed that I hadn’t thought that through and felt betrayed by this parent. If she had just asked me I could have made the assignment about being on a desert island or something and we could have partnered and come up with a solution together. So, I think you are NTA for sticking up for your kid but I think you could have tried harder to explain why your kiddo should have received accommodation. I think in your situation, and my example, an opportunity for opening an educators minds to different family experiences was tarnished by bitterness and frustration that doesn’t help for the future.", "I’m not making a ruling or anything but I just want to know why a family tree is problematic? Not judging or anything just want to know more info I guess?", "NTA\n\nBut you should have contacted the teacher first. That's the proper chain of command for non-dangerous situations. \n\nYour son has a lot of school year left with this teacher, teachers make notes to students' permanent records, and teachers are super gossipy in the break room. You need to role model fixing this relationship for your son.\n\nAfter the grade gets changed, send a gushing note thanking everyone for being understanding. \n\nAnd you might need to send a Starbucks gift card next month as a holiday gift.\n\nTake the high road.", "Gentle ESH - parent and teacher, that is. OP wonders why the teacher didn't contact her - and she has a point, but OP should've *still* reached out to the teacher before contacting the principal. She says her reasoning is that she didn't like the way the teacher handled it, but she is no better. I'm calling bs on that. As far as the teacher goes, she made an assumption that the boy was just trying to be lazy or whatever (and teaching 11 year olds, she's probably had that happen), but she def dropped the ball with this particular student. Besides, her rubric is terrible if it only grades on presentation. I am a teacher, and I've raised two boys who hated those public presentations, so I've seen it from both sides.", "[deleted]", "Nta shes like a home ec teacher who hates kids", "This exact situation has been posted before. So YTA for stealing this post or reposting it.", "ESH -- OP, you should've talked to the teacher first, and if you didn't get resolution, then escalated it to the principal. \n\nBut the teacher also sucks for doing a family tree assignment. There are myriad ways in which a family tree assignment can be problematic. There may be family secrets and toxic dynamics in a child's FOO that would put the child at risk if they asked the necessary questions to complete this assignment. Nontraditional families (blended families, adopted children, children conceived via donor eggs/sperm, etc.) will stand out as \"different\" in a community of primarily nuclear families. Descendants of rape and/or incest may not want to revisit this topic. Depending on how far back the assignment requires you to trace your ancestry, it can be discriminative toward descendants of enslaved people, Indigenous people, or refugees.\n\nI actually had one of these assignments in high school and got a bad grade on it because the teacher required us to trace our ancestry back a certain number of generations on both sides and my mom's family simply didn't have that information (even though my dad's side was traced all the way back to the freakin Revolutionary War). I was one of a very few non-LDS kids in a predominantly LDS area, and the Mormons are **very** into genealogy, so basically all the Mormon kids got an A, and I got a C because my mom's family was non-LDS.", "Info: I need to hear more about your family tree.", "YTA - you claim you were angry because the teacher didn’t contact you directly, and your solution was to refuse to contact the teacher directly?\n\nJustifiably or not, your obvious goal was to get the teacher disciplined, and it sounds like you succeeded.  Stop patting yourself on the back for it.  You aren’t 11 either and should be able to handle some “discomfort” instead of immediately escalating\n\nI do agree that it was problematic that the teacher didn’t allow alternatives.  That would have been a good thing to bring up…to the teacher….", "Your kid had an assignment and tried to change the assignment and didn't do the full assignment. Why is this?", "Not for asking questions. YTA  for going to the principal before talking to the teacher. You can always escalate if the teacher doesn't consider the circumstances.", "ESH. You for going to the principal first. While you got the desired outcome, you're now in an adversarial position with the teacher and that may affect your son's performance for the remainder of the year. In most cases, teachers will be accommodating without you needing to get the principal involved.\n\nHaving said that, damn this teacher is a piece of work. This \"my way or the highway\" bs is a sign of someone who shouldn't be in charge of anything, let alone a classroom. There's at least a handful of kids in every public school who would fail this assignment based on her rubric because they don't have enough info about their families to complete it.\n\nAnd blaming your son for her shortcomings? If a teacher did that with either of my kids there would be a lot more than words exchanged. If it's possible, get your son out of her class.", "INFO: Why is your son embarrassed about his family members? Not asking you to dox your family but you need to be a little more specific here", "The child did the right thing. \n\nThis assignment is probably a privacy violation.  The names of relatives are sometimes required for password recovery and proof of identity in online systems. You also need your mothers maiden name to apply for government ID, like a passport.  Or to request a copy of a birth certificate, \n\n> [The Family Educational Rights and Privacy Act (FERPA) (20 U.S.C. § 1232g; 34 CFR Part 99) is a Federal law that protects the privacy of student education records. The law applies to all schools that receive funds under an applicable program of the U.S. Department of Education.](https://www2.ed.gov/policy/gen/guid/fpco/ferpa/index.html)\n\nRequiring the student to publicly disclose relatives is probably a crime, and could be exploited for identity theft.\n\nI think I can guess what the principal told the teacher.", "As a parent of 2 teenagers yes, YTA. All you’re doing is teaching your kids that if they don’t wanna do something they don’t have to and they can still get away with it so good job mom", "YTA! \n\nParents like you are the reason teachers are quitting in droves! I say this as an elementary school teacher actively trying to leave the profession because of parents like you. \n\nIt’s fine that you had a problem with the assignment, that’s not the issue. Assignments like that aren’t great, especially for kids who are adopted are in foster care. Whenever I give my kids, a project they need to present the presentation is worth no more than 5% of the grade. \nThe problem is going over the teacher’s head and straight to the administration is HORRIBLE! Teachers have more than enough on their plate without having an extra meeting because of some crazy parent that can’t be bothered to send an email about their concerns.", "YTA. Your kid needs to learn that good grades won’t be just handed to him for half-assed assignments. Thanks to your entitlement, this teacher is now in hot water with their boss. Well played mom 👍\n\nEdit: After reading some of the other comments I’m officially switching my vote to NTA. This was a pretty insensitive assignment.", "Your son didn't do the complete assignment, way to teach him what entitlement is.", "YTA.  You should have contacted the teacher first. You could have gone to the principal if you didn't get resolution. \n\nYou don't get to make a teacher change a grade. You get to discuss grading concerns with the teacher and move further up the food chain if you feel your child was treated unfairly. \n\nTone down the entitlement.", "YTA for how you handled the situation. You should have gone directly to the teacher rather than being petty and vindictive and going straight to principal.", "YTA for going directly to the principal, you should have gone to the teacher first. NTA for sticking up for your kid.", "YTA. It is not the teacher’s job to contact you about your son’s assignments. From the teacher’s perspective, your son refused to do the assignment. There is nothing in this story that indicates he gave the teacher a reason for refusing to do the assignment beyond the fact that he didn’t want to do it. So, she acted appropriately when she gave him a “0.” If your son had an issue with the assignment, he is supposed to come to you, then you go to the teacher, and if things need to escalate beyond that, then you go to the administration. The complete lack of responsibility you assign to your son in this is wild.", "YTA, not only did you enable your child in not doing a project completely but you went above the teacher before even speaking to her.", "ESH\n\nI think this is mostly on the teacher, but also that you should have gone to the teacher first before escalating to the principal.", "ESH.", "YTA Heaven forbid the teacher should try to get the students to learn to communicate. It's bad enough that kids don't hang around and learn to interact. You're probably the same mom that complains that little Timmy doesn't have any friends when all he wants to do is sit in the basement and play video games.", "Mild YTA, not for questioning his grade given the family shame but for not going to the teacher first. \n\nIn this case It is quite possible going to the teacher would have been totally useless but as a general rule it’s important to give teachers a chance to A) explain their side of the story given all kids lie/bend the truth when they don’t want to get in trouble & B) a lot of teachers could be reasoned with & those that can’t be reasoned with tend to be people that would hold a grudge against a kid for their parents behaviour so it’s wise to give them as fewer reasons as possible to be in future conflict with your child.", ">I was pretty upset. You expect your kids to not always be upfront with you, \n\nupset with your kid or the teacher?\n\n>but why on earth didn't this teacher contact me when she realized this assignment was problematic for him? \n\nKids don't necessarily explain, you didn't know it was problematic (and you have been unclear as to when you found out why. \n\n>And why didn't she grade his work? \n\nbecause he didn't do it\n\n>Why is the presentation 100% of the grade? \n\nbecause that was not the assignment\n\n>I would think a complete tree, if done correctly, is at least worth a C.\n\nSo? You are not a professional and you don't know what the grading criteria were exactly and you are ignoring what you were told. It seems like you just care if your kid got a pass. I don't see any evidence here of you going over the issue with him. \n\nThe teacher made mistaes here. Family trees are a mine field, I usually got kids to make them up or do a celebrity (and after telling them this  I still had a kid tell me that they would rather not do their family tree because their Dad was abusive and they were not in contact with him.)", "I don't know if I believe this. Your kid basically refused to do their assignment and you went to school and strong armed them.\n\nIf this is real YTA. Your kid needs consequences.", "YTA.\n\nHow old is your son? Unless he's in elementary school, it is NOT the teacher's responsibility to contact a parent every time a student refuses to do an assignment.\n\nPresenting the family tree PROBABLY didn't mean giving a life history of everyone on it.\n\nAlso, if your kid were a little smarter, he would've realized he can leave off, or say, anything he wanted about any of his relatives. How would anyone know? They wouldn't.\n\nAlso, you should've spoken to the teacher directly. You will forever be known in that school as \"that parent\" who's a pain in the ass and your kid will come with a red flag attached to his name.", "YTA. The teacher has a point. You could have contacted her first. I will say the assignment is bullshit and he should have been given a 50 for doing half the project. However, she’s no there to baby your son. If he’s not in middle school yet, he’s about to be. You wanted her to call you when your son refused to do his work? I can 100% guarantee she was written up….which goes in her permanent file. YOU DIDNT EVEN KNIW YOUR SON HAD A PROJECT TO DO?!?! I also can guarantee your son just asked to do a historical figure but didn’t explain why. I’m sure he just said I’m not going to do it. Her job is not to be the parent, that’s your job. If I was her, I would literally call you for anything….I would bother the living daylights out of you regarding your child. And people wonder why good teachers are leaving at alarmingly high rates.", "Unpopular opinion… but as a former teacher, I cannot contact the parents every time a kid refuses to do something. Parents are responsible to verify their kids complete their assignments and to overlook their grades. Also, the right order would have been to contact the teacher first, not the principal. You skipped the teacher just as you complained she “skipped” you. You have one son in that situation, the teacher is likely to have over 20students. Because you are acting exactly in the way that the teacher Did and it annoyed you, you are not addressing things any better. You wanted to report and get the teacher in some trouble while looking for solutions. So, YTA.", "I’m sorry, where is the explanation on why the child had an issue with making and presenting the family tree?\n\nYTA. Your son is lazy and didn’t want to do the work, and/or too scared to talk in front of everyone. There was ZERO things wrong with what the teacher did. Not only did it help the children do research, but it would have helped their speaking skills. She wanted to see how well these children did making presentations and speaking in front of the class, while scary, is a good way to help kids learn to do that in case they don’t want to flip burgers their whole lives.(meaning this is a skill they will need if they want a good job)\n\nSo your child being afraid to do a presentation made up some reason not to do it, and then he sucked you into it and now you caused a whole big scene, for what? Nothing. You did this kid NO favors. This will only get worse with more and more assignments he gets.\n\nAgain, YTA", "Honestly, the.kid.could have made up family members and no one would have known. Why didn't you suggest that to your kid? I, too, hated presenting projects and got lower grades for it.  The teacher's reasoning was always \"public speaking skills are important\". \n\nLying isn't great but on bullshit assignments, who cares.\n\nI have no judgement because this is all sorts of ridiculous", "YTA. It’s these actions that have created a generation of non resilient adults.", "ESH. \n\nYour child didn’t complete the assignment, therefore they didn’t get the grade. If I simply didn’t want to present every time I was made to, I would’ve failed most of my modules. Your child is not the exception \n\nHowever, given the teacher knew about your kid being uncomfortable with the assignment, for whatever reason it is, which I do not know about, she should have allowed him to omit certain details or allow the historical figure.", "This new generation.. I never dared to question school assignments. Every assignment has a meaning. In this case, child learns how to gather information, how to put it in requested way and how to present the founded information..  Basically these are skill that will be useful in the future, for example, preparing a project for important client and so on. Maybe teachers fault for not offering an alternative, but i dont support this behavior from your side either. School is about improving useful skills and teacher is doing exactly that in my opinion...", "YTA no wonder the kid didn’t do the assignment he knew you’d complain and he wouldn’t have to do the actual assignment just the parts he felt like bothering with.", "Yeah I was a very complicated adoption and family tree assignments were always shitty. Even as an adult trying to explain it to people I'm close to is a mess. It's an assignment that only takes traditional family dynamics into account.", "I know a Spanish teacher who does a family tree project to practice family names, but you are allowed to use your family or a fictional family for just this reason.", "Adopted and foster kids were my first concerns, and then I realized too many others might struggle for similar reasons. What if the kid's parent is a single mom or dad that escaped an abusive spouse or family? What if an aunt or uncle were serving life for murdering someone? What if one parent went away for dealing drugs, or flat-out abandoned them one day? Hell, WWII wasn't that long ago, so a nazi in the family tree isn't implausible either.\n\nSadly, there's too many ways that assignment could go wrong.", "agreed, sometimes the only copy of a picture is ruined for it/lost and having to act like everyone comes from some long line of a nuclear family, this isn't 1950 ffs\n\nTotally not the AH but the teacher sure as hell is", "As a school social worker (so, often the one advocating for kids with teachers), I fully agree.  Although teachers at my school know better than to assign a project like this. There is TONS of educational literature out there recommending against projects like this for this exact reason, so this teacher has to be willfully ignorant at this point.", "We had a family tree project in my high school ASL class, we were learning about signs for identifying people (think \"mom\", \"dad\", \"friend\") and describing people (think \"blond\", \"glasses\"). So the project was to do a presentation describing your family and yourself. The teacher knew that family can be an uncomfortable topic for some so we had the option to give ourselves a fictional family or use our real family. It was honestly the most fun that way.", ">And the fact that there was no wiggle room for him to present it in a different way\n\nThis is my thought. If the presentation is apparently so important, why not offer to do it privately to just the teacher or something instead of just saying whole class or nothing", "And I’m so proud of this 11 yo who had the problem solving skills to come up with other options!\nDef NTA here, and that teacher clearly needed a supervisor to step in since she doesn’t seem to understand where or how she went wrong here. And the fact that she wanted to keep it a secret (talk to her only) just grosses me out. Great job!", "For real. Do I put in my uncle who committed suicide? My grandmother who was made a vegetable through electroshock and forced lobotomy? My aunt who died in childbirth? The teachers complete lack of understanding and empathy is disturbing.", "I let my students use literary characters. Ive had star wars trees etc.", "I immediately thought of adopted kids, and foster kids. That’s ridiculous.", "100%. As an adoptee family trees as taught in school do not represent me. I’m not a branch that was grafted onto another tree. My birth family and my adopted family deserve representation. And to make matters worse when you start digging like that you’re asking kids to shoulder a burden that is not theirs.  Teachers who are refuse to teach differently are so problematic because they see the world in black and white. No grey. Which means they will be just as much of an AH with other issues, not just this assignment.\n\nEdit to add vote: NTA.", "Curious about your opinion on a project my son has to do aka I have to do as he’s 5. It asks about the child but also guide questions about this is my mom, dad, grandma etc It was triggering for me as we lost his father recently and I don’t want him to have to say anything about it when the poster is ‘presented’ by him next week. I feel bad for him.", "I mean it's a pretty awsome way to learn about genealogy and do it for real. My family tree now has around 500 people in it. It's super cool. But an eleven year old doesn't have resources to do extensive research like that. They'll have to rely on their family members. Which many children don't have. Ans don't let me start on the fact that many family trees are complicated, with adoptions, divorces, incest, a lot of stuff. They should alow a historical figures or fictional characters family tree.", "Thank you from someone else who has worked in the system and the nonprofit side of social service agencies.", "I think it’s a good assignment for some research, but the teacher could have said do A family tree, not necessarily yours. And make the presentation like 50% of the grade. How hard is it change the assignment to that criteria? I just did it! My wife was a teacher and is a principal now. She might smack me for saying that, but she was also fair to her students and give the kid an alternative assignment of similar difficulty/learning goals. Teacher was TA. Mom: NTA", "I was a foster child.  I would not have been able to mentally handle a family tree as a child.  It would have been very traumatic for me.  I am close to my mom now since my dad died.  But there is no way I could have mentally handled that", "I had a friend who was a teacher in rural AZ for a while. She did the family tree thing once, and ended up not counting it. I think it had something like “where they lived and how they got to America” or something. So many kids didn’t feel comfortable doing a family tree because they had a fair amount of family that wasn’t legally here. She probably should have been smarter but it was her first class as a teacher on her own and she didn’t realize how bad it could be.", "Seriously. There are so many reasons why a family tree could be a negative for kids. This should never be an assignment. But if it is used there needs to be alternatives and exceptions. \n\nThis teacher deserved to get the harsh wake up, and good on the principle for supporting OP. \n\nNTA, not even a little bit.", "Why did you automatically assume this is the mom that posted? Do fathers not take interest in their children schooling? I did my fair share of arguing with teachers over my kids mistreatment.", "Hopefully that's exactly what the principal got on her ass about, that family trees are too complicated emotionally for a lot of people.", "I refused to do a family tree when I was 11 and took the zero as my teacher wouldnt let me do another person. I had no contact with my father or his family, and in was one of the only kids in my grade that lived in a single morher household. \n\nI hate that they still do these.", "I agree, and as a teacher myself, I am disappointed to hear she wasn't willing to give him another alternative.", "As a former teacher (10 years in the classroom), this is also my take. Most of the time, and even before I read this post, my thought for things like this would be, \"probably an entitled parent.\" Not the case here. Putting aside that a family tree assignment speaks to a lack of trauma-informed training, the teacher received an assessable product. It's a super easy accommodation to grade this without requiring a presentation--not a lot to ask. It'd also be so much less stress for me, as a teacher, to simply grade the kid's work, maybe even dock a few points for not presenting (not that I would force a kid to present on a *family tree* assignment, or even give one in the first place, but presenting in front of folks is an important skill that does need to be assessed at some point), and move on.", "yes, exactly. I came into this post thinking op was def TA but nope. OP is NTA at all", "In a class of 30 students 25 of them have an IEP, 504, or just need more individualized attention. OP is TA for not talking to the teacher before going to the principal.", "And really, even without \"non-traditional\" families, sometimes history simply isn't known. I got questioned back when I had to do a project like this in the 1980s because on my paternal side, the tree stopped with my grandfather. Guess what? My grandma married the stranger who had come to town and mainly cut off his family, so she never learned much that side. And he was long dead by the time I was in high school.", "Yup, me too.\nI’ve had it 3-4 times and each time we were able to use “fictional” or celebrity families.  One guy did family guy once lol.\nOne time, I forgot to do it, so while rushing it, I made all the male members of my family just have a bunch of my nicknames.\nNo One Cared", "My sperm donor left to buy milk before I was born.  Never came back. I would have a giant blank spot on my tree where father's family is supposed to go. I would have been humiliated to present. Good on mom for backing up her kid.", "I had to do one for a course in my psychology doctoral program. My only problem was that my father was the youngest of 13 children and he had 3 families of which I was part of the second. And even we were not required to present it.", "I typed up and sent almost this exact comment. There’s a hundred bad combinations of how this could go wrong and be stressful for the kids, and not fully understanding that seems so flippant to me.", ">How could she have not foreseen the trouble it’d cause for students?\n\nBecause a lot of people don't understand that family dynamics can be complicated/sensitive. They only think of a large family consisting of happy nuclear families.", "The problem isn’t being upset about the assignment, the issue was going over the teachers head without directing concerns to her first.\n\nOP is an asshole for not talking to the teacher directly before going to the principal.", ">What about adopted kids who don't even know their biological parents?\n\nAs an adoptee, I had to put in my adopted family's information and then feel super shitty about it because I had zero genetic connection to anyone listed.\n\nI don't understand how some schools are still doing family tree projects (and thus making kids like me and OP's son feel awful) when there are so many reasons not to.", "It doesn’t bother you that OP didn’t even attempt to discuss it with the teacher first? \n\nShe wanted the teacher to go directly to her, but then she didn’t go directly to the teacher. Grade A hypocrisy.", "Yeah Ive never heard of a situation like this that wasn’t followed by retaliation from the teacher against the kid", ">The kid who doesn’t know who his father is should have to divulge that to the entire class?\n\nI found myself in that exact scenario as a high school student. I even gave the teacher a note from my mom explaining the situation and asking for an adjusted or alternate assignment. the teacher gave me a failing grade anyway and admin refused to intervene. it was humiliating.\n\nwhat I'm getting at is... good for OP standing up for their kid. NTA.", "Or worse,  what if one of their immediate relatives (aunt/uncle/cousin/sibling/etc) were recently in the spotlight for some sort of crime and they don't want that stigma to be tied to them?\n\nImagine having a direct link back to a famous serial killer or something, while some folks would find that cool, others would be mortified for that information to get out.", "People with relatively \"normal\" families often have the biggest blind spot that not everyone's experience was just like theirs.  It's very strange.", "This pretty much says it all. This could lead to bullying and harassment from classmates, and judgement from other adults when kids have questions of why a classmate may not have a father in their lives or other such situations", "I remember helping my kids with this assignment. It was super difficult to figure out where to place all the half siblings their dad gifted them with. Then there's grandpa's new family with \"aunt's\" that are the same age as them.", "Quite frankly Mom to report the f/u conversation the teacher had with her as well.   That teacher lacks professionalism", "Yeah, I agree. Making up fake relatives would have been an easy fix, but he didn't think of that, and he was too embarrassed to talk to me about it, so I couldn't suggest it. Maybe a different fictional family with less incest than the Targaryens would have been my suggested inspiration though.", "The problem isn’t being upset about the assignment, the issue was going over the teachers head without directing concerns to her first.\n\nOP is an asshole for not talking to the teacher directly before going to the principal.", "What's weird is this is an EXTREMELY COMMON ISSUE that people moan about on reddit.\n\nLike so often it'd 'I'm an orphan and IDK my family tree buy got failed for it' or similar.\n\nAny teacher who assigns a family tree assignment (that isn't 'make a family tree up' is an AH\n\nOp NTA", "100% agree with this. OP’s son even suggested an alternative way of completing the assignment, where he would’ve done the submission and presentation. Even when that was rejected, he still completed the report that he was uncomfortable with. The teacher’s excuse that he could just copy someone else’s family tree from the internet was ridiculous. A lot of those kids would’ve had to ask family members for the info and just write that down anyway.  \n\nGood on you for standing up for your son, OP. Some teachers are just bullies who think they won’t be held accountable. This teacher was just mad that her own actions have consequences. More importantly, your son knows you’ll advocate for him and may be more comfortable coming to you with this sort of thing in the future. NTA.", "I am old enough that one of my peers was the great grandchild of enslaved Americans. Her family tree “started” in 1871 when those ancestors got married. It was heartbreaking to see their tree which was missing so much next to the long extended ones others had, and taught a lesson I don’t think anyone was expecting. \n\nOP NTA", "As a teacher myself it is WILD to me that she would try and force an 11 year old to present something so personal. If the presentation was so important and not the tree itself, why did it matter if he got it off the internet? What an absolute AH.\n\nEdit: The response in this reply is perfect, I got off track because of the indignation xD", "Yeah, this is not a good assignment to force kids into public speaking. There are plenty of other assignments kids can do that are fun and engaging that don’t involve revealing personal information that can be very sensitive to some. Heck, the kid even wanted to still do the presentation, just not of his personal family tree. Why couldn’t he have submitted his tree but presented on something else? That way you can still grade their ability to create a family tree AND public speaking. Overall the teacher just handled this poorly and insensitively.", "This is exactly the correct answer  (I'm a former Faculty Head in a Scottish high school and public speaking was part of our formal English assessments for many years.)", ">by giving him permission to be not entirely honest with his family tree. \n\nWhy on Earth would he need permission for that? That's what I don't get about this whole story, kid could've just made shit up instead of trying to explain things and giving up his real family tree to the teacher. It's none of her damn business anyway...", "\"This is a violation of your family’s privacy.\"  \n\n\nThis is precisely why a parent complained to the school where I did my first teaching practice, prior to my arrival there.  It was a Catholic high school and a parent came in very upset, because she was divorced and thought that the school was being inquisitive.  \n\n\nThat was 1983.", "Agreed!  Also: \n\n>The teacher explained her reasoning, and I said that my son's embarrassment over some of his family members shouldn't impact his grade\n\nThis is what OP had to say about why her son didn’t want to present!  So there might be some unsavoury ancestors or something that the son doesn’t want his classmates to know, which is completely fair, especially since 11 y/os aren’t exactly known for letting those sorts of things go.", "More so, what if a child is adopted with no knowledge of family history so they literally can’t complete the assignment? They just get an automatic zero?", "Actually, from what I’m reading, he did not explain his issue. He asked for an alternative and she said no. Then he refused to present. Nowhere does it say that anyone explained a reason.", "Space out Y T A or it will count that as your vote since it's first. \n\nAnd yes,  NTA.", "OP wasn't in the chain of communication to bypass, son was. He tried to get an alternate assignment, it didn't work. The next step would be OP speaking to the teacher.", "You effectively DID say Y-T-A based on how voting counts. So you might want to edit that.", "Idk hearing your kid tell you how the teacher wouldn't compromise and if she previously had issues with said teacher going to the boss mightve been a good call", "NTA \nBut was the principal there for the second half of the conversation? Holy moly that teacher was rude af.", "He didn't want to talk about our relatives.", "Everyone's age has to go on the tree. Birth dates and death dates.", "So I did diversity training for schools. Specifically, I worked for an agency that helped foster and adopted youth feel ay home in schools. This family tree assignment is our sample \"bad, thoughtless, and alienating\" assignment. We use it to show how \"well meaning\" but rigid and biased teachers hurt kids. Most foster and adoptive youth our agency surveyed were bullied after doing this assignment. It requires divulging info that might lead to peer issues. Sometimes students cry when discussing the deaths of family members. Some kids are pressured to explain why they were removed. None of that is ok. Pressuring a child to discuss painful info in front of their peers is shitty, clueless, out of touch, and biased teaching. Decent teachers know to offer an alternative. Rigid assholes double down.", "She says it in the post. There are family members of hers that her son didn't want to talk about but would be forced to if presented. My guess is some dark spots that are well known to the area that no one knows he's related to. \n\nEither way this assignment is horrific. What about children who are in abusive homes? Foster kids?", "This has been addressed. There is something embarrassing that neither the son or OP wish to speak on. There could be incest, rape, incarceration, and a million other things that make presentation of a family tree an awful and inappropriate ask", "You shouldn’t have to cater to parents whose crazy religions tell them they’ll go to hell for writing a silly story about zombies.", "Talking about your biological relatives can in fact be dangerous for some kids.", "So you should role model ass kissing a rude and ignorant person to keep the peace? No thanks.\n\nThis assignment is a horrid idea, and anyone with an ounce of empathy who thinks about it for more than a couple seconds can see that. The kid made it extremely clear they were uncomfortable with the assignment, and instead of talking with the child or their parents they simply failed them? Hell no.\n\nThe idea of going above and beyond to get on the teacher's good side so she doesn't *ruin a child's future over her own ignorant assignment* is insanity. If the teacher escalates, escalate back. Otherwise, deal with her politely for the rest of the year and leave her behind.", "While I would normally agree with you, it doesn't seem like the teacher saw anything wrong with how they handled it even after the principal agreeing. I don't think it would have gone any different if it was just a parent and teacher talking about it and she would have them had to loop the principal in anyways. \n\nYour definition of high road is troubling. Teachers are super gossipy so she needs to grovel? No, she needs to have a respectful, mature relationship with the teacher.", "The teacher shouldn't have ignored such a gigantic red flag either and should've contacted the parent, not just gave the kid a 0. Once that happened they lose all right to complain about people going over their head, especially since it resulted in the principal making them change the assignment for the future, which needed to be done and would NOT have been done if the parent hadn't gone over their head.", "Oh no, not the permanent record! Which is a very real and important thing and not something totally fake and used to bully kids and parents who don’t know any better! \n\nGive me a break. Going to the teacher would’ve resulted in absolutely nothing productive. OP did well by jumping to the principal, and the only further thing I’d have to say to the teacher is that if I even get a faint whiff of retaliation I’d go nuclear. NTA", "It says eleven in the post.", "11, she said in last paragraph", "I think given the teachers reaction in front of the principal, it would have been far worse and escalated to the principal anyways", "No. You don't.", "They posted a comment implying the issue was the dates needing to be included but you really don't need their family tree it's obvious from the post that they aren't comfortable sharing that information and neither is their son.", "Eh. I'm a teacher and I would 100% expect a parent to get admin involved over something this serious. There is no excuse for a teacher creating a requirement that a student not only reveal highly personal information, but also present it to peers. That kind of assignment could be incredibly embarrassing and even traumatizing to foster children, people with undocumented or incarcerated parents, people living in less conventional family situations, kids who have lost parents. I know I've been trained multiple times on how to avoid singling out students with assignments like that, and even if I hadn't, it's unacceptable that the teacher provided no alternatives. \n\nThe student tried to resolve it directly with the teacher by suggesting a great alternate assignment (good job, 11yo!) but the teacher shot it down. At that point, I think OP did the right thing by getting the principal involved. That doesn't just resolve it for OP's kid but also makes sure the teacher has to change the assignment in future.", "The teacher didn’t give the OP the courtesy of contacting her directly. Why should the teacher expect the same in return?", "Totally disagree the unprofessional behaviour of this teacher does not suggest that she is the correct person to be having this conversation with to start. This teacher did not just create a bad assignment but also tried to coerce a 11 yr old. This kind of behaviour should be looked into. The way the teacher behaved afterwards proves the OP to be right.", "The teacher should have been disciplined and mom handled this exactly as she should have. These types of assignments are very problematic for a lot of reasons. Imagine being a foster kid getting this assignment. The teacher was not behaving appropriately, I would not have wasted my time trying to speak with the teacher first anyways. Plus it is a teacher’s responsibility to reach out to a parent if there’s an issue with a kid in school. It is not a parent’s responsibility to prioritize the teachers job/career/feelings over her child’s well-being and success", "We live in the digital age. Not the age of teachers can only reach parents on Parent Teacher Night.\n\nTeacher gives a problematic assignment. Doesn't realize it's problematic, which can happen. But when a student is intentionally getting a zero on an assignment, even if they don't have the thought maybe there's a problem with the assignment, where is the thought to email the parent?\n\nTeacher is the adult in the room. They failed. Dad is NTA, only the teacher is.", "Thank you for pointing out the irony of OP AH-ness. It made me laugh, you are completely right. Sounds like she was being super vindictive and is now patting herself on the back because she got the teacher in trouble.", "Because an 11 year old didn't want to have to explain to a classroom full of his peers his family tree.\n\nJust off the top of my head I can think of many plausible reasons, adoption, passed away relatives, an unorthodox family structure, a family member that went to get milk 5 years ago and hasn't come back, some of the tree being in prison.", "Presenting is horrendous for a lot of people, children or adults, regardless of the subject. I think all kids should be encouraged to do it, but never forced. I think if it means losing a few marks, whatever. If you can do the work to a high standard then lose everything for not presenting? Nah. Creating fear and shame where it doesn't need to be.", "There is obviously a problematic relative or a lack of a relative in that tree the kid doesn't want his classmates to know about, so the son went out of his way to ensure he wouldn't have to tell them about or blatantly lie.", "These kinds of assignments have come to be recognized as highly problematic in the last 15-20 years for a variety of reasons, including kids whose relatives were slaves, kids who have been abandoned by a parent, kids who have trauma related to relatives and/or stepfamilies, kids who were adopted or lost their birth families and may still be in foster care, and so on and so forth.", "They likely had personal reasons regarding their family. No child should have to openly discuss their family if they are uncomfortable doing so.", "Privacy.  The teacher could have let the kid present someone famous, and graded the presentation, and the tree he gave her privately, separately. And then adjusted the assignment for basic sensitivity for all future classes,", "Because presentation of family tree are an outdated assignment that only lead to adults snooping in some els businesses or the kid begin bullied. \n\nIf the presentation was so important, I doubt because they are 11, she could have him present whatever from and history events to an animals.", "Considering that the teacher protested the principals decision regarding the assignment, it seems pretty clear would have ended up in a 3 way meeting regardless", "The teacher already decided she didn’t care about how OP and their child felt. Going to the principle was imperative at this point.", "I was a middle manager in a Scottish high school until I retired from my permanent position. I'd say that the OP was right to go to the principal. A family tree assignment can be problematic. As a bare minimum, the school needs to be sensitive to this,  \n\n\nAs I said in a previous comment, I first had this flagged up to me when I was a student teacher in '83. In my old school, the Faculty Head or Headteacher would simply advise the classroom teacher to provide an alternative or different assignment in future.  \n\n\nThe principal in this case handled things correctly. The person who compounded the problem was the classroom teacher for further berating the OP.", "Why would a parents relationship with the teacher impact the child? I couldn’t imagine anything more unprofessional than an adult having an issue with another adult and taking it out on their adversaries 11 year old child. This child went back and forth with the teacher multiple times to find a solution. At that point it is time for the teacher to reach out to the parents as there is clearly an issue. If they didn’t want OP to go above their head the lines of communication are open from teacher to parent as well.", "Probably the same reason why the son doesn’t want to present those family members. So no, neither of them have to be specific if it’s a sensitive subject.", "No she doesn’t. It’s a bad assignment and kids should not be forced to explain why talking about their relatives is problematic.", "I really don't think that matters tbh.", "Why does it matter? They could have been criminals, he might not know who they are, they might be people others have heard of that are simply creepy, or notorious…doesn’t matter, a kid should be able to keep his own life private.", "Incest, according to one of OP's comment.", "No, she doesn’t.", "OP has an issue that the teacher decided to give the son a zero after he explained his reasoning for not wanting to present. He also completed the assignment and emailed to the teacher. He was not comfortable sharing the private info. The teacher did not make any allowances for the son and gave him a zero. Had the teacher listened and taken it into consideration, then contacted OP, this would have resolved the situation. Instead the teacher just gave a zero. No need for OP to parrot what her son already said. Teacher made her decision.", "The son was proactive in letting the teacher know he was uncomfortable with the assignment and offered reasonable alternatives. Which the teacher shot down. Why do you think the teacher would have reacted differently if OP made the same suggestions?", "If this is the reason they are quitting good for all. The kid was uncomfortable and even a tea spoon would have understood it and ask to speak with the parents.\n\nThe moment the teacher decided to just punish the kid without contacting the parents she loose her possibility to be contacted before the principal. Also she clearly have the face the answer back to the principal she would just shut down op.", "The teacher made the presentation 100% of the grade…. Not 5%", "Thank goodness the parent _didn’t_ just contact the teacher, or students would be putting up with this crap for years to come.", ">enough on their plate without having an extra meeting\n\nAnd they wouldn't have had an extra meeting for just the two of them, that may have been escalated depending on how things went anyway causing yet *another* meeting?\n\nSeems to me like OP just skipped astep and got everything done at once..", "The teacher was eminently unreasonable in grading the assignment zero. The kid reacted very maturely despite only being 11 - he expressed his concerns, he offered alternatives, he finally did the assignment and emailed it to the teacher. \n\nThis meeting was entirely on the teacher‘s unwillingness to work with their student. They had a ton of options to avoid this, but they had to push through. This kind of complete inflexibility is the sign of a bad teacher, not a good one. And when bad teachers quit, good riddance.", "Then maybe the teacher shouldn't have been so shit at their job.", "The kid didn't half ass it, he didn't want to reveal personal info to his whole class. What if his relatives were famous murderers or criminals, it opens kid up to bullying for no damned reason.", "Half assed? The kid did the whole assignment you melon, they just didn't want to present information about their whole family to their classmates. \n\nOh yeah poor teacher, ignored all of the kid's compromises and gave him a 0 and then doubled down on it at the meeting. \n\nWeirdos on this website.", "And the teacher needs to learn that privacy is a thing, doesn’t matter that it’s an eleven year old kid. \n\nHow would you feel if you were forced to explain to your work colleagues about your father in prison (for example) or else you’ll get a strike at work? \n\nNTA for the op or the kid", "Thank you! \n\nOP should go directly to the teacher before escalating it to the administration. Nine times out of 10 the administration is going to agree with the parents because it makes their life easier and teachers have to deal with the consequences. I understand the assignment was problematic, but the way OP expressed her displeasure was extreme and wrong.", "The teacher demanded that he reveal private information to the class, in order to get any grade at all. He did the assignment, he just didn’t show it to the class.  The child asked to do a different person’s history, and the teacher said it was too easy to copy. The teacher should have gently found out why the kid didn’t want to present, grade the research on his own tree, and let him copy and present some famous figure’s tree, that he copied from online.  And changed the assignment for future classes, because it’s fraught with so many issues.", "You must be the teacher from the post, completely missing the point. A pity.", "No way to teach him to fight for his right to privacy. Teacher and classmate doesn’t need to know all the family history of this or any other kid", "It’s entitled to demand children publicize incredibly personal information about their heritage just because you think it’s a good assignment.", "I agree to a point. I agree with her point, I've never been in an assignment where the entirety of a grade came down to the presentation. Kid can only get 50 - 75% of the grade, ok. But not a 0.", "The issue in the AITA is clearly not the grade, but the lack of communication from the teacher to the parent, and the clear lack of concern for a student from the teacher.\n\n\nFamily tree assignments are very common in schools, especially for eleven year Olds, but it's extremely uncommon and heavily frowned up to PRESENT them to a class. This was a bad version of this assignment and when the kid protested the teacher should have heard out his concerns and genuinely attempted some form of compromise with him which did not happen.\n\nOP is clearly in the right since administration not only agreed with her issue of lack of work, but disciplined the teacher for an unacceptable assignment. If OP had not gone to the top, this bad behaviour from the teacher would likely never have been noticed and could never have been corrected.\n\nThis is not entitlement, this is good parenting", "Based on the teachers reaction, we can be sure that she whouldnt have compromised one bit. Maybe it whould have been tve right move to do so, yes. But the teacher implying that there whould have been a solution without escalating it to this point is riddiculous.", "The only person who is petty and vindictive is the teacher. Who in their right mind gives an incredibly personal assignment (one that *obviously* is a horrible idea and potentially traumatic for kids from many different backgrounds), ignores a child's pleas that they're extremely uncomfortable with presenting said incredibly personal assignment, and then gives the child a *zero* instead of talking to the kid or their parents?!  Every single step of this is lacking in common sense, common decency, and basic empathy from the teacher.", "A zero is not appropriate unless zero work is done. Doing the entire written assignment but not presenting would not equate to a zero. I guarantee the rubric did not indicate that the only points were for presentation.", "No.\n\nTeachers can communicate with parents. It's not the 90's they don't have to wait for Parent Teacher Night.\n\nWhen the student refused the presentation of the assignment. As the adult in the room the teacher should have reached out to the parent.\n\nThey also, should've realized that this assignment can be problematic. As someone who knew mom, grandmother, aunt uncle, and no one else because my family fled the iron curtain. And didn't know my dad's side because mom never told anyone, or didn't know herself. 11 year old me shouldn't be forced to explain that. \n\nOr whatever is in the OP's tree that they don't want shared. \n\nEven excusing not contacting the parent, and not realizing it, the teacher doubled down when told no by the principal. The teacher is 100% wrong, and 100% the asshole. \n\nOP NTA. They showed their child responsible boundaries.", "But it is the teacher's job to make their classroom a welcoming place for all students to learn - and an assignment asking students to disclose personal information about their families with no willingness to accomodate students who may not be comfortable sharing isn't conducive to that. \n\nThe kid is 11. He shouldn't be blamed for not perfectly advocating for himself against a grown adult in a position of power.", "OP explained her reasoning for going above the teacher in the first place. Parents can stand up for their kids without it being labeled as enabling. Why in the world would someone pick an assignment over their child’s comfort, especially when it’s dealing with family lineage, something that is heavily out of the child’s control?", "Teacher could've reached out to the parent. \n\nThey have blackboards, and emails. It's not the 90's no one needs to wait for Parent Teacher Night. \n\n\"Hey your child is intentionally getting a zero on an assignment, we should talk.\"\n\nThat alone should've clued in the teacher that their assignment could be problematic.", "How?", "Sorry that you don’t care if an 11 y/o gets bullied and embarrassed about his family tree. He is uncomfortable telling everyone it and that’s fine", "He did part of the assignment and should be graded on that part. That’s all she wanted .", "The assignment was so poorly designed the principal has required that it be fixed in order to be used in the future. This is not on the kid.", "He did the assignment he just wasn't comfortable showing it to the class. I've had students who are brother cousins, and honestly they hated having to explain to people.", "Did you read the post?", "We don't have an issue with \"non resilient adults.\" We have an issue with insecure adults feeling it's justified to mentally beat up on children to fit an expectation that as asinine to begin with.", "Your judgement should be ESH if this is what you believe—although I think it’s ridiculous to act as though it’s AH behaviour to challenge a teacher when they are assigning poorly-considered projects.", "from what is stated in the post, it wasn’t the child’s lack of desire to present, but rather they didn’t want to talk about their family tree. this insinuates that something about the family is difficult for them to talk about (death, prison, abuse, relations, etc.) the child even tried to compromise with the teacher by asking if they could present a family tree about a historical figure instead, but teacher did not care to accommodate. \n\nas a person who works with kids from many different backgrounds like a teacher does, it’s important to consider the needs of all students in the classroom and be able to adapt to the needs in a reasonable way that is fair to said child and their peers. most kids i know are happy to talk about their family. the fact that this one was absolutely not into it should have been a huge sign for the teacher to make the appropriate accommodations like allow them to present a historical figure. the teacher, in the future, could even give students the option to present a family tree or a historical figure so the kids that don’t want to talk about their family, don’t have to. NTA.", "An ELEVEN year old advocated for himself and offered not one but TWO alternative solutions. You’re making it sound like he threw some entitled temper tantrum.", "The child did complete the assignment. They just didn’t present it which is completely valid for an ELEVEN YEAR OLD not to want to share overtly personal information with a roomful of peers. There is no family tree presentation requirement to pass the 6th grade. The teacher was being TA. The parent handled this exactly how it should be handled. I’m a child development major and a manager in a field where people work directly with kids. Exceptions absolutely can and should be made when necessary. Not to mention it’s a trash assignment just most schools don’t do anymore because it can be so problematic. The principal had every right to know what was going on in one of their classrooms with one of their employees. \n\nIf someone doesn’t think exceptions should ever be made for children in school they have absolutely zero business being in teaching.", "You should change your verdict to E S H not Y T A if you think that Everyone Sucks Here.", "As someone with an extremely dysfunctional family history, I 100% understand why certain children might not want to talk about their family in front of the class. It may not require kids to go into details, but in some cases talking about an abusive or estranged family member could bring up lots of negative emotions and could even be traumatizing. The kid asked if he could complete the assignment, in all its requirements, about a historical figure. Which would have taught the exact same skills intended by the assignment. But judging by your comment about “this new generation”, I’m doubting your issue actually falls with not following the spirit of the assignment.\n\nEdit: re worded something", "Child of a \"deadbeat\" dad who essentially walked out of my life to not expose me to the toxicity of his already decades long substance abuse problem. I understand and empathize with him now but as I child I understandably felt abandoned. Then you factor in that not only was mother abusive but that I was already bullied and considered less than by my peers and, well, I bawled at having to make a family tree that was mostly one-sided. \n\n*And I wasn't even presenting.* At that age, which was also the age I was at the time, children can and will use whatever they can against each other in the Great Middle School Mosh Pit of life.", "I HATED family assignments as an adoptee, I hated feeling like a liar writing about my adopters and not actually knowing anything about myself. Especially since my adopters are both physically yt (white, some platforms censor this and I do not frequent Reddit super often) and I am physically not.", "As an adopted kid who didn't yet know the complicated backstory, I *hated* my \"Day I was Born\" project. And even though one of my classmates was also adopted, she had an open adoption and photos of her birth mother. Other kids were comparing eyes and noses and smiles to moms and grandmas, and at the time, I had nothing.\n\nI wish those projects would get replaced.", "I have traditional family dynamics going back consistently for generations, and I agree with you. It’s a crap assignment, and the so-called professional educator has a helluva nerve getting riled.", "I also had a complicated adoption(twice) and hated these assignments. I would use my adopted family but felt like a fraud.", "There's nothing like explaining to my teacher that I'm a child who's father married a 24yo woman and had me when he has 2 adult children that are my half sisters and oh! I was an aunt the second i was born.  As my nephew so lovingly explained, im the crooked branch on the tree lol.", "It's this a common thing where you live? I have two teens and they have never had to do a family tree.\n\nThey did one in Spanish for a fictional family, but not their own", "Same here. The Spanish teacher I knew let kids pick anyone as family members as long as they used the correct name for the family member. So, you could say that Trevor Noah was your father and Beyonce was your mother as long as you labeled them correctly.", "That is a completely reasonable accommodation. The fact that this teacher insisted on real family only, and in person presentation only…not reasonable", "My HS ASL class had a similar project to practice identifying and describing people. We could use a real family or fictional one.", "Yeah my spanish class did this too. I think I did mine on the Simpsons.", "I remember someone else posting on reddit about this. Said it was hilarious what her students would come up with in term of celebrity “family tree”. But all she was looking for was correct language & context for the assignment.", "I know one who cheered loudly when she first saw _Encanto_, because now she has a whole-cloth tree for the students to work with.", "This is a MUCH better version of the assignment. Wanna present your family? Great, do it! Don't want to? Also fine! The kid offering that compromise had a great idea.", "I mean, my own grandmother survived Auschwitz, her husband was killed by the Nazis, and both my mom and dad's extended family was mostly slaughtered in concentration camps or ghettos.  I almost wish we'd had this assignment when I was a kid.  Would have shut everyone up.", "My husband knew someone in college whose father was in jail because he had murdered his mother in front of him. \nThat would be the assignment from hell for that person.", "If I had a full grasp on all of my family's issues when I was younger call, I told we would have aired it all just to make the teacher uncomfortable and re think everything about the assignment.", "My mom was one of 13. My dad was one of 8. I’d need a very large paper for that stupid line alone. I have older half siblings from both parents, which confuses things. Then my one sister had a stillbirth before I was OP’s son’s age. Do you include him on those stupid assignments? It’s a mess.", "My great grandmother is the product of rape at a native residential school… that was a fun one to talk about during family tree assignments growing up. Especially considering that’s the reason I am blond hair and blue eyed.", "Right? Do I ask my grandmother the names of all of her children who died in infancy? Ugh.", "I had a music teacher that decided in 6th grade to tell my whole class about my older brother’s death (he had died before I was born) without my permission and with me in the room.", "Should I talk about my great grandmother who was in the KKK or my uncle who served time for making and distributing videos of sexually abusing minors?", "I’m the surviving half of disappearing twin. How does one denote “I kinda ate my identical twin” on such an assignment?", "I'm not from US so I never had to make these kind of assignments, but I'm little confused. By the name of it I thought the idea was just to show the class something like \"these are my parents, these are my grandparents, aunts, uncles and cousins\" in a presentation showing just names or drawings. Do they have to specify how a member of the family died?", "Your son is one of the reasons I’m discussing. He shouldn’t have to present about his dad right after it happened (or ever if he doesn’t want to). I would absolutely talk to the teacher about giving him an alternative assignment. Genealogy is not even a necessary life skill!", "I'm disappointed that she even set the assignment in the first place.  Off the top of my head, this assignment would be problematic for at least a quarter of my class.", "I'm also a teacher and completely agree: it is not difficult to make an arrangement to help a student who has anxiety around an assignment, especially when an assignment can venture into something so personal.", "I’m also a teacher and alternate assignments can always be negotiated. However, I do think OP should have asked the teacher for a meeting before escalating to the principal.", "Teachers know that secure, respectful relationships are essential to everything we do. If a parent or student says they don’t feel comfortable approaching due to a lack of communication, then that teacher has some reflection to do.", "The teacher was the AH for making the presentation portion 100% of the grade for *an eleven year old* and not listening to any of his concerns or bringing them up with OP when he insisted it was a problem.... If I made a rule and a kid was hell bent not to follow it and tries to compromise reasonably, I am not initially going to punish them for it but reach out to the caregivers to find out if they have insight into why kiddo is being so persistent. \n\nI definitely think that if things aren't going well in classroom, it is the teacher's job to contact the caregivers... this one didn't so I don't blame OP for going over her head... especially since the teacher couldn't even see the problem with the assignment and it apparently *needed* to be brought to the principles attention.", "How long do you have to go back for these assignments?? Not from US, so I thought it was only about the parents, grandparents, cousins, uncles and aunts.", "> sometimes history simply isn't known.\n\nWhen we had family tree assignments in school, I had to be the party pooper kid who was like \"this side of the family only goes back to my great grandma because the Holocaust split her family apart and she was never able to locate them after the war\" 🥲", "I’ve never had to do this type of assignment because I’m not from the US, but I’ve asked about my family history just out of curiosity. More than 12 years ago two of my aunts did an extensive research on that side of the family, and dated it back to like the 19th century. Meanwhile, from my mom’s side we know her dad was raised by a lady who gave him her last name, but we don’t know if he was an orphan she raised, if he was her illegitimate son, if he was her late husband’s illegitimate son, or what. He never spoke about it in life, and he passed before I was born. \n\nMy tree would look definitely disproportionately bigger on one side.", "The child spoke to the teacher and was shot down for his wonderful alternate idea. Are schools not teaching kids to respectfully stand up for themselves and problem solve? Good move on mom for bypassing the indignant teacher.", "Her son already spoke with the teacher. She made the decision to give him a zero. OP doesn't need to reiterate the same points her son already said. If the teacher wanted to consider them she would have reached out to OP. She did not and proceeded with the zero.", "The teacher should have contacted OP at the start. And the way OP handled things was a lot more responsible than going directly to the teacher. This way, there’s a third party that’s not involved, so they can’t be biased towards either side. \nAnd if done privately, anything could’ve been said/could’ve happened, then it would be a he said-she said situation, which wouldn’t help anyone. \nOP did the right thing.", ">OP is an asshole for not talking to the teacher directly before going to the principal.\n\nJust how?", "I remember seeing a post on here a while ago where an adoptee did their family tree using their adoptive family and the teacher either gave the kid a bad grade or requested they redo it, can’t remember which, because it wasn’t about their bio family. It was bullshit.  If schools want to teach the concept of family trees that can do so using public figures instead of expecting kids to air out their personal lives for a grade. Or just scrap them altogether.", "The teacher set the precedent for their communication, by not bothering to communicate in the first place. This easily makes the parent feel that that communication option isn’t there", "Did that teacher go to OP with this problem?\n\nIt seems to me that if a kid doesn't want talk about his family tree out of embarrassment and is offering alternative assignments he can do instead, then the teacher probably should have called the parents to talk about this.\n\nParticularly since that teacher is threatening to give a zero for an only partially completed assignment.\n\nI feel like, if I were a teacher, and a child was having trouble with an assignment that was going to result in a zero for the assignment, I'd want to talk to the parents before giving the kid a zero.", "Not at all, that teacher has clearly demonstrated she isn't willing to work it out at all and was even arguing with the principal about it. You don't need to deal with unreasonable people if you can go to their boss.", "Kid already sent the same email to the teacher OP would have, or at least that I would have.  Then the principal said the same to the teacher, and teacher continued to dig in.  So, it’s just as well op went up the ladder.", "Makes me so mad. My son has an absent dad. It’s a sore subject. His stepdad and I went to enroll him in school, in the district where we own a house, all live together, have more kids together, and they tried to have my husband escorted off the premises because he wasn’t on the birth certificate, loudly screaming that he wasn’t his parent… while standing right next to me, my son and our other kids together. \n\nYea I called the superintendent.", "I’m sorry your teacher couldn’t have been more understanding that you, as a child with no choice in the matter, felt uncomfortable with the assignment. I hope your mom like, took you for ice cream or something over the grade anyways.", "Or if the kid don’t know and family is just LC. I’m aware my mum has some cousins on her side and the cousins have kids. I don’t know them, honestly I don’t care about them. I’m not gonna call them and ask bunch of private questions just because a kid’s grade depends on it. Family is private matter. And none grade should depend on revealing it. No matter the reason. Make the other assignments and even presentations (personally I hated presenting and still don’t see the point in “adult” life). OP NTA. Teacher is for even demanding to kids to do it.", "…or if they were abused by a family member \n\nSo many easily foreseeable problems", "This! \n\nI thought that immediately. What if Ted Bundy or Jeffery Dahmer, or the latest mass shooter was your relative that was expected to be included? Yeesh! Talk about stigma. \n\nI wondered what trauma was created within a student’s world if they had family issues. Or if there has been a death. Or they had no family history to go by. \n\nToo invasive, too insensitive, too triggering for too many for a project like this to be presented without serious changes. I mean, what was the purpose of the assignment; public speaking, research, interviewing, creating a PowerPoint presentation?", "He came up with a great solution all on his own! A better one, really!", "I think you showed your kid that you will always be in his corner when things get tough and next time he will be more open to coming to you when he has a problem, so the little conflict with the teacher here is not as important as what it taught your kid (and no, it's not that if he doesn't want to do something he doesn't have to and just needs to go crying to mommy, but that he can set reasonable boundaries and not do something that is uncomfortable for him and that he can go to his parent for support when needed)", "I would tell the principle that she doubled down and what she said at the end. This is not ok.\n\nAnd in my country this is not done at all for this exact reason. I'm shocked it's still common elsewhere.", "Ultimately talking to the principal was a good call because if the teacher told the principle that she saw nothing wrong with the assignment.. what would she have told the parent? Now she is forced to change the assignment for the better instead of brushing it off.", "No, the problem *is* the assignment and the teacher's response to a student who had a problem and came up with a very reasonable solution to it and was told absolutely not. Some issues warrant going over the teacher's head, and I think this was a fine situation to do so.", "She lost the right to be contacted directly when she didn’t contact the parents after the child refused to present. The child is 11. In what world does a teacher go I shouldn’t contact his parents about this, I’ll just fail him?", "The child already sent the appropriate email to the teacher, basically the same one I would have sent. Sending it again is pointless. It had to go up the ladder.  Also, hindsight shows OP was correct, since the teacher continued to argue.  The kid was completely professional, far FAR above his age.  OP, I hope and confidently assume you are very proud of your kid.  I hope he gets ice cream.", "I'm a pre service teacher so go me for paying attention in the classes on differentiation", "Yes. But most 11 year olds won't think of that on their own, because lying is bad and most kids that age can't really see the nuance in dishonesty.", "He’s 11 and she should have tried to work with him.", ">Actually, from what I’m reading, he did not explain his issue.\n\nOP didn't give details of what was said -- but a) family-tree assignments are problematic, and b) he wasn't asking to not do the work, he was asking to change the specific details.  If he's embarrassed about family, he's not going to want to share details of why.", "Asking for an alternative assignment is a really assertive move for such a young kid. How could any teacher consider that lazy?", "Changed thanks", "Wait that’s all? Is there like a problem with them? It makes it really hard to side with you when he just didn’t want to talk about relatives. That sounds like a pretty bad reason imo. Why did you just go straight to the principal?", "Info: Would you have accepted a 50% grade if he got one?He one did half the work by not presenting.", "And what is the problem with that???", "INFO: I’m failing to see how this would be problematic. Did he lose a parent or sibling that he’s not comfortable talking about in front of the class? Does one of his grandparents have a sugar baby and it embarrasses him?", "So you could have easily made up crap and no one would have known.", "Of course. It was not my intention to be insensitive nor am I asking what it is that happened. I would consider that aspect more important that the grade itself but if mom already addressed it then my question is redundant.", "??\n\nThat's not what we're talking about. If the teacher is wielding a weapon or selling drugs to the children, you skip the chain of command. \n\nFor a grading issue on an assignment the kid had already turned in, the OP should have gone through the teacher first.", "What is the big deal about creating a family tree? The other 11 year olds are going to go researching the deep dark family history of another person. Literally a family tree is Uncle Bob married Uncle Allen they had Steve, Janice, and Albert.", "Also, based on the teacher’s responses both to OP’s son - refusing to consider any alternatives or allow any partial credit - AND in the meeting with the principal - where she refused to understand that there was anything wrong with her assignment, despite the principal clearly saying she found it inappropriate - it seems unlikely OP would’ve made much headway with the teacher one on one. Hard to fault her for skipping a step that wouldn’t have accomplished anything anyway.", "“Super vindictive” by standing up for their kid and ensuring that future students aren’t treated this way? Sure thing buddy.", "Bingo. Can you imagine if the children of the BTK killer were forced to present a family tree to their entire class featuring dear old dad? My god.", "And in Florida, kids whos parents are anything but straight.", "Teachers play favorites, just like anyone else. If they have a troublesome parent, teachers either go out of their way to avoid dealing with the parent, or cut the student less slack than they might otherwise. It all depends on how much support the teacher thinks they have from administration. \n\n\nSource: wife and several friends are teachers", "Thank you- that’s completely valid, NTA and shame on the teacher for wanting him to present that info", "Exactly! I feel like people are just glazing over that fact. The teacher didn't even give them a 50/100 for completing the family tree.", "How the teacher grades assignments is their prerogative. Not yours or OPs.", "It honestly could’ve been a phone call or an email that, after hearing OPs concerns the teacher realized she was being a little unreasonable, and they could have found a compromise without the escalation.", "After some more thought I agree with you and am changing my vote.", "It is actually worse because it is an 11 year old kid. The kid isn't going to have the forethought to lie about potentially problematic parts of their family tree. And the 11 year old classmates are much much more likely to be incredibly insensitive about it.", "> I hated feeling like a liar writing about my adopters and not actually knowing anything about myself\n\nYou have perfectly expressed what I (and so many other adoptees) have felt over the years about filling out family trees.\n\nI can remember being 6 or 7 and scribbling out the family tree in the back of my baby book because it made me mad, but I didn't have the words to explain why.\n\nNow I do, so thank you <3", "Yes! I always felt like a fraud since I knew NOTHING of my biological family. Aside from one biological grandma I was allowed to have contact with I had no idea how to fill out a family tree with her (found out later that my adoption was horribly traumatic and painful).", "What is YT?", "Day I was born assignments were the absolute worst for me as an adopted kid! I was abandoned at birth and know nothing about the first couple years of my life. It always made me feel like I was less than my peers.", "This one sounds like so much fun! Did anyone use a mix of fictional and actual people on their trees?", "OMG. Can you imagine what sort of looks their kids would have?", "Your school had a sign language class? That's neat. My HS neutered the language dept down to just French or Spanish the year I started(they also had Japanese & German before).", "I had to walk away for a moment, so I just posted that reply real quick, before I really thought more on this post. I found myself thinking what if someone passed from a violent crime, and then I read your background. FUCKING. SHIT. If that couldn't humble this teacher, it's just not possible. I'm so sorry your family has been through so much pain and trauma. \n\n>I almost wish we'd had this assignment when I was a kid. Would have shut everyone up.\n\nYou presenting that would have been the nuclear option, and I'm kinda here for it to get shut down that way.", "i did that when we got one of these assignments in high school. went through my dad’s side all normal and then started with the “this is my mother that kicked me out, this is my catatonic grandma, this is my uncle that killed himself because he was gay, this is my cousin that tried to kill me when we were 6….” looking back i don’t really think it had the effect i was hoping for", "I did this, when I left my paternal grandparents blank the teacher asked why so my 9year old self repeated what my dad said, \"grandma is probably dead and grandpa doesn't even know my name\". Got an A even with spelling and format errors.", "Heh. Back when I did the \"family tree project\", I did mine on a roll of paper. Rolled out sideways. That thing was about 50 feet wide.", "Battled my sibling to the death in utero sounds horrifyingly cool.", "Depends on the teacher. But sometimes kids don't even have all of that information, or they do and it's extremely complicated. Or it could be simple, like having a twin sibling that should be in the class with them but died a horrible or death or something, and kids have no filter and someone would've asked. Kids are also assholes and can latch on to anything they can possibly use to bully another, and a dead sibling or serial killer relative or incestuous relatives are all absolutely useful in that regard. For family trees, or genealogy, you generally have a bunch of levels and lines denoting relationships to each other, so some problems would be easily visible.", "Agreed. I was a single parent and my kid's bio father was not in his life at all.  This would have been a difficult assignment for him to do.", "Right? And if presentation is worth the majority of the grade I don’t understand why the kids couldn’t just pick a famous figure instead?", "In addition I find it a little strange that the principal said in front of the parent that they did not like the assignment.", "and then she doubled down, I hope the OP turned right around and went back to the principal!", "this is the typical. no one is asking someone to do deliberate background searches on their family to do these. it’s typically just immediately family plus some grandparents", "Teachers are professionals. Why can’t we be treated as such? Why do you need to go tell on us if you’re upset or frustrated? What’s wrong with discussing it with us first?", "I completely agree!\n\nHonestly I think using historical figures would be far more interesting than actual families, especially if you look at the ruling houses of Europe or the Egyptian pharaohs.", "Thank you! I'm dumbfounded by the all the Y-T-As in this discussion. \"You didn't talk to the teacher first!\"\n\nDid that teacher talk to OP about the problems the child was having with an assignment? Was that teacher willing to give even partial credit for the student who at least did the research and completed the family tree? No, the teacher went nuclear for no reason. I wouldn't have bothered to speak to her either.", "My point exactly. No one is seeing that the teacher still believes there's nothing wrong with the assignment. Either way the matter would have probably ended up by the principal.", "It could very well have lead to talking to the principal, but not allowing the teacher to be a professional or giving her the opportunity to explain her reasonings absolutely makes OP an AH.", "[deleted]", "There is no need to say it. People are entitled to not sharing families tree even if the have the best and more traditional family tree of the words. There is a right to privacy. And if nothing has changed in the last few minutes kids are people and have rights.", "That's not all that has to go on the tree, but that's the main problem. Eleven year olds don't generally like to give their classmates humiliating information about themselves.", "Family tree assignments are stupid when forced to present. You don’t need a traumatic reason to not want to talk about your family. Those assignments should never be forced to present. EVER. Unless you want to teach kids to either lie or have stage freight for a long time.", "My uncle sexually abused me and my sister when we were 3 and 4, that side of the family tried to cover that shit up and said unacceptable things about it.\n\nI WOULDN'T WANT TO BE FORCED TO TALK ABOUT IT FOR A GRADE, it is not petty, you don't know what happened nor is your business.", "Let’s say hypothetically one of the kids uncles was a mass murderer or a cousin molested his sister, should an 11 yo be forced to reveal they are related to that person?\n\nWhatever it may be, teachers have no place trying to force a child to reveal sensitive information.\n\nPublic schools, at least in the US, can be brutal enough with bullies, no need for a teacher to make it start or make it much more worse.", "Doesn't matter why he didn't want to reveal his family, if he doesn't want to reveal private information about his family he shouldnt have to end of story.", "Birth dates could reveal issues he'll get bullied for, like teen pregnancies. Maybe there's a death in the family that he's sensitive to, and - again - could get bullied for. Kids suck.", "Teenage parents. Couples with age differences. Close family members who died recently. Things that may not be a big deal to an adult, but 11 yo kids are cruel. Students get bullied for way less than that.\n\nHonestly, this teacher is either really dense or just plain evil. Like, requiring students to include details like this *and* presenting them to the class? Every reasonable teacher would hae known this would be bound to happen.\n\nWhich is why OP is NTA and did the right thing.", "possibly teenage pregnancy or questionable dates that the teacher then makes him explain. There are various reasons someone may refuse to share all his information with someone", ">Birth dates and death dates.\n\n* Teenage parents\n* Couples with huge age differences\n* Close family members who died recently\n\nIn short, things that may not seem catastrophic to an adult, but would be perfect bullying material for his classmates. Kids are fucking cruel.", "Who care he doesn't want to share his family information with his peers so he shouldn't have to. Get a grip", "I’m failing to see how it’s your business! It felt too personal or exposed him in an uncomfortable way. Use your imagination; I can think of several scenarios given the reasons the OP just provided. The OP is NTA", "It sounds like you are not failing at all to see how this would be problematic, since you have given multiple examples of things that might make it problematic.", "Yeah, he's eleven. Obviously \"oh, I'll just lie about who these people are and their lives because my teacher has no way of knowing\" is correct but not something he would think of.", "Could have, but he chose to show integrity and ask the teacher for a very reasonable assignment accommodation instead. Good for him for trying to be honest.", "That sounds like a bot comment but i cant check cus mobile so idk", "Kid might literally not know who one or both of their parents are, could be adopted, could have a family member that is highly controversial, parents could've gone no-contact for some reason, parents of classmates disliking what they hear about someone's family tree and causing problems, etc. etc.\n\nIt shouldn't be an assignment at all.", "Good point, these days doing this assignment in some places could literally be cause for a CPS call.", "Pretty sure the teacher didn't look his assignment before the due date if the kid didn't tell. It's a bad and thoughtless assignment for sure.", "Teachers aren’t infallible gods beyond reproach and need for change. They are human just like the rest of us…", "So it's good that OP went to someone who's prerogative it is then, right?", "Doubtful since she told the principal that she found no issue with her assignment", "I'm not adopted but my parents are abusive AHs, so these kinds of assignments were really hard for me. \n\nI'm a child of the 80s so we didn't have access to the amount of tech we do today. I fudged so many things like that and felt like an absolute fraud. It also made me feel more isolated because it never occurred to me that someone else might feel the same way I did.", "I have spent the last couple of years figuring out the why’s behind my feelings and making mental time to find words for them. It’s been a long emotional journey, but I am so so glad that something I said was able to help in any way!! I hope you gain more peace with it", "White. A lot of platforms screen it out automatically, so yt has become the code for it. I don't think reddit screens it, though.", "My Spanish teacher also did this, and one of the girls in my class put her actual family into the British monarchy. She even included where her family members would be in line to the throne lol", "We used to have Spanish, French, German, and Chinese I think back in like the 90s/early 2000s. During the recession they cut it down to just Spanish. Then they added in a few ASL classes at some point, the teacher had to make a petition to get one ASL 3 class added. I only took 1 and 2 cuz that's all that was available. When I took it there was only like 1 or 2 periods of ASL 2 and they were really small classes and we only had one ASL teacher.", "Thank you so much for your kind words.  We were very, very much not the only ones in that generation, and knowing that we were all determined to make sure it never happened again (\"Never Again\") made a big difference.  But yes, it was extremely scarring, down through my mom and dad's generation, down to our generation as well.  Still very immediate.  Again, I appreciate your kindness and empathy.  Thank you.", "Maybe not, but I sure as hell hope that it made the teacher who handed the assignment out rethink things.", "Same situation for my child.  When they tried to make him do it, I printed out a single parent family tree and had him fill that out and made them accept it.  One of the few times I've gone Mama Bear.", "Yeah, like if nothing else, let him do a private family tree turned in directly (like he did) and present the famous person one. He's doing all the work (actually researching and creating a family tree), and presenting the work (which shouldn't be a big part of a non-drama/presentation class anyhow, but that's my own peeve), it's just separate.", "Agreed. The assignment was clearly not great, and the teacher was wrong to not come up with a better option, it seems a bit like the teacher was thrown under the bus.", "I mean the son spoke to the teacher the teacher didn’t bother contacting the parent, so makes sense she went to someone else. The teacher could have found a compromise with the son. Why is she treating her student this way? The teacher could have also contacted the mother when the son brought up his issues with the assignment. So!", "Who would want to talk to a teacher who won't compromise with a young student who is obviously uncomfortable sharing private information about their whole family tree with their classmates? Are you really not understanding the situation here lmao", "Hahahaha your bias is showing. You're calling the mother an AH for the sake of defending a fellow teacher.", "I have no doubt of that. I can’t imagine brushing off a kid who asks for accommodation on a potentially sensitive assignment.", "Teacher had no issue brushing off the kid asking for accommodation on a sensitive assignment. She gets no sympathy points from me.", "The teacher shouldn't have created the situation in the first place.", "So what's so humiliating about your family then?", "The teacher isn’t going to make Anton explain that. And middle schoolers have very little concept of age. They still think their teachers are either 20 or 85.", "One of the other comments ask how the family tree would be exposing to the child and the OP said birthdays and death dates are included. There’s nothing wrong with asking for more information to better understand someone’s perspective.", "Was this an in class assignment or something he did at home? If it was home, why didn't you know about it? You could have easily contacted the teacher and are upset she didn't contact you, but yet you did the same thing.", "We are human and we’re professionals, we deserve to be treated as such. Come to us first before making our life more difficult, and going straight to the administration.", "No they’re not but you still don’t get to dictate how or what they teach.", "I feel you on the isolation part- I'm also an 80's/90's kid and adoption wasn't as common back then as it is now, so I was always the only adoptee in class and you're 100% correct that it's a very isolating experience.\n\nI'm sorry you can relate to such negative feelings, and I very much hope you have been able to build a safe and loving family for yourself out of wonderfully supportive people.", "Thank you, I am slowly working on rebuilding myself after a lot of trauma and heartache, and it's little things like this that help me on that path.", "Ohhh. Gotcha! Lol I'm still on 1920s slang, Ducky. Just a little behind the trends. 😉🤣", "As is tradition. Not saying the teacher was right here by any means, but yeah, the teacher will be the one to get thrown under the bus instead of, you know, supported to grow and improve in their craft.", "People could be in jail. In a religious community there could be multiple divorces. In a non religous community they could be quiverfull etc. they could not know who their father/grandfather is. They could be related to a prominent community member through an affair. They could have a family member who was part of a community scandal. That’s just off the top of my head.", "[removed]", "Seriously, how is that the business of any of us on reddit?", "Why does it matter? It's embarrassing. Tell me embarrassing stuff about your family.", "It’s not your business my guy. If OP says it’s not for sharing, then it isn’t. NTA", "Why are classmates en teachers entitled to that information?", "11 y/os aren’t dumbasses. They know understand age.", "Most 11 year olds are pretty self-sufficient with their homework.", "Diligent hard working kids often get assignments done without parents knowing what is in then.  At least one of my kids just went to her room, got her work done and turned in, and I rarely knew what the individual assignments were. She just did them.  Kids who struggle in school are a different story, of course.", "I don't stand over his shoulder while he does his homework. I leave him alone unless he asks for help and just check the gradebook to make sure he's on track with everything and talk to him if I see a low grade.", "I can’t tell if you’re 11, 21, or higher. But it’s pretty obvious that you’re just mad that your own mommy isn’t holding your hand anymore.", "I wonder how the kid felt when he went to his teacher with his concerns and she brushed him\nOff…", "As a professional you should know that asking a student to disclose private familial information for a grade is unethical and distasteful. \n\nWhen asked repeatedly for an alternative assignment this teacher chose to ignore an 11 yr olds request for help. \n\nAs an educator I am ashamed every time I read a story about a teacher refusing to acknowledge that each of their students comes from a unique and possible less ‘rosy’ background then themselves. \n\nOP had zero expectations of accommodation given the teachers response to her son. Further the teachers statements during the meeting (the grade shouldn’t be changed, there’s nothing wrong with the assignment) prove OP was correct in her assessment of the situation and that ultimately a meeting with the principal would be required.", "Teachers are held to to certain standards. They get to decide what or how they teach *within very tight reason*. They don’t just get to do whatever without scrutiny from either parents or administration. I’m not advocating for parental scrutiny in every aspect… just it is 100% their prerogative to advocate for their child.", "Lol, so you are saying they can teach whatever they want without any input fro anyone else?", "If it involves failing a kid who pit in honest effort then a parent sure as hell can challenge a grade or inappropriate grading method. If it wasn't problematic then the principal wouldn't have an issue.", "Adoption was not common at all, I grew up in a small, religious town and I do remember a friend I had, she didn't look like her parents or other siblings. However, I kind of didn't either so I just thought it was normal. I'm sorry you felt isolated as well, that's hard to deal with as a kid, even as an adult. \n\nMy sister used to tease me that I was adopted, I secretly hoped it was true and created a fantasy of my \"real family\" coming to rescue me. Part of me cringes at my past self thinking like that and part of me knows I was a child and it was my coping mechanism. \n\nI'm sorry any of us can relate to these negative feelings, it really sucks. I do have a great support system with friends and my spouse, and our animals lol.", "These sporadic moments of recognition can be so overwhelming sometimes. It’s a lot, taking an honest hard look at your own, oftentimes suppressed, relinquishment trauma. Is definitely hard..", "Their family could be polygamous Mormons and the kid could be attending an LDS school and not want to out their extended family members or talk about how grandpas 3rd wife was 13. Lots of weird stuff that could impact the kid’s life at school and at the end of the day are NONE of the teacher’s business.", "Oh I have one! It’s not embarrassing for me, but my aunt and uncle are PISSED I have an old photo album that my grandfather, their father, lists his grandfathers name… because apparently no one knew who it was. Also he listed his half brother who I guess wqs put on the census as a cousin, and like you would think I was living in 1920 the way my aunt and uncle lost their shot over this. Like…. Um great great grandma Mary is super dead, she doesn’t care I promise. \n\n\nAlso, my nephew doesn’t know who his dad is, I mean neither do I but how mean would that be to do to him? Kids are mean and who knows what they would say? It might not be embarrassing for us but if it hurts children and causes issues… and the teacher won’t do a work around? That’s sus af", "You never need to share things about your family if you're not comfortable, even if someone else does.\n\nIf I had to do a family tree assignment, I'd outright refuse. My grandfather had five wives, some at the same time, and we've only recently discovered 10+ illegitimate children. Not only that, but our extended family has disowned us because of his actions, so I literally wouldn't know what to do for this assignment because I have no idea who most of my family are.\n\nYour son did an amazing job sticking up for himself while offering a compromise. You should be proud of him.", "The fact that you're avoiding that says a lot.Embarrassing is subjective. Family tree. \n\nMy grandfather cheated on my grandmother, divorced her and married the mistress.", "Exactly. My son always did his homework as soon as he got home and before I was home from work. My daughter, otoh, needed a lot more supervision. Kids are different.", "exactly.  If the kid hadn't already talked to the teacher I would agree.  But unless the story is missing something it looks like they already tried that.", "It could be something concerning SA or insest. Just because it might be talked about openly within the family to support the victim, does not mean it should be available for public consumption or that an 11yo would be comfortable with that.", "Alright, I wasn't expecting you to actually give the info. Fair enough. It's the number of years between generations that is the main problem.", ">The fact that you're avoiding that says a lot\n\nYeah, it says exactly what they claimed originally. Did you think this was some 'gotcha'???\n\nYou're acting like a creep.", "Why do you think you are entitled to her family history. You are gross for pushing this.", "[removed]", "But none of that would be exposed on a family tree assignment, simply that a divorce and remarriage took place. OP has every right to not want to share that info publicly, and it’s really common with these projects that there’s a q&a section at the end of the presentation, meaning anyone could go “explain this” and it could get really uncomfortable. This could be anything from statutory r*pe to a bunch of people died at the same time in an accident that was traumatic for him/his family. I had to do this assignment in school and there were people who couldn’t do all the generations that were asked for due to loss of contact or formal documentation that got marked down. It doesn’t matter the exact reason there’s so many ways this could open a kid up to ridicule. Why do you feel the need to police an 11 yo on what he does and does not want to share with literally everyone in his class? He did the assignment too he just didn’t want to share that info publicly.", "Good for you admitting that on an anonymous forum.", "Heyyyy, don't feel the need to justify or explain to anyone who asks here.  I'm going to end up going through the same with my child.  We don't owe anyone an explanation.  We do, however, owe our children safety and stability.  The way your child said \"no\" sounds as if you've already taught him healthy boundaries.", "You don't have to share anything that makes you uncomfortable.\n\nBut if it makes you feel any better, my great grandfather was an abusive drunk with a whole other family on the side, and recently I found out I have a cousin I'd never heard of (the classic 60s teen pregnancy and shunned out of existence story). \n\nOh also on the other side a bunch of my family was kicked out of their home country for being rascals (criminals).", "OP, please don't feel like you need to share any of that information with anyone on this post.", "Thank you <3", "NTA and she did bring it on herself. A family tree is a fine assignment but kids shouldn’t be forced to present it. There are MANY reasons this assignment could be problematic for kids. The teacher is being insensitive and stubborn.", "NTA. I wouldn’t want to do this assignment because of my relatives. I don’t blame the kid. There should have been optional alternative assignments, like your kid suggested. \n\nTeacher is oblivious or cruel.", "NTA. It’s a weird assignment and very problematic. There could be a million things happening in someone’s family tree or family situation. Why is the teacher forcing kids to present this? I feel your son had a great compromise he did the assignment, but didn’t wish to disclose it to everyone else. Privacy is a right especially when it comes to private matters such as family. And if she had a problem even after that contact the parent. The kid tried to handle it very well. The teacher clearly didn’t.", "NTA \nTeacher here, that's an old-fashioned assignment anyway however; that's also not how a rubric is supposed to work. A presentation should never be the entire grade, as it seriously discriminates against students with autism, anxiety disorders, speech impairments and so on. \n\nAnyhow; NTA. Family trees are notoriously bad assignments to give, right up there with bloodtype testing and weight measurements for BMI index calculations.", "Daaaaaamn I’m a former teacher and was ready to JUMP ON THIS and say y t a since these days parents don’t want to hold their lungs accountable so often. You are 100000% in the right and she was very very wrong. \n\nI’m so glad you stood up for your son. I hope she learns a big lesson from this.", "NTA, I remember doing something like the that in elementary and the social nightmare that followed. My stepfather is my father's brother. I was naive and didn't think much of it, the bullying and incest rumors that followed ended in therapy for me.\n\nTeachers are in part caregivers as well as educators. She showed no understanding at all.", "Teacher is an asshole. Assignments about your family are always problematic. Teachers either need to avoid them or offer an alternative assignment.\n\nI would've done the same thing. Clearly the teacher is an issue since she wanted to argue even after the principal made their decision.", "NTA at all. She reminds me of my sisters teacher who, once confronted with the dictionary to show she spelled a word wrong, claimed the book itself was wrong and not her.", "NTA.\n\n  \nAlso, agree with another poster who said FUCK FAMILY TREES.\n\nThanks to me and one other parent kicking up a whole mess of whoop ass on my son's elementary school over an absolute ridiculous \"family history\" research packet they \"had\" to do in 5th grade and present at FAMILY NIGHT they no longer do that project.  Now they can research any historical figure's ancestry.\n\n&#x200B;\n\nNOT EVERYONE HAS A PERFECT FAMILY JANICE.", "When I taught high school English 8 years ago we had to “triangulate” and weren’t allowed to say “no— it must be in the format I demanded. Kids didn’t have to present or even write, they could communicate their understanding in a conversation. It made things tricky, considering I was supposed to be teaching presentation and writing skills. But those were the rules even then. \nAdded on that this was an insensitive assignment, that she gave a 0 and didn’t just take some marks off for the presentation part, that she showed zero flexibility= absolutely she’s TA.", "I had to do this assignment once in 10th grade for psychology class. I was completely stumped. My family's complicated and I only have so much information for one. like this mother, mine objected. Now that I think about it, what the FUCK does a family tree have to do with psychology besides the distinct possibility of inheriting mental disorders which a lot of families are not willing to share in public? The mother is NTA in my book.", "This is such a stupid assignment. There are kids who don’t know their bio parents, who have people that they are distanced from in the family, who have been abused, who were orphaned, who have been in foster care\nNTA\nThis assignment is insensitive at best.", "As a former child welfare worker- FUCK THIS WHOLE ASSIGNMENT. \nI don’t even understand that point of this type of thing being a school assignment. But in the year of Dolly Parton, 2022, why is this still a thing schools do? \nNTA.", "I think I would crack this one back open with the principal after the crap she gave you after the meeting.  Certainly worth a follow-up email to let the principal know what she said afterward. Uncalled for and highly unprofessional.  You are NTA.", "nta. I had a teacher do something similar. I bit the bullet and presented my biological family tree (I'm adopted), based on the very little I know of it. \n\nApparently telling a class of 12 yr olds about your 54 yr old pastor father raping your 14 year old mother will land you in the principles office.", ">\tAs I was leaving the teacher asked me to contact her directly in the future when I have a concern. I explained that I didn’t feel comfortable doing so, because of her actions and failure to communicate with me when the problem first arose. She tried to blame my son, but I pointed out that she is the professional and he is eleven. She said I needed to teach my son accountability and not try to blame everyone else when there’s a problem. I was mad, so I left before I could say something mean. I know she thinks I’m an asshole because now her assignment has to change, but I feel she brought this on herself.\n\nThat would’ve been the moment I stopped leaving, and marched right back in the office and said that apparently this talk wasnt over.\n\nNTA", "NTA. I've been there and in basically resulted in oblivious me trauma dumping on my 5th grade class 🤦You've potentially saved a lot of kids from the same embarrassment", "Who do I put for my (x relatives) parent? The one who raised her or the one who parented her through infidelity? How many ex step-parents do I add?", "When I was a teenager, my ex SIL and ex BIL got married.\n\nTheir kids became cousins and step-siblings, and the parents step-mum and auntie etc.\n\nMy family tree disappeared up it's own anus.\n\nWhen my son had to do the family tre thing at school, I pruned those branches off, it was just too embarrassing.", "NTA - teachers these days should know better than having kids do family trees, punnett squares, or blood typing. There’s always going to be at least one kid it’s going to go down really badly for.", ">She said I needed to teach my son accountability and not try to blame everyone else when there's a problem.\n\nSeems like this is a lesson she hasn't fully taken in herself, since she's blaming an 11 yr old for getting her in trouble with the principal. What a b\\*\\*\\*\\*.", "You know, even as a parent I didn't think there was going to be any way for you to be NTA, but hot fucking damn you are DEFINITELY NTA!!!! \n\nI have the awkward moment where my paternal aunt married my maternal grandpa, and I would NEVER have presented that in any grade of school cause kids are dicks. I was lucky and always about the top 10 tallest kids in my school, so I didn't get bullied much at all, but I know damned well that would've changed if I had to explain my gram-aunt in a classroom -.-", "I've taught family member lessons many times, and the #1 rule is that it's delicate AF. Some people have bad stuff at home, and you don't know. Some people just had a relative die, and you don't know. The topic is heavy.\n\nOf course there are ways to cover the important subject matter, but students always need freedom to shift away from certain topics.", "Nta. Any teacher with a shred of emotional intelligence could have seen obviously there was an underlining issue and should have reached out to. She either has no emotional intelligence or she's just plain mean", "Agreed.\n\nWhen I was young (like 8-11), I was severely bullied and developed absolutely horrific anxiety and panic attacks. Especially when I had to do public speaking because whenever I did it, the bullies just used it as extra ammunition and that week would be even worse.\n\nWhen I was 12, I had to do a verbal presentation on a book in English class. I had the presentation all done, but when the teacher called my name, I just panicked and froze. I couldn’t have moved for anything. Ten million to just stand up and I wouldn’t have moved. \n\nI didn’t have any equivalent of an IEP or the like. They didn’t really exist in my school back then unless you had something like dyslexia.\n\nWhat did my teacher do? Took the cue and moved on. Asked me if I was OK after and just graded what I’d written for the presentation.\n\nDid I get an A? Of course not, I didn’t do the presentation. But I got a solid C, only a few marks shy of a B, because the meat of the subject was all there, and it was an English literature class, not a public speaking class.\n\nI was so glad of that teacher for not just pushing it. I had a silent freeze rather than getting pushed until I had a full on sobbing freak out.\n\nOne of my teachers when I was older pushed me that far. I was off school for days because every time I thought of going back in, I’d panic because I thought I’d run into him again in a corridor. \n\nGuess which teacher got a present when they left and which one I hated and had my head of year ensure didn’t teach me the next year?", "Right? Like the fact the principal flat out told the teacher that they needed to rework the assignment for future years or stop doing it entirely, as well as deciding to *grade it themselves* speaks VOLUMES.", "The kid even made MULTIPLE attempts to fulfill the assignment, independently. \n\nI wish there was a judgement for not only NTA, but YFA - you’re freaking awesome, you and your son", "This was my first reaction too but when I read the while thing, yeah, the teacher is an asshole.", "We had this problem with my son one year. I was a single mom and he had no contact with his dad. The assignment was both sides of the family and we had no way of completing it. The teacher let him decide if he wanted to use a historical figure or just use our tree as is. He went with the historical figure. No issues, no pressure. I don't know why this kid's teacher wouldn't allow it.", "Reasons why family trees could be problematic: \n\n1. Child of Rape \n2. Incest\n3. Adoption\n4. Large families \n5. Criminal family members \n6. Abduction / slavery \n7. Immigration/ asylum seekers \n8. Private person \n9. Not knowing anything at all, like nothing. \n10. Very young parents \n\nHow are these assignments still given out?", "I was a middle school science teacher, and assigned this during my genetics unit in my first year. **NEVER AGAIN!!** I had mothers calling me, crying, and telling me that they had never told their kids they were adopted, and I \"ruined\" their families. I had kids whose parents had married and divorced numerous times, and who couldn't remember how many siblings, bio, step, and half, they had. I had kids whose families were not in contact with grandparents, aunts, uncles, etc. It was a nightmare.\n\nI felt so badly for these kids. I dropped the assignment altogether, and use my experience as a cautionary tale when training future science teachers.", "Former teacher here and I would NEVER do this. Too many kids have rough home lives, or, they just don’t want to share that info with their classes and that’s okay!! OP is NTA", "It is usually a staple in foreign language classes I've taken. As a visual learner, they do help to learn the terms. BUT every teacher I've had since high school has allowed you to use another family to compete the assignment. You want to use the Royal Family? Go for it. You want to explain to your class how Philip J. Fry is his own grandfather? Have a blast. Just use the proper terminology", "Personally, I don't think there's anything wrong with doing a family tree assignment, as long as it isn't handled the way this teacher chose to handle it. If teachers say upfront that students can do family trees for fictional or historical figures instead of their family, then I think it's okay and encourages students to think about roots. It may be less useful for students without typical family trees, but most of school isn't going to be useful for every student. You teach a bit of everything so students can find what interests them, and family trees can be very interesting as long as no student is made to feel shame for not having a family they can, or would like to present.", "Totally agree here. My son was assigned one in K. Due to my dad’s constant philandering, I have multiple groups of step-siblings, some of whom I consider family and some I do not, as well as half-siblings. My husband’s father signed away his parental rights so he could be adopted by his mother’s *severely* physically abusive second husband, who only wanted to adopt him bc he considered it an embarrassment to have another man’s child living in his home. We didn’t want to even have to begin explaining all of this our then-five year old. Our response to the assignment was to have each member of our immediate family (me, my husband, my son, and his brother) paint their name on a lightweight wood sign blank from the craft store, and paint it as they saw fit. We strung those together with eye hooks and fishing line, and that was our family tree.", "I’m adopted and I had to do a “baby journal” for biology class where I was supposed to talk about what my parent’s did to prepare for my birth along side explaining the biological stages of fetal development. \n\nI tried to explain to the teacher that there was no way for me to complete the “parent” half of the assignment. I had a closed adoption when I was 6 and previously had been in foster care for 5 years. No contact with older biological family - siblings only. \n\nI just ended up making it up because he seemed scandalized by my first draft which had “did meth” at every stage. I was put into the system because my parents were drug addicts. My siblings and I were all born with meth in our systems.", "I am a teacher who does a family tree assignment as part of my curriculum. I always make a HUGE point of letting my students know that they can do a famous family, a historical family, a fictional family, and ideal family where they marry their celeb crush, any kind of project that illustrates any kind of family structure. And, presenting should be part of the rubric, not the whole assignment. I do, however think OP should have approached the teacher first. If she didn’t listen or respond, she would have every right to go the principal, but give the teacher a chance.", "As an adult, it’s STILL giving me ptsd even thinking of doing a family tree assignment for my therapist.", "I had a somewhat similar assignment at one point that I did literally only once because I saw how it affected certain students in ways that were uncomfortable and painful. I don't get why teachers double-down like this when it would be ridiculously easy to accommodate or change the assignment so that no student is struggling with it for reasons other than comprehension or work ethic.", "I truly don't understand how a family tree for yourself vs a historical figure presents any differently. If the rubric is to grade on presentation, it shouldn't matter if you're related or not.\n\nAgain, for those in the back, FUCK FAMILY TREE ASSIGNMENTS!!", "Wow healing top response. Bless 🙏🏼", "As a social worker who has worked in the foster care system, AMEN!!!!!!!", "I remember stressing out doing one in elementary school because I wanted to include my stepdad and that side of the family and having trouble figuring out how to make it work spatially on the page. And that's not even with trauma that could come from adopted families and nontraditional families.\n\nLike if you're raised by your grandmother because your mother isn't in the picture, should she be in the mother or grandmother position if she was more of a mother to you than the one who gave birth to you? What if you're in foster care and you don't know if you should include them and how to include them? What if you were born via surrogate and it's a complicated situation where part of your DNA came from another family member?\n\nFamilies are too complicated to fit neatly on a tree", "I'm willing to bet this is what the principal wanted to say to the teacher after the mom left. Those assignments are inappropriate.\n\nAnd NTA OP.", "Plus the kid is 11! If he gets an \"unfair\" A or B on the assignment it's not like he's knocking some other kid out of Harvard. No one will even remember this in a month or a year, unless you cause trauma to some kid by being an asshole which this teacher did.\n\nI'm a teacher and I wish people had more perspective.", "yea it’s honestly so stupid", "Am I the only person who never had one? I remember a couple presentations about the family members you live with but never a full family tree", "The only thing worse than family trees were genetic assignments. \n\nAnd having to present in front of the class? Forget that. I don't want to have to explain why my features don't match my mom's", "My first thought. Like, what if the kid’s dad abandoned them and they had no info about that side of the family? What if mom doesn’t know who dad is for whatever reason? What if mom left when kid was a baby and the child doesn’t have that info? Adopted kids? Kids in foster care who have been in long term? There are 1,000 reasons that a “family tree” assignment could bring up trauma for someone, especially a child, and they ABSOLUTELY should not be forced to out themselves like that in front of their peers.", "When I do them I always say you can make it up or use a fictional family. I got a lot of Simpsons family trees.", "Our teachers always gave us a choice: our own or a historical figure. \n\nFor those who had struggles (whatever the reason), they were allowed an alternate assignment. And no one had to present if they didn't want to. I'm so thankful for the teachers I had. The zeroes I got were earmed fair and square. (I flat refused to do an assignment and momma said she wouldn't make me, but if I didn't, then I earned the goose egg.)", "I was so lucky to move schools just at the right time to never have to do a family tree", "I do them as a project/presentation in my World Language classroom. \n\nHowever, I tell my students that they can talk about their actual family, or make up their fantasy family from famous people, or just completely make it up from their imagination. \n\nI also tell them that it doesn’t need to be their immediate bio family even if they are making it up.", "Dude, my family tree has incest in it. Recently. I would have actually *died* if I had had to do a whole presentation on that one. That teacher is… let us politely say, very ignorant.", "Fuck them so much. I spent time in foster care and was adopted, Ive struggled my entire life with not knowing anything about my biological background and feeling like I don’t really belong or fit in anywhere. These assignments were such a fucking bummer and always made me feel stupid and were a reminder that I was “different”\n\nI hadn’t thought about this shit in a while, it’s stupid but this kinda bummed me out honestly lol", "Yep. My family fled Italy when my mother was a child so I literally can only go back to her grandpa, my great-grandfather. That was never enough for my teachers. I dont even know what their last name was before leaving Italy and nobody is alive to ask anything. And on my father's side I just don't have anyone to ask. Nobody alive. So those assignments are just garbage.", "I’m 1/4 shawnee. Try doing a family tree when you’re Native American.", "Absolutely agree. What a stunning violation of privacy, both the child's and their parents'.", "When I was 15 I lost my nana. And there was a family tree we had to present. To this day I am thankful that my teacher said I could do it privately rather than public. She didn’t wanna give me the zero but she knew how much my nana meant to me. THIS SAME TEACHER told my niece just last week she didn’t have to do her family tree presentation and that is it was too hard to even do she didn’t have to and she would give her a pass. My sister was her mom and she killed herself at the beginning of the summer. I immediately messaged that teacher and thanked her when I learned how gracious this teacher STILL IS!!!", "As a teacher in a tough primary school I agree. The title made me think she was an asshole but the background info made it very clear she is NTA", "YES, THANK YOU! If we are going to keep doing this bullshit homework teachers should be able to open up to diverse families and dynamics and situations. \n\nOP NTA, the clarity with which you faced this is top tier parenting.", "Hey, I’m an actual genealogist and I STILL say fuck this assignment!\n\nIf it’s a thing that interests a kid or whatever then maybe mention it to the parents, and offer resources to encourage the kid.\n\nBut like my own spouse is adopted, and even though they never felt like anything was “missing”, they’ve said it was sort of an awkward assignment for them.\n\nAnd I used to have a good friend who was adopted by her grandparents who later adopted two of her cousins, who were in fact half siblings.  She always knew the truth of the situation and was open about it, but building her family tree is complicated as fuck!", "Thank you. Estranged from both parents and this is always a painful assignment when my kids bring it home", "My parents were in a messy separation when I was 12, it was essentially when I became an adult due to them just giving up on parenting me- and the same year I was asked to do a family tree. I refused to do it, and thinking back I remember not being able to articulate *why* I didn't want to do it. It took me years to realize that the very last thing I wanted to do was devote my time and effort into a project about people that could give two shits about me. It hurt. And I was so incredibly angry about it. But I couldn't express any of this, the only thing I could do was act out and tell the teacher she was SOL because I wasn't doing it. I got a zero, and I wasn't fortunate enough to have a parent that cared enough to find out why.", "Just to reiterate what everyone else is saying...\n\nI had this same problem early 15 years ago because my family tree isn't exactly simple and there are parts of my family tree that I'd prefer to not discuss. Fortunately, I had an understanding teacher who allowed me to choose what to include. However, this family tree assignment was a very uncomfortable assignment for me regardless. Making a young child recall trauma just for a stupid assignment, why?? Plenty of kids have complicated families, whether that be because of divorce, adoption, abuse, imprisonment, death!!! I don't understand why a teacher would even think this is appropriate considering all the issues that could arise. It makes me so mad that I had this issue so long ago and teachers are still doing this.", "Right? God there are so many ways this could be a disaster. I mean adoption where kids don’t know their bio parents, kids who are in foster care and were removed from their bio parents home, kids born to teens, kids that are the product of r*pe and in*est. the list just goes on and on and gets bleaker and bleaker.\n\nWhat is wrong with this woman? I mean this teacher does realize not everyone has a happy home life and not everyone is born into a happy family or comes into this world under good circumstances, right?\n\nLike I get this assignment 5 or 6 decades ago when the nuclear family was thought to be the only type and that was that but how does anyone with a semi-functioning brain and access to\nA news feed not see that this might be bad for some people?\n\nHow dense and sheltered do you have to be not to see there could be issues here? How can someone teach (what I’m assuming) in a public school and have never encountered a kid with a troubled background?\n\nNTA- good for you, if this woman is this clueless to the realities of the world she has no business teaching.", "I agree.. I remember having to do this assignment as well when I was 12/13.. a year after my mom had passed away and I lived with my godparents. I did it on my godparents family I think (my mom was adopted and our family that I knew was my mom, uncle and aunt, cousin and grandpa and grandma) and I didn’t know my dad 🤷🏻‍♀️ it was heart breaking, I also hate having to do mothers and Father’s Day stuff at school.. I didn’t want to do a Father’s Day thing and my teacher made me and told me to do it for someone else.", "I wasn't adopted, but my family is weird and when I had this assignment growing up, I remember my teacher graded me way down because my tree didn't go back far enough. Both my mom and dads side I can only trace to one set of great grandparents and only my grandparents otherwise. We immigrated from Europe and lost basically all family records. \n\nThe whole thing pissed my mom off so badly but she didn't have the balls to do what OP did.\n\nOP NTA and thank you for standing up for your child", "Right?!?  And what about kids who may be related to historical figures who did bad things?   No child should have to detail and present something they are uncomfortable in sharing.\n\nAnd at the end of the day...DNA means very little when it comes to the concept of family. \n\nOf all the entitled parents in the world , OP is not one of them and is NTA.", "TF even is the point?\n\nAlso, as for him not being allowed to do a historical figure, could she not take a few minutes to find a historical figure who DOESN'T have a readily copy able family tree online?", "But also, what is the point of a family tree? What do you actually learn from that? I do not get it at all. Such a pointless, insensitive and normative assignment", "My daughters are adopted and my mother once tried to say something about them not belonging in the family tree and I absolutely lost my shit. \n\n1. I’m the one who actually does the genealogy research in our damn family.\n\n2. Direct lineage is quite literally only a thing for royals and we are most assuredly not. \n\nI told her that bloodlines were only important in kings, queens and horse breeding. I love her to death but if she or anyone in our family ever said something like that to my children it would be the last time they spoke to them or to me. \n\nThat was almost ten years ago and it still make me so mad I could spit. I know their lines on their biological sides and on mine. \n\nMy dad was raised in an orphanage. I didn’t even know who his parents were family trees sucked when I was in elementary. There are better projects.", "It’s really gross too that he got a 0 and no credit even for the assignment.\n\nIn college i had to give the intro to a presentation to foreign government officials with another student and that same day, about an hr before, i found out that my house may be evacuated due to a fire in the area. \n\nI called my folks and told them what i wanted them to grab then I realized that it was fucking stupid that i was expected to give a presentation when my house may burn down. I emailed the teacher and bailed. Teacher said they completely understood and gave me full credit (i helped with the script and digital assets i just didn’t present).\n\nThis kid can’t even get credit for physically making the assignment? Bull.", "I'm not adopted, but my mom's side of the family is a mess. Like... my grandmother left my baby mother alone at home at night to hang out at bars (I'm talking the 1940s here!!). Grandfather, who was working in another city, yeeted my mother and gave the baby to his sister to raise. Which my mother subsequently called \"mom and dad\", but weren't her bio-parents. And her \"brother\" was actually her \"mom and dad\"'s grandson.  \n\n\nA hot mess indeed. Way too hot a mess for a kid. Much, much later I found out that my bio-grandmother had another child with another man and none of my family ever learned about my mother's half-sister. Wtf. Sincere lack of interest from bio-grandmother to my mom.", "This is why, when I had to cover family structures in social studies, I would have students do an \"important to me tree.\" They could put anyone they felt was important to them on it, whether they be family or friend. I used to run out of my leaf cutouts because students would go nuts adding their important people to their trees! They didn't have to say what their relationship to the person was, all that was important was that they felt the person was important.", "Even disregarding the inherent bias of family trees as an assignment (i.e., the assumption that everybody has a straightforward, close-knit biological family unit), it would be so very easy to compromise on the assignment in this scenario. If she was being truthful about the rubric, she could've just had OP's kid e-mail her the personal family tree for the research component, and then present a celebrity's family tree for the presentation aspect. \n\nHer response to this situation, including her confronting OP afterwards, strongly indicates that the zero was a punishment and a power play because she was upset that OP's son didn't simply do exactly as she decreed. The fact that he did the family tree and sent it to her at all should've guaranteed him a 50% at the very least, since by her own argument that was half of the point of the assignment. There's no logical reason to give him a zero unless it's as a punishment... and even if he deserved that punishment (which he didn't), the teacher should have at least attempted to reach out to OP to find out why he felt so uncomfortable with the assignment in the first place.", "I would have failed this too, and trauma, yeesh. Mine would have been me, my mom, her parents. That's it.  Didn't know who my father was at that point, and I would have refused to put my stepdad on it - by age 11 he had drunkenly reminded me I was nothing more than my mother's b\\*st\\*rd and to stop calling him dad.  My grandparents refused to talk about their history and died when my mom was young, so...", "Thank you. I'm not adopted, but I come from a long line of alcoholics (I finally broke the cycle and have been alcohol-free for almost three years), and all of my grandparents were dead long before I was born. My mom's parents were both dead by the time she was 16. My parents can't remember much about their grandparents, because everyone was drunk and beating each other constantly when they were kids. Whether they can't remember due to repressed memories or their own alcoholism/mental illness, I don't know. Fuck family trees, indeed. \n\nOP,  you are NTA.", "Yes. This. My parents were divorced and trying to explain that I had biological, step, and half siblings and who lived with who always made me uncomfortable. I have a great family and had a good childhood, but I hated explaining my family to people and it embarrassed me for some reason. I would have been mortified to have to stand up in class with a diagram about it. \n\nSome students don't want to discuss home life with their peers and they certainly shouldn't be graded on it. \n\nIf the teacher just really wanted presentations, she could have made it bonus points or made an option for the student to do a family tree on a famous family.", "This assignment is just a can of worms waiting to be opened.\nA child refusing to do it in this case is one of the better outcomes.\n\nImagine a presentation: \"Now you might notice the maternal side is quite large. Well, my grandmother was raped by a famous criminal who assaulted over 100 woman and has multiple childing resulting from the rape, so I have included them as they are technically part of my family tree. Though as you can see most of the branches end due to suicide.\"", "See, if I set this assignment I’d tell them it had to be made up and they have to do research to make their family anecdotes seem believable. \n\nUncle Stephen Fry loves a sherry at Christmas, but he always falls asleep after pudding is done!", "What I don't even understand: we had some presentation over some sensitive topics back when I was in school, and during those we always had the choice: do your presentation in front of the class, or do it privately with the teacher. \n\nI wouldn't like to share about my family in front of the class; I would have probably improvised people's name and all in it instead of asking everyone.", "This is up there with science teachers having their students do Punnett squares using their own families and genetic traits as data.  Science class is not where you want to find out your dad is not really your dad because your blood type is impossible based on your parents’ blood types.", "Seriously. If I had to do that as a kid, I could do my maternal side (not my mother's father's side though, lol) but I can't do anything on my father's side as I've never met him and the information I've been given by my mother is very limited. It would have made me feel awful, and honestly, it still would now.\n\nNTA", "> If the presentation portion was 100% of the grade, why would it matter if he copied something from online? \n\nI’m an English teacher. I’m not saying the assignment doesn’t suck. The assignment sucks.\n\nBut it’s very common for standards to require that students (at some point) present original work orally in addition to written papers or projects. The standard(s) this assignment is intended to address may indeed be phrased in such a way that some form of “research” (I know, I know) or *some* original product must be presented rather than just reciting plagiarized information from a card. Even a rubric that otherwise gives credit for content may consider the assignment ungradeable if the point is an oral presentation of student-generated material. \n\nAgain - many teachers are terrible at translating standards into meaningful assignments, and this one sounds substantially useless and poorly-considered. But the part of this task that is “no, you may not read a print-out from Google where other students personally organized a set of information based on oral conversations and direct information-gathering from people they know” is probably not the part that is crazy.\n\n(Obviously, OP is NTA.)", "The criminal thing really speaks to me. I have a brother who is in prison for murder a few counties over. Everyone has seen the stories, we have the same last name and we both look just like our dad. I wouldn't want to talk about ANY of that.", "That teacher was a fucking racist", "Presentions are hard and they get worse with things like these- family trees are close and private things to most kids. For my class we had a paper we’re you could talk to a parents about an important event or do a small research paper about someone else talking about it. Cause yknow some of us don’t get relationships with parents", "I was wondering why anyone thought it would change things. If you went to the teacher it would have escalated and then it just feels like she may have said something along the lines of “why couldn’t you just accept the respond I gave you?”", "Your concern is valid but a child with a speech issue could have an IEP and if they dont that may not be the teacher's problem. We also don't know if the grading was based on quality of presentation  or if the presentation just needed to happen.", "As a teacher also I agree. That she didn’t understand there was an issue even with the principal saying it’s a problem and doubling down shows me she would not have seen the light if you’d gone to her first. Sounds like she’s going to have an interesting meeting and I don’t envy her, she brought it on herself but it’s not a good feeling. Either way NTA she’s the one who dropped the ball on communication when she gave a zero to a probably fifth grader without ever going to the parents when an 11 year old expressed distress over an assignment. Gross. She’s definitely ta.", ">Also, as a teacher, I want you to always contact me before you contact my boss. It’s just professional courtesy.\n\nSure, but if a teacher has already shown a lack of professionalism, why should the teacher still be expected with professional curtesy?", "Same thing my german teacher did! We were told to put ourselves in a fictional or celebrity family tree to practice the words for family members (brother/father/cousin/etc). Makes things more entertaining and avoids the shitiness that comes with real family trees for kids with complicated families.", "My neice and nephews school has a family tree project but you have the option to do the same, I think it is so much better then forcing the kids to use their own families especially when they may not have the best homelife. The teacher also doesn't force the kids to present to the class if they don't want to. My nephews best friend actually did one titled my chosen family and it was about my brother and SIL and their other best friends family as well because his parents aren't exactly the best but he has his chosen family and he says thats all that matters.", "Thats what my highschool french teacher did! So long as you were doing the work, she was perfectly ok with using a fictional family. Family tree with description written using french.\n\nI remember using the Jetsons instead. Was much easier than figuring out paternal side when we were black sheep on that side in kinship and foster care homes.", "Like a family member who was a founder of the local KKK chapter back in the 19th century. I'm sure that would go over well!", "There were so many things I didn't know until I was an adult. We do a bunch of genealogy in my family as a hobby, and some of what was hidden to me as a kid totally go smacked me.\n\nThe great aunt who died of infection from a self-induced abortion because it was the Great Depression and she and her husband couldn't afford another child. Her husband could not both work and care for 3 small children, so her death essentially orphaned them.\n\nThe great great aunt whose husband died before I was born, but who had a full set of KKK robes hanging in the closet.", "Also even in terms of the education aspects i find it hard to believe there would be equal benefit across the board for the students doing it and it would absolutely be vastly different levels of work for different students depending on the size of even just their nuclear families. I knew a guy in highschool who was one of 12 siblings whos parents on one side was also one of 12 siblings. I also knew people who were single kids born to single kids. Its just inherently flawed as an educational tool", "I had a single teen mom & didn't know anything about my Dad. My grandparents were estranged from their families so my family tree barely existed. I had to do family trees a few times in school & every single time, I wanted to die on the spot.\n\nDidn't help that teachers would always comment \"That's it? You don't have any more family?\" Like... I'm sorry?", "Yea my kids have 3 grandmas (4 when we were still talking to my dad and his wife,) though lately its been complicated with the bio grandma.", "I remember being told by my teacher in Science class that I could do the family tree but that I couldn’t be on it because I was adopted! Time to get rid of these awful assignments.", "Yeah that's so damaging. One of my close friends in highschool lived with her grandparents, I'd been to their house loads of times, etc. I remember one day when the two of us were hanging out I asked her if her Nan and grandfather were on her mother's side or her father's. She went really, really quiet, thought about it, and then quietly revealed to me that her grandparents (who were always a foster home for babies/toddlers as long as I knew her) were actually her and her sister's foster parents who ended up adopting them & raising them to adulthood. It struck me how difficult ignorant (innocently ignorant, but ignorant nonetheless) questions like mine are for people in that situation. \n\nI didn't grow up in the town I went to highschool in, so I have no idea if this friend ever had to go through a family tree assignment or anything like that, but I am very sure that she would have coped with an assignment like this in the same way that OP's child did. It's such an inappropriate, inconsiderate and alienating kind of assignment to be a school assignment, I'm kind of shocked that this kind of thing would be an assignment - especially one for PRESENTING, and much more shocked at the teacher's extremely childish, callous, and inconsiderate handling of the student doing this clearly distressing assignment in a format that they could cope with doing. The kid still did all of the work of this awful assignment ffs! They just refused to do the traumatic presentation of it - they still fucking *did it*.\n\nIf there's anything that educators *should* be, it is considerate and open-minded. Those traits are far more favourable in this field than intellectual prowess or capability. Matters less for profa than teachers, but I would argue that it is a quality that is fundamental for the function of educating in all cases (and in my personal experienc.)", "Also, parents who don't help their kids with projects", "+ domestic abuse situations (maybe under the umbrella of number 5)", "Imagine the kid who comes in with a full run down of the Targaryens. 😂", "Her only defense about not doing an alternative was that the student could just \"look it up on the Internet\". All instruction is supposed to have a point; I doubt the learning goals were \"talk to your family so you can learn more about your past\", present that to your fellow students (regardless of the circumstances). Probably more like, research, prepare a tree, and do an oral presentation about what you learned. Teacher is absolutely tone deaf. Her behavior after the meeting was bullying. I'd have marched right back inside to talk to the principal. She argued about not changing the grade, why in the world would that have been a good starting point? She clearly needed a third opinion.", "Or he submits the real tree to her privately (to show he did the work) but presents a historical one to the class. If “talk about your personal family situation to the class” is a specific requirement then it needs to DIAF.", "Game of Thrones would be fun….", "Honestly, I think it will take one child literally doing that before this teacher Ever even considers some lives should not be thrown out into public scrutiny and the hell that is children.", "Yeah...I remember one real asshole of a history teacher who wanted some absurd amount of detailed family history until one of my classmates asked if we should include all of our polygamist ancestors' other wives and their children or just the ones directly related to us (this was in Utah so it was a valid inquiry for a lot of us). Then they suddenly realized that that amount of detail was \"probably\" unnecessary.", "I know right.  My grandmother died when my mom was born and she had 7 step mothers by the time she moved out.  That tree branch would collapse!", "I had to do one for a college anthropology class and the rules was you had to do your own family from your great grandparents down with at least 10 people OR you could chose to do a historical figure but you had to do all the research yourself including the proper anthropological definition of the relationship as well as any social obligations and then present it to the class.  \n\nBut yeah my grandmother was one of 9 and my grandfather was one of 11. Then my mother was one of 7 and most of her aunts and uncles also had large families. I had to go get special paper to put it on but I included the infancy deaths, the suicides, included the multiple that had been institutionalized,  I included the 2 cousins who married each other, all the divorces and remarriages. I included everything. Then I volunteered to go first, took up 35 minutes of a 50 min college class just reading the names, designations ,and doing my social obligations by groups, and 2/3 of the class had to present the next week so it gave people more time to do theirs. But that was in a college elective, communicated at the beginning of the class that it would be a project, and they still let us have an alternative. I also had an unfair advantage that I have an aunt who's really into geneology so the list of family was easy to obtain, I just had to do the designations and document our social relationships. \n\nOn that note my poor kid if he has to do this down the line. My bf's the only shared child of 2 people who had families outside of him as well. He's got 7 1/2 siblings and another 4 step siblings and that's just his generation. His oldest sister is 55, and his youngest is 23.", "That's how you do it though. Go big. Make that thing gruesome. That'll make the teacher rethink it. Showcase that people have trauma.\n\nSucks that it takes all that though and a (probably kid) with enough cojines to pull it off.", "Why wouldn't you put those people in? A family tree isn't a full life story of every family member, it's simply who was born to who on down the line. The fact that your uncle committed suicide and your grandma's lobotomy would be completely irrelevant and not be included at all. Your aunt who died would be listed as born to whatever set of grandparents and then have a death date.\n\nDo people not know what a family tree is?", "What kind of family tree requires you to describe every gruesome experience and death? You can't just put \"died -date-\"?", "He came up with two really good alternative options by himself and went to the teacher with them. That shows initiative and independent thinking. I hope teachers like this don't discourage him from this kind of problem-solving in the future.", "> She said I needed to teach my son accountability and not try to blame everyone else when there's a problem.\n\nSomething something pot, kettle, ...  🤣🤣🤣\n\nI hope the principal ripped her a new one after OP left the room!", "I do think the only thing I’d add is a conversation with the kid about when to bring this kind of thing to his parents.", "He's 5???! You should talk to the teacher right away about this. He should be allowed to present privately. An ordeal like that won't teach him one thing.", "“How they got to America” is also a tough one when sometimes the answer is a slave ship", "I am so sorry you and your sibs suffered such pain.", "Idk man, that seems like a gold mine for a psychology course…….", "wtf that is so shitty. fuck that", "The reverse can be difficult as well. What if they had a relative who was famous for being murdered or otherwise a victim of an infamous crime. Or has connections to a cult or similar. Would a tween really want to discuss that? Want their entire class to know that? \n\nForcing them to reveal that is just cruel", "The fact that his instinct wasn’t to just lie is actually good.", "She was definitely a piece of work.  She played favourites with the students and was very obvious about it, and she favoured everyone in my small friend group but me, which just made it more obvious.  The thing I can’t get over is she took it out on my siblings *and* my cousins for years after I left.  It was honestly ridiculous.", "I had a teacher whose family tree had to stop at his great-grandfather, whose name was simply “It” (or at least that’s what his enslavers called him in the only written records that his family could find). I mean, that in itself is obviously a much bigger issue than just the family tree, but imagine being ten and having to stand up in front of your class and present that. He said he felt so humiliated.", "Agreed, as a teacher I thought everyone was aware that you shouldn’t make family trees mandatory for this reason as well as for children in single parent households, foster children, adopted children, etc. I’m sad to see some people are clueless and didn’t get the memo.", "My dad loves genealogy. He typed me up a family line via his mother going back to 1250 (England). In 4th grade I found it really cool we were descendants of King Edward I & did a research project on him.", "Umm… because the kid is 11, and has probably been raised that lying is generally bad, that “making things up” can get you in trouble, that you’re supposed to do what authority figures like teachers tell you to do? Can’t fault the kid for being basically honest.", "Also the fact that she didn’t even follow her own rubric, cause she gave him a zero for the whole assignment when the only part he didn’t do was to present it, makes her a HUGE AH! \nAs a teacher, I do not claim her!!!", "NTA, after seeing your comment about needing birth and death dates, those should never be given to strangers, identity theft can happen.", "Never had it in school going back this many generations, but my father is a big history nerd so he tried to go back and do a full family tree (my Mom did the same). I don't know how my father managed to find it, but he eventually after lots of effort, time, and digging managed to get as far on his paternal grandfather's side as to find the \"name\" and identity (kind of) of his grandfather's mother. His grandfather was an \"orphan\" (both of his parents likely outlived all of his brothers, but his mother was a working class girl with a fake name who never married and worked at the estate of a lesser lord. Ergo, \"orphan\"). His grandfather and his grandfather's siblings all were sent to and lived as children in an orphanage in London, until a Canadian corporation bought them as child slaves (my paternal great-grandfather was nine when he was bought). It's pretty amazing that my dad was ever able to find out anything about his grandfather's mother at all, given that he was an orphan child slave. I imagine that this was likely a major party-pooper aspect of any family tree assignments that my father likely had to do in school in the 60s & 70s.", "Similar, my grand grand parents on my maternal grandmother’s side cuts abruptly because they didn’t keep a very good record of the indians they killed on the way to the rez way back in the day.", "When I did it in elementary school they required great grandparents, and in high school it was great great grandparents. I think the goal was to make you ask your family about people that were possibly deceased, and that you maybe had never heard of. \n\n\nMy family tree also stopped at great grandparents. Happened to a lot of us in class. Long story short, our great grandparents most likely changed their last names during/after WW1, and didn’t tell their kids where they were originally from.", "We have an adoption of dubious origins in the great grandparent slot and a generation up on the other side has a man who married many rich women and got divorced, including marrying the same woman twice. \n\nAnd my grandfather's mother or grandmother (can't remember which) was abandoned by her husband at an insane asylum. She came out heavily dissociative but eventually recovered, became and independent nurse, and married a nice Swedish cabinet maker who treated her right.\n\nIt's funny the emphasis on the nuclear family tree when my grandparents didn't even have that.", "The tools do exist now to figure out your dad's ancestors. There's an American TV program (Finding Your Roots) where famous people go to find out their ancestors stories, and often they have people on with a parent who was an orphan, and they always find ancestors through DNA matching and detective work. It's actually pretty amazing to see how they do it.", "What a gene pool", "It's especially unreasonable to insist on creating a family tree of your own family instead of someone else's when the grade 100% focuses on the presentation.\n\nIf it's purely about presentation, then it doesn't matter what kinda family tree you use as the presentation and grading doesn't change at all.", "In high school, we had to do a presentation on what one of our grandparents did in WWII, and I talked about how one of my grandfathers was part of the first US troops into Hiroshima after they dropped the bomb, and how he died of radiation-caused cancers later in his life.\n\nMy teacher made me stop presenting at that point.", "So sorry for your family, however that could have been the best awkward presentation for that teacher.", "All I can do is shake my head in sadness at the thought of someone having that trauma become their central focus again. I knew someone who found their father after he committed su*cide, and it obviously seriously impacted him. I can't imagine the amount of pain carried within the person that saw something so horrific.", "I felt so sad reading your comment. I'm so sorry you had to go through those things. I hope you've had help/found a way to work through them, or to begin to work through them.", "I had a \"normal\" family and my dad LOOOOOVED genealogy, and if I had a family tree assignment, I know he would have been over the moon helping me. It probably would have been a super easy assignment for me. But reading all these comments, my eyes are opened and yeah, that is not okay. One size does not fit all.\n\nTo offer a family tree assignment as an option (one of many choices) would be fine. But to MAKE every kid do it, when clearly not everyone has the same family history, is complete B.S. I was sometimes treated like a leper in school (for other reasons) and don't wish that feeling on anybody. Especially for something that really doesn't matter to anybody outside of your own family circle. Screw that.", "I never even heard of that, holy shot is that a stupid assignment. If I had something like that the teacher would change real quick when I mention that my mother was a child when she had me", "Yeah I had a student like that. His nephew was a grade above him and he even said that's my nephew: my brother's child. What is normal for kids is just normal for them still I can see where op is coming from when I did the family trees I didn't make kids present it just asked them to complete it and told them it was okay if some areas were not completed.", "There’s a story I like where a kid from a closed adoption (transrace, so obvious) turned in a large sheet of paper with an elaborately lettered colorful title saying “My family tree”, a tiny photo of himself in the center, and the rest blank. When his sister (not bio related) later got the same teacher the family tree was not assigned.", "So, I wasn't adopted, but my grandma and her siblings were, and all were adopted by family, but not the same people in the family. So let's say my grandma had 2 uncles. She went to 1 uncle (who also had their own daughter) and her bio sis went to her other uncle. So my grandmas sister became her cousin and her cousin became her sister. And my grandma is 1 of like 12 I think. (I haven't even met half, and im not sure how many are alive.) That would be very *not* fun to write out on a family tree. Luckily for me, I had most of my work done for me in regards to my family tree project as I'm the youngest of 4, and they all had to do 1 before me. So all the hard work was done for me I just had to copy it myself. But I don't think that part of my family's history was included on it. I didnt even learn about it until at least highschool.", "Yt?", "what is yt?", "If you don’t mind me asking, what is physically yt? Never heard that acronym and just drawing a blank on what it could be.", "It was embarrassing so I just made up eye colour inheritance information during biology class. School is tough enough as a young kid, and I really didn't need details of my adoption announced to my class.", "Pulling out the family photos to make the tree is always a ride. Like the rest of the family goes go \"oh look, your cousin Jim Bob has grandpa's nose. He got that from his mom, look at great grandma. Oh doesnt aunt Shirley look like a clone of grandma?\" And there you are. Not even the same ethnicity as anyone in the photos.", "i remember getting low grades for family trees as a child because i was adopted by a single mother. my family tree always had two people, me and my mom. and it wasn't enough for a decent grade but i dont have any other family members :/", "I’m not even an adoptee and my tree is... complicated. My teacher wanted us to do our tree up to double great grandparents and bonus points for most detailed family tree... I got to explain to a class of 4th grade bullies that I’m the product of my parents second marriage and one of my half sisters had a kid out of wedlock. Then I got to list the over a dozen cousins I have on each side and who has kids. My parents generation was pretty normal... but then my mom’s side for grandparents generation... my grandpa was one of 18 with only 13 surviving long enough to be named... my tree was WIDE\n\n\nEdit: I forgot to mention. We were required to have pictures of our family members on our trees. Most of my pictures were just pictures of random graves from the family farm the were too worn to read", "FTR Tiktok doesn’t censor white. It’s a jokey shorthand Blacktok made up bc of the comment word limit.", "My grandfather adopted my dad. I always felt like it made family trees so awkward. He is my grandfather, I've never had another but biologically he's a separate part of my tree. I never went beyond my grandparents and never did aunts and uncles. It was just so much easier", "I’m not even adopted, my family just didn’t save records and had a few generations that died young. My mother knew the names of one of her grandparents, the other 6 are unknown… not everyone has big, close families. \n\nI also hated projects where we had to do/bring/present something related to our heritage. The extent that we pretty much knew when I was growing up (I know more now thanks to the Internet) was that we are white as hell. Like what did my teacher expect me to bring, Wonderbread?", ">I HATED family assignments as an adoptee, I hated feeling like a liar writing about my adopters and not actually knowing anything about myself. \n\nI felt the same way. Writing about having Dutch ancestors when I was born in Santiago, Chile. Especially because there was one other kid from Chile who knew where I was from and he was very confused and asked me why I did that. We even had to bring food for the family tree thing. It was horrible.", "What's yt mean?", "> white, some platforms censor this \n\n??", "Honestly it was so much work to do family trees because my family could probably account for the entire population of Wyoming and then some (not accounting for the extended portion). I never had to present but if the teacher insisted on my doing so I would have laughed and refused profusely. That's 10mins of breath I don't wanna waste", "I have “traditional” family tree…until you get back to the 1800s, and they were all American polygamists (who didn’t keep good reliable records b/c they all knew they were breaking the law). Gonna need more paper and a *whole lot* more research time…", "We had to do one with bio in HS as part of genetics. But we had the option to do our self and our own bio family (cause genetics) or a VARIETY of historical figures (that in a planned coincidence, lined up with history class).", "A class it makes perfect sense for, in an iteration that neatly dodges any risk of trauma by minding its own business. May I ask what state this was?", "And just threw themselves in somewhere", "And the worst part is that's the closest some kids got to actual history about that kind of thing.", "I had to do one in Biology class during our genetics unit. And you were supposed to actually \"build\" the tree but I really underestimated how my grandparents respective 9 and 11 siblings would be difficult to d9 with popsicle sticks. 😬", "Excuse me?!", "My g-gma was also in the KKK. Not something we're proud of either.", "This is awful, but oh to be a fly on that presentation wall..", "\"I now have the strength of a grown man and a tiny baby.\"", "You wouldn't. Unless you were at the age where you thought it might be interesting (Thunderdome in utero type deal) since they weren't born, you'd probably not list them. Or if you wanted to list them, put their birth and death date the same just so they'd show up.", "Not to mention the formerly common practice of naming subsequent children after older siblings who died in infancy. Aunty Barbara may have been the second Barbara born to her parents if the first one died young and that can be hella traumatic for everyone involved.", "We did them in the UK and in the US. UK was part of a history project, draw your family tree and write about a historical event each generation lived through. In the US we did one where we picked something like height or eye color and looked for trends through the family.", "This comment thread is seriously making me question that. Like I can see an argument that it could hurt kids in the first system, but literally anyone else should be able to do this with no issue...", "And sometimes the answer is also, presumably, ‘wtf we’ve always been here, you’re on our land.’", "That absolutely is bullshit! Not every adoptee even knows their biological family. In fact, if the adoptee even tries to find their bio family, the agency will only give that information if the biological family agrees to allow it.\n\nSome families who have given up their kids for adoption might not even ***want*** to be found, for whatever reason.", "There’s another story I like where a kid from a closed adoption (transrace, so obvious) turned in a large sheet of paper with an elaborately lettered colorful title saying “My family tree”, a tiny photo of himself in the center, and the rest blank. When his sister (not bio related) later got the same teacher the family tree was not assigned.", "I think so. \"Lying is bad, but sometimes okay\" is a lesson for when he's older, right now I'm still instilling \"honesty is the best policy.\" The nuances will be taught when he's more mature.", "But the teacher surely isn't researching every pupil's great grandparents, so couldn't you just make most of it up and present it as fact and nobody would be any the wiser anyway?", "It depends. Some are trying to get kids to do more genealogical research past what their families can directly tell them, especially if the kid is older. There's no point an assignment of \"write down your family up to your grandparents\" at the high school level.", "Sounds like the teacher just wanted it their way or the highway. Its pretty obvious why this isn’t a good assignment/why someone might not feel comfortable with this. I found it funny that the teacher wanted OPs 11 year old to learn accountability while she’s simultaneously refusing to take any accountability for both her stupid assignment and how unprofessionally she handled this.", "Ignoring the contents of the assignment because the entire comments section extensively covers why it's bad, having something be 100% graded on the presentation itself is shit. I can think of several reasons why a very capable kid could pull off a fantastic project but not present well. I myself always struggled with presentations because I trip over my words a lot in stressful situations. I know people who may have issues with going non-verbal. At the very least, have enough in the grading criteria to let people bring their grade up in the areas they're stronger in", "my spanish teacher had this project and my 13 year old ass put anime characters for all the people 💀", "Okay, what fictional person do you want to be paired with?", "I mean what did they expect??!!!", "Can you imagine?  \"No, my grandma was too busy IN AUSCHWITZ\"", "Oh absolutely.  My 5th grade teacher just had us hand them in and to have parents call him if there was an issue. Loved it when my nephew introduced me as his aunt though.  Made us both grin and cackle like maniacs.", "I’m really surprised to hear that this is still being assigned - I thought everybody knew the family tree was not an appropriate assignment. They’d already been eliminated in our schools before my (adopted) kids got there, and that was at least a decade ago.", "I still remember an assignment in 5th grade that required me to list my parents eye color and then the eye colors of me and my brothers.  The purpose was to show traits and how your eyecolor comes from your family. My brothers and I are all adopted. I grew up in an area where there were many adoptees and I now can’t comprehend how this assignment would be given. I do remember having to tell my fifth grade teacher that I was adopted to get a different assignment, which then segregated me from the group. It was horrific.", "White", "It means they look white.", "Exactly. Like all of my family members can trace their family members back YEARS. All I know is my biological mom gave me away", "I’m so sorry, the adoptee experience is so unique, there’s not much else to say,", "Thanks! Always appreciate more info :)", "Germany.", "“Here’s Rhaenayra, who married the next branch up, but had kids with this tree from across the yard.”", "No offense but pretty sure the worst part is that it happened at all…", "Two shall enter, one shall leave! >\\_>", ">Honestly I think using historical figures would be far more interesting than actual families, especially if you look at the ruling houses of Europe or the Egyptian pharaohs.\n\nJust tell the kids that the Hapsburgs are off-limits. It's supposed to be a family tree, not a family telephone pole.", "Over on this branch, we have King Solomon and his wives.   This part took a few extra sheets of paper…\n\nOr\n\nHere’s my Spanish Hapsburg family tree.   I had to make it a pop up book in order to get all of the lines to connect without too much cross crossing by the time I got to Charles II of Spain.", "I am so proud of your son for bringing his concerns up with the teacher!", "Why would I do that?  I don’t think kids should have to lie because a teacher can’t wrap their head around different family dynamics. That isn’t the lesson we should be teaching kids.", "See this brings a whole different perspective, because the teacher insisted on a family tree, but in the end he got zero because of the lack of presentation. Therefore the assignment turns solely into the presentation, and she shouldn't have had a problem with children turning in family trees of famous people, as long as they presented it well. \n\nThis teacher is peak hypocrisy.", "So by adapting the assignment  she engaged with it more and added learning elements far beyond what was required by the grade. You know,  exactly the goal of every educational assignment!", "Now that’s awesome!", "I have Rosie the Riveter tattooed on my back because my grandma was one during WWII riveting planes for the US. \n\nEach plane was important for her because her brother was fighting in the Pacific and she had Jewish friends with family that was unaccounted for in Germany. My great uncle died in the Bataan Death March and her friends’ families in concentration camps. Because of conflicting reports from survivors, my grandma wondered until her death if my uncle survived the March…\n\nI hope our grandmas are holding hands looking down on us. Shalom", "Such atrocities would inevitably echo through the generations, but that doesn't make it any less heartbreaking to read the brutal truth of that pain from someone living it. I know saying 'you're welcome' is the normal response to a 'thank you,' yet it feels almost odd since kindness should be the default response to what you wrote, even though I know it isn't. Still, you're welcome, and I hope more and more empathy surrounds you and those in similar places. \n\nThank you for mentioning \"Never Again.\" I don't watch much these days, so I wasn't aware of it. I'll have to look into it. Reading \"Man's Search for Meaning\" really stuck with me, and I wish it was part of highschools reading ciriculum.", "I’m sorry it’s like dark humor and I’m loving it. That teacher would be so traumatized. Lol", "Yeah, I was an 80s kid & my parents were completely estranged from one side of the family.\n\nLike, no, I don’t know the names of more than one set of grandparents, or if they remarried. I don’t know how many aunts/uncles I have, and I definitely don’t know anything about any generations before or after.", "I'm not adopted but my mother was and I never knew my father,  out of everything at school the family tree assignment still haunts me. I had absolutely nothing since my mom's parents were not nice....I still know nothing.", "Another 70s/80s kid. I'm not adopted and my family is pretty traditional but my dad would add in anything he wanted (for a while he claimed on our official school forms that we were part Japanese because his mom's live in nanny was Japanese. There was no advantage to doing this- we weren't getting scholarships. He listed about 10 different things for us.). Thanks to him I'm 100% comfortable lying to petty dictators.", "Who the fuck censors white?", "Ah gotcha Ty", "Common misconception bc it’s *so* damn hard to discuss what’s actually censored.", "xD Do forgive me, it's that American public school education shining through. That makes far more sense now, thank you for answering my dumb question.", "I LOL'd, and sadly I'm still at work so I sound like a loon :D", "I snorted at the Hapsburg pop up tree!\n\nThink it would look like the family's chin upside down?", "Yes!  Thank you for the lovely thought.", "Hahaaa I feel you! I'm not even 30 yet and I would be way behind on some things if Urban Dictionary weren't a thing! I think \"on fleek\" is when it started for me, and I was barely a few years out of high school 😂", "Some of my Facebook friends have been zucc'd for saying white, usually in reference to frustrations with racist white people, or frustrations with white men. Another common workaround is 🌾\n\nEdit: I've never been zucc'd while discussing these issues and using that word though, and I don't think it's super common. I suspect some accounts are flagged to be on higher alert for possible \"\"hate speech\"\" than others so it's not like everyone who says \"white\" gets thrown in Facebook jail.", "I just try my hardest to not get blocked or banned anywhere honestly, so I probably go overboard but Od rather be safe than sorry 😬😂", "Yesss I'm 30 and I \"on fleek\" is a good example for me as well. I still drop it to my little brother (18) to make him cringe.  Though I'm always trying to bring back terms I love that predate me (totally tubular dude)", "Good grief. Yet *another* reason to not miss Fakebook. 6 years and counting...", "My videos get taken down for the dumbest possible reasons sometimes, so that’s understandable.", "I am surprised that family trees are still assigned in school. I remember being told to create my tree in elementary school. It was very small, as most of my family was wiped out during the Holocaust. My teacher was embarrassed and apologized.\n\nEdited to add NTA.", "NTA.\n\n> She said I needed to teach my son accountability \n\nYour son did the assignment she asked for, and stood up for himself in not making his personal info public via the presentation. *She*  and your son were held accountable for their actions by the principal, and your son was exonerated. She was sanctioned for her exceedingly poor judgement. \n\nThe blame rightly falls on her.", "Normally I side with the teacher but in this case NTA. Those assignments are so exclusionary. You did everything right and I'm glad the principle responded the way they did.", "Yeah fuck that. The principal, an expert in the field put there to be in charge, didn't like the assignment. That means the assignment was flawed or bad, it doesn't matter what you think honestly. You had a problem, the teacher said there isn't a problem. You both appealed to the person tasked with running that particular show and they agreed with you or at least they agreed there was something wrong with the assignment. \n\nSome children have a good reason (in their eyes at least)  to be embarrassed about their family. Deceased parents, a divorce, adoption and even mixed race parents are still a huge point of confusion and embarrassment for some children. This assignment is a landmine and the principal is right for axing it. Forcing students to stand up and explain something they could have entirely justified levels of shame or guilt over isn't learning, it's torture. And just to clarify if they SHOULD be embarrassed about it is irrelevant, they can be, they're children. \n\nYou are right, this teacher is out of line and I'm sure the principal didn't want to explain in front of you because it was such an obvious issue. Regardless the principal agreed with you, that's all you need to care about. NTA", "NTA. Is your son's teacher old(er)? LOL. That principle is badass. Teachers should not reuse the same assignments year after year, especially in this day and age.  Family trees no longer grow on orchards. They grow in the jungle now. Plus, I don't believe in forcing a child to present in class. It can be traumatizing. As a teacher she should be helping your son find ways to express himself, not shut him down. Go Team Mama Bear!", "Do we know what happened though? What if the son just had stage fright or whatever and didn’t want to speak in front of the class? No-where in the post does it say why the son refused to do the family tree. I feel like getting a zero for refusing to a presentation, when that was the main part of the assessment makes sense. No-one actually cares about the family tree part. It’s about design in the PowerPoint/poster and then eye contact and all that crap.", "\\> a.) asked your son why he was uncomfortable with the assignment\n\nHonestly, even this is inappropriate. It's none of her business why a student would be uncomfortable presenting personal information. If the goal of the assignment is to get kids to practice their public speaking and presentation skills, there are plenty of other ways to do this.", "I just filled my family in.  I never pointed out I was adopted, because I didn't care and neither should the teacher.  If any teacher does insist on a *genetic* family tree because that's the 'real' family, they can politely go fuck a harbor seal.", "An old friend of mine was murdered this year, imagine her kids having to hash this out on a school project.  They are young enough that they’ll probably be faced with something like this at some point \n\nMy entire mom’s side of my family are pieces of shit, everything from fraudsters to crackheads to child abusers.  It would really suck to have to put them on an assignment", "Also affair kids? Kids with queer/ polyamorous (this could come under large families category) parents? I'm told it's illegal to say gay in Florida schools. Those lawmakers really did not think this through.\nNot to mention kids or families who suffered loss of a member. Yeah, the assignment is a cool idea for happy families, but not at all inclusive.", "I asked my SIL if she got asked to do one of these and she said \"...not after I asked whether i should include the ones genocided in the 80s\"...in a single DAY she lost much of her extended family 5 months before she was born. like...unless you're teaching about the Iran-Iraq War, DO YOU REALLY THINK MIDDLE SCHOOLERS ARE READY TO LEARN ABOUT CHEMICAL WEAPONS?!?", "Exactly!  I’m also a school social worker. This type of assignment stopped being good practice in teaching years ago.  Good for you, OP, on advocating for your son and all the other children that teacher would have challenged on this. NTA.", "I have like, seven half-siblings from my POS biofather's side. Two of those also happen to be my cousins. I fortunately always knew about it so it wasn't a shocking reveal but I wouldn't be comfortable presenting this info to a bunch of strangers when I was 11.", "The whole assignment is crap.\nHowever a kid being nervous/uncomfortable about public speaking is different then a kid wanting to keep familial information private.", "I had “my grandfather had a twin, but he was conned into providing free labor in NY and grandpa lost track of him. Then, grandpa died of complications of asbestos exposure before my parents ever met, so I can’t ask him. Oh, and both his parents and my grandma’s parents died when they were 12 and 13 and they were orphans. Not sure what they died of, probably colonization.”\n\nYeah, my tree was sad.", "Yup! I had “and here my great grandma was kidnapped by the government as part of the Stolen Generation”", "And there you have to be in a safe enough space to be able to admit you are of Jewish heritage, which is not guaranteed in the US.\n\nAnother reason why I always hand-waved the \"tree stops at grandpa X.\" While I grew up Christian, in a Christian community, there was the possibility that grandpa X was historically Jewish (and a convert) and the reason why the tree stopped there was the Holocaust. His last name was a possible corruption of a last name that was otherwise Jewish in Poland/Ukraine.  This was not necessarily safe to discuss this possibility at the schools I was in as a child.\n\nDNA ancestry has since reconnected my family to his family in Poland, and we are definitely not of Jewish heritage  (and our last name is actually correct, not an immigration corruption).", "This will vary depending on grade level and just the assignment. I had a family tree in elementary school and it was just your siblings, parents, and grandparents, and I had one in a high school social studies class that encouraged you to go back “as far as reasonably possible.” Presentation was optional for that one and it was kinda cool to see the kids who could trace their family back several generations and had massive trees, but as someone who’s disconnected from most of my family, I was more than happy to do a quick Google Doc and email it to the teacher and wash my hands of it.", "I'm all for scrapping it. I don't think I get the usefulness of this assignment. I'm not sure what it teaches. I get going through like recessive genes in science, but a family tree assignment is odd for all of the reasons everyone has listed here. It can be trauma inducing, it can be embarrassing, it can be unknown and sad. \n\nI don't need to learn family trees in school as a personal concept unless I'm learning genealogy.", "my brothers biodad was a deadbeat. they wanted me to list him as my halfbrother. no. he was rased with me forever. he is my brother. his doner didnt belong on my tree", "That project got me suspended", "My nephew is 2 years older than me, and my niece who is 2 years younger than me just had a kid, which makes me a \"grand aunt.\" It's pretty weird. At least my mom was in her 30's when she met my dad. 🤷‍♀️", "I never had to do this growing up. There might've been a fictional one in French class, like what you said, but my school district apparently had some sense.", "I remember doing a family tree when I was a kid. I was adopted at a year old. I did my family tree based on the only family I knew.", "I wonder what the teacher could have done if the child stated that his parents refused to give him any information.", "W.T.F… that is horrible.", "Oh wow, core memory unlocked. I love genealogy and a family tree would normally be my jam, but deciding whether to list the death of my infant sibling was rough. Should I just leave them off, or list them and start a whole round of questions I didn't want to deal with?  I didn't even want to talk to my mom about it because I didn't want to make her sad. (As an adult I realize she would have preferred I come to her with my problem, but I was a kid.)\n\nThere's just no point in forcing kids to do it. And tbh if I were a teacher I'd much rather read the made-up celebrity family trees of my students than 30 iterations of \"my grandpa, Joe Schmoe, married Jane Smith...\" even if they were all perfectly comfortable doing their actual family.", "I didn’t even have any outward family issues that would come up through a family tree, but both my parents are only children. I remember a teacher arguing with me that I didn’t include aunts/uncles and cousins. They thought I didn’t understand what an aunt/uncle was. I did, just don’t have any. 🤷🏻‍♀️\n\nMy husband has a huge family and keeping all the relationships straight stresses me out lol", "Kids get embarrassed when there are things like way older half-siblings, incest, disowned/absent parents who they don't like to think about, etc. Some kids don't know who their dads are or feel weird about their adoption situations (e.g. My aunt is actually my mother stories). Family is a painful topic for a lot of people.", "I refused to do my family tree and got an F.\n\n\nBecause my family was abusive and I was protesting putting their relation to me in writing. \n\n\nSometimes kids have bad family.", "Not every family has their tree documented. As such, creating one would require conversations with family members. And children especially are prone to ask questions without taking into account complex traumatic memories.\n\nIt is not the sole fact that the tree has to be put down on paper. It's the process I have issue with.\n\nAdditionally as evidenced by the many comments here describing families that went through traumatic but not unusual events like child deaths, adoptions, abusive family members, estranged family etc., some people simply think a family tree is too personal to display to relative strangers.", "It actually is okay - I was adopted by a great couple and I got to stay with one of my siblings. I am very close to my family and despite the rough beginning I’ve been very fortunate and privileged in my life. Also I’ve had like SO MUCH therapy. \n\nI don’t blame my biological parents. Drug addiction is in many ways a disease. And they were still in HS when my older sister was born. Babies having babies isn’t usually a strategy for success. \n\nI am pregnant with my first at 29 so I’ve been thinking about it lately.", "I don't really get this, coming from a country where we don't have this assignment. Surely the teacher isn't researching every pupil's families to ensure everyone does it fully? So if you don't talk to X side of the family or Y was a terrible person.... just don't include them or make up a great aunt Bessie the travelling wallpaper saleswoman and nobody would know the difference anyway?", "Or if the kid who was raised to understand how privacy works and doesn't want to divulge a perfectly normal, average family to his classmates because it's none of their damn business?", "It was, but I had to do mine on a poster board!", "My best friend is in the same situation with a family tree assignment. Just her and her mom, not even any siblings. Luckily it was a college anthropology class the assignment was for, so she wasn't embarrassed and everyone was non-judgemental, but ffs it's anthropology! Make us map who is actually close to us and their influences on our social behaviors! Its the 21st century, there are examples everywhere of how blood doesn't always mean influence on you as a person! Its so exhausting.", "God right her logic doesnt even make sense for the supposed merits of the assignment", "Yeah, teacher was flying by the seat of her pants with those contradictory excuses. Her real reason for refusing all the negotiations this boy and his mum tried was \"Shut up! That's why\".", "An honest question from someone who uses a \"day I was born\" exercise for computer programming...does your birthdate alone cause you grief?\n\nSo the way we use it is to show how our software can return certain information that the user may not know. We have our users enter their birthdate and format it to show the day of the week they were born. Most people don't know what day of the week they were born on, and we've never had someone express discomfort with the exercise. But if something like that could be uncomfortable, we could come up with another way to demonstrate the same thing (categorizing transactions by day of the week by using a format).", "I'm not adopted, but my dad adamantly refuses to talk about his family. I was a teenager when I learned my dad has a sibling and 27 before I learned my dad's middle name because it's his father's first name. I still don't know the proper spelling. My stepmom is adopted, so not much I can do there if we're specifically looking for blood ties, not that a stepmom is a blood relative, but you know what I mean. My mom's side of the family I can go about 7 generations back in before I run into any real complications. It's been a while since I was in school, but I still remember the frustration and confusion I dealt with when trying to complete assignments like this. I had a world history teacher that assigned this once (cause they liked to see if anyone they taught had any ties to people of any historical significance) who was actually cool about when I asked if it was ok to only do my mom's tree instead.\nIt bothers me that I'll never know my heritage through my dad, but at this late date there's nothing I can do about it. \n\nPoint here being that a child/student should not be penalized for being unable to complete an assignment they can't control. Or, allow the kid to present it using the information available,even if it's just; family is me and parent(s).\n\nIt just occurred to me I'm unaware of my stepfathers' lineage. But he didn't marry my mom til I was 30. And I guess not knowing my own dad's it never occurred to me to ask about his.", "My kids left the paternal grandfather blank too and the teacher said they couldn't do that. All my kids were told to tell the teacher \"my dad said he doesn't have a father and if you want to know more about that you can ask him about it.\"", "Lots of pharoahs would have to be off limits, too 😅", "If they are off limits, you won't have many rulers in Europe left.", "You could easily switch out days favorite movies premiered or favorite books published. Or even historical events. Sure, we know Independence Day in the US as July 4, 1776, but how many know it was a Thursday? Or that when man landed on the moon on July 20, 1969, it was a Sunday?\n\nAll sorts of fun dates if some kids seem less than excited about their birth date.", "Personally, no. It might be because of how birthdays are celebrated and all about you as a kid so I don’t strongly associate it with my birth parents.", "I'm also not adopted, but I hated those assignments.\nI don't want to turn this into the entire history of my family and what is wrong with us on so many levels, but long story short: my father wasn't present in my life.\n\nHis mom, my grandmother, was very much involved. I haven't thought about it much, but when we had a family tree presentation, someone asked me where my father was.\n\"He must hate you if he never shows up.\"\n\nGod, it felt like a slap. Teachers scolded the kid, but the damage was done. +1 theme for bullies", "Unrelated to anything in this post: Cool name. =]", "I cackled because I am bad", "Yeah, those work, and were where I was thinking. I just wanted to get some input on whether the day of the week I was born could be upsetting. We do like to have different dates because we then turn them into a dataset and teach them how to use the dates, but we could use a \"favorite movie\" or \"favorite historical event\" that you know the date of.\n\nThese are adults, by the way. We're teaching them to use software in a professional environment. Everyone is at least 21 and has at least a Bachelor's, most have a Master's, if that makes any difference.", "I think your slang is the cat's pajamas.", "Some people do it to make their posts less likely to appear in searches. They don't want their posts being sought out by those who want to debate them on issues, so they change the keyword to make it harder to find. You'll see some people take similar approaches with other hot-button topics.", "That's just crazy. Damn."]}