{"id": 19937, "submission_id": "14c6m5m", "title": "AITA for yelling at my dad when he told me to stop calling my stepmom (My moms wife) mom?", "selftext": "So I (17F) have a bit of weird family thing going on. My mom is bi, and my parents divorced when I was ten, after that she met and them married my stepmom when I was 12, my dad's still single. Anyway I actually really love my stepmom, she treats me like I'm her own kid, she listens to me, and her daughter (14F) and I are very close sisters now.\n\nI've been calling both of them mom for a few years, because I honestly see both of them that way. My dad for some reason doesn't like that. He thinks I got attached to her way too soon, and that she's either spoiling me or manipulating me to do it. He doesn't really like her and you can tell, I'll mention something we did together and he ignores me.\n\nAnyway I was at my dads for the weekend, and I had to call my stepmom to tell her to pick some stuff up for me when I got home. At the end I just said \"Ok, love you mom bye.\" and my dad heard, he was all \"was that mom or (stepmoms name)\" When I said who it was he told me to stop calling her mom, she isn't mine and it's disrespectful to my real mother to do that. He also said it makes him feel bad since she's only been in my life six years.\n\nI got sick of it and yelled at him. I called him homophobic and jealous, I said he doesn't care if I'm happy or not. I even said he was a bad dad for not wanting me to have more people I love in my life. in the end I told him unless he shut up about this, I'm not visiting anymore, and left a little after that.\n\nNow the whole family is upset. My moms are upset because my dad and I usualky get along great, and they're sad they're making issues like this. My sister's upset because her dad's dead and she doesn't want me to lose mine. Basically everybody's sad that I blew up like that, and Now I feel shitty for blowing up when I could've just let it go.", "created_utc": 1687048829, "permalink": "/r/AmItheAsshole/comments/14c6m5m/aita_for_yelling_at_my_dad_when_he_told_me_to/", "score": 569, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) Yelling at my dad for what he said\n2) I made the whole family upset for me\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. I get everyone's upset, but the situation was upsetting - to you, at least, *long* before they ever knew there was a problem. Now they're pressuring you to go back to a time when they didn't have to acknowledge that your dad's an asshole, and you were the only one suffering.\n\nFrankly, it's unworthy of them. They now know there's a problem, and they should be working on a way to help you find a solution to it, not pressuring you to sweep it back under the rug so everyone but you can go on ignoring it again. Your dad *earned* that outburst. Don't you dare take it back. He needed to hear it.\n\nForgive him if he finds a way to learn from it and tries to become a better man, but detach yourself to whatever feels like a safe distance if he won't or can't.", "NTA. You can call whoever you want, whatever they want as long as they're ok with it.", "NTA. It may be good to sit your dad down and explain that while you love your step mum, it doesn't mean that you love him any  less or see him as less of a parent. He's probably feeling a bit jealous & insecure- that's a normal feeling and we can't help how we feel, even if deep down we know it's not a rational thought.\n\nI'm not saying his reaction is right, but yelling at him also isn't the right way to go about it. Maybe he just needs you to let him know that your step mum isn't replacing him.", "If your bio mom isn’t bothered by your calling her partner Mom also, I don’t see why anyone else should care. It’s great you get along well with your parent, step parent and step sibling and your Dad should be supporting that. 6 years is plenty of time to bond with a newer family member and feel comfortable with attachment to them. NTA.", "NTA. You're right he is jealous. And possibly homophobic.", "NTA.   I can see him not wanting anyone called dad, but if your mom thinks \"mom\" name is reserved for her, she can tell you.", "NTA It's none of your father's business what you call your stepmother. He didn't need to comment about it, he chose to bring it up, make you uncomfortable and defensive. Blowing up is never helpful but everyone has their limits. Let everything settle down and just explain to your father your relationship with your stepmother and what you call her is between you and your stepmother, it's none of his business, it's not going to change and he needs drop it. You're an adult, he needs to move on and get over the fact his former wife is in a happy, healthy same sex relationship.", "NTA, honestly I would tell you that there's no need to scream at him but i would have done the same so I can't.", "This really isn’t anyone else’s business (your moms, your sisters etc).  This is between you and your dad.  \n\nFor what it’s worth, I don’t think you were wrong to call your dad out.  He needs to deal with his issues on his own, what you call your stepmom isn’t his business either.  NTA.", "NTA, maybe super soft ESH. Your dad was in the wrong but it was a bit bold of you to call him homophobic. He’s jealous that his ex has a new partner but he doesn’t. It’s normal for people to feel jealousy but this is bad, he still hasn’t moved on. The only thing you were in the wrong for is calling him homophobic, because based on what info you’ve given us his behavior isn’t homophobic.", "NTA but you’re going to be an adult soon and you’re going to have to learn to disagree with people without screaming  at them. You certainly didn’t help anyone’s position at all.", "NTA.  You're not the one putting your relationship with your father at risk--he is.  It is disrespectful to you and your mothers for him to try to micromanage your relationship with them.  Let's say you didn't call him out.  What then?  You just get more and more resentful until there isn't really a relationship left to save?  That might be a slower death for the relationship, but at least this way your dad has the chance to fix things before it's too late.  Your moms are feeling guilty and your stepsister is projecting, but they're all barking up the wrong tree.  This isn't about them; it's about your dad needing to respect your feelings and boundaries.  \n\nCould you have handled the situation better?  Probably.  Setting your boundaries calm, firmly, and early is often the best way to go.  But you could have done a lot worse, and your boundary is now crystal clear.  The ball is in his court.", "NTA \n\nYou get to chose who you love and call Mom, Dad, Aunty, Uncle etc….", "NTA,.... but you are a kid and learning. Sometime you gotta ask yourself, what am i going to gain if i blow up and get angry?...Eben if you are right, somwtimes it does not pay to get angry.\n\nYou still have time to learn and back pedal... say you are sorry for over reacting, but you do mean what you said and calling your step mom \"mom\" is not going to change, so best he get over it or keep it to himself.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSo I (17F) have a bit of weird family thing going on. My mom is bi, and my parents divorced when I was ten, after that she met and them married my stepmom when I was 12, my dad's still single. Anyway I actually really love my stepmom, she treats me like I'm her own kid, she listens to me, and her daughter (14F) and I are very close sisters now.\n\nI've been calling both of them mom for a few years, because I honestly see both of them that way. My dad for some reason doesn't like that. He thinks I got attached to her way too soon, and that she's either spoiling me or manipulating me to do it. He doesn't really like her and you can tell, I'll mention something we did together and he ignores me.\n\nAnyway I was at my dads for the weekend, and I had to call my stepmom to tell her to pick some stuff up for me when I got home. At the end I just said \"Ok, love you mom bye.\" and my dad heard, he was all \"was that mom or (stepmoms name)\" When I said who it was he told me to stop calling her mom, she isn't mine and it's disrespectful to my real mother to do that. He also said it makes him feel bad since she's only been in my life six years.\n\nI got sick of it and yelled at him. I called him homophobic and jealous, I said he doesn't care if I'm happy or not. I even said he was a bad dad for not wanting me to have more people I love in my life. in the end I told him unless he shut up about this, I'm not visiting anymore, and left a little after that.\n\nNow the whole family is upset. My moms are upset because my dad and I usualky get along great, and they're sad they're making issues like this. My sister's upset because her dad's dead and she doesn't want me to lose mine. Basically everybody's sad that I blew up like that, and Now I feel shitty for blowing up when I could've just let it go.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "You only have two parents. The lady that done birthed ye, and the spermin donor done did the deed which sparked ye. But nah dude call people what you want.", "Exactly! I thought he'd be happy I get 3 great parents.", "should start calling the stepmom ‘dad’ instead and see how bio-dad feels then lol\n\ni’ve had several step parents, and i truly wish i had gotten along with *any* of them :/                \nmy dads current (3rd) wife literally doesn’t want me invited to holidays (even me/my sis’s shared bday we do every year bc we’re 10 years + 8 days apart), bc my dad has ✌️new✌️ children (her 2 daughters) and doesn’t need ✌️THE BAGGAGE✌️(!!!!) of his past kids around 🤬🤬🤬🤬\n\nher 2 girls have been friends w my sister for years tho so she’s allowed around🙄, meanwhile i was alive, and his firstborn, for *10 fucking years* before any of those girls even existed, but sure, i’ll just see myself out to the curb for pickup thanks 😃👍", "This. I feel like he would feel the same way if your step mom was a step dad.", "Yeah that's fair", "NTA. If uour bio mom is cool with it, he doesn't get to decide it is in any way disrespectful.\nIt makes zero sense.", "NTA\n\nHow is calling your mother’s wife “mom” disrespectful? That I don’t get.  You have a right to call her mom if you and she are cool with that, him not liking it is a him problem. \n\nIt sounds like your dad has issues with your mother’s relationship and your relationship with your stepmother. If these issues are based in homophobia or he’s just mad that your mother has moved on and he’s still single idk. \n\nIs this something you’ve spoken to your moms about before? Him not liking you calling her mom I mean. Because you said it’s been a few years but he’s still got his tighty whities in a twist about it.", "NTA - its a great thing that you feel accepted and love your stepmother enough to call her mom.\n\nTitles like this are an honorific above all else, you chose to call her that because you felt it was right. This is more or less how it should be.\n\nYour dad has no place telling you how to feel about this person, and frankly he should just be happy that you are happy with all your parental figures.\n\nIf he's taking it personally thats some weird issue he's got that he should go talk to a therapist about.", "6 years is more than a third of your life...and the first few years people don't tend to remember.\n\nHow wonderful you have more people who you love and trust, and who love you. Cherish that, as it isn't always the case when parents remarry.\n\nYour Dad is still hurt over your Mom leaving him and finding love with someone else. He would feel the same whether you had a stepdad or stepmom. It's very sad, but it is his problem. You don't have to change how you feel about your stepmother for him...but remember, it is hard for him, too. \n\nNTA.", "NTA ... but ...   \n\n\nThe emotional trauma of dealing with adult relationships can be debilitating and illogical. Teenagers don't always handle conflict properly.   \n\n\nTo me, what would have been clearer would be \"Dad, you have zero input into the relationship I have with my mother, stepmother or sister; it is of no concern to you and trying to encroach upon it will lead to conflict. It's my relationship, my choice, end of.\" It sets clear lines. \n\nHe should get the message; maybe he feels bruised because he feels replaced but this is his issue with his ego not yours.", "NTA but you could handle disagreements better by not yelling.", "nta but how is be homophobic", "NTA OP.  Sounds like your dad is one raging homophobic person.", "You stood your ground in this situation.  Sometimes, setting a bounderie doesn't come out sugary sweet because emotions are involved, however, you had and have every right to set that bounderie.  This is your dad's insecurity.  You have every right to love your step mom and to call her whatever you want. Best of luck to you!", "Hard for me to rule on this. I think mild ESH because of the explosion and overreaction. Your dad is TA for pushing it.\n\nMy own parents divorced when I was young and my father _insisted_ that I refer to my half-siblings as exactly that. It created family wounds between me and them when I did; and between me and dad when I didn't. I was just a kid trying to say the right thing and kept pissing people off. I feel you, OP, on being in that position. I know it sucks. I'm glad you stood up to it, too. But you, I think, objectively overreacted to his asshole behavior.", "I think even if you didn't call her mom he'd still be jealous. Next he'll be complaining about how much time you spend together. And if he ever does remarry, he'll get mad if you're not as close to his new wife as you are to your mom's. NTA", "NTA - he is just jealous.", "NTA you are the only one who gets to decide who you do and do not call a parent buuuttt...\n\nI mean you were a little harsh. I mean has your dad said/done anything that makes him homophobic or is it just basic things like not liking you having another parent, if you examine it would you think he'd have the same reaction if your mom had remarried a dude and you called him dad? I just don't like baseless accusations of homophobia, if his animosity if rooted in your moms sexuality than that's a problem  and you can/should go off, but if it's just because he's sad/jealous she moved on so quickly than I'd give him just a littttttle grace. \n\nLike calling him a bad dad seems like a lot, is he there for you, does he support and treat you well? Do you have a good relationship? Your dad's still a person, we forget parents have feelings too, he's expressing them badly and his handling it poorly but while it's great for you and your mom to have stepmom in your life, he's maybe a little sad and jealous he's alone, and your mom moved on, makes him and his behavior silly/immmature, but calling him a bad dad and threatening no contact seems like a lot.\n\nYou're right parents should want their kids to have more love, and people who love them, but that doesn't mean it might not sting a little to watch your kid love someone on an equal level to you, especially so quickly.  There are plenty of divorced parents across the world who aren't exactly thrilled their kids refer to a \"step parent,\" as mom or dad, and I don't necessarily think that makes them bad parents, it makes them human.", "NTA - only your opinion matters.        \nIf your bio mom was upset about I’d say think about it (still your decision ).            \nBut everyone but your dad are fine with it.       \nHe’s simply jealous", "Yta, for not understanding where your dad is coming from.", "You can gaslight your dad all you want,that he is homophobic and jealous and that he doesn't want you to be happy,you evem said he is a bad Dad lol.\n\nWhen you grow up and have your own kids you will understand why.\n\nTo me yelling at your dad is a no no.If you can't communicate without yelling then you are worse.", "This is wonderful advice.", "If he is Homophobic what are you gonna do?", "NTA seems like a mixture of insecurity and homophobia to me. was biphobia/homophobia a part of the divorce?", "He’s being an asshole but there is nothing at all to go off of when saying he is homophobic based on what we’ve been given", "I think the solution here is to find a nice husband for your father.", "Nothing? Plenty of people are homophobic. But it does automatically make you the A", "Plot twist!", "[removed]", "Are you joking or..", "Yep. Bigotry against marginalised groups indeed makes you an ass. As does thinking those groups is somehow an \"ideology\".", "Your comment has been removed because it violates rule 12: [This Is Not A Debate Sub](https://www.reddit.com/r/AmItheAsshole/about/rules/). \r\n\r\n>No starting off topic debates about marginalized groups\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "[removed]", "It is\n\nIdeology-the set of beliefs characteristic of a social group or individual\n\nIt’s the characteristic of a social group. It is an ideology.", "[removed]", "Believing it's an ideology is what's homophobic.", "I feel like you have a fetish for downvotes. I'm not participating in that.", "A fact of nature is an ideology?", "\"Set of beliefs\" specifically. Not just A characteristic. Did you not read the definition you have there? Unless you think being gay is a belief, which it isn't, it's as much an ideology as being a red head.", "Being gay is not a belief.", "Exactly. It’s not a choice, it’s an orientation.", "Ideology-the set of beliefs characteristic of a social group or individual\n\n\nUmmm, I think ur wrong.\n\nThere’s nothing wrong with not believing them. Acting like not believing a set of ideals is homophobic is honestly quite stupid. You don’t have to believe in other people’s ideologies.And yes homosexuality does fall under the banner of an ideology.\n\nI mean u don’t have to believe what other people believe in and that does not make you homophobic. Actively going against homosexual behaviour by protesting, rioting and sharing views is homophobic but not believing in their ideals is not.\n\nAnd yes homosexuality is a ideology because it is a characteristic of a group.", "Who cares.I can say whatever I want.Downvote all you want.lol.", "What you believe makes up the characteristics you will have.Your beliefs influences you and shapes you.", "It seems like you're mixing up your words here. The stress of the definition is on it being A SET OF BELIEFS characteristic of a group. Not just a trait amongst a certain group. If you're a raging Marxist or libertarian that is a set of beliefs. But being tall is not. Liking to garden is not. \n\nYou could perhaps argue that wanting queer liberation is by your definition an ideology. But the fact of being same sex attracted is not.", "Nta. Sad thing is, your step sisters reaction says exactly what type of person your step mom is (amazing & compassionate). I would much rather have my kid love & appreciate a step parent than not. He should realize how lucky you are.", "NTA", "NTA but you could have handled it a lot better.  Your dad is just insecure - and while it’s not your job to resolve that for him, with family you’ve got to learn some temperance.  Help him see that you’re happy with your moms; and that it doesn’t take away from your relationship with him.", "Your dad doesn't get to decide what relationship you have with your stepmother, you and your stepmother decide what it's like.\n\nKeep in mind that disrespect doesn't exist in an vacuum - it is all a matter of perspective.\n\nDoes your biological mother view calling your stepmother as disrespectful to herself?\n\nIf not, no reason to be concerned.\n\nYour dad is allowed to feel the way he feels. Maybe he's jealous because he still loves your mom?\n\nEither way - it's not ok for him to push those feelings onto you in the form of policing a relationship he's not involved in.\n\n&#x200B;\n\nNTA", "NTA You are entitled to call a family member whatever you please and also works for them. Your dad is clearly very hurt in ways that have nothing to do with you and that he needs to work through. I'm sorry that you, as a child, have to deal with his immaturity about his past relationship as this is not your problem to tip-toe around forever. I hope your family can heal on all sides, but its okay to need space from him if his behavior is hurting you.", "Nta\n\n\"letting it go\" was never really the right move, as your dad is out of line. However, it's fair for your family to be worried about the blow-up itself, because that generally doesn't lead to productive places.\n\nYou may want to spend some time considering how you want this situation to go and what sort of relationship you actually want with your dad.", "You have been placed in a very difficult position for someone so young (and yes, I know you feel like you're getting more grown up by the day, but from an adult perspective 17 is still young). \n\nYour father definitely did not handle this situation well, and it's very unfortunate that he put you in the middle of it. You're being asked to navigate some rough waters that you should not have to. \n\nWith all that pressure, plus normal teenage stuff, it's not surprising that you reacted the way that you did. However, it's also not healthy. You said some very harsh things to your father, and whether he \"deserved\" them or not, you created an adversarial situation, when it didn't have to be that way. \n\nThe good news is that I think this can be fixed. I can't know for sure without talking to him, but what I suspect is happening is that your dad really loves you, and wants to stay an important part of your life. Regardless of the circumstances of the divorce, he now doesn't get to see you as much as he'd like to, and he knows that other adults, especially your stepmom, are becoming increasingly important to you, which makes him feel like he's losing that much more of you. And I'm sure he's probably also thinking that the closer you get to 18 the closer you get to being able to decide for yourself who you want to spend your time with. \n\nAgain, whether I'm right about all that or not, it's not Ok for him to lash out at you about your relationship with your stepmom. Whatever it is he's feeling, he shouldn't be taking it out on you. \n\nSo how to fix it? Invite your dad for coffee, ice cream, or whatever you both enjoy, in a neutral location. Make sure he knows that you love him, and want him to continue to play an important part in your life. You also need to communicate, gently, that your stepmom is also an important part of your life, and that doesn't mean that you love or care about your father any less, but he needs to respect that relationship, even if he doesn't like it. \n\nI strongly suspect you'll find that he'll be willing to try to meet you \"half way\". Blessings on all four of you.", "Yelling shouldnt be the go to, healthy communication is important and if doesnt feel like youre able to then take a break from the situation. NTA for what you were trying to say.", "NTA. Tell your moms that they are not responsible for your dad's choice to act homophobic and decide for your bio mom that you calling your stepmom \"mom\" as well is disrespectful to her (i.e. taking away her choice on what she finds respectful/disrespectful) and telling you this instead of letting your mom tell you herself if she truly felt disrespected. Sit down with your sister (you may want to have your moms there to help you explain this one well) and tell her that even families will have disagreements, but that doesn't mean they love each other less or break ties completely. Tell her that choices and actions have consequences and your dad made a choice to try to dictate to you how you should be addressing your stepmom (and therefore taking the choice away from you), and the consequence is that you got angry and have chosen to distance yourself from him for the moment. How long that distancing lasts will be his choice in how he continues to act, since his behavior is at least skirting homophobia if not being full blown homophobia, and you are choosing not to support his attitude. Make it clear that this doesn't mean you don't love your dad anymore, and that you won't ever have anything to do with him again, but you are exercising your right to your own choice of behavior. Tell her that people will come and go in life (although those going aren't usually family unless it's through death), and that it's ok. It just means that you are growing and learning and changing into who YOU want to be and what YOU want to believe. I know that I'm doing a poor job of explaining this one fully, but that is why having others (like your moms) helping you explain it is important. The trick is explaining these concepts in a way that is understandable to the one you're talking to.", "As I see it, he is jealous, but not of your mom. He’s envious of the bond and family you have with your moms and sister. When he hears you calling your stepmom “mom” he’s not upset about disrespect to your mom, he’s upset because it makes him feel excluded and cast aside. He even admitted that it makes him feel bad. However, you’re NTA because you are the child and he is the parent and it’s not your job to undercut your healthy loving relationships with others to make him feel better. It’s his job to work out his own shit and shield you from his human failings to the best of his ability. Your moms probably feel guilty about being happy when he’s alone, and inappropriately put pressure on you to assuage that, which also low key makes them TAs. That said, you could choose to be more mature than any of them by sitting your dad down and letting him know that your bond with your stepmom doesn’t in any way supplant or lessen your bond with him. There’s room in your heart for more than two parents and he will always be special to you because he’s your only dad and you’ve felt his love your entire life. I hope you guys are able to resolve this. Your family actually sounds very sweet overall and I wish you all the best.", "NTA , but I think your dad feels like he is being replaced. Just talk to him and sort things out without the yelling part.", "i feel for your dad. if this was a man who married your mom and you called him dad. its the same thing here. its a  step parent replacing the original parent (when the bio parent is still in the picture). I think you're being unintentionally cruel and you've twisted his feelings and labeled it homophobic instead of approaching it in an empathetic way. (thats to be expected from a 17 y/o)\n\nDo you know the full story of what happened to initiate a divorce? you were 10 so probably not. I've had a somewhat similar situation happen in my life and learned other things that were hidden from me. the fact your mother is siding with your father says a lot.", "NTA for calling your stepmom \"mom\".\n\nBut yes YTA for flipping out at your dad like that. Even if everything you said when you screamed and stormed off was true, screaming and storming off is a terrible way to get anyone at all to listen to anything at all, and is a great way to upset everyone involved. Evidence: you screamed and stormed off and now literally everyone involved, including you, is upset. Sure, you had the moral high ground before you started screaming. Now tell me, where'd that get you?\n\n Take it from someone who has had their fair share of screaming fits over stupid crap, screaming and yelling will *literally never* get you what you want, unless all you want is to upset people. Again, even if you are 100% correct in every word that comes out your mouth, if those words are being screamed no one's going to change their mind and everyone's just going to end up more upset than they were at the start.\n\nI wanna be clear here that I'm not judging you, because you're SO young, but you also clearly need to hear this. \n\nYour father is a human who has feelings too. He's not right to try to police your relationship with your stepmom, but that by itself isn't a good reason to fuck up your relationship with him. Homophobia is one thing; having a personal dislike of the woman your ex-wife left you for is another thing entirely. (Whether bio mom left him \"for\" stepmom is beside the point, I'm just saying.) He's allowed to dislike her just as much as you're allowed to love her like a second mother. Again, he's not right to police your relationship with your stepmom, but he's got every right to have his own feelings and opinions about it. And if you expect him to respect YOUR feelings and opinions about it, you're going to have to sit down with him and do the work of TALKING it through, not shouting and not storming off when he doesn't immediately see your POV and agree with you.\n\n I'm not saying you should apologize for the things you said, but I am asking you to re-think your approach to *how* you say those things. \n\nI mean, unless you just like stirring the pot and upsetting everyone you claim to care about.", "Guys, I'm just telling you ahead of time that u/NoBrains-NoGains gave me an N-word pass I swear on my Robux\n\nEdit: lmao", "This", "They were divorced for ***seven years***. He still hasn’t moved on.", ">When you grow up and have your own kids you will understand why.\n\nWhy? If you're so wise, explain why.", "Ugh they both sound horrible!! I hope that you accomplish amazing things, and then rub it in their faces that they had ZERO part in your success. They suck.", "Maybe you should examine if there was more to the divorce than you were lead to believe. Reddit is full of divorces where the kids were lead to believe a less messy story.\n\nIt's great that your new family functions well, but how did the breakup of the old one go. Did it and how hard did it hurt your dad. Did he feel discarded ?\n\nAnyway unless he is actually a bigot, in your reaction to him you have said things that cannot be ignored or forgotten by him and that you cannot take back.\n\nIf you still wish to have a relationship with him, you need to have a heart to heart with him and find out how the breakup hurt him and if and how you are hurting him.", "RIF.", "Disney appreciates the idea for their next woke remake of Parent Trap.", "Regardless of how the divorce happened, he should not be taking out whatever issues he has with the mom and her wife out on OP.", "Nor should the impact on him be ignored.\n\nIn the one hand op says she has 3 great parents. On the other hand she throws a tantrum of him being homophobic and him being a bad father.\n\nRegardless of which of the two  is true, he doesn't seem to get much empathy nor does anyone seem to ask about his feelings.\n\nHe's not some emotionless machine.\n\nAlso, op doesn't give a real reason for the divorce. Mom coming out as bi isn't the same as coming out as lesbian when married to a man.", "nope. context matters.", "The post does not say she came out as bi during their marriage.\n\nTeenagers should not know details of why their parents divorced, really. You're expecting something somewhat inappropriate.", "If it’s impacted him so much he needs to go to therapy and deal with those emotions. Policing his daughter’s relationships with the stepmom and coming up with bullshit excuses as to why she can’t be called mom isn’t helping his case at all. Maybe if he approached this in a better manner then maybe he would get empathy but he’s a grown man and should know better. \n\nHow are you so willing to give this man empathy for a reason you’ve made up and have no evidence suggesting it’s true, than you are a 17 year old who’s been hearing her dad demonize her stepmother for years who finally snapped back?", "It was the phone call that triggered him.  Not the word Mom but the feeling you put out in the call.  He heard you talk to her and got super jealous and maybe felt displaced.  Cuz I bet you don't call him and need him to do things in your daily life the same way.  You might as well have called her dad. \n\nYou did nothing wrong but I wonder if he's feeling that you might love \"mom\" more. \n\nHe is certainly the insecure one.  But maybe not a homophobe.  \n\nI have no easy answers. People are messy. Parents are imperfect.", "There is a middle ground between blowing up and letting it go. Both of those options are equally undesirable for different reasons. Your father is free to tell you his feelings just as you are free to share yours. Some sort of respectful way to say the following maybe?:  remind him that your private conversations don’t require his approval, that since this isn’t a safety issue, you’ll keep your relationship with stepmom between you and stepmom, and that if he wants to discuss his hurt feelings with you, you’ll listen. Didn’t your dad know your mom was bisexual before you were created? Hurling accusations at him when he expressed his feelings may just be drama making. \n\nI’m just barely voting YTA over everyone s u c k s here", "NTA. I don't know if your dad is homophobic or is still bitter over the divorce, but the reason doesn't matter. He's an adult and a father; he needs to put on his big boy pants and put aside whatever issues he has with your step-mom and be a good parent to you. Which includes acknowledging your close relationship with your step-mom. Otherwise, he's gonna drive you away completely.", "Nta\nYour Dad is jealous and needs to figure out why it bothers him so much. It would make more sense if your mom remarried a man and he felt he was being replaced. But his reasoning makes no sense and is frankly none of his business. Tbh, his response does sound homophobic.", "If your bio mum thought it was 'disrespectful' for you to call her partner 'mum', I'm sure she'd have said something to you before now.\n\nFrom your dad's reaction, I wouldn't mind betting there was more to the split than you know, maybe a long-running affair between bio mum and stepmum, stepmum pursuing and persuading bio mum to leave your dad etc. It doesn't have to be homophobic on his behalf, just plain old emotional hurt.\n\nIf he's up to it, and is willing to tell you, it might be worth asking him about his split with your bio mum, what happened leading up to the separation and divorce etc, just so you can understand things from his point of view.\n\nN T A for wanting to have, and having, a good relationship with your stepmum but a very soft YTA for yelling at your dad without knowing the full story. \n\nOf course, if it ***is*** all homophobia, then that's a different story", "NTA for calling her mom as long as YOUR BIO MOM is okay with it.  \n\nAnd possibly dad is jealous so A bit ESH for ragging on dad because you kind of have to understand that your mom left him for another woman and that has probably been harder for him to deal with than if it was a man. His idea of a ‘family’ possibly because of his upbringing is mom + dad = kids and not the extended 2 mom plus dad family.. he feels threatened", "Esh dad has no right to dictate your relationship with stepmom\nBut I fail to see the homophobia. He’s obviously hurt and feeling like he’s being replaced. Imagine how hurt he’d be if your mom married a man and you called him dad. It’s the same thing, and it would be cruel of you to do that in front of him", "Everybody is sad because your dad's homophobic rubbish is causing you pain.\n\nYou are NTA.", "Great answer.", "Don’t know about the homophobic part though, I’m 99% sure he would have reacted much more harshly if his ex married a man and she is on the phone saying “love you, dad.”", "Or, he's hurt that his wife left him for another woman and he may feel that his whole marriage was a lie. He feels bitter about that. Then his kid 'betrays' him by calling the stepmom 'mom' and all the hurt rushes to the surface again.\nThis is basically a step parent triangle - normally the step parent 'replaces' the parent and the child directs their anger and hurt towards them no matter how misplaced. In this occasion the step has replaced the partner. Same hurt.\nI would say NAH because it's op's choice to call her step parent anything they mutually agree on, but hurt and jealously make a person behave unreasonably- but it doesn't make them an ah. They need time and understanding and a light touch. If op normally gets on well with the dad then that's the most important point and they should help him cope rather than exacerbate the hurt.", "Seems like your dad is having a hard time processing emotions and is lashing out in you. However, he’s the adult and needs to get it together. \nYour moms being upset and sad has nothing to do with you. Your sister’s dad being dead. It’s not your problem. You are not the asshole at all.\nTalk about how it made you feel. To everyone that has made you feel weird/uncomfortable in this whole thing. I think it helps to know where we all are coming from.", "You rally don’t understand how divorce works", ">My mom is bi, and my parents divorced when I was ten, after that she met and then married my stepmom when I was 12, my dad's still single.\n\nThis was literally the second sentence of OP's post.", "He’d be a lot more hurt. The fact that he’s saying it’s disrespectful to bio mom is his way of projecting: he feels like he’s being replaced", "Not sure why you jumped there. He might still be upset at the divorce, lonely, or any number of things.", "Tbf we don't know the context. It could just be the whole step parent thing and not actual homophobia/biphobia. A lot of parents don't like the concept of their spouses new partner taking a parental role. We kind of need more info before assuming prejudices.", "Don't underestimate his AH powers. Bi guys can still be misogynist bigots", "I think this may be inappropriate to talk about with OP. She isn’t his therapist and it seems that the dad may have quite some heartbreak to share. \nThe heart to heart should be more of, “Dad I really love you and want to continue having a great relationship with you. But you can’t disrespect my heart and those I also love.  She is a mom to me and you have to accept that. Whatever happened between you and Mom has nothing to do with me. I live you both. Let’s put this past us.” Nothing else needs to be said really except dad apologizing", "You know why the kids don’t know? Because they’re not supposed to. It’s not the kid’s job to be aware of their parents baggage. \n\nThat’s bad parenting.", "Op is 17. Nearly an adult.\nShe is part of the family, and has just thrown serious accusations at her father that will impact their relation.\n\nOp's problem isn't just aita or not. She loves her new family, but she needs to acknowledge her dad sas feelings too and has parented her as a family together with her mom for a long time.\n\nShe cannot put her head in the sand and pretend it will not impact her relationship with her dad, and she cannot mend if she doesn't try to understand her dad and how he feels with everything that happened.", "So being gay and having red hair are both beliefs, got it. You know that’s totally incoherent, right?"]}