{"id": 1997, "submission_id": "yrsn7t", "title": "AITA for giving my nephew food even after she claims he won’t eat it?", "selftext": "My (27F) nephew (4) and sister (21) have started staying with me recently. She’s been trying to get a job and has picked up a few odd jobs (cleaning, babysitting) while she is gone I usually Baby sit my nephew. He just kind of hangs out with me or plays with his toys. I feed him dinner if she’s been gone for awhile. When she is home all she feeds him is chips, cookies, candy, cereal, or Mac and cheese. That’s it. She claims the cereal has all the vitamins and minerals he needs since she puts milk in it as well. Nephew is average in height and weight so he’s not starving but it’s not the healthiest lifestyle for him. She claims he won’t eat anything else. \n\nWhile she’s been gone in the evenings I’ve been introducing new foods to him. He loves vegetables such as raw carrots, peas, green beans. He also really likes fruit. I’ve been making him waffles, eggs, bacon, oatmeal and cream of wheat as well and he eats everything. He doesn’t seem picky at all. \n\nShe came home last night and he was finishing up a grilled cheese with tomato soup and she flipped out on me. Told me that I shouldn’t be feeding him things that he doesn’t like and that I was force feeding him by not giving him a choice of what he wanted to be fed. \n\nI told her she was absolutely ridiculous and that he enjoyed new foods and that she was just to lazy to ever cook for him and used ready made meals. She blew up on me for calling her a “bad mom” she’s constructed that I’ve been force feeding her son while she’s gone and told all her friends who have ganged up on me saying I was out of line and that I overstepped the boundary and I wasn’t his mother. \n\nAITA here?", "created_utc": 1668116510, "permalink": "/r/AmItheAsshole/comments/yrsn7t/aita_for_giving_my_nephew_food_even_after_she/", "score": 1655, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I feel I may be the asshole because I did start feeding him different foods when she wasn’t home and did so behind her back\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. She is teaching him horrible eating habits. You are giving him the healthy meals he needs. You might want to talk to her about this when you two are getting along. Your nephew's pediatrician can also help her with nutrition and proper food. It also might be she can't afford the fresh food and so goes for the boxed, processed food.", "NTA.  It's not uncommon for kids to try more things when it's not mom or dad offering it.  So long as there are no allergy concerns OP did nothing wrong.  Not like she was force feeding them candy.", "NTA ... but....\n\nI'm betting this isn't about him not eating foods - I'm betting this is about the foods she can afford to feed him and the time she has to make food as a struggling single mom.\n\nIt's guilt and fear talking I'd bet and maybe sitting her down and really talking about how you love him and you want to do this for them and she's not imposing by having him hang out with you while she gets back on her feet. She may have to hear it several times. She may not even realize this is what it is...but that's my bet.  \n\n\nETA: just saw the age difference too - that kind of adds more weight to my assumption for me.", "NTA. Failing to provide a healthy and reasonable diet for a child is a form of neglect. This is legally considered to be abuse (where I live). Confront people who are ganging up on you with the fact that they are supporting child abuse.", "NTA, but your nephew is 4. He should be able to tell her himself what he does and doesn't like. It's weird that she won't feed him fruits and vegetables. They take almost no effort.", "NTA \n\nIt sounds like she has a limited diet herself and isn’t even trying with her son.", "NTA, clearly. Poor kid. At 4 years old he can express what he likes and doesn't.", "NTA. Does she even understand how hard it is to force feed a 4 year old?", "NTA. She kinda is a bad mom if all she feeds is cookies and Mac n cheese. If she doesn’t like you offering your nephew food she doesn’t have to stay with you.", "NTA.  I think she has overstayed her welcome.", "NTA. You weren’t serving him foods he is allergic to. Your sister sounds lazy. If a 4 year old eats something, it’s because they like it unless you’re literally stuffing it down their neck.", "NTA, but curious: What does your sister eat? Does she cook for herself or eat junk as well?\n\nI can't help but notice that she had him when she was 17, so she has been in charge of feeding him since before most young adults figure out how to feed themselves without parental help.  It sounds like she could probably benefit from some parenting classes, but you are  probably the last person she wants to hear that from right now.", "NTA. He’s lucky to have you. But don’t be judgmental with your sister. You can show her how to cook healthy things he likes without making her feel dumb or lazy.", "\"She claims the cereal has the vitamins he needs since it has milk in it.\"\n\nWhat the fuck? no, seriously? does your sister not know about the food guide?\n\nNTA OP. You're putting your nephew on the right path.", "She's 21 with a 4 year old. I'm guessing she's been judged a lot. \n\nYou could have been nicer about it, but if you're giving your nephew choices there's no harm. \n\nThere's also a phenomenon I know fairly well as an uncle with no children of my own - my nieces and nephews behave for me and act differently with me than they do their parents.", "NTA - if the shoe fits...\n\nShe's just upset that now she might actually have to make food for him.", "NTA- Let's start with... I agree with you. And then go to.. BUT.....you likely could have been more diplomatic.  To anyone giving you grief I would just say...sorry, but you weren't given an accurate narrative and unlike some, I'm not engaging with others about my sister, so, we're done here.  then mantra from there if they keep after you \"that's not what happened, good day\".  \n\nTo your sister I'd just say... you say he doesn't like it and I force feed him?  I'll make you a bet... I can fix him a plate of some veggies.  If he complains, I'll apologize. If he willingly picks it up and eats it, then you acknowledge that no force feeding was involved or any of that other foolishness you accused me of and YOU apologize.  All I did is present the foods to him and he grabbed them and went to munching.", "NTA, similar to what others have said, I think she is lashing out because of a feeling of some sort of inadequacy. Does she know how to cook? Can she afford (money and time wise) making more healthy foods? Maybe what she is feeding him is all she knows, as her diet seems very similar, and considering how young she is, maybe she never really thought about how important healthy and balanced diet is. You seem like you care about both of them, so maybe sitting down with her and having a non-judgmental, open conversation with her about what are her struggles, if she is doing okay, what she would like to do going forward. Make it clear that you are asking because you care for her and her little one and want to do as much as you can for them to have the best life, not because you are judging her and think she's a bad mother. Maybe suggest you can make some meals for both of them, so she doesn't have to live of off fast food either. But that's just my over-nurturing self thinking, I know you might not have time for that, but if you do, maybe you can make a big difference for both of them. Having dinner cooking sessions, or coming up with new dishes... Sorry for a long rambly post, I get too excited about cooking", "Nta", "Her: *sticks you with kid while shes gone all day*\n\nYou: *feeds said kid*\n\nHer: HOW DARE YOU FEED MY CHILD THINGS THAT HES HAPPILY ENJOYING YOU ABSOLUTE MONSTER!!!! *runs and snitches*\n\nEveryone: yeah it wasnt really right of you to keep her kid fed\n\nSo yeah... NTA... he clearly eats and enjoys the food so her argument is already invalid. Not too sure what she wants to accomplish by fighting with the person who is currently keeping a roof over her head. Even if he looks healthy, he wont stay that way for long if he keeps having only junk foods as his go to.\n\nSure you could argue its not your place, you arent his mom. But the kids still family to you, looking out for him and giving him actual meals is a good thing.", "She had the kid when she was 17 and has probably been told how to parent (judged) by almost everyone who has crossed her path. Although what you said was true I would figure out how to say it in a nicer way. The goal is to teach not to shame.", "NTA and she always has the option of moving out instead of being ungrateful for all you’re doing for her and her son", "Oof NTA. If she keeps harassing you over it all her if she'd like CPS thoughts on what she feeds.", "She's staying with you... You're feeding her child nutritious food and she's nipping at your heels?\nSister needs a check from CPS.", "NTA. I'm glad your nephew has you there to feed him a variety of foods.", "NTA and PLEASE don’t listen to anyone who says otherwise.\n\nThis child needs proper nutritious food and above all, he seems to crave it and enjoy it. You are doing what is best for him (after all, he can’t protect himself and relies on adults to make the decisions) and his mother needs to stop making it all about her. \n\nIf she is depressed or she can’t cook or she fears judgment, she can tell you - but she doesn’t get to take it out on her kid and that is exactly what she’s doing by trying to prevent you from feeding him a balanced diet.", "NTA. Trust me when I say no 4-year-old is going to eat something they don’t want or like. They will let you know. You’re being a lovely aunt, babysitting and feeding him dinner with no expectations. Her issue may not have anything to do with eating habits, but is probably some underlying resentment that she isn’t willing to bring up. Or she’s taking something else out on you. I’m guessing her friends haven’t heard the entire story but sister’s version of it. I’m also assuming her friends are around her age. That is YOUNG. They probably don’t have kids so they don’t understand and automatically took her side.\n\nBottom line, you are so NTA here. Your nephew is lucky to have you.", "NTA\n\nStop watching the kid.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy (27F) nephew (4) and sister (21) have started staying with me recently. She’s been trying to get a job and has picked up a few odd jobs (cleaning, babysitting) while she is gone I usually Baby sit my nephew. He just kind of hangs out with me or plays with his toys. I feed him dinner if she’s been gone for awhile. When she is home all she feeds him is chips, cookies, candy, cereal, or Mac and cheese. That’s it. She claims the cereal has all the vitamins and minerals he needs since she puts milk in it as well. Nephew is average in height and weight so he’s not starving but it’s not the healthiest lifestyle for him. She claims he won’t eat anything else. \n\nWhile she’s been gone in the evenings I’ve been introducing new foods to him. He loves vegetables such as raw carrots, peas, green beans. He also really likes fruit. I’ve been making him waffles, eggs, bacon, oatmeal and cream of wheat as well and he eats everything. He doesn’t seem picky at all. \n\nShe came home last night and he was finishing up a grilled cheese with tomato soup and she flipped out on me. Told me that I shouldn’t be feeding him things that he doesn’t like and that I was force feeding him by not giving him a choice of what he wanted to be fed. \n\nI told her she was absolutely ridiculous and that he enjoyed new foods and that she was just to lazy to ever cook for him and used ready made meals. She blew up on me for calling her a “bad mom” she’s constructed that I’ve been force feeding her son while she’s gone and told all her friends who have ganged up on me saying I was out of line and that I overstepped the boundary and I wasn’t his mother. \n\nAITA here?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA!", "ESH\n\nYou can and should feed him when he is in your care. If he is willing to eat it with you, then sister has no place getting angry and accusing you of force feeding him.\n\nHowever, the judging in this small post speaks to the likely huge amount of judging you are doing in real life. She isn't a bad mom for feeding him what he will eat and if it's not healthy, it still isn't your place to decide that. You aren't a pediatric dietitian. You also don't seem to know that kids behave differently with different people. They sometimes behave worse with their parents than they do with other people and \"auntie\" can get them to do things mommy can't. \n\nSounds like your sister is in a rough spot right now. She needs your love and support, not your judgment.", "YTA", "[deleted]", "I agree with you. She's picking a fight over a topic, not the actual issue.  Mom is young and barely had taken responsibility for herself much less the extra effort of a 4yo.", "Time for her to learn about services like WIC.", "She can afford candy but not a grilled cheese? Doubt", "This was my thought too, very well said.", "[removed]", "It's even weirder how her sister won't make the effort to introduce veggies and fruits to her, and let her son decide which ones he likes so she can make it more for him. If he has a favourite food, encourage it to be some sort of fruit or veggies.", "She usually eats fast food while she is gone. She will pick her self up a small cheeseburger or fries to eat on the way to her job. She doesn’t eat much at home.", "The uncle phenomenon is real lol\n\nMy kids raved about Uncle's broccoli.  Clearly a totally different kind of broccoli.  We obviously didn't use the exact same ingredients.  His was good for the gods.  Mine was clearly and obviously straight poison.", "She is not being a good mom for feeding him.that diet. He needs fresh foods and a balanced diet. *Cereal* and milk does not give you the vitamins he needs. That is how people end up with fragile bones and teeth. \n\nOP isn't wrong for feeding him, and she should tell her sister that she needs to step up her parenting game. She was obviously a young mother and maybe didn't learn a lot of skills, but now it's time to settle down and learn proper care for a child.", "This is delusional. Depression isn't a pass when children are involved. They come first. She needs to get herself sorted.\n\nAnd lying to her that she's a good mom just means she won't change. Tell her she has the ability to be a great mom. Don't say she's a bad mom. Don't rate her. Help her.", "Where is the healthy food cheaper than the processed stuff? Because I know lots of people who aren't overweight who can't afford it either so please tell us where so we can all shop there.", "where?", "[deleted]", "Where is the processed stuff cheaper than basic ingredients? I'd love to know because I don't know a single successful business operating at a constant loss.", "Literally everywhere. Flour, rice, beans, root veg, protein. All cheaper to buy as ingredients to be turned into meals than buying things already assembled from those things. The labour will always be baked into the cost. The problem is people turning their nose up at basic foods.", "NTA but I really agree with the comments that this is likely more for her an issue of affordability/time/what she knows. She is making bad choices for her child and does need to speak to a pediatrician about what she is feeding him. It sounds like her diet is also not good and being young and stressed as a single mom is likely part of it. Does she actually know how to cook? I’m gonna be (embarrassingly) honest that until about 24 I had never cooked anything more complicated than adding garlic powder to Kraft Mac and cheese. And with a child so young it may have unfortunately not been what she has thought of as a priority.\n\nYou’re definitely NTA but I’d have a calm and understanding discussion with her. At minimum, if he’s enjoying fruits and raw veggies that can be done pretty affordably/easily.", "I feel bad for your nephew. Tbh your sister sounds unfit to be a mother. Nta.", "NTA\nHe needs better food than what she is giving him.", "Would it be possible to include her in an evening meal? She may be justifying that since she's eating that stuff and surviving, she's doing her best for the kid that her finances allow.\n\nIf she can eat with you and kiddo, maybe seeing him enjoy nutritious food and being able to eat some herself will allow her to drop some of the defensiveness around the food choices. \n\nNo one wants to think of themselves as a bad parent. Food banks, social programmes can all help with extra food if you can't afford to cook a bit extra for her. Just an idea.", "I would tell her either I babysit him and let him try different foods or you get another babysitter. But you can’t complain or fuss if he enjoys eating it.", "NTA\n\nEven if this *is* a food insecurity issue, most veggies are REALLY cheap. Carrots are practically free. Bananas are one of the cheapest foods possible. Even if you're poor (and I grew up poor, family had the lights/water shut off multiple times and we lost our house to foreclosure when I was in high school) you should make an effort to buy fruits and vegetables for your kids.", "NTA.", "NTA you are exposing him to healthy foods and she’s doing him a disservice by feeding him all that processed crap. Ignore her and her ignorant friends.", "NTA - she's being neglectful. Tell her to prove her kid doesn't like what you've been feeding him.\n\n\"He won't eat it\" is not \"he's allergic or sensitive\".", "just because she is a young mother doesn’t mean she gets a free pass on not properly feeding her child. if she wouldn’t be responsible she shouldn’t have continued the pregnancy or used adoption.", "At 4 or 5 he should go to a early preschool where he gets fed a meal or two", "NTA. Feeding kids healthful balanced meals with lots of fruits and veggies is NEVER an AH thing to do. Instead of being angry Sister should be grateful for someone taking an extra step with her child. I suspect she may be stressed due to lack of work and money, which could be the real reason behind her obvious overreaction. When she cools off and gets back into a normal life she might see that her reaction was wrong. Hopefully the relationship can be repaired then. Good luck, and bless you for taking such good care of your nephew!", "Nta. My 3 year old loves corn on the cob and he will eat tomatoes like an apple.   It's a blessing not to have a picky eater. Maybe your sister is feeling stressed and insecure right now so she is trying to have control in some way.\n\nSit her down and talk to her about it. He is 4 so he should be able to tell her that he likes the food and is not being forced", "I’m a mom of a kid with some substantial food allergies(milk/dairy and shellfish). Normally I would say Y T A for feeding him things mom wasn’t cool with. After reading this, it’s clear there’s so much more going on and you’re clearly getting him good and proper nutrition for his age bracket. He’s trying new foods and loving them. It’s iffy though if mom says no because you need to respect that from now on. Idk what’s going on with mom, but it’s much more. Another comment mentioned maybe she cannot afford all of those other foods. Can you sit down and talk to her face to face about it? NTA for sure though", "NTA. I will say, as a mom who started off as a young one as well, WIC (if she doesn't have it already) is a GREAT tool for getting access to healthy food choices. It's so easy to feed kids \"garbage\"/\"junk\" foods, because it is incredibly cheaper than healthy food. I can stretch a bag of cereal into more meals than I can carrots, apples and broccoli, you know? I'm betting that's where she's coming from. You're introducing him to food she can't normally afford, which is why something like WIC could be beneficial to them both. WIC also offers classes where they teach you how to prep meals and stretch them within budgets, that was the one that changed things for me. I'm in a better place to get nicer quality groceries for my kids, but WIC is the reason they all love fruits and veggies now.", "Wow. Lots of excuses in here. The most likely answer is she doesn't want you expanding his palate because then she would have to try. The Mac and cheese is the only thing that involves some cooking and it can be microwaved. \n\nNTA. She's failing as a parent.", "NTA. Also, maybe call CPS? That's no diet for a child. If he really only wanted to eat that, maybe. But a mother who only lets her kid eat Mac and cheese, milk, and cereal? Jesus.", "Thank you for the award <3", "I have a hard time believing that those pre made foods are cheaper than the ingredients to make a nice dinner. And hell, she can make more than necessary and have leftovers.", "That's really good advice imo.", "She can't afford a GRILLED CHEESE? Bro.", "This may be financial. That crappy food is very cheap. Talk to her about it without accusing and see if this is the problem.", "This time of year there is quite a lot of free candy available... Like everywhere you go (at least in the US). It's all over! It might be easy for her to stock up at different times.", "Poverty mentality is real. It's one of the things we don't talk about or teach people out of in school. It doesn't mean something isn't true - it means it's that person's reality and adds to their stay in poverty. It's hard to do better and get educated when you're exhausted in all ways all the time.", "They might not necessarily be cheaper, but they have longer shelve lives. Yes, you can freeze dinners but not all of them. Even if they last long, making dinners kids don’t like is an inevitable and most lower income people don’t have the money to just waste that much food. Why get something that’ll be a hit or miss and keep piling the costs looking for something the kid can eat. When you can just buy frozen dinners in bulk and you know your kid will be fed. Making more than necessary with leftovers the kid might not eat is wasteful and people just don’t have time for that. \n\nSorry if this came off mean, I’m slightly speaking from experience and this argument used to irk me when I was going through it as a kid.", "It’s like $8 for a bag of green beans that lasts me and my partner 2 meals (that my child doesn’t even eat) versus $6 for a huge bag of chicken nuggets, which they do.  A single steak costs $20+.  Bread is like $10 a loaf, milk is $8 a gallon.  I live in the CENTRAL VALLEY.  The bread basket of the world, where over a quarter of the worlds produce hails from, and I work in a county that is the number one dairy producer in the WORLD.  And prices here for fresh produce are still astronomical and unaffordable for many people.  Please, do yourself a favor and try again.", "Healthy food doesn't last as long as processed. You can't buy a month supply of produce", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Such a bad take, sister is being a crappy mom,  i will be happy that may sister(op) is feeding my son. OP NTA.", "Sometimes its not the ingredients, its the method. I hate steamed asparagus. No thank you. Roasted, on the other hand... Yum.\n\nBrussel sprouts too. Steamed 🤮. Roasted 😀.\n\nBroccoli and cauliflower aren't too bad steamed. But I still think they're better roasted.\n\nNow if you're cooking it the same way and still getting the same variance in results... then its all down to psychology, and them knowing who will let them get away with not eating it.", "Usually fast food is more expensive than cooking at home. She may have the mind set of convenience, rather than financial reasons.", "Another thing to remember is that stuff like candy, crisps, etc also tend to have very long shelf-lives compared to healthier options like fresh fruit and veg. It makes them far more appealing to pick up in bulk-buy deals, and you don’t have to worry about having to use them up - or make time to cook or prepare them - ASAP. \n\nYou can get trapped in the cycle of this mindset. I was raised on oven chips and pie because it was something a nine-year-old could put in the oven while the parent was working long shifts. It wasn’t until I was at university that I started to explore food and cooking from scratch, and actually figuring out what I enjoy eating. And I still consider fruit and veg a luxury (but absolutely worth it when I can).", "White bread and American cheese will not go bad, even if you put them in the cabinet for a month. And if you're unsure if you can buy more $2 of food in the next month, you really have to reconsider the environment your child is growing up in.", "There are lots of options you just have to be mindful shopping. A bag of apples would cost the same as a package of cookies and some candy.\n\nEdit: Just checked 2lb bag of apples available for $5 USD and Oreos were $4.39 USD", "My mom always wondered why I’d eat peas for my stepmom and not for her. \n\nIt’s because my stepmom hit harder.", "[deleted]", "This is one of the most elitist posts I've seen on here in a long time. And that's saying something.\n\nETA: I can't see the rest of this thread bc I blocked him.\n\nI can agree to disagree but if you're someone who is heartless and just terrible to people in crisis like this family above, no time for you", "Dried beans take hours to prepare. Where is a single, teen mum supposed to get those hours?", "So the apples are more expensive for fewer serves and with more risk of manky bruised ones? And fruit goes off?\n\nLike, I don't buy cookies but that's not an example of healthier being cheaper.", "I literally shopped today and for a 3lb bag of apples (cheapest brand) it was $5.99. for a package of duplex cookies it was $1.88. I know because my kids wanted both and got neither (jello instead). Most of us understand how to compare prices it's just not usually in favor of healthy being cheaper. I'm not saying some healthy food isn't cheaper but as a whole processed it cheapest", ">Where is the processed stuff cheaper than basic ingredients?\n\nAre you from the US? Because this is the case across most of the US.\n\nJust yesterday I got groceries and eggs were between $4 and $5 dollars for a dozen, but a box of frozen breakfast sandwiches were $3.10 because of sales. Basic ingredients are less likely to have steep sale discounts. Also, a lot of the population centers in the US suffer from being for deserts.\n\nI ended up buying the breakfast sandwiches because the cost of making an equivalent breakfast sandwich at home would've been ridiculous.", "Literally every store in my massive community is more expensive for healthy than processed. I'm sure lots of us would love to know where you're shopping because it's a common issue for most families.", "I have and I dragged my ass around to make sure my son ate well, not gourmet but better than nuggets and fries. If she's depressed she needs to get treatment.", "*Jesus H* 😰", "Disagree. Dealing with it rn with my dad and his food stamp budget. He will buy an $8 bag of processed chick fries that are gone in a day over $1.99/lb chicken breast that you need to prepare every single time. **and always runs out of stamps halfway thru the month and only ever buys processed food.** \n\nCompare the 2 sometime. **some** fresh foods are more expensive than processed. Some people (like my dad) refuse to cook.", "I am literally from the poorest area in my entire country most riddled with crime and addiction. The very fact that I've had to exist on a pittance is why I know it's cheaper to buy basics and cook them yourself. Owing to where I'm from I've also spent my life surrounded by people who make poor decisions over and over and blame everything but themselves for their situations.", "[removed]", "Make some rice, spread canned pinto beans on top, add plenty of cheddar cheese. Can start with tortilla chips first if you want nachos. Microwave for 1.5 minutes. Easy peasy with beans being a protein. Can substitute black beans or refried beans for pintos.", "Apples are long lasting fruits that don’t expire quickly and have nutrients, while cookies have no nutrients and wouldn’t benefit a growing child. I’m not sure where the cookies would really be the better option when they are roughly the same price. The same store shows also a 3lb bag of Fuji apples for $5 as well.", "I’m not advocating to never purchase cookies or anything processed. I’m lucky to be in a better position but I’ve been a snap food recipient before. I just can’t agree that means to ONLY eat processed foods. There’s definitely ways to find healthy options for growing kids while trying to squeeze a dollar.", "I shop in Lidl. I buy basic cheap foods. I don't buy out of season or exotic fruits not native to my country unless they're super cheap like bananas. I buy meat on sale. I eat lots of tuna. \n\nYour entire concept of healthy foods is probably \"whole foods\" type bougie bullshit.\n\nNow tell me where I can find all these super cheap processed foods and give some examples.", "Great, I've lived out of my car for multiple years but only one of us is being a harsh, elitist judgmental know it all who can claims mental health is an illness but gives zero grace to someone who may be suffering.  \n\n\nAs I stated before, this is a 19yo single mom who had a kid at what...15? 14?  She was probably not taught any of the skills and has been just moving from one moment to the next to try to keep above water. But sure, I\"m positive she has the time, energy, resources to just put her kid down not go to work go take some classes on how to do all that.   \n\n\nShow some grace, dude.  \n\n\nChange your name or do better or both.", "It's not about the active input. It's the mental load. It's about having to juggle cooking rice, cooking beans, and whatever else along with wrangling a small child when you get home after 8 hours of minimum wage work - which is so much harder than a 9-5. People who are poor are burnt out, and the system is designed to keep them that way.", "Y’all can still afford cheese ?! Our dairy products went up in price by 30%", "These people don't genuinely want help. They want to stuff their faces with sugar and have everyone tell them it isn't their fault.", "Literally the entire USA. It's great that your country has a more realistic view of food. People in the US, however, have to deal with cheap, unhealthy corn based food being heavily federally subsidized to the point that all other foods are more expensive. Then, 150 years of laws designed to keep black people subjugated also work to keep the poor, poor. The minimum wage hasn't risen in 14 years, while the cost of living has more than quadrupled. I'm glad your area has more economic mobility, but other places aren't so lucky.", "Oh wait are you in the States? I always forget this is world wide. I've never heard of Lindl. I shop at Aldi, Walmart, Hy-Vee, Jewel, La Cocina...", "[removed]", "I have to disagree here. I understand it takes some work, but there definitely are lits and lots of easy recipes out there, and making rice and beans (example given) really is not that difficult. There's so many foods you can make in bigger batches so that you can freeze it in portions, and later the only thing you have to do is heat it up in the microwave. It's something you have to want to learn, but it is worth it and it does save money. I've been cooking for myself since I was a teenager, lived on my own from a very young age with very little money and didn't have anyone teach me or anything. I know this shouldn't be so impossible.", "I work in construction, don't whine to me about how strenuous fucking *retail* is lmao. If I can move bricks and bags of cement and push wheelbarrows up ramps all day and go home and cook some food then so can a single mother who had to go through the horrible experience of *standing for an extended period.*", "People often underestimate how crazy tired some can get with blue collar work. My mom once fell asleep taking subway and kept going on the train back and forth until the closing time. \n\nThat night she wouldn’t be soaking beans in anything. 🤣", "UK, where we hear this exact same argument, and get the same bullshit \"comparisons\" where they cherry pick expensive healthy foods and go \"look how expensive it is to be healthy!!!11!!\". \n\nLidl and Aldi are basically the same thing.", "Jesus you're  TA of this whole freaking thread.  \n\n\nYou need to know how someone ends up there for years: They lose everything in the housing bubble, their entire industry goes under, they get cancer and go bankrupt and have no family bc they grew up without one and put themselves thru not just college but grad school too.  \n\n\nI now own a home, support others, volunteer, make good money and have a heart.  \n\n\nEveryone have a good day but this guy", "[removed]", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Spoken like someone who has never had to stand in one spot all day, its surprisingly difficult. My back feels much better after a day moving sandbags than I ever did after a retail shift.", "Honestly not everything you are saying is wrong, even if you are being an ass about it. \n\nBut I do think it’s pretty funny you compare working construction to being a single parent juggling a full time job, and act like the latter is simply “standing around d for extended periods of time”. Has to be one of the dumber things said in these comments.", "So you've grocery shopped for a family of 8 in both the states and UK? Don't act like you know something you don't. Turn a blind eye that's on you but the rest of us live in the real world on a budget.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "I spent 5 years in security. Don't whine to me about standing in one spot.", "Please tell me what's so physically strenous about retail? or any other menial, min wage position? I've worked pretty much all of them, none of them come close to wearing you out like construction.", "I've grocery shopped in Walmart when I was in Florida. This is like people who don't understand there is no cheating calories in vs calories out. You don't get to pretend you exist in some special place where the laws of economics don't apply. It cannot cost less to buy the same thing but with the added cost of labour. No company can operate like that. \n\nDo you think I live in fantasy land on unlimited money or something? I also have to live in the real world on a budget. That's why I know buying a bunch of frozen ready meals is much more expensive than buying a big bag of rice, a big bag of pasta, canned tomatoes, canned tuna, dried beans, veg and chicken and feeding yourself for weeks.", "NTA, whatever the issue is it sounds like your sister is being insecure and being dishonest with you. You should have a sit down with her and ask her what the real problem is. Is it that she doesn't want him to grow up, is it that she feels threatened that you pick the food fight when she doesn't have the energy to do it, or is it because she doesn't have the money to explore food with him?\n\nYour sister is being an asshole in this situation cuz she's not communicating with you like an adult, but she's also young with a young child. It's sounds like you need to take the lead and be an adult and ask for a open communication about what she's actually upset about", "NTA, and its not hard to see why she is single. do yourself a favor and boot her out. sucks for your nephew but this is absurd and toxic", "You nailed it. She's lazy and she doesn't like the fact that you're making her look like a bad mom by doing the right thing.", "I was on WIC for 18 mo waaayyyyy back when they had paper coupons ( yeah, that was fun) and every 2 months when I picked up new coupons and got my twins checked out ( see, still sensitive about it, even though WIC was Best. Thing. Ever.) they had recipes you could easily make with WIC foods, and also the initial survey asked if you had fridge, stove, toaster, microwave and switched foods if needed. And all the food meets certain sugar maximums and nutrients minimums. No chips. Five star highly recommend.", "Nta\nBut what does she eat, out of curiosity? \nI feel like she's feeding him the things she likes and saying it's him because then you just buy one thing for the both of them. But thats just a guess. \n\nNever feel like an AH for wanting a child's life to be better in some way.", "Nta, you're sister has free rent, free childcare and free food. She needs to be grateful and feed her child better. I let my kids eat chips but they also happily eat fruit and veggies.", "I’m leaning toward NTA but I think there are bigger things at play here and it wasn’t handled in the best way from either side.\n\nI call BS on her insistence about force feeding him. I have two small nieces and there is no getting them to eat something they don’t want.", "At 21 I was living off of ramen and thought I was getting all the veggies I needed when I had a side of iceberg lettuce (aka water). She may seriously think cereal and milk is enough for vitamins. Some gentle education might be needed here. NTA. Please continue to help your nephew.", "NTA: JFC that poor kid must be shitting diamonds.", "NTA", "NTA\n\nYour sister is a bad mom if that's all she's feeding her child and she doesn't see a problem with it.", "Nta but more delicacy may be helpful. Good advice to tell/show that cooking for him isn't putting you out monetarily or energy wise. Also- thank you and good job on stepping up to do something you don't have to. It seems like not a big deal but it probably helps a thousand times more than you know. \n\nFor all the people who can't imagine there being more than ONLY ONE REASON a person can't do what they deem so easy- stfu. This is a multi faceted issue. Being the \"just don't be depressed\" advocate for just cook better is not cute or helpful.", "Nta your sister is lazy, she needs a reality check before her son at 14 is overweight and has heart trouble due to her", "[deleted]", "I'd agree if it wasn't for cereal being so expensive. Idk, maybe it's where im from, here seasonal vegetables are relatively affordable and sweet cereal  is super expensive and a the brand names (like Nestlé) are a treat. To fulfill a daily calorie intake with it would be impossible without spending a fortune. Ready made meals are also incredibly expensive if you want to feed on them every day. It doesn't seem that money is her main motivation here. (not saying she's not struggling financially, but it doesn't seem that her dietary choices are influenced by money specifically)", "I think a big part might also be her 1. Feeling overwhelmed and going for stuff thats easy and 2. Perhaps just literally not knowing how to make a lot of stuff\n\nI eat in a similar pattern to this (OBVIOUSLY not this bad), but its because ive got severe depression and better I eat like shit than not at all. However, I'm 21 and just feeding myself, not providing for a small child who needs a lot more than just that", "Getting kids to eat is so hard and what they love with one person they will hate with their parents. Financially stable or not the amount of food that kids waste is crazy. I’ve made my kids so many things for them to decide they straight up didn’t want any part of it not even to pick at. Food waste + limited resources is definitely sending sister into panic mode. It sends me into panic mode from when I was a kid.\n\nETA. I only brought up the food waste thing because I can hear myself in the “he won’t eat that”. Such a bad habit to break for me, and I feel so guilty for doing that to my son.", "booksycat Candy, grilled cheese and Mac and cheese is all she can afford as a struggling single mom? Please. If what OP says is actually the case, you’re reaching here. If it’s not then, yeah, she’s the AH. Also, I think your comment has some personal sh** attached to it. Hearing it “several times” is not going to change anything unless she wants to actually do better for her child. The fact that her kid ate everything the sister made and liked it shows that she pretty much does the bare minimum with food choices.", "Yep this was my first thought!", "Which is weird, because there are a ton of foods that are cheap and you can do a lot with. Like rice. Or cabbage. And eggs. And heck, Oatmeal and cream of wheat are cheap.\nSo I don't buy that excuse.", "There was a time not too long ago I would have thought the reasons you mentioned were just excuses. Then I became friends with someone who works with people in the OP’s sisters situation and opened my eyes to realities I never thought about because it was never a worry for me. I learned “food desserts” are a real thing. Many areas , urban and small towns a Dollar General type store might be the only option for groceries. Lots of frozen or processed foods and little of anything fresh besides milk, eggs and cheese. The young girl probably got into bad habits due to necessity. But OP isn’t TA but maybe should sit with her sister and look into options for help she may be eligible for if they haven’t already", "[deleted]", "Depends on what country  they are in.", "Time for her to step up and feed her child properly.", "It definitely depends where you are because that is definitely not true everywhere.\n\nBy me, vegetables are extremely expensive and name brand cereals, like Kelloggs or General Mills are $1.99; not on sale.\n\nCompared to a single bell pepper that's $1.79, or a single head of broccoli at $1.69.\n\nCereal is maybe 20¢ more expensive and can last longer and be used for more meals. If she's strapped for budget, that's the better deal to make.", "Bro have you seen the price of cheese recently? Dairy products have doubled or trippled these last two months. I only buy dairy if I have a coupon now. I'm not saying she couldn't branch out and find deals, but dude candy is absolutely cheaper", "A big block of cheese where I am is $25 not on sale (about 2 pounds) she could do kraft singles, I'm not sure how much that is, but considering you can get big bags of candy at the dollar store...", "Right! FOH.  Pure lazy ass.", "It's not just about the shelf-life of premade food or small drygoods; it's also about (and again, this is probably not a truly conscious decision the sister is realizing she's making) the fact if the sister is not home to take care of her son, the house is still filled with food he can easily eat and not have to prep.\n\nShe's not thinking about food sustainability in terms of what she can prepare or even what's more affordable; without even really realizing it, she's thinking about it in terms of training her kid to be able to feed themselves when she's not around.", "My cousins did this as well with my mother's cooking. Objectively, my mother is a better cook than either of their parents, but they would eat anything and everything my mother made and turn their noses up at the same dish prepared by their parents.\n\nIt wasn't even just that now that I think about it. I remember their mother complaining that they would only eat ham and mayo sandwiches at Subway or Jimmy John's, but when I took them they always wanted to get whatever I was ordering, and they would usually eat that happily as well.", "The mom only allows the kid to eat those foods, and then actives restricts others from feeding them other foods", "If you've ever been poor you'd throw up at a thought of eating out every single day. Its irresponsible and stupid. It's better to literally take a carrot and eat it raw so you can last till you make yourself a 15 min meal.", "Fast food ain’t cheap. It’s cheaper to make a homemade meal or even go to a restaurant where I live.", "That's the same thing.", "get some white bread and bologna then. buying candy is dumb. stop making excuses for giving your kids diabetes", "Oh wow cheese is really expensive where you are, it’s only about 8-10 dollars for a two pound block of cheese where I am.", "By me, Kraft Singles are $5.49 for 16 slices.", "seriously its not hard to shop the specials at your grocery store, people are just lazy\n\ngod forbid you cook up some rice and whatever meat is on sale. just buy candy instead.", "You are describing my reality.  Thank you.", "Uh how is rice and beans elitist? Genuine question", "Where does bread cost $10???\n\nETA: Apparently I got so shocked by $10 bread that I forgot to read the rest 🙃 you can get wonder bread here for like $3, store brand for little more than $1.", "[deleted]", "I never made excuses I just pointed out that your comment is especially false lol. And I don't have kids, I barely make by on a single household income in this economy", "Low income cannot afford to buy in bulk", "Candy and crisps having long shelf life is irrelevant because they're eaten right away. They're a snack, not even 1/5 of what you should eat in a day. If she was concerned about shelf life she'd buy rice, pasta, grains, cans, some cheeses. You can definitely buy those in bulk.\n\nMaking a sandwich fir yiur child isn't cooking. Cutting a carrot for a snack isn't cooking. Lack of time isn't an excuse, it's a minute, if you can't stand and cook a warm meal", "Yeah, I'm west coast of Canada. Groceries weren't cheap at the best of times, but inflation has gone insane. Gas is currently at (the equivalent of) $5.57USD per gallon- down from a high a month ago  of $6.32.", "Right? I go to 3 different grocery stores when I get SNAP so I can get the best prices on meat, sides, fruut, veggies, quick breakfast foods, and lunch stuff....essentials first! \n\nIt's absolutely a hassle, takes time to plan, costs more in gas, and it's only do-able because I have a car, but I HAVE to make it work. Disability + assistance doesn't get me too far in this world right now, especially with 3 kids, so I gotta be careful with every penny I spend!", "Yeah, I went through a period of only eating fast food and TV dinners. It took me a minute to realize I wasn’t a dependent and didn’t have anyone depending on me, then I was able to actually eat real food. I actually had the income to waste food I didn’t like (not really waste it, just not scarfing it down for sustenance).", "Of course there are healthy foods that last long, but they still don’t keep up with frozen foods and tv dinners. Frozen foods and tv dinners last up to 3-6 months, even most of the longest lasting healthy foods don’t last past 2 months. There is not even any guarantee that they’ll last that long because they still have to be kept in certain conditions that some people’s living situations won’t accommodate. For example my apartment has a moisture problem, it’s not bad enough to cause mold, but my potatoes went bad faster than usual. This wasn’t even a one time thing, my last place didn’t have this issue either. So I know I stored them correctly. Some houses could have moisture issue, landlords cut off AC and Heat in certain seasons, power going out/getting cut off, some fridges don’t go above or below certain levels, etc… it’s not even about living in horrible conditions, but just being in a slightly unfortunate living situation. So not only is a kids taste a huge factor, you also have living conditions. \n\nGetting fresh or frozen healthy foods is just a gamble that certain people can’t take. That’s not to say that they shouldn’t be learning how to better their food situations if they can, but that’s just my understanding on the topic. \n\nP.S. YOU GAVE ME FLASHBACKS TO THE CHEESE SANDWICH🤢!!!", "And do what about it? People don’t choose to live in poverty. Of course they’d rather have more money for groceries, but that doesn’t mean there’s anything they can do about it.", "I have bipolar and c-ptsd. Been hospitalized numerous times and suffered with *years* of deep depression. I STILL take care of my DOG to the best extent of dog care because he is a living being and relies on me. He deserves to have a good life, and I chose to have him and to take that on.", "I do. And it is not an excuse to neglect a child. If you're that unwell then someone has to take child from you for a while so you can heal and the kid can be properly taken care of.", "They're not gonna storm in and take the kid. But generally, if you tell a school counselor, CPS will get called, and then check in and give advice. \n\nThey will ask the kid their opinion and experiences. Won't do any harm to at least try.", "This is not entirely true.  If mom is poor and buying bargain basement stuff, then the bread may be on sale because it's ready to go off.  The cheese may not be packaged in a way to protect it.  And the idea that you will get valuable nutrition from things that are preserved to plastic is part of why people think poor people are just lazy.  Bad food leads to bad health and no energy.  \n\nReal foods decompose because they are breaking down into the components you need to be healthy.", "Depends on a lot of factors. It's hardly a hard and fast rule. It's just the stuff that tends to get touted as a savings (like when they do \"cheap healthy meals\" articles calculating the cost per serving of the veggies used based on a bulk buy) that that tends to be more universally true of. Rice, flour, peanut butter, etc tend to be easier. Something like a flat of ramen packs or boxes of mac n cheese is easiest of all, especially with a bit of luck between budget and sale times. It depends a lot on where in \"low income\" someone falls, what their other expenses are, and what stores they're able to go to.", "Yes, but this information requires education. If no one teaches you about food, then you eat what seems easy to you. AND everyone always forgets that kids do not eat much anyway bc unstretched stomachs are the size of a person’s fist. Proper nutrition is key for kids bc on average they are not gorging themselves and you do not want them filling up on calories that lack protein or important vitamins and nutrients.", "If you cannot set aside $2 for food, and plan to have your kid at least occasionally eat something other than Mac and cheese, and chips, you're at fault. \n\nIt's unfortunate yes. But if you're also actively calling other people names for giving your kid a grilled cheese, you're an asshole.", "Because that's free.  Never talked to anyone who can't afford therapy, let alone a single mom. /s", "It doesn’t really require education, it requires the bare minimum of effort to find what foods are nutritional, cheap, and have long shelf lives, and what kids his age should be eating. It takes 5 minutes on google to find all that out, poverty’s not an excuse for not feeding your kids properly, my parents were born dirt poor and raised me and my sibling while dirt poor and managed to feed us properly.", "I never once said I don't buy healthy foods. I buy healthy as often as possible and definitely not as much as we'd like but I have a family of growing boys to feed. As a whole healthy is more expensive. It's just a fact. I also understand I have a big family to feed so $200 for a single person or a family of 2 goes a lot further than a family of 8. I pay attention to what I buy but can't always help it when I can't get healthy. I don't buy soda at all, rarely buy candy/sweets but it's still tight either way. This problem isn't something that I'm just facing either. This is a world wide issue. Healthy should be available and cheaper but it isn't as a whole.", "Cookies I buy cost $1.50. And yes, about 5 bucks for small bag of apples", "Perhaps in exchange for free childcare and a roof she can take an online course in childhood nutrition. Dang", "You didn't call her a bad mom.\n\nAlthough it would appear that she IS a bad mom.\n\nNTA.", "NTA, and it’s really concerning to me that your sister is trying to deny her son healthy foods when they’re on offer.\n\nI understand not having the resources to provide him with them all the time, but not wanting him to have them when they’re around? That’s disgusting.", "NTA.....i agree with top comment. I hope your sister realizes you are trying to help instead of disrespecting her role as mom. Im glad your nephew has you to try to introduce him to new foods. Keep an eye out for food allergies, good luck", "NTA. as other commenters have mentioned, she was young when she had him. maybe she's hung up on what she considers to be kid food? there's certainly some form of insecurity at play for her to think you're calling her a 'bad mom' and going nuclear. kids usually(?) don't eat unless they want to so her rage doesn't make sense without the insecurity aspect...", "NTA. Your Sister seems to be lazy and doesn’t want to cook for him. Feeding him junk food will only cause unhealthy eating habits in the future as well as medical issues. \n\nGive her some nutritional pamphlets or something, please.", "NTA - thank you for being an awesome auntie. He knows you will always be there for him.", "NTA. She’s feeding him like a teenager/college kid would eat. She needs to feed him better. There is no excuse of oh well she’s poor. No at 21 with no WIC and No food stamps I spent the little bit of money I had buying better food then that. There’s nothing wrong with max and cheese but she can add a can or frozen bag of veggies to it and a small protein like a chicken breast.", "NTA. \n\nMaybe it's time to sit down and have a talk with your sister. Those aren't healthy foods and can cause issues in the future. Over time all the sugar and what not will cause major dental issues and over all health issues. \n\nHe ate the food without complaint so it's not a him thing it's a her thing.", "Nta!", "Nta", "Could be time for sis to move out. NTA", "NTA she feels bad that she didn’t try that", "NTA Get her entitled ass out of  your home. She has no respect for you, and is accusing you of abusing her child. Don't put up with her nonsense.", "NTA. She IS a bad mother. Anyone too lazy to even provide proper sustenance for their child should’ve never had them.", "NTA. I agree with others that your sister is immature and possibly jealous. This being said, she is old enough to knock off the dumb s**t she is doing by slamming you to all of her friends. She is old enough and mature enough to know that 1. You are doing her a favor by letting her stay with you. 2. You are babysitting her child. 3. You are feeding her child. 4. I could be wrong with this one, but it sounds like you are supporting her and her child financially. \n\nIf sister has a problem with jealousy over the food, then sister needs to find a way to get over it and say THANK YOU to you for all your help. You don't have to help her, but you do. She doesn't have to like the food you feed her son, as long as he likes it, no harm done. But she should put up (get her life together and support herself and her child)or shut up (stop slamming you to all her friends and say thank you to you for all you do).", "NTA, feeding her child only junk food (candy, cookies, etc) is neglect.\nShe should be grateful that not only are you allowing her to live with you, but you babysit & feed him nutritional food.", "OP=NTA\n\nif the kid didn't want the food, he wouldn't be eating it.  \n\nSister is AH for biting the FREE babysitter's hand(and now defaming you).\n\nYour choice, but remind her she can find her own babysitter if she doesn't like your \"Services\".", "She flipped out because she feels like you're showing her parenting to be lacking.\n\nNTA. Little kids usually refuse to eat stuff they don't like. Your nephew is eating - which means he likes the food you prepare for him.", "NTA -she is not expanding his food", "NTA.\n\nKick out the sister.\n\nKeep the nephew.", "NTA. You would think she would be grateful someone else is putting forth the effort to feed her child nutritious meals but it sounds like she is not the smartest one in the family.", "NTA. Unless she's leaving him meals then he eats what you feed him unless it's something he is allergic to. Or she can hire a babysitter. A 4-year old is not going to eat something he doesn't like without putting up a fuss.", "NTA.  She IS a bad mom.", "NAH. I really feel for your sister. She’s at that age that literally everyone judges her and likely cuts her down on her parenting.\n\nThere is a thing where kids will behave different for someone other than their parent. “The uncle effect” She may be trying to get him to eat other foods but he refuses….so for him to do so with you probably hurts and makes her feel worthless. \n\nThe fact she is eating a single cheeseburger or fries all day tells me she is in a drastic financial situation and the candy is likely free Halloween candy she is trying to use to offset cost of groceries. \n\nGive her support. Help her figure out food stamps, food banks and WIC if that is available where you live. \n\nExplain the uncle effect to her and that it’s likely because you aren’t mom he is eating different foods and it’s not s reflection on her. \n\nBe kind. It’s clear she is starving herself and likely hanging on by a thread and lashing out.", "NTA. The diet your sister is feeding her son is so nutritionally deficient that it is child abuse. You are saving your nephew from horrible health consequences of such a diet. \n\nYou are a hero.", "NTA for feeding him a variety of foods. YTA for saying she’s too lazy to cook. You could have pointed out he wasn’t fussing about what he was eating and left it at that.", "NTA but I’m not ready to call sister one either. Ive read the arguments above about what is and isn’t expensive and the fact that she just needs to research a bit better and realize she can afford healthier things. What I haven’t seen in comment yet, and I haven’t read everything, is that she is staying with OP. Perhaps on top of overwhelm and misinformation she doesn’t feel comfortable purchasing a bunch of food that she associates with having an increased income. Perhaps she feels that using space in the refrigerator will cause OP to think she can afford to leave her place now. Or perhaps she didn’t have a fridge where she stayed before or maybe not a clean one. There are lots of reasons that the sister has chosen to feed her kid junk, not saying those reasons are good, but she has them and I do feel she likely is mad at feeling as though her sister now introduced her son to food she can’t afford to keep feeding him or that her choices were a direct comment on her bad parenting.", "But...a grilled cheese and tomato soup is at least as easy to make as boxed mac and cheese? And costs the same or less! I assume OP is feeding him canned or frozen peas and green beans, and those are cheap as well. It's not like OP is feeding the toddler elaborate, fresh meals, just basic stuff that you can buy on a budget and get some nutrients into your kid! \n\nAnd, yes to all those saying that the mother should be looking into support! WIC, SNAP, and TANF! It can be a pain to apply, but could make a world of difference in what she can afford.", "EH, maybe...but she qualifies for WIC which provides milk, healthy cereals, eggs, bread, cheese, fruits, vegetables, yogurt. For free.", "NTA. I'm sorry, if you can afford chips, candy and cereal, you can afford food with actual nutritional value. She's either lazy or no one ever taught her to prepare food, or about the care and feeding of young children.  I'm not judging her, someone I love dearly used to water down baby formula and feed her kids junk. She was a teen when she had her first kid, her mother did not approve of her husband, so she was uninvolved. She just didn't know, she was little more than a child herself.  Fortunately her in-laws adored her and stepped up to help them when they found out. She had to be told you just can't do that, babies need full strength formula, if you run low reach out, don't water it down. She had to be taught how to cook basic nutritious meals and how to shop and budget.", "But… many of the things she’s mentioned are cheap and fast. Grilled cheese and tomato soup, eggs (at least near me went up 250% about two weeks ago but cheap prior), oatmeal, cream of wheat, waffles (presumably from a box). These are all very cheap and fast meals.\n\nMom is young, and I’m sure there’s some guilt and embarrassment at play here, but I think the son’s limited menu stems from a lack of knowledge and/or maturity, not time or money, as most of what OP mentioned isn’t more time consuming or expensive than what mom feeds him. Veggies can be a little on the pricier side, but so are potato chips, milk, and cereal.", "Grilled cheese, soup, eggs, waffles, oatmeal, etc... These are not expensive foods, and they aren't hard to make. There is **absolutely** a general societal issue re: whole foods being expensive to cook with, but most of the examples OP has given are extremely affordable.\n\nIt comes down to mom needing to put effort into feeding her son. NTA", "I think this really is the answer. Sis is a single mother she's likely stressed, exhausted, and just doesn't have sufficient time or the money to cook and prepare food for nephew like OP does. THAT BEING SAID, I'd have gone NAH, except for sis's attitude that OP is trying to FORCE FEED son. That's delusional, obnoxious, and absolutely not thinking about whats best for her child. So I'll have to go with  NTA.", "I want to also put out there that some kids just do not eat/behave the same way with mom as they do with their aunt, uncle, grandparents, etc. It can vary with age, routine, boundaries, or a million other things. They can be incredibly stubborn. It's really frustrating trying to get a kid to eat, and if money is tight she may feel safer getting things he'll definitely eat rather than \"risky\" foods he may not like (which then go to waste and that's money in the trash). Hopefully they can talk about it after emotions are a little less high and work it out.", "Also her son is four. He’s just now starting to be responsible enough to be left alone while. Mom cooks. There is no cooking around my almost two year old date devil and maybe she got used to throwing together whatever she could. \n\nShe lashed out because she’s ashamed. She needs help but you are NTA.", "And I'm pretty sure chips and cookies are more expensive than apples and bananas too", "Ikr? Candy is expensive nowadays. I didn't realize that until I went to buy candy for trick or treating. Meanwhile, I make grilled cheese sandwiches maybe about once a week, and I just bought cheese slices for $1.99 and a loaf of bread for $2.50, which would make, like, 6 grilled cheeses if that's all I made with it.", "The cheese I can understand, but sliced bread and tomato soup aren’t expensive where I am anyways. No Name brand tomato soup is often on sale for $1 a can. A box of cereal is expensive unless you get the off brand stuff, but still. At least go for Dino Eggs oatmeal or something, it actually has less sugar than apple cinnamon or the added fiber one. \n\nOP is NTA, he absolutely wasn’t force feeding the kid- he said the kid enjoyed the food, and veggies and stuff. Unless the mom has control issues or is delusional, she’s likely just feeling very guilty she could only ever afford to give her kid KD and cereal.", "Poor people do not have the extra time and energy to cook. \n\nBeing time poor is big a factor as money poor when it comes to diet and nutrition", "We hosted a family dinner for Easter and my youngest nephew couldn't get enough of the macaroni and cheese I made. I sent my sister home with leftovers and when that ran out, she made some. When she gave it to him, he disdainfully said \"This isn't Uncle Tim's macaroni and cheese!\"", "Can also apply to roommates, my old roommates kid claimed I made scrambled eggs just like her late grandma did….we tested it once and had kids mom make them while kid wasn’t looking and thought I did, she never noticed and mom and I laugh about it to this day. I literally make them the exact same way her mom does. \n\nI still make the kid her “special” scrambled eggs when they come visit tho lmao", ">If you dont judge and instead compliments her with being the best mom in the world she will start to relax around you.❤️\n\nSo lie to her? I doubt that's going to help anyone. If she's \"The best mom in the world\" then why would she need to change anything?", "Considering the list of foods, I’d bet good money that the original poster is in the US. \n\nChips (called crisps in British English), cookies (called biscuits in British English), mac and cheese (stereotypically American).", "WIC will absolutely help with that", "you can buy food with wic, you can feed kids with food", "Precisely. One of the reasons why obesity is more prevalent in poor communities.", "You could have been nicer about it, but if you're giving your nephew choices there's no harm.", "Oh please, cheese isn’t even particularly nutritious; peanut butter is cheap, filling, nutritious, and versatile.  Sold everywhere, keeps forever, no refrigeration.  Supports NC farmers. I live on it.  Candy and chips are way above my budget", "they are but you'll have people swearing they're not lol", "Over 20 years later and I still haven't gotten my roasted broccoli to be as delicious as my uncle's roasted broccoli", "Depends on the food. A Beefy Melt Burrito and Ranch Grilled Chicken Burtito from Taco Bell would be 1,130kc for $4. \n\nHealthy? Not every day, no. Are there better and cheaper options that require more time? Definitely. But would the above be cheap and filling? Absolutely.", "Depends on what you’re ordering.", "there was definitely a time where i’d eat a $2 burger for a whole day so that little man could eat three decent meals a day. but i was awful with money, admit to my mistakes, and so much better now.", "A single cheeseburger is a dollar at many places.", "while you’re not wrong, there are areas nicknamed “food swamps” where there is an over abundance of cheap fast food and a lack of grocery stores and other places with fresh food, especially fresh food that is affordable to lower class people. tldr usually fast food is more expensive but in some areas it’s cheaper and more accessible", "Not if all you're eating is a $1.79 McDouble or Beefy 5 Layer Burrito", "I buy a lot of fruit when it goes on sale during the summer, cut it up, and freeze it, and I use that to make smoothies all through the fall/winter.", "And that's great for you. I live off of minimum wage in one of the most expensive states in the US. (Because i was born into poverty here, cant afford to move even if i wanted to) A gallon of milk cost 6 dollars. Peanut butter is about the same. If I go to a farmers market/butcher everything doubles. A cheap studio apartment is 1500 a month not including utilities. \n\nIs really ignorant of you to think everyone has the same opertunities and resources as you. I coupon everything I get and shop at the cheapest stores. I spend hours of my days to make sure I have essentials that I can afford. It's a luxury to afford ground beef lol", "No refrigeration...? Once opened how do you keep it from going rancid if not in the fridge...?", "Where I am depending on brand. Certain ones for the 1 lb block is $12-$14. That is for state known brands(Tillimook, Bandon).\n\nI am working hard to break super bad food habits of mine. Too much fast, and crap food. Instead of cooking. Sort of have been better, but easy to slip back if not careful.\n\nOP; NTA! Keep feeding him what you have been. If anyone else says anything, tell em to buzz off.", "I got my apples at 2.20kg today.  (.99 per lb)", "I -", "[removed]", "Fair, but that’s not what OP’s sister is doing. She’s not feeding him three decent meals a day.", "That’s the case where I grew up. Right now there are plenty of fast food restaurants but only one local grocery store, about 3 miles away. \n\nOn foot it takes maybe 45 minutes, but it’s not a great area to walk in and carrying groceries on foot sucks. The busses often don’t stop at their designated stops in that neighborhood. We rarely had a functioning car when I lived there, so we had to walk every 2-3 days, and were limited in what we could carry back. Their produce section… left a lot to be desired. \n\nI lived there 30 years ago and still no chains will build a grocery store there. “Move to a better area” is obviously not possible for many of the people there.", "One time we got bread on sale and it had mold within a few days.", "Why not? They get foodstamps. And its cheaper in the long run. She can buy rice, beans, potatoes  carrots, peanut butter, canned or frozen veg...I used to shop at walmart for 2 adults on under $100 a week, made healthy meals and bought healthy snacks. Ofc that was 4 years ago and I'd anticipate at least $150+ now for the same foods. Bag of baby carrots there is still $1 tho and bananas under .50 a lb. She doesn't have to feed healthy food 100% of the time and break the bank but give the kid a fruit or veg at every meal...its not that hard. And its cheaper than a bag of chips.", "Well, yeah, ground beef is kinda expensive on the cheap meat front, at least where I live. At my local store, the 80/20 is on sale for $3.99/lb, but boneless, skinless chicken breast is always $2.49 (used to be $1.99, but inflation...I personally prefer leg quarters which can go as low as $.99/lb, but the bone makes them less price-efficient). And there's always canned tuna, which I lived off of in college and, while more expensive now, rings in at less than $3/lb when NOT on sale.", "In Australia peanut butter is kept on the shelves, I'm not sure you'd be able to spread it out of the fridge unless it has a bunch of additives", "I’ve never kept PB in the fridge after opening it and I’ve never had it go rancid before I finished the jar - which usually takes about a month; sometimes a bit longer. \n\nMaybe preservative-free stuff might, but I just buy the cheap stuff at Meijer or Kroger. \n\nI never knew people kept PB in the fridge. Cold PB would seem so weird to me!", "Peanut butter does not have to be refrigerated after opening. In fact doing so can actually make it thicker and harder to spread.", "My weekly grocery runs in Ontario average 180.  Here in Van it's usually about 250.  Prices here are insane.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "i agree, and what really sticks out to me is buying the candy instead of, let’s say, bread & cheese and canned tomato soup for grilled cheese and soup. the cans are cheap and last 2 meals, bread and cheese is great for multiple uses, and all will cost the same as a few bars/boxes of candy. cheese can also be reused in quesadillas, etc.", "[deleted]", "[deleted]", "Depending on location most bread is between 1-2 dollars for store brand cheap white bread and honestly sometimes it’s better then name brand. I grew up relatively poor and we ate a lot of sandwich’s and hot dishes that for a family of 4 only cost even now 5-6 bucks and have leftovers. You can cook healthy on cheap just need to learn to bulk up your meat with carbs and add extra veggies to hot dishes. Is it perfect no but it is cheaper then cookies, chips, and other food. Hell we called it hamburger Mac my mom would add ground beef and instead of milk would add tomato sauce to it sounds gross but it’s actually really good.", "yeah natural pb is less popular to find here lol. Shit has fucking icing sugar in it. Its wild.  That said, I buy all natural, only peanut PB and it still says refrigerate after opening.", "My husband is a big peanut butter guy. He also has some health issues, I buy an all natural brand, and empty the jar into a bowl to blend the peanut oil, into the ground peanuts. Stick it on the shelf in the pantry. Never the fridge.", "Halloween was just a couple weeks ago. She likely has a shit Ton of candy for free and is taking advantage of that free resource", "I live in the US. I can't remember what brand exactly, it was one of the somewhat nicer brands but on the discount rack.", "Wait, your claim was that it lasts a month at room temp, and now you posted a link saying it lasts 5-7 days at room temp.", "It says she's feeding her kid Mac and cheese, which is literally Velveeta (or like Velveeta) and carbs. The same thing you said.\n\nThe foods being brought up by OP/aunt are fresh produce, which dont always have a long shelf life.\n\n\nIn the end, I really see this as a NTA, but like the person way above said, younger sister probably has a lot going against her. It would probably be possible to try to show younger sister that there are some healthy, cost effective, shelf stable options for her family (carrots, frozen peas, etc.)", "What on earth are they putting in American bread that it doesn't go bad for months???", "My parents were poor, there was 5 kids, and they managed. They were terrible cooks, but we always had rice, frozen or canned veggies, and baked chicken at LEAST 6 days a week. Plus oatmeal for breakfast and a pb&j or something Iike that for lunch. No excuses.", "My family was dirt poor as well.  We were on food stamps, and I will honestly say we hardly ever had a vegerable in our house. However, we had tons of hamburger helper, frozen Mexican dinners, and spaghetti...because that's all my mom knew how to cook.  My dad loved bologna sandwiches (which in the US is not the best meat) and that's all he ever made.  A bit of this does come down to education...but it's more like budgeting to ensure your food stamps or money lasts all month and nutrition education to discuss the 5 five food groups, their importance and dietary needs.  \nWe hardly ever had milk in our house, but we always had Coca Cola.", "Ours (some natural, some \"American style\") say \"cool, dry place away from light\", so I guess some people here might put that in the fridge instead of pantry \n\nThat being said, people here debate whether sauces should be refrigerated regardless of what the packaging suggests", "There's also canned veggies and food pantries have a lot of that stuff. Whether or not a person will want to eat it is another question.", "Exactly, a bag of baby carrots is 99 cents. A bag of regular carrots is less than that.  Veggies and fruit are affordable.  Gala apples are 99 cents a pound near me.  It's just easy to go to junk. I say that as a person who goes to junk rather than eat my 99 cent grapes or carrots - it's a bigger issue of junk addiction for me.", "Unfortunately I've learned toddlers are jerks and do different things for non-parental figures than parental figures 😬 \n\nI still say this is a NTA, but it is very nuanced. Kids.eat.in.color on Instagram is a really interesting account to follow to get a better understanding of the nuances behind settings kids to eat healthy.", "I know there are food deserts, but canned veggies are still cheap. Not the tastiest, but cheap.", "Ooof, where do you live where that is true? I bought a bundle of celery yesterday for some beef stew I cooked and it was more than $2.", "hey. a year and a half ago i was homeless with a one and a half year old. \n\ni am so proud of you ♥️", "NTA maybe you can teach her how to shop and cook.", "Honestly, it’s not her being lazy. She’s buying what she can afford, although it’s unhealthy. She also probably still has the mentality that she doesn’t have a stove or fridge.\n\nI used to feed my son McDonald’s because it’s all I could afford as I didn’t have a fridge or stove to make food. I would even walk around 24/7 Walmarts and even hit up different ones in a day, just to have a roof over our heads while my son was a baby. I’d stay at friends houses maybe a few days a month so we could shower and get a home cooked meal and my son didn’t have to sleep in a car seat and me in my car.\n\nThis is much deeper than you cooking. She’s feeling ashamed, embarrassed and insecure because she can’t do what you can do, for her kid.", "NTA. Has she never heard of scurvy? Or the host of other medical issues that pop up when kids don't get a balanced diet? The pediatrician would be horrified if they knew what she fed him.", "NTA. Sounds like your sister is afraid she won’t be able to maintain what you’ve introduced him to, either being able to afford the food and/or having the knowledge and time to prepare/cook it for him on her own.", "NTA, but kids can be little jerks about eating sometimes,  so he might be totally down to try whatever w you,  but only eats chicky nuggies w mom.  So if I saw you feeding my kid a bunch of food he wouldn't dare eat with me,  I'd probably do a double take too lol", "NTA, no good deed goes unpunished. You are opening up your home and devoting your time and energy to your nephew, that’s a great thing. Your sister seems jealous that she is either unwilling or unable to parent her child the way she would like to. Maybe try talking to her if she doesn’t know how to cook nutritious meals perhaps her time in your home can help her learn.", "A big NTA. I feel bad for your nephew's future. I am not a medical expert but I can tell you that if he only eats those things your sister feeds him, he is not going to live a healthy life. If I were you I would've tried making her nephew tell her that he genuinely likes those foods you make him. That might resolve the problem.", "NTA\n\nAs someone who was force fed as a child you aren't doing that, you are offering him healthy options. \n\nForce feeding him would be the time my grandma made all my cousin's turkey sandwiches and made me a PB & J sandwich and told me if I didn't eat my food I couldn't leave the table even though she knew I hated PB & J as a child. My cousin offered me her turkey sandwich and my grandma yelled at her that there would be no switching food, I sat at the table while my cousins played. I didn't touch the sandwich and whenever my cousins sat at the table with me because they felt bad I wasn't able to play my grandma yelled at them to leave me alone until I finished eating my sandwich. I didn't finish my sandwich and sat there until my mom showed up to get me, I ate everything else on the plate which was carrots and tomatoes. I told her what happened and my mom was livid, she tried to stand up for me and my grandpa told her to stop yelling at my grandma. That would be forcing a child to eat something that they don't wanna eat. \n\nWhat you did wasn't force feeding her child, you were simply introducing him to healthy foods.", "ESH\n\n> she was just to lazy to ever cook for him and used ready made meals. \n\nThat’s mean.", "Instead of writing here, I would send the list of both foods, you and your sister are feeding to the child, to the friends.  \nHave your sister sit down and explain why the food you're feeding is good for the child.   Simple solution.  \n\nNTA.", "NTA...but your ungrateful sister is. Thank you for being a great aunt", "I think this is more about her buying stuff her son has a history of willingly eating rather than having the money to spend on things she isn’t sure he will eat then feel like she’s wasted money she couldn’t afford if he won’t. But now she has help and it’s probably her pride that’s the issue. She needs to realize she’s there for help and that’s what her sister doing. She needs to make her sons needs her priority not her pride.", "  NTA", "NTA. My mom lost custody of me when I was 6 for many reasons, but one of the main being neglect. One of the ways was her feeding me exactly like your sister is feeding her kid. Nothing but junk food, fast food, etc. I also grew up poor, before anyone tries to fight me on this. She needs to get her crap together and not lash out at you, the person actually taking care of her kid. She could benefit from parenting classes and may require social services intervention if she can’t take care of him even on a mediocre level. CPS doesn’t always just yank kids out of the home, they work with the guardians to get them on the right track.", "NTA, It's pretty cool you're introducing your nephew to new food, your sister attitude was totally rude.", "NTA. Your sister either doesn’t know how to feed her child or she is too lazy to do so.  He clearly eats and enjoys the Food you are feeding him. \n\nAsk your family if they really think it’s good for a developing child to only eat processed garbage and also ask them exactly what is the problem with feeding a child healthy food. Make them explain in detail.", "NTA because any good mom would want their child to eat healthy food regardless of whether they could afford it or not. Being angry about her child eating better is a sign of immaturity and narcissism.", "Chips, cookies, and candy are expensive", "Then she should sign up for WIC or food stamps and will get fresh veggies to make more nutritious meals.", "Sister gave birth to her son when she was 17. My guess is she has little to no idea how to be a parent, considering just how young she is.", "Better than having A Talk, which is always a structured and therefore threatening event, just bring home some ingredients and inform Little Miss Perfect Mother that from now on she was to help with cooking while she's staying over.  Keep it simple.  Spaghetti, rice, hot dogs and beans, homemade mac and cheese, stuff you can get cheap and prepare easily and a little boy has a better than average chance of liking.\n\nShe needs to expand her horizons if she wants to be a good mother for that little boy, and I'm optimistically thinking that yes, she does want this and that, framed as a request for help, she might actually do it.  After all \"helping\" doesn't incur any kind of debt, and still exposes her to wholesome ideas.", "She may realize how fun cooking can be.  When I went on food stamps that's a promise I made myself.  I would learn to cook.  And I did.  I'm particularly good at fried rice dishes.  They're very low effort and quite tasty.", "I was with you until \n\n> It’s iffy though if mom says no because you need to respect that from now on. \n\nNo here tho, just because she says no to it is NOT a reason to not feed the kid appropriate food they like\n\nIf she has other issues she needs to voice them to OP and get help from somewhere/one not just feed the kid junk food and abuse those who will feed him appropriate food", "She probably feels like a burden and that's why she doesn't eat at home. The issue is bigger than food. Try taking food off the table and having a discussion about how she's doing and coping and how you can help as her sister. No judgement. She probably feels like a failure or disappointment.", "hat crappy food is very cheap. Talk to her about it without accusing and see if this is the problem.", "I don’t know about that but I do know healthy eating is expensive especially if you do not have time to cook everything from scratch (& tons of freezer space!)", "You have to know how to cook all of those, except for the oatmeal. Everything she's giving him involves zero cooking, or bare minimum (add water to mac and cheese, microwave and stir). Thing is, when you're broke, cooking when you don't really know how is high risk. If you fuck it up and it's inedible, you've already spent your money, so you're going hungry. If you buy fresh-ish produce on the half off discount section, there's a fair chance that it's gone so far that it's not usable. But even at half off, that's still money that's not coming back. \n\nAlso, eggs are expensive AF right now - pushing $6/dozen for standard eggs (not the organic, free range or anything, just generic eggs). Good protein source and all, but they've jumped from the 99 cent dozen. I wanted to make breakfast sandwiches a few weeks ago and nearly fell over when I saw the prices of eggs and bacon.", "Which wouldn't be a big deal i she was capable of listening to the people who might know better than her.", "Or it could be laziness. And that's fine when just feeding yourself but not when feeding a child.", "How is it that expensive? I can get lactose free cheese for about a 3rd of that peice and thats expensive this side of the pond", " A light garlic and ginger saute for broccoli/cauliflower does wonders. Or toss them in soy sauce with garlic and ginger before steaming them, maybe even add some sweat and sour sauce in the mix too. And chili.", "WIC is amazing, here they even offer calender's with recipes and the like that work with foods you can buy with them.", "You can always spot the ones who think hungry kids in their own country aren’t their problem. Maybe not feeding hungry kids will magically put money in their pockets.", "It's exactly shelf life. And don't forget effort to prepare as well. Just because you can technically live off of $15 of groceries doesn't mean you can adequately prepare and keep fresh veggies at that price point. If I forget strawberries in my fridge, it's a lot to replace them. Not just the cost but I have to run to the store too.", "Yes, I live in severe poverty, it can very much be like this.\n\n\n\nI also have an added struggle of a severe Anxiety Disorder, combined with OCD, and add a large scoop of being horrifically abused as a child, including forced starvation, and here I am!!!! A grown lady who goes DAYS at a time eating *nothing but candy.*\n\n\nOther days I can eat a completely normal and healthy diet.\n\n\nBut I do my absolute best to not let my struggle touch my child's life. Not everyone is in that place yet.\n\n\nI'm not going to put a judgment on this one. It may be beyond reddit's paygrade.", "...cheese is super nutritious!", "Horribly expensive, that's terrible! Food prices have increased so much.", "Try more bacon.", "Don't saute broccoli that often, though we will do a sauted green bean, red pepper and onion mix. Just those in a little sesame oil, with maybe some garlic at the end. No need for anything else.\n\nYou could throw in some soy or tamari, I suppose. Not sure its needed though.", "I can get a whole rotisserie chicken from the grocery store for $8.\n\nSubstantially cheaper if I buy it raw and cook it myself.", "But like don’t u need like 2-3 of them plus a drink to even get not hungry? That’s like 12-15 dollars", "If you can’t afford to feed your kids don’t have them", "but they do buy at the dollar store, and the dollar store has lots of shelf stable processed crap food. Why do judgy people always think that poor people, especially struggling mothers, are just feckless idiots who are deliberately making bad choices?", "So it sounds like you have some education.\n\n\nYou also have a lump sum of money to bulk buy the produce, and the freezer storage containers (guessing freezer ziplocks).\n\n\nAnd then you probably also have a deep freezer. Which means you use a little bit more electricity. Perhaps you even live in a house because not all apartments allow separate fridges or freezers in addition to the ones they provide.\n\n\nAnd you have the time you need to invest to prep all those produce for freezing. And then the daily time it takes to make the smoothies.\n\n\nThose are a lot of cool things you have. I love that for you. \n\n\nBut not everyone has those things. Enough people are missing so many of those things that they can't do what you do. \n\n\nThere really *are* reasons that things don't work for *every*one.", "Hmm, NorCal or SoCal?", "hmmm... never tried adding bacon. but bacon would be good.\n\nFor me, some olive oil, kosher salt, cracked black pepper, and maybe grated parm when it comes out of the oven are all that are needed.", "Yes but buying a whole chicken means time needs to go into preparing it to eat (ie you can’t grab it and eat it on the go) or need time to sit and eat it, and buying raw also requires time investment. Having the time to cook can be very difficult for impoverished people. \n\nObviously this doesn’t mean the mom is justified in feeding her kid poorly, but it means that oftentimes the time+money investment in buying fast food makes it cheaper than preparing food", "Not everyone, no. A five layer burrito from taco bell is usually too much food for me at one time. They're almost 4 dollars where I'm at, but they have the box that's five bucks and cones with a drink, the burrito, a taco, and chips. It's a duck ton of food for me for as buck more and I can make a second meal or of it.", "I’ve got no leg in this discussion but a single beefy melt with a bottle of water is a perfectly filling dinner for me. Do I want more anyway? Absolutely. But am I actually still hungry? Nope.", "What a life you must have.  I guess Losers really do crawl out of everywhere on Reddit.", "She's 21 with a 4 year old. Do the math.", "Look up food deserts. I dont think that's what's happening in this scenario however it's a huge issue in the USA", "I've sampled over a dozen different brands, and all different types of peanut butters. \n\n\nThey all go in the cupboard, even the ones that say refrigerate after opening.\n\n\nSo far, they've all been perfectly fine.", "You have spent 1000 dollars a month on groceries?", "Damn fuck my stomach I’m always hungry", "How is that not right? If you can't afford kids you're guaranteeing them a shitty life of struggling for no reason.", "Unlike you I’m not a “loser” that can’t look after their kid, shitty parents are the biggest AH “losers”", "Math has zero to do with it. There are good parents who started at 16 and shitty ones who started at 30.", "And your point? the fact she was 16/17 when got pregnant changes nothing about not having kid/s you can’t appropriately look after, and that is MORE of a reason not to have had/kept the kid since she was still a kid herself", "I wasnt big on PB&J until I had tried it with natural, crunchy peanut butter. Having balance from the saltiness was much better than the overly sweet popular brands I had growing up", "wow—i didn’t even think of this. thank you so much for the perspective!", "If an American is on WIC to help them feed their children. That is taking care of their children. You dolts act like you don’t almost live in kleptocracy with low paying jobs and no healthcare. \n\nBunch of tools acting like america is so great and somehow making what the shitty employers pay and not being able to afford food for your kids is the shameful thing. \n\nIdiots live. And always seem to reply to me. Loser.", "Where I am if you get pregnant abortion is illegal, sometimes having a child isn't a choice you make.", "You are a loser. Bet if I tracked you you live in a hillbilly hellscape have subpar education and a subpar job.  And a truck you can’t afford. But somehow it makes you feel like an alpha loser to \ntry and shame people for feeding their kids. \n\nOh and I’m Canadian and my kids are grown. And the whole world knows exactly what losers like you look like. \n\nBut at least your pea brain feels bigger for second eh bud?", "There’s a ton of resources to make sure your kids don’t eat garbage. I understand the pitfalls of poverty and how it can impact what food you eat, but it’s no excuse to feed her child a diet of chips, cookies, candy, cereal, and Mac and cheese. I’m sympathetic to her situation, but it’s her responsibility as a parent to make sure her son is in good health. It doesn’t have to be a perfectly nutritional meal plan even, but judging from this post she’s putting literally zero effort into properly feeding her son. I’ve known homeless people that have a more balanced diet than that.", "yaaaaasssss! Natural PB is the best.  I can't even eat the sugary stuff, its just gross lol.  A lot of the time peanut butter is eaten with sweet stuff already, like fruit or jam, no reason to make it sweeter!", "Clearly YOU are the subpar educated one if you think not feeding your kid appropriately is a good thing to do", "The main reason she feeds the child those things are because 1.  They are the easiest things to grab.  2.  Kids love them.  3.  She may not know how to cook.  And/Or 4.  It's what she likes to eat.  From the sounds of it, the kid is not obese which is good.  However...again...some education could be good here.  I know a lot of people think that kids can eat the same size birthday cake as an adult, that kids can have king sized candy bars, and they can't have multiple caffeinated drinks like an adult can a day.  Many parents don't look at the caloric intake for children and compare it to that of an adult.  They don't see that what they may ADD or hyperactive disorders could be triggered by all the caffeine/suar products the kids are consuming.  I'm sure this happens in non-poverity striken homes as well."]}