{"id": 20014, "submission_id": "14cvz0k", "title": "AITA for not buying my nephew a battle pass?", "selftext": "People are over for Father’s Day and my nephew 6 wants to play on our family’s ps5. He wants to play fortnite and he saw my daughter had a lot of skins. I told him he can’t play on my daughters account because she does play competitively and it would mess up her stats. He started getting upset because he wanted to use her skins and I said no. His mom my SIL started saying it’s not fair that my daughter has all of these skins and it’s a waste of my money to buy her all of them. I said I occasionally maybe get my daughter a battle pass (2-3 at the most) but she normally earns her own skins and v bucks. \n\nMy SIL said I could get my nephew a battle pass and let him play and I said “you can get your son a battle pass, it’s not that expensive” my SIL and nephew kept arguing and I grabbed the ps5 saying no one is playing today. My nephew started crying and throwing a fit and my SIL left saying I’m a major asshole. My daughter is on my side because I know she would have been mad if someone messed up her stats but my wife thinks it wasn’t that deep to let our nephew play. My IL are angry and told me this was a stupid hill to die on and left right after they ate.", "created_utc": 1687124339, "permalink": "/r/AmItheAsshole/comments/14cvz0k/aita_for_not_buying_my_nephew_a_battle_pass/", "score": 1107, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I could have got my nephew a battle pass and just paid for it while he was at my house. Maybe I did make things a bigger issue than what it was.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. Nephew needs to learn the importance of the word \"no\" followed by \"it's not yours so you need permission.\" Good on you for standing up for your daughter. \n\nThis is the 21st century of \"Fine, I'll just turn the car around.\"", "NTA.  You were willing to let him play, you just weren’t willing to let him play on someone else’s account.  It’s a bit like letting your kid have a few special toys they don’t have to let company play with because they’re cared for carefully by the child and other kids might play rough with them and damage them.  I think most of the little girls I knew growing up had something like a “special edition” Barbie or expensive Disney doll that was special like that and only shared with very trusted friends, who they chose.  Your sister should have either told him to make do with the basic game or bought him the skins herself.  Demanding you let him play your daughter’s account or pay for the skins was entitled and wrong.", "Of course NTA.  I don't ever feed entitled people. Your SIL is an AH and your nephew is a brat.", "NTA. What your daughter has isn't anyone else's business and it doesn't give anyone else a right to use her things.\n\nIt's not your responsibility to buy things for your nephew. If your SIL wanted her son to have something, she is the one that should be paying for it. \n\nAt 6 he is old enough to know he can't have everything he wants and his parents need to control his tantrums instead of enabling them!", "NTA in my opinion. I get that he is your nephew but your SIL can buy him one! Sometimes kids need to be taught that they can’t always get what they want! They were your daughter’s therefore they do not belong to him! SIL is teaching him that he can get whatever he wants even if it’s someone else’s!! Entitled!!", "NTA. Quite the ILs you have, demanding you buy your nephew something after you hosted them for a meal.", "NTA. I taught my children early on “that’s not yours” when they wanted other kids stuff. I never put it on the other child or parent.", "NTA. It's concerning that you SIL hasn't taught her son what \"no\" means and everyone threw a tantrum over it. They're not entitled to your property or your daughter's account.", "NTA - not your kid, not your problem", "NTA\n\nYour SIL can buy her kid a battle pass himself.", "NTA. I get it kids LOVE Fortnite but common decency still applies here! Their parents should have explained to the kid that he’s a guest in the house and that’s that. BUT I would also add this - being a generous host maybe could have let the kid try a round or two with the skin not the biggest deal in the world but still it’s your house and your daughters acct. sooo..", "NTA\n\n&#x200B;\n\nYOur wife is an AH. Maybe let the nephew play with her cosmetics instead.", "Nta like you said if he desperately wants the skins SIL can buy them herself. Idk why they act so entitled to your and your daughters stuff.", "I agree. Stupid hill for them to die on. NTA", "You don’t need to spend often at all if you outplay it, I know what you are referring to. No reason to spend for him throwing a hissy fit.\n\nNephew was being spoiled, and his mother was enabling it. Good for you for not also enabling it!\n\nNTA", "NTA\n\nSo SIL thinks it’s a waste of money. But also that her son is entitled to it. At your expense. Make it make sense.\n\nYour ILs are right about it being a stupid hill to die on. SIL’s the one who died on it, though.", "NTA \n\nYour SIL can indulge her own child as much as she wants, but your nephew can either play by your rules in your house or not at all. You are not obligated to buy battle passes, skins, etc for him and it was important to protect your daughter's progress and stats since this is her home.", "NTA as a gamer I would be annoyed if someone played on my account - so well done for protecting your kid.  As for the skins, it’s your money and your kid - how you spend it and what she buys is no one else’s business.  \n\nA new user could be set up on the ps5 and others can play the same game without messing with your daughters stuff - it would be the basic game though not any extras……..if that wasn’t good enough then too bad for them.", "This is a stupid hill to die on...\n\nWTF is wrong with your In Laws?\n\nNTA", "NTA. Your SIL needs to learn not to encourage jealousy in her kid.", "NTA, high 5 for respecting your daughter's thing.\n\n6 is very young for fortnight too. I'm not hugely bothered by age ratings, but he's literally half the age. Hope he's not talking to people on there", "NTA\n\nTelling your SIL that she could pay for your nephew's battle pass was the correct thing to do. Honestly, your SIL sounds like a choosing beggar, and I feel very sorry for your brother for marrying her.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nPeople are over for Father’s Day and my nephew 6 wants to play on our family’s ps5. He wants to play fortnite and he saw my daughter had a lot of skins. I told him he can’t play on my daughters account because she does play competitively and it would mess up her stats. He started getting upset because he wanted to use her skins and I said no. His mom my SIL started saying it’s not fair that my daughter has all of these skins and it’s a waste of my money to buy her all of them. I said I occasionally maybe 2-3 get my daughter a battle pass but she normally earns her own skins and v bucks. \n\nMy SIL said I could get my nephew a battle pass and let him play and I said “you can get your son a battle pass, it’s not that expensive” my SIL and nephew kept arguing and I grabbed the ps5 saying no one is playing today. My nephew started crying and throwing a fit and my SIL left saying I’m a major asshole. My daughter is on my side because I know she would have been mad if someone messed up her stats but my wife thinks it wasn’t that deep to let our nephew play. My IL are angry and told me this was a stupid hill to die on and left right after they ate.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "The entitlement is really startling lol NTA. Why are you supposed to make things fair between your daughter and your nephew?", "NTA, nephew an SIA need to not be entitled, your money belongs to you", "NTA.  Good on you for following through!", "Really stupid hill to die on... Won't play on PS5 without skins? What a walnut this kid/SIL is.\n\n\nNTA.", "NTA the battle pass is like $10 to get enough vbucks", "NTA. It’s the entitlement for me.", "NTA - your entitled in-laws need to grow the f up .  You took the logical solution.  They need to teach your nephew the word no means no.  Your SIL has some real entitlement issues and also needs to learn what no means", "NTA and this is from someone who only plays so my daughter can laugh at me as I get killed left and right. I completely suck at games and have no interest in the whatsoever. However, my late husband and my daughter that was their fun time. He worked away and the two would catch up a lot in the games. It was how they bonded and all she has all their old play saved on her older systems. He died on her 15th birthday and she asked me on her 16th if I would play with her. When someone would say to me before that it was a waste of time and brain cells, I would reply, sure I agree but it was how those two connected and I would  never disparage that. So yes to me it is a waste of brain cells, but to my daughter it is an irreplaceable memory of the joy she felt bonding with her dad while he was thousands of miles away. So to the ones saying it is a horrible hill to die on they can kindly fuck off. This is something your child feels confident in and you stood up for that that is going to become one of those irreplaceable moments for your daughter because we are not guaranteed time at all. Plus your nephew and SIL are entitled as hell and I never reward that lol.", "“Buy my son a Battle Pass. It’s not a big deal.”\n\n“Ok. Give me ten dollars.”\n\n“No, no, no. You misunderstand. It’s not a big deal for YOU to buy it.”\n\n“No.  I will not do that.”\n\n“THEN I’M LEAVING!”\n\n“Ok.”", "NTA, and isn't 6 quite young to be playing video games? My son is 6 and I'm not even considering gaming for a few more years. And even then maybe just the switch so the whole family can do the movement games.", "At the same time you probably have a older ps4 that the dang kid could play on that wouldn’t ruin your spoiled ass kids stats. Lol I’m a grown man so I think children should be told NO amd THATS NOT YOURS.. not adults lol", "Growing up there were a few relatives that were notorious among my siblings for messing up games. I don't even think they did it on purpose to be mean. They just seemed clueless about general etiquette in very specific areas. \n\nAny time we knew they were visiting, we'd end up hiding half our games so our saves wouldn't get deleted.", "NTA But innocent question, do people really let little kids play Fortnite? I thought it was more a young teen game.", "well done. people might not understand the importance of this stuff because they dont do it. you were right to protect your daughter's account kids tend to get into stuff and mess it up. his mom was just being a mom everything is fine", "NTA, make it a policy that no one else plays with you game console. Put it away or lock it up. You are under no obligation to purchase anything for your SIL so her child can play your PS5. Your wife and in-laws are wrong.", "NTA - your stuff, your rules. SIL has to learn that her kid can't go through life demanding other people's stuff. ILs need to tell her to stop demanding what doesn't belong to her. If they won't back off, tell them they can stay out.", "NTA. SIL is raising an entitled brat. IL's don't understand gaming. I'd ignore them. You and daughter should talk to your wife so she can understand why there was a confrontation. United front and what not.", "NTA, ok since your wife thinks it's not that big a deal ask her if she'd be fine with a coworker arbitrarily using her info and screwing up whatever metrics her job uses \"because it's not a big deal\"  Your daughter spends just as much effort on playing competitively as people do on work and likely has a tougher time maintaining her stats then most jobs metrics to boot.", "NTA\n\nFirst of all, if i invited people to my house and all they wanted to do was play my familys game console, then I'd be annoyed. Maybe you need more toys to play with? The tv shouldn't even be on, but idk, maybe that's just how I was raised.\n\nSecond of all, good on you for standing up for your daughter. So what, we have to throw away stats that your daughter (im sure) worked over time to achieve and is probably proud of so that this bratty 6 year old can have a special outfit in the game? Yeah, it's all a game. It's imaginary, so you could say the daughter shouldn't be that invested. At the same time, the same argument could be made for the 6 year old. It's a *character* in a *video game* that is *not his.* His mother should be telling him to respect other peoples property, and if hes still crying at that point then it should be treated as a tantrum. You and your daughter did nothing wrong, and anyone who thinks you did doesn't understand the whole stats thing. Some people just can't understand that it's similar to the pride you'd feel if you were in a sports team. They only see it as pixels on a screen. I think it would have been a breach of trust. Your daughter may have even felt betrayed by you if her work was destroyed to appease that little punk.", "NTA thank you for respecting your daughter's shit", "NTA but it sounds like you are having an argument with SIL who has no idea what Fortnite is or how it works. Tell her it’s rated M.", "NTA.\n\nGood for you. Children today have become insufferable bullies with their tantrums.\n\nTo avoid further trouble--because SIL hasn't finished with you and the skins, believe me--don't have her over anymore.", "You aren’t the a hole tbh because I myself have lost mad money and DLC from someone in my family giving my hard earned and very cherished items away to younger generations and not even asking my permission wich has ruined many many accomplishments and achievements and account stuff I’ll never see again..I get it", "Agreed but hey we’re not the parents so maybe a bit agressive lol", "Plenty of people play video games before 6 lol I remember playing super mario during the same time frame I would've been playing with little people", "My cousins kid once used my iPad and wasted all my power ups for a game on levels o had already cleared. NTA.", "OMG,  I'm a grown adult that plays Fortnite when I want to kill shit. I'm not a fan of military games so I play Fortnite cause it's more toony.\n\nLet me explain how the \"Battle pass\" works.\n\nOnce you purchase the battle pass, it unlocks the battle pass page.  You get 2 free items out of 10 per page, to get the other 8, you unlock it by buying the battle pass.\n\nThe battle pack section contains 10 pages.  Each page is unlocked 1 at a time.  You unlock it by earning points in game.  Each page will get you 1 or 2 skins.  To get all 10-15 skins (I don't remember exact amount) you must get to level 100.  \n\nTo get to level 100, and unlock the extra 5 pages (plus 5-10 more skin) you have to get to I believe level 200 (maybe 150).  Once you get all pages unlocked and level all the way up and get all the points, you actually earn enough VBucks (as battle pass rewards) to buy the battle pass again next season with some left over.\n\nI played for almost 8 hours off and on last night, and I only got to level 25-30.  To get all 100 levels with all the skins it'll take like a week of playing almost 8 hours a day.  Maybe less with kids having a higher stamina than I do.\n\nThis means, even if you did buy the battle pass, he still would be stuck with the main 2 skins until he's played for hours and there is no way he's going to get the skins she has because they normally don't put out the same skins twice and if they do it's rare.\n\nThe only way to get him a lot of skins right away for him to play with is to buy the skins directly at like $10-20 PER SKIN.\n\nNTA - when at someone elses house, you play with what you are given, you don't make demands.", "Six year olds have no business playing Fortnite. This is especially true using serious gamer's account. And furthermore, they are cheap assholes for expecting you to pay. And the other in-laws are jerks too. Consider avoiding these parasites in the future.", "NTA\n\nLock that ps5 when you're daughter and you aren't around I don't trust your wife not to just give it away", "NTA. \n\nI bet your IL’s wouldn’t feel the same way if the roles were reversed.", "NTA", "NTA. No is a complete sentence.", "Man, I would make a point that NONE of your in-laws are allowed back into your home until they understand that good ‘ol sentiment of “my house, my rules”… although my Gen X ass adjusted it to “our family’s house, our rules”. \n\nI mean, take something your FIL enjoys… Cars? Chess? Piano? Sunday book full of stories? Give your nephew a box of colorful Sharpie markers and tell him to go nuts at their house! “The world is your canvas!!!” \n\nTheir tone will change real fuckin’ quick! \n\nNTA and stand your ground with prejudice!", "NTA.  Well you can see how you and your daughter rate compared to your SIL and nephew in your in laws eyes.  You have every right to stand up for your child and ensure someone else does not mess with their stuff.  And your SIL is an AH for continuing to push and refusing to pay for her own child's games.  I'd tell your MIL and FIL that sticking up for your child is definitely not a stupid hill to die on.  And I'd ask your wife why placating her nephew is more important to her than supporting her own daughter.", "NTA and you would have damaged your relationship with your daughter if you had let him mess up her stats/account. Your SIL can pay for her own child if she thinks he needs the skins so bad", "NTA.  Your SiL is acting in a very sexist manner. You offered a very good option of her buying a battle pass, but she was too cheap to go that route.", "NTA, he is six years old and should understand the word no and understand that the world does not revolve around him.  The issue is his AH mother.  He is her child, let her or the other IL pay for it. Your daughter earned a status in the game and it not to be shared.", "Nta, the kid is ignorant, but SIL is TA", "NTA\n\nYour nephew and his family need to learn the word no. But also they have no idea what it means to be competitive at a game so they might not think this is the hill to die in, but it absolutely is.", "Nobody is dying on hill because there are NO stakes here.\n\nWhy in the world would YOU pay for the battle pass over your nephew's own parents????\n\nNot to mention your daughter doesn't want someone else using her account.\n\nYou buy your daughter things, your sister in law can buy her son things.\n\nI can't even believe this was at all complicated.\n\n&#x200B;\n\nNTA", "NTA. lol why does a 6 year old need a battle pass and why can’t his mum get one for him? Your ability to get nice skins (or anything, really) for your kid is nobody’s business but your own. I would spoil my kids game wise but for my nieces and nephews? They can ask their parents.", "Nta. She can take him home if she can't parent.", "NTA, its very understandable that when you play for competitions stats aren't important, and even more important. If it isn't yours, you don't get to just take it.", "[deleted]", "Hill to die on, putting boundaries to a 6 year old? Thats just silly. Anyways, cant you play unranked in fortnite, using the same skins? Not that it matters much, no means no.", "The child is 6 years old, he can go play with legos. He does not need to be playing fortnight. OP is right, no one should be playing video games anyways, it's a family get together on a sort of technically holiday. And OPs wife is clearly very unsupportive of the daughter, cause playing even semi competitively means the game is important and she must mention it a lot, and what certain things mean, hence OP knowing stats are important, how she got the skins. OP, can you lock up the PS whenever you and your daughter aren't home? Just a key for you and her? I don't trust your wife not to let the little grenlin play on it if SiL is ever over again, or any one else you might know for that matter with kids.", "Yes! I know a lot of people don't understand video games and stats, which does not make it less important. To a kid who plays competitively, this is her \"job.\" I'm sure she takes it very seriously. If your wife spends money on high-end cosmetics, clothes, trinkets... whatever is important to her, would she be fine with a 6 year old playing with it?", "It's the exact hill I would have died on if I were him. But I would have pointed out to my inlaws, I'm not dying. I'm f'n winning! It's my GD hill now!", "It’s funny how it’s not a big deal when troubling  others, but suddenly it is when THEY themselves are being called out to do it instead.", "I’d say it’s way too young for fort night based on my friends with younger kids - they don’t allow it.", "Due to cross play if you're logged into the same account which they most likely would be then it would ruin the stats since the accounts are completely in sync.", "OR the kid can handle not playing video games for a few hours/one day. He will survive. He'll be fine.", "Why can his actual parent buy one? He doesn't have to buy something for a kid who's throwing a tantrum, especially when it's not his kid.", "NTA, and I just want to say thank you for empowering your daughter to enjoy gaming. It is refreshing. It is her hobby, and you protected her investment in her hobby.", "NTA.  You got it right when you said she could buy him a battle pass if it was that important.  It clearly wasn't important enough for her to spend money on her own kid, so it's not important for you to do it either.", "Agree with the above - your sil is an AH, your nephew is a brat and sorry dude but your wife is a bit of an AH too.\n\nTell your daughter to code lock her ps profile so that no-one else can use it without her permission. Your wife doesn't get it and I suspect that she would let the nephew play even though your daughter has said no.", "NTA. Just because other people don’t get it, it doesn’t mean that your daughter’s gaming stats don’t matter. They are really important to her, and you were protecting  something that matters to her. You set a boundary and your IL and nephew didn’t like that you didn’t acquiesce to them. That makes your response unexpected and not a desired outcome to them, but it doesn’t make you an asshole.", "NTA.  If he wants to play Fortnite, she can buy him a console, the battle pass, etc.", "NTA I would be pissed if someone used my game too", "He’s six he shouldn’t even play Fortnite I’ll die on this hill", "[removed]", "NTA\n\nYes, yes it was a stupid hill for your sister to die on.\n\nHappy Father's Day!", "NTA and can I just say this is such a wholesome example of modern parenting. Your daughter will remember and appreciate that you had her back!!", "NTA. You did right by all concerned, sorry your nephew and the other members of the family failed to see that. Nice job looking out for your daughter.", "NTA\n\nBut I would maybe set a password on the ps5 itself or lock up the controllers (give your daughter a key) because I can guarantee the minute you're not there your wife will let your nephew play on her account", "NTA   \n\n\nand your wife doesn't seem to understand how much this means to your daughter, maybe talk to her about the time and skill needed to get to where she is. Lots of people ignore their kids hobbies and then end up being really thoughtless and mean because of it, even without meaning to.", "NTA. The entitlement of your SIL is the hill they should talk about dying on. She could’ve easily bought the pass and the skins he wanted.", "How is it “not fair” that your child has something hers doesn’t?\n\nWait til she finds out different families live in different sized houses and don’t all have the exact same possessions. 🙄\n\nNTA", "Not to be the Ahole myself but your relationship with your daughter trump's your relationship with IL's. Stand your ground and defend yourself and your daughter.", "NTA. Kids need to learn they can't just take what other people have, just because they want it. It's fine to ask, but you have to accept no as an answer.", "NTA sometimes the answer is no and he needs to accept it. His mom is so concerned she should buy it herself. Rude and entitled mom and kid. And thanks for sticking up for your daughter. She is going to always remember that .", "NTA.\nSome people have a false sense of entitlement, and they extend that onto their kids.", "NTA.\n\nMy father had a rule that if I whined about something, I *automatically* did not get whatever it was that I was asking for or whining about.\n\nI tested this exactly twice.\n\nThe first time, bc of course I had to whine about something. It was a toy, and we walked out of the store without buying anything- including the toys I had previously been told \"yes\" for.\n\nThe second time, I had to test it, to see if the 1st time was a fluke. \n\nIt was not.\n\nI never tested it again, and never needed to... and as a result, I learned VERY early on what the word \"no\" meant, and not to be a whiny brat, because the second I did, I wouldn't get what I wanted.\n\nYou did the exact right thing- as soon as nephew got whiny, \"now no one gets to play.\"\n\nThe fact that he threw a tantrum is proof that he needed the lesson (and arguably his mom threw a tantrum of her own).", "YTA", "Also it’s refreshing to have someone actually respect video games, in a sense. We’ve all encountered stories (either on here or just in our lives) about people who don’t understand the importance of save files/game progress and will cause issues there somehow by saying “oh it’s just a game, what’s the big deal?”. I don’t know if OP plays themselves, but if they don’t they still respected the importance of their daughter’s account which is awesome", "Ah, it's only a waste of money if it's *her* money, you see.\n\nShe seems to be one of those \"video games are for kids! But let my child play games on your phone!\" People", "That's exactly what I was thinking; and the kid probably wanted to play with time limited skins anyway and would have chucked a fit even with the battle pass.", "They do yeah, most parents nowadays don’t care about what media their children consume as long as they don’t have to deal with them", "Ehhh, would depend on the game, there are quite a few games rated for kids that young", "My children play switch only.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "You can but what outcomes you get in unranked can effect your ranking.", "Uh isn't fortnite rated 13+ anyways. He shouldn't be playing with it no matter what.", "How was what he said aggressive? Dudes just right. Parents did a poor job of teaching their kid respectful treatment of other people's property. Also the SIL's insistence that op can just buy their son a battle pass is ridiculous, buy your own damn son the battle pass. It's not even just the kid was bratty, he's 6, it's understandable even if it's irritating af. It's about the SIL enabling their child's shitty and spoilt behaviour", "True as well sir", "Dont sound very unranked then, but oh well", "It is, but I’ve had to point out to a mom in a store that GTA is inappropriate for a 7 year old and she threw a massive fit because he wanted it. Some parents don’t care.", "i would guess that a large percentage of the playerbase is under 13", "My nephew is 5 and kicks my ass in fortnite, but we're mostly doing that create a world thingy and crashing cars into each other. Sometimes his mom joins us and we shoot zombies. Little dude is amazing at it and I can barely manage the controls!", "Its because Epic is still in beta mode for it. So for now everything effects ranks.", "True, I love creative games as well, sometimes they are more fun than br", "NTA\n\nHe shouldn't be playing Fortnite in the first place.", "Obviously SIL and nephew have never heard the word NO.  Got for you for expanding their vocabulary NTA", ">My SIL said I could get my nephew a battle pass and let him play and I said “you can get your son a battle pass, it’s not that expensive”\n\nNTA If it's not that expensive she could have paid you the money for it", "NTA first off, no 6 year old should play fortnite. 2nd off its her account. That kid needs to suck it up.", "NTA the nephew sounds awfully spoiled.", "Nta", "NTA. If someone would mess with my account in the game I'm playing with, I'd be so damn fucking mad. Yes, it's that deep. If someone puts a lot of time in a game to learn, progress, and have good scores, that makes it deep. \n\nAnd like you said, it's their kid, they should buy him a battle pass.", "NTA. The way I see it, you established a boundary, nephew and SIL wanted to violate that boundary, so took away the boundary line so that it could not be crossed. Actually I think this is pretty healthy", "NTA, you a chad dad don't let someone ruin your daughter's stats.", "NTA. They can buy it for their own nephew", "Nta, but I'm ignorant.  Could he have played fortnight using a different account without needing to pay for it? Like create a guest account, no skins(these are like character costumes right?) But the kid could build forts or whatever.", "NTA \n\nKids need to learn that \"no\" means \"no\", and that throwing a tantrum isn't going to get them what they want. If you bend to their meltdown, they learn that a meltdown gets them their desired results. \n\nYour SIL made it out to be no big deal, yet she didn't want to fork over the cash either. It's wild that she expected you to buy it for HER kid and had the audacity to call you an AH and leave before just buying it herself.", "NTA\n\nIt isn't the same, but I play and have spent money on Genshin Impact and wouldn't let *anybody* even dare to touch my account unless they'd be ready to agree to some strict rules. \n\nI have multiple refinements of battle pass weapons, multiple best-in-slot weapons for my favorite units, limited name cards, limited weapons, etc. You can't exactly ruin my stats but you can ruin my work (you could easily click the lock on a best-in-slot weapon on one of my characters and feed it to a not-as-good weapon) and that was your point. \n\nAs someone who does take my investment into my games seriously, thank you for looking out for your daughter. She's put work in for those stats.", "Why is a 6yo playing fortnite anyways? He shouldn't know what battle pass and skins are smh.\n\nNTA you would have let him play. You didn't tell him no, until your SIL demanded you buy extra shit from YOUR money, so that HER child could play a violent game with more skins.", "NTA I mean your SIL could’ve paid for it since it’s not that expensive.", "NTA\n\nWhy why why would anyone else feel entitled to your stuff at your house and ask you to buy them stuff like your stuff? Um, no. \n\nYour SIL can stuff it. \n\nYes, siblings and cousins need to learn to share but they also need to learn to respect someone else's property and learn they aren't entitled to whatever they want at someone else's house. I have no idea how your IL and wife are upset with you. It's your house, you get to have reasonable boundaries.", "It’s always interesting to me you were told that this isn’t a hill for you to die on but nephew-SIL-ILs believe they can die on it. No wonder the kid doesn’t understand NO. His mom doesn’t either. Hypocrites", "NTA - it's up to you what treats/games/toys you buy for your daughter to make her happy. If SIL wants to borrow your console they can log into their own online PS account and buy their own battle pass or play as a guest. It's common courtesy.\n\n You wouldn't expect that same entitlement if it was any other favourite toy potentially getting ruined. E.g if the 6yo wanted to play with a tamogotchi and would likely kill it, or play hairdresser with some dolls and cut their hair off", "NTA even if your daughter didn’t have an account that she wanted her stats kept on like this kid needs to learn that sometimes the answer is just no and your SIL needs to learn to give that answer. Comments hating on the kid are unnecessary though, he’s not nearly old enough to start unlearning behaviors taught to him by bad parenting", "NTA people need to stop feeling entitled to other people's things just cause they know them.", "The game is 14+ age.", "Knowing about all that Fortnite stuff as an adult makes you sound like a nerd", "I like, according to the ILs, it's OP \"dying on the hill\" because he refused to pay money so the graphics look a little different, but SIL isn't \"dying on the hill\" when she storms out mid event because her kid can't handle the word no.", " I would never disparage that,,", "Yes, this! They’re the ones that left so aren’t they the ones that died on the hill? 😂 The entitlement…", "I have my main which needs a code and then a guest account that anyone can use when they want to log in and play any of the games. Don’t have to worry about them messing up anything on my account and they get to play whatever they want", "Video games are fine at that age. Parents just need to know which games are helpful or okay for children. 6 year olds definitely shouldn’t play fortnite, lol.", "OP is a bastion of sanity for their daughter as her own mother/aunt/maternal grandparents were all ready and willing to let the younger cousin ruin her account's rating because they do not respect her simple boundary.", "On the same note, it's funny that it's OP apparently that's making a big deal out of nothing by simply refusing to pay money so the graphics look a little different, but it's completely OK for SIL to storm out of the party", "affect*", "Eh, most age ratings are a bit over the top.\nNo kid is getting traumatized by Fortnite.", "Its rated 13 because of cartoon violence.\n\nThe rating system, especially in the US is fucking dogshite.", "Yup, my parents let me play GTA when I was a 6 year old because my half-brother had the game laying around on the days when his dad had custody of him as he left his PS2 at mom's house. Looks like I developed my dark sense of humor at an earlier age though it was bound to happen as I am my mother's daughter. I still wouldn't let a kid touch the game considering what else it can do.", "Just me.  Blinking.  In an elementary school teacher kind of way.\n\nAll of them are 11 or under.  Way too many of them are also on tiktok.", "affects*", "Fortnite I can kinda understand. TikTok is just so toxic and unacceptable for kids to be on, imo. And I'm pretty fucking lax with media compared to a lot of parents. I don't care about swearing, mild nudity, some moderately scary shit, etc. My kids play Roblox, watch some PG-13 movies. My 10yo keeps asking why she can't be on TikTok even with the new profile restrictions for kids. She swears she won't \"do anything bad\" or watch inappropriate things. And I believe her. She's a rule follower to a fault. But I absolutely refuse to budge on the TikTok thing.", "Nta tell them to buy the kids a ps5 and a game pass and watch their little angel turn into a even worse spoiled child when he cant get the skins or stats that his friends and cousin have.", "NTA\nYour nephew and SIL sound like the type of people that give teachers nightmares", "NTA you're a great parent. They don't get it but stats can mean a lot to a kid, and I just wanna commend you for standing up for something that seems unimportant to most people", " absolutely NTA!!! screaming that from the top of my lungs! she can buy her OWN kid battle pass & skins if he needs it so badly.", "If it’s a stupid hill to die on why are they dying on it? ‘No means no nephew’. Easy conversation to have. Why is it people expect girls to just roll over and share their things? You’re a good dad for standing up for your daughter. NTA", "NTA\n\nYour daughter worked HARD to get to where she is, and allowing a less experienced player to use her account could have ruined her. As you said,some of her skins she had earnt through pure skill.\n\nNot Fortnight, I’m not into PvP, butin another game there were certain skins that could only be earnt. I know how upset one tournament winner was when a dev was seen in game wearing a Tournament Winner crown. Now devs can create anything they want skinwise but there were only two players legitimately entitled to wear that crown - my friend and ThePat.", "NTA Your SIL’s teaching her son to be entitled.    She should’ve calmed him down and taught him that skins must be earned.", "NTA --- IL are on the SIL's side but still stayed for the food and then left why didn't they walk out right away if there that angry?.", "If \"it's not that expensive,\" then SIL can pay you to buy it.\n\nNTA, and, the entitlement boggles the mind.", "NTA\nYour daughter must be happy to have a father who understands and respects her hobbies :)", "NTA , honestly you’re more the hero here. Understanding the importance of stats and ranked game for your daughter is a incredible move. Most parents don’t care and don’t understand the investment someone can have in a competitive video games. She will be thankful and you won parent points there for sure \n\nThe nephew have to learn the hard lessons that being a child doesn’t mean you get it your ways all the time. And screw the sister in law, she is not the important one here !\n\nYou daughter will be happy that you take the side of what matters to her and that’s what’s important !", "INFO\n\nHow Much is a battle pass?\n\nHow did he see the skins? Did he turn on the console expecting to be able to play?", "NTA - why is it unfair your daughter has the skins? Ridiculous.", "\"It's not fair\" meaning \"You should my child the same thing you give your own child, even though I won't\"\n\nThe IL are right though, it is a stupid hill to die. Want to use someone elses things and being upset when someone else wont spend their money on you is a dubm hill to be the king of. Not sure why they want to plant their flag there.\n\nNTA", "NTA you're a good Dad who understands consoles and gaming and that you cant pause an online game", "NTA\n\nher child, her money, her problem.", "Yta, get that kid da battle pass 🤑", "NTA.  Screw your SIL.  Your in laws are also ah, they were so disgusted but they still ate first, fuck them.", "Your daughter works hard for her stats and should not have to share her toys if she doesn't want to. NTA.", "I’m struggling to see why you would pay for it as opposed to his mother.\n\nNTA", "A six year old is too young to play on that game and your SIL and ILs are TAHs. Jesus, entertain your kids! Don’t stick them in front of game consoles!", "NTA.. the entitlement of these people!! Good job you.. they just wanted you to take the easy way and avoid the drama of these people", "NTA I think I can safely say you avoided troubles with your daughter. A game account is personal until said otherwise by its owner, and only its owner gets to decide who can play on it, good choice OP (and bad parenting here SIL, no means no, get your son a battle pass yourself)", "SIL says it’s a waste of money yet…wanted you to waste *your* money.\n\nAs a gamer, I think it’s very dope you were protective of your daughters saved games. Might have even thought *right on* when you took the whole console away (something I would’ve did TBH)\n\nNTA. Your wife sucks for not backing you on this btw. I spend a lot of time and money into my games including modifications. I would be livid if someone touched my shit without permission, family or not.", "NTA\n\nWtf is wrong with your in-laws? If they think it’s not a big deal then they should buy the pass, it’s as easy as that.", "NTA and as a female gamer, thank you for respecting your daughter and her hobby enough to protect it from being damaged because that's what it would have done. To some people, it's just a game, to gamers its their passion, and girl gamers get enough crap as it is.", "NTA\n\nNephew is a scrub who needs to get good.", "NTA. I think your wife and in-laws may think “it’s just a game what’s the big deal”. But as a gamer, it’s not just a game. They don’t understand. Good on you for standing up for your daughter. Nephew needs to learn no means no and crying won’t get him his way.", "NTA. How very modern of you. Sorry if that comes off as an insult. Just cool to see a parent not be ignorant about that and just think it’s not a big deal because it’s just a game.", "Funny how your inlaws said it was a stupid hill to die on, why didn't they say that to SIL? She's the one who was being entitled. No wonder nephew threw a tanty - guess where he learned that? NTA. Why do people feel entitled to other peoples property?", "And your sil needs to learn life isn’t fair.", "Let his parents fund his gaming and not on your family machine. NTA\n\nWife and I are gamers ourselves and we don’t really share our accounts.", "That's it, back to Winnipeg!", "This… \nYour sil is going to eventually regret giving into her sons demands like this, she’s raising an entitled spoilt brat.\n\nGood on you for respecting your daughters stuff\n\nNTA", "Yeah, WTF is going on with the wife?", "Not mid event, they ate then left.", "It's not super clear in the post but when OP said ILs left after they ate I assumed he meant MIL and FIL, because SIL seemed to leave as soon as her son started to throw a fit. So the way I read it was this sequence of events: OP took the PS5 away. SIL left with nephew. Those remaining ate. FIL and MIL said OP chose a dumb hill to die on, and left.", "Good for you for pointing it out twice that im dyslexic.", "Lots of kids are falling their predatory tactics tho", "Ik but srsly 6 yo playing a battle royale doesn't seem very child friendly", "What’s GTA?", "True.\nTho I think that's more because their parents haven't taught them to be smart with money than them being too young for the game.\nMy parents taught me that when I was like 4 and I've probably spent no more than £5 in microtransactions in like 15 years.", "So I want to do this when my kids are of age, but what if they access it at school? Through their friends ? How do you go about that whole out of the house situation ?", "That’s a hill worth dying on.  I seriously regret letting my young teen have TikTok.  IG is almost as bad and harder to police, too.", "GTA stands for Grand Theft Auto, something little kids should not be playing, it's rated mature for reasons.", "Seriously? Grand Theft Auto. \n\nIt’s a highly vulgar, violent, and incredibly popular video game franchise.", "Grand Theft Auto- it's a large video game franchise centered around playing as a criminal in a fictional world. It's pretty much parody, but jts very much unsuitable for kids. I played it first around 15 or so and I would say that's probably a sensible age, although it's legally rated for over 18s. Has swearing, violence, drugs, sexual content and that's just off the top of my head. \n\nIn my opinion up there for one of the best game series ever made."]}