{"id": 20252, "submission_id": "14ffhh8", "title": "AITA for refusing to try and keep my kids quiet so my SIL could sleep?", "selftext": "My SIL, her husband and their kid currently live with myself, my husband and our 3 kids. Their house burnt down and it's in the process of being rebuilt. They've been here 2 months. My SIL works overnights 3 nights a week, her husband doesn't work. I work from home and my husband works 5-6 days a week installing docks. \n\nNow, even on the days that SIL doesn't work, she insists that my kids remain quiet and don't make noise at all because she will insist on sleeping until 4-5pm after going to bed at 11pm the night prior. She claims it's because her body can't handle the sleeping schedule but she refused to switch to day shifts. I'm honestly fucking sick of trying to keep my kids quiet literally ALL day and most of the afternoon so she can sleep, while I'm trying to work on top of that. My son has ADHD and he is off the walls most of the time so I'm constantly having to stop what I'm doing (work) to go and correct my kid for having fun in his own house. I told my husband this wasn't working and that we needed to sit down with SIL and tell her this isn't working out and come up with an alternative.\n\nSo we sat her down yesterday and basically told her she had 3 options.. either but noise canceling headphones, put a camper on our property and sleep out there or change her work schedule because I will not be telling my kids to be quiet from sun up till sun down anymore. She said she can't sleep with headphones, doesn't want to change her schedule due to the pay differential and can't afford a camper. I basically told her those were her options. Take it or leave it. Today I did not try to keep my kids quiet. I shouldn't have to in their home. SIL comes down bitching because she can't sleep and I pretty much told her tough shit. I gave her options and she refused all of them. AITA?", "created_utc": 1687372215, "permalink": "/r/AmItheAsshole/comments/14ffhh8/aita_for_refusing_to_try_and_keep_my_kids_quiet/", "score": 111, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > The only reason I feel like an AH is because I know how I am when I don't get enough sleep so I'm sure she is pissed but she's also in my home and I'm tired of not allowing my kids to be kids because of her sleeping troubles.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "There is a 4th option:  they can live somewhere else. \n\nAnd why isnt her hubs working?  Is he a stay-at-home Dad?", "NTA. Beggars can't be choosers. You've taken her in after the fire, which is a nice thing to do, but it is YOUR children's house first, and she needs to remember that. Keeping your kids quiet 24/7 for the indefinite future is a non-starter.\n\nBesides, when she gets tired enough, she'll sleep.", "NTA, you’ve given her options. Earplugs are amazing.", "NTA. If there’s one place where kids should be free to run around and make noise and have fun, it should be at their own home. \n\nShe doesn’t like headphones? Maybe earplugs would easier for her to wear.", "NTA\n\nTell her to try earplugs instead of noise cancelling headphones. If she says she can't use them, she's just trying to be difficult at that point. She's lucky they're able to stay with you while their house is being re-built. Not everyone has the option of staying with family.", "NTA, I saw you mentioned her husband does not work? Uh could he at least help by taling care of his nephews/nieces? I mean it would be of great help to help his wife that does work these night shifts. At least help in some form considering you don’t HAVE to have them stay with you.", "NTA when I worked overnights I got a white noise machine to drown out my loud roommates (and their dogs) and it worked wonders.", "NTA.  I see they have a kid as well… Does the brother-in-law spend his days muzzling the kid or what?  If she’s sleeping till four or five even on her days off when does she ever interact with her own child? There’s a lot of problems here, and none of them should be yours. Your husband, presumably her brother, needs to have a come to Jesus talk with her about learning appreciation, gratitude, and being reasonable, and not biting the hand that feeds her", "NTA - You have been accommodating in your own space for two months without expecting anything in return.  Reminds me of a quote from Ben Franklin, \"Guests, like fish, begin to smell after three days.\"\n\nFurther, you also offered solutions.  While the camper and changing her schedule may not be as easy to do, noise canceling headphones are a doable solution.  If her needs can't be met while staying at yours for free, she can find another place.  It's unreasonable to think that kids will not play during the day while they are awake.", "NTA and I don't understand why SIL is living there in the first place. Most insurance policies provide money for alternate accommodations while the house is being repaired after a fire. Check the policy for **Loss of use**.", "NTA\n\nYou've been accommodating and gave her ideas to help her issue.", "NTA- because she wont even try any other options.   white noise machine could help too. Kids need some time to be kids. And she is in YOUR home.", "Info: Why are they living with you? Shouldn't their homeowners insurance should be covering the cost of housing while they rebuild... That's what happened for my parents... Not inclined to say you're ta no matter the answer, but just wondering why they are even there...", "NTA. In a situation like this, you've done a lot to help out on top of everything else that you do. I'm not sure how long the house will take to be rebuilt but maybe SIL needs to change her schedule until it's done, then switch back. It's asinine to insist the house be absolutely quiet for her unusual (and seemingly excessive) sleep schedule.", "NTA \n\nFirst off it's your house so your rules, but also who tries to tell kids they have to be silent all day? It's their house not hers.", "NTA. Consideration works both ways.", "NTA. Your kids should not have to be quiet all day in their own home. Your sister in law must buy her audacity in bulk from costco. It is ridiculous.", "NTA - \"This is the noise level in our home. You can deal with it or stay elsewhere.\"", "NTA. I'm with you. Sounds like she and her unemployed hubby need to stop imposing on your hard-working family and figure something out.", "I sympathize with your SIL, but she's not being realistic here. You're putting her family up out of kindness, because their home burned down and is being rebuilt. That sucks for her. I'm sure she'd far rather be in her own home.\n\nBut expecting your kids to be silent all day, in their own home, because she works nights, is unreasonable. They are kids, and they are going to make some level of noise.\n\n(It's reasonable to ask your kids to go outside if they want to be especially rowdy. You work from home and probably don't want them yelling and screaming inside either. But it's not reasonable to expect them to pretend that their home is a library.)\n\nNTA", "INFO: Is your SIL and her family contributing to your household (in the form of rent or anything else)? \n\nNot that it really matters, because you're right that it's your kids' home and they shouldn't have to be quiet in it all the time.", "NTA  tell them they are welcome to ask to other friends and relatives that are childfree for shelter.", "NTA ~ I worked overnights, you can’t expect those w around you to stop living their lives because of your schedule.", "NTA, it's time for sil to take her ungrateful ass and her lazy husband elsewhere", "Hells nah. You gave her options. She doesn’t appreciate that you let her stay there. Her home owners insurance could have paid a hotel. You’re not the a-hole", "NTA. You gave her 3 options and she didn't like any of them. Tell her to kick rocks.", "NTA. Keeping kids quiet all day every day is impossible. Also, you work from home and just cannot keep them busy with quiet activities. SIL has to realize she is getting free shelter and it's actually her responsibility to make her stay as free of problem as possible. Her unemployed husband can play with kids all days and keep them quiet, but she wants you to lose your job and entertain all kids including hers for her convenience.", "Nta its been 2 months!", "> I gave her options and she refused all of them. AITA?\n\nNTA. She's worn out her welcome.", "Is she depressed?  That’s a lot of sleeping on her days off.", "She insists on 11pm - 4pm sleep?? So 17 hours? I read this wrong didn’t I? Tell me I did", "NTA\n\nI empathize with her tiredness, but you're already doing a huge favor letting her live there and she can't reasonably expect a whole household to be quiet for her specific unusual schedule. You told her very reasonable options.", "NTA, it is your house and your kids should be able to have fun even if it does mean they are a little loud.\nIf being loud is the only way for your son to be happy and comfortable, then he should be able to do so. Having him mask it by telling him to be quiet and not run around can feel as you’re being pent up. \nYou have opened your home up to SIL and family and should respect that your household may not work the way hers does.", "NTA!", "NTA but your SIL is.  It is your and your kids home.  You are under no obligation to house these people ( the whole ‘family’ thing is not a valid reason).  If your SIL is not happy then she is happy to leave now but she has no rights to dictate anything in your home.", "NTA- she's crazy to think she can show up and dictate your schedule around hers.  the only thing you did wrong was taking as long as you did to get to nope.", "NTA. What does SILs husband do all day if he doesn't work? Why can't he pitch in and keep the kids quiet, why is that somehow your job? Definitely high time for them to go anyhow, but why isn't her husband expected to help out?", "Nope, NTA. I'd throw in a fourth option of her husband getting a job but otherwise your advice is golden.", "she has a 4th option - MOVE OUT!", "They had insurance right? I'm pretty sure it pays for hotel, etc. Until the rebuilding is complete.", "NTA you already tried to reason with her and gave her reasonable options.\n\nIf she didn't agree with any of the 3 options, she could have suggested some compromise also instead of just ignoring the issue.\n\nIt's not reasonable to expect a household with 3 kids to be quiet all day like it's a library, it's also kind of unhealthy for the kids to constantly be told to be quiet during the day when they're in their own home. Kids are very impressional and being told to keep silent all the time in a place that's supposed to be a safe space for them could have long term effects even after SIL's family is ready to move out. After a long time they'll start feeling like they're just supposed to shut up all the time even when they don't have to.\n\nAlso I don't really see how she absolutely can't sleep with some noise if she's that tired.", "NTA.  Overnights are rough but she is expecting you and your kids to accommodate her when she isn't willing to make any changes??  \n\nI don't think I could sleep with headphones either because I'm a side sleeper and all-over-the-place sleeper, but foam ear plugs and music from the calm app do wonders to put me to sleep.\n\nIt's great you were willing and able to help them out, but she needs to be willing to make some changes and your children can't be expected to literally NOT be children indefinitely.  \n\nMaybe she should change shifts and work day shifts if the housing situation she is fortunate enough to be in isn't conducive to sleeping during the day.", "NTA and talk about choosing beggar\n\nLet her get a hotel room see how well she sleeps during the afternoon.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy SIL, her husband and their kid currently live with myself, my husband and our 3 kids. Their house burnt down and it's in the process of being rebuilt. They've been here 2 months. My SIL works overnights 3 nights a week, her husband doesn't work. I work from home and my husband works 5-6 days a week installing docks. \n\nNow, even on the days that SIL doesn't work, she insists that my kids remain quiet and don't make noise at all because she will insist on sleeping until 4-5pm after going to bed at 11pm the night prior. She claims it's because her body can't handle the sleeping schedule but she refused to switch to day shifts. I'm honestly fucking sick of trying to keep my kids quiet literally ALL day and most of the afternoon so she can sleep, while I'm trying to work on top of that. My son has ADHD and he is off the walls most of the time so I'm constantly having to stop what I'm doing (work) to go and correct my kid for having fun in his own house. I told my husband this wasn't working and that we needed to sit down with SIL and tell her this isn't working out and come up with an alternative.\n\nSo we sat her down yesterday and basically told her she had 3 options.. either but noise canceling headphones, put a camper on our property and sleep out there or change her work schedule because I will not be telling my kids to be quiet from sun up till sun down anymore. She said she can't sleep with headphones, doesn't want to change her schedule due to the pay differential and can't afford a camper. I basically told her those were her options. Take it or leave it. Today I did not try to keep my kids quiet. I shouldn't have to in their home. SIL comes down bitching because she can't sleep and I pretty much told her tough shit. I gave her options and she refused all of them. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. Maybe they could afford other accommodations if her husband got a job, and if he is disabled and unable to work, should be working on a disability diagnosis and applying for social security (albeit that could take years for an approval). It’s not your responsibility to make it work, it’s hers.", "NTA", "NTA. I work rotating shift work sometimes. Earplugs. SIL needs to remember she is a *guest* in *your house.*", "https://www.sleepphones.com/sleepphones/bluetooth-sleep-headphones\n\nThey make knockoff versions. They work pretty well! She can also hang a blanket over the door. NTA.", "NTA - you gave 3 reasonable options, tell her to leave if she keeps at it", "Wow, your SIL needs A LOT of sleep. Is she contributing to bills and paying rent? Even then she has no right to dictate what you and your family do in your family home. Continue family life as pre-SIL staying. And buy a drum.", "Nope. It's time for her to GTFO", "NTA. SIL is a huge one though.  Sleeping 16 hours a day, even on days off, regardless of overnights, is ridiculous. So, she doesn't contribute to the household if she's asleep all damn day, pays no rent, oly $200 a month for food, AND expects you to keep your kids quiet while you're trying to work from home?  What does her unemployed husband do all day? Better be at least watching their kid.  You've given her  3 reasonable options, she refused.  Give her one more, and tell her to pick one of the other 3 or get out.", "NTA - SIL is in a vulnerable situation and that is deeply unfortunate.\n\nShe is making an incredibly unreasonable demand. **Kids shouldn’t have to be quite 90% of their waking hours!**\n\nHer schedule isn’t the only one that matters. She is being inflexible where she has no right. She can get over herself or get out.", "NTA. I would let the SIL know that this arrangement isn't working and they need to find a new place to stay. Be sure to give them a move out date. If they don't leave, you'll have to start the eviction process. \n\n\nInfo: Were they insured? Have they checked to see if their insurance company will pay for a hotel/rental?", "NTA. You're already going above and beyond by letting them stay with you. If she can't sleep at your house, she's free to move out to somewhere quieter. Also her husband sounds useless, wtf. Who are these people who freeload AND expect everyone else to just bend to their whims? Unreal.", "NTA. This reminds me of the nimrod back in the early days of COVID who posted about how it was his wife’s job to keep their children silent so that he could work. Not just reasonably quiet, no he need 100% silence to work and felt this was both not his responsibility to achieve and somehow feasible in a house with small children.", "NTA - Wow, your SIL must be really accustomed to a considerable amount of entitlement to demand that your kids stay quiet all day. I wonder if she got too comfortable with everyone being sympathetic that he home burned down and wants to keep stretching other's generosity. I could see if she was asking for a quiet time until Noon but this is a case of asking everyone in your home to bend over backwards while they're doing her a massive favor. I guess she can get a short term apartment as a fourth option but heaven forbid she has \"noisy neighbors\" that happen to have kids home all day because it's summer.", "NTA \n\nIt’s your guys house so what you say goes. They should be thankful you let them stay at your house", "NTA.  Time to have your husband tell them one more complaint and they are out.", "NTA. She seems to have forgotten that you're doing her a giant favour.", "NTA kids need to live. She will sleep through the noise eventually when she is tired enough", "He hasn't worked as long as I've known him (8 years). No reason behind it.", "This. I live in an apartment. If I want to sleep past 7 am, earplugs are *required*. Last weekend there was a pool party with hundreds of people blasting music like they’re in the club. SIL is acting spoiled.", "Same. I have noise canceling earplugs. I almost don’t hear anything. It’s wonderful.", "This. My insurance paid my cousin $1400/month rent for two rooms for our use while our house was being rebuilt after a fire. My mom had a kitchen fire and her insurance company paid her directly $2400/month. (California) If the SIL’s policy is like my mom’s policy, the SIL could be pocketing the reimbursement.", "I was looking for this comment.  Dollars to donuts she’s pocketing the cash and mooching off OP.", "She helps with around $200 worth of food a month because we eat all meals together. Other than that, no.", "She blames it on the work schedule and her weight. Not sure what her weight has to do with her work schedule but she says it takes more out of her because she's 200+lbs over weight.", "Option 5:  Husband gets a job so they can rent a place and live how they choose.\n\nNTA", "I feel like another option, if he’s at home too, I’d have him manage the kids, take them to the park, local pool, etc.", "I live in a condo. People upstairs are obsessive vacuumers. Wake up at 7:12 am on Sunday? Must vacuum. About to go to sleep at 11:38 on Wednesday? Must vacuum again. They don't have pets. They don't have kids. They just like to vacuum. \n\nThey run the rollers up against the baseboards and bang that sucker (literally) into the walls. I did say something to them once, but they said that they need to keep the place clean because of allergies. \n\nI have a white noise (actually, I use the brown setting, but nobody understands when I said brown noise) machine. I have a \"thunderstorm\" playlist that I keep on loop on my phone on top of the brown noise. I have a very lightweight headband that I can wear that will ALSO play music or sound if I need it.", "Definitely NTA. She's pretty much freeloading AND trying to dictate the rules here? She can get her own apartment if she wants to control her environment. Otherwise, she's a guest.", "Not sure where you live, but where I live $200.00 might feed a family of 3 for 10 days, maybe. Forget about a month.\n\nYour SIL should be giving you a lot more than $200.00. Especially if she wants to make demands.", "I've worked nights. There's no way I would rotate back to days on off days without a good reason. The most I'd usually do is rotate half way and get up in the afternoon for some family activity.\n\nBut I've also known people who can bounce between different shifts without any difficulty.", "Yeah, so I'm a nurse, and the way my schedule works is I do 2 dayshift, then 2 night shifts, and them I'm off. I'm also over 200 lbs, and that's absolute BS what she's saying. Is it super easy flipping to being awake during the day? No, but it's very doable, and she will feel better. Also, going to bed at 11pm and sleeping until 4/5pm is not right. There is no reason she can't be up later in the morning like 10 am. That's still 11 hrs of sleep. \n\nI get needing sleep after working the night, but then she should be considering your options. On her days off, that's on her. She is choosing to be that way. You are NTA!", "THIS X 100", "yeah im in a small town with pretty low cost of living and its over 200$ a week  in groceries for my family of 4 (granted thats breakfast/lunch/dinner all at home) but she is definitely not paying enough for groceries", "It was easy when I was younger to bounce shifts like that. Now it's harder and one night of insomnia throws my schedule off whack for weeks."]}