{"id": 2030, "submission_id": "ys6v0r", "title": "AITA for calling my ex's husband a jerk at my daughter's party?", "selftext": "I apologize for the long story, TDLR at the end\n\nI'm 39M, my ex wife is 37F. Her new husband is 40M. We have been divorced for a decade.\n\nWe have two kids together, 14M Connor and 11F Alissa, we share custody. Connor has cerebral palsy and is on a wheelchair, he has some developmental issues as well.\n\nMy ex and her husband have a 5yro son Matthew.\n\nYesterday was Alissa's birthday and she had a party at my ex's house. The grown ups were at the table and the kids were playing in the backyard. Matthew and another kid got into a fight, no big deal. Connor and another older boy (about 13yro I guess) told the younger kids to break it off. Matthew got angry at Connor and told him to shut up. Connor came to the table and told us what was going on, so my ex went there to calm the kids down.\n\nWhen she came back, we heard screaming and all ran to the kids. Turns out Matthew was angry at Connor for telling on him and threw a rock at his wheelchair (there is a dent on the control of his chair, so obviously something was thrown at it).\n\nI calmed Connor and my ex told Matthew to go into the house for a time out. Her husband said \"oh just let the kid enjoy the party\". I suggested maybe we just give the younger kids a few balls to play soccer or something and invite the older kids to our table for a while - to give everyone a chance to calm down a bit. My ex said Matthew has been acting out lately and has to take a time out now and apologize later.\n\nHer husband then said \"let's just forget about this, the kids were just roughhousing\". I then said \"well they weren't, no, Matthew threw a rock at Connor and he can't defend himself\" (I meant that Connor can't just protect his face with his arms or duck to avoid the rock). Ex's husband then said \"well he has to learn how to play with boys\" (Connor mostly just hangs out with Alissa).\n\nI then lost it and said \"you are such a jerk. Really, back off from my son\".\n\nMy ex is fuming with me, and says I have to apologize to her husband.\n\nAita here?\n\nTDLR: I called my ex's new husband a jerk after he defended his 5yro who threw a rock at my 14yro's wheelchair", "created_utc": 1668162901, "permalink": "/r/AmItheAsshole/comments/ys6v0r/aita_for_calling_my_exs_husband_a_jerk_at_my/", "score": 730, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the AH for: \n1. Calling him a jerk \n2. Doing it at the party \n3. Meddling into how he (and my ex) choose to raise their boy\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA.  My father was in a wheelchair most of his life (a palsy of some type.) he endured constant belittling and verbal abuse by people.  I can’t remember or count the number of times I had to defend him.  \n\nYou protecting your son is a beautiful thing.  Keep going, dad.  You’re doing it right.  Also, F that guys feelings.", "[removed]", "NTA  \n\n\nYou're protecting your kid.   \n\n\n\"He has to learn to play with the boys\" ...yeah. Boys who don't throw rocks at kids in wheelchairs, sure. His kid needs to learn to not throw rocks at kids in wheelchairs more than anything. I dont have kids but I can't imagine just shrugging off this sort of thing as \"boys will be boys\" and it would take a lot of personal strength to not drag that little shit to his dad and start shouting at him to try being a parent.", "NTA - the boy needs to know there are boundaries. Throwing a rock is not a little thing. Especially for a 5 year old who is just learning what is ok and what isn’t. Your ex‘s husband working against you and your ex is not good parenting. How else should the boy learn that violence is not a good answer to conflict?", "NTA. I seriously question if Connor is safe at his mother's place, if her husband is that blind and/or cruel. Do keep a close eye and talk to Connor alone later on, because the husband's attitude is dangerous and this could be a sign of an ongoing risk to Connor's health and safety.", "Nta. While I understand that this is their child and you shouldn't interfere with others parenting, that's until your child is put in danger. They're essentially condoning horrendous behavior that if not corrected immediately will more than likely continue and escalate. \n\nHonestly you're protecting your child and have every fucking right to do so. You were much more calm than I would be. Honestly I would've snapped and said if this ever happens again you will speak to a lawyer about going for full custody as your son absolutely cannot protect himself and obviously a rock can 3nd up doing harm and They're doing absolutely nothing to stop and prevent that behavior. Put your son first because I 100% guarantee if they continue to do absolutely nothing things WILL CONTINUE AND WORSEN. A rock is serious business, small or not. If it was enough to dent a wheelchair it's enough to cause a pretty nice injury. It might sound harsh to go after full custody (obviously difficult to get, especially after such few instances but maybe that'd be enough of a wake-up call to even say that. And I personally don't think parents should ever do this unless absolutely necessary but it will become necessary relatively quickly in the scheme of things and it's better to prevent than 'clean-up' a bad situation afterwards.)\n\nAbsolutely do not apologize for not condoning their child to be an abusive asshole (I'd personally use those exact words) F keeping the peace on this one it was a frigging rock that actually caused damage! What if that was his face!?", "ESH (mostly NTA tho)\nbecause of poor choice of words, couldve said that in a better way... but the reaction is perfectly reasonable and its very good that you defend your son, that is very important, good work!", "ESH because of the way you reacted, but you were right to say something.\n\nThis isn't just about advocating for your son. I would hope you or any adult present would have spoken up protectively of a child with a vulnerability. I think the fact that it was ex's husband's son vs your son unfortunately makes the argument sound like you Vs him. This is probably exacerbated by the way you reacted.\n\nUltimately the behaviour was dangerous and needed to be nipped in the bud regardless, so you weren't in the wrong per se. It is in everyone's interests if all three kids can get along safely.\n\nEx's husband needs to stop seeing Connor's friendship with Alissa as problematic though. Connor will gravitate towards friends who are safe and respectful to be around. Matthew was not, on this occasion. Their friendship can be nurtured once Matthew can behave safely. Not before.", "ESH. Obviously throwing rocks is not to be tolerated. But the way you responded I think was more than the situation warranted.  His comment may not have been the right approach but you went straight to personal insult which leads he to believe your reaction was about more than than just his response to the childrens fight.", "ESH.\n\nYou were trying to parent a kid who is not yours. Your ex and her husband were dealing with THEIR child's bad behaviour and you should have stayed out of this, especially as you were a guest in their house.\n\nAnd your ex and her husband might consider individual and family therapy because I get the feeling that the 5 year old is picking on his brother because he resents him for being the center of the world.", "Mmm. Tricky one. I get where you were coming from but I think you escalated it by jumping to slinging personal insults at your ex's husband, instead of responding calmly. Calm would (probably) have been more effective, whereas calling him a jerk ironically made you a jerk. \n\nBut then your son did just get a rock thrown at him. 5 year old's should know better than to throw stones when angry (especially at people who can't defend themselves) and if they don't, they need to learn pronto. So the husband (and your ex wife) really should have taken that seriously instead of dismissing it as \"rough housing\". \n\nI'm going to go with ESH. Husband for his underreaction, you for your slight over-reaction, and your wife for essentially taking her husband's side in the disagreement between you two. \n\nHaving said all that, I think there's real potential for you to be a massive asshole about this, and drive a huge wedge between your children's families by turning this into a major row instead of a relatively minor altercation that could be treated as a teaching moment, and resolved by your ex wife having a stern conversation with her 5 year old. And also with her husband. \n\nBut the person who was really wronged was your son, and he ought to have a say in what happens next. Assuming his developmental delays don't prohibit him from having his own wishes about things, I think you should talk with your son before you do anything, and ask him would he like you to talk to his mum about his younger brother's behaviour. If he says yes then do, if he says no then respect his wishes and drop it.\n\n(edited for clarity)", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI apologize for the long story, TDLR at the end\n\nI'm 39M, my ex wife is 37F. Her new husband is 40M. We have been divorced for a decade.\n\nWe have two kids together, 14M Connor and 11F Alissa, we share custody. Connor has cerebral palsy and is on a wheelchair, he has some developmental issues as well.\n\nMy ex and her husband have a 5yro son Matthew.\n\nYesterday was Alissa's birthday and she had a party at my ex's house. The grown ups were at the table and the kids were playing in the backyard. Matthew and another kid got into a fight, no big deal. Connor and another older boy (about 13yro I guess) told the younger kids to break it off. Matthew got angry at Connor and told him to shut up. Connor came to the table and told us what was going on, so my ex went there to calm the kids down.\n\nWhen she came back, we heard screaming and all ran to the kids. Turns out Matthew was angry at Connor for telling on him and threw a rock at his wheelchair (there is a dent on the control of his chair, so obviously something was thrown at it).\n\nI calmed Connor and my ex told Matthew to go into the house for a time out. Her husband said \"oh just let the kid enjoy the party\". I suggested maybe we just give the younger kids a few balls to play soccer or something and invite the older kids to our table for a while - to give everyone a chance to calm down a bit. My ex said Matthew has been acting out lately and has to take a time out now and apologize later.\n\nHer husband then said \"let's just forget about this, the kids were just roughhousing\". I then said \"well they weren't, no, Matthew threw a rock at Connor and he can't defend himself\" (I meant that Connor can't just protect his face with his arms or duck to avoid the rock). Ex's husband then said \"well he has to learn how to play with boys\" (Connor mostly just hangs out with Alissa).\n\nI then lost it and said \"you are such a jerk. Really, back off from my son\".\n\nMy ex is fuming with me, and says I have to apologize to her husband.\n\nAita here?\n\nTDLR: I called my ex's new husband a jerk after he defended his 5yro who threw a rock at my 14yro's wheelchair\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA - I have to wonder how he's being treated in a regular basis as well. At 14 he's old enough to say where he wants to be permanently living, have you considered that route? Your ex's husband sounds like s real tool.", "NTA\n\nThere's a reason, not just being closer in age, that Connor hangs out with Alissa mostly, and it seems to be Matthews behaviour and his father enabling.\n\nRegardless of Connor being in a wheelchair, Matthew needed repercussions of throwing a stone at him. This is where teaching actions have consequences starts, not let him just keep enjoying the party.\n\nNo need to apologise for defending your son. You might want to apologise to Alissa as it was her party, but definitely not your exs husband.", "NTA. He is a jerk.", "I think step dad needs to take Connor's safety more seriously as a disabled person with limited abilities. I don't love how you went to name calling, but I completely understand in the heat of the moment how frustration could get the better of you. NTA. Maybe have a conversation with both of them though to ensure that disagreements are being handled/overseen until Matthew is better at regulating his emotions. At 5, that's hard; what to a non disabled child could be a simple mistake or bruise could be much more serious for Connor.\n\n*Sorry if I've used the wrong terminology with regard to disabilities, I mean no offense. Seen so many different preferences, not sure what to use now*", "NTA", "NTA. Connor is not a target and Matthew needs to know that quickly.", "NTA keep protecting Connor. Matthew seems to have learnt his behaviour from ex's husband. Ex needs to wake up.", "Nta", "NTA.\n\nI think you were just being protective of your kid who doesn't have the ability to do what your ex's husband claimed he did.", "NTA - that dudes a jerk. No reasonable 5 year old is throwing rocks to begin with. 2nd, definitely not at someone in a wheelchair.", " NTA", "NTA \n\nWhat you said wasn’t even that bad. I know people who would have gone off at him majorly. \n\nAnd not being funny, but your son having a rock thrown at him when he can’t defend himself, is not ‘roughhousing’. What if it had hit his head? He’d then have a head injury and possibly a hospital appointment. Your ex’s husband was under reacting.", "NTA - I will never understand pare ts who think kids will grow out of a behavior if they do nothing to correct it.\n\nTell your ex you won't be apologizing for sticking up for your son against someone who thinks HE, your child in a wheelchair,  should be able to defend against \"boys will be boys\"", "NTA. He *is* a classic jerk.", "NTA. Do not apologize to that guy. He, his son and your ex are all TAs.", "Thank you. So sorry to hear about how your father was treated. \n\nWhen random people belittle my son, I can usually just calmly tell them to stop it. But this is his brother (half brother) and he is only 5yro, so he can still be raised to treat his brother as an equal. I am terrified of my son spending every other week in a house where he isn't treates with respect.", "I agree. I hate to think that this is the kind of treatment Connor gets at their house. My ex and I don't have the best of relationships, so I am rarely at their house (other than to pick up the kids). I took Connor and Alissa home with me after the party (as was previously agreed) and talked to both of them. They both said this kind of thing \"doesn't happen often\". I'll talk to them more about it and call my ex to come over as well so that the 4 of us can decide how the kids feel in that family and how we can resolve it.", "Right! Since when does throwing a rock at someone constitute “playing”?!", "My thoughts exactly. I'm not even angry at Matthew (obviously I am upset and was mad), because he is a small child who is pushing the boundaries of everything to try and find out what is acceptable and what isn't. \n\nI grew up with 4 brothers and my dad allowed a lot of roughhousing (\"settle it among yourselves\" kind of thing), but if threw an actual rock at one of my brothers, our dad would have lost his damn mind on me.", "A 5yo who's grown up his entire life with a sibling in a wheelchair should have learned a lot more a lot earlier in terms of compassion and accommodation for his brother. I work with young children and they understand a lot more than many adults give them credit for. If he can get away with throwing rocks at his brother while OP is there,  I have to wonder what's going on when he isn't.", "This is not good advice. For the sake of all the children, tensions between the parents and between the children need to be worked on and diffused, certainly not escalated by OP going nuclear and demanding full custody.", "Thank you. I 100% could have reacted better, agreed. It just felt (to me) like the new husband was defending Matthew's behaviour, saying that the kids were roughhousing. I get that siblings fight, but Matthew could have seriously injured Connor.", "It’s not always what is said but HOW it is said.  If OP was calm and said it that’s way different than hulking out.  And did the ex’s husband say things I. A jolly way or was it more in that tone where you know it’s a cutting remark?\n\nIt’s not over-reacting to call out someone, unless you like flip a table at the same time.", "To be fair, I only suggested that we give the younger kids something to play with to lighten the mood of the party and keep them busy. I didn't discipline Matthew directly. I did tell the new husband that this wasn't jist roughhousing, because I had to defend my son, who had a rock thrown at him. \n\nBut I do see how my behavior was inapproprate in what you say. So thank you for the comment.", "To be fair, your son is old enough to decide not to go back to that house. I hope he’s aware of that option being there. 🖤", "My dad said he and his friends used to play “goonies”, a game that had a group of kids opposite of each other on a hill and they threw rocks at each other. Even as a little kid I thought this was a dumb game.", "If your kid is being put in danger, it's a damn good reason to seek full custody of said child.", "I agree with you, actually. If there were signs of abuse, I would 100% file for full custody. \n\nI called my ex and she is coming over later today to discuss this with me and our kids. Connor asked to stay with me more, while Alissa likes things the way they are. So I'll talk to my wife and try to see if we can make an arrangement where Connor is at my place more than at hers. We'll see what we can agree on then. But I won't go full nuclear on her. She was a crappy wife (and I was a crappy husband), but she is a good mom and while I don't particularly like her husband, he is a good stepdad, and especially Alissa likes him a lot. It's not all black and white, yes, and coparenting is complicated.", "I get that and good on you for being a caring, protective father.", "He is aware of it, yes. I talked to both my kids about this yesterday and also called my ex to come over today so the 4 of us can discuss this.", "If a child is in danger, then yes it is. But in this case we have no reason to believe OP's child was or is actively endangered by anyone other than his 5 year old brother in an one off incident. Ex-husband's attitude is poor but that can clearly be better addressed without resorting to the court system. There are many steps that could and should be taken to resolve the issue, that do not involve going nuclear.\n\n(edited to expand point)", "This seems very reasonable and fair to everyone.", "A rock being thrown at someone who is incapable of even raising their arm to block it is most certainly dangerous.  I'd be mad if a five year old threw a rock at me and I CAN move my arms to defend it.  It's nothing to brush off and ignore, PARTICULARLY when the child's parent doesn't take that incident very seriously.", "Yeah, this is what bothered me the most. That Matthew's dad brushed it off. My ex is coming over later today and we'll try and talk this out.", "If she doubles down on her husband's idiocy, you may really want to consider going to court for full custody. You may regret it later if the kid who threw the rock begins to escalate his violent behavior.", "NTA. Even if you take the wheelchair out of the equation, Matthew threw a rock at someone. That's not ok, and he needed to be disciplined. The unacceptability is compounded by the fact that Connor was unable to do anything to prevent himself from getting hit by a dangerous flying object.", "I came in here fully prepared to condemn you, but NTA. I'm glad Connor has one parent who takes his disabilities seriously even when it's inconvenient.", "NTA\n\nYour son could have been hurt by the rock. He is not able to physically defend himself. Even if he could, you do not throw rocks at people. I saw a lot of good posts to address that. Another issue is damage was done to the wheelchair. Does that damage need to be repaired or not? Is this going to affect how well the wheelchair will be able to work? A bigger issue is that of the damage had been greater and Conner couldn’t use the wheelchair at all, is there another option for Conner to move around? How much did the wheelchair cost and how long would it take to replace it? At the very least, stepfather needs to be aware of the cost and how long it would take to replace. I have no idea what your son’s wheelchair cost but I’m agrees easily into the thousands. Would stepdad have helped to pay for a new one if Mark had broke it? That all needs to be addressed at the meeting. The wheelchair is a valuable piece of equipment your son has and it has to be treated well so he can use it.", "NTA \n\nConnor doesn't \"need to learn how to play with boys\". Connor's stepfather needs not to be an AH.\n\nYou offered reasonable suggestions to diffuse the situation.\n\nI'm an adult with cp. Not a wheelchair user. You former spouse's partner needs an attitude adjustment. He is under the assumption that your son needs to \"toughen up\". At his young age, Connor is tougher than this man will ever be. This man views Connor's physical disability as personal weakness. It's not.  I would be happy to set him straight.", "NTA", "Nta but the exs new husband is and if their son keeps acting out like that and being angry at your son take full custody. Keep your kids safe from the psycho new husband and the kid should have got more then a few minutes in time out for throwing a rock at someone.", "NTA", ">Ex's husband then said \"well he has to learn how to play with boys\" (Connor mostly just hangs out with Alissa).\n\nDoes this guy also call women \"females\"? NTA", "NTA - Actually, I think you were a lot nicer than you had to be. And you were meddling. You were defending your son. No apologies needed.", "NTA- they're okay with their 5 year old attacking a defenseless person? This is going to turn out well.", "NTA I actually think you’re under-reacting to this. \n\nMatthew may be 5 but the wheelchair changes the dynamics completely. The stepdad is a massive asshole and is facilitating your son’s physical abuse and trying to say “boys will be boys.” **This is serious.**\n\nMy children don’t have physical disabilities but I would be livid if one threw a ROCK at their brother. That is serious violence and is not the standard shoving and pushing that can happen with kid squabbles. \n\nAgain, I would be really worried about what life is like for your son and how much physical abuse he’s expected to tolerate on a regular basis. Document the damage to the wheel chair for sure. Find a quiet time to talk to your son and maybe even get him a therapist. This is a very unsafe living situation for your son.", "NTA\n\nThis is how the step dad acts when there's a party and everyone is watching. I wonder how he acts when nobody is watching and he's alone with the kids. \n\nOp, you need to protect your child from this guy. Kids don't always tell, even if you ask them straight out, because they think they're going to cause trouble. Your son might already feel like he's a burden and doesn't want to be a burden more. This guy could be hurting your kid, or allowing his son to hurt your kid everytime he's over there. A 5 year old doesn't just throw rocks unless they're already used to being violent and getting away with it. \n\nSit down with the ex, without her husband there, and get to the bottom of this. If her husband is that comfortable behaving that way in front of everyone, including his step son's dad, there's no way its not much much worse when nobody is there. Your ex may even be allowing it. This isn't the time to give people the benefit of the doubt. Your ex brought this man into your son's life. She's responsible for anything he does to your son. They're both responsible for anything their son does to your son. You're responsible for making sure your son is safe.", "Signs of abuse isn't limited to a black eye.  The passive aggressive comment here and there adds up. Plus the audacity of the 5yo to do that in front of an audience.   What goes on behind closed doors?  Protect your kid. He's being abused, daughter is being played and your x is excusing it all.", "Bruh u really think you're TA. You Ex's hubby is the most uncivilized person I've hear abt, bruhhhhhhhhh. Mathew could have literally thrown that rock onto Connors face or head and caused him something much worse than he already suffers. Once in my younger days a kid in my old school threw a rock at another one which caused him to bleed uncontrollably and all his shirt was drenched in blood. Yo owe nobody an apology and this could possibly be taken to court for child endangerment(I'm no lawyer so pls anyone who is correct me if I'm wrong). I think I've made it clear that your NTA.\n\nETA: You should take Connor out and let him socialize, he can't hang out with lil sis forever. Unless you meant he hangs out with her off school but still.", "You were calm and collected multiple corrections of stepdad, but it was clear the point was being glossed over, so you did what was necessary to ensure your son's safety AND security. NTA. Sadly, this may be a case where step dad's attitude about your son may be fueling his half brother's disrespect.\n\nThe fact that you were all having the bday party together suggests that you typically coparent fairly well; hopefully when ex comes over, she will be reasonable about the situation and keep Connor's safety at the forefront. Best of luck, OP!", "This is it, and I’m glad your ex at least seemed to understand the severity and pushed for a time out. 5 is old enough to know you shouldn’t throw rocks at anyone, nevermind your physically disabled brother! Tell your ex AND her husband that, after what he said, you’re now worried about Connor’s safety at their house and want assurances so that you’re comfortable with him spending time there; see if that shuts him up, because of his wife’s reaction if nothing else!", "Update please!", "Connor has plenty of friends, he just hangs out with his sister the most (more than with his cousins or other neighbourhood kids). He socializes a lot and has many hobbies where he found friends.", "Good luck! Hope it goes well for you, Connor and Alissa.", "On a side note, love that the 4 of you are discussing together. Award for the super co-parenting!\nEdit for spelling.", "Please make sure they don't bring the ex's kid though. This needs to be focused on your shared children and he could likely have some.bad reaction, plus your kids need to know they are safe from him there. Your son is wheelchair bound and sadly at the age where there are going to be a lot of realizations on how this affects himself (he could be physically attacked without any way to protect himself).", "It wasn't a one off incident. They said he has been acting out.", "\"Acting out\" =/= \"he has attacked his brother more than once\"\n\nAlso, OP agrees and says he would go for custody if there were signs of abuse, which there isn't.", "Send him a bill for the damage to the chair.", "Nta. Keep an eye on the husband. He seems too ok with his son's behavior.", "Nta but I would be extremely concerned for how they treat your son when you’re not there.", "NTA", "NTA. You weren’t inappropriate, you were standing up for your vulnerable son. Not to mention that if the rock had hit Connor’s body or head, he could have been really hurt. Throwing rocks at living beings or breakable objects because you’re mad is never okay. As it is, a dent in the control panel of his chair is bad enough, from what I understand repairs for electric chairs are astronomically expensive and take a long time, what if he had damaged some crucial part of the chair’s mechanics? Seriously doubt the new husband would be helping to fund a repair.", "NTA. Good to know your disabled child is well cared for. I would consider taking custody if you can. You ex is letting her poop for brains husband control the wellbeing of your disabled child. Go to court. Next we are gonna hear that he took the wheelchair away and demand he walk.", "Nta and I would be going to court after this to get your son away from people who refuse to keep him safe", "Definitely NTA. You stood up for your son. Your son could have really been hurt had that rock been thrown at him instead of the chair. How is the 5 yo's father so dismissive of what his son did? That kid needs to know that is not how disagreements are handled. How does he think the school will handle it when the kid starts?\n\nMake sure your ex and her husband pay for the chair to get fixed. Even if the chair is fine other than cosmetic. The father really needs a lesson about being responsible for how his kid acts.", "NTA. Jerk is putting it mild. \n\nHe’s a 40 year old who bullied a disabled child. \n\nHe must be so proud that his kid is following in his bully footsteps.", "NTA, definitely NTA. My son is around Conners age and also has CP. He walks with a gait trainer. If a kid threw a rock at my son, and the parents did not immediately correct and discipline, I would definitely be saying words a lot harsher than “jerk”. The kid is 5. He is old enough to be taught not to throw rocks at others and he is definitely old enough to be taught compassion and empathy for those different than us. His dad is failing him and your children by allowing this type of behavior and attributing it “boys playing”. My son has lots of friends that are boys. My whole summer was filled with smelly pre teen boys eating my groceries and leaving their dirty socks by the pool. They don’t throw rocks at my kid, or each other. And they stand up for my son when other kids treat him poorly.", "NTA. Matthew needs to be taught how to safely interact with Connor or there will be injuries. Especially with the attitude the husband has about the situation.", "NTA why doesn’t your ex care about her husband insulting her own son though? Major ew vibes from mom", "NTA\n\nI’m shocked your ex is defending her husband over her own child.", "Nta. When i was younger I used to play with a grp of elder boys and did a lot of stuff like throwing rocks. My brother told me to back from the frnd grp but I dint realy have any other friends so I thougt \"ohh well I'm not doing it so what's the problem\" well one day we were playing the neighbour's hood, one of the guys lost against me and it realy hurt his ego cuz I was roughly  4 years younger to him and his friends. I was 8 and they were 12 ig. He picked  up a rock the size of a fist  and threw it at me and gull speed aiming at my head from  roughly 15 feet away,  I tried to defend my head and in panic turnd my head. The rock hit me right on the back of My head. I still properly remember a  loud ring and then seeing blood dripping and then passed out and woke up in the hospital. I still have the scar. Op continue to defend you're kid. Mathew is 100% gonna end up growing up like one of those kids.", "NTA\n\nBut I'm a bit surprised that the damage to the wheelchair wasn't brought up. Yes, Connor's safety is most important and needed to be addressed, but the control (control panel?) of the wheelchair is dented. Wheelchairs are not cheap, if it had been damaged to the point where Connor couldn't use it anymore, that would have a severely negative impact on his mobility. The chair is an extension of his person, attacking the chair is attacking him.\n\nOP, please consider how best to keep Connor safe from a little brother who attacks his mobility and a stepfather who thinks that's appropriate.", "He is a jerk nta , \"I'll just let my son do whatever the hell he wants cause boys will be boys \" lol it'll be funny when 5 turns to 16 and he punches is dad in the face for saying he can't go out ... luckily your ex at least has a brain and punished him", "NTA\n\n I might be the AH for:\n\n1. Calling him a jerk (He was a jerk. He was being disrespectful to you, your son, and your wife.)\n\n2. Doing it at the party (It happened at the party, so it should be addressed there.)\n\n3. Meddling into how he (and my ex) choose to raise their boy (You didn't meddle.  You addressed an issue that affect all three of you and the two boys.  Your son needs to see you defend him.  You were just being a good father.)", "Nta. It’s not about Connor needing to “learn to play with boys” it’s the kids needing to learn to be respectful to disabled people. How the heck does the dad think his kid throwing a rock at someonein a wheelchair is ok?", "Nta", "NTA.  Send him an invoice for the wheelchair dent repair.  If he doesn´t pay, take him to small claims court", "NTA.\nI have a four year old. Not only do his father and I teach him not to throw things at people, if he does he gets PUNISHED, not brushed off. Especially if he could potentially seriously hurt someone or damage something expensive and important.\nYour ex and her husband are both the AH. If they don't wanna be called out on it, maybe they should try raising their kid better.", "NTA. You weren’t meddling with how they’re raising their son. You were pointing out his version wasn’t accurate.", "NTA. The fact that your ex's husband can parent absently while still being in the same space at the kids is really quite amazing.", "NTA. They are jerks!", "NTA you called it accurately", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "This. Dollars to donuts Matthew is hurting Connor and StepDad is doing nothing to protect his stepson because he sees the \"cripple\" as a \"burden\" to having his perfect 2 kid blended family with his wife.", "I can see why Matthew is acting out. He's being raised by an asshole", "Focus on the “often”. Kids tend to either minimize or blow such incidents out of proportion. I hope things get sorted out.", "Yeah, it's especially hard for kids who live in toxic environments to have a concept of what 'normal' is. I remember a post on here where a kid spent the whole post outlining all of the ways their mother was verbally and physically abusing her two disabled kids then ended with something along the lines of: 'they cooked us food today and haven't hit us at all since yesterday!' as, like, proof that they were TA for telling a teacher.\n\nETA: post has been removed, but here is the automod: https://www.reddit.com/r/AmItheAsshole/comments/y9vp1m/comment/it7ln6e/?utm\\_source=share&utm\\_medium=web2x&context=3", "Step-Dad is **actively endangering** his disabled step-son by NOT putting a stop to the 5YrOld's abhorrent behaviour.", "I agree with the substance of your comment but I want to gently encourage you to rethink the role of wheelchairs. Matthew’s wheelchair doesn’t confine or bind him. It gives Matthew mobility and freedom he otherwise would not have. Matthew uses a wheelchair. He needs a wheelchair. But he’s not imprisoned by it.", "Definitely NTA. Her husband is a jerk if he thinks oks just “boys being boys” type play for his 5 yr old son to throw a rock at his older brother who is in a wheelchair. What if he would of hit him in the head or face? And your ex should be backing you up not being pushed at you for not only defending your son but calling her husband out in his jerk attitude!", "NTA\n\nEx's husband is being a jerk. He also has some extremely toxic ideas about children playing. He actually seems to think that throwing rocks at someone, whether they can defend themselves or not, is \"normal boys play\".\n\nIt is not, that kind of violence and bullying needs to be stamped out right away. Completely unacceptable in all circumstances.", "NTA in the slightest.  The kid is five and is learning how to manage his emotions.  That doesn't allow him to cause harm to others or throw things at people when he is mad.  A time out would 100% have been the right call there.  And besides, even when rough housing, you can get in trouble if someone gets hurt.  And the chair *was* damaged.  Your ex's husband was being a jerk.\n\nProbably wouldn't hurt to bring the chair in to your usual repair place if you have one to get it looked at.  You never know if that rock may have messed with some of the wiring in the controls.  (And if you get billed for it, casually forward it to your ex's husband as a reminder that actions have consequences.)", "NTA", "NTA - im pretty sure \"don't throw rocks\" is lesson 1 on the first day of kindergarten.  This is not a \"boys will be boys\" moment.", "NTA, her husband's an insensitive d\\*ck.", "NTA", "NTA. If my kid threw a rock at a boy in a wheelchair, I’d go nuclear. If they threw a rock at any living creature, I’d go nuclear. Your wife’s husband is lucky you’re so cool under the circumstances. He is a jerk, and I’m glad you called him out on it.", "NTA but the ending of this interaction confuses me? You're defending your child and calling your exs husband a jerk for saying a kid in a wheel chair who can't really rough around needs to learn how to rough around and she got mad at your for stating a fact?", "Your ex's husband is a jerk and Matthew needs to learn from a better adult how behave, especially towards people with disabilities. Your son could have been badly hurt. NTA.", "NTA. I do the whole coparenring thing and am remarried. If I was your ex I'd have been calling my husband a jerk and demanding an apology from him. Not you. I'm so glad you're taking this seriously and discussing it as a family. I'd be worried your son isn't safe in that house. His safety vs exs husbands feelings? No contest!", "Everyone sucks, but mostly the new husband at the moment he said, *\"well, he has to learn how to play with boys\"* and you when your response was to call him a jerk.  I totally get why you did, and admit I might have done the very same thing in the heat of the moment, but some self-restraint would have better served you.  ***Please tell me that Connor did not hear any of this.***\n\nYou and your ex-wife were winning this thing, until that moment.  You could have still won it if you had drawn attention to \"what a jerk\" the new husband was *without* calling him one.  I know, the nuance may be hard to get, but would illustrate with this alternate response to your jerk comment: \"If that is meant to be an insult, and it sounds like it, I think you need to ask yourself why you are saying that.\"  Then, silence.  \n\nThere are two parties at fault here and so your ex requiring you to apologize without having her own new husband do so is wrong.  But how to say that without looking like a little kid saying, \"I'm not saying sorry until he does,\" seem difficult.  Maybe the only way you can is to say that (new husband) insulting your son, Connor, is far more worthy of an apology than you calling him out on that.", "NTA. Your exs husband is more than a jerk, he’s an asshole! I know 5 years old is young but it’s old enough to know better than to throw rocks at your disabled brother! Matthew will grow up to be an asshole too if his Father doesn’t start helping the Mother parent Matthew and give him time outs for shitty behavior. You were calmer than I would’ve been, suggesting alternatives first and saying jerk instead of swearing. I can’t believe your ex can’t see that you tried your best but her husband is problematic and doesn’t care about parenting Matthew properly.", "I'm pissed. Give me your ex's husband's social and I'll ring him out for you. You don't fuck with disabled kids, you don't teach your children that it's ok to fuck with disabled kids. \n\nI spent years of my childhood in mobility aids, and I want to smack your ex upside her head with a cane. SHES THE BOYS MOTHER.", " Honestly I would've snapped and said if this ever happens again you will speak to a lawyer about going for full", " I dont have kids but I can't imagine just shrugging off this sort of thing as \"boys will be boys", ">you for your slight over-reaction\n\nSlight over-reaction that what they calling standing up for your child against a boys will be boys jerk now? 😒", "When you're a kid. My son got a concussion once when he and his friend were playing catch with a chunk of broken sidewalk on the way home from school.", "Not rocks, but when I was in middle school we played walnut toss where we launched fallen walnuts at each other. Oddly enough no one ended up more injured than just bruises.", "NTA\n\nHope your talk went well. \n\nIf you really want to drive the point home put a rock on the table before the talk and when it goes over the event and he is still a jerk ask him this:\n\n\"I dont like what you are saying.  Is it appropriate for me to toss this rock at you?  No?  Then why is it ok for a child to?\"  And see what he says then.", " I thought this was a dumb game.", "NTA. Even if you take the wheelchair out of the equation, Matthew threw a rock at someone.", "NTA. I seriously question if Connor is safe at his mother's place", "Please update us when this is all figured out. If Stepdad thinks Connor can roughhouse with the boys, then you need to take your son out. You were lucky to be there when this happened. Imagine if you weren’t. What would’ve happened if Connor was seriously hurt and had to go to the hospital.", "NTA. I seriously question if Connor is safe at his mother's place, if her husband is that blind and/or cruel.", "Tell your ex AND her husband that, after what he said, you’re now worried about Connor’s safety at their house", "That's a gross exaggeration, but either way it's for OP to discuss with his ex, and pointless to debate further.", "I think you meant Conner not Matthew. Conner is the one that uses a wheelchair."]}