{"id": 20346, "submission_id": "14gh4g5", "title": "AITA for kicking my girlfriend and her kids out and putting them in a bad spot", "selftext": "She’s my ex girlfriend now technically. I (30m) dated Julia (25f) for a year. She’s fun and very beautiful and I was convinced we were going to make it all work. \n\nLast month her lease ran out, and because she has a prior eviction on record and rent prices have soared recently she wasn’t able to secure another home in time. I own my own home, and since I didn’t want my girlfriend and her kids to be homeless I reluctantly agreed she could move in with me. I was somewhat on the fence about kids before, but I’d gotten along with her kids just fine all the times we’d hung out. \n\nOnce they moved in it was hell. They took over all my personal spaces, colored on my walls, made huge messes. I realized Julia does not clean up after her children well, she only did it when I’d come to visit her before. I felt like she deceived me into thinking she’s a good mom. All she did once moving in was sit on the couch while her children ran wild. She also said she has no money once she moved in and she expected me to pay for everything for her and her three kids. \n\nAfter three weeks I snapped and packed up her stuff and the kids while she was at work and put it in my shed. I told her we were done and she and her kids can’t stay here anymore. \n\nWhere I live you only have rights if you’ve lived somewhere a month, so since it was only three weeks I was legally in the clear. I thought about giving her more time to find somewhere else to stay but that would just allow her to gain tenancy which means I would have to legally evict her which takes forever here. She showed up screaming and banging on the door, saying I was making her and her kids homeless. I feel bad, but if I’d never let them move in she would’ve been homeless anyways. \n\nI feel like Julia pretended to be someone she wasn’t in order for me to support her. She says she’s been depressed but I don’t think that’s a good excuse to let her kids rub goldfish into my carpet. \n\nAITA for kicking out my girlfriend and her kids before they could gain tenancy?", "created_utc": 1687472914, "permalink": "/r/AmItheAsshole/comments/14gh4g5/aita_for_kicking_my_girlfriend_and_her_kids_out/", "score": 110, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I moved my girlfriends things and her kids things out of my house while she was at work, knowing that she doesn’t have anywhere else to go. I feel like I could be the asshole because I feel bad that the kids are staying in a shelter because their mom has made bad choices.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Nta it's no wonder she can't find a place to stay, she is a shit tenant and pisses off her landlords. Also sounds like a giant mooch.", "NTA. You did the right thing because she would have been a squatter given the opportunity. She shouldn’t have tried to make you support her.", "NTA, She should have respected your boundaries and took care of her own kids better. You're not responsible for her kids nor are you responsible for her. I would ask where all her money was going since you said she had a job. She was clearly taking advantage of you and you were in full rights to do what you did.", "NTA.\n\nI feel like a year is a long enough time to have got to know someone. I feel like she put a lot of effort into covering up her actual self. The fact that she's not taking care of or disciplining her kids is a big deal on it's own. To add to that, she has no money and can't carry herself and her kids. I'm sorry, but that's not your fault. You're not obligated to take care of the children she conceived before you.", "NTA - you were smart to see the red flags before she had legal rights to stay in your house!!!", "You didn’t make her homeless, her actions or rather inactions did.", "NTA but moving forward, use better judgment. It's really not great to put kids through stuff like this (though I in no way think that just because she has kids you should set yourself on fire to keep them warm). If you're not sure about cohabitating with kids, spend a weekend crashing at a friend's place if they have kids, or you should have overnighted with Julia for a weekend before moving the crew into your place. It's fine to realize that kids aren't your scene, but there are better ways to know that before becoming part of their upheaval.", "NTA. She has no respect for you or your house, expecting you to pay for everything?! Well how did she pay for everything before?!", "NTA", "NTA agree tried too bamboozle you.", "ESH, though I will say you just dodged a huge bullet my friend.\n\n&#x200B;\n\nShe obviously was using you, but there isn't anyway kicking a mother and her children to the curb unannounced doesn't make you some degree of an asshole.", "I'll never understand dudes that put themselves in these situations. All that baggage. For what ?", "NTA. You were getting scammed to be a stepdad before you were ready. “She wasn’t able”?? Sounds like moving in with you was Plan A. You got it while you could when it was clear this wasn’t gonna work. Sad situation for her but that’s not on you to figure out. If you feel real guilt you can give her some go away money to get set up in a hotel for a couple weeks while she figures out where to live.", "ESH - this whole thing seems fishy. So for a year you’ve been making visits, she was disciplined the children except *now* she does a 180.\n\nYou didn’t talk to her, you didn’t ask why the sudden change in behavior and you gave zero notice on kicking them out.\n\nEither you never cared or you never noticed", "ESH - you shouldn’t have agreed to let her move in if you weren’t sure about kids to begin with. That is something you need to be 100% sure about when seriously dating a single parent let alone deciding to move in together. \n\nShe is also a huge AH and sounds like she just planned to use you. Everyone else is right in the comments that it’s a good thing you saw the red flags soon enough.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nShe’s my ex girlfriend now technically. I (30m) dated Julia (25f) for a year. She’s fun and very beautiful and I was convinced we were going to make it all work. \n\nLast month her lease ran out, and because she has a prior eviction on record and rent prices have soared recently she wasn’t able to secure another home in time. I own my own home, and since I didn’t want my girlfriend and her kids to be homeless I reluctantly agreed she could move in with me. I was somewhat on the fence about kids before, but I’d gotten along with her kids just fine all the times we’d hung out. \n\nOnce they moved in it was hell. They took over all my personal spaces, colored on my walls, made huge messes. I realized Julia does not clean up after her children well, she only did it when I’d come to visit her before. I felt like she deceived me into thinking she’s a good mom. All she did once moving in was sit on the couch while her children ran wild. She also said she has no money once she moved in and she expected me to pay for everything for her and her three kids. \n\nAfter three weeks I snapped and packed up her stuff and the kids while she was at work and put it in my shed. I told her we were done and she and her kids can’t stay here anymore. \n\nWhere I live you only have rights if you’ve lived somewhere a month, so since it was only three weeks I was legally in the clear. I thought about giving her more time to find somewhere else to stay but that would just allow her to gain tenancy which means I would have to legally evict her which takes forever here. She showed up screaming and banging on the door, saying I was making her and her kids homeless. I feel bad, but if I’d never let them move in she would’ve been homeless anyways. \n\nI feel like Julia pretended to be someone she wasn’t in order for me to support her. She says she’s been depressed but I don’t think that’s a good excuse to let her kids rub goldfish into my carpet. \n\nAITA for kicking out my girlfriend and her kids before they could gain tenancy?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA - Because after dating her a year, if you didn't see any of these potential things happening, it's because you weren't paying attention and shouldn't have asked her to move in to begin with, regardless of the urgency of her situation.", "yta.... maybe she played you like a fiddle, in which case you might NTA. But you invited her to your home not being prepared for what it might be like, then kick her out in a blindsided manner. Could have at least paid for a motel for a week.\n\nYou seem to be both better off without eachother.", "ESH\n\nYou are old enough to know letting kids move in would be a huge deal for everyone, but I realize you were trying to be a good person. The prior eviction should have been a red flag for you to explore. \n\nShe is a massive AH and incredibly entitled. She also sounds like a horrible mother. \n\nAnd PLEASE tell me the smashed goldfish were crackers not actual fish.", "NTA, you were doing her a *massive* favor by letting her and her kids move in.  MASSIVE.  How does she repay you or show you how appreciative she is?  Having her kids run wild and destroy your stuff, expect *you* to completely pay and subsidize her and her kids, doesn't put in any effort to keeping *your* home in the condition you are used to.  \n\nBullet dodged.  Any longer and then there are legal consequences so I can't say I blame you at all.  Never set yourself on fire to keep someone else warm.  You didn't do this to her, she did it to herself.  You just wouldn't let her do it to you.", "NTA. Good for you for not letting her take advantage of you like so many people do.", "NTA. It sounds like she was taking you for granted and taking advantage of you. That’s your house that you work hard to take care of and the fact that she didn’t try to keep it nice shows how unappreciative she is. You also aren’t obligated to pay for her or her kids. Sounds like you dodged a bullet there.", "Considering the calculations behind how she was acting before moving in, it makes me wonder how hard she actually looked for a new place before going to OP out of desperation.", "I have learned my lesson", "Give her enough money to cover two weeks worth of a hotel if you need a clear conscious. Someone isn’t an Asshole for not locking themselves into a horrible situation that they were reluctant to enter into.", "Finding someone at my age that is attractive and doesn’t have kids or baggage is hard. Last girl I dated ended up being an alcoholic with 50k credit card debt.", "Have you ever had to evict someone?  Especially someone who's been evicted before, knows the system, and has nothing to lose?  She was smart enough to deceive OP into allowing her to move in, she'd surely make his home a living hell for the next few months while it wound through the legal system.", "I brought it up twice in the last month and she promised to change, she said she was just depressed, but she never did.", "Yeah doesn’t make sense as told", "Every time I went over to her home the place was spotless and she would always tell her kids to behave. She always had something on the stove and seemed really put together. Once she moved in none of that occurred. I guess maybe I should’ve went for surprise visits or something. To be honest, it wasn’t mainly my idea. She kept hinting that she wanted to move in with me, she would say things like “it’ll be hard for us to date once im homeless” and I felt bad and caved", "If she was truly trying to deceive him, you don’t think she knew that she had to be there for a month to gain rights? That she wouldn’t keep putting up the “good” front so that way he couldn’t kick her out with no notice?", "How often were you at her place? Was it always a planned visit a week in advance?\n\nYou should have had her and the kids at your place for some weekends, or a vacation together before ever offering for her to move in. I dated a few women with kids, and it was obvious when I'd sleep over how certain things went, even if they were putting on the full Suzy Homemaker act.\n\nShe was probably playing you, but if you get played - it's still your fault. Chalk it up to a learning experience and move on. I'm sure she's already got someone else lined up if she's as hot as you say", "Probably got complacent once in and didn’t think OP actually had the balls to send her out that quickly", "It was always planned in advance. She’s said that when you have kids you have to plan things. To be honest we planned on taking things slower, doing more of that stuff, the whole moving in thing was sudden and a lot sooner than planned"]}