{"id": 20350, "submission_id": "14gg1nk", "title": "AITA For ruining a relationship over Egypt's new dog laws?", "selftext": "So, my partner (M37) and I (F35) have been together for 5 years, engaged for 1. My partner currently lives in Egypt whereas I live in the UK. Since our engagement, we have slowly been working towards moving to live with him in Egypt. However, the recent changes in laws regarding dog ownership means that I would no longer be allowed to bring my dog (a German Shepard called Lola) and I would have to leave her behind due to her breed being banned in the country.  I have had my dog for 7 years, and she has been with me through some of the hardest moments of my life, mainly the loss of both my parents due to COVID.  \nI mentioned this to my partner and told him that we would have to slow down the plans for me to move as I don’t think I can bear to leave her behind; he replied saying she was just a dog and although I would maybe be sad for a few days I would soon get over her. I tried offering some solutions such as temporarily holding off the move in the hopes that the law would change, or even if he would consider coming to stay with me in the UK. He turned down all of these suggestions and told me I was irrational and overemotional for ruining a relationship over a dog. This argument was a week ago and I haven’t spoken to him since. I don’t think we will be able to come to an agreement on this and I doubt Egypt will change their laws. I can understand his frustration as we have both put in a lot of money towards this, but I wish he would respect and understand my feelings and opinions about leaving my dog behind. This dog means so much to me. So would I be the asshole for ending the relationship over my dog?", "created_utc": 1687470316, "permalink": "/r/AmItheAsshole/comments/14gg1nk/aita_for_ruining_a_relationship_over_egypts_new/", "score": 748, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I may be the asshole as I am throwing away thousands of pounds worth of travel visas and plain tickets. Alongside a longterm commited reletionship over a disagreement over the ownership of my dog.\nBut I also believe I have every right to end my reletionship with a man who fails to respect the reletionship between me and my dog.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. “Just a dog” is 🚩🚩🚩🚩🚩🚩🚩\nEdited for clerical error", "NTA \n\nYour partner clearly doesn’t understand pet companionship if they think you’d be sad for a couple of days then get over a pet you’ve had for 7 years. That in and of itself would be fine if they were empathetic and attempted to problem solve instead of demanding and critical. Why can they not move to the UK to live with you? Why do you have to move to them when it means getting rid of a giant portion of your life and something you care about?", "NTA\n\nThat's a fairly mean and dismissive comment he made, so while I am assuming English is his 2nd (4th or 5th) language, it is actually cruel. \n\nAlso, as someone who visited Egypt last year (as an American)... it is a VERY stressful place to be.\\*\\*  I was nonstop harassed, scammed, etc.  How often have you visited?  Were you ALWAYS with him, or another Egyptian friend as a chaperone?  (I'm sure you've noticed that they also don't really see animals as pets in the same way, which may be where his thought process comes from).\n\nWhy doesn't he move to the UK?  \n\n\\*\\* Sorry any Egyptian Redditors.", "NTA, the dog is obviously the better partner.", "NTA \n\nYour dog is a senior. You have options. Wait or he can move to the UK or another country. I would not give up my beloved pets to move to another country, especially when the partner is dismissal of your feelings and not willing to compromise.", "NTA.\n\nFull disclosure: I’m also a GSD person so this feels personal to a degree.\n\nRegardless, I would not be willing to undertake such a life change without the dog I had before I had my partner. I would not be willing to leave the dog who had been part of my life for the better part of a decade. And I would have to REALLY think about whether I’d be willing to go without having another GSD (which it sounds like would be the case if one moved to Egypt).", "NTA. I really don't like how dismissive he is about how you feel about your dog.", "NTA. I’d be very leery of uprooting your life for a man who is so dismissive of your feelings.", "nta... also becareful of moving to middle eastern countries,... some women become property and cant get back. Not sure of egypt laws reguarding womans rights.", "NTA. Egypt is not an easy place for women to live. And your partner seems to hold some antiquated views you should be concerned about. Think very hard about if it’s worth the risk.", "NTA. You've had the dog for 7 years and you've had the partner for 5. The dog came first. Also it sounds like this is more than just a pet to you, especially if she was with you when you were grieving your parents. And, I'm sorry, \"maybe be sad for a few days\"?? That's not only incredibly apathetic and cold, it's also ridiculous and not at all accurate. To me, this would be a large enough flag to dump the whole man.", "NAH. You choosing your dog over life with him. While it is completely reasonable from your point of you, it is also completely reasonable for him to be upset. It is clear that dog ranks above him in your priorities. Time to find another partner", "[removed]", "[removed]", "[deleted]", "I mean the dog will be dead in a few years anyways. German Shepherds live 9-13 years on average, so that dog only has a bit of time left as you mentioned you've had it for 7 years. At the same time, he's 37, I understand his frustration that he has to put his life on hold waiting for the dog to die. \n\nI agree you need to be a bit more mature here, but if you want to ruin your entire relationship over a dog, it's your life.", "YTA - Ending your longterm relationship over a mutt that's going to die in a few years.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSo, my partner (M37) and I (F35) have been together for 5 years, engaged for 1. My partner currently lives in Egypt whereas I live in the UK. Since our engagement, we have slowly been working towards moving to live with him in Egypt. However, the recent changes in laws regarding dog ownership means that I would no longer be allowed to bring my dog (a German Shepard called Lola) and I would have to leave her behind due to her breed being banned in the country.  I have had my dog for 7 years, and she has been with me through some of the hardest moments of my life, mainly the loss of both my parents due to COVID.  \nI mentioned this to my partner and told him that we would have to slow down the plans for me to move as I don’t think I can bear to leave her behind; he replied saying she was just a dog and although I would maybe be sad for a few days I would soon get over her. I tried offering some solutions such as temporarily holding off the move in the hopes that the law would change, or even if he would consider coming to stay with me in the UK. He turned down all of these suggestions and told me I was irrational and overemotional for ruining a relationship over a dog. This argument was a week ago and I haven’t spoken to him since. I don’t think we will be able to come to an agreement on this and I doubt Egypt will change their laws. I can understand his frustration as we have both put in a lot of money towards this, but I wish he would respect and understand my feelings and opinions about leaving my dog behind. This dog means so much to me. So would I be the asshole for ending the relationship over my dog?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA.", "Nah- I want your partner to be an asshole but the reality is that not all people/cultures think of animals the way we do. I did a quick google search so definitely fact check me- but in 2019 there were 860,000 registered dog owners in Egypt, up from just 2000 in 2016. There are 65.1 million in the US and 10 million in the UK. I’m thinking maybe the idea that dogs are members of the family isn’t as common of a concept? So for him, I can see why maybe it would seem outlandish to call it all off for “just a dog”- despite what you told him. He hasn’t had that experience and he isn’t empathizing. \n\nAnd you wouldn’t be the asshole no matter what you did here. You sound like you have a kind heart though, this would be a really hard situation.\n\nEdit to clarify that I fully support choosing your dog. It can be an obvious choice and still make you sad.", "NTA. Our dogs depend on us and love us unconditionally. I can't imagine leaving one behind for anything. They'd be confused and heartbroken and do nothing but wait and hope for our return.\n\nFuck yes I'd ruin a relationship for any of our dogs.", "Jezzus NTA for that, but YWBTA to move to a country whose laws for women's rights are becoming more and more regressive.\n\nIm sure he'll get over you in a couple of days when a male relative annuls your marriage and you never see your kids again.\n\nJFC don't. Just don't.\n\nNo hate, just sympathy for the girls of the current Egypt.", "I would bet good money he would think OP can just replace Lola with a dog of an approved breed and would be absolutely mystified when that didn’t magically make her forget.\n\nFor me, this relationship would be over already not because of the law but because of the fiancé’s dismissal of OP’s feelings and his refusal to see this as a challenge they figure out together. OP isn’t ruining the relationship, he is.", "The last time I went to visit him was pre-COVID. I have been to visit him twice and he has come to the UK once.  I didn’t usually stay very long (1-2 weeks normally) and I would always leave my dog with my parents to take care of while I’m gone. \n\nI am an only child with not much extended family whereas my partner has a large family, so it just made sense for me to move.", "We are the evil terrorists. See what you dirty westerners have done to my country and my people. Yet you get on social media and call us evil. \n\nWest is evil and should be destroyed.", "If I was them I wouldn’t waste any tears on someone who says “It’s just a dog”. Pets are family, you don’t just get rid of family so you can live with some guy, if you disagree don’t ever get a pet.  Only assholes treat pets as disposable and/or replaceable.   NTA Op.", "YTA tbh. OP clearly stated that her dog has been there for a lot over the duration of having it, which makes it an important bond. Pets are family too.\n\nOP - NTA", "Honest question, how is OP not being mature?\n\nShe stated her concerns (“I cannot legally bring my senior dog with me when I move”) and tried suggesting some alternatives.\n\nHer fiancé shot those ideas down, offered none of his own, and insisted she stick to the plan and timeline and informed her of how she was to feel about it (“you’ll get over it in a few days”) and then blamed the entire argument on OP (“you’re throwing this relationship away over a dog”).\n\nOne person is looking immature here, and it isn’t the OP.", "Idk, he seems like he doesnt respect her opinions and Egypt is a pretty unsafe place overall.", "100% \n\nAlso, they haven’t seen each other in 3 years. This is not a good situation at all. OP dump him.", "... not to be mean, but how is this even a \"relationship\"?   So you've MAYBE seen him once, for a couple weeks, in the past 3+ years?  Objectively, this seems like a catfish.\n\n\"He turned down all of these suggestions and told me I was irrational and overemotional for ruining a relationship over a dog.\" - I mean, from the western perspective, this is a completely cruel sentiment, but is exactly how they feel about dogs. \n\nI've been to nearly 60 countries. There's only 2 I strongly recommend avoiding, and Egypt is one of them - especially if its Cairo (a shame b/c of all the amazing history, but it's way too stressful to be a western woman walking around, anyways).\n\nAside from the dog, I would NOT up and move without another 1-2 week visit where you walk around by yourself a bit and see if you can even handle it.", "The dog loves you more than he does.  Don’t abandon your baby.  There’s plenty of fish in the sea.  Nta.", "Don’t go, Egypt is not a good country. You could be hurt or killed.", "[removed]", "Putting entire life on hold (as this was something they've discussed and planned for) in order to avoid re-homing a dog that only has a bit of time left.\n\nThe alternatives don't work, the fiancee idea is the most simple and obvious one, \"get rid of the dog\". It sucks for OP, but they need to put their grown up pants on and realize it happens. It's a dog, not a child.\n\nCould he be less flippant? Sure, but he is likely visibly frustrated that something years in the making is now being roadblocked over something very simple and minor to move passed. \n\nOP will be single and have a dead dog for a companion in a couple of years if they don't straighten up here. If that's what they want, all the power to them I guess...", "Yes. Let the mutt die alone in Egypt.", "What's the other country you would avoid?", "Sorry for not elaborating properly, the one time he came over the UK he stayed for 2 months. And I was only able to visit him limitedly in Egypt due to the Covid pandemic. Those 3 visits were within a 2-year span.  \n\nHowever, I do understand your point and your concern about me moving to a new country so quickly with only spending limited amounts of time there.", "No.  You instead *reveal* that the relationship never was what you actually thought it was, because you didn't know you were with a jerk who completely lacked empathy and was completely dismissive of any attempt to even discuss compromise.\n\nIt's a pity when that takes as long as five years, but, well, here we are.", "I see what you’re saying, but I don’t think the only mature solution is to fall into line with what the fiancé wants.\n\nTo be honest, I would think that this is a potential sign of incompatibility and also a sign that this person doesn’t negotiate well, and I wouldn’t want either in my life partnership. A mature solution might very well be to end the relationship; she may not be what he’s looking for, if he wants someone who is eager to move to Egypt to be with him, and he may not be what she’s looking for, for the reasons outlined above.\n\nAt any rate, I stand by my assertion that it’s far more troubling how brusquely he dismisses OP’s feelings, while refusing to discuss any alternatives or compromises. That’s truly not the foundation for a good life partnership.", ">However, I do understand your point and your concern about me moving to a new country so quickly with only spending limited amounts of time there.\n\nTwo reasons.  This, and the fact that I was constantly harassed and scammed in Egypt, and I am concerned you will be treated in the same regard when you walk around by yourself (which you would far more likely do as a resident vs as guest of your boyfriend). You aren't moving from England to Canada.", "You're NTA \n\n>I may be the asshole as I am throwing away thousands of pounds worth of travel visas and plain tickets\n\nYou would be out a lot more if you moved in with this man.\n\n>Alongside a longterm commited reletionship over a disagreement over the ownership of my dog.\n\nIt's not about owning a dog. It's about his callous disregard for how much you love your four legged companion. \n\n>he replied saying she was just a dog and although I would maybe be sad for a few days I would soon get over her\n\nHe just took the Gold in the A-H Olympics. You should cut your losses and consider yourself lucky you found out about him now.", "If you don't choose your pup you'll regret it forever.", "NTA Leave him. Dogs are family.", "NTA. And I'd listen to what people are saying here about not moving out of England. It may be that this law was a godsend for you -- showing you who he truly is and giving people here a chance to give you feedback about your potential move.\n\nConsider this a sign and put a halt or stop on things. If you ever do consider moving there, you should do a lot, lot more research and thinking.", "NTA, but if your fiance is from Egypt, it could be a cultural difference. Islamic culture doesn't see dogs the way Westerners do as household pets, and are thought of as unclean and unnecessary.", "This relationship will not work. I’m sorry, but you two aren’t on the same page. Break it off. That will be hard, but not having your dog with you will be hard, too.", "NTA. But even if you could take your dog, or another dog, don't expect to find good care for it there. You're not going to find quality food, or get much beyond basic veterinary care. People aren't going to understand your emotional attachment. Animals are treated like property there. I saw a lot of abuse of dogs, horses, and camels.\n\nFWIW, women are also treated the same by much of the society.", "NTA - also listen to that little voice inside that says this relationship is a bad idea, please don’t move to a country you’ve only been to a couple of times for someone you’ve only met a couple of times ❤️", "You should read your country’s travel warning about Egypt.", "Nope nope nopety nope. \n\nKick him to the curb. \n\nNTA", "I got a dog during Covid, my now husband told me to hold off getting a dog because of me moving  and it might cause us issues. I got her anyways, it did cause us issues, but my husband supported me in more ways that I could imagine. Maybe it’s not even about the dog, but how dismissive he is about Lola. You’re definitely NTA.", "NTA. Would reconsider this man as he just completely dismissed your feelings on something important. Step back and reflect on this. I'd imagine it would be but what of many things he will dismiss.", "NTA. That dog is part of your family and if your partner can't respect that then you're better off with just your dog for now.", "NTA. Keep your dog, ditch him", "NTA. Dogs been around longer than this terrible guy. I’m a 100% believer in always choosing dog in “it’s me or the dog”. He sounds horrible anyway.", "NTA \"its just a dog\" 🚩🚩🚩🚩 anyone who says this about a pet is a walking red flag. You can always tell a person's character in how they treat animals.", "Dogs are family. NTA. I'd dump him, too", "No, you’re not TA. He’s being insensitive", "NTA you are dodging a bullet if you end this relationship. This dude dropped these:\n\n🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩", "NTA, obv. It's always incredibly hard to lose a pet, but you know that that's part of the deal when you bring them home. As hard as it is to say goodbye at the end of a pet's life, it's a natural thing and grief does eventually fade.\n\nBut abandoning your pet to leave them behind? That's the kind of deep personal guilt/regret that you end up carrying for the rest of your life. Good on you for refusing to give up your (canine) companion.", "NTA and are you sure about moving?as a middle eastern myself that’s a huge change maybe that’s a sign?", "It's sad when people don't realise a pet is family, and that it is a relationship. As my 3 year Golden sits across my lap checking my spelling. They are our kids, our minders and mentors. Plus they aren't above guilting us out when we screw it up.  The move would be the lesser value moving forward. Find a better guy.", "NTA\n\nIt always surprises me how insensitive people can be over the love of a pet.", "🚩🚩🚩🚩🚩\n\nI lost my dog seven months ago and am still upset about it. It’s never “just” a dog, it’s a family member.", "Please do not move to Egypt.  \n\nThis attitude / disrespect from your partner is the sign of things to come and it will only get worse!!  And once you are in Egypt you will have ZERO support to stand up to him.\n\nNTA and please please do not move.  If he is serious he will come to the UK to be with you at least temporarily.", "NTA. I’ve ended a relationship over my dog not liking a guy I was dating. I encourage you to do the same.", "Yta. I love my pets and would be devestated to part with them but you made a promise to marry this man and you have plans in motion that in my opinion are more important than the dog.", "Jumping on here to say ‘NOT just a dog’ I lost one of my cats in November and it still hurts me to not hear her in the house or have her squeaking at me for pets. Dudes not nice.", "There’s a big cultural difference how dogs are viewed here. I wouldn’t be surprised if there’s bigger cultural differences when it come to household labour/roles so maybe it’s for the best?", "She’s plenty mature. Mature enough to leave this horrible guy.", "If he dismisses OP's feelings on this, he would be dismissive of her feelings on everything else, too.", "I would tell him \"and you're just an ex\"\n\n\nDogs will stay with you no matter what, they're family. As for people I can't make that same promise", "Frankly, I couldn't stay with someone who thought of dogs like that. I've got three, and intend always to have at least one (but preferably two), and love them and see them as a lifetime commitment, and could not be with someone who sees them as disposable. I'd see it as an irredeemable character flaw.", "Why did u post a picture of this on another sub? And claim everyone in comments was racist", "[deleted]", "LOL Cambodia but the harassment/stress is a bit different. There are a lot of lovely Cambodians trying very hard, but everywhere I went people would  have their children chase (literally I've had groups of 5+ kids in the 5-10 range) running after me.  I also had a very creepy /bad tour guide who was obsessed w/ Lara Croft (which was apparently shot there) and took a lot of photos of me w/o permission and sent me shirtless photos of himself after \"cuppping\" (think: Michael Phelps), but I don't think that is the norm.\n\nIt was worse in the touristy areas of Siem Reap, though not as bad in Phnom Penh.  (Also, a shame, b/c you can't go to a temple and appreciate it w/o all the kids - There are signs everywhere saying \"Don't give these kids money. They should be in school & their parents are bad for bringing them here to beg\" (it's way worse than begging).\n\nI  also got really bad ear infections in both ears, one of which ruptured. (I've been to other tropical climates... no idea)\n\nSome was personally bad, but the kids are overall bad. I could see other people having ok times.  Every woman I've known who has gone to Cairo recently has had pretty rough experiences.", "Thanks for sharing your experiences! I've never been to either country so it's interesting to hear about your perspective. Hope you have many more safe and fun travels!", "Alternately, I went to Cambodia for three weeks and LOVED it. Would love to go back. The children posted outside the temples selling trinkets instead of being in school is accurate and sad, but I didn't see any children running after anyone so while it obviously happens based on the previous poster's experience, it isn't a this-will-definitely-happen-to-you-in-Cambodia thing.", "Clearly you are NTA, but I will echo the warning that almost every one here is giving.\n\nPLEASE don’t move to Egypt to marry a man you’ve seen in person only 3 times. As a woman, a citizen of a Western country, and a foreigner, in one of the worst places to be for any of these classes, you have a very high chance of being mistreated, or worse. You may lose autonomy over your whole life. You have only seen him 3 times in your entire life, with the longest in-person visit being 2 months long (per your comment). Please, be careful. Why can’t he come to the UK?? It doesn’t “just make sense” for you to move because you have less family, when it would be infinitely more dangerous for you to move rather than him.", "NTA your dog just saved your life. Under no circumstances is it a good idea to move to Egypt if you are a woman and you value your basic human rights. \nI don't care if this man is made out of gold, he is not worth forfeiting your life to an oppressive government. \n\nStay safe and stay with your dog.", "In Islam, dogs are deemed dirty and you must cleanse yourself before the obligatory praying. So, many Muslims do not have strong attachments to pets.\n\nHe will never realize the difference and you will be emotionally hurt by his lack of regard.\n\nI lived in an Arab country decades ago, but the region has drastically shifted after the Arab Spring, and mostly it hasn't improved.\n\nFive years is a very long time to commit yourself to an occasional long-distance relationship. Are you engaged because he's the best for you, or because you lost your family and feel adrift?\n\nAs a lifetime dog owner, I could not commit to someone who didn't like dogs, too. Just saying...", "NTA - he's \"just a guy\" that you'll clearly be sad for over a few days and then forget about him 😉", "And you want to move to a place this man could have legit control over you? Kinda dumb, girl.", "NTA. Pretty sure your dog is saving your life. \n\nIf a country can outlaw a dog with no qualms or recourse, and has notoriously abysmal treatment of women, why would you want to live there anyway? \n\nYou didn’t ruin the relationship, his attitude did, and you should be thankful it came up now before you were stuck in a foreign country with no options.", "NTA\n\nAlso, it's pretty suspicious he prefers \"Morality Persecution of Women\" Egypt over UK and \"the Convention on the Elimination of All Forms of Discrimination against Women 1986\"\n\nI think if you leave your dog for Egypt you're going to be made miserable in so many ways. \n\nIn other words, keep the dog, ditch the dude. \n\nhttps://www.hrw.org/news/2020/08/17/egypt-spate-morality-prosecutions-women", "NTA always always pick the dog", "...a few days? bro i lost my childhood dog of 11 years in 2018 and im still not over it. NTA", "NTA Please give your dog a special treat for exposing your fiancé’s horrible nature before you moved in with him.\n\nIf he’s trying to bully you into giving up your beloved pet now, imagine how he would act if you marry him in a country that gives men legal authority over women.\n\nhttps://en.m.wikipedia.org/wiki/Women_in_Egypt", "NTA.\n\n\" ... he replied saying she was just a dog and although I would maybe be sad for a few days I would soon get over her. \"\n\n\"I replied saying he was just a guy and although I would maybe be sad for a few days, I would soon get over him.\"\n\nSecond option, for sure. Dogs > people.", "NTA.\n\nMy wife would divorce me I asked tried to get her to get rid of our/her German Shepard.", "I once liked someone from Turkey who told me dogs were dirty. That made me get over him very quickly . NTA", "NTA - your dog is part of your family. You are in no way wrong for being loyal and refusing to leave it behind. Your partner clearly has a different view, which he is entitled to, but it doesn’t make yours wrong or less than.\n\nPersonally at this point I think they shouldn’t act like it’s a surprise. They’ve been with you for most of the dog’s life and should know how important it is to you.\n\nAt this point he has shown you his true views on pets and family, and it really doesn’t look like it matches with your own. It doesn’t seem like there’s a future here…not one that you want, anyway. Good for you for standing up for your pup! I’m proud of you.", "NTA KEEP THE DOG", ">I would maybe be sad for a few days I would soon get over her.\n\nNTA. Why would you want to marry someone who has no empathy and doesn't seem to understand you at all?", "#dumphim men come and go but dogs are friends for life", "Egypt is extremely unsafe for women anyways, so I don't know why you'd ever want to move there when the UK is available to you, yikes.\n\nFor the best. End it for your dog! This guy does not have your best interests at heart in multiple ways.", "NTA. And, from what I've heard, Egypt is a shit place to live.", "NTA. Fur baby is your priority and dump that man!", "Nta. You weren’t suggesting ending the relationship over this, but postponing or having him move to the UK. HE is the one who says it’ll end the relationship. His lack of understanding of dog relationships is a red flag for a dog lover.", "NTA. There is a part of me that's still empty since I lost my cat, my childhood cat. I'd give anything to have him back, even to this day. A pet isn't a toy to toss aside when you've outgrown them. He is so not worth marrying.", "NTA, but you just dodged one hell of a bullet", "As a fellow owner of a German shepherd, NTA. Also him saying it's \"just a dog\" would be a major red flag for me.", "NTA. Your dog isn’t just a pet…she is family!!! I would be surprised if you had no objections to what your fiancé said", "NTA Are you really sure you want to be with someone who is so flippant about the things you care about? Why would you want to move to another country that would have a law like that?", "Don’t abandon Lola for a man who dismisses your love for your dog — and to go to a country where you will be a second class citizen", "it's only a boyfriend. they're easy to replace. stay with the pupperino. nta!", "John Wick killed to get revenge for his dog. No such thing as \"just a dog\"!\n\nIf the boyfriend is not willing to change plans, it's not worth it. \n\nNTA. Your dog is family. Family never gets left behind. I honestly would choose a dog over the boyfriend. When you look into those sweet eyes..all you see is unconditional love! You can't get that any where else.", "NTA. German Shepard Dogs are special souls.  We raised and trained GSDs for the Seeing Eye\nfor years.  I loved them to pieces.  \n\nDid this law in Egypt pass before or after he moved there. If before, it sounds as if he didn’t consider your attachment to Lola.  If after, he’s still not considering you attachment to Lola.  \n\nIf you end up needing to rehome her, she would love it here in Texas 🤠", "NTA.  this is hard.  it is basically either him or your dog.  if you were me, what make the choice easy for me is that i never want to step foot in Egypt (dues to rumor of the tourist traps).  i do have a question, when you said you put in a lot, what do you mean by that?", "YTA - it’s a dog 😂", "NTA. I would absolutely end a relationship over either of my pets (a cat and a rabbit). When you get a pet, you're making an agreement to do what is best for that pet for the duration of their life. Beyond that, we form bonds with our pets that are definitely not to be taken lightly.\n\nAnyone who says it's \"just a dog\" is not the kind of person I would ever want to be in a relationship with. It shows a total lack of empathy. Major red flags.", "NTA - you won’t move to Egypt because of “just a dog”\n\nHe won’t accept any other alternative because….", "You would certainly not be an AH for prioritizing a living being that has unconditionally loved you for 7 years of a man who has disrespected  your feelings.  He has shown you how he is and how he thinks.  You have been warned.  Be very careful.  kt", "NTA. I wouldn't even move towns without my dog, you can forget me leaving him in a different country!", "NTA.  End it.  You were Lola's long before you started dating your boyfriend.  She comes first.  And as someone who has had to rehome a dog before (suddenly aggressive toward my other, older dog), it is not something you quickly get over.", "NTA get rid of the relationship keep the dog. It’s a giant red flag that he speaks this way about your dog", "NTA. Dogs are never \"just a dog\" they are a lifetime companion", "Friend, he is showing you who and what he is. Take him at face value. You are NTA \nNow please make sure to give your good girl some pats from me.", "NTA This should make look at how you are treated in this relationship. Does he override your thoughts and want? Wear you down until you agree? He doesn't seem to really care about your feelings. It will take you longer than a couple days to get over a friend you were forced to leave behind, even if it is a dog.  He just wants you there even though you will be heartbroken. You have had her for 7 years, she is like your child and he couldn't care less. He is threatening you that the relationship will end if you don't leave her behind. This to me is a huge red flag. If he loved you, he would move mountains for you, not disregard how you feel. I would choose the dog", "NTA, ditch the partner and keep the dog.", "NTA. Upset for a few days?? This man has no idea what having a pet is like!!", "i think if you want a relationship that exists in reality as opposed to the internet, try meeting one of the thousands of men who actually live in the same country as you.", "I read the title expecting a chuckle. I’m sorry for all of your losses. (But think you will likely find someone who wouldn’t say “just a dog,” and be happier because even if you’re not a dog person, you know not to say “just.”) NTA\n\nI hope your luck turns around and that you and your pup have a happy future!", "NTA. Keep the dog and stay in the UK!", "My cat outlasted 4 boyfriends. He's now 15.\n\nDon't go!", "He has the emotional range of a cardboard box. Sad for a few days? Girl, run.", "NTA. I think it’s lucky this happened so you can see this side of him now. Regardless of how he feels about the dog, he should try to empathize with the situation you are in. Big red flag!", "NTA. Just a dog? I still cry ugly tears over a dog I lost years ago, I fucking loved him. He was with me through a home invasion, child loss & my in laws passing. I only had him for 1 short year (heart failure) but it’s when I needed him the most & I’ll always miss him ❤️", "Nta. I hope you’re understanding that he’s not validating your emotions and feelings. He isn’t accepting your feelings and in fact trying to toss those feelings aside. Lola won’t be the only thing and there will be other situations where your feelings aren’t validated. Have you lived together before? Because you’re in for a wild ride. No friends, no family? And a totally new environment. If you’re considering breaking up over this then I’m worried about how much support you will have from him if you move there. ‘I feel so lonely’ him: ‘what do you mean you’re lonely there are so many ppl here’ etc", "Nta. Also leave him. If he can’t or refuses to understand the way you feel about your dog he will do the same later with whatever might come up, be it you needing time with family or anything else. Your feelings aren’t his priority.", "Nta. Wether it’s a dog or family or a job you love, he doesn’t respect it, which means he doesn’t respect you.  Dump him.", "NTA. Live a happy life with Lola and do not move to Egypt", "NTA. A few DAYS? Buh-bye.", "NTA. You have been with the dog longer than you have been with the man! We are the whole world to our pets. I can't imagine how distressing it must be to have your best friend again and not understand why.", "NTA. We adopted a shelter dog that didn’t work out, and she had to go back after 3 days. I had anxiety attacks about that for a couple weeks after, and I really didn’t even know that dog. I could never do that to one I’ve had for 7 years, at least not without a very good reason.", "NTA. I have 4 chihuahuas that are my world. I have alot of health issues and they've been with me throughout all of them. There is no way I'd ever give them up. If your partner doesn't understand that then maybe he isn't the one for you?", "NTA\nAlways choose the dog", "NTA and it's pretty telling that he doesn't want to move to the UK (where women are free) and instead is INSISTENT that you move to Egypt (where women are notoriously less free).", "NTA. It would be a very bad idea to move to Egypt. I know you don’t have much family but if you were in mine I would tell you not to go.", "Why the hell would you move to Egypt?!!! \n\nSeriously. Dump his ass. He's looking for a bang maid. You won't be able to do anything there. His family will be no help.\n\nAt least at home, you have your dog.\n\nNo man is worth that. There is nothing wrong with being single people! So many stories of people settling. Stop it!", "NTA. Please do not move to Egypt. Other posters have throughly outlined how unsafe this could potentially be for you as a Western, foreign woman. You may end up trapped there.", "NTA \nBut\nIn Egypt, the German shepherd dog is not banned(yet). It has to be registered. Now, how you do that before arriving to Egypt I don't know. \nIf you're interested, you can contact me to have the details of an agent who deals with dogs' travel (in Egypt, speaks English)", "NTA in the slightest. If it came down to continuing a relationship or keeping my dog, I wouldn't have to think twice. A lot of people simply don't understand the bond between canine and human, but it's the strongest bond I've ever felt. Please continue to prioritize yourself. There are copious potential partners in this world, but the bond you share with your dog is irreplaceable.", "My sweet dog outlasted my marriage.", "Oh my god please do not leave everything behind and move to *Egypt* solely to be with a man that you sparsely see in person. Don't do that to yourself OP", "NTA Dog was there first, through thick and thin. It doesn’t sound like your partner would do the same.", "NTA also do not move to Egypt. Your partner is also very dismissive of your feelings and will likely continue to be.", "NTA. If there was a way where I could take life force from people and give it to my dog to extend his life I would without hesitation. But I’m not really a good person.  Dogs are family and should not be discarded because they’re inconvenient.", "What an insensitive ass. \n\nDo you really want to be with someone so callous to your feelings? \n\nNTA", "NTA!!!!\n\nDogs are loyal! Humans are not.\n\nAnyone who says \"it's just a dog\" shows a lack of empathy, in my opinion. \n\nThis should be a deal breaker, also in my opinion.", "NTA. My partner loves my dog as much as I do, and respects how much I love our dog. It’s one of my favourite things about him.\n\nYour bf doesn’t have to feel the same wayas you do about your dog, but he is dismissing your feelings and opinions entirely. This is about respecting YOUR feelings.", "NTA. \"Just a dog\" is a dealbreaker for me.", "Right?  She said she was moving to egypt and all I see is John Lovitz all \"ARE YOU INSANE?\"", "Knowing people who lived in Egypt this waa my immediate first thought as well.", "Even if partner is just not a dog person, doesn't like them or whatever, he should at the bare minimum be able to understand that Lola is important to OP and *not* 'just a dog.' It's not even about not understanding the importance of dogs in general, it's about understanding the importance of this dog to this person - sounds like partner lacks a lot of empathy", "I would dump any man before dumping my dog. \n\nLet’s be honest OP Lola has probably given you more unconditional love, kisses and cuddles than that man has (or any man could)\n\nNTA", "Still cry over my dog after 2 years of her passing. I hope you get over him sooner!", "Not a red flag. It is just a dog.", "Interesting that the other post at the top right now is to get rid of the dog due to the fiancé trauma (full fledged trauma that caused her to lose a baby and she’s pregnant now).  \n\nBut here, where it is illegal then it is a red flag.  She literally cannot move there with the dog, it is impossible.   So now the dog is more important than the relationship.", "This is the underlying issue. If the partner is dismissive of her feelings now, what will it be like to live with him in his country, with no support system for her and nowhere to turn if things go wrong?\n\nNTA. Keep that good girl.", "I can say this is so true. I am an Indian woman and I was in Egypt for 2 weeks and I was catcalled so much in Cairo, I started feeling unsafe even when my mom dad were there with me as we went on a family vacation. All I wanted to do was leave as soon as possible. It is one of the places I wouldn't want to go back to, even when I absolutely love Egyptian history and mythology. So be really really sure of the move OP.", "THE DOG WAS THERE FIRST.", "Technically, if it was a mutt she'd be allowed to bring it...", "Squeaking... yep.\n\nMy wife's been in the hospital for more than a week. She's our cats favorite. They're both freaking out. Last night, the one that loves me the least laid on me and purred all night.  \n\nThey're both stressed, wondering if mommy will come home.\n\nI love them both, and thankfully she's coming home tomorrow.", "My cat is 15.\n\nHe outlasted 4 boyfriends.", "My dog died 11 years ago, and I still miss him and dream about him.\n\nI am an atheist, but if heaven exists, the only thing I want to hear God say is \"Your boy's been waiting for you,\" and my dog is standing there with a toy in his mouth, wagging his tail, ready to play.\n\nAnyone who says \"It's just a dog/cat\" is someone you need to avoid.", "Agreed. I’m curious though! How are dogs viewed there? I’d never thought about this before. \n\nI just have a cat so I wouldn’t expect to have problems, but I still couldn’t imagine ever leaving my dog behind if I had one.", "The dog isn't necessarily more important, but his dismissal of her feelings and claiming it's \"just\" a dog shows a certain lack of respect.", "Dump the man, keep the dog.", "You need to spend way more time in a country before moving there, especially when it's a country that has a reputation for treating women so horribly. \n\nVisiting for a couple weeks just shows you what it's like to go there as a tourist. But what's it like to buy groceries there? To spend time with friends? To go to a doctor's appointment? To take your dog for a walk? \n\nEgypt is very, very, very different from the UK, and you need the full picture of what it's like to live there before you decide to move.", "LOLA FOREVER", "I tend to agree with you there. I get that life happens, but I would be trying everything in my power to not have to give up my dog.", "Dogs aren't family. They are animals.", "Hope everything works out for your wife.", "Aww. The one snuggling you just breaks my heart. Best of luck to you and your wife. Wishing her a speedy and easy recovery", "Also an atheist. Never bought into the religion thing. But if there’s even a shred of truth to it, please let my boy be the first one I see.", "I also still have dreams about my long-gone boy. It's been nearly 20 years, and it's so bittersweet. Still, I wouldn't trade the dreams for anything but him.", "Not a dog person. Also an atheist.\n\nThat being said: if there is a heaven I better be swallowed whole by a pile of former pet cats.", "In some parts of the world (can't speak for Egypt, this is from a friend whose husband is from a different part of africa) dogs are more like livestock. You are not very emotionally attached to them, and they certainly don't come in the house. You might pat a dog or give a dog a name, but it wouldn't be odd if you didn't think to do it. They're working animals.\n\nIt's not necessarily a bad life, if they're well provided for and a breed that likes to work. Certainly a better life for something like a border collie than being cooped up in an apartment all day. It's just very different than how we do things in the west", "In my experience folks in Muslim majority countries are partial to cats, in part, because The Prophet had a cat.  \n\nDogs, not so much", "Out of curiosity what is the other country you would recommend avoiding and why?\n\nAnd do you think there is a way to safely enjoy Egypt? For example, by pre-booking and planning everything and organising tours?", "I've been living in Egypt for quite a few years. And I'm a single woman (with a dog also, but that's different topic). . Stop depicting Egypt and Cairo as if it was limited to people in the tourists area' behaviours. \nI agree. Really difficult country to live in. \nBut\nGreat place to live also. @OP I don't think you should move to Egypt to live with your boyfriend. \nRight now, the country is going through massive devaluation and recession. It's not going well. Poverty is increasing exponentially. \nUnless you already have a job secured (and a good paying job, paid in Euro or dollar abroad). Do not go. \nPlease\nContact me directly, and let's talk about it. (and I can give you the details of the dog travel agent)", "Well come on now, don’t leave us hanging - what’s the other country you wouldn’t recommend?", "It's his dismissive 'eh, just get rid of it' attitude that disgusts me. Dogs are living creatures, and they love (and are dependent upon) their humans, and we love them, so losing them is not an 'OK, you'll be sad for a couple of days, but that's it' situation. And I think there's just something wrong with people who think like this guy.", "You’re correct, they’re better than family.", "She'll be fine. Got both knees replaced. I'm looking forward to being able to go for walks with her again. \n\nWe're (obviously) older. Got married late in life. She's my best friend.", "Also an atheist, but a religious person told me once that you’ll know when you get to heaven because all your pets will be there to greet you.", "Sweetie, you need to thank your dog for being there to prevent you from moving to a country that is unfriendly toward women, to live with a man who you barely know, who is dismissive of the dog you love, and who has grown up (and formed his views) in a country that is unfriendly toward women. \n\nKeep the dog and reconsider this relationship. Egypt (and a lot of other places in the Middle East) is not a safe, welcoming place for women, and unless you've been there for extended periods and know the culture you may be in for some nasty culture shock, even if this is a good man. The real Egypt is not nearly as romantic as the Egypt depicted in \"Cairo Time.\" Seriously - keep the dog, and reconsider this particular relationship, for the sake of your future safely,  independence, and happiness. NTA.\n\n\"", "it's not just a new country as in any country (Which is hard as it is) but Egypt has a decades long and ongoing reputation for being very challenging, particularly as a woman used to being treated as a first class citizen. Get on some forums and do some mroe research is my advice, his attitude tot he dog thing is a pretty big stop sign on the move for now anyway", "I'm sorry, but what are you thinking? \n\nYou've been to Egypt a couple of times and you think moving there is a good idea? With a man you haven't even spent more than 6 months physically in the same location?\n\nI'm guessing your partner is Muslim. Are you okay with his religious beliefs? Do you understand how some Muslims treat women? Especially in a country like Egypt?\n\nYou can never go outside by yourself. Any independence that you are used to in the UK will be gone. Are you seriously thinking that's the life you want?", "I don’t think it’s hate when people are rightfully calling out the fundamentalist overhaul Egypt has experienced in the last 20 years that’s driving experiences of harassment and violence. There is a food blogger on YouTube who documented in great detail his experiences in Egypt just even trying to bring tourism to the country and it was eye opening just how bad it has gotten. Of all the places so many travellers have been, Egypt is consistent at the top of their ‘never again’ list. I have Arab friends who would not travel to Egypt and would certainly not move there as Egypt has picked up a reputation of being the ghetto of the Arab world and not even people familiar with the culture and language will travel there. Unfortunately it’s the average Egyptian citizen who suffers the most from their fundamentalist government and policies but you aren’t going to change that as an outsider, you’re just going to put yourself at risk. Physical violence or death is not an unreasonable outcome to moving to Egypt. I’d be really curious to hear what your plan is for life in Egypt when its economy is in the toilet and you may not speak the language or be familiar with navigating its systems?", "In fairness, it's not a good place for a UK citizen to go and live. All the bad things about the UK that you can think of - add 50 more, all about you as a woman and as a foreigner. It's not a parallel move, it's a huge step down. \n\nExcept your love is there. But you need to make a pros & cons list for everything. Including the place, the person, and their family & friends. Also include what happens if you were to break up. \n\nThis feels disastrous. That deep in your body clump of anxiety type of fear. Stay with your dog, please.", "Op please rethink this, nobody is spreading hate about the Egyptian people themselves. But it is a known fact that Egypt is not a safe place for women. In fact my childhood best friend is Egyptian, and she doesn't even visit her home country anymore because of how bad it is. I also know of a lot of Egyptian girls who choose to take volunteering jobs in Europe that provide housing just so that they can escape the country. \n\nAre you sure your boyfriend hasn't manipulated you into thinking that anyone who raises concerns over Egypt's sexist and oppressive regime is spreading hate?", "That attitude is problematic on a lot of levels. There’s the lack of empathy for the dog and lack of value for non-human life, but there’s also the lack of empathy for OP, who is supposed to be his life partner.", "Oh man, she got both knees done at the same time? I had both of my ankles operated on at the same time about 10yrs ago. Made getting around more difficult right  afterward but cut my rehab time in half.", "After watching women at a big protest being surrounded and attacked by men acting like packs of rabid dogs I'd advise even egyptian women to not stay there", "That's a shame. I really want to go to Cambodia and see angkor wat and angkor Thom. It'd be really cool to see Beng mealea too.", "Just in case it is needed, I agree. I visited in 2012. My Aunt amd Uncle teach in Egypt. Never being able to be alone in a public setting is exhausting. Seeing all the animals being uncared, starving for and mistreated is saddening. Your dog would be considered unclean and if someone choose to beat her you would not be able to stop it. To buy bacon is like a drug deal. Beggars everywhere. Having guard stations outside homes in many many places and you can't drive there so you are reliant on a driver. That is a codependency I couldn't handle every day.", "Yeah, I have to wonder if this conflict might be a blessing in disguise. \n\nIf it were me, this would be a huge wake up call, and I hope it is for OP as well.", "Exactly.", "Yup. She's a teacher in the U.S., summer is the only time she has to do it... and it's not even three months anymore, it's two.\n\nDid you know that if a teacher uses up their sick time during the school year, substitute pay comes out of their paycheck? \n\nYeah, that's a thing. \n\nSo, she could do both knees now or suffer another year of excruciating agony to get the other one done. \n\nBut my wife is a fucking champ. A genuine badass. It's been slightly over a week since her surgery, and she's fucking doing it. \n\nI'm so in her corner.", "My mom got both her knees done at the same time and never really recovered due to problems with ligaments and such. She’s had extensor reconstructions twice on each knee and is permanently disabled. \n\nI’m glad your wife is OK, but I’d never recommend doing both at once. \n\nI’ve anesthetized many hundreds of people for TKR, and haven’t seen any ortho docs doing bilateral knees in ages.", "Hey, I spent a month travelling alone in Cambodia and had none of these problems, I felt very safe. Unlike Egypt, where there is a lot of complaints from women, I don't think this report here is a rampant thing there. Also went to Egypt, btw, spent some time alone - about five days- had no problems, but I know lots of other women who did.", "Sounds like your advice is a few weeks too late to be helpful anymore", "It's great hearing other perspectives. Thank you!", "I'd lay waste to an entire city before I gave up my dog for a relationship. My dog is family, and abandoning her is a non-starter.", "Just a dog?\n\nHes just a bloke, get him in the bin and find someone closer to home who wouldn't ruin a relationship over you wanting to keep your baby (dog)", "Don't move there, especially with a complete dick of a partner. Find someone kind and live in a place with at least something approaching a modern society.", "NTA keep the dog, dump the pig.", "Dogs are family. Pets are important too. They have feelings, they feel abandonment too. Also, as a woman, you sure Egypt is for you? Will you have the freedoms and autonomy you have now?", "Nta. He’s the AH", "NTA\n\nOP, try to separate yourself from guilt and avoid the term “ruining.’” You two are adults both being presented with *choices*. You have to choose between living with your partner or your dog. Your partner also has to choose between living in the UK or Egypt. He’s not powerless in this scenario. And you’re not at fault for bringing up the issue to discuss.", "NTA - Dont back down on this! Your Lola dog has been family longer than that stupid man has.", "NTA NTA NTA!!!! \n\nIt is never “just an animal” I lost my childhood cat over 10 years ago and I still randomly cry about it. Do not give up your pup!!!", "To summarise: \n\nYou've had your dog for 7 years.\n\nYou've had your partner for 5.\n\nBUT..... your dog has had you for 15 years.\n\nSo..... which relationship has:\n\na. lasted longer\n\nb. is more loving\n\nc. involves less arguments\n\nd. involves more scritches\n\nI think you can see where I am going with this.\n\nNTA OP.\n\nThrow the ball once for your dog, and tell her it's a throw from me, okay?\n\n(...going now to listen to Lola by The Kinks)", "NTA at all. \n\nBut the racism towards Egypt in the comments is wow.", "I used to know a guy from Egypt, he told me he ate dogs. I wonder if he doesn't understand how you feel about your pet because maybe he doesn't view dogs in that way. Either way, I love my dog so much and would never give him up.", "NTA!! I have had my dog for almost 5 years and been with my man for 3 - I love my man but I choose my dog girl. I wouldn’t be moving to Egypt. Lola needs you and won’t understand why you would just disappear and not come back one day. I couldn’t do that to my dog. Men will come and go and he can look after himself. If he doesn’t want to stay with me and Lola then boy bye", "NTA. Ditch the guy, keep the dog. I doubt it they will change the laws.", "NTA. Dump his butt. “Just a dog,” well he’s half a man.", "A man who loved you wouldn’t want you, a woman, to move to a country where you have fewer rights than what you’re accustomed to. A man who loved you would not dismiss your attachment to -anything- you value with the words “it’s just a ….”\n  A man who loved you would work for compromise and care about your feelings. This man does not love you. Stay in UK with Lola and cut your losses. Oh you’re nta obviously.", "NTA \n\nYour dog is a crucial family member and it would be cruel to expect you to drop off this little guy who predates this man. \n\nHis reaction shouldn't be one of personal anger to you and your valid needs but one of simple frustration that life hasn't worked out well. This is a risk you run with these kinds of international relationships.\n\nIt sucks that this is how it's gotta end, but if you can't find a way for both of you to be happy and together then that's how it's gotta be", "NTA, and fuck Egypt for banning GSDs! I hope they don't get any essential police work done that requires them!", "NTA\nI'd say his reaction is a red flag.", "I think you just got handed a good reason to break up. He's not going to change, his culture doesn't seem to value pets like you do. You should think about using this as an escape from what could be a very bad decision.", "NTA\n\nBut an Egypt move for a woman of your background is a risky move, let alone the dog issue. Seriously consider your options here.", "Personally? That’s a dealbreaker and I’d leave a partner who suggested that.\n\nSo no, I don’t think you’re the asshole for not wanting to abandon your dog. He might love you as a partner does, but your dog loves you UNCONDITIONALLY. You are everything to your dog, their entire life. They depend on you for safety and security and all of their happiness. How can a person ever really compare to that?\n\nI guess maybe with your own kids it might feel different, but partners? Nah, I’d never put one before my dog. If they tried to make my choose between them, I’m picking the dog", "If I ever left one of my pets, it would change my entire opinion of myself.  I wouldn’t be able to see myself as a good person, and I know I would regret it for the rest of my life.", " NTA, there’s no way I’d dump my dog for a man or anyone! Dogs are the most loyal companions on the planet, and is choose my dog over anyone, we come as a pair or not at all.", "NTA, you don't even need to add any extra emotional \"value\" to your dog. It's your dog, your partner, family. Dog > any partner.\n\nAlso huge red 🚩.", "NTA - but also - seriously - do not move to Egypt! It is not great for women.", "Nta.  One thousand percent Nta!!", "Dogs are family. Simple as that.", "NTA.\n\nI have had my dog for 9 years. He is my grumpy best friend and has been through the ringer with me. I stopped being friends with people who literally told me, \"He is just a dog.\" When I was having a hard time finding a place that accepted animals because my lease was ending. \n\nHe's been through me being sick, deaths in my family, a long term relationship/engagement that ended, and he has always been there - happy to see me. No judgment. No guilt tripping. No bad behavior or manipulation. When people say, \"It's just a dog\" or \"It's just a cat\" and they know you love your pet - That is a super, big red flag. \n\nMy dog is my family. And I don't get rid of family.", "You had a relationship with the dog first. Even so, why be involved with someone who doesn't respect your love and relationship with Lola. He doesn't have to understand. Just respect it.", "NTA OP, unless you ditch your dog just for a man who seems to not give a crap about you.", "NTA. Whar he is saying is clearly showing that je doesn't care about your emotional wellbeing. Huge red flag", "NTA. See those red flags and run! You obviously have different beliefs regarding loyalty to loved ones. Even if that loved one is \"just a dog\". Lola loves and depends on you. She would be heartbroken if you abandoned her. \n\nYou'll find someone better. \"He's just a man\" there are plenty of other men out there who I'm sure Lola would tolerate, and who would adore Lola as much as you do.", "I think you’d be better off with the dog.", "NTA the dog sounds 1000 times more worthwhile than that guy. Plus sorry but as woman I wouldn't move to Egypt for all the money in the world.  \nAbandoning your dog would be unbelievably cruel, nobody worth having a relationship with would suggest it.", "NTA. Lola is important to you, and for good reason too. A good partner would understand that and attempt to reach a compromise.", "Stay with your puppy. And I am deeply sorry for the loss of your parents.NTA.", "NTA anyone who says your pup is \"just a dog\" and to basically \"get over leaving her behind\"... red flag! You are not just another human to Lola, just like she isn't just a dog to you... if he really loved ya, he would meet you halfway or help find a solution that would work for all three of ya.", "It was over as soon as he said \"Its just a dog\". Sounds like HTAH", "Your dog is your child and you have been with him longer.\n\nIf he cannot see that then he's not the right one for you.\n\nWhy would you want to move to Egypt? Their human rights track record is not exactly up to standards and dog hating goes deep there.", "NTA.  “Just a dog” is massive 🚩🚩🚩🚩🚩🚩.  We are not compatible at that point.", "I see dogs like toddlers or 1st graders. They are loyal to you and truly won’t understand if you are just gone one day. Don’t take in a dog that you will emotionally destroy one day.", "I'm assuming your partner is Egyptian..dogs are considered unclean and a general nuisance. I see why he's not giving a shit about your dog so in this aspect, he's probably not being an asshole he just doesn't care. However, as a partner, he should see that it means a lot to you and compromise there.", "NTA. If he can’t support and prioritize what’s important to you now, he won’t AFTER you move there either. Sorry, but you deserve someone who will value what’s important to you just because it’s important.", "NTA\n\nYou were ready, then laws changed, which affected your decision. It's not your fault they changed the law. \n\nAnd if he cared about you, and maybe held an ounce of empathy, he'd never have dared to minimize your dog. \n\nThis may be a hidden blessing. Don't go.", "NTA. I'd take this as an indication that your values are much different and this will just be the first problem. I don't have a dog, but I'm fully aware of how strong the bond can be between owners and pets. \"Just a dog\" may translate to a lot of instances of cultural differences that you won't cope with. Perhaps those laws are showing you, before you make that bit move, that there are a lot of possible issues. Can't find a pet-sitter? It's only a dog. etc.", "NTA\n\nYou're not ending the relationship over a dog. You're ending the relationship because he dismisses your feelings, doesn't care about your pain, and has a total lack of empathy and understanding. He's also apparently completely unwilling to compromise.\n\nThis guy isn't remotely a prize to hang onto.", "Fiancé is the a hole.  Not you!", "Why did you wait for the dog thing to be an issue. Never move to Egypt. I wouldn’t even visit your partner in-country, could be very dangerous if he wants to be controlling. NTA", "NTA", "NTA.  Btw it’s shepherd, not shepard.", "Do you not have any friends warning you against this move to Egypt? Why not find someone in your own country that you can see more than once every few years? Madness.", "INFO: Is this a long distance relationship? If so, it doesn't even matter who the AH is, because this relationship was over before it ever started.", "He's just a guy and although you would maybe be sad for a few days you would soon get over him.", "Forget the dog, why would you even consider Egypt when you’re in the UK? Do you know how women are treated there?\n\nLove really makes some people blind.", "Someone who says \"It's just a dog\" doesn't possess the kind of compassion I require in a life partner. \nNTA\nKeep the dog. Lose the man.", "NTA at all. Pets aren't possessions; they're friends and family, and living beings worth treasuring and knowing in their own right. Him not knowing that... doesn't bode well, frankly. I wouldn't prioritize a guy like that over Lola, that's for sure.", "NTA. Pets are furever", "NTA. Dogs are better than people. \n\nAlso, where is the dog tax?", "Her dog might have saved her from a terrible error.", "Surprised he didn’t say “you’re just a woman. Obey”. NTA.", "NTA in this situation. BUT I believe this is more complex than “criticize dog = 🚩” OP and the man have been together for 5 years(and are engaged) which is no small amount of time. He feels like the family pet is more important than him and I see how that could be hurtful. This is just a tough situation. It’s not unreasonable for him to feel hurt when he’s spent money and time rearranging his life for you to have the rug pulled out from under him due to something out of his control. And it’s not unreasonable for you to want to hold onto your dog. I have two dogs myself and the bonds we’ve formed are meaningful and very real.", "I didn’t like cats and my now wife wanted cats so we compromised and we have two cats. I love them to bits.\n\nSeriously, that’s a values thing. Many of us consider our pets important parts of our family. This is likely to be a very sore point in your relationship and may lead to a lot of resentment. \n\nIn my case, even our choice of housing / community considered pets. We bought the place because it is pet friendly and because the community cares for strays. \n\nNTA", "It is not just about \"just a dog\". Anytime you have a valid concern he will dismiss it as \"just a xyz\" and minimize your feelings. \n\nLook how quickly he is expecting you to get over things, a few days over essentially a family member who helped you get through the most difficult period of your life!! It will be a pattern moving forward. When he does something terrible to you, he will put in effort to make things right and just tell you to get over it and then chuck a hissy fit when you don't instantly forget and forgive. \n\nNTA. Don't walk away from this relationship, RUN!", "Sometimes you don't have a choice. Uncle Sam says \"Surprise! You're going to _____! And BTW, no one will rent to people with pets, so you'll have to give them up.\"", "Bro what??? They’ve only met 3 times??? They shouldn’t even be getting married lol", "Fr. My neighbors adorable puppy fell from the 13th floor few years back and it still hurts to see her videos. \n\nYoure NTA op", "Of course the dog rankes above him. She's had the dog for 7 years, and it is a member of her family. It may even be her best friend.", "The great things about plans is you can break them. Especially when your partner shows blatant disregard for your feelings!", "All edge, no point.", "The John Lovitz voice is so applicable *so* often on this sub.", "Why lol", "I've met a few people from Egypt and they say it's pretty bad right now", "A few years ago, I lost all 3 of my cats within a month and a half. I'm pretty sure one was poisoned, one had to be put down cause she was really sick, and I'm not sure what killed the last one, we just found her curled up under the truck like she was sleeping.\n\nIt really fucked me up for awhile. Every day, I'd just stop at their favorite haunts, expecting to see them or hear them meow at me. It took me over a year before I stopped expecting to see or hear them. 4 years later, I now have 2 cats, both of whom I love to death, and I know that it'll hurt just as much when they die.", "I lost one of my kitties in December, and I still cry when I think about him. I'm sorry for your loss.", "I'm so sorry for your loss.", "I lost my German shepherd at the end of 2020 and I still get broken up over it. Only was able to get another fur baby within the past year. Some of these \"pets\" become family.", "Yeah, OP is insane to me for wanting to go from being a woman in the UK to a woman in Egypt. Why would you voluntarily put yourself in a situation like that where you have so few rights and protections?", "I miss my childhood dog that passed like 20 years ago. He was the best", "The dog isn’t more important. It’s the way he is being so dismissive about her feelings towards having to leave the dog, who says “you’ll be sad about it for a few days then be over it”", "Animals are family to a lot of people.", "What does Uncle Sam have to do with this if OP is from the UK?", "If you're the only child it makes more sense for him to move as none of his elderly relatives will be left alone.", "Could you elaborate? I’m interested in traveling solo there in the near future.", "Yes pls elaborate. I was in Cairo recently and it was fine", "This is definitely reminiscent of a TLC show", "Mine's almost 17. In a year, I'll have lived with her longer than I lived with my mother.", "I've been told the vikings believed it was your dog that led you across the bridge.", "> I am an atheist, but if heaven exists, the only thing I want to hear God say is \"Your boy's been waiting for you,\" and my dog is standing there with a toy in his mouth, wagging his tail, ready to play.\n\nOne of my favorite New Yorker cartoons is much this scenario captioned \"So you're little Bobbie; well, Rex here has been going on and on about you for the last 50 years\"\n\nMost charitably to people like OP's partner, they're just not cat/dog people but they don't understand someone who is, so the relationship should be nixed for incompatibility", "What’s the second one you wouldn’t recommend as a western woman?", "I'm pretty sure it was also Egypt where a guy bribed airport security into letting him bring a bomb on a plane a few years ago. Shitty place; avoid!", "As a tourist traveling in a major city, you can be okay as long as you keep your wits about you. But living there as a woman while growing up elsewhere. It’s really oppressive. There’s a lot of traditionalists. \n\nCan’t wear western clothing in certain areas, be careful about showing any skin. Even at beaches, it’s best for travelers to go to a private/international pool or beach. \n\nThe culture is just vastly different. And more restricting than western countries. \n\nEgypt is just notorious for their harassment of women. It’s normal for women to be sexually harassed, you’re a failure if you’re not married. Lots of victim blaming. Laws against domestic abuse kinda are non existent. There’s honor killings for women that have premarital sex. Some families there perform FMG. It’s just one of those- if you live there and are married to an Egyptian expect to be treated like a possession. \n\nTheir healthcare also sucks by international standards. \nLots of racism and prejudice. \n\nSo living there and traveling there is much different. As a traveler you should be pretty safe from physical assault but you’re most likely gonna get a lot of staring, random harassment comments and catcalls no matter what you wear. \nAs a traveler stick to the bigger cities like Cairo where the tourists tend to flock. It’s recommended not to travel alone at night as a woman.", "Tourism is never the same as living there", "I don't have to elaborate.. I didn't say it in the first place", "Tourism isn’t the same as living there. Pretty obvious.", "Pets can become family. You love them and care for them, and they love you in turn. They can bring you comfort at your lowest, and motivate you to get out of bed and be better.\n\nSometime, pets are better family than your actual family.", "If a dog isn’t an adopted part of the family, you’re treating it wrong.", "I would be curious to know how you define family. It’s obviously different than most people’s.", "In Spain, they recently \"updated\" their animal protection laws... To completely exclude galgos, their hunting dogs. Now they can dispose of their dogs in any way they want and not get in trouble. Well, they already did that before, but at least they were more secretive about it.\n\nWhereas in my country laws about caring for livestock are strict too, and it's very common to name them.\n\nMy country also has a very few homeless dogs and no strays. The majority of our rescue dogs come from neighbouring countries that have thousands of dogs in their shelters. Those countries don't see dogs as pets, it's heartbreaking to read their stories. One pair of dogs were given to the shelter because their owners bought a security system and didn't need the dogs anymore. Some have been kept in a chain their whole lives, finally reported by someone who saw they didn't get fed properly and had no shelter. Some were just dumped, roaming the streets and if they were female, usually with puppies since people didn't bother to get them fixed.", "Which is odd because Mohammed prayed with dogs in the mecca. During his time they were allowed to roam freely in the mosque of the prophet.", "I was told by a friend from Pakistan that many South Asian countries view cats as dirty.", "Not moving to a new country; moving to Egypt. \n\nIt's not a great place for women. Especially a foreign woman on her own.", "Adjective-Noun-#### username.. I've recently been conditioned not to trust it", "Islamic culture doesn't see dogs the way Westerners do as household pets, and are thought of as unclean and unnecessary.", "Pets especially dogs, are loyal, loving, don't cheat, don't call you names, dont agree your bum looks fat, 😄 don't argue ( well cats do)  and yeh motivate and accept.", "There’s an awesome episode of Twilight Zone where a guy is hunting with his trusty canine sidekick, they die, he is approached by an angel who tells him he’s at the gate to heaven, but sadly can’t take his dog with him. The hunter says he just can’t go if his dog can’t come too, so he keeps walking. Comes across another angel who says he, not the first guy, is actually guarding the gate to heaven, dogs are totally welcome (because it wouldn’t be heaven without dogs), and thank gd he had the good sense to not go where his dog wasn’t invited, because that was the bad place. \n\nAnyway dogs rule, OP is NTA, my mom does GSD rescue, those dogs deserve owners as loyal as they are.", "I cannot say.  I’m not a member of the faith.  I related what I was told.", "OP should look up \"(cannola) in Egypt\". Also found a Smithsonian magazine article quoting a study which reported that 99.3% of Egyptian women have been sexually harassed.", "This is almost verbatim what happened on 90 day fiance, except this time the catalyst is a dog.  She's barely spent time with this man.  The dog should be a sign in itself, his true colors are showing (controlling, no empathy for her, no concern for her emotional needs or mental health, etc.) I wonder what life she would be walking into.  He's expected her to do something in a specific way and she is resisting, and his response is to dismiss her concerns and her needs.  This situation is one huge red flag.    \n\nShe should choose her dog and he can adjust his demands or find someone local.  It would be devastating to give up her dog for this kind of situation.  This would already be very isolating, she'd be uprooting herself and entering a place that doesn't allow for the independence of women, and she'd have given up a major support system, making it much harder to cope.  (A dog was one of the sole reasons my friend survived a similar situation).", "I’ve just returned from Siem Reap this week (2nd visit, last in 2017).  I’ve never had any harassment experiences there and have only experienced loveliness from Cambodian people.   Now is an amazing time to visit Siem Reap - the tourists have not returned yet and the town has invested in a lot of infrastructure during the pandemic.    Amazing to visit the temples without any crowding.   Please don’t be put off - Siem Reap is nothing short of delightful.", "It’s much different now from 2012", "I wouldn't worry too much beforehand. I am sorry about the previous commenter's mom but their experience is different than my own. My grandma got both knees replaced at the same time and could walk without pain for the first time in ages. My aunt got one replaced and is scared to go through the pain of doing the second one. Other people I know had gotten both done at the same time and been fine, no regrets.", "It's helpful to anyone else who sees it"]}