{"id": 20431, "submission_id": "14hfxv7", "title": "AITA for \"ditching\" the cheap hotel that my SIL surprised us with (and paid for) to stay at a better one?", "selftext": "This all happened over last weekend, but tensions are still high and the situation remains very hostile.\n\nIn essence, my SIL (30F) very kindly invited me (25F) and my fiance (26M) on a surprise weekend getaway with her family. We recently got engaged (last month! yay!) and she said she wanted to treat us to a surprise trip with her family. The surprise trip ended up being a weekend getaway at a popular beach town near where we live. We were both very excited to join them and spend time with their super cute toddler who's only 3!\n\nThe issue starts at the hotel check-in. Both me and my fiance are aware that his sister tends to be very frugal, but we've never commented on it since they are not well off financially. However, the hotel that she surprised us with ended up being a 1-star motel in a notoriously dangerous area. Upon entering our room, my fiance and I were shocked to find how dirty and disgusting the conditions were (e.g., fresh stains on sheets, clump of hair in shower drain, dead cockroach in corner). My fiance went out around 10pm to get us ice and he ended up being solicited by two prostitutes. I also went down around 10:30pm to ask for more towels from the lobby and I was catcalled and leered at by two very sketchy men. In fact, one even tried following me until he saw I was walking to the lobby.\n\nFinally, around 11:00pm I told my fiance that I did not feel happy nor safe staying in the motel. I asked him if he wanted to relocate to another hotel. He agreed and apologized for the conditions, but initially said we should just tough it out for two nights. But after I told him I was catcalled and followed, he agreed with me and said we should leave. And so we got an Uber and left to a nearby Hilton. I sent a text in our GC around midnight letting them know that we felt a bit unsafe and uncomfortable at the hotel due to some encounters/harassment and decided to stay at another hotel. I thanked them and apologized profusely. I asked my fiance if we should offer to move them to the new hotel on us, but he said no because he believed his sister would feel insulted. My fiance separately venmo'd her $200 to cover the costs of the motel even though it was only (\\~$40/night).\n\nThe next morning, I wake up at 8am to a text from her SIL basically saying that they were \"deeply hurt and offended\" by my actions and to call them ASAP. We ended up meeting them back at the motel and she and her husband completely blew up at us. She called us \"ungrateful\" and \"classist\", even going so far to directly call me \"high-maintenance.\" She told us that she spent $100 on our accommodations, which was all that she could afford, and we \"threw it in her face.\" I went into the conversation very apologetic, but once she started insulting us, I told her off as well. We ended up parting ways and have not spoken to each other since, except for a text from SIL saying she wants a genuine apology from us. I don't believe I owe her any more apologies. AITA?", "created_utc": 1687570608, "permalink": "/r/AmItheAsshole/comments/14hfxv7/aita_for_ditching_the_cheap_hotel_that_my_sil/", "score": 2035, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1. I suggested that we leave the motel my SIL paid for to stay at a better one. My fiance agreed and we left that night.\n\n2. It makes me seem ungrateful given that they did plan the trip/lodging as a surprise that they paid for. It could also be seen as insulting since we are aware they are at a worse spot financially than us.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "*However, the hotel that she surprised us with ended up being a 1-star motel in a notoriously dangerous area.* \n\nNTA. From your descriptions about what it was like there, getting out ASAP was your best option. SIL isn’t owed an apology and I’d say she owes you a big one. The fact that you wanted to sleep in a place where you felt safe doesn’t make you elitist and she is the classist one if she is accusing you of being a snob just because you were willing to spend your own money to escape from a bad situation.", "NTA\n\nI wouldn't have stayed as long as you did if I walked into a motel that was dirty with a dead cockroach in the corner. \n\nIn fact, I went on a trip with a friend that booked us a motel. I walked in saw one cockroach and immediately walked out, told her I refused to stay there and ended up booking us better accommodations. \n\nIt's not dramatic, disrespectful or classist to want to stay in a safe comfortable hotel. Also your fiancé sent them $100 more than they actually paid so they didn't lose anything by having y'all move. \n\nYour SIL needs to put her ego aside and let it go. If you plan a trip together again, make sure you book your own accommodations separately.", "NTA. Your safety and security come first. I would have done the same thing without a second thought.", "NTA. It is one thing if the hotel doesn't have amazing services or amenities, but a sketchy dingy motel is a whole nother story.", "NTA for feeling unsafe and upgrading your situation. You don’t have to stay somewhere you’re uncomfortable to make other people happier. Their feelings are their own responsibility. Their reaction was not appropriate.", "NTA - if you felt unsafe, it was better to get out of that environment. Plus the fact that it was in disgusting condition makes it even worse.", "I don't sleep well in places other than my home. And in a dirty, sketchy place. I would not have even brought my stuff in.  Ewww. She was paid for her efforts. NTA.", "Nta. You were as polite as you could have been until she started attacking you personally. Your first responsibility is to your own safety, that’s not classist but it is a privilege to even have an option. Which is not anything to apologize for, just appreciate.", "NTA. You didn’t do it because it was a one star hotel, you did it because you didn’t feel safe there.", "NTA, but very close to N A H for me. It sucks if that's all they can afford and I understand why her feelings were hurt. If I were in the same position as her, I would be more embarrassed than mad that my hotel choice was so bad. That being said, she shouldn't have gotten that mad at you if you were being apologetic.", "NTA at all. The one time to *not* be frugal is when you're paying for accommodations for other people, especially family. I get having a tight budget, but there's ways to find good deals and prices on hotels.\n\nPersonally, I would not prefer to stay in disgusting rooms with cockroaches over spending just a bit more money and being in a clean room and not having to fear for my safety (especially when they have a three year old child?).\n\nIf it's meant to be a surprise for someone else, maybe try to save up and spring a little bit more so the surprisees are not in dirty rooms or just do something else for them that's within your budget.\n\nI don't blame you for leaving, I would never let her book accommodations ever again.\n\n(Edited due to some misreading on my part)", "It’s not classist to want to feel safe.\n\nNTA\n\nJust wondering if you told them which hotel you went to or just said you relocated? Won’t change my judgement but might make me understand her feelings.", "NTA\n\nFrom the way you described it. This seems to be a motel frequented by sex workers and their clients. Not a great place for anybody else.", "OY! NTA\n\nIn gift giving, it is mostly the thought that counts. What was SIL's thought here? \n\nA hotel room with cockroaches is not \"a treat\" - neither is being catcalled or propositioned. She did not do \"something nice\" for you. \n\nIf you have a budget of $100 then a meal at a nice restaurant or a humongous gift basket would be an appropriate and likely appreciated gift. If you cannot afford a getaway where your guests feel safe and comfortable, then do something else. SIL created this situation and she owes you an apology for ruining the weekend.", "NTA. I would be embarrassed to put someone up in a shithole hotel as bad as that. That’s a liability, not a gift.", "That is disgusting and you should count yourself lucky if you didn’t get bedbugs as an extra “gift” too considering the conditions of the place. NTA at all, but I find myself feeling sorriest for their poor toddler who is going to grow up with a parent who thinks a hooker hotel is an appropriate family space.", "NTA\n\nThis was an unexpected “gift” she was getting everyone. This was not money she had to or was expected to spend. She created a situation to spend this money on family. If she could not afford safe & clean accommodations, not luxury or high end but just clean & safe, she should not have attempted to orchestrate this event on her own dime. She could have just taken everyone out to a dinner instead if that’s within her budget.", "NTA", "NTA, she booked you a room at a dangerous hotel but was more concerned with being offended than the safety of you and your fiancé. That’s wild.", "NTA I'd sleep in my car before I slept in that place. One doesn't book one star accomodations and expect a thank you. One books one star accomodations when absolutely nothing else is available and apologizes that nothing else was available.", "NTA. Your SIL fucked up and got the cheapest fleabag motel. Not hard to read the reviews in Google Maps.", "NTA. Pride come before the fall. She’s too proud to acknowledge or accept your feelings", "Nta. Ridiculous! A gift should never be a burden on the recipient. She should be apologizing.", "NTA. If you aren’t comfortable, you don’t have to accept that gift. I’m sorry that they feel so hurt and insulted. They should try getting you a gift you like that is within their price range. I couldn’t afford a fancy vacation for my whole family either. It’s okay. But trying for something that’s very expensive and reducing the quality until it’s no longer a nice gift just doesn’t work. I’m sure you and your fiancé would have been appreciative of another gesture that didn’t cost so much money. Their insecurities are something they will have to work out. I’m sorry it went that way and things are so tense and hostile. It’s not your fault, though.", "Nta \nDid they stay at the same hotel, they booked for you? Or another hotel?", "NTA. I almost stayed at a hotel like that. Left ASAP. It’s a health and safety concern. She shouldn’t have taken it so personally.", "NTA. It was a safety and comfort issue.", "NTA. They got hotel rooms in a dump. You didn't feel safe (for good reason). You were not rude about it.", "NAH. \n\nHer feelings are hurt and she’s likely humiliated that she picked a hotel that was so bad you guys left and went somewhere else. \n\nBut no. No way. You couldn’t pay me to stay in a room like that. You stayed way longer than I would have.", "NTA I would have done the exact same thing AND she was reimbursed so she has no reason to be upset. I do get maybe she was hurt but just know your NTA. I’ve being in similarish situations and unfortunately I tend to just fake a sincere apology for dumb shit like this. my SO and I will talk shit about it the second we leave cause we both know how ridiculous the situation is.", "If it was just a cheap, basic, and clean hotel, I’d have said stick it out. But nothing you described would make me comfortable, at all. \n\nNTA\n\nTo keep the peace though, you know their financial situation, and you knew it would hurt them when they were trying to do something nice. It’s not a hill to die on. Explain to them what happened with the guy and how you were followed, (not the 1 star part,) and how you were scared that he maybe saw your room. Leave it there and apologize, and say that you were grateful. Also suggest a group Airbnb next time.\n\nNAH", "NTA - it literally doesn’t hurt anyone else for you to stay at another hotel.", "NTA- she was ok with you being in danger? You can't give someone a shitty gift and expect them to be grateful. Send her a moldy sandwich and tell her to be grateful", "YHITAH. Your Husband Is The AH. You are not an AH. What stood out to me was that instead of covering the two nights ($80) your husband sent *$200*. That was I hope- kindly intended but a real AH move- “Clearly this is all you can afford so here’s well over twice the amount I actually owe you, obviously you need it”. I imagine that’s part of the anger. No, of course you should not have stayed since you felt unsafe and had reason to feel that way. And the SIL was awful to call you high maintenance. But your husband was straight up rude at best and cruel at worst.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nThis all happened over last weekend, but tensions are still high and the situation remains very hostile.  \nIn essence, my SIL (30F) very kindly invited me (25F) and my fiance (26M) on a surprise weekend getaway with her family. We recently got engaged (last month! yay!) and she said she wanted to treat us to a surprise trip with her family. My fiance and I were very grateful. The surprise trip ended up being a weekend getaway at a popular beach town near where we live. We were both very excited to join them and spend time with their super cute toddler who's only 3!  \nThe issue starts at the hotel check-in. Both me and my fiance are aware that his sister tends to be very frugal, but we've never commented on it since they are not well off financially. However, the hotel that she surprised us with ended up being a 1-star motel in a notoriously dangerous area. Upon entering our room, my fiance and I were shocked to find how dirty and disgusting the conditions were (e.g., fresh stains on sheets, clump of hair in shower drain, dead cockroach in corner). My fiance went out around 10pm to get us ice and he ended up being solicited by two prostitutes. I also went down around 10:30pm to ask for more towels from the lobby and I was catcalled and leered at by two very sketchy men. In fact, one even tried following me until he saw I was walking to the lobby.  \nFinally, around 11:00pm I told my fiance that I did not feel happy nor safe staying in the motel. I asked him if he wanted to relocate to another hotel. He agreed and apologized for the conditions, but initially said we should just tough it out for two nights. But after I told him I was catcalled and followed, he agreed with me and said we should leave. And so we got an Uber and left to a nearby Hilton. I sent a text in our GC around midnight letting them know that we felt a bit unsafe and uncomfortable at the hotel due to some encounters/harassment and decided to stay at another hotel. I thanked them and apologized profusely. I asked my fiance if we should offer to move them to the new hotel on us, but he said no because he believed his sister would feel insulted. My fiance separately venmo'd her $200 to cover the costs of the motel even though it was only (\\~$40/night).  \nThe next morning, I wake up at 8am to a text from her SIL basically saying that they were \"deeply hurt and offended\" by my actions and to call them ASAP. We ended up meeting them back at the motel and she and her husband completely blew up at us. She called us \"ungrateful\" and \"classist\", even going so far to directly call me \"high-maintenance.\" She told us that she spent $100 on our accommodations and we \"threw it in her face.\" I went into the conversation very apologetic, but once she started insulting us, I told her off as well. We ended up parting ways for the weekend and have not spoken to each other since, except for a text from SIL saying she wants a genuine apology from us. I don't believe I owe her any more apologies. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA but seriously-WHERE in the USA is there a 40$ a night motel by a beach? I’m just 😳", "NTA. You didn't feel safe there. Her unfortunate choice in motels doesn't make her the AH, but her reaction to your apology does. I'm hoping her over reaction was due to embarrassment and she'll apologize for that.", "My mil did this and booked us hotel rooms and we all got lice big fat NTA", "NTA. This is too much.", "NTA- My dad used to book places like this to save money.  When I  became an adult,  I promised myself no more. It's just not worth it!  I may have to budget a little longer but I would be safe than have to deal with the dirty rooms in sketchy parts of town. I do not mind saving money, just not at the expense of sanity and safety.", "Leaving the safety issue out for a minute, who the hell wants to stay in a room with cockroaches and freshly stained sheets? F that. I don't know how or why they didn't nope the fuck out right then.", "Yeah, I genuinely don't know where the classist comment came from. I clearly explained to her that I had been catcalled, followed, and her brother had been harassed by two prostitutes. None of this made us feel safe or comfortable—it was NOT a class issue, but an issue of safety.", "I would much rather sleep in my car than a hotel like that.", "My fiance actually didn't know what the nightly cost was. We only found out after we looked it up the next morning. He had mistakenly assumed that it was around $80/night and so rounded up to $200 including tax/fees.", "I would apologize for that one but stand your ground on leaving and refusing to put yourself at risk.", "NTA.\n\nThe only thing I MIGHT have done differently is speak to SIL about the accommodations before moving and asking her if she felt okay to stay there.\n\nOther than that who TF would ever want to stay in a flea bag motel after being solicited, catcalled, and followed.\n\nI probably would've said FUCK NO the minute I walked into it and saw cockroaches and stained sheets", "My skin is crawling just reading this. NTA and I hope you show SIL this post because she’s being ridiculous. I understand that her feelings were hurt but how could she not see how gross this whole thing was? And she brought her toddler there??", "Nta - sounds like your SIL went a bit too far with the “frugal” and ended up in a really bad place. Not only unsafe, but unsanitary too.", "NTA, both you and your husband were sexually harassed, one of the men followed you and you were in danger.   Your room was unsanitary.  I doubt their room was in no better condition.  What kind of parent puts their child in this situation.", "NTA. I’m a frugal traveler and I’ve accidentally stayed in a hotel like you’ve described. I’ll never do it again. Only reputable chains like Hilton or Marriott for me from now on. There is nothing more uncomfortable than a dirty hotel room and unsavory guests lingering about.", "NTA\n\nYour fiance venmoed his sister an excess of cash for the accomodations, so everything past that is feelings based. She made the situation one where she was the asshole the moment she went from, \"I'm hurt, because this was a lot of money for me to scrape together you know,\" to, \"you're classist, ungrateful, and high-maitenance.\" She basically engaged in character assassination because you were uninterested in sleeping in a place you'll have to burn your clothes after leaving, given that bed bugs are a thing and frequently hard to spot.\n\nSince you were apologetic **until** she insulted you she clearly isn't owed anything more. She's framed herself as the singular victim here, and is clearly not emotionally mature enough to realize her actions made her an ass.", "I'd be very concerned for the 3 year Olds safety That's my worry. And nta", "Is it weird I feel some things are overly exaggerated to earn sympathy points... 👀 somethings sounds offish honestly.", "NAH. She was trying to do a nice thing and it still wasn’t good enough. It’s unfortunate, however I don’t think she’s an AH because she’s used to a lower level of living. It’s hard and she’s still trying to be generous.", "NTA and you all owe each apologies.", "NTA\n\nIf you know you cannot afford decent accommodations, then you shouldn't pay for other people's accommodations. I get that she wanted to do something nice, but she could have done something nice within her means, such as paying for a nice dinner for your both. This isn't being ungrateful or overly choosey. Cleanliness and safety are not optional.", "NTA. \n\nIt was not a matter of taste or class, it was a matter of safety and comfort. \n\nIf your sister in law is throwing your choice to move back at you then she may be insecure about her finances. \n\nI personally would apologise for the fact she took the situation as an insult and then gently but firmly explain the above: it was not a matter of money, and despite her kind gesture, you and your partner genuinely felt uncomfortable and unsafe on the premises and will not be apologising for prioritising your safety.", "NTA\n\nShe had no cares at all about your safety?  Plus she was paid back more than double what she had spent and still has the nerve to insult you?  If anyone owes anyone an apology, it's her, to you.", "Jesus, NTA. Your room was unsanitary, your husband was solicited, and you were catcalled **and followed**. Holy scheiße, if I were your SIL, *I* would apologize to *you*. Safety comes before propriety, and you were certainly unsafe.", "It was a very nice gesture, but they clearly couldn't afford to take you out for the weekend. If there is an hourly rate at the motel it gets a hard pass from me, especially if I am with friends or family.\n\nNTA", "NTA\n\nYou have a right to feel safe. I do think that you might have wanted to contact your brother before you left, told him you didn't feel safe and didn't want to leave them and your niece/nephew (?sorry I forgot gender) there. And offered for all of you to go. Not to offend your SIL, to try to help her know this had to do with safety. I know your fiance didn't want to offend her. If a 3 year old wasn't involved, I wouldn't have worried.\n\nSafety isn't classist. You don't owe her an apology. How about a thank you card/note? You can thank her for the invitation and you loved the invitation to spend time with them.\n\nIt was sweet of her to offer. Maybe she didn't know how bad the motel would be? It was what she could afford. You didn't mean to insult her.", "Some people might say YTA but I would probably do exactly what you did.", "NTA but I can see why SIL is hurt and it come out in anger. I wouldn’t let this be the end of a relationship just a bump. You don’t owe more apologies.", "NTA. She offered you a hotel night and gave you a cheap nightmare.", "INFO: Did your SIL and family stay in the same hotel?", "I'm going to give SIL the benefit of the doubt (sort of) and say that she is probably masking some insecurity, since it sounds like your financial situations are pretty different. Maybe she's reacting/overreacting to the money your boyfriend sent her. Might have been better to discuss with them rather than just send it, which could have been perceived as showing off how much better off you guys are than they are. I have a sister who can be really sensitive about things that make no sense to me but are very important to her - this sounds like some of my interactions with her when I accidentally push her buttons.\n\nWith all that said, 100% NTA for getting out when you felt unsafe.  And maybe if things calm down you can try to talk through some common expectations to increase the chances that things go more smoothly next time.", "NTA. Hotels have ratings on multiple sites. There is no way SIL could have avoided seeing this.", "NTA\nIt's a little understandable to be slightly hurt or embarrassed as the SIL but you can't really be that mad at people just because they have different standards than you. Initially you should apologize that she got so upset you weren't trying to insult her but you genuinely felt unsafe and needed to leave, you reimbursed + some so the SIL should get over it and should not have flipped out on you and needs to apologize for that.", "NTA! no one told her to surprise u guys with a trip and it’s not ur fault she’s broke and is okay in such filthy conditions . Says something about the type of person she is. She should be apologizing to YOU! she does not know how to host at all. She could have taken y’all to dinner where you guys lived and called it a day.  Or just not been mad that y’all stayed somewhere else and continued with the trip like a normal person. For her to be calling y’all classist for wanting to be somewhere clean and safe is gaslighting af.", "NTA. If it was even a fraction as bad as you’re describing, you stayed several hours longer than I ever would have.", "Nta the second you mentioned bugs, once the safety issues began even the most frugal person would likely leave.", ">My fiance went out around 10pm to get us ice and he ended up being solicited by two prostitutes.\n\nNTA that's nasty..... Where was the motel *exactly*? So we can eh. Avoid it?", "NTA. \n\nAm I the only one concerned for the safety of the toddler? I worry about the judgment and parenting ability of parents who think a place of that nature is safe for a toddler.", "NTA- you owe her nothing", "When I was a teenager my mom and I went on a road trip. We thought we could make it from where we ended up to a family house at a lake a few hours away. Well with stopping for restrooms and food, it got late and she was tired and needed a break from driving (I couldn’t at the time). We found a cheep motel in a seemingly okay area, not being from there we had no clue. When we got into our room it was much like OP describes their room, even the dead roach. We didn’t go to get ice, she went to check us out while I packed up car again and we left. We didn’t feel safe. \n\nNTA, even if someone else is paying for your stay, if you don’t feel safe there, you have every right to leave. Never put yourself into an uncomfortable situation just to make someone else happy. It’s 2023, we don’t play their mind games anymore.", "NTA...there really isn't good reasoning for her to be so offended. You listed more than 2 dangerous situations that you were put into with their \"good intentions\". Don't beat yourself up about this, you can only explain your logical explanation for your decision and apologize once, it's out of your control that they're embarrassed for endangering your lives.", "NTA !\nWe were in a very similar situation, years ago.  We were invited to a weekend beach trip and the hotel room was paid for by my husband’s BIL.\nThe room was dingy with old furniture and a window air conditioner.  It didn’t smell great either.  We had our 2 year old daughter with us. The AC unit was above the bed and dripping. All I could think of was Legionnaires disease!  I told my husband we had to get out for the sake of our daughter’s health!  \nWe did leave for a reputable hotel that night. There wasn’t any argument, but his BIL was irritable for the rest of the trip. Frankly, I didn’t care. I wasn’t putting my daughter in even the slightest bit of risk!", "I feel gross just having read your description of the place. I don’t have a lot of money, but I will spend the money to feel safe AND clean!! I need a shower from this post.", "NTA. Stained sheets? Solicited by prostitutes? Followed by creeps? Yeah ... I would have noped out of there as well.", "Never travel with her again. What each of you consider adequate accommodations is too different.", "It could be that SIL is more upset about the separation of the family than the actual upgrade. I do think a call or even a text to see if they were still up would have went a long way to ease the tension prior to the move. But I'm speaking from the poverty side of things.", "This.  The sister should have thought of an appropriate gift.", "She’s not the AH because she’s used to a lower level of living, she’s the AH for being rude when someone apologetically expressed genuine concerns.", "[removed]", "Have you checked EVERYTHING for bed bugs?", "We stayed at a hotel like this once because we booked online without being familiar with the area and it was not a good experience. \n\nPeople were dealing drugs right outside our door and some man kept following me and my friend asking for cigarettes and money every time we left our room, which was only a few times because none of us felt safe. We didn't have the spare money to switch hotels and were both exhausted from traveling that we just waited it out and left early the next morning. \n\nThe fact that your SIL cares more about her personal feelings than the literal safety of you and her own brother is deeply concerning, and someone I'd strongly consider going low contact with. She doesn't sound like a good person and the fact that she expects you to apologize after she put you both in danger is insane. I'd tell her to fuck off, and not to come back until she sorts herself out.", "Ask her what kind of mother takes her child to say in a place with hookers and roaches.", "I think if you had approached them and said “hey listen this just happened and I don’t feel safe. We’re going to move to a different hotel and would be happy to move you also” that would have been a different conversation. You’re well within your rights to move, but she’s within her rights to feel hurt when she was trying to do something nice for you (even though it didn’t work out as expected). no one’s an asshole here, but maybe there’s a better way to communicate on all ends.", "Why do you care so much about a \"classist\" comment coming from someone frugal ?", "Yeah until sister in law sorts herself out I wouldn’t travel with her, I would be paranoid about the nasty bugs she’s bringing from all the dirty places she likes to frequent", "Exactly, I wouldn't have brought anything in the house before checking it over thoroughly. Also, cockroaches. She said there was a dead one. Who is to say if they put their bags down, a live one didn't crawl into a bag.", "I thought of the 3 year old.\n\nWhat if SIL booked online and the pictures looked nothing like what they came to? Maybe SIL was embarrassed? Spent all she had, couldn't afford to go anywhere else.\n\nI wonder what would have happened if brother would have been called, \"This just happened. We appreciate the thought. We love spending time with all of you. Why don't we all go to (new location)? Our treat.\"\n\nThe world will never know. Lol", "Yeah, sneaking out feels shady, especially since they left SIL and family at the dangerous motel by themselves.", "That’s the first thing I thought about . I’m getting itchy just thinking about it, and the sister in law lied down and slept there ? 🤮", "She should have apologized like a grown woman and explained the situation. They all could have went somewhere else together", "Yeah, I recently booked a cheaper (national chain) hotel online, looked fine enough from the pics, but apparently they had cleared out all the garbage and drug dealers just for the pics, and used the one non-nightmare room for the pics as well. It happens, and definitely could have been handled a little better by OP.\n\nLuckily I had not spent all my money, and left as soon as I could get another room booked. Should have just spent the extra $30 for the Holiday Inn Express in the first place.", "With her toddler!  Ick!!", "NTA.  I’m sure she was just embarrassed and lashed out.  I let a friend book a room for us after a concert like 15 years ago.  Never again.  I still think about that gross hotel room.  I always book the accommodations now.", "I'd normally say you're the Asshole, but given the dangers and filth and hookers, I'd say NTA for this one, if everything is true", "NTA- If that's all she could afford, then I can see why she might have felt hurt. However, those feelings should have quickly died once she saw how uncomfortable you and your fiancé were. You more than compensated her for the money, and you paid for your own hotel yourselves.", "NAH\n\nOh jeeze\n\nYou were right to leave.... But she is right to be upset and offended.\n\nSo, this was a no win situation.\n\nThe hotel was seriously sketchy and you were right to leave. But, there was absolutely no way for you to do so without insulting your SIL. \n\nShe has no money, this is what she could afford. She was trying to do something really nice and generous and was feeling good about it. Which you wrecked. Her family had to stay at this place as well, so you leaving was extra-insulting since it had to be good enough for her and her own child, but not for you. Which means you are skirting dangerously close to calling her a bad mom territory, and no one can come back from that unscathed. Every single piece of evidence you'd bring up to justify moving to the Hilton (the hookers, it being dirty, the catcalling) would be taken as more and more of you shitting on her gift as sub par and lacking.\n\nYou pretty much called her and her family garbage people who belonged in this environment you couldn't stand to be in for even a few hours. When they made sacrifices to include you and this is likely their normal, possibly even their \"special\". So yeah, there's going to be some very very hurt feelings. \n\nShe is likely deeply embarrassed this was all she could offer and your rejection of it has caused that embarrassment and shame to manifest as anger.\n\nThere truly was no winning here.\n\nI think you need to suck it up and give a genuine apology, or at least turn it over to your fiance to do so.", "TLDR, once I saw the term 1 star motel, that was enough to make me know you're NTA. Congrats on your recent engagement and all the best for the wedding planning ahead...super exciting xx", "NTA for moving hotels but YTA for accepting a holiday from someone you know to be struggling financially. You should have foreseen that the accommodation would be cheap and basic, at best. \n\nYou should have said, \"we'd love to come away with you, we'll sort our own accommodation, but if you want to treat us, a meal.out would be lovely.\"", "[removed]", "NTA. She’s allowed to be ‘frugal’ if she wants to but she should realize that not every one wants to live that way.", "NTA... you paid her back for the hotel. You were not comfortable staying there. You did your best to approach it with kindness.", "NTA I’d rather be catcalled and solicited than have a cockroach in my room.  Even if it’s dead. I’d have been at that Hilton hours earlier.", "NTA.  I get why your SIL felt hurt, almost enough to go n a h, but... yuck.  Your actions were reasnable.", "I don't think you're an AH. But I do think you should pretend you are and apologize.\n\nSIL is not well off, but she still extremely generously invited you on a family vacation with her and spent the absolute most she could afford. It was a gift.  That motel sounds horrible, and I'm not saying you should have stayed somewhere you felt unsafe, but you were given the absolute best she could afford and decided it wasn't good enough. She is rightly extremely hurt. Just apologize, emphasize a terror of cockroaches or something, and try to make it up to her.", "LOL NTA. Wtf.", "NTA. Safety and health should be the sole issues here. The place was dirty and potentially dangerous. 'Nuf said.", "[deleted]", "NTA! I’m so sorry this happened to you! You do **NOT** owe SIL an apology whatsoever! In fact, she owes **YOU** a massive one! You were catcalled and followed, and I don’t blame you for feeling unsafe!", "Absolutely NTA\n\nDangerous and unsafe, on it's own, is enough of a reason not to stay there.\n\nGross and dirty, on it's own, is enough of a reason not to stay there.\n\nAll of that together? Hell no, get out of there.", "NTA. Look, safety is a non-negotiable. This is a tough one and it likely will be a point of contention for the entirety of your relationship. Sounds like they were trying to genuinely do a nice thing. And it's unfortunate that it turned out this way, but if you were being harassed and followed, then you made the right call.", "NTA. Seeing the stained sheets and cockroach carcass would be enough for me to leave because I'd be worried about bed bugs.", "Nta, but I think there's room for improvement. I'm not sure why you refunded the money, and why you refunded extra? That does look like flaunting it, and I can see how spending all you can afford for a gift, and then having that gift just casually returned twice makes you feel unappreciated.\n\nPerhaps you can spin it as: the gift is the holiday; and spending time together, and that is a success.", "NTA. Two words: bed bugs. \nAnother few words: STDs, junkie flophouse, possible mugging.", "NTA. Honestly I would have left a lot earlier but the active prostitution and very much potentially being assaulted takes the cake.", "Yup. Not to mention her brother Venmo’d SIL double the cost/loss of the motel.", "Pretty sure I agree with NTA and totally convinced I would have done the same, likely even earlier after stepping one foot into the room as OP described it.\n\nThere’s one thing I don’t understand though:\nINFO: if you know SIL is financially stretched, why did you agree to have her arrange and pay for your accommodations?", "I feel like a lot of people in the comments fail to think about that the sister probably can't afford anything better for herself, her family and her child.\n\nShe probably felt just as unsafe in that area and felt it was just as gross. Ofc that doesn't mean OP has to stay there but it must at some level feel like OP and her husband needs better because they have more money.\nLike it's too unsafe for OP but not for the 3 year old toddler", "Based on the cockroaches detail I’m betting the southern coast, maybe a shitty part of florida?", "Like what?", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). If we’ve removed a few of your recent comments, your participation will be reviewed and may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "My fiance venmo'd $200 because we initially thought the hotel was around \\~$80/night so two nights would be close to $200 with taxes and fees. It wasn't until the next morning that we saw it was only for around \\~$40 and we had already reimbursed them at that point.", "And who wants thier 3yo to sleep in a place like that?!", "Yep, I’d be soooo paranoid about bedbugs if I saw all that", "My fave hotel in sydney Australia had dead cockroaches in it & i loved the place it was such a dive lol, shoutout to the arrons hotel 😆 that said op is nta", "I bet you fresh bed bugs were in residence there. Ick", "NTA.\n\nShe felt embarrassed, that's why she's lashing out. Remember anger is almost always a secondary emotion. She tried to do something nice and make an extravagant gesture (in terms of her means), and it blew up in her face.\n\nI'd lay it on really thick about how she couldn't possibly have known and the accommodation itself was great (even though that isn't true) and it was just a shame there happened to be some dangerous people there that night. Wax lyrical about what a lovely, generous thing it was to do. You have nothing to lose by being kind and sparing her feelings.", "People of lower class learn to put up with more shit.  I think that’s where it came from, like feeling safe is a rich thing…there is certainly some truth to that, but bringing that into an argument seems like a cheap shot, like calling someone racist.", "I just want to be clear I’m not blaming you, but the idea that you can *afford* safety and complete isolation from undesirable people is upper class. The issue that causes people to build fenced in suburbs is *safety*. The issue that causes people to hire private guards is *safety*. Just because that’s the issue doesn’t mean you aren’t classist. \n\nGood for you for getting out of a situation that was unsafe, but she’s probably upset that she can’t afford safety and thinks you did ‘stupid rich people things’ by not taking what she feels like are appropriate and reasonable measures (like not leaving your room to wander around a sketchy part of town). When your solution to not feeling safe is to go stay at (literally) a Hilton she probably feels like you did something lacking in common sense and ‘fixed’ it by throwing money at it. \n\nSo you aren’t wrong to leave an unsanitary and unsafe environment but to her it looks an awful lot like you literally can’t spend a single night not staying in a stereotypically upper class hotel. That’s not classist of you, but it is reinforcing that you are in a different social class to her.", "So we actually did offer to pay for both of our accommodations and told them it really wasn't necessary for them to pay for us. We thanked them for wanting to treat us to celebrate our engagement, but said their presence on the weekend getaway would make us happy enough. \n\nUnfortunately, they denied having us pay because SIL kept emphasizing she wanted it to be HER treat and she wanted to celebrate us.", "Even 5* hotels can get bed bugs, they're usually a lot more rigid about cleaning and react a lot quicker because they have a reputation to keep. Seedy motels are last resorts.", "Yeah, but there are cockroaches EVERYWHERE in Sydney! Especially in summer. At least they were dead!", "Saw this comment an hour ago and have spent the last hour checking everything and thankfully, I didn't find any bed bugs. 😭 We're a little late given its been a few days but I'm praying that's the case! I've been bitten by bed bugs before and it is NOT fun at all.", "And crabs 🦀", "I don't? She was wrong to use that term and the commenter pointed it out. I was simply agreeing with that it was not applicable to the situation.", "QLDs cockroaches are huge and they're everywhere!! Jummping on them doesn't kill them either. 😳", "Check every few days. To be safe I would strip anything machine washable and wash it asap in as hot of water and drying as possible.", "If you find bugs or cockroaches spread some diatomaceous earth (food grade) around the outside of your floors and in any furniture. It will kill them...if the cockroaches are huge (like  in Florida) spray some lemon oil on them and that will finish the job. I hope that you don't need either.\nAs for your SIL, I'm so confused as to how she could even THINK that putting you up in a nasty dirty skanky place was a good idea! She could have used that 100.00 (100 dollars for 2/3 nights?) and bought you guys a really nice meal...\nCongrats on getting engaged 💍 🥳🥳🥳", "Scabies.", "They mentioned after during the confrontation that they saw \"no issue with the hotel\" and that they thought it had \"great amenities and was very cleanly.\" \n\nI did want to extend them the offer of staying with us, but like I said in my post, it was vetoed by my fiance who I assume knows his sister better than me.", ">diamectous\n\nDiatomaceous", "My husband used to travel a lot for work and can be quite frugal. Some clients will book him a hotel, others will pay a per diem . He had one that paid a per diem and he booked his own hotel. He went cheap in a city he was unfamiliar with and ended up with a similar situation. He learned not to be so frugal.", "Booked an AirBNB in Boston years ago like this. Had to high step it to a hotel and fight them for a refund for months, but there was no way my family was staying in that hell hole. I’m amazed at the way they can make a such a nightmare property look so appealing in photographs.", "Ah, I read that as you thought of offering it to them after you had already left, but it makes sense to trust your fiance. It would have made me feel bad though.", "NTA \n\nFor hygiene and safety reasons you two couldn’t stay there. Strange men following you completely unsafe. Her hurt feelings doesn’t trump your safety. She got paid back the money she spent on that room.", "NTA\n\nThere's frugal, and then there's cheap. Frugal is looking for the best deals for good options. Cheap is taking any crappy option just to save money. Your SIL is cheap. I mean read your post you were literally being followed, your fiance was being accosted. I'd explain this to her, say you legitimately did not feel safe. If she doesn't get it at that point, then you know now that her ego is more important than your safety. Good you found that out now!", "So you've been to the Bermuda Sands, too?\n\nWell, wherever it was, I'm sorry your SIL didn't understand. I wonder whether she was aware of the conditions at the hotel. I understand she was embarrassed but you did apologize already and it sounds like you handled it as gracefully as possible. I can only suggest that you explain one last time, as gently as possible, why you changed hotels, emphasize that it was not her fault the place was unsafe/unhygienic and you don't blame her for it, and then drop the subject and don't let her drag you into any more drama. Hopefully she will let it pass in time. NTA.", "NTA. You could catch a bedbug infestation in places like this, absolutely not worth the risk.", "NTA, I’ve stayed in cheap accommodation that has at the very least been clean and also not in a place where I’ve felt unsafe.", "NAH\nYour sister was trying trying to do a nice thing on a limited budget and picked a bad option.\nYou tried it but it wasn’t clean and didn’t feel safe, moving elsewhere was reasonable.\n\nYour sister is just hurt her plans didn’t work out and I think over time will calm down.\n\nWith hindsight, would a two bed AirBNB have been a better option?", "And after paying back the money they spent on the hotel+extra too. NTA op", "If I'd been in that situation I literally would've gone home if I didn't have the money. NAH - you did all the right things (especially venmoing the money back!) and SIL has a right to be offended... but also this trip was about family time, so I hope you get to make up!", "I grew up without much money. I still don't have much money. I can still recognize an unsafe situation (as well as an unhygienic one). I would've been more embarrassed to book my family into a place like that than I would be by them leaving it. If the SIL couldn't afford to pay for lodging in a clean, safe place, she shouldn't have offered. It doesn't sound like the OP and her SO expected it anyway. SIL could've bought a nice dinner out instead.", "Btw you typing it all together counts as a vote", "Oh the trauma for having to spend a few hours in the reality that is sil’s life. No one feels sorry for her for being so poor this is all she can afford but poor little money miss op", "How is the SILs anger justified? It sounds like OP and her husband reimbursed her double or so what she paid for the room. \n\nI’m not trying to be confrontational, just genuinely curious as to your thought process.", "But it’s ok with you and your fiancée to ditch them their with their kid. If it was really about safety neither one of you would have felt comfortable leaving them there. You are privileged and don’t seem to see it. You also majorly overreacted about the safety thing. You embarrassed her and shamed her how you handled it. And the worst is she was trying to do something nice for you but is restricted by her finances. Way to kick her when she is down.", "I genuinely hope they didn't feel that way because if so, I really wish my fiance would've just agreed for me to ask them to come to the other hotel with us. \n\nThe next morning, during our confrontation with them, SIL mentioned how she thought the place was \"very cleanly and had good amenities\" and didn't see anything wrong with it. Based off of those comments, I'd like to think she was happy with the accommodation.", "If you can’t afford something safe then you don’t go on trips. My parents were poor when I was growing up and we just didn’t go on holiday (except for a drive to visit family and staying in their spare room) for several years because of it. You put your money into housing and food and clothes and savings if there’s any left over. You don’t spend on trips away that are impossible to enjoy anyway because you’re coming home with bedbugs and pink eye. \n\n\n\n\n\n\n\n\nI have a lot of empathy for people who are struggling financially but little sympathy for people who choose to waste what money they have. It sucks to not have “nice” things or have holidays away, but wasting money on dangerous overnights away isn’t the answer. Being safe and clean is infinitely more important, *especially* in America where being unsafe or unclean can lead to astronomical medical bills.", "South Carolina.", "I think asking them for how much you should have refunded them (giving them the option to refuse) would have been better than just assuming and throwing some random money at them. \n\nAs you've experienced yourself, not al 'gifts' are nice.", "[deleted]", "So did you die?", "A poor one who want to give her kid the only holiday she can afford? Like I get why everyone is grossed out but it’s super obvious so many posting have never been poor. Sleeping in poorer places or dirty places never harmed my health in any way. It was better than the street!!! I guarantee there are hookers in your high class hotels too. Is it only the poorer or disadvantaged sex workers that gross you out? Don’t worry they don’t want to rape you or whatever the hell else you are imagining. This thread is making me sad and grossed out at some of the attitudes. I guess poor people don’t deserve to live right?", "Dangerous people? No one was robbed or attacked. I’ve been catcalled everywhere. And does it shock you that it was actually the religious pillar of the community married man with six children and tons of money that sexually assaulted me? And the sex workers are trying to survive like say not interested. Ffs is everyone posted extremely privileged?", "> Good for you for getting out of a situation that was unsafe, but she’s probably upset that she can’t afford safety \n\nThank you. So well-explained and I suspect this is exactly right.", "Sounds like that's the real issue. SIL is in denial about her financial situation. She wants to be the family member who can generously invite other members of their family onto holidays that she pays for. What she needs to be doing is focusing on saving her money and career progression to better her family situations. And if she really wants to host things, hosting within her budget. For example after you've purchased camping gear, a camping weekend is a fun safe affordable holiday. Or in my country you can holiday in caravans for cheap, with the benefit you can cook in them, so you save money by bringing/buying food & eating inside.\n\n\nBut raising your kids to think motels where people cat-calling you assuming you're a sex worker and sex-workers are open about approaching you as a perspective clients is \"luxury\"? Their kids are going to resent them when they're old enough to realise they were put in unsafe environments because their parents didn't want to accept the reality of their situation.", "So she has made this about her?  Its her treat. Her anger. Her her her.\n\nA real celebration of you has nothing to do with her.\n\nNTA.", "It is possible that she booked it thinking it was ok. You know, clean and safe, but not luxurious, which hopefully would have been ok with you, and then was embarrassed to admit she made a mistake because she couldn't afford more.\n\n Or her room was actually clean and she had no harassment and didn't see it. \nYou did nothing wrong to move and you don't need to apologize, but I'm not decided if it's NTA or NAH. If she thought you just moved because it wasn't luxurious enough and made up the other things as an excuse, because you need a pool, gym, or whatnot, then I can see why she would be annoyed.", "Maybe considering her financial situation they have stayed in much worse regularly and it was fine in comparison? Toddlers are expensive....", ">SIL mentioned how she thought the place was \"very cleanly and had good amenities\"\n\nThere's a chance that was her pride talking and she knows exactly what kind of places she can afford on her budget. And you leaving because you felt that unsafe was a sharp reminder of the reality of her financial situation and that's why she's reacting like this. Shame and embarrassment transferred into anger.", "Just want to add you can go on some pretty awesome vacations on the cheap. If you go to an area with a lot of national parks, like the Badlands or the Rockies in Colorado, there are places you can camp for free. I know not everyone is into camping but it can be a great experience. If you are in such an area and don't know how to find the free camping then talk to a local. Up in the Badlands we stopped at a random house and asked if they knew where we could camp, the lady told us where she used to take her kids camping. Up on Storm Mountain in Colorado me and my brother found a random estate sale and the lady running it questioned why we weren't camping in the unofficial campground that people in the area used even though we had no way of knowing about it before she mentioned it. \n\nBeyond that there's probably a county ran campground in your area, provided you're in the US, where it's around $10-20 a night. The amenities may be rough at some but if you're on a budget it is a great way to have a cheap vacation.", "Thank you for your response! \n\nPersonally I don’t feel like there was disrespect there because of the outstanding health/safety issues, and the fact that OP was open and honest about the situation. Using your watch example, I see it as more of a “the watch metal causes a reaction on my skin” or “there’s a sharp edge that cuts me when I put it on”, then replacing with one that doesn’t do those things. \n\nI would agree with you, though, if those health/safety issues weren’t a factor. If it was just a case of the room being clean, but old/rundown, or the neighborhood being a just off the freeway/view of the gas station instead of a fancy downtown environment. \n\nI think the SIL may have been embarrassed by the situation and rather than express that, went with anger instead.", "Catcalling and being followed. And let's not pretend catcalling isn't threatening.", "I mean on the flip side SIL thought the hotel was fine and safe enough for herself and her family. Not saying op is wrong for how she felt but that does me the hotel being bad wasn’t objective fact.", "Food grade diatoms, not pool grade! Animal feed stores like tractor supply will have it. Pool diatoms have other pool things added in.", "what is \"the outside of your floors\", like basically the perimeter along the wall of their entire home?", "Their pride said this. They thought differently.", "Sounds like what happened to my sisters in Myrtle Beach. The hotel was a dump, but the friends they traveled with saw no issue with it - possibly because they could afford a better room, but they still were exposed to the same druggies and hookers in the parking lot. These friends were notoriously cheap, though, which isn't the same as being frugal out of necessity.", "I got bored looking for hotels one day and swapped booking.com to sort low to high - it was surprising how the things with extremely low ratings (one had a 2/10) looked fine, maybe a little basic in photos, but the reviews were awful.", "If she can't offer a safe,nice hotel for you why tf did she try to surprise you with it in the first place? I understand giving cheap or handmade gifts and they could be extremely sentimental and cute. But those gifts does not force you to be in an unsafe situation. SIL is ridicilous. No one tried to rub her lack of money to her face,she made a bad choice and blamed it on you. Did she really felt safe and happy in somewhere like that?", "Nta.  If you felt unsafe u definitely should have left.", "NTA. Oh my god OP your SIL is a cheapskate. I’d advise you to bill her for any therapy she causes you to need in the future.", "Nta but apologise anyway that although you appreciate the effort its really uncomrtable for you . Maybe a nice cake or pastry with a letter Will suffice", "NTA - You had every right to leave that hotel.", "Your SIL is mad because they already dislike you for being more well off than they are and sees this as a way to belittle you and make themselves seem \"better.\"\n\nThey think they're \"better\" than you because they can put up with the awful accommodations...and they thought that because they paid for it they could force you to stay there too.  When you didn't fall into their trap they got mad.  A normal person who had sincerely invited you on the trip to spend FAMILY time with you would have APPLOGIZED for putting you in a shitty hotel first and foremost when you moved to another hotel...not accused you of anything.\n\nThis was their goal the whole time...not to have you come spend time with them on a family trip.  That was the excuse.  They needed to \"trump\" you somehow and failed to the point that it made them look bad.  THAT is why they're upset.\n\nThe request for a \"genuine apology\" from your SIL confirms it.  There is nothing for you to apologize for, that's something only a narcissist would think.  That's all she wants to do, hold power over you...and she failed at every opportunity.\n\nSo yeah...NTA.", "YTA. You probably are a snob. It’s ok. You shouldn’t ever feel uncomfortable wherever you are staying. You guys compensated her for the motel room but you did inadvertently throw it in her face. \n\nI would apologize but reinforce that in the future you would like to approve all hotels before she/you book it, I would phrase like this: “ I would prefer not to stay at 1 star hotels, it is for suckers and poor people” /s 😎", "Nta", "OP didn’t mention whether or not the SIL and her family stayed in the same hotel…\nHard NTA for leaving. I routinely travel for work and never stay at less than a 3 ⭐️ hotel.", "NTA\n\nSo she's happy to be leered, catcalled and followed and possibly raped in the area she's in because she wants to save money? Or her husband being solicited by prostitutes and possibly risk being attacked by their pimp?\n\nMan, I get wanting to save money, but not at the cost of such conditions. And it's an insult to book such a room for a newly engaged couple, in such an area. \n\nSorry if I'm being crude, but your SIL and her husband are gigantic AHs for being so hostile.", "NTA husband paid her and she can be mad.", "NTA.  With many hotels, you get what you pay for.  Unfortunately, it sounds like you got a $40.00/night motel room.", "NTA for not wanting to stay in a filthy unsafe place.. I wouldn’t even have sat down..", "NTA. Your sister has a good heart, but this is why trying to live beyond your means is a bad idea. Having the kind of money to take family members to stay at the beach town is something that requires a lot of money. You can’t do it on the cheap for this very reason. \n\nI do think Venmoing her more than the cost of accommodations was a bit impolite. That’s kind of insulting IMO.", "NTA. She failed to provide safe and hygienic accommodation. That's on her. You have no obligation to stay somewhere where you are not safe.", "NTA\n\n&#x200B;\n\nyou are fine. YOu should not even have checked in.\n\n&#x200B;\n\nYour SIL was the AH. NO NEED to apologize.", "I’m happy to risk offending someone for my safety. I think it would have better to go straight to them and say “this is what has happened and I’m really feeling unsafe so I’m moving to another hotel. I would really feel better if you came with us, obviously at our expense”. Otherwise it looks like an excuse (if you felt it was dangerous after those events  but you were happy to leave a family with a three year old there…)", "NTA. Safety comes first and if you don’t feel safe you should feel comfortable to relocate. You apologized profusely, you Venmo’d her to cover the room costs. I don’t know what else she wants at this point.", "“My own personal safety is worth more than your $100. Don’t ever pay for anything for me again.”", "Why on earth would she put you in a place like this? That is rude. It’s like, why bother? She should be embarrassed with what she did.", "There's no close to NAH. Being frugal is one thing, booking a shitty hotel to save money on a fucking trip is another.", "Was it a brothel?  It sounds like a brothel. SIL put OP in a brothel.", "How do you know she’s poor? Regardless, OP was well within her rights to leave that hotel after she was followed and catcalled! Her fiancée even paid SIL back (plus extra) for the room she purchased for OP.", "Bot! The first two sentences are a direct copy of u/LongDistRider 's top-level comment. The \"NAT\" is rearranged. lol.", "OP literally said she texted the family group chat to let them know what happened.", "Ah! Myrtle makes most sense. I shudder at the very thought.", "OP SAYS IT RIGHT IN THE POST. Yeah they paid her back. All right gave her extra money and shamed her made her feel like shit for what she can afford and is normal life for her. They never should’ve taken the offer in the first place, knowing that they can’t afford it . Whatever hopefully you won’t have to learn one day what it’s like.", "If your two options are the street or a place like OP described, then yes, it's understandable the place OP described was better. But that wasn't the situation here. They had homes already, this was to be a fun trip. But they went somewhere that was worse than their home, i.e. it's not a fun trip. It's all about context. \n\nAs for a poor mother who wanted to give her kid the only holiday she could afford, I promise with the same money they spent, they could make a better holiday out of a day trip somewhere, do an activity nearby, or go camping.", "It’s a weird flex to pay for better-off people’s accommodation when you’re poor. She could have spent that money on herself and the kid on a better hotel and ket OP pay for their own.", "I think it's not because they're poor sex workers - it's because they're desperate sex workers. If someone is hassling you for money, and potentially following you, there's a nonzero chance that person is desperate enough to rob you. Hookers are not dangerous. Desperate people are. \n\nAnyway, I'd say you maybe were lucky that sleeping in dirty places didn't affect your health as a kid. There's plenty of risks in dirty unsanitary places for toddlers, who are notorious for putting things in their mouths/licking things.", "Who said anything about the sex workers? OP was catcalled and followed. It wouldn't matter if it was the Pope himself doing it, that's threatening behaviour and a safety red flag for anyone with an ounce of self-preservation.", "I get that I just don’t think people are understanding sister-in-law‘s situation and I feel bad for her and everyone’s just putting her down for something that’s out of her control so I’m trying to bring a different perspective to the convo\nAnd you’re making a Sumption’s that her home is better than the hotel you don’t know that . Maybe her kid asked to go to the beach maybe he loves the beach maybe it’s a dream come true for them", "Yes ok but show me a girl or women  who hasn’t experienced it. Not right but not inherently super dangerous like everyone is making out. People think poor people are just killing and robbing each other constantly or what. I’ve never been harmed in areas the privilege consider dangerous but I have many many times in private school and by the rich. I guess my point is crime happens everywhere and privileged people vastly overestimate the dangers. The cat callers didn’t even see which room she went in since she went into the lobby so what does she think they are going to do? How are they a major danger that she has to move right now. \nAll y’all need to live like a poor person for a year and gain some perspective. Try riding around on buses all night because you can’t find a place to sleep or sleeping in a park because your mother kicked you out for being late for curfew then come talk to me about dangerous.", "Post after post on here. I thought Reddit was a sex worker positive but there’s comment after comment of ew prostitutes, gross dangerous.\nOp says it right in the top of the thread. Read", "Maybe the boundaries between rooms? So if the bugs try to spread, they'll die", "I get that you're trying to \"bring a fresh perspective\" but it doesn't matter how much of a dream come true it is - people were hanging around that hotel for apparently no-good reasons. The child is 3. Save up a bit more and go to the beach when they're older in a safer location. \n\nIf they get assaulted or murdered, no amount of beach is going to make up for it.", "The fact that we've all experienced it doesn't mean anyone should have to put up with it.\n\nMore generally, I really don't see that staying in a situation where you feel unsafe is somehow more virtuous than removing yourself from that situation, if you have the means to do so. Seems more like masochism. Or tourism.", "What are you talking about?  No one wants to live Ike that. I’ve been poor. Don’t need that perspective again. Why the fuck would anyone need to subject themselves to increasingly dangerous conditions to have to meet an imaginary “danger threshold?” \n\nProstitutes at a motel and being followed by strangers are never an indication that a place is generally ok. It’s only going to get worse.  It doesn’t happen everywhere. It happens in shitty environments and it isn’t “privilege” to want to feel safe.", "Well I didn't say that. Go and reply to someone who did.", "I am responding to the discussion in the thread. Go eat a snickers.", "ESH-she was upset because she wanted to sex with your brother, but your presence prevented that. If you were a good sister you would have offered to help, or at least let her know that you don’t mind watching.", "My husband and I are frugal, and last October we went on a road trip which included a trip from Oregon to Southern California. We stayed at several hotels during our trip. One hotel in Arcadia, was dirty. We had planned on being there for two days. Ended up being a single night. The pool was filthy, there was dirt on the walls, the tub was disgusting and the shower head sprayed like the worst shower ever. So many issues. Did not see bugs, and we checked for bedbugs. The door also looked like it had been kicked in before. \n\nDude. NTA. You can have cheap without gross. You can be frugal without risking your life or safety.", "NTA\n\nThis is such childish behaviour from an adult she didn't want to ask you to pay for your hotel cause she has some sort of money complex and is more insulted by you changing hotels despite the above issues being presented to her.\n\nShe  needs to grow up", "NTA. You have a toddler. How can she expect you to stay in those conditions?", "My husband - beardy 6’2”, 325 lbs - has been harassed at shitty motels like this and I’ve been the one to insist he relocate. Took him finding a bullet hole in a window one night to finally convince him\n\nNTA. I’m sorry they were embarrassed by their own financial situation (because that’s truly what this boils down to) and I can empathize with them entirely, but your safety is still more important than their pride. \n\nAnother comparable situation for me would be her going all out on a big dinner and you not being able to eat it due to a food allergy. I’d hope you wouldn’t still eat it at risk to yourself just to assuage any wounded pride there either.", "NTA because you did reimburse her expenses.", "Perhaps it was a working vacation for sil..../s", "NTA. I wouldn't have even entertained the thought of staying there, especially after seeing the sheets and bugs.\n\nYou made it about safety,  and not about \"class.\"  Sounds like SIL thinks things should all be done her way. This probably won't change with her. Just make sure your fiance has your back,  and isn't in the habit of doing whatever his sister says to not make waves.", "NTA. I was once stuck in a motel during a business trip. It was filthy, the window didn’t lock. I considered checking out and  figuring it out when I got back. I ultimately decided to stay because I was sandwiched between two families and it made me feel safer. It turned out fine, but if I didn’t have to consider the bureaucracy associated with a business trip, I wouldn’t have stayed. \n\nYou reimbursed your SIL, apologized to your SIL for checking out. It’s not your problem she was offended.", "NTA. Your safety comes before her feelings. She's just embarrassed and is taking it out on you.", "NTA\n\nHow on earth is it classist to not want to feel unsafe where you are sleeping? Though I am unsure how well you communicated to the SIL and I can see why she was upset. When she started throwing insults, THAT was really shit and unnecessary.", "NTA. But, she does need a thank you. She tried her best, you guys reimbursed the cost, thanks for the thought, etc. You're not \"high maintenance\" for not wanting to stay in a place where you get propositioned by hookers going out to get ice and jeered at while getting stained towels. Would SIL let you stay in her house if it was that dirty? Ask her to justify it. Explain what you found.\n\nNo matter how poor my family was when we grew up, guests got clean linens at the very least. \n\nShe's likely embarrassed and doesn't know how to process it, so she's lashing out to make it anyone else's fault but her own.", "NTA. I’d have left in a heartbeat and you guys offered to take them with you! Not to mention, payed them back double.  If that makes me a classist AH in her eyes, then that’s clearly her problem. In fact, she’s TA for expecting you to wallow in filth.", "NTA!", "YTA, but at least you upgraded and didn't just complain. Next time, offer to split the cost.", "NTA. It was nice of her to book a motel on her cost, but you felt very unsafe there, and it was super gross. It's a good reason to move to another place. And you apologized and paid her for more than she paid  already. So really she is an asshole for getting so angry. You felt unsafe, you left. That's totally fair. I get that she felt embarrassed or hurt because she wanted to do something nice for you, but she didn't have to get mad.", "I think I would not have texted at midnight to say we were leaving. I would have left and not\nMentioned getting another hotel and just meeting at the hotel in the morning.", "Wait.\n\nShe was staying at a 1 star motel with her toddler??", "You may have upgraded hotels, but you downgraded your gratitude. YTA.", "This is how you bring bed bugs home", "We all get it. She was trying to be nice and treat you guys however her accommodations were definitely shady. Again we understand that's all she could afford but she was more than reimbursed and you paid for a new hotel. Definitely NTA. I also would have left if I felt unsafe and could afford to upgrade the hotel.", "Yeah. I can stand a small bedroom, uncomfortable bed, inconvenient position, but there is no way in hell I am compromising on hygiene and safety.", "Exactly.  SIL is deep in a mire of reverse snobbery", "Yes the choice of gift feels very odd to me. Any hotel that costs $40 a night is NOT a place I'd be willing to spend time, full stop. I suspect sis had some hang ups in advance, something to prove, or had a babysitting agenda.", "Sometimes you don't know! I found myself in a gross motel a few years ago because it had been a decent one a few years before *that* when I'd last been there.", "I thought the same exact thing! Heck if they offered to move my family to a better hotel on them I would have packed my shit so fast.  My child’s safety comes before my pride.", "Chonky bedbugs", "I mean, where else can you buy ice from hookers?", "I bet you expect everyone else to dance around your emotions aye? You use words that end in “ist” as often as you can. Talk about privilege", "I slept (an hour?) on a floor in a hotel room full of bedbugs in a seedy location because we couldn't leave the shitty motel room because there were people yelling outside the door and banging and stuff. Didn't see the bedbugs until they came out at night. :( I felt one crawl on my nose in bed until I jumped out.\n\nOne of the worst nights of my life lmao. $100 CDN too. In the morning, a worker came to bang on our door to tell us to get out \"don't you know what time it is?? CHECK OUT\" ugh. and no it was not checkout time not that we didn't want to leave asap lol =.=\n\ni'm glad ya'll left for the hilton.", "Slam dunk! I would have wondered if she hated me for making me stay in squalor.", "And use dryer sheets, I’ve heard that bedbugs don’t do well with dryer sheets", "Spraying Lemon Oil on cockroaches accomplishes absolutely nothing more than stepping on them does. It *just* kills the individual, it doesn’t prevent the potential infestation at all. \n\nDose them with Boric Acid. It’s cheap, easy to get, and they’ll infect each other and their nests with it before it kills them. \n\nLemon oil is some “essential oils” quality recommendation.", "Instead of staying two nights in a dump, they could have stayed one night someplace nicer.", "NTA. I would have left as well. A 1-star motel is never acceptable, and being on a budget isn’t a good excuse this time. If you were sketched out, it was for a good reason and she’s overreacting in a major way.", "NTA since you were considerate enough to cover the costs of the expense she incurred.\n\nYou have nothing to apologize for. Her actions created this situation by booking you into a space that was neither clear nor safe. If she cared about your comfort or well being she'd have been apologizing to you for putting you in the scenario you wound up in.", "NTA: your safety is more important than another person's feelings. Always.", "This may sound elitist but after staying at many types of motels,hotels across our nation I will not stay at non branded hotels. Hampton Inn is my hotel of choice.", "NTA. The only thing that I wish you had done was to take photos for your SIL to see. However, any way you look at it you should not have to risk your safety for anyone, period! If your SIL doesn’t understand that then it’s her problem and not yours. In the future don’t accept or go on any more trips with her unless you are in control of your own accommodations.", "NTA- She put you up in a hotel in a highly dangerous area, where you were catcalled and followed. You are not TA.", "Oh come on of course you're NTA. Those cheap motels are scary. I've had to stay there and I was literally anticipating a break in, peeking out the window like in the movies. That's ratchet behavior to be mad at someone for not wanting to stay there. I could see if it was like a holiday inn express or something, but not the cheapest motel in town.", "Kind of the asshole.", "NTA we have had a similar situation. When traveling with family.  We flat out lie to them. Book the hotel that is clean and safe, with breakfast or whatever using our ' points, free room vouchers or whatever'.  Since it is ' free' no fuss. They cover the cost of their meals and attractions for their kids.  If it's a large group, we try to get group passes.  Budget for what everyone can afford.", "Honestly NAH \nHer feelings are hurt which I get. She wanted to treat you but couldn't afford the level of acceptable you have vs what she has. It's just a matter of personal preference. You are n t a for moving because you were uncomfortable however. \nThis is why there is usually a cap on present giving. You know, maximum of 50 and minimum of 20. So everyone can afford it and won't be \"embarressed\" if they can't buy something expensive. Obviously doesn't apply here but the principle is the same.", "She is not your SIL.  You are not related to this stranger.  If she is not speaking to you, that is a WIN", "Sil sounds like a fragile snowflake", "NTA. I refuse to sleep anywhere that isn’t at minimum as nice as my own room at home. I’ll die on that hill. Call me bougie all you want but motels are a hard no for me. I would have walked straight out.", "Buy her a nice vacation to some crack den in Flint, MI then complain when she doesn't like it.", "I feel like she should have spent that second $100 on her own room and you could have just paid for your own room and then both gotten the nicer hotel... Idk, I'd never \"gift\" someone a one star motel stay, especially as a surprise. You guys made the effort to stay there and didn't immediately gtfo and tried to make amends, you did the right thing. NTA", "NTA\n\nIf your SIL couldn’t really afford this trip, it shouldn’t have happened. How would you be able to enjoy yourself for a weekend in a dirty, rundown and super sketchy place? And why did she think it was a good place for a kid?\n\nStand your ground, point out the solicitation attempts, the sexual harassment and the disgusting conditions of your room. Let her be embarrassed and mad", "NTA.  But you knew that already.", "Invite her for an apology dinner to the worst and dirtiest restaurant in town and then be upset when she doesn't want to eat the food :)", "You handled that as best you could, they will either get over it or they won’t. It’s not on you to compromise your safety for their feelings.", "NTA and I’d like to know the name of the motel so I can read all the reviews ahah", "NTA.", "Also, let's not forget the fact that the \"100\" bucks she spent on their room was venmo'd back to her along with an extra 100 as an apology.\n\nBoth rooms cost her a total of what, 160? So she made 40 dollars profit off of this, and even if both rooms did cost 100 she broke even and got a free hotel stay.\n\nAnd SHE wants an apology? Nah. NTA.", "What I want to know is where the sister in law brother and toddler stayed? It doesn't sound like they stayed at the same motel", "Yeah, I'm struggling with this one.  I can see how the SIL was made to feel ashamed and embarrassed.  The offer to put them up at the Hilton as well was especially tone deaf.\n\nNAH sounds like the best option.", "If someone gave you a rotten apple because that's what they were eating would you eat it", "Right? I wouldn’t have even made it past looking around the room before immediately leaving.", "Sheets that aren't clean is a line I won't even *consider* crossing.", "> I genuinely don't know where the classist comment came from. \n\nThis might have been addressed elsewhere but I’m willing to bet it’s insecurity. I grew up pretty poor but moved away when I was 18 and have a financially secure life now with my husband/son a few hours away from where I grew up. My husband grew up in a family who was also financially secure (not rich, but not struggling).  My sister still lives near home and lives paycheck to paycheck as does the rest of my family there, and I’ve fought off a lot of casual accusations from her about me/my husband’s family thinking we’re better than them, despite none of us feeling or acting that way. His family is really kind and generous but she seems to take it as patronizing when it genuinely isn’t. When I talk to her about it, she usually concedes and agrees that none of us have said or done anything wrong, but she just “feels bad” about it. \n\nSadly, I’m not sure you could have done anything different here to make it less of a problem for your SIL. It’s something she needs to work through herself.", "NTA. And I hope your fiancé doesn’t make a habit of asking you to put up with uncomfortable situations for the sake of family peace.", "Some people desperately try to find hidden drama in everything. Ignore them.", "This is true. I put up with a lot of stuff when I was younger and poorer (& my parents were poorer in particular!) that I would struggle with now. It’s not so much snobbery (intentionally at least) as simply not knowing how much better things could be when I was poor.", "If she couldn't afford a safe hotel room, then why did she offer to treat OP & her husband to a vacation?", "I was scrolling,  looking for this kind of comment.  To me,  the room sounded disgusting,  but not unsafe. \n\nThe things that happened were unpleasant.  \n\nBut the SIL probably feels like OP was spitting on the best they could do.", "She may have had the one good room.\n\nI think it's not uncommon for fleabag motels to have one or two rooms that they actually maintain, just in case they actually get a regular tourist, but it happens so rarely that they don't maintain more.", "\\#1 she's lying to save face\n\n\\#2 her standards of cleanliness are very, very low\n\n\\#3 they gave her the one clean room in the hotel.\n\nWhat of these options seems to be the most likely?", "That’s fine but it doesn’t mean op is required to stay there and be shamed for it", "It wasn't the OP's toddler she says she was super excited to spend time with SIL's toddler", "Nah, but maybe someone did when the FBI raided the hotel a couple days later. Who knows, really.", "Hilarious you’re projecting there. Yep looked at your comment history I was right maybe you should stop using IST words if you have such a problem with it", "What’s worse than that? An SRO with a communal bathroom?", "I love to camp, but my gear cost way more than the $40 that the SIL paid to stay at the motel.  Once you have it (if you have a place to store it), then, yeah, you're good for multiple trips, and the price per trip gets pretty low, but it's not the perfect solution for frugal trips.\n\nIt sometimes takes a lot of money to travel cheaply.", "I didn't say she was. Just that SIL doesn't necessarily \"frequent\" places like that, or enjoy doing so.", "We only have OP’s opinion that they were harassing him. We don’t know what that meant. They probably just said hey boy interested as he walked by. Don’t worry I got it y’all pretend to be enlightened until it comes down to it. You hate the poor", "I don't know, dodgy trailer on campsite?", "Yes. If you live in an area that's bad for them, use it along doorways (especially sliding doors), window sills, & any other points of entry. Works fairly well for ants too, IIRC.\n\nI live in SC & the stupid brown cockroaches carry fleas, so I found a monthly service that uses human/pet safe products. (I have 7 cats, so going through a flea treatment + deworming from fleaborn tapeworms is insanity that I do anything to avoid)", "I booked a hotel off Expedia for one night. Looked decent in the pics. Pulled up to piles of stained mattresses on the curb and people doing drugs right in front of the door. My uber driver actually refused to let me out, told me he would drive me free of charge to any other location. He said he had a daughter and he hoped someone would look out for her like he did for me."]}