{"id": 20465, "submission_id": "14hvscy", "title": "AITA for not giving in to mom about photos", "selftext": "My wife used to model for a variety of photographer and artists. She stopped around 5 years ago, but some of the art she’s appeared in is still found in a couple of galleries and portfolios \n\nOne particular set of photos were artistic nudes she did for a good friend of ours. The photos are still posted online in the photographer’s website, although they are not easy to find. They are artistic, not pornographic in any way. \n\nWell, my mother somehow discovered these photos (I’m not sure how) and was appalled. She contacted me and said we need to have them taken down, they aren’t appropriate, do I really want people seeing my wife like that, etc. \n\nI let her know that she’s completely off base here, and if she really wants to pursue this she can speak to my wife. She was miffed and said that she already tried that, and she even said that she told my wife that my dad had seen them (clearly to try to make her feel bad about it). She said my wife just shrugged and said “what did he think of them?”\n\nWhile I love my wife’s reaction, my mom is now not speaking to us. \n\nAITA for not being more sensitive to my mom’s concerns?", "created_utc": 1687620488, "permalink": "/r/AmItheAsshole/comments/14hvscy/aita_for_not_giving_in_to_mom_about_photos/", "score": 631, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) I blew off my moms concerns about my wife’s online photos\n2) I may be being insensitive\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "[removed]", "NTA and I also love your wife's reaction.", "Lmao NTA\n\nIf your wife is fine with it shes fine with it. Why does your mom care so much about a body that isnt hers?", "NTA. I absolutely love how your wife handled the situation. Your wife's body is not your mother's property, so your mother has no say in how your wife presents herself.", "How interesting. Two Nude photo threads within minutes.\n\nI'm sure there's no connection.", "NTA. Your mom is a busy body.  Tell her to mind her own business.", "NTA\n\nYour mom can find something else to obsess about, preferably something that is her business. And she should talk to her husband if she doesn't like him looking at pictures, not your wife.\n\nThat being said, you need to deal with this. Don't redirect your mom to your wife. She is an in law and it's harder to call her out for your wife, and she needs to be called out.", "Your Mom is a nosey fossil. NTA", "NTA\n\nIt doesn't bother you, it doesn't bother your wife, your mother is not your wife's mother or father. This is none of your mother business.\n\nIf she doesn't like them then she doesn't need to look. She didn't like them so much she showed your father so he could be made uncomfortable....\n\nHer not speaking to you is a power play..if you give into it once your lives will never be your own.\n\nThe photos are out there in the web and can't be retrieved now anyway.\n\nI hope you have a couple of the works your wife was in nude or clothed. If not try to get at least one, you and your wife will regret it later if you don't", "NTA.  It's not her business at all", "NTA.\n\nEven if it was actual p\\*rn pictures, it is up to your wife if she is comfortable to have them pictures online or not, not your mother. I believe your wife is beautiful and your mother might be a little bit jealous. Eventually, she will come back and talk to you again once she realizes you guys do not give in.\n\nYour wife's reaction is hilarious btw, she's a keeper!", "NTA. I modeled in the past and my photos are still online on the photographer’s site and I’m proud of them. If mom doesn’t like them, she shouldn’t look", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy wife used to model for a variety of photographer and artists. She stopped around 5 years ago, but some of the art she’s appeared in is still found in a couple of galleries and portfolios \n\nOne particular set of photos were artistic nudes she did for a good friend of ours. The photos are still posted online in the photographer’s website, although they are not easy to find. They are artistic, not pornographic in any way. \n\nWell, my mother somehow discovered these photos (I’m not sure how) and was appalled. She contacted me and said we need to have them taken down, they aren’t appropriate, do I really want people seeing my wife like that, etc. \n\nI let her know that she’s completely off base here, and if she really wants to pursue this she can speak to my wife. She was miffed and said that she already tried that, and she even said that she told my wife that my dad had seen them (clearly to try to make her feel bad about it). She said my wife just shrugged and said “what did he think of them?”\n\nWhile I love my wife’s reaction, my mom is now not speaking to us. \n\nAITA for not being more sensitive to my mom’s concerns?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA it's not your mother's choice whether the photos get taken down or not. She doesn't have to look at them if she doesn't want to.", "Nta, your wife's body her decision.  The only people who need to be ok about these photos are you and her.", "NTA. Have other people you know seen these photos, or are they sort of secret?", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Ha, thanks. I was quietly proud.", "[deleted]", "She’s like that! Annoying, honestly.", "Thanks. I was proud too although I cringed slightly.", "?", "That’s fair. Hadn’t really thought of it that way.", "Thanks. She means well, some days.", "Sometimes Mom cooks, and sometimes Dad cooks. I didn't know that she would react that way until I told her.", "Thanks. I’m not sure how they saw them or what happened there. Appreciate your thoughts.", "Thank you! Appreciate your nice message. I hadn’t considered the jealousy angle, do you think that’s a thing?", "Thanks! You get it. Are they protected or open for view? That may make a difference.", "Thanks. That’s what I said!", "Thanks, I appreciate that.", "Some of our friends have seen them, when they first came out, sure.", "Huh? Where are you coming from?", "Totally agree! Your mom needs to keep her nose out of it. Does not involve her. It’s your circus (family) YOU need to handle your circus. \nNTA", "It is a generalization of course, but a lot of mothers are protective over their sons, even more if you're an only child and/or close to your mother in general. If your wife is pretty, they can perceive that as an additional ''threat'', as if it was one more reason for your partner to take you away from her.", "Mine are open. Some were published in a magazine (not full nude, but lingerie). I’m married and have a daughter. These photos were taken while I was married and after I had my daughter. I am so proud of them. \n\nWith the comment about your dad seeing them- I’m thinking that may have bothered your mom more than the photos actually existing online?", "Ha, thank you!", "Oh man, that’s deeper than I was thinking. Hmm. I have a follow up question if you’re comfortable messaging me?", "That’s very cool you should be proud of them! And I think you may be right about the dad thing, the more I think about it. I actually have a follow up question for you if you’re comfortable messaging me?", "Sure!", "Great! Just messaged", "NTA, your wife's body doesn't belong to your mother. It sounds like these photos have made her feel insecure, and maybe jealous, but that's not your wife's fault. It's weird how your mother even found them, you said they weren't easy to find. Someone could have told her about them, so that's something else to consider.", "Lol, good for your wife for owning what she did, not being ashamed, and not caring at all what your mommy and her Puritanical thoughts are. NTA", "NTA\n\nWhile I get the thought process of being uncomfortable with this situation especially as she is a person from an older time where this kinda thing was probably near unheard of, this does not come close to excusing the reaction she had and straight up cutting you guys off. A lengthy conversation and likely reluctant acceptance on her part is what should have happened. It's not her business at the end of the day and you and your wife are independent adults. Hopefully with time she will cool down a bit and be open to talking again.\n\nAlso your wife's response is killing me still hahahah", "NTA, love your wife's reaction and good on you for supporting her and not dragging your knuckles", "I absolutely LOVE your wife's response🤣🤣🤣 NTA!", "NTA. Your mom is stuck up, and your wife is clearly more comfortable in her own skin than your mom is in hers. Just let your mom cool off for a while, but don't side with her. Stick with your wife.", "NTA. Not your mom's business", "NTA", "NTA", "The photos are none of her business. She obviously went looking for them, then showed your dad. She’s CREATING a problem that doesn’t otherwise exist.", "Lol. That’s gold. Best response of 2023.", "NTA, so refreshing. Nudity is not inherently sexual. Thanks for understanding that and supporting your wife.", "NTA", "NTA: Your mom is much more worried about how this might affect her reputation (*do I really want people seeing my wife like that*) than about your wife or you.", "NTA and your wife sounds awesome from her reaction to her father in law seeing her naked pictures. You sound pretty awesome too considering how fast you shut your mom down.", "NTA, but I think the photos are the least of your problems...\n\n\nShe is using the tactic of not talking to you as a power move to stablish dominance. If it was me, I would not answer her as soon as she gets back, only you can choose how much power you give to her, and closest to zero is the best for you and your wife.", "Your mother is stuck up, and your wife is clearly more comfortable in her own skin than your mother.", "Yeah someone must have told her. And I hate to think of her being jealous!", "Yeah, she is ballsy, lol.", "Yes that was a good one, lol", "Thanks!", "There’s thousands upon thousands of people across the world on here and you don’t think that could be a coincidence?", "Not too much? Lol", "Thanks. Yes, I agree, although you have to be careful who sees.", "I think you’re on to something.", "Yeah, she is a free spirit! She is not shy about that at all. Maybe to an extreme lol", "We don't know how his mother feels about her own body. No need to make assumptions about that.", "Yes! It’s a thing. Many, many MILs are jealous of their DILs and end up losing (never see or talk to again) their sons over it. Happens more often than you would think.", "I would try to find out who told her, as that is a person you need to be careful around. It's sad to think that your mum could be jealous of your wife, but that's something she has to deal with, without taking it out on your wife. Nudity is nothing to be ashamed of.", "Not at all! Your mother needs to get a grip. She's the only one offended, so she tried to shame your wife. That was funny as hell! I also like to play devil's advocate so I may be biased🤷‍♀️", "Mine are open, too. Anyone claiming that they're \"bad\" in any way can waddle off. Those are simply not the people I'd want to deal with, anyways. Taking those pictures was fun, but still a lot of work", "Ugh. So many questions about this", "Thank you. I look at it the same way. I have a follow up question if you’re comfortable messaging me?", "Sure", "Great just messaged you", "NTA and if my mother was acting this way I'd ask her why she was acting like a creep... is she turned on or jealous of your wife? Why is she trying to create drama over something that's none of her business.", "I also love your wife's reaction.", "NTA - your mother is the ONLY consenting adult whose photographs she has the right to police. Tell her to stay in her lane and not try to control other people’s lives. (also well done your wife)", "Honestly NTA.", "tell mom to stop trying to be controlling. find another hobby. lol", "If it was me, I would not answer her as soon as she gets back,", "[deleted]", "Omg, quite a theory", "She’s tough, lol.", "I think if your wife was to the extreme your mother wouldn’t have found out about the pictures on her own. Your wife would have been told her and your father and everyone else about them. It sounds like she’s not shy or ashamed but she also had the tact to not tell your family about it all.", "You got it exactly right. Thank you for getting it.", "I have a question for you if you’re comfortable messaging me?", ">She said my wife just shrugged and said “what did he think of them?”\n\nI'm ded. NTA", "NTA.  Your mom is a prude and doesn't care about what people think about seeing your wife, she cares about what people will think about seeing her DIL.  I would ignore her and let her come to you.  If she keeps it up, tell her she is being inappropriate, there is nothing wrong with the photos, and she owes both of you an apology.", "Best response to Dad seeing them!", "Your wife is brilliant.\n\nAs are you - telling her to speak to your wife.\n\n&#x200B;\n\nNTA", "NTA. I’m glad your wife is so proud of them and is happy for them to be out there, that’s confidence a lot of people (including myself) would love to have!", "You mom is allowed her concerns.  BUT her concerns are just that:  HERS.  If you don't share her concerns, than tough noogies for her.  Being sensitive to other people is fine, but there is a line where their sensitivities hurt others, even unintentionally.\n\n&#x200B;\n\nNTA.  But your mom's on the road there.", ">She said my wife just shrugged and said “what did he think of them?”\n\nNTA. I like your wife lol she deserves an award for that one", "NTA...is your wifes body...her decision.", "NTA OP.  The photos your wife posed for up until about 5 years ago are no one’s business but her own.", "Ha, I know!", "Thanks! Support means a lot.", "Thanks! You could do it, I really believe that.", "I was proud of that, lol", "Seconding this. You need to deal with your family when they're being unkind, unreasonable, etc. And your wife deals with her family in turn.", "You have good reason to be loudly proud. Your wife sounds like an absolute winner in the best possible way. Take care of yourselves and your little family. \n\nPlease point your mom in another direction. I was blessed to have two incredible sets of in-laws in my life. I cherished my time with them. I am the same way with my sons and their wives. It is the full circle of contentment for everyone.", "It might not be your mum who originally found them. Do you think she would have shown your dad if she found them first?", "No, a spouse definitely gets a say.  Your spouse opinion should matter to you", "I mean... it's a little out there- but it's a great way to shame her into stopping that shit", "Mom's response about the photos tells us everything we need to know about the whole body issue thing. lololol", "Thanks for this. I need a coach like you!", "Ugh. Not sure.", "Yeah, sorry to put that thought out there. I should probably go back to lurking.", "May I ask why you keep requesting commenters message you rather than keeping the conversation on this post?  I've never seen anyone do that before.", "Possible I guess", "Super personal stuff!", "NTA", "NTA.\n\nYou married.  Your priority is your wife, not your mother.  \n\nMy kids are grown.  **I expect them to support their partners over me, because they are adults now.**  That's how it is supposed to be, because they have started new families and that's their priority now, not me.  \n\nThe decisions you and your wife make are your business, not your mother's business.  She needs to accept this, and handle her emotions about it, and not burden you with these.  She's capable of doing this, and showing both of you the respect due to other adults.\n\nIf I have issues with my kids' or their partners' decisions, that's my issue to handle, myself, quietly.  To them, they get respect, love and care, not attitude.", "No aren’t TA but you handled this terribly.\n\nI’m sure your wife signed a modeling release form and because of that, she can’t ask that the stuff be removed even it she wanted it removed.\n\nJust tell your mom that.", "NTA. Enjoy the silence.", "NTA- they're not even your photos to take down. You're not the photographer, and you're not in them. Your wife already said no to her (and I love her reaction to her). You're certainly not going to bully your own wife. \n\nShe doesn't have to look at them if she doesn't want to.", "Probably your wife signed a waiver giving ownership to the photographer and there's not really a whole lot your or she can do even if you wanted to.  I understand your moms reactions but there may not be much else to do.  I could be wrong though.  NTAH.", "NTA. Its not effecting her in any way and as such, isnt any of her business.\n  \n   That was a great response on your wifes part. Lol", "NTA\n\nIf the mom thought they were so pornographic, why did she show them to her husband?", "Yep you’re right.", "Thanks. And she meant it! Lol", "Makes no sense!", "INFO : did your mom specify any reason?\n\nI'm reminded of a thread a few weeks ago: a guy found his friend's lingerie photos online, friend wasn't apologetic enough, so the guy asked another friend \"for advice\" knowing that 2nd friend is a gossip. The girl in the photos turned out to be a teacher, the gossipy friend spread the photos around and the girl in the photos was fired. They were in a pretty religious country IIRC so he'd basically made her unemployable.\n\nRight now it sounds like pearl clutching, and the cold shoulder treatment doesn't speak to your mom's maturity... but you know her best of course. Could there be a legitimate reason?", "Ok, that’s fair. I do have a theory.", "Now you have me thinking lol", "I hope it gets sorted! \n\nAt any rate, I'm happy to see your wife is confident about her body and the modeling she did, and to see the two of you are a team!", "She’s very confident about it! And I do love the photos.", "Without giving away their personal information, why are they asking people to message them privately?"]}