{"id": 20533, "submission_id": "14ii9kj", "title": "AITA for wanting my BIL to move out of my and my husband's house cause he's creeping me out ?", "selftext": "I (25F) married my husband (27M) last year. For a couple of weeks his brother (23M) has been living with us. My husband allowed him to stay with us till he gets back on his feet, as he's currently jobless. I really wasn't too thrilled by the idea, but my husband said he'd stay a month, a month and a half tops till he's finally able to get a stable job and rent his own place, so I relented.\n\nEver since he moved in, my BIL has been acting really weird. At first he'd just innocently compliment me and say how lucky his brother is to have married a woman like me. But then he started with stuff like how he's always been the more attractive brother between the two of them and how he had more experience with women, which is when I started to get a bit uncomfortable around him, but my husband just shrugged it off as his bad sense of humor. Then I caught glimpses of him staring at me like when we were watching a movie or when I was in the kitchen. I even woke up to him staring at me while I was taking a nap on the couch, but he said that he just wanted to wake me up himself in order to ask me if I want coffee. At this point I getting more creeped out by him, especially cause his compliments haven't stopped and seemed to get more flirty. \n\nBut what pushed me over the line was when he literally walked over me in the bathroom while I was taking a shower. I screamed to him to get out and he excused himself and said that he was just looking out for phone, but I frankly I didn't buy his excuse. I literally locked myself in my room till my husband came home and told him that his brother needed to leave now as he was creeping me out. My husband started coming with excuses for his behavior, that he was socially awkward but didn't mean any harm. but I wasn't none of it and started packing my stuff. When my husband asked me what the hell I was doing, I said that if his brother isn't leaving then I am cause I'm not staying a second longer in the same room as him. My husband tried to stop me from leaving, but eventually I did and now I'm staying with my parents. I ignored my husband's calls and messaged him that I'm only coming back once he kicked his brother out of our house. My husband messaged that I'm being unreasonable and willing to destroy our marriage just cause BIL \"accidentally\" walked in on me while I was in the shower.\n\nAITA ?", "created_utc": 1687686568, "permalink": "/r/AmItheAsshole/comments/14ii9kj/aita_for_wanting_my_bil_to_move_out_of_my_and_my/", "score": 173, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I think I could be the AH for leaving to stay with my parents and telling my husband that I'm only coming back to live with him once he kicks out his brother who's been acting creepy towards me.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA and your husband has some nerve to say YOU’RE destroying the marriage. HE’S the one willing to let this destroy the marriage by refusing to kick him out. Disturbing that your husband is so dismissive of you and continues to allow you to feel uncomfortable in your own home.", "NTA. 🚩🚩🚩\nReading this makes my blood boil. He has violated you and your husband is behaving so casually about this. \n\nYou are not safe in that house with the bil and your husband.  One wants to assault you and the other is enabling the whole thing.\n\nCarefully go over your next steps. Whether you want to salvage the marriage or you want a fresh start away from such a man. \n\nWhatever you do have your self-respect and don't concede to you husband's demands.", "NTA. You've been clear with your husband your reasons for leaving and what he needs to do for you to come back.\n\nIt's horrible that he thinks it's OK for his brother to be sexually harassing you, his wife. WTH.", "NTA- the fact that your husband didn't kick his brother out straight away is very telling. \nHe'll pick family over you every time.", "NTA.....Husband is blindly trusting his brother. You are right to leave the house OP. Your Husband needs to kick him out.", "NTA though i would reconsider your marriage since your husband doesn't care that someone (doesn't matter that it's his family) is making you uncomfortable and being a creep. Instead he is making excuses, which makes me think he already knew his brother was a creep in the past.", "NTA, that sounds really awful and inappropriate.  I don't see you had any choice but to move out while his brother is there.  You need to carefully consider where you go from here because your husband will not support or protect you in this situation and that does not bode well for your future as a couple.", "NTA bil is being weird and your husband is just too blind to see it", "NTA\n\n Your brother-in-law's behaviour is inappropriate and crossing boundaries.  It's understandable that you feel uncomfortable and unsafe in your own home. \n\nYou took the necessary step to prioritize your well-being and set boundaries by leaving the house. Your husband should be supportive of your feelings and take action to address the situation.", "NTA. Prioritise your safety over everything. \n\nYour husband care more about your brother than you and they have a weird dynamic. How can he let his brother says he has more experience then him and he’s more attractive then him? whether you’re in the room or not, that’s not normal. Where is is self esteem? I would have kicked that mofo out!\n\nI don’t know if the brother is used to humiliating your husband or something but it’s none of your concern. Choose yourself, always", "Yeah, he crossed the line the moment he made that first comment to you. If he couldn't control his behaviour, then he deserves to lose the right to stay with you\n\nNTA", "NTA. Your BIL is being deeply inappropriate at \\*best\\*, and predatory at worst. The fact that your husband is defending and taking his side is not a great sign.", "NTA your husband is fully aware of how bad his brothers behavior is and has likely been making excuses for his behavior like this for a while. Which means he fully knew what he was signing you up for when he moved him in. Most people would loose it if they knew anyone has walked in on their partner in the bathroom.\n\nWhether he’s socially awkward or not, you’re uncomfortable in your own home because of him. Of course you left. Don’t budge because he has to know this isn’t acceptable and you’re not compromising your comfort and safety again.\n\nIf he continues making excuses for him, you understand that he’ll always place a sexually harassing creep over you.\n\nI would also reconsider staying with someone who minimizes your needs and boundaries like that. He’s trying to play it down but nothing can excuse that.", "NTA, a million times over.\n\nIf I was living with your BIL in the house, I'd be extremely uncomfortable. He's been behaving in totally inappropriate ways, with the shower episode being entirely unacceptable.\n\nBut honestly, it seems like the more serious problem here is your husband...if he can't understand your concerns, he's not only unwilling to support you (a bad sign at any point, but especially so early in your marriage), but he's also demonstrating that the sorts of behaviors his BIL is demonstrating are perfectly fine with him, which would also be creeping me out.\n\nAt this point, my husband kicking the BIL out wouldn't even be enough for me to consider staying in this marriage. It couldn't be done begrudgingly, and my husband would have to apologize in a way that demonstrated he actually understood the situation (and his own behavior).", "NTA. You need to stay safe first. Your husband's priority should be that you feel safe in you own house. Sadly, hubby chooses to play dumb and do nothing. I would sugest to leave home until \"Freaky BIL\" leaves or \"Mr. Husban't\" learns how to take care of his wife.", "NTA. You husband doesn’t want to see it but you need to trust you gut. If he can’t do something to make you feel comfortable in your own home then he’s failed as a husband", "NTA, because this is just the event that allowed you to push the issue. You will have been uncomfortable and unable to “put in words” or explain why you are unhappy. You are not safe there, and it is upsetting that your husband isn’t prepared to help you be safe. I do “get” that a lot of men don’t feel these level of threats that women do, and he presumably feels his brother is harmless. That, none of that, changes what is happening to YOU. Your bil is not your husband, he isn’t part of your household, and you should not feel like this in your own home.", "NTA your husband is willing to ruin your marriage to protect a fucking creep, tell him that he got a choice to make and he's the one ruining the marriage. A marriage is a partnership and you swear to protect and hold, to love your partner until death do you apart and he seem to forget the protect and hold part.", "NTA\n\nBeing socially awkward is not an excuse for making you feel unsafe in your own home. If your husband really thinks that you prioritizing your well-being will destroy your marriage then I personally think you should rethink this marriage.", "NTA This sounds valid. Has he even looked for a job? Yes, he needs to *go*", "NTA.", "Creepy. Now you have to get all of your locks changed after he leaves.", "NTA", "NTA. Your BIL is a total creep. And your husband needs to be a husband and get the creep outta the house. There's no excuse for BIL behaving like that", "NTA", "INFO: what does “walked over me in the bathroom while I was taking a shower” mean? Did he open the door and say “sorry!” Or did he come in and start poking around without acknowledging? “Walked over” is confusing the hell out of me", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (25F) married my husband (27M) last year. For a couple of weeks his brother (23M) has been living with us. My husband allowed him to stay with us till he gets back on his feet, as he's currently jobless. I really wasn't too thrilled by the idea, but my husband said he'd stay a month, a month and a half tops till he's finally able to get a stable job and rent his own place, so I relented.\n\nEver since he moved in, my BIL has been acting really weird. At first he'd just innocently compliment me and say how lucky his brother is to have married a woman like me. But then he started with stuff like how he's always been the more attractive brother between the two of them and how he had more experience with women, which is when I started to get a bit uncomfortable around him, but my husband just shrugged it off as his bad sense of humor. Then I caught glimpses of him staring at me like when we were watching a movie or when I was in the kitchen. I even woke up to him staring at me while I was taking a nap on the couch, but he said that he just wanted to wake me up himself in order to ask me if I want coffee. At this point I getting more creeped out by him, especially cause his compliments haven't stopped and seemed to get more flirty. \n\nBut what pushed me over the line was when he literally walked over me in the bathroom while I was taking a shower. I screamed to him to get out and he excused himself and said that he was just looking out for phone, but I frankly I didn't buy his excuse. I literally locked myself in my room till my husband came home and told him that his brother needed to leave now as he was creeping me out. My husband started coming with excuses for his behavior, that he was socially awkward but didn't mean any harm. but I wasn't none of it and started packing my stuff. When my husband asked me what the hell I was doing, I said that if his brother isn't leaving then I am cause I'm not staying a second longer in the same room as him. My husband tried to stop me from leaving, but eventually I did and now I'm staying with my parents. I ignored my husband's calls and messaged him that I'm only coming back once he kicked his brother out of our house. My husband messaged that I'm being unreasonable and willing to destroy our marriage just cause BIL \"accidentally\" walked in on me while I was in the shower.\n\nAITA ?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "You are NTA. Your husband should have been on this day one. Wife is first", "NTA. You deserve to be secure in your home. Your husband needs to step up.", "NTA. You're a champion for standing up for yourself the way you did.\n\nEven if he kicks his brother out you'll need to have a hard conversation with your husband about him excusing this behaviour and dismissing your fears of feeling unsafe.", "NTA, and be careful of hidden cameras! Trust your gut. BIL does sound a little sus and unapologetic.", "No one accidentally walks into a bathroom to look for a phone or anything while someone else is using it…BIL is creepy for sure and if your husband is backing him up over you due to how comfortable you are feeling, you need to reevaluate your relationship.", "NTA. WTF??? Does your husband realize how fucking creepy his brother is? You feel unsafe in YOUR OWN HOUSE!!! Not to mention BIL can actually take advantage when you're alone with him. Hell NO. Tell your husband that he is being an asshole and unreasonable, he is willing to destroy your marriage by letting BIL stay.", "Unpopular opinion \n\nWhy on earth were you in the shower without locking the bathroom door?\n\nNTA \n\nThe rest:\n\nYes, BIL has made inappropriate comments, mainly putting his brother down.  You or hubby should have addressed those immediately, and by themselves, not really huge, BUT \n\nThe staring is a flag. Where were you when you woke up to him staring?  Sofa or your bedroom?  (Doesn’t OK it, and his reasoning is plausible, but he's creeping you out, never ignore instincts)\n\nDid you communicate how he was making you feel to your hubby?  I ask this so I know if hubby is TA.", "[removed]", "NTA.  You stood up for yourself, now it's your husband's turn.", "NTA. Your husband is the one willing to destroy your marriage by not listening to you.", "NTA - You have major concerns with your BIL’s behaviour. Stand your ground and don’t go back till he’s left and make sure he no longer has his keys, cause he seems like the type of person who would just let himself back in", "NTA\n\nYou gave your husband a choice, he chose his brother over you.\n\nNow he gets to enjoy the consequences of that choice.", "Nta. This reminds me of another story on here a few years ago. Maintain your boundaries. Counseling before cohabitation would be in order. Take care OP.", "Eww. NTA.", "NTA. Its his job to defend you. How can a person \"accidentally\" walk in on someone in the shower??? You would hear the water running and the door would likely be closed. I don't buy that it was accidental at all. Your husband needs to make sure you are safe and that you FEEL safe in your own home and instead he's making excuses for someone who definitely walked in on you in the shower on purpose.", "NTA", "NTA but your husband is the real problem here. What will he do if your BIL becomes even more aggressive? Don't ever be alone with that creep ever again. Don't go back. It's disturbing that your husband is trying to force you to tolerate sexual harassment. Your husband is either a coward or a creep himself since he doesn't see anything wrong with his brother's behavior.", "NTA- I've already commented, but just to add even if BIL was the nicest guy in the world, she shouldn't have to live with someone she doesn't want to.", "This is the kind of people who will punish their daughter for telling she was sexually abused by her uncle. Because she shouldn't say that out loud and make her father uncomfortable and make him having to deal with the situation. And who than will still keep in contact with that uncle and invite him. \n\nYour husband is not stupid, HE KNOWS and HE BELIEVES you. But his brother \"is family\" so you \"should\" accept this behaviour. \n\nBUT he expects YOU to not let him assault you. Your husband puts the burden on YOU to not let anything happen. \n\nNTA. And don't go back at all. He has shown you how much he will protect you and how loyal he is.", "No, trust that instinct! I'm a guy and that was disturbing just reading it. Sorry and best wishes. NTA", "NTA. Your BIL is escalating. Do not go back to that house unless your husband takes it seriously.", "You husband doesn’t want to see it but you need to trust you gut. If he can’t do something to make you feel comfortable in your own home then he’s failed as a husband", "BIL has been testing boundaries to see how much he can get away with\n\nNow he's escalating", "what does “walked over me in the bathroom while I was taking a shower” mean? Did he open the door and say “sorry!” Or did he come in and start poking around without acknowledging? “Walked over” is confusing the hell out of me", "Have to agree. OP is VERY lucky the brother haven’t tried to do anything yet, he has been starring at her for the past weeks while she was sleeping and was fantasizing sexual acts in his sick disgusting head. OP’s husband is a coward and a disgrace to all husbands and men out there. He needed to kick his brother out like yesterday but instead he’s blaming OP for destroying their marriage. \n\nWhat a god damn pathetic loser. OP should divorce this coward. Absolute disgrace.", "[deleted]", "My BIL was at a couple of interviews, but claimed that none of the jobs fitted him (but honestly I really believe that he was just rejected and he was just trying to save face).", "He literally came into the bathroom and started poking around \"looking for his phone\", I literally needed to scream to get him out of there.", "Because you don’t expect people to walk in when they can hear the shower running? This isn’t a public restroom this is her house", "I communicated about the comments he was making, but I admit that I didn't bring up him staring at me cause I tried to convince myself that I was just making a big deal in my mind out of nothing and I wasn't even sure if he was staring at me intentionally, but I admit that was a mistake from my part. Tho I don't know if my husband would've took my concerns about them seriously as he didn't even think that the bathroom incident was a big deal.", "> Why on earth were you in the shower without locking the bathroom door?\n\nOh good... victim blaming 🙄", ">Why on earth were you in the shower without locking the bathroom door?\n\nThe bathroom door might not lock. I've never lived in a house with lockable bathroom doors.", "Maybe because it’s her house and it should be expected that the BIL would have the common sense not to enter when he knew she was in the shower. \n\nAnd she said she was napping on the couch. Where she was doesn’t matter it’s still weird to wake up to anyone staring at you.\n\nShe did communicate and husband didn’t take her side or listen to her at all. Husband and his weird brother are def TA", "Umm what??? Are you talking about the brother or the husband? Because she has been more than gracious for her husband by allowing his brother to move into their shared home. If you mean the brother…then just wtf", "WTF?", "Your BIL is a total creep. And your husband needs to be a husband and get the creep outta the house. There's no excuse for BIL behaving like that", "My BIL was at a couple of interviews, but claimed that none of the jobs fitted him (but honestly I really believe that he was just rejected and he was just trying to save face).", "Yep. Next he'll steal underwear.", "Oh I’m thinking it was maybe a typo - I feel like it meant to say “walked in on me” (or maybe “walked over to me”), something like that. Just my guess though. It seems like it was a little more than him just opening the door, realizing, then quickly leaving - as OP had time to scream at him to leave before he actually left. That’s just how I interpreted it anyway, not entirely sure. Him saying he was looking for his phone makes me wonder if he was poking around, but I’m not fully sure about that either", "Also, what bathroom doesn't have a lock and why wouldn't OP lock it knowing BIL lives with them. Regardless of knowing if he was home or not, Lock the damn bathroom door everytime. A hook and eyelet is the cheapest easiest lock to install if they just don't have a lock. \nIt's weird that with all the red flags OP was getting from BIL's compliments they wouldn't block the bathroom door everytime they used it, but that could be just a me thing from feeling violated in my own home myself.", "The issue IS the husband because he's the one who brought the brother into the house, and he's the one defending his brother's creepy actions. Anyone who defends the person sexually harassing their spouse instead of *their actual spouse* is failing at Marriage 101. The fact that the brother's behavior has driven OP out of the house and her husband is STILL defending it actually does say a lot about him as a spouse. \n\nLike I know people hate hearing any whiff of divorce, but this is a serious issue. This isn't on the level of jumping to divorce over a disagreement on toaster settings or something.", "except how he reacts does show how he is. Also, I am behaving myself I have done nothing that is against the rules for this subreddit. Though your reaction makes me thing you are op's husband or the brother.", "With the way you husband just seems to accommodate him and overlook his behaviour maybe he feels he can be picky about the job he chooses which is dumb but I can definitely see jobs rejecting him since he seems to think he’s more important then he is", "OP people keep getting hung up about the shower thing and it’s ridiculous. He shouldn’t have opened the door in the first place! And it’s not your fault for not locking the door. Also he could have just waited to look for his phone, if he actually thought it was in there which I doubt. Dudes a creep", "This guy's behavior was escalating. Luckily, you're out of that house now.", "What a creep! Thank you for the context, didn’t really need it though. Definitely NTA", "I agree with that.  Personally, I always lock the door regardless.\n\nThis man already creeps her out, unless he wasn't there when she got in the shower, or her shower is en suit, I dont get why she wouldn't just lock it ad a precaution.\n\nEither way she's NTA", "OP you deserve to be comfortable in your own home, and you deserve a husband that believes and defends you. Whether or not his brother had bad intentions of entering the bathroom while you were showering (which come on…looking for his phone? I doubt it), YOU felt violated and it’s his job as a husband to stand up for his wife. The socially awkward excuse makes no sense since the brother claims to get all kinds of women. This is bizarre behavior from both of them", "Your safety is ALWAYS important.  \n\nBIL (up to shower incident) did have plausible reasoning, but that doesn't negate your safety (plausible doesn't mean he's an innocent guy that's misunderstood)\n\nYour instincts said get out of there,  ALWAYS listen to them.\n\nStay safe OP\n\nI truly hope it is all a misunderstanding for your hubby's sake.  Who wants to believe their sibling is a perv/predator?", "Lol I KNEW someone would say this.  No victim blaming at all.  Asking questions for clarification are OK.\n\nIt could be OP was alone in the house when she got on the shower, or it's an en suite.", "Whereas I have never lived in a house without a lockable bathroom door.  This is why I ask questions", "If you're about to ask someone if they want a drink, obviously you're looking at them.\n\nShe's definitely NTA for trusting her instincts or getting out of there.  Heck safety first every time!\n\nHowever,  his \"excuses \" are plausible, and she didn't want him there to start with, which is why I ask questions", "It’s the brother not some random. No harm in it.", "If you are OP, you didn't use your throwaway to reply - you used your actual profile. Just a heads up.", "Your instincts are screaming at you. \n\nYour husband has no right to dismiss your fears like this. None at all. And I think you're right about your BIL, if that helps. I think your evaluation is spot on, and your husband is being manipulated by his brother.", "…. You using multiple accounts?", "bot", "Or straight up assault her", "How about not victim blaming, and putting the onus back on the dude being creepy?", "I don't have a lock on my bathroom door. And I don't lock the door when I'm showering for a) safety reasons and b) because I don't expect my family to walk in on me while I'm in the shower (and they dont).", "[deleted]", "Our bathroom door can only be closed with a key, which we don't even keep around the bathroom as me and my husband were comfortable with each other and would respect each other boundaries, so I was used to not needing to close the bathroom door. My BIL was in his guest room downstairs where there's our second bathroom, so he had no reason to come all the way to the bathroom I was in even if he needed to relive himself.", "Maybe if you KNEW someone would say that, you should have reconsidered the question? It's kind of funny how you prefaced it as an \"unpopular opinion\" as if harassment victims don't get hit with \"well what were YOU doing\" all the effing time.\n\n>Why on earth were you in the shower without locking the bathroom door?\n\nAsking \"why ON EARTH\" doesn't come across as information seeking, it comes across as implying it's strange and unthinkable that OP *wouldn't* lock her bathroom door. Which a lot of people don't do. Because they either don't have those locks on their doors, or because they, y'know, are accustomed to living in a home that's actually safe and respectful.", "Oh right, I assumed it was en suite. But, they have a landline?", "Wasn't trying to be snotty, just pointing out your default might not be someone else's.", "She was asleep, why would he need to ask her if she wanted a drink? It’s her house she can make her own drink. She writes as though he was sitting there waiting and staring at her until she woke up and saw him there. \n\nJust because she didn’t want him there in the first place doesn’t change anything. Having a month+ long house guest is a big ask in any case, she’s allowed to not like it, and she was kind of steamrolled by her husband to allow it. \n\nHis “excuses” are barely plausible, especially with his previous comments.", "The husband didn’t care about the BIL walking in on her in the shower and made excuses for him. \n\nSure she could have mentioned how she felt earlier but his reaction wasn’t going to be different if she told him she felt he was staring at her. He was always going to excuse it and the BIL would continue to push the limits. \n\nWhat would it take for the husband to actually care? She shouldn’t sit around and wait to find out", "The BIL is coming up with rubbish excuses when challenged.  He is creeping on his SIL/OP and making weird sexual comparisons between himself and his brother.", "Did the whole point of this post go over your head? Just because it’s her bil doesn’t make it any less creepy than some random. In fact it might be even worse.", "Found the Brother!!", "Thanks for comprehending that *I* too speak as a former DV victim and just pointing out what my instinct to do is. Okay.", "Exactly I’ve heard so many stories of people passing out in the shower for various reasons or slipping and falling. It can happen to the healthiest of people randomly and its actually better to keep the door unlocked.", "This sort of attitude is what sexual harassment victims face all the time.\n\nLook at what you wrote. Every action of the victim is scrutinised and blamed but the actions are of the offending parties are dismissed and forgiven.\n\n\"Why didn't she lock the door?\" (multiple possible reasons. Mine doesn't even have a lock) Why didn't she do this and that?\n\nBut the guys? \"Oh I'm sure he's just awkward\" \"Oh I'm sure husband is just confused/blinded\"  \"Oh he needs you to hold his hand and explain something obvious like he's a fucking child.\"\n\nCome on.", "It absolutely is sexual harassment. And it doesn’t matter that the husband trusts them, his wife brought up the concerns and the husband just brushed them off in favor of the brother. He’s absolutely enabling this behavior. And just because she didn’t lock the door means nothing, any normal person would hear the shower and know not to go in. She’s ignoring his calls now because he wouldn’t take her seriously before. She’s not “throwing away their marriage” she’s reflecting on if she wants to be with a man who dismisses her valid concerns and doesn’t stand by her", ">It’s not unreasonable to suggest the brother is actually just socially awkward and doesn’t necessarily realise what he is doing - \n\nThen why isn't the husband taking him aside and TALKING to him? If the brother genuinely doesn't know, the husband should be leaping at the chance to educate him. Instead, the husband made excuses and refused to address his brother's behavior. Which, by the way, is *escalating*. He's gone from comments to actually barging in on her in the shower. What's next? Do we need to wait for the brother to actually start putting hands on her for the husband to start taking this seriously, or will he make excuses for that too? OP's husband has already shown he cannot be trusted to have her back, so she's right to remove herself from a situation that is increasingly unsafe.  \n\n>though the shower incident seems a bit of a step too far (but why she didn’t lock the door is beyond me).\n\nSHE SHOULD NOT HAVE TO LOCK THE DOOR IN HER OWN FUCKING HOME. Jesus Christ.\n\nThe other side of the coin of the \"Reddit always jumps to divorce!\" trope is that there are always *these* comments that advise people to put up with truly toxic and unsafe shit in the name of preserving the relationship at all costs.", "Unwanted flirting, especially after being told to stop, is literally sexual harassment.", "To me, it's strange not to lock a bathroom door when in it.  Although I do appreciate there were reasons,  which is why I asked. \n\nOf course, I prefaced with unpopular opinion, I always do when it's not something I would automatically do (like lock a bathroom door)\n\nI believe in getting all the facts or as many as possible.  Is BIL socially awkward? Does he not get social cues?  There *could* be other reasons than he's a perv/predator.    It does NOT dismiss OPs safety.", "Landlines?  To me that's a house phone", "I agree they're barely plausible.  Without knowing if BIL is socially awkward or doesn’t get social cues, it means questions for clarification are required. \n\nObviously OPs safety is paramount", ">The husband didn’t care about the BIL walking in on her in the shower and made excuses for him.\n\nThat's one of the reasons I agree with OP getting out of there. \n\nHer safety is the important thing in this whole situation.  \n\nYes, I  ask questions for clarification, but at no point do I say she should have shrugged it off.\n\nYou absolutely have the right to be and feel safe in your own home.", "Don’t be such a prude", "No one’s diminishing your experience, but DV is way different than what OP is going through. She probably took many showers without locking the door with the BIL there and this was the first instance he felt enough gall to walk in on her which is why she packed up and left. She also said in other comments the door has an old key that they don’t use. It’s not on her to lock the door, it’s on the BIL to not go in in the first place. Normal BILs wouldn’t dream of crossing that boundary", "[deleted]", "If BIL is *genuinely* socially awkward, the husband's response should have been to immediately sit him down and educate him on why his actions weren't OK. Instead, he casts OP as the \"unreasonable\" one who is \"destroying the marriage\" for not wanting to be around someone perving on her.\n\nThis screams of a [missing stair](https://en.wikipedia.org/wiki/Missing_stair) dynamic where everyone just manages around the brother instead of actually addressing his behavior head-on. Asking \"why didn't OP lock the door\" is just perpetuating the expectation that the responsibility lies with everyone else to do damage control.", "It is, so knowing she was in the shower, he walked in on her to look for the house phone? Are there other house phones or only one? Does he have a cell phone?", "It doesn’t matter if he’s socially awkward or doesn’t get social cues, His actions are making her uncomfortable in her own home. He doesn’t get a free pass here, he’s not entitled to stay there. \n\nBesides he claims to have gotten tons of women so either he’s lying or the socially awkward claim is false", "Well he hadn’t actually pulled a stunt like that until that point and her husband was blowing off her concerns. And what if she just forgot to lock it and he took his chance? She should be crucified for that one little detail? I don’t lock my door when I shower either", "BIL was being creepy! Stop trying to jump through all these hypothetical hoops to justify this crap. A door locked, a landline, jesus leave the lady alone this isn’t freaking clue.", "Like guys, don't exaggerate their \" pulling power\"?\n\nI asked if he's social awkward, he hasn't claimed it.", "What the hell? We have the right to ask questions. I am simply trying to figure out just how creepy or possibly predatory this guy is", "He’s clearly socially inept for continuing to pursue his brothers wife when she clearly doesn’t like it. The fact that he’s brought up his “pulling power” at all to her in an attempt to make him more desirable and put down his brother (her husband) is weird.", "If anyone is any amount of creepy or predatory and living in someone’s home for free the person living there is totally valid to want them out! There is a clear pattern of creepy behavior from BIL.", ">The fact that he’s brought up his “pulling power” at all to her in an attempt to make him more desirable and put down his brother (her husband) is weird.\n\nAbsolutely. However, I have known guys who do this \"jokingly \"", "Ok but can you look at context clues and figure out he wasn’t “joking” please. That comment was just one of many actions that displayed creepy behavior"]}