{"id": 20592, "submission_id": "14iy2so", "title": "WIBTA for asking what she did with the rest of the $100 I sent?", "selftext": "\nSo long story short, I found myself unable to visit my father for Father’s Day due to the long-distance (the drive would be several hours each way, and my car was unreliable) and my father telling me to save my money on the trip since he planned to visit me in a few weeks. I asked my sister, who is perpetually strapped for cash and has had difficulty holding down a job but lives near our father, if she had any plans for Father’s Day, to which she said she did not. Given the situation, I asked if she would mind if I sent her $100 to take our father to lunch and whatever else he might want to do, and she said that would work out fine. I told her not to tell our father I sent her money (or at least not how much) since he insisted I shouldn’t worry about Father’s Day and save my money instead. I knew if he found out he would have told her to send the money back or at a minimum have called to complain about me spending my money on him after he told me not to.\n\nI suggested they go out for Thai food - his favorite. Looking back, I could have been more specific - I figured for $100 she would have taken him to get a steak or something at least if not Thai. When I spoke with my father today, I found out she took him to Burger King to get him a whopper and then that was all they did. I did not press for more information from my dad because he was so happy that she took him to get a whopper, and it sounds like they had a good time, so I’m glad he had a good day and don’t want to ruin that. That being said, a whopper in their area, even if it’s a full meal combo, costs at most $15. For two people, a safe estimate is $40 spent. Even if she deducted the cost of her gas to pickup our father and go to the Burger King, she lives a couple miles away so that wouldn’t have been more than $50 total. What happened to the other $50?\n\nBackground: my sister struggles with empathy and social norms and tends to be selfish and has anger management issues. Despite this, my sister and I have managed to have a decent relationship as adults as we have learned to just accept each other’s quirks - for the most part, I’ve learned to tiptoe or avoid altogether things that may piss her off. As her sister, I know she can also be an incredibly sweet and kind person, so I hate jumping to the assumption that she would be selfish or try to misappropriate the money in some way. \n\n\nAll of this in mind, WIBTA if I ask her what she did with the rest of the money I sent her to spend on our father?", "created_utc": 1687728953, "permalink": "/r/AmItheAsshole/comments/14iy2so/wibta_for_asking_what_she_did_with_the_rest_of/", "score": 63, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the asshole if I ask my sister about this because I did not specify that she needed to use the entire amount, nor did I specify she needed to return the change or that I had a minimum spending expectation, as well as the fact that asking might make it seem to her that I assume she was trying to be cheap so she could keep the money for herself.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "You knew your sister has trouble holding down a job and is always broke and you thought giving her $100 to treat your father was going to go any other way than what it did?", "NTA - But think about this...your father told you not to spend money on him.  Your father knows your sister is usually broke.  You told your sister not to tell your father she go money from you.\n\nIt's very likely that your father was thrilled that your sister asked him out for lunch and even had the money to pay, but it's equally likely that he wouldn't allow her to spend a lot of money on him.  After all, he didn't know where she got the money and knows how hard up she usually is.  So she could have offered to take him somewhere nice and he could have said no, that he'd rather go to Burger King, so she can still feel like she gave him a treat but she wouldn't be losing too much money.\n\nSo before you assume she cheeped out on your dad to scam money from you...maybe ask how things went down.  And if it was your Dad insisting on keeping it cheap, but make the \"left over\" a gift to her, because that's obviously what your Dad was trying to do.\n\nBut if your dad says she was the one that suggested Burger King, then go ahead and be mad at her.  But keep it between the two of you, because your Dad got a happy birthday that would be ruined if he found out you two were fighting over it.", "NTA…It’s your money that you gave her to treat your father. If she didn’t use the money for your dad, then she in essence stole from you. This is not okay, and the selfishness is astounding. Your father sounds like a kind man, but your sister is awful.", "NTA\n\nCasually ask her how it went and what they ended up doing. She’ll give you a satisfactory answer or she’ll lie. Knowing if she is trustworthy or not is the most important thing. If she lies, you don’t even have to let her know that you know.", "NTA. I would ask her indirectly about the day with your dad. She might have ADHD, but that is no excuse. She is pushing it, she did the minimum and she pocketed the difference. She could have bought him something from the both of you, but she just kept the money. Next time just send your dad a card, do a video call and spoil him when you next see each other. If she won't give any \"change back\", or you don't want to ask. Consider this her Christmas and birthday presents for as long as you see it fair. Never give her money again.", "NTA, and this is an unfortunate life lesson for you. Not everybody can be trusted with money. Even family.", "NTA. Ask? It’s your money that you sent her for a very specific reason so you have the right to ask about it.", "NTA - what did she do with the rest of the money?? Also, you explicitly told her what she should do (Thai food) and she… took him to Burger King. I’m glad your dad is happy but like come on she essentially stole your money…", "NTA- it’s awful that this happened and your sister is so dishonest. I would suggest next time just let your father know as your sister sounds incredibly deceptive. Even if he did insist on sending the money back, it would be better then having her essentially steal from you and then lie about it.", "NTA, but I would let this one slide and never hand her cash for something like that again.", "No, YWNBTA, but prepare yourself to have your question blow up in your face, likely with a lot of defensiveness and self-pity. She totally spent the minimum she could get away with and embezzled the rest.", "YWNBTA - If you asked what your sister did with the money. But you know she kept it and spent it on herself. Next year don’t send her money-what she did was wrong.", "OP - You are a kind person. Love your creative approach to ensure your father had a happy father's day and being with his daughter was a bonus.  Going to BK sounds like she intentionally cheapen the meal to pocket the balance.\n\nNTA - You are saving $ to see him in the future. It is fine to ask how the money you sent, to spend on your dad, was spent. It is a factual inquiry. If her anger takes over say, chat with me when you feel at peace.  - Best to you!", "NTA !! You gave 100 so she could take your dad someplace nice and she cheaped out and went to BK!\n\nWhere´s the rest of the money? You did not agree to pay for anything more than lunch. If she needed to borrow money for something personal, she should ask for exactly that, and then it is your option to agree or disagree. Skimming the lunch money is stealing.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n\nSo long story short, I found myself unable to visit my father for Father’s Day due to the long-distance (the drive would be several hours each way, and my car was unreliable) and my father telling me to save my money on the trip since he planned to visit me in a few weeks. I asked my sister, who is perpetually strapped for cash and has had difficulty holding down a job but lives near our father, if she had any plans for Father’s Day, to which she said she did not. Given the situation, I asked if she would mind if I sent her $100 to take our father to lunch and whatever else he might want to do, and she said that would work out fine. I told her not to tell our father I sent her money (or at least not how much) since he insisted I shouldn’t worry about Father’s Day and save my money instead. I knew if he found out he would have told her to send the money back or at a minimum have called to complain about me spending my money on him after he told me not to.\n\nI suggested they go out for Thai food - his favorite. Looking back, I could have been more specific - I figured for $100 she would have taken him to get a steak or something at least if not Thai. When I spoke with my father today, I found out she took him to Burger King to get him a whopper and then that was all they did. I did not press for more information from my dad because he was so happy that she took him to get a whopper, and it sounds like they had a good time, so I’m glad he had a good day and don’t want to ruin that. That being said, a whopper in their area, even if it’s a full meal combo, costs at most $15. For two people, a safe estimate is $40 spent. Even if she deducted the cost of her gas to pickup our father and go to the Burger King, she lives a couple miles away so that wouldn’t have been more than $50 total. What happened to the other $50?\n\nBackground: my sister struggles with empathy and social norms and tends to be selfish and has anger management issues. Despite this, my sister and I have managed to have a decent relationship as adults as we have learned to just accept each other’s quirks - for the most part, I’ve learned to tiptoe or avoid altogether things that may piss her off. As her sister, I know she can also be an incredibly sweet and kind person, so I hate jumping to the assumption that she would be selfish or try to misappropriate the money in some way. \n\n\nAll of this in mind, WIBTA if I ask her what she did with the rest of the money I sent her to spend on our father?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YWNBTA, but it may be better to let this go, knowing your sister's tendency to blow up, and next time send less money. Now you know that she's going to skimp on a Father's Day treat for your dad, send her $25 and let her figure out the rest. Your dad wants you to save your money so honour his wishes. He was fine with going for a burger, so he obviously isn't interested in you making a big fuss of the day.", "NTA Call it a gift done and move on. $50 isn’t worth the angst given that she did take him out. I’ve learned over the years to let this petty stuff go. More important things to worry about.", "Also OP said she was selfish. What is that expression about expecting a different outcome?", "If that were true, OP would have gotten the rest of the money back.", "This is the correct answer.", "This is such a lovely, empathetic response.", "I like this solution. She is NTA for wanting to know what happened with her money, but I doubt a conversation would be productive. OP could give symbolic gifts (e.g., a baked good) at appropriate gift-giving times to recoup the money.", "You’re NTA but this comment is the correct answer", "NTA, but next time look into giftcards or call your dad's favourite restaurant and set up a package for that $100, that way if there is anything left over they can get desert or takeaway. Never give cash.", "NTA", "NTA but maybe pointless and naive\n\njust learn from it instead", "NTA- asking would be polite, I would demand to know…", "NTA... but you will have to let it go as you gave her this freedom.  \n\nNext time call the restaurant and have them hold the gift Certificate", "Yeah ask how it went so you know for sure then say great that covers your birthday and Xmas presents this year.\n\nNext time don't give your strapped for cash sister money unless it's a gift for her.", "NTA but don’t ask your sister. It will stir up shot that doesn’t need to be stirred.", "NTA she stole from you. Your father deserves to know the truth about her and what you did for him."]}