{"id": 20620, "submission_id": "14j922c", "title": "AITA for not contributing to my boyfriend’s home renovations?", "selftext": "My boyfriend and I (both in our 30s) have been together for almost 2 years, each make decent money (he makes almost twice my income), and plan to marry and have kids in a year. \n\nLess than a year into dating I agreed to move into his house which he owned for several years at that point. Before officially moving in, all he requested of me was to pay 40% of the monthly mortgage and utilities payment and to take turns buying groceries. I gladly agreed and have consistently done that. I’ve also been paying for everyday necessities such as toilet paper, soap, papers towels, etc and we use my car 95% of the time because he’s pointed out that my car is more gas efficient (I always pay for gas too). I estimate these extra monthly costs to be around $400-500 and never complain.\n\nSince the beginning of our relationship, he’s shared his home renovation plans starting with the bathrooms which he estimates to cost at least $10k. I like the idea because the improvements would be nice to have (floor-to-ceiling marble, glass shower doors, new windows to add natural night). There are currently no issues with the bathrooms but he insists we should get it done before we have kids and would like me to contribute.\n\nI’ve always been upfront about my hesitation to contribute large amounts to a home I don’t own because we aren’t married yet and I’m not on the deed. I also don’t want to be like his ex who contributed to similar expenses and obviously that didn’t work out. I told him it would give me comfort in knowing I contribute large amounts to something I also own and also shared my insecurity about ending up like his ex which he thinks is ridiculous because nothings guaranteed anyway (we could marry and divorce).\n\nHe recently had other improvements made to the house which cost over $10k. I didn’t help pay or request these things but I have made previous comments about how these upgrades would be nice to have eventually.\n\nLately it seems my boyfriend has been building resentment towards me for not contributing more because he’s made comments that my monthly mortgage contribution doesn’t help a lot and that he feels like “he will always be alone in this”. I’ve told him I have no issues with contributing more once I’m on the deed.\n\nEdit: \nThank you all for the comments received thus far. I’m a little overwhelmed because I wasn’t expecting this many. I wanted to provide a little clarification/extra info in response to some of the comments.\n\nThe 40% I pay is towards the mortgage and utility bills and by his calculations the total for that is $800. That plus the extra $400-500 I spend brings my monthly contribution to ~$1200-1300. According to a quick google search the average cost of a 1br apartment in my city is ~$1560. We’re both aware that I pay less than the average and I’ve expressed my gratitude for not having to pay that much anymore (I rented a 1br apartment before moving in and have done this for years). Also aware that utilities like electricity and gas can fluctuate so I’m also grateful to pay a fixed amount towards that every month. Although we mostly use my car and I always pay for gas and the monthly city parking, he is very experienced and handy with cars and has done my oil changes so I have not had to bring my car in for maintenance at a shop.", "created_utc": 1687760046, "permalink": "/r/AmItheAsshole/comments/14j922c/aita_for_not_contributing_to_my_boyfriends_home/", "score": 1032, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > My boyfriend asked me to contribute to home renovations and I refused. I think I might be the ass since I live in the house and get to “enjoy” the upgrades.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. He basically made a rental agreement with you but expects you to contribute like you’re an owner. If he “feels like he’ll always be alone in this” then he should formalize your partnership.", "Your boyfriend is wanting to take advantage of you. The fact that he blows off you paying 40% of his mortgage, despite him earning twice as much, is concerning. Tell him you legally are just a renter, and renters do not pay for home remodeling projects a landlord wants.   NTA", "NTA\n\nThe little detail of taking your car but not contributing toward gas says a lot about where his heart is. Sure it’s more gas efficient, especially since it’s completely free for him. He wants you to contribute big $$$ toward his house, but he won’t contribute small $ toward gas, plus wear and tear. Small detail, but big 🚩.\n\nAnd now you know why his ex is an ex, and why you should probably be one too. He’s all take and no give.", "NTA. Don’t pay for work on a house you have no legal claim to. Quite honestly you need to take a step back from paying the amount you do in my opinion. \n\nI could see covering/splitting utilities and groceries, but why are you paying any amount of money to a mortgage you’re not on? And in addition to that you’re the one putting all those miles on your car, and if he doesn’t contribute to gas I’m assuming he doesn’t contribute to maintenance either. \n\nAnd you’re not even the first partner he’s pulled this shit with? Idk bestie, the red flags are starting to pile up.", "NTA - Your current contribution agreement is more than fair. Saying covering 40% of the monthly mortgage payment plus utilities among other things is not contributing enough is laughable. Certainly more fair than some arrangements I've seen r/ relationship advice that's for sure.\n\nYou can worry about paying for renovations after you get married.", "\"I told him it would give me comfort in knowing I contribute large amounts to something I also own and also shared my insecurity about ending up like his ex which he thinks is ridiculous because nothings guaranteed anyway (we could marry and divorce).\"\n\nThis right here is a red flag to me. If he is vocalizing the possibility, I find that to be a bad sign in a relationship. NTA. There's no reason you should pay for renovations on his house unless he puts your name on it too and you own part of it. I applaud you for having really good boundaries. \n\nEspecially since he makes so much more money than you, it sounds like you pay for too many things. Costs should be pretty equal, especially if you care for your partner enough to think about having a family with them. He should want to pay for half of what you pay for. You followed his stipulations for living there, which I think are pretty fair. You're basically paying rent until you are married and/or have your name on the house.", "NTA\n\nYou are being completely reasonable and rational.\n\nIf or when the two of you do get married, I suggest getting a prenuptial agreement.\n\nIt seems like your boyfriend has some slightly skewed perspective on what shared finances should look like.", "> I also don’t want to be like his ex who contributed to similar expenses and obviously that didn’t work out.\n\nSo he's already done this to an ex before and he thinks he can get away with it again? \n\n>he’s made comments that my monthly mortgage contribution doesn’t help a lot and that he feels like “he will always be alone in this”.\n\nDon't fall for this crap. Don't pay more than 50% of his mortgage. There's two of you living there so the split shouldn't be more than that. NTA.", "NTA.  He increased his home value with those improvements, so he put that money in future him’s pocket when he spent it on the house.  You shouldn’t be expected to contribute to improving the value of his home unless you’re benefitting from shared ownership (or sharing the increase in value).", "Lol. If he doesn’t want to feel alone owning a home he can put you on the deed. NTA.", "NTA. Even if you did not mention the Ex, I would of said it’s weird since you are not on the deed. But the whole ex paying, red flags everywhere!", "Nta. Seems like he wants you to pay for a lot of the house lol.", "NTA. One thing, wouldn't it be possible for him to just sell you equity in the house in exchange for your contribution? I mean, if the house is worth 500k, and you contribute 5k for renovations, then he'd sell you 1 % of the house in exchange for your contributions. Just put it in writing, with a proper contract. Then if you split up, you're guaranteed to get the money back, if you don't, well then all is well.", "NTA--He is and it's not even close.\n\nIt's perfectly fine for him to want someone living in **HIS** house to contribute some form of rent (your 40% of his mortgage) and to share the monthly expenses reasonably equally.  You are already going above and beyond in terms of splitting those costs.  But to expect you to share in the costs of upgrades to **HIS** house that increase the value of **HIS** house while your only benefit is though a nicer living space?  Ridiculous.\n\nYou are essentially a tenant in **HIS** house and apparently don't have any legal rights beyond what the law where you live dictates as one should he chose to kick you out of **HIS** house.  If you lived in an apartment and it needed upgrades, those would be your landlord's responsibility, not yours and it is clear this is what your situation is even as you don't have a written lease.  \n\nYou already know he scammed his previous \"future wife\" into \"investing\" in **HIS** property and in the end she go nothing for her \"investment\".  She had do have expected the same kind of returns you're being promised or there is no way she would have paid for renovations to **HIS** house. See this as the pattern it is and demand that he put everything in writing, including a return on your \"investments\" in **HIS** house before you give him any more money that you already do.  If he won't, you know the reality of where you stand and insist that monthly expenses be split 50/50 from now on too.\n\nI have a feeling you already know he will balk at that as well and if he does, GTFO as fast as you can before this USER continues to take advantage of the generosity you already show him on a monthly basis. \n\nTLDR--NTA with a previous pattern to support your position.", "NTA. Right now you are already paying more than him. 40% mortgage + only using your car and gas is not a fair split. Basically you pay half the mortgage while not having a house in return. Hell no to even paying for renovations without being a part owner. I would offe for him to make you part owner and then split all costs equally", "NTA\n\nNo, you're not the asshole for not contributing to your boyfriend's home renovations. You already agreed to pay your fair share of the mortgage, utilities, and everyday expenses. It's understandable that you have concerns about investing in a property you don't own and you've expressed those reservations. Your willingness to contribute more once you have ownership rights shows your commitment. It's important to have open and honest communication with your boyfriend to find a compromise that addresses both of your concerns.", "There are several ways to fix this, including marriage, domestic partnership or an equity sharing contract.  It sounds like his plan is a scam, which has already worked once for him.  NTA", "NTA. For all the stated reasons.", "Nta you make more than reasonable contributions. He sounds like a spoilt entitled child, that noone has said no too. He has now thrown his toys out the pram. I would be asking myself is this relationship worth the hassle.", "Nta\n\nDon't contribute when you have nothing to gain. \n\nAnd your bf sounds like leech. \n\nIt makes sense that he wants to have marble bathrooms, since you're paying for most of the things.", "So he “feels like he will always be alone in this”. \n\nPoor guy, if only there was a solution to that. /s\n\nLike, say, putting you on the deed. \n\nOr marrying you. \n\nYou are very much NTA here. \n\nHis attitude to using your car would be a red flag to me though. It seems like a small thing in the big picture - but he’s basically saying he will sneakily push any costs onto you that he can, in addition to what you’ve agreed. \n\nHe sounds very ungenerous with his money. \n\nIf you were to marry & have these children you’ve both talked about - and your earning power would reduce at various points (possibly long term due to cumulative effect of dipping out of the job market for a period of time, possibly from long term health problems for either you post-birth or a child being born with additional needs) - do you trust him to take care of you? Generously & with love?\n\nOr would he make you justify every penny you spent of “his” money, so that you weren’t able to buy new bras when your breasts changed size after feeding his babies - or afford to go for a coffee with friends once a month? Or join a gym to try to keep your health a priority even with small children. \n\nSomething to seriously consider!", "NAH  I was with you but then I realized that you want your name on the deed but haven't mentioned buying half of what he already purchased (the house) So I do kind of see why he wants you to help with renos that you also benefit from. \n\nYou need to sit down and hash these details out as yes, he may be building resentment. It would be the time to mention if you are contributing more monthly. (Like your car that is so gas efficient it costs him zero dollars to drive!)", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy boyfriend and I (both in our 30s) have been together for almost 2 years, each make decent money (he makes almost twice my income), and plan to marry and have kids in a year. \n\nLess than a year into dating I agreed to move into his house which he owned for several years at that point. Before officially moving in, all he requested of me was to pay 40% of the monthly mortgage and utilities payment and to take turns buying groceries. I gladly agreed and have consistently done that. I’ve also been paying for everyday necessities such as toilet paper, soap, papers towels, etc and we use my car 95% of the time because he’s pointed out that my car is more gas efficient (I always pay for gas too). I estimate these extra monthly costs to be around $400-500 and never complain.\n\nSince the beginning of our relationship, he’s shared his home renovation plans starting with the bathrooms which he estimates to cost at least $10k. I like the idea because the improvements would be nice to have (floor-to-ceiling marble, glass shower doors, new windows to add natural night). There are currently no issues with the bathrooms but he insists we should get it done before we have kids and would like me to contribute.\n\nI’ve always been upfront about my hesitation to contribute large amounts to a home I don’t own because we aren’t married yet and I’m not on the deed. I also don’t want to be like his ex who contributed to similar expenses and obviously that didn’t work out. I told him it would give me comfort in knowing I contribute large amounts to something I also own and also shared my insecurity about ending up like his ex which he thinks is ridiculous because nothings guaranteed anyway (we could marry and divorce).\n\nHe recently had other improvements made to the house which cost over $10k. I didn’t help pay or request these things but I have made previous comments about how these upgrades would be nice to have eventually.\n\nLately it seems my boyfriend has been building resentment towards me for not contributing more because he’s made comments that my monthly mortgage contribution doesn’t help a lot and that he feels like “he will always be alone in this”. I’ve told him I have no issues with contributing more once I’m on the deed.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA - Your paying part of the mortgage because you live there. Don't sink your money into HIS house until your names on the deed/he itemizes your contributions and agrees to reimburse you if you break up and he sells it.", "Hold your ground!\n\nUnless there's a wedding ring on your finger (thus giving you legal rights) or a pre-nup or your name on the deed, do not contribute to capital expenses.\n\nI'd also be inclined to have a proper lease with him, but that's up to you.\n\nNTA and well done. So many people get taken for a ride this way. What if he died tomorrow? Who would the house go to then? Nope. Definitely not.", "nta but kinda sounds like he's just scamming a series of women into paying for his home renovations", "NTA. If he want's some financial help then he can put your name on the house as well as his. Seems to me like he's using you if you're buying all the daily necessities and even using your car 95% of the time.", "NTA.  You need to stand firm on this.  While it's highly dependent on the area you live in and his mortgage, generally, the costs you're talking about should add up to rent + utilities were you to be renting an apartment.  Though, honestly, there are things you give up as you don't have a formal tenancy (for example, he could theoretically kick you out immediately if you break up - again, law of the area dependent), so I would think it would be more reasonable if the car was taken out of the equation/he contributes towards the gas and wear & tear or reduces your contributions accordingly.  Then there's the other consideration, which is that many couples split housing costs proportionally to salaries. Do a comparison, OP, for one-bedroom rentals and see if what you're paying is reasonable.  \n\n**But do not contribute a chunk of money towards a home you don't own.**  You are right, that would make no sense; that's just money down the drain.  You are not married, you are not on the deed, you don't have children together... his inability to see this from your side is really problematic.", "NTA. Don’t pay for renovations for a house you don’t own. If he adds you to the deed you should contribute, but otherwise it’s a recipe for you pouring money into something you will never get back. \n\nIt sounds like you’re paying more than him for your everyday expenses if you’re paying for all the gas. If I were you I would summarise your shared expenses and make sure that there’s a balance between you so that neither you or him are feeling like you are paying more.", "NTA, he is", "I see in my crystal ball no kids and no marriage in your future unless you two really talk things out about expectations vs reality.", "He gaslighting and manipulating you. Move out .", "This is it. Does that mean he never plans to marry? Never plans to co-own assets, including a house? Because that's a flag of a certain color flapping in the breeze there.\n\nNTA. Don't contribute to something you don't own without more agreement. If he raises the rent, discuss the gas and other costs. As far as the house goes, you're a tenant.\n\nAs partners, though, it's time for a serious discussion about plans and timelines and feelings, especially if you're thinking about kids in a year or so!", "She paying it for rent....why should she live there rentfree?\nBut the renovation yeah she definitely shouldn't pay for those", "Regarding the money toward the mortgage, that’s generally called “rent” and that’s what she should be paying. Idk if 40% is appropriate; OP shouldn’t be paying any more than the market rate for a room in a home in her area.", "Maybe because she makes up for it in wear and tear on her car and gas.", "Wear and tear on a car isn't hundreds a month.", "NTA\n\nYou are contributing fairly, based on what you've written.  You shouldn't pay for renovations or maintenance on a house you don't own.", "NTA.  And your boyfriend’s argument that you might get divorced is not the same as a breakup with a girlfriend.  There are laws that protect the equitable splitting of marital assets.  Do not put money into a property you gain no equity from improving.  Might as well renovate a rental apartment.  Sure, it’s great while you’re living there, but the homeowner reaps all the benefits of your investment, with no financial return for you.  Almost seems like this is your fiancé’s MO; get the girl he’s involved with to pay for home improvements, then move on to the next gf and home improvement project.", "See he wants wife privileges when you are the girlfriend. You are correct, once you are married go for it, but right now, it is just rent. Also all those renovations can wait. Won’t you need that money for the wedding? If it is not an emergency, that can be placed in the back burner.", "NTA. Do NOT give any more towards the house in any other capacity than your share that shall be seen as \"rent\". You are not on the deed, so you are not responsible for home improvements at all. \n\nAlso, are you actually ***officially*** engaged, or is that also \"just discussions\" at this point? He is rushing you to make financial contributions to a home you have no real vested interest in. He wants to make sure these renovations are done \"**before . . .** ***what***\"? Marriage, kids?\n\n*Think long and hard on how/why the ex made their exit.* Now he's pressuring you to give more, with no investment.\n\nYou may want to rethink this relationship and it's \"costs\" to you. \n\nYou may want to speak to a lawyer and see what kind of document will protect your investment without marriage. If he will not sign a \"promissory\" note for your portion of the renovations, then exit the relationship. You are his current ATM and you will not get full value for the current financial contributions you are making. \n\nI would be considering the vibes you are getting because you are leery of giving more towards the house. You said you feel resentment, then you know where you stand. You had doubts or you wouldn't be here asking internet strangers for their opinion. \n\nThe majority are telling you to keep a good hold of your money and where you invest with no guarantee of return. Financially AND emotionally.", "I presume the law where you are is that assets of married couples are legally owned by both? \n\nSimple, you don't want to pay towards something if there's no security, as you say, he could dump you and keep his nice new bathroom and you'd have nothing to show for it. Just tell him you're willing to pay once you're married and there is the security of knowing that if anything happens, you're entitled to a share. I mean that's what marriage is isn't it? It's perfectly reasonable that you should share the cost of the renovations, but it is also reasonable to expect that you should benefit from them, that means both in their use and some of the added value if the house is ever sold. \n\nJust make sure you don't sign any sort of prenuptial that excludes you from the value of the home", "Yeah, NTA.  My girlfriend and I have a similar arrangement.  However I’m pay the full mortgage and she only pays the utilities.  I’d never expect her to pay for the renovations in the house.  She has offered to help, but that is waaaayy different than expecting.", "As long as your not demanding for some things (let's say a pink room or something like that) NTA.", "**NTA** \n\nIt is odd that he thinks it fair for you to help pay for renovations yet he does not help pay for gas. \n\nYou are smart to not pay for renovations for a house that you do not co-own.", "NTA... Move out for now... Reassess the relationship after a few months of living separately (but still a couple). Frankly, i think he's using you", "Nope.  \n\nI am in his situation.  I own the house my partner and I live in.  \n\nI pay for repairs, renovations, etc.  It's my house.   He only pays rent/utilities share.  \n\nYou don't owe a cent more than agreed on rent.  You two need to draft up an official lease.  \n\nNTA", "NTA. If he feels alone then have him sign paperwork giving you financial recompensarían in the vent it didn’t workboat. That way he won’t feel ‘so lonely’. It should be 1/2 the total of the increased value of the house based on improvements and to reflect the 40% of the mortgate you have been paying for x months.", "NTA\n\n\"he thinks is ridiculous because nothings guaranteed anyway (we could marry and divorce).\"\n\nBy that logic, why don't he just put the entire house in your name. Anything can happen, can't stop you from taking a leap of faith. What a stupid fucking logic.\n\n10k is a lot of money, ain't no way in hell i will ever ask anything like this from my future partner, unless her name is on the deed.", "He makes almost twice your income and you pay 40% + other bills. Doesn't seem fair.", "NTA. Do not contribute to his house projects. Tell him he needs to start paying for gas and maintenance on your car or you can take it out of the rent.", "NTA. You are right. Paying half the mortgage is the same as paying rent, but investing in a house is another thing. If he wants you to invest those amounts then it's time to be on the deed. If not, his house. He can always up the \"rent\", but looking at the use of your car and you paying for it, I'd say you're paying back that half of investment into the house in about 10 months or so. So looking at 2 years, you already paid your half twice with doing this (in Total the usage of the car over 2 years has cost you well over 10k). He can continue doing this or start using his car, which will set him back the same amount.", "Exactly.  Protect yourself. \n\nWhere I live ALL the money expert people in the media warn women about falling into this trap (like his ex did).\n\nIt is reasonable to share expenses but if you are paying towards the mortgage you should get equity in the house.  Formally and in a contract.", "Yeah, also OP says that he played the same shit with his ex.\nI mean OP you need to open your eyes and see if you find flags of a certain colour because I guess almost everyone in the common section can smell it.", "I agree, NTA, but I wonder - is not sharing money where everyone keeps their own income in serious relationships and marriages some American thing?\n\nIt would be good to hear from more Europeans/other continents, because I've never seen that kind of arrangement, so it seems off to me, especially when kids are in the picture.\n\nI respect your choice to do that and have no issues with it, it's just something I don't fully understand.\n\nSo, technically, in the OP situation, I would say there's something wrong with their relationship, but looking at it through the lens of the majority - I don't think you should spend large amounts of money on renovating house, that isn't yours, and - from what I understand - he doesn't want to add you as the second owner.", "Got to love you shouldnt be paying rent to your partner, because it's not her house also. What ridiculous logic. I guess she is better off paying more than $1k a month for a studio apartment to some big company or landlord that has absolutely no way of benefiting her.\n\nWhere as if the relationship lasts it does have a chance to benefit her paying rent to her partner. And if it doesn't last more than more than likely they got a few years of cheaper rent for the size house they are in.", "NTA. Also, marble is not great in a bathroom. Requires constant upkeep because it is porous.", "When my partner lived in my house I charged him rent set at what renting a room locally would cost. He got a bargain because he had a room in the house as his study, and the whole garage to fill with his  junk.\n\nI pointed out to him that if he didn't live with me he would have to pay rent or mortgage somewhere else, so why should I let him live rent/mortgage free. He earned five times what I did.\n\nUtility bills and food we split 50/50.", "She is paying for a rent without a contract. It’s a big red flag.", "It's a difference if she pays toward mortgage and paying rent. Rent has a contract and gives you rights as a tenant.\n\nAccording to her wording, she pays part of the mortgage without having ownership. The money might be the same but the outcome isn't.\n\nRenting is borrowing a room without receiving ownership, mortgage is paying towards ownership of that rooms.", "It’s becoming more popular. Often it’s because, historically, women end up unable to leave a bad marriage if the man holds the purse strings and a lot of moms told  their daughters “keep some money for yourself” when married.", "She doesn't. However, I have a really nice other calculation that actually makes sense.\n\nThe 40% is more than fair as \"rent\". However, since her car is being used for about 500/600 a month alone on gas, that's 6.600 dollar on average per year.\n\nSince he wants to do a 10k renovation and asking half, well, that half has been paid with the usage of the car in the first year. Since it's already 2 years of this (if I understand correctly) she has had 13.200 dollar in costs for the car. Which will be more if we actually calculate in wear and tear. But for simplicity lets round it up at 15.000. That means she has paid off 3x half of 10k renovations with the usage of her car, because he had 0% cost in that.", "Ahahhahahahah... Wait you're serious? Depending on the model/use it's at least 1/3 of the cost of travel. If you're using it daily that's at least 200$ a month.", "Average rent is $1702..........", "That's amazing you've managed to pull an average rent figure with no idea the size of the property or the location.", "Yet you're fine with the other person using $600/month as average vehicle costs without complaining about the likely state of the car?", "Okay it's $1702 for an apartment of 897sq ft. That's the average for the US. Used the US because the comment or used dollars for currency.\n\nSource below:\n\nhttps://www.rentcafe.com/average-rent-market-trends/us/#:~:text=What%20is%20the%20average%20rent,location%2C%20size%2C%20and%20quality.\n\nThere's a list of states with average prices for each state for similar sizes, the average is $1702. \n\nYes it's amazing I have the ability to use google", "Ok, now look for a room in someone's house, because THAT would be a better comparison.", "NTA\n\nNo name on the deed = you are a renter. Renters never pay for renovations, that's anowner thing.", "NTA. You’re essentially a tenant and tenants generally don’t pay for home repairs or upgrades. (I realize there are nuances to paying rent to a partner that makes it different than a traditional tenant-landlord relationship but my point stands.)", "NTA.  \nHe wants you to contribute? NP. He can put you on the deed. Or, you can get a lawyer and write up a contract whereby if you break up, he either has to pay you back + interest (as if it were a loan).  \n\n\nIf you married and divorced, you would have rights regarding the house you lived in, especially if you contributed to renovations.  \n\n\nHonestly? Sounds like BF is trying to manipulate you.", "NTA. You are his tenant. You are paying him rent. Therefore upkeep and maintenance (let alone improvements) are his responsibility. Also, yes nothing is guaranteed but if got married an divorced, you would have a claim on the house. So yeah, I would not contribute to the capital value of an asset that was not mine.", "NAH you don't need to be on the deed, all you need is a legal doc stating that you will be paid back plus interest for contributing but that if you marry within x amount of time the affect becomes void.", "If he makes twice as much as she does why are they splitting household bills 60/40. It sounds like she is paying more than her share already, plus they use a car she pays all of the expenses for. NTA", "With all due respect, it sounds like your boyfriend can't afford his mortgage payments on his income alone and that's why he moves in his gf within a year and pressures them to contribute to his mortgage and renovations. If you're 100% sure he makes twice your income than he's being devious - or financially savvy depending on your POV - and getting his gf to contribute so much so he can build his savings. \n\nI've been with my partner for 3 yrs. It's his house, I'm not on the lease. So I contribute to utilities, groceries but he pays for his mortgage and any renovations he wants. You're doing a lot for a relationship that hasn't even hit the 2 yr point yet, and a house that isn't yours. You have no guarantee this man actually wants to marry and start a family with you. Realistically sounds like he's gonna move on to his next tenant - I mean gf- as soon as the bathroom is renovated. NTA", "NTA\n\nWhy are you contributing to his mortgage?", "NTA. This is a red flag. If you are contributing to the mortgage, you should have an agreement on paper, that the house becomes partially yours. Same if you contribute to renovations. What’s happening now is that he will f*ck you over if you separate.\n\nTell him, if you get everything arranged in a legal contract with stipulations for how much of the house is yours per your contributions, then you’ll happily contribute.\n\nMy husband and I had a similar contract before we got married. He had an inheritance when we bought our house, I didn’t. So we had a notarized contract in which we agreed that I was paying off most of the mortgage in the beginning and that after x years one third of the house would be mine, and after x more years it would be 50/50.", "I honestly think you need to consult a lawyer. Your contributions to the mortgage may already entitle you to a (small) share of the property. I would recommend that you two get a new property to live in together. Your partner can rent out this one which is in his name and you can purchase a second one that is in both your names. That way, you won’t be left with nothing should the relationship go pear shaped. Your partner seems to be a bit out for himself if I may say so. NTA. For example, why is he contributing nothing towards gas and upkeep for your car? Has he suggested you paying him an amount in exchange for part ownership of the property?", "YTA- planning to get married in a year, shacked up, splitting bills, utilities, and food bills, as well  as using the same car.. but fuck paying for this bathroom renovation idea I think sounds awesome! Yeah. YTA, OP.", "NTA. You're technically having a rentl agreement. It doesn't matter if he pays his mortgage with that money or maintenance. That's on him, but that's what rent money is for. You don't own him any extras.", "NTA\n\nHe will always be alone in it as he is making improvements to his home.", "NTA  \n\n\nHe *feels like “he will always be alone in this”* because he has chosen to be alone in the ownership of the home!  \n\n\nIt's been two years, you plan to marry. That's long enough.   \n\n\nStep 1) Check the laws where you live. In some places you already are common law and any appreciation to the house is already yours-regardless of your contribution. In other places , you have zero rights to the house. The second scenario is more common, but it's worth checking.   \n\n\nStep 2) Get yourself on the deed. If he wants to protect his initial investment in the house, that can be done. Visit a lawyer and divvy up the house. This will depend on where you live, but you can be joint tenants (always equal) or tenants in common (unequal shares possible). Ideally you want the initial investment carved out and then joint tenancy for the rest.   \n\n\nStep 3) Do not, for the love of all thing holy, have a child until the housing/financial situation is sorted. Women almost  inevitiably take a hit to their career and earning potential and future pensions when they have children. Once children enter the equation, joint finances and joint investments are a must. If your partner plans to be a stay-at-home dad the same would apply.", "NTA and die on this hill.", "NTA", "NTA. At this point, you are a tenant and he is your landlord. When a landlord starts to renovate their property, tenants do not pay an additional fee towards those renovations.  If the rent is renegotiated and goes up at some point, then that’s different.  \n\nIf your boyfriend feels like you are not contributing enough, pull back on the household necessities and the use of your car until he’s reminded of how much you actually do for the household.", "You have no assurances. NTA. If he keeps insisting, reconsider your relationship.", "INFO:  You stated that you are paying 40% of his mortgage payment.   \n\nDoes that include escrow (property taxes and insurance)?   \n\nIf you are also paying into escrow, you are probably paying more than your share.  Depending on where you live, property taxes aren’t cheap, and he gets to take it as a deduction when he files his income tax.", "NTA it's not your investment, it's his. There's no point in you paying for major upgrades when you won't see a return on that investment.", "NTA. If he wants your help, I don’t see why he can’t postpone the home renovations until after you are married. Alternatively, he could sell you a share in the property and use that money to renovate.", "NTA but he should charge you more rent for the upgrades", "NTA. Paying towards the mortgage is reasonable if the amount is no greater than what you would be paying for rent if living on your own. He should be buying gas sufficient to compensate for his usage plus a little extra to compensate for wear and tear of the car.\n\nYou should not be paying large amounts for renovations if your name is not on the deed. The fact that he is arguing with you over this tells you that this relationship might not be permanent. \n\nAre you sure about marrying this guy?", "If he wants you to pay more toward reno, he needs to put you on the deed.\n\nI've had 2 friends who did what you are doing and unfortunately, broke up before marrying. One just walked away, but swore she'd never do that again! \n\nThe other was building a second home w/her boyfriend of 5 years. She kept every receipt for her $$$ contribution, but never got her name on the deed. After their breakup, she took him to court & the judge said the only thing she could do was to put a lien on his house, and if he ever sold it\\~she could get her money then. He's still in the house w/his \"new\" gf.", "NTA, he’s taking advantage of you.", "NTA, not your home, your names not on the deed, you're not married yet. Case closed. Just sit back and look forward to using the new bathroom guilt free xx", "You are wise. Keep on being wise. NTA", "You make sense. He doesn’t. NTA. You don’t pay to renovate the home of another. Real simple.", "NTA. You are basically dating your landlord and he is talking advantage of you. Seems like you are not his first victim either. I would run. You will regret marrying or having kids with this sort of man.", "NTA. Absolutely do not contribute to home improvements until you're on the deed. His expectations are not fair or equitable towards you, and it seems he's done this previously with his ex...which is a bit questionable.", "NTA. Do not sink money into a house you aren't on the title to, no WAY. All the other costs, other than your car (which seems unbalanced if he's not even paying for gas) equate for rent, which is fair. Renters dont have to pay for home maintenance or renovation.", "NTA he wants to take advantage of you like he did his ex.  You’re smart. Don’t do it unless he adds you to the deed.  Reconsider this relationship though. Marry him and you’ll still end up remodeling his home. He’ll divorce you and keep it and leave you with nothing but resentment.", "NTA, me and my fiance split finances equal to our income disparity. We have a similar situation where our home is in my name and I owned it for 4 years prior to her moving in a few years ago. We do split upgrades to the house, however we use money off the side hustle we work together for those types of things. \n\nWith his past I'd say wait for a ring first.", "It's not just your monthly mortgage payments. It's his almost constant use of your car. It's your purchase of the groceries half the time. It's also your covering the utilities. All that adds up to a sizeable chunk of money he wouldn't be able to use for renovations if you weren't the one paying. Your boyfriend is being greedy. NTA", "NTA. You are exactly right about the entire situation. You would be a fool to pay for renovations on a home you have absolutely no claim to in any way and would likely involve legal wrangling to get any of that money back if at all if a break up or other situation should happen.", "NTA, when my SO and I lived in a place that I owned, he paid me half the running costs, utilities and groceries. When I did improvements I paid as they increased the value of my asset. I also got final/only say in colors, styles etc. When we bought a place together we halved those costs because we both own the apartment (but agreeing on anything style wise is impossible)", "NTA. You’re not on the mortgage, consider him a landlord. You wouldn’t pay for renovations on a rental, either. \n\nWhat I’m concerned with is how he did the same to an ex… then moved you in and is asking for the same. Is everything else in your relationship okay? Or is he subsidizing his life with girlfriends? \n\nTell him you need a contract about ownership or rights to overvalue or anything else before you will contribute to his house. Yes, it’ll probably start a fight… but you shouldn’t have to pay for anything right now. \n\nTo put it another way, I moved into my husband’s home when we were dating. He paid for everything related to the house, and when we got married, the house stayed in his name but we signed an agreement that half of any proceeds would be mine if we sold the house for any reason. \n\nThis took lots of painful conversations that started with him accusing me of wanting to steal the house from him or steal the inheritance from his kids. It took lots of time for him to realize that we’re a partnership and that the kids will get everything after both of us are gone. \n\nWell, we sold the house and bought a new one, which is now 50% mine.\n\nHe said that he wouldn’t have made the profit without me contributing expenses along the way because he wouldn’t have been able to stay in the home without me. \n\nMy husband had a lot of issues from his previous relationships, but he realized that he wanted our relationship to succeed. One of the biggest steps was us agreeing that we’re both coming from a place where we aren’t trying to get one over on the other—everything we do and say is given the benefit of the doubt.\n\nI wish you luck!", "Toilet paper, papers towels, etc. are groceries. and how on earth do you spend 500 a month on gas?  Do you commute for New York to Virginia for work?", "Funny how everything works out for him while you pay the bill.", "NTA. He used the last partner, now he’s trying it with you. Sounds like he wants his relationships to supplement his home renovations. Ask him if he would sign some type of legal contract that states he pays you back in the event of a break up. I bet he would flip out at that suggestion.", "Agree. If they plan to get married within a year anyway, why can't the renovations wait until they are married?", "To give her ownership (even partial), she would probably need to be on the deed.", "I would only contribute to the renovations if there was a signed notarized note detailing the monies given with the stipulation that the funds would be returned in the event the relationship doesn't work out.\n\nHe could just be a man trying to build a home and life for you both, but he makes twice your income, expects 40% of mortgage for rent and uses your car 95% of the time. Thats an uneven split of costs. This smells like the guy is dangling the carrot of marriage and family to primp his home that you have no ownership claim to.\n\nNTA  You are right to think twice", "40% of the mortgage plus utilities and expenses seems like a lot for 0% equity.", "If she were paying rent she’d be paying the equivalent of what it would cost to rent out a room + utilities (and honestly if we were being fair it’d be the cost of half of the cost of a room, not even a full room) in a house in the area, not rent based off a whole house. The current setup of paying 40% of his mortgage plus utilities, plus the wear and tear and gas of her car usage is wayyy more money than if she just rented a room like a tenant. Her boyfriend wants her to pay as if she was part owner of the house without the benefit of being part owner of the house. She has no contract and so no protection with her current setup and is probably paying more money to live with her boyfriend then if she didn’t.", "It's a room she shares with her partner, so should be less than the cost of a room", "Then she'd go on the deed as a tenant in common with a set percentage ownership. It means he's not giving half the house away pre-marriage but she's not giving her money away pre-marriage, outside reasonable housing costs.", "I also think that if you do end up married your prenup should include your name being added to the deed after so many years, especially if there are children.", "Yes, this is more reasonable.", "There’s no right or wrong way regarding to charge or not to charge rent, every situation is different, it’s just based on whatever it’s right for you and your situation and finding a partner that agrees with that setup. My partner insisted I live with him for free and his  take on it was that he’s going to have to pay his mortgage regardless of whether I live with him or not  because he chose to purchase a home and since he purchased the home based on his income and what he can afford, it doesn’t make sense to factor my income into it so asking me to pay into his mortgage in his opinion didn’t make sense. He also felt it created a weird landlord/tenant dynamic that he wasn’t comfortable adding into a romantic relationship. \n\nI try to pay for whatever I can when possible because I feel very fortunate, but Once again, no right or wrong way of doing it so long as the two people agree on how it will work", "Lol not if he has a hcol mortgage. I spend about 40x the amount i spend on gas on my mortgage.", "When you pay a landlord you pay off his mortgage as well. This is literally what rent is: Mortgage + probable maintenance + profit. \n\nIt's completely logical he does not sign over 50% of his house after she's been paying 40% for 2 years. That would be ridiculous for himself. However, I also find it ridiculous that he asks for money for renovations if she's not on the deed. All he can get is \"rent\", that's it.\n\nShe should get a written agreement on her renting though, that's for sure. But in most countries she would have renter rights by now.", "It's a house she shares - not a room.  Should be what she would pay for an apartement which depending on where you live is sometime more than a mortgage payment.", "Don't forget it's also becoming more popular because man know they'll lose 50% of everything once married and getting a divorce. Man are protecting themselves from this at a higher rate than ever. Not wanting to lose half of what they build because they thought they found the woman of their dreams.\n\nWe've become increasingly less trusting in relationships (which is logical from both sides as we're splitting up marriages like they've become meaningless). \n\nIt's a whole mix of old school and modern thinking clashing untill we've found our new way.", "40% of the mortgage is only “fair” if we know what the mortgage is and what 40% of the mortgage is compared to the cost of renting out a room in a house in the area. If 40% of the mortgage is the equivalent of renting out a room in a house in the area then 100% it could be considered fair.", "These people know nothing about cars lol", "Yes, most states default to 50/50. Because they do not assume that men should retain 100% of jointly acquired marital income, they assume both should get 1/2. The idea that men lose 1/2 “their money” in a divorce assumes that women are not able to earn or otherwise accumulate money.", "She lives in half the house, not a room.", "She's not \"renting a room\", she has full acces to the house and all utilities within. As long as the BF didn't cheat her on the price it will always be cheaper to pay 40% of mortgage instead of 50% of rent for the same house. \n\nIf this was a normal landlord thing than she would have had to pay 50% of the total price. 2 \"roommates\", so equal split (semantics like who has acces to what left out, equal acces to all like here).", "Eh. I'm more apt to say you don't. \nUnited States has the  mileage reimbursement set at 65.5 cents per mile due to the wear and tear on a car. \n\nTo get to 600 per month of wear and tear it's 916 miles per month. Which yeah if they are fully only using her car that is probable.  \n\nIf she wants to be accurate I'd start charging him the mileage reimbursement.", "Yeah I mean if they think OP shouldn't pay anything towards living there she could always love in her car considering it's supposedly a substitute for rent.", "Or several people here that do own a car dont pay a mortgage.", "I know, and it is logical. Not sure why you said this?\n\nI'm just saying that man are doing this because they're seeing examples of self made rich man (or man with bad partners) having to give away 50% to their ex who didn't really do anything but exist in his life for a couple years. Most often not even in the most positive way.\n\nThey see these examples all over social media and applying that to their life. Even though their lifes are vastly different than those people in the stories they read about.", "You do know that renting a room doesn’t mean you don’t have access to communal areas, right? Having access to communal areas doesn’t mean you are renting half a house. If she was using another room as her own office or something similar then yes I’d agree with you she was renting half a house, but nothing in her post suggests that. This whole setup honestly sounds like the boyfriend is picking and choosing when he wants to act like she is a tenant and when she is part owner based on what is most convenient for him.", "And average annual miles on a vehicle in the United States is [13,476, according to the Federal Highway Administration.](https://www.fhwa.dot.gov/ohim/onh00/bar8.htm) That works out to 1,123 miles per month. Given that they're both in their 30s, average usage is somewhere between 15,098 and 15, 291. If we average that to 15,195, the average amount they can expect to drive in a month is just over 1,266 miles. Which is $829.36 in wear and tear per month.", "I guess these numbers are fine if op got ripped off and overpaid greatly for their car lol", "Except she's sharing the whole living space, not a room", "The average cost for a 2bedroom apartment is 1753.40. Divided by 2 is $876.70, so either way, she’s lucking out", "NTA\nIt’s not just the fact you might split \n\nBut from legal point of view in case anything happens to him you aren’t covered neither \n\nIt’s not just you would have to move out but would have to move out with less savings (which would not low you to purchase your own property as quick as you could)", "*“he will always be alone in this” -* well, that's what happens when you're a sole home owner.\n\nYou're not there to just \"help\" him financially. Or at least I would hope not.", "NTA If you are a woman, chances are you eat less than he does along with the necessities, gas, and wear on your car. Present him a list of expenses. Tell him that if he feels free to take freebies off of you, you certainly have no cause to give him free house equity you don't share.", "NTA\n\nIt is good financial sense to not dump money into a property you have no legal right to. You're not on the deed, you're not married, save that money. You never know what might happen.\n\nHe's not \"alone in this,\" your financial contributions are very helpful in the things that are most important, the daily necessities and some of the mortgage. Upgrades to the house are optional and not your responsibility.", "NTA even a red flag paying the mortgage on a house you don’t own - yeah it’s like rent but if you guys split your right that if you split you’d get likely nothing. Either get married or put title in both of your names otherwise it’s his house and that means his liability to pay for.", "NTA and you need to protect yourself as well.\n\nHe makes nearly twice as much as you. But you contribute 40% of the mortgage and utilities, split groceries (50-50) and the two of you use your car 95% of the time. This math isn't adding up.", "Nta.  Legally,  it's not your home.  Check the community property rules for your state to see what your standing will be after you're married.  It may remain his sole property unless he adds your name to the deed/title.", "When you get married & your name is also on the deed, you can talk about the renovations. At this point, you’re really just a roommate with benefits that’s helping him pay his mortgage. What if you help pay for the renovations & things go south with your relationship. He’s treating you more like a bank than a girlfriend.", "nta- so he had an ex who helped pay for stuff, did he give her the money when they broke up?  Prolly not, def nta", "nta \n\nit’s valid of you to not want to put money towards permanent upgrades in a home you have no claim to. \n\nif he wants you to put money towards the house then he should have ZERO PROBLEMS marrying you & getting your name on the deed first. since, you know,,, *you are planning to get married anyway???*", "NTA.  You are correct.  Why would you want to put money into a home you don't own?  If you do break up you'll not only lose the home, you'll lose all of the money you put in.  Until your name is on the deed, I wouldn't put 1 cent into the improvements.", "NTA but you should resent his resentment and expectations considering he literally has used an ex gf in a similar manner. You have a valid concern. Maybe live separately until marriage if he has such contempt.", "NTA... you are contributing to the mortgage, as you would if you were sharing a rental. You are sharing costs for food and transportation, paying a bit more of the share there.\n\nI would suggest that you find a way to protect any money you put into the home. Maybe there is another way, like it is a legally drawn up loan that gets repaid upon the sale of the home or the breakup of your relationship.  Discuss with accountant and lawyer.", "NTA, obviously. It’s his house, why would you contribute thousands of dollars for something neither of you need and that you didn’t ask for and that you don’t get to keep?\n\nIt sounds like he’s wasting money on unnecessary things and his light wallet is making him look for a villain when he’s the only one to blame. You saying something sounds like a good idea is absolutely NOT a commitment to pay thousands of dollars and you should make it clear moving forward that you are fine with how things are and that if he isn’t comfortable spending $10k on dumb shit then he should especially not do it just because you said it sounds nice.\n\nYou need to have a clear conversation with him about what’s going on here and lay out some boundaries. Do not let yourself be suckered into paying for any home improvements, and don’t try to get on the deed. You’ve barely started your life together, he doesn’t owe you the house he’s paid a fortune on and paying for renovations that aren’t absolutely necessary isn’t a reasonable ask either.", "NTA at all. \n\nI have a similar situation, my partner owns the home and I live here but we handle it slightly differently. \n\nOur agreement is she pays 100% of the mortgage —she paid it before me so it’s not a financial strain (what would your partner do if you weren’t there??) \n\nI contribute to repairs (it’s a 100 year old home) interior design, and furnishings and one of our utilities. I do all labor myself because i enjoy it and volunteered for this arrangement. It works because our incomes are not conducive to “equal” payment arrangements—she gets paid weekly and I’m a freelancer who gets bulk payments erratically. \n\nBut our opinion is that because cause I’m contributing permanent improvement to the home she owns, it’s more overall value than just paying her rent. If she (with no external changes to her employment) turned around and asked me to both pay into to her and pay for home improvements I would tell her to fuck off with any home improvement until my name was on the lease!", "NTA.  Half of what is the going rate for rental of a home like that would be fair. Half of groceries/utilities is fair.  Renovations/improvements are things which will increase the value of the home for HIM ONLY.  He's investing in the home he owns.  As you point out, if the relationship ends, you'll have nothing.  You have no stake in his home", "ESH slightly. \n\nWhy are you comparing yourself to his ex? Maybe she cheated on him, maybe she did something bad, maybe he paid back her share of the renovations. You don't tell the full story and maybe you don't know it either. Check out before you outright accuse him of something. What you are communicating is that you have doubts about his intentions with you and how long this relationship will last past the renovation. Is this the kind of person he is? And if you truly think of him this way, maybe you should run now before you marry/have kids. \n\nHe did nothing to reassure you but honestly, my partner would probably something similar and he is right. You could divorce down the line, even if he marries you now (and depending on local law you might get nothing from property obtained prior to marriage).\n\nYou both should be somewhat protecting your finances/properties but not to a point where you are questioning an entire relationship because of it. If you are so concerned, separate the different parts of the renovation and have it in writing you were paying for xyz and he was for abc. Or don't have the renovation as a couple / end it here because you already have doubts and you put these doubts in his mind too. No relationship lasts without trust and communication. Discuss your issues openly and see where this leads.", "Nta. Your boyfriend is your landlord. If he cared about you he’d care that you are in a vulnerable position financially where you assume all the risk and he assumes all the power and benefits. If he puts your name on the deed now, then fine, you get equal decision making power and equity. If he’s waiting until you are married, then you should wait to invest, too. \n\nKnow the laws where you live about marital property. If you are in the US likely even if you aren’t in the deed after marriage, 1/2 of the house would still be yours. Don’t ever stop working on your career to raise kids, with a controlling man like this.", ">I told him it would give me comfort in knowing I contribute large amounts to something I also own and also shared my insecurity about ending up like his ex which he thinks is ridiculous because nothings guaranteed anyway (we could marry and divorce).\n\nNTA. I'd pay attention to his reaction. Splitting up and divorce are two separate scenarios. I don't see why you, with a dependable track record, asking to be put on the deed *while you are also contributing financially* and *planning on having his children* is \"ridiculous.\" And yes, nothing is guaranteed, but you still go into creating a family together with a sense of hope and goodwill. Perhaps going with him to a lawyer under the umbrella plan of creating a will (because you are planning to be parents after all) would be an eye opener for your partner and allow a third-party to explain the situation to him. Property becomes a whole 'nother subject when there is marriage (a legal contract) and/or children involved.\n\nFWIW: When my husband I got married he already owned his condo and therefore only his name was on the mortgage. He has a child and we found out that under the laws of our state, if he died the house would go to his child. But at the time his child was underage, so the house would go to his ex-wife. I asked him what the probably was of his ex-wife working with me to keep the house and he said none. He promptly put my name on the deed and when I told him this was huge because I'm not on the mortgage (it would have been costly for us at the time), he told me that knowing I would be cared for was important and his financial obligations to his son were and would continue to be met concurrently. I'll never forget my husband did that for me but I do think it made a difference that we had been together for awhile and I had contributed to the mortgage (\"rent\") and had shown I was dependable. Like you have done.\n\nedit: clarity", "Why don’t you compromise? He pays for the improvements now since he wants them now even though they aren’t needed immediately. You put aside a fair amount into a savings account that you will turn over to reimburse him only after you’re married.", "NTA. You pay too much even now. 40% of mortgage for house that is not yours? Other payments also mostly from your pocket? While he has twice your income? That's crazy! It think he is using you and pretends having financial trust issues. This payment division is completely unfair to you.", "NTA.  He is the one benefiting from the added value to the home.  I wouldn't be helping with the mortgage, either, until we were married AND I had a written agreement granting me ownership of the equity I was paying for.", "You paying 40% of his mortage is already way too much. I would not be ok with even that.", "NTA. Ya'll need to have a sit down about finances. If we look at the whole pot of money, your BF makes twice what you do, so logically, he should pay 2/3 of the expenses if making things equitable was the goal. \n\nYou have expressed interest in future plans and he wants them to happen now, but he doesn't want to put a ring on it first. You don't have to have kids the minute you get married. He could assign part of the title to you at any time (usually), but he hasn't. So he's done nothing to assuage your fears that you're improving and adding value to a high value asset only he will gain from should anything happen to your relationship. \n\nIf he wants to renovate his home, you're not stopping him, but you're not encouraging or contributing to it (although, I bet you are letting in trades people, arranging food/water around electricity and water outages etc). \n\n\"I'm not comfortable paying for renovations prior to a formal commitment from you and your dismissal of my concerns is not encouraging. I'm saying these things would be nice in the future and you doing them now is fine, but it's not expected or encouraged and I feel like you resent the fact I am uncomfortable paying into unnecessary improvements to this house when we're not married.\"", "NTA - it all comes down to the fact that it isn't your house, and it will continue to fall that way until he makes you an equal partner in writing. Fuck giving him 10k and just being out all that money if you break up.", ">I also don’t want to be like his ex who contributed to similar expenses and obviously that didn’t work out\n\nSo you're saying there's a pattern of this?", "adding windows to bathrooms for \"natural light\" is some of the dumbest shit i've heard of people doing recently. Windows are a disaster in a bathroom and you will get mold inside your walls.", "Here's the thing - as he bought the property prior to the marriage, it could conceivably remain his after the marriage - unless you use marital funds on it, at which point it's a shared asset.\n\nSo, until you are married, don't toss money into his $$$ renovations. Or, he can draw up some legal document that says that if you split up prior to the marriage, you get your renovation funds returned. Make a prenup - outline expectations and responsibilities. Meet with a financial planner or someone who can outline some fair way of approaching marriage and money.\n\nHonestly, it sounds like what's his is his and what's yours is his. Many divorces are over money, so you should figure it out prior to saying \"I do\" as it's way cheaper - both financially and emotionally if you can get on the same page, or jump to a new book, before there's a wedding and children.", "NTA. No More letting him decide whose car you two take, either. Take turns or don't go at all.", "NTA. No ring, no ownership of the house, no money towards improvements. Yes, they benefit you, but it's his house. I live with my BF as well and all the projects he's done he's paid for. I told him I'll pay when I'm married but I'm not investing in a house should things not work out (and that's not meant to be a negative outlook on the relationship - we both believe we'll last - but till then it's his house, his improvements, his money problem lol)", "NTA. Not something I would do if the person wasn't my spouse.", "NTA. \n\nYou are discussing marriage and children, but are not engaged and have not furthered the plan. You need to have a very frank and honest conversation; at what point do you have any entitlement to the home, what does your contribution look like in comparison to your value if your relationship ends and how does this look when you are marriage with kid(s)\n\nWhile nothing is guaranteed, your renovations are an investment in your home and should you end the relationship you should not have to walk away without a portion of that investment. If he does not want you to have any access to the property value, then you do not contribute...but, how does that look as your relationship progresses to marriage and children. \n\nThere is a larger issue here, he wants to the control and ownership - but also wants your money. Before children are involved, this is a MUST to be discussed.", "NTA. It's his house. You aren't on the deed. If you were renting you wouldn't pay the landlord for renovations. He can use the 40 percent you are helping out with to pay for that himself.", "AITA at it again with double standards. Take a look at how many comments would be calling this OP a deadbeat and freeloader if genders were reversed. [https://www.reddit.com/r/AmItheAsshole/comments/zrzesx/aita\\_my\\_boyfriend\\_doesnt\\_want\\_to\\_pay\\_his\\_portion/](https://www.reddit.com/r/AmItheAsshole/comments/zrzesx/aita_my_boyfriend_doesnt_want_to_pay_his_portion/)\n\nLook how many people argue for paying rent when the owner of the place is a woman and look at how many argue for not paying any rent when the owner of the place is a man.", "Nta he should put a ring on it then", "**“he will always be alone in this”.**\n\nNot always, just until your name is on the deed to the house (which IMHO should absolutely not happen until you're actually married OR you pay him for half of his current equity in the house).  (ALSO if he makes TWICE what you do your total contribution (including the gas for the car and household items) should be split in a 2:1 ratio NOT 60/40 PLUS the extra $500 a month for gas and household supplies.", "NTA\n\nYour landlord is fully responsible for renovating and maintenance.", "NTA if I had to pick something, but I also don't think this is as simple as \"my name is not on the home deed, I don't pay for any renovations\" considering you will be able to benefit from those renovations directly by living there with a man you want to marry and have kids with.\n\nIf you don't trust him, why would you want to marry him and have kids in 2023 when it's probably never been easier and more acceptable for a woman to never get married or have children? If you do trust him, you can work out a legal agreement as a stipulation of part of the prenuptial agreement where, in the event of divorce - he pay you back for the money spent or something. I'm not a lawyer, I'm just saying. There's nothing wrong with having trust but also not allowing yourself to be taken advantage of.\n\nIf you want to say it isn't about trust, I'm not sure I understand why you're living with someone you have a verbal agreement with and state you have intentions with at building a life when you have a dollar amount of contribution you will not contribute to a life you intend to share. What happens in the future with this mindset? You contribute less than the man, is that because you're paid less? I imagine that would be a real turn off if a man did this to you if the roles were reversed? Would you be in the reverse? Like, would you let your man live with you, contributing 40% or so of some of the bills? What if he haggles about what he's responsible for? Your home, you take out your trash? As if marriage without a prenup protects him from you from claiming half his home anyway?\n\nMan, relationships get real complicated the longer they go on.", "NTA. If you’re paying 40% of the mortgage, all the expenses (plus use of your car = wear and tear, maintenance, miles, gas) and he makes *twice* as much as you!? You’re being taken for a ride girl. You make half as much and contribute an equal share for zero equity. That’s pretty shite.", "NTA don’t pay for the renovations and also check what your rights are regarding paying into the mortgage. \n\nIn the UK at least if you live with your partners and pay into their mortgage you gain equity in their home even if you aren’t on the deed. In the event of a separation you could sue for your share of the equity. They would have to get you to sign some kind of rental agreement to make that not the case effectively making them your landlord, which seems a very gross dynamic for equal partners.\n\nBut yeah as others have said, huge red flag that he has already got an ex to pay to do up his home, did he pay them back when they separated? \n\nAlso he can complain all he likes about “being alone in this”, he is the one choosing to keep sole ownership and not put you on the lease, so yeah, he is alone by choice.", "Sounds like he's taking the piss unless the marriage will give you entitlement based on mortgage contributions and investment in renovation. Not an expert on the matter so don't no if it is a thing.\n\nNTA to say no. You should use this conversation as a springboard discuss your proprietary rights. My general feeling is that, unless the divorce laws will protect you, you're shooting yourself in the foot by continuing to pay rent whilst having no stake in the property. He is able to make an investment, you are not.", "NTA. It’s not like you’re going to get any of the profit when he sells the house, so why the hell would you pay for them?? He’s basically your landlord - all upkeep on the home itself is legally in his care. Keep it that way.", "NTA.  Without some agreement covering the home you are investing in someone else's property at this point.  And paying 40% of the mortgage certainly \"helps a lot!\"  If he wants you to improve his home he needs to give you an ownership interest in it.  BTW, if you have joint accounts and have comingled funds you may have already established some ownership interest in assets in some states.", "Not to mention that if they get married, she will likely go on the deed and be entitled to some (if not half) of the house’s value if/when they sell. Even if they get divorced it will be a marital asset she has some claim on. But as just the girlfriend? No claim!", "And his comments about divorce don't help his position: if they were married she would have more rights than a live in girlfriend, especially if they had kids.\n\nNTA OP, do not contribute to renovations /capital improvements unless he puts a ring on it and your name is on title.", ">but why are you paying any amount of money to a mortgage you’re not on?\n\nThat's called rent, buddy. You pay it when you don't own the place you live.\n\nOP is NTA. Paying the mortgage is juat you paying part of the rent. Buying necessities is a nice gesture, but maybe reconsider how often you do it.\n\nHowever, you should not pay for any modifications unless you're on the deed or get a contract signed that if you can no longer live in his house for whatever reason he has to recompense you for the modification costs.", "They need to work out a deal where she gets equity in the house proportionate to what she's contributing towards it. Personally I think in a relationship one person paying rent to the other is ridiculous. The partner who owns the house should either let the other live there rent-free (contributing to utilities, food and other running costs, of course, but not mortgage) or they should have an agreement where the other person contributes to the mortgage (and renovations etc.) and gets put on the deed. A romantic relationship isn't the same as a tenant-landlord situation.", "Charging rent for a mortgage is such a backwards american thing. Either you are on the deed or you don't pay a thing. The boyfriend is enriching himself at the expense of his girlfriend.", "that is a stupid take. if she was renting elsewhere her landlords will use what she pays in rent to pay off the mortgage. why do you feel she is obligated to live rent free?", "THANK YOU. As a European, I don't understand this either. If I owned my house 100% AND I made twice my partner's income, I would not charge him rent, and he would not contribute to the mortgage. If I'm the only one benefitting from having my name on the deed, I pay. He would just cover half of utilities.", "oh yes because they should be living rent free just because they are sleeping with the \"landlord\"", "As opposed to renting a house from someone and paying 100% of their mortgage?", ">The current setup of paying 40% of his mortgage plus utilities, plus the wear and tear and gas of her car usage is wayyy more money than if she just rented a room like a tenant.\n\nDoubtful. 40% of my mortgage when I bought my house would have been like $400/month. Bedroom rentals in my neighborhood were about $500/month minimum at the time in much more run down houses.", "A tenant should never have to pay for renovations, so I wouldn’t even offer up that math, as he could use it against her with future larger renovations.", "She's not getting a whole house, she's paying to share one.", "If you're renting as a house share you're still paying per room.", "[removed]", "Tenants essentially pay for all renovations, it's just collected in the form of rent which should be higher than any owning costs.", "So she’s not paying full price, she’s paying less than half. Seems reasonable? Especially considering we don’t know - maybe bf had a roommate before to offset costs", "People who rent a room in a house ALSO have full access to the rest of the house, lol.", "Part of the mortgage goes toward building equity, so 50% wouldn’t be fair, as she is not getting any of the equity.\n\nIt also does really depend on the mortgage payment vs market rent. The mortgage could be a 15-year at 7%, or it could be a 30-year at 3%. The payments would be dramatically different, but the “rent” should be the same and dictated by the market rate for rent.", "Rent should be market rent for a comparable property (i.e., sharing a house with another tenant).\n\nIf the landlord wants to make improvements, that’s their decision, and it comes out of the landlord’s pocket. They can then decide to raise the rent if the improved property warrants it.\n\nThat’s how it works.\n\nTry as a landlord to have your tenant pay directly for improvements (even partially), and you will just get laughed at.", "65.5 cents per mile includes gas, taxes, and insurance. Wear and tear is only a fraction of that value.", "Yeah on hindsight that wasn't really clear lol. In her case she doesn't rent a room and has access to the rest of the house, she's renting a full house with a 2nd person living there. Would be like a BF/GF moving into a rented house, not really like roommates renting rooms in houses.", "Of course she's not getting equity, just like she wouldn't by paying rent to a landlord. The only difference is her landlord is het BF and it might one day really be hers for 50%. Most renters never really move to that step. Even if they rent a place for their whole life. She's just a renter at the time, they aren't even married so of course she's not getting any equity out of his ownership. That's just normal.\n\nWe'd have to know first to make a judgement. But lets stick to averages and on average mortgage is lower than renting the same housing.", "> If the landlord wants to make improvements, that’s their decision, **and it comes out of the landlord’s pocket**. They can then decide to raise the rent if the improved property warrants it.\n\nThe same pocket that has been filled with, you got it, rent!", "No, it’s exactly the same as roommates renting rooms in houses, lol.  If I rent a room in a house, I still have full access to the rest of the house.", "Their situation is not like roommates renting a room, please, this is not even a discussion. It's a simple fact. Maybe my explanation is wrong, but you can't seriously mean to compare a couple living together in a house to roommates renting rooms. You just can't.", ">and that he feels like “he will always be alone in this”. \n\nHe's alone in the ownership and in the equity that will increase over time \n\nAlso he should be careful since you're paying the mortgage - it might give you a claim for part ownership of the house even if you're not on the deed", "NTA.\n\nIf he makes twice as much as you, then he should be paying that percentage in all costs, so twice the amount in mortgage, groceries, utilities, etc.  \n\nYou're not asking for anything crazy, here.  I'd be very hesitant to continue in a relationship with him if he doesn't change his attitude and expectations.  \n\nAnd yea, if you do end up getting married/divorced then you're entitled to half of the house.  If you just break up, you get nothing.  So the fact that he's not sensitive to that is a huge red flag.  \n\nPlease please please seriously consider this relationship.", ">my car 95% of the time because he’s pointed out that my car is more gas efficient (I always pay for gas too)  \n>  \n>I estimate these extra monthly costs to be around $400-500 and never complain.\n\nYou pay an additional 400-500 because he is also using your car all the time?\n\nDo you realize your car will be worth less because of all of the miles you are putting into it? And also, it will need a mechanic/break earlier than it would have if he also used his car?\n\nIs what you are paying in rent what you had been paying in rent before you moved in? \n\n> he’s made comments that my monthly mortgage contribution doesn’t help a lot \n\nYou are paying a lot!!!!! How is it paying 40% not helping.\n\nYou shouldn't be paying home improvements because that's an investment on his house. Renters don't pay landlord to make home improvements. They don't even pay wear and tear for the house.\n\nI think you need to realize you are a wallet here. You should be saving to buy your own property instead of investing on his property and paying 50% of the mortgage (because you pay 40% but you are also using your car, paying gas, etc.)\n\nNTA", "I've been the ex in that type of situation. Dumped my entire savings into the house, and he came home one day and said, \"Yeah, I dont think this is gonna work out\". Don't pay to renovate a house your name isn't on.", "Why would you pay for renovations on a property that you would never gain a return on? NTA.", "Nta, my gf lives with me in my house and we split 50/50  for bills/ groceries. Any home improvemments i do i pay for myself cause her name isnt on the lien/mortgage.", "Stand your ground, it's a reasonable boundary. So far you are paying \"rent\" and keeping up with your share of the living expenses. Renovations, which add value to the property, are the owner's responsibility. If you're not on the deed and you are not married, you dont pay extra.\n\n(Also, before marriage, make sure to make a prenup agreement that is fair to both because it is clear he is not worried about it)", "NTA.  He could kick your butt to the curb once you have paid for half of the renovations to his house.", "NTA. It isn't your house and you won't pay for his house's renovations. He could make it both of your house, but he doesn't feel the need to do that. So no, do not help him raise the value of an asset you have no equity in. If he thinks there are no guarantees, and your monthly %40 towards his mortgage isn't enough for him, how exactly does this ever get better for you? He wants a guaranteed rise of his property's value, but you get no guarantees on anything? Yeah, no.", "So you pay 40% of the mortgage but get 0% of the equity? And he is complaining?", "NTA, don't give him more than you need to. Until you're married or common law, you are taking on additional risk to make him happy. Every dollar he saves comes out of your pocket.", "We have the same situation other way around. I make more money & I own the house, I have done renovations and improvements before and after my husband moved in. I am paying for everything that adds to the value of the house because it is only in my name. I would feel disgusted of myself if I asked my hubby pay for anything more than a bucket of paint or some small parts that are usual to need fixing quite often. \n\nWe have shared some costs that are more of our mutual indulgement things like renovated sauna cottage near by the river & some other smaller things, but it's a whole another thing than the actual house.\n\nI pay the mortgage in full & renovations, all the running expences of the house we share. Also my hubby owns our leisure home & sort of business place and he pays for them. Fair play.\n\nYour bf should definitely be open to put half or part of the house into your name especially if you are really talking about having kids. Please if you still decide to contribute financially, have your ass backed up, make it official and have it on paper.\n\nEdit: NTA", "NTA my now husband bought a house a year into our relationship. He was kind enough to not even ask me to contribute rent/utilities (he was making substantially more than me and bought the home within his budget knowing if he and I didn’t work out, he could afford it on his own).\n\nI contributed by buying groceries, cooking, cleaning, buying all kinds of incidentals, and since a lot of the work we did on the home was DIY and I’m pretty handy, I put in a lot of hours working on the home. I did also pay for a lot of hardware store purchases but not as much as he did. \n\nIt sounds like you’re already contributing a lot to his home without a stake in it. If you’re on track to get married and have kids, that’s great! But he shouldn’t make you feel crummy and resent you for not contributing what he feels is “enough” to what is not yet legally your home. When my husband had some major work done on the house using contractors (bathroom renovation/foundation repair, etc) he paid for all of it because it was HIS house.", "🚩🚩🚩\nNTA\nHe's asking you to invest in something you hav no equity in, and then saying the nearly half of the mortgage you're paying isn't helping. \n\nIf he wants to put you on the deed, fine. If he wants to move into a place you both own and use his home as a rental, fine. But until you have equity in the home and are on equal footing, stand your ground. \n\nThe fact that he is willfully ignoring the inequity of your relationship and continues to ask for more financial help from you while minimizing your contribution is a big red flag.", "You two are not on equal footing sadly. He may be your boyfriend but he is also your landlord and not only are you paying rent but your contributing to his mortgage. A mortgage that will get lower and lower and you'll get nothing of that house.", "Of course your mortgage contribution helps.  Not only is it rent, but you're helping him increase the equity of a home that you don't own.  Tell him that AFTER you two marry in a year as planned AND you become co-owner in writing, THEN you will help with renovations.", "NTA. At all. Sounds to me like your BF has been getting a pretty sweet deal for the duration of your staying with him. Your income only makes up 35% of your combined income, yet you pay 40% of the mortgage, most of your groceries and utilities and most of your transport costs.\n\nYou definitely should *not* put equity into a house you have no ownership. And when you say that you pay 40% of the mortgage, I hope you mean that you pay 40% of the mortgage interest and not 40% of repayment+interest. If it’s the latter you’re basically paying him for the privilege of paying for his grocery and transport costs.\n\n*If* you had had a fair deal to begin with, I would argue that a fair arrangement would be that the amount you pay him should increase by your share of the extra interest if he’d paid the renovations with a loan. That is, if he invests $10k and the interest rate is 5%, the interest payments increase by $500/year. You should pay about $175 of that, or approximately $15 extra per month.\n\nMy advice would be to either pool both your incomes and your expenses and have a joint economy while living together, or determine your joint expenses and decide a fair division of *all* costs. Deciding that one pays for housing, one for transport, one for groceries etc will always bite one party in the ass due to unforeseen consequences. And investments in *his* house is not a joint expense. Financially, it’s like you putting money into his 401k.", "NTA. Explain to him that he owns the property, you pay to live there. He's your landlord, you're a tennant. Tennant's don't pay for renovations, that's on the landlord.", "NTA. Do not pay to renovate something you do not own. His assertion that you could get divorced is an entirely different point. Yes, that could happen but then you'd have community property and you'd be entitled to half the proceeds. If he can't see that and he's already griping, consider carefully how you want to move forward.", "NTA\n\nSounds like your boyfriend wants the benefits of you pitching in knowing you all will not work out. He is the only one who will benefit in the long run on this. Do not contribute until you're on the deed and mortgage.", "NTA.  Do not spend one thin dime on a property you do not own.  Just don’t do it.  Sounds like the bf wants to renovate but can’t afford to do so.\n\nHe’s not a husband, he is a casual relationship with no legal obligations to you.  Tell him no and if he pitches a fit, move on to an adult who doesn’t pitch fits.", "Is he going to pay rent for your womb when you have babies? How about going halfsies on a mommy makeover(renovation).", "Nta, he sounds awful dude", "Nta", "When you rent an apartment/house, you don’t pay for any renovations or plumbing or electrical work, etc. That’s on the landlord bc he/she owns it and will reap any benefits on their tax return, resale, credit for getting loans, etc. If you break up, you have nothing. He has everything. Don’t pay for fixing up a house in which he will solely benefit. Doesn’t make sense. Truth be told, I’d move out (not necessarily break up) and let him pay for his own life and you pay for yours. And possibly save money to buy your own place to fix up.", "You shouldn’t have moved in without a rental contract. Right now you’re basically a tenant. You guys needs legal advice to figure out how to do this with everyone protected because right now you’re right, you’re in a precarious position.", "NTA.  Nope.  It's one thing to pay \"rent\" but it's an entirely different thing to help pay on home improvements to a property you don't own.  You could throw $20K into the property and then 6 months later be broken up and he's sitting on an improved house and you're out the cash.  Nothing against your relationship or trust in one another - it's simple common sense.", "NTA. Your boyfriend seems like a user. And honestly it sounds like he’s already using you by using your car nearly all the time and not paying for gas and having you buy non-grocery household necessities. Those really add up. \n\nAlso, be honest about that 40% mortgage payment- is it more than you’d be paying if you were living on your own? What about everything combined? \n\nAlso, since he makes 2x what you make, a truly fair split would be proportional, with you paying 33% of total costs. \n\nIt sounds like your boyfriend has a habit of using his partners to fund his lifestyle while promising them marriage but not offering them anything for their investment if things fall through. \n\nTake note that in a divorce, you’d be entitled to some of the house’s value. In a breakup you’re left high and dry. Be careful.", "NTA but don't date your landlord and don't have a landlord who hasn't actually signed a legally binding rental agreement with you. This is how he screwed over his last ex and you're likely just fresh meat.", "NTA. In fact, I do not think you should be paying 40% of the mortgage because you have no equity. Yes, you should pay an equitable amount of living expenses but the mortgage in the water bill are things he would have whether you are there or not.\n\nIt may come out to a similar amount but in your situation I think you should take on one of the voluntary utilities (not something like the water bill or the heat that he would pay anyways but let's say the cable in the internet and then whoever picks up groceries pays for them).  It should not cost him to have you live with him for sure but on the other hand, the house is his.\n\nPeople can argue that you would be paying rent if you didn't live with him but there are ways to pull your weight without giving up the mortgage per se (cable and internet Plus trading off buying groceries, and such seems fair. \n\nBy the way, put it in writing if you are paying 40% of the mortgage because if you live with him for a substantial amount of time and he ditches you, and some states, you have some rights\n\nAs a girlfriend I don't think you should even ask to be on the deed. This was his home before he met you. I wouldn't want to be tied down to the home with a guy who you may or may not decide to marry", "NTA.\n\n> don’t want to be like his ex who contributed to similar expenses and obviously that didn’t work out. \n\nSo he has done this to at least one other person.\n\n>Lately it seems my boyfriend has been building resentment towards me for not contributing more because he’s made comments that my monthly mortgage contribution doesn’t help\n\nAm seeing serios red flags with this situation. He shouldn't be building resentment for \"upgrades\" which aren't really needed. NO name on deed, NO extra $$$ out of my pocket. I would also be paying extra close attention to his behavior, escalation could mean his is used to financially abusing his SOs.", "stand your ground love. you have no equity, so don't invest. would you pay to renovate a home you rented?", "Info:  Have you ever tried talking to his ex?  It might be eye opening.\n\nNTA", "NTA\n\nSeriously reconsider having kids with this man. Especially if you give up your career to be a SAHM. You'll be in very vulnerable place financially with a person who has proven to be controlling about money.  \n\n\nIMO you're absolutely right to not want to put $ into a house that is not yours. Him expecting you to do that is unreasonable. I bet if it were the other way around he'd refuse to put $ into your house.", "This.  If he wants OP's money to go toward the renovations, then start using her rent money for it.  I assume he could afford the mortgage fine before she moved in, so there should be some budgetary flexibility for him to use that money to save up for the construction.  OP doesn't need to know how he's managing the accounts just yet given there's no marriage license involved.", ">he thinks is ridiculous because nothings guaranteed anyway (we could marry and divorce).\n\nNTA - He's right you could marry and divorce. But if you contributed after you were married you would (at least in my state) have part ownership in the house.", "She should pay rent just as though she were sharing a house with a housemate.\n\nAnd since her partner owed the house prior to her involvement, if the partner is smart, there would be a prenup in place because any marriage.\n\nOP is already eyeballing a home that she has not paid into, aside from living expenses which she should be doing regardless.\n\nOP is the AH.", ">So he “feels like he will always be alone in this”. \n\n>Poor guy, if only there was a solution to that. /s\n\nLol. Right! Poor thing feels all alone in paying for the thing that ***checks records*** yep--- he is the only one on the deed and the mortgage. Won't someone think of the poor boy who only has sole ownership of this property and can do with it what he wants. \n\nI agree. He sounds like a sneaky, cheap little shit. He managed to get his ex to pay for his last reno and never paid her back. Now, he's trying the same on OP and justifying it by saying  that the same could happen in divorce. Which is the same as him straight out, admitting that OP isn't going on the deed after they get married and any money she puts in the house for upgrades is going to be forfeit whether they're married or not. Enjoy those marble bathrooms while you live there because that's all you are getting for your money. \n\nTL:DR---- he's always going to be alone in this. Because he alone is the only one he wants benefitting from the house.", "Yes, meant to say that in my other comment but forgot. \n\nMarble isn't great anywhere and it certainly doesn't look or feel good. Always cold and if you ever drop or bump anything breakable like a glass on it, the glass will shatter into stardust impossible to clean.", "They should have a small agreement drawn up. I think it's crazy to be on the deed as equal owner on something that's hundreds of thousands of dollars when not actually contributing an equal share (down payment and previous years of mortgage). She at best should seek for 40% equity of the mortgage going forward and 50% of improvement costs. Not equal ownership for unequal inputs.\n\nESH since he's resentful without finding a middleground.", "Agreed. It is just he is using that money towards the mortgage. \n\nHowever he should be chipping in for the gas more often since it is the car that they take the majority of the time....", "I'm American living in the UK and we have combined finances. That said, not a single one of our (married with kids) British friends have combined finances, so I don't think it's just an American thing.", "Completely agreed. It's insane that that is not the standard.", "My boyfriend pay nothing towards the 12k in closing costs I had to pay to buy my house. His rent to me is approximately the same as what we paid in rent when we rented a place together. It is significantly less than market rent in our area. \n\nYour logic is that because I saved and planned and was able to buy a house by myself, I should give him equity for paying less rent than he would have to otherwise? Why? \n\nSure it's not the most romantic conversation to have, but why is making your partner pay your rent ok? \n\nIf OP'd partner already had a lease and had OP move in, should OP not pay any rent because \"they didn't sign the lease agreeing to that\"?", "I mean, it's rent whichever way you slice it.  OP just knows where the rent money is going, which is toward the mortgage.", "Realistically, elsewhere she wouldn't be living WITH her landlord, she would have private spaces, she wouldn't be feeding someone else or letting them use their car. So it's just NOT a landlord-tenant relationship and it's ridiculous to introduce that dynamic only when it's convenient.", ">Rent has a contract and gives you rights as a tenant.\n\nWhich she has. In most places, if she's living there she has rights. And if she's paying an agreed-upon amount, she's a tenant paying rent. You don't need a formal written agreement for that.", "And they can have a conversation about equity after they get married and it become a family home.  It's rent, OP's just realistic about what the money is going toward.", "Yes, because it's not 'rent', where I rent I don't pay for my landlord's food, my landlord doesn't get in my space (actually legally can't). Would she be living there if they weren't in a relationship? No, she could be living on her own or in a completely different set up. It's called a PARTNERSHIP it isn't just sleeping with someone.", "This is what any reasonable, non-greedy person would do.", "That is actually the right mentality as opposed to the greedy mentality where you seek to profit off your partner because you were raised in a broken system that convinced you that isn't incredibly fucked up. If someone expected me to pay them to live with them I'd break up with them in the same conversation.", "Sounds like he's looking for a mug to pay to his mortgage for him.", "But she isn't renting as a house share. I went through this with my bf when I bought the house. I don't know why everyone is assuming that OP uses no space other than the bedroom. \n\nOP and their partner likely live in the house sharing the whole home as a unit. This would be the same if they together rented a house. So take the cost of renting a home in the area, with a similar sized lot and amount of bedrooms etc. Then split it in half. \n\nI'm gonna bet that comes out to more than 40% of the mortgage. My bf gets a great deal on rent as he pays slightly more than he did when we rented a much smaller duplex together, which is far less than half of the 2.3k I could list my house for rent at.", "This comment was stolen from u/memorywishes", "She's paying more than half.", "I almost all states in the US, premarital assets are not considered marital property unless you comingle them. \n\nSo if you pay for joint expenses (housing, furniture, vacations, etc) out of a personal account, you risk it becoming a joint asset. \n\nThe reality is that if you really love someone and are going into a marriage with significant assets (or are marrying someone with significant assets) you should both push for a prenup so no one feels \"used\" and no one needs to get all weird about \"protecting their assets from golddiggers\" (which is usually what the narrative is). \n\nPrenups, when done properly, are there so you can agree how to split up while you love each other enough to make sure both people are fairly taken care of. \n\nIf you are so worried your partner is going to take 50% of \"your\" money, maybe you should reconsider marrying someone you clearly don't trust.", "That'd be why it makes no sense here. Reported.", "The money toward the mortgage, that’s generally called “rent” and that’s what she should be paying,", "It's important to note that the 65.5 cents per mile is for all maintenance costs including gas, licensing, insurance, etc. Many of these (such as insurance and registration) OP would pay regardless of using the car. So if you subtract the 400-500 for gas, then you are looking at about $330 for maintenance, including monthly insurance costs and annual registration.", "Maybe I’m missing something, but 40% of rent + utilities doesn’t seem like half leave alone more than", "So my rental property has a mortgage of roughly 750 a month. The rent on it is 900 a month. That's 150 a month that goes into an account that's used for maintenance on the property yearly. HVAC costs about $450 a year for maintenance, we're down to 1350. We had the fuse box replaced last month because it was recalled, that was 1250. We had some fuses replaced 2 months before that before we realized what was happening, that was 350.  We're at -250 then. The dishwasher went out and we lucked out and found a nice one on marketplace for 100. We're at -350. What pocket full of rent are you referring to? Or is this the part where you keep pretending to not understand mortgages and home maintenance?", "Your density is killing me. Moving on.", "True, but I'd argue that in OPs case, gas should count, since she's doing 95% of the relationship driving. I wouldn't argue that registration and insurance should count. If you figure $100 a month insurance and $500 a year registration/taxes/fees (high if OP is in a flat-fee state, but possibly low if OP is in a state where those things depends on the value of the car), it works out to gas and wear & tear cost $687.73 per month. If it's $200 for insurance, that's $587.73 per month. She'd obviously be paying some of that regardless, so let's say 1/3 of that is all her and the remaining 2/3 should be split evenly between them. That puts him responsible for $195.91-$229.24 of gas & wear and tear on her vehicle every month.", "Reread the post unless you think it's likely he has a $5000+ a month mortgage", "I like how you act like you aren't getting anything out of this.\n\nAt the end of the mortage you have a property that has been paid for entirely or mostly by someone else.\n\n\nSo yes, cry more about how your investment might cost you $200 a month thats paying into a mortgage that you effectively will get back.", "Sorry, you are an outlier. Great for your tenants that you're willing to do this, but you know well yourself that is not the norm for landlords to gladly lose thousands a year on their rental property.\n\nLet's assume your $750 mortgage you luckily got in at 2% before rates started going up. On a 25 year mortgage that would look to be about $230k. The general rule of thumb for monthly rent is 1% of property cost. Realistically you should be probably charging $2000-$2500 in rent in a normal, non-outlier situation.", "OP's boyfriend should absolutely be paying for gas. But using the federal IRS mileage rate to calculate maintenance alone is not kosher. \n\nOP could also say \"hey, we're putting a lot of wear on my car by doing all the driving. \n\nWe either need to split the cost of the car expenses (gas insurance etc) or we need to use your car more\". That's OP's boundary to make and it has nothing to do with paying costs to renovate the house. \n\nIt's not OP's house. They shouldn't pay for renos to a thing they don't own. Just like you're not going to pay to renovate the bathroom of an apartment you rent. \n\nOP had it right. Pay your fair share, and no more until you get equity in the house.", "I don’t get where you’re pulling those numbers out of - other than saying 40% of rent and utilities the only thing she quotes is gas/sundries at 400-500/month, but that isn’t necessarily broken either since other than driving her bf to places they’re mutually going nothing suggests that’s expenditure that is unique to the relationship - she could ask him to pay for gas I suppose.", "I don't know if he loves you but I am sure that he loves money (maybe more than he loves you).", "NTA\n\nHonestly I think the 40% toward the mortgage is already too high. He is building equity in this property and you have nothing. Until you are married, I would not view that as your house and as such you shouldn’t be paying for the things a landlord would pay for, like maintenance or Renos", "NTA - shit don't mean a thing without the RING!!", "NTA. If he doesn't always want to be alone in this, why doesn't he put a ring on it?", "NTA.  You already have a claim to the house by paying mortgage.  Don't let him gaslight you.  If you guys break up, get a lawyer!", "NTA.  Name on the deed after the name on a marriage license and you got a deal bud!  Especially b/c this has happened before....", "NTA. A lot of red flags on your bf's responses- he expects you (and previously ex) to take on risk of contributing to a property they don't have equity in, then complains that  “he will always be alone in this” and \"you could get divorced\" sure, that's why he needs to add you to the deeds either way if he wants your financial contribution", "NTA. You are subsidizing his lifestyle and he's telling you it doesn't really help? His whole attitude about nothing is guaranteed is ridiculous and he knows this, that's why he's trying to turn the tables on you. Why are you with him? It sounds like you have your life together while he's just tagging along. Do not invest a cent into the house, but do find a new place to live...the decision whether to keep the BF is up to you but...yeah.", "If there are no other serious issues in the relationship, and you both assume that this is a relationship that is moving toward marriage, there might be an additional option for you to consider. What if you set aside some home improvement funds in a separate bank account? Just in your name, obviously. But if he’s spending $10k on the bathroom, maybe put $5k in your home fund. If you get married, and you’re added to the deed, you can use that money to help pay down the mortgage, or hire a contractor for an improvement project you both want. Or if things don’t work out, and the relationship ends, you’ll have a down payment for your own home.", "NTA\n\nIt is his home and you pay rent, effectively.  He is absolutely alone in it.  If he wants you to be in on the renovations, you need to be in on the equity.", "You're not married and don't own the home, therefore not your responsibility. If you do marry him and if you combine your finances he will absolutely nickel and dime you for everything and never let you hear the end of it. NTA", "NTA first ioff as you said puytting a huge amount of money into a house you have no equity in? secondly, he had another g/f who did this then got the push? seriously? he has a pattern of behavior. there may have been lots of other reasons they failed as a couple but don't become #2 in line.", "NTA. But a tiny bit (and I mean tiny tiny) of Nah/ESH. I fully understand your perspective and respect it, but it also makes it appear you're not all in on a relationship you are planing to be married in. I whole heartedly agree that paying in while not on the deed is risky as hell and could be a bloody mess. I also agree with him that getting any renovation done before kids is a good idea. Kids complicate everything and give you less time and money to achieve any large projects.\n\nSo 99% NTA, 1% mix esh/nah", "> I also don’t want to be like his ex who contributed to similar expenses and obviously that didn’t work out. \n\nNTA", "NTA\n\nI would look at what renting a room would cost, and compare that to what you pay on rent (40% mortgage), plus utilities, house goods, gas,etc... (You don't have to split everything exactly 50/50 as long as everything evens out in the end.)  If you're paying about the same or more than market rate rent would be on a room, then hard NO. Do not contribute to improvements. If you're paying notably less than market rate, then you can offer to pay an extra $/month towards a renovation.\n\nMarket rate rent on a room would cover the landlords mortgage, taxes, maintenance, and a small savings towards future renovations. So it's a good starting point to determine what is a fair amount of \"rent\" in this type of situation.", "NTA\n\nhes doing you wrong! stop paying for so much when he makes more than you. you are being taken advantage of. building a life together means paying equal share and you need some kind of legal protection in place if you help pay for renovations on a house you arent named on. hes being unfair and id stop doing extra until he acknowledges the unfairness.", "NTA.\n\nWhile you are his GF, legally speaking you're his roomate/lodger/tenant who he happens to also have a sexual relationship with. \n\nA lodger or tenant doesn't chip in for home improvements. \n\n>nothings guaranteed anyway (we could marry and divorce).\n\nBut with a marriage and possible divorce you'd be legally protected. \n\n>he feels like “he will always be alone in this\n\nHe doesn't have to be... He can change it... \n\nHow does your contribution not help a lot? \n\nLike obviously it doesn't pay for all the improvements he wants.\n\nBut that sounds like he can't afford the mortgage alone, or maybe I'm reading into it too much.", "\n\n\nn\n\n\nn\n\nnnn\n\ni\ni'm so the house today though or yesterday, \nWhat's throughiiuiiiiiii I know ashley I don't  d u come an police. I talked about it last night but we're surprise her how much of a difference putting that fan in front of our room for the hallway in the back yeah, your guises room get fucking.", "This sounds an awful lot like financial abuse.  Just he's holding wealth you both earn and telling you leave its his.", "Agreed. You would never contribute money to a landlord to a place you rent. OP is a tenant.", "Seriously! I own my home and my partner pays me approx 40% of my mortgage (and I pay all the utilities on top of that) and it is a MASSSSSSIVE help. Especially considering he makes twice as much as her AND he did this to the last GF? Fuck that guy.", "100% I contributed so much money towards the down payment and some of the beginning mortgage for my ex's house... He would have likely never afforded it without my help... I also didn't even have a say in the house or car he bought with a good portion of my money. I was basically just treated as a money making maid.\n\nDo not contribute money unless you have some kind of legal binding contract... Cause if you do break up all of that money is gone.", "Agreed...a lot of red flags here. He is taking advanges of her...and he wins the double of money", "right that was how I read it, it was rent, but certainly not paying for renovations until she's got her name on the paperwork ,especially not when he's already gotten one ex to pay to increase equitity", ">why should she live there rentfree\n\nLiterally no one is arguing that she should be contributing nothing, the problem is she's contributing MORE than her fair share. And apparently that isn't even enough for the greedy asshole.", "I think it's a terrible choice. You can get porcelain tile that looks exactly like marble. These HGTV shows that have it, all I can do is say out loud ...NO!", "I mean if they were renting from a landlord even with sharing a room they would both be pay significantly more than 40% of the mortgage. Probably closer to  75-100% of the mortgage for each of them. No landlord is going to rent for less 150% of the mortgage.  So compared to that 40% ain't bad. They also don't state wether that 40% is including taxes and fees. 40% of a base mortgage (just principle and interest) we be cheap as dirt. At least where I live. $1100 minimum for a studio that is about 250-300 sq ft", "If he doesn’t want to feel alone owning a home he can put you on the deed. NTA.", "Landlords rent out property to make a profit. Her boyfriend is making a profit off her. \n\nI think it is gross and unethical to profit off a romantic partner. Like I'm fine with a coffee shop making a profit off me, but if my partner starts charging me a dollar to make me tea with my supplies I'm not going to be ok with that.\n\nAnd yes, if you are paying for more than 50% of the interest on the mortgage they are making a profit - increased equity is still profit.", "Maybe in your country. In mine it's not the case. You need a contract here.", "Wouldn't a partner want to help pay for where they are living? If they were renting an apartment should the bf foot the entire rent?", "But that assumes mortgage is the only cost - there’s also taxes and upkeep. Personally I’d say 50% of costs or market rent, whichever is lower, seems reasonable. She’s paying 40% of his mortgage and they’re splitting utilities - that seems beyond fair", "Could be. I only know about the validity of verbal contracts in common law countries (ie, most of the English-speaking world). I have no idea what it's like in code law countries. Given OP's use of $, I'm guessing that's the case.", "If they were renting they would split, of course. A mortgage would be the exact same without her there, he doesn't need her to pitch in. Even if it was fair to help pay for a mortgage she doesn't own, he doesn't even reciprocate the favour by paying gas and expenses on her car.", "I live in a common law country (Ontario , Canada) and  tenants that share washroom/kitchens with their landlords have 0 tenants protections.\nIf they don't, then it is basically impossible to evict unless they don't pay rent, do a lot of damage, or you or your immediate family want to move in. In any case they can fight it at the tribunal, and getting a case there takes months currently.\n\nSo if she lived here he could kick here out with basically no warning. If she was renting a room with others on a lease she could basically never be evicted.", "I am living in Germany and you need a contract as you cannot change your residence otherwise. And you have to change it in a timely manner on your ID card. It's much more strict here than in the US.", "Well it is fair to pay for a mortgage wherever you live. Renting you don't own the mortgage either, but you are perfectly content helping a stranger that owns multiple properties usually, but not someone you claim to love. Interesting.\n\nWithout her he may rent out another room, hell for all we know he may have had a roommate before she moved in. I doubt it but it's a possibility.\n\nHe is the asshole for the other stuff.", "It would be rent if he was charging her based on market rates for renting a similar room in the area he lives,  but he’s charging her for 40% of his mortgage which isn’t always the same thing. If 40% is the same as market rent prices for renting a room then yes, you’re correct", "You find me one place where market rent is less than or equal 40% of the equivalent mortgage on the same property and I'll show you a place with no rental properties available because it would be a terrible investment"]}