{"id": 20676, "submission_id": "14jvj87", "title": "AITA calling out a friend's divorce because she wouldn't leave my husband alone?", "selftext": "My husband works with a girl named \"Lucy\" who also happens to be part of our social circle. I wouldn't say she's close to us, but she's a close friend of a friend so we'll see her once in a while when there are group outings.\n\nShe also works with my husband \"John\", and I guess because we also see her outside of work, she thinks she's super close to my husband. I'm not a super jealous type, but I drew a line when my husband himself voiced discomfort at Lucy's behavior. \n\nShe likes to make jokes about being his \"work wife\", try and push me out of conversations with my husband (i.e. \"you weren't at the office, so you wouldn't understand), and has tried to initiated one-on-one hangouts with my husband. \n\nJohn has turned her down, and has also explicitly told her that she was making him feel uncomfortable and to stop. She's just laughed and brushed it off, and still continues. He hasn't brought it up to work yet because she's a single mom and he didn't want to get her in trouble. Her advances have mostly been just annoying, but it recently escalated which brings us to the issue. \n\nAt a BBQ, my husband was sitting around a fire pit with his friends. I got up to get food, and I came back right as Lucy came and sat down on my husbands lap while \"joking\", \"your work wife can entertain you while your normal wife is busy\". This was the first time she made a physical advance, and my husband immediately jumped up and pushed her off. \n\nShe laughed and told him to stop being so sensitive, and I could tell it embarrassed my husband. It was at this point that I told her, \"Maybe if you had focused more on being a real wife instead of a work wife, you wouldn't be divorced.\" \n\nLucy immediately left the party after that, and I found out from our friend that she cried in her car. She's since skipped and avoided all events where I'm there with my husband, which has caused a strain with our mutual friend. Most of our other friends were on my side, but some said I was too harsh and that Lucy was just kidding around.", "created_utc": 1687818771, "permalink": "/r/AmItheAsshole/comments/14jvj87/aita_calling_out_a_friends_divorce_because_she/", "score": 226, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > A friend made an advance on my husband, and I used her divorce to call her out for making him uncomfortable. It was a personal attack, which could have made me an AH regardless of how upset my husband was.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. Lucy is trying to steal your husband. Thankfully he's a good guy and isn't having it. Time for him to go to HR, there's a non zero chance that she'll go first and report him for harassment. Good luck.", "NTA. Lucy crossed a big line and needed to be put in her place, publically.  It's probably the only way you and your husband could get her to stop. \n\nBold and brazen while trying to cloak it as a joke. Wow!", "NTA. Lucy is lucky that she just felt your wrath rather than your husband going to HR *like he should.*\n\nI understand completely why your husband doesn't want to. There are probably two reasons. 1) He really doesn't want her to get in trouble and 2) it's \"embarrassing\" for a man to say they are being sexually harassed. \n\nYou should probably tell your husband that he needs to go to HR about it. She shouldn't lose her job over one instance and she'll hopefully learn a very valuable lesson. Sexual harassment in the workplace isn't a game.", "NTA she was TOLD it made him uncomfortable. Her feelings on the matter no longer matter. It’s the risk you take when you ignore polite boundaries. She taught you both that she wasn’t going to stop. So you called her out. Natural consequence. She seems extremely insecure.", "> some said I was too harsh and that Lucy was just kidding around\n\nThen go hop on their man's crotch and see if they laugh\n\n(NTA)", "NTA. She was sexually harassing your husband, and not for the first time. Your comment was harsh, but that's apparently the only way to get her attention. She wasn't taking no for an answer. She needed to be called out, and harshly.", "NTA.  Lucy sounds unhinged, honestly. Sorry you and your husband have to deal with that.", "NTA. Whether it’s due to her feeling insecure because of a divorce, or unrequited feelings towards your husband, none of Lucy’s behavior is okay. Your husband has told her that he’s not okay with her behavior. If this was a guy doing it to a girl, the shouts of sexual harassment would be far and wide. Just because a woman is the aggressor doesn’t make it less offensive or wrong.", "NTA. Her gross behavior needed to be stopped.", "Fuck around met find out! Brilliantly handled and way to stand up for your husband! NTA!", "NTA. Lucy is weird.", "NTA\n\nShe's repeatedly ignored your husband's requests to back off. It was time you or your husband told her to cut it out.", "NtA. You did the right thing. She’s way out of line and desperate. If she persists with harrassing your husband report her to their Hrd. That’s unbecoming.", "NTA the moment she plopped her butt in your husbands lap was the moment she gave up the right to be taken aside and told what she was doing was wrong. You were a lot nicer than I would have been in that situation.", "NTA.\n\nyour husband needs to talk to HR at this point, because there's every possibility that lucy decides to go there first and make some shit up now that she's been so directly called out", "NTA. I never thought this type of burning could happen at a bbq lol.\n\nOn a more serious note, she was making your husband uncomfortable and he has voiced it multiple times. In all honesty if he hasn’t already he should talk to HR (if possible).\n\nHad the genders been reversed, Lucy would probably not have many people in her corner if any.", "NTA. She is literally sexually harassing your husband; the two of you would only be T A to yourselves for NOT contacting HR about this.\n\nHer behavior is absolutely inexcusable. Imagine if a man did this to a woman; your husband's harassment is only getting worse and frankly, people who sexually harass their coworkers DESERVE nothing short of being fired and publicly humiliated.", "Nta and shame on your mutual friend for saying that was acceptable.  She's made comments and was asked to stop. She escalated things and got physical.  Then she's embarrassed about getting called out? Playing dumb games, win dumb prizes. \n\nYou were quick witted and way more calm than I would have been.", "NTA. What she’s doing is sexual harassment and tbh she’s lucky you called her out before it got her in hot water at work. The result of that would have been much worse.", "You’ve done nothing wrong.  Lucy is the biggest asshole in all of this, but your husband is also an asshole for not notifying HR.  There are ways to do it without consequences for Lucy, and he should’ve done that much sooner.\n\nNTA", "NTA. Hubby should be documenting her behavior and reporting it at work.", "NTA she had it coming, she behaved way out of line. I love your response!", "NTA. Let’s call it what it is: sexual harassment. It isn’t different because he is a man. \n\nI love the comeback", "NTA and she's lucky that you just said this and your husband hasn't gotten her in trouble at work", "NTA. Sitting on his lap and making the comment that she would entertain him while his wife was busy crossed the line. So far over the line she can't see the line in the distance.  Especially when OP's husband had told her before that her bet was not welcomed.  None of her behavior was \"kidding around\" and if the idiot how said that had someone behaving the same way towards their partner, they wouldn't be saying that it is 'kidding around '.", "Can I just say, I absolutely loved your comeback line! NTA ever. I absolutely can't stand females continuously trying to flirt their way with people's partners, especially when they are shut down. That lady needed to be put in her place, harshly at that. And I'd quit going to the hangouts where she's around. She doesn't know when to quit.", "NTA and he needs to report her to HR, honestly don’t care that she’s a single mom. Her behavior is harassment and in HR world can be viewed as sexual harassment especially if she makes a physical advance like that at a work function or at work. If she gets fired, it’s through her own actions, not your husband’s. Also that’s a good comeback.", "NTA - And good for you.", "NTA. At all. You've been nice, your husband has been nice- she isn't respecting your marriage or any boundaries. She deserved it. Her behavior is that of a flirty high school girl with a crush- she's a grown ass woman and using the \"it's just a joke\" excuse is just a shitty way to try and minimize and justify shitty behavior. Screw her. And contact HR. If she has repercussions due to her own behavior, that's on her.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy husband works with a girl named \"Lucy\" who also happens to be part of our social circle. I wouldn't say she's close to us, but she's a close friend of a friend so we'll see her once in a while when there are group outings.\n\nShe also works with my husband \"John\", and I guess because we also see her outside of work, she thinks she's super close to my husband. I'm not a super jealous type, but I drew a line when my husband himself voiced discomfort at Lucy's behavior. \n\nShe likes to make jokes about being his \"work wife\", try and push me out of conversations with my husband (i.e. \"you weren't at the office, so you wouldn't understand), and has tried to initiated one-on-one hangouts with my husband. \n\nJohn has turned her down, and has also explicitly told her that she was making him feel uncomfortable and to stop. She's just laughed and brushed it off, and still continues. He hasn't brought it up to work yet because she's a single mom and he didn't want to get her in trouble. Her advances have mostly been just annoying, but it recently escalated which brings us to the issue. \n\nAt a BBQ, my husband was sitting around a fire pit with his friends. I got up to get food, and I came back right as Lucy came and sat down on my husbands lap while \"joking\", \"your work wife can entertain you while your normal wife is busy\". This was the first time she made a physical advance, and my husband immediately jumped up and pushed her off. \n\nShe laughed and told him to stop being so sensitive, and I could tell it embarrassed my husband. It was at this point that I told her, \"Maybe if you had focused more on being a real wife instead of a work wife, you wouldn't be divorced.\" \n\nLucy immediately left the party after that, and I found out from our friend that she cried in her car. She's since skipped and avoided all events where I'm there with my husband, which has caused a strain with our mutual friend. Most of our other friends were on my side, but some said I was too harsh and that Lucy was just kidding around.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. Good job defending your husband. I wish more women were like you.\n\nFortunately my gf is defensive of me too.", "NTA. And a brilliant take down. Well done you!", "NTA Lucy is totally trying to steal your husband and if he doesn't want to go to HR he needs to start looking for another job. This won't stop, he needs to leave or go to HR.... but going to HR can create backlash and get people at work taking sides.", "NTA. You shoot straight is all. She doesn't.  Boo hoo.", "NTA. She needed a call out", "NTA. She sat in his lap and he did not like it.", "NTA...your husband needs to report it at work before she turns it around out of spite.", "NTA! You are the *real* wife! You had to be a little harsh because the message was not getting through to her.", "nta. if lucy was a man hitting on your wife no one would be on their side.", "Nta\nLucy fd around amd found out", "NTA.  She's harassing your husband,  and crossed boundaries.", "NTA, she crossed the line and you put her where she belongs.  I don't understand the double standard when it comes to men and them being sexually harassed.", "NTA. She f’ed around and found out. No pity whatsoever for her. Maybe now she will stay in her lane.", "NTA.\n\nOp, your husband needs to report that to HR immediately. I understand he doesn't want to get her in trouble, but all it takes is for her to make a report because she's mad at you for calling her out or mad at him for not responding positively to her advances.\n\nWhen I started working for my employer (I was in my early 20s) a 60+ year old guy sexually harassed me constantly, but I was too naive and kept laughing it off and ignoring it. Eventually I started dating someone, he heard me talking about it to a coworker, and then tried to get me in trouble with my boss because he was a jealous creep. \n\nNot wanting to rock the boat or get a coworker in trouble is understandable, but everybody isn't like that and can turn on you for anything. Please get him to make the report to protect himself.", "NTA", "NTA at all", "NTA", "[deleted]", "NTA….she makes your husband uncomfortable….she’s the ahole", "How dare you ask if you're the AH when she was acting like one the entire time!? NTA", "NTA No respectable woman does this to a married man in front of his wife, fuck around and find out!", "NTA more like...hero. She got what she deserved!", "Trust and believe that behind every little “joke” or “kidding” there is a bit of truth. I guarantee she would have jumped at the off chance your husband tried to cheat with her. “Friends” don’t play around with other friend’s significant others like that. At least not in my inner circle. NTA. Make sure your husband covers his ass at work just in case.", "NTA. Sick burn though!!!", "NTA, She was NOT just \"kidding around\" lol. She was hoping your husband was a sleeze bag like herself. She'll be ok. If not at least you don't have to avoid her. I would suggest ya'll report her though just in case. Hr needs to know about this.", "NTA- you were right.\n\nHopefully Lucy has learned her lesson and will never target your husband or any other coworker in such a manner ever again.  \n\nShe is very lucky that nobody has made sexual harassment allegations against her or sued the company for failing to ensure that she maintains an appropriate distance from coworkers at work & whilst they are on the premises after their shifts are over.", "NTA. I don’t really like it when people are petty or mean,  but you handled that so well. Bravo.", "NTA. Lucy is a creep and if it was reversed they would be still be a creep. Yikes. Your husband needs to report it to HR. This is harassment.", "NTA \n\nShe's looking for a new husband.  Also she could turn this around on your husband with HR. Document her actions.", "NTA that’s pure fuck around and find out. Good for you", "\"Lucy\" is sexually harrassing your husband.  Neither of you need to stand for that.  Your husband should go to HR post-haste.  And, if you care (I wouldn't blame you if you didn't), explain to your friends that this was not just one joke, that Lucy has consistently been harrassing your husband and disrespected you, and she finally crossed the line.\n\n&#x200B;\n\nNTA", "NTA. Also probably not wrong. She is almost certainly a single mom cause she cheated, based on that behavior", "NTA There. Problem solved. Great response cause she deserves it.", "Nta at all. Maybe the friends who are taking Lucy's side won't mind her sitting on their husband's lap? I would be vexed and berate her behaviour too if she did that to my husband", "NTA \n\nYou’re husband needs to report this to HR or least threaten too if she doesn’t stop and apologize profusely for the way she acted \n\nShe is actively trying to get with your husband even after he told her to stop. Enough is enough.", ">\"... Most of our other friends were on my side, but some said I was too harsh and that Lucy was just kidding around...\"\n\nI have to wonder how these people would feel if there was some guy making advances on a married women and persisted even after being told it made her uncomfortable? Asking them that next time they suggested you were too harsh and she was just kidding around. Dropping on his lap like that is SA.", "Definitely NTA. About your friends, ask Lucy to continue “kidding around” by sitting on their husbands’ laps if they think you were too harsh. \n\nLucy should be thankful that your husband did not file for sexual harrassment.", "NTA. Maybe you were harsh but Lucy is the one who crossed the line when your husband explicitly told her he was uncomfortable and to stop and she continued with the “joking”. \nSometimes people’s behavior demands a harsh rebuke.", "Absolutely NTA. You and your husband were incredibly patient with this woman sexual harassment. I hope your husband reports her to HR asap before she turns it on him.", "NTA.\n\nLucy has the hots for your husband.\n\nIt's better that she's too ashamed / offended to attend any functions with you and DH.", "NTA but you shifted the focus to something that is personal to her and has nothing to do with you and your husband, whilst pointing out that she was being inappropriate, disrespectful and that what she was doing qualified as sexual harassment and could be brought up at work might have been more to the point and less AHly", "NTA, but your friends might be.", "See, you would have been too harsh if no boundaries ever had been set. The problem for Lucy is you guys set boundaries. Your husband told her that he’s uncomfortable with her behaviour. No doubt others in your friend group were too. NTA. Sometimes the trash takes itself out, and that’s okay.", "NTA.  No, you're making my uncomfortable, and stop weren't working.  Some times you have to bd harsh to make a point.", "You did well. NTA ✨", "Nta, lets talk about this. Your husband inform her that she been making him uncomfortable. Then she sits on his lap. He made it clear how her behavior was making him. She then touch him by sitting on him. That is assault. Then dismissed his feelings. Reverse the genders and everyone would be appalled.", "He needs to file that yesterday.", "The deserved public humiliation might of put an end to it already", ">Bold and brazen while trying to cloak it as a joke. Wow!\n\nIkr? AITA for wanting to be friend's with OP after that awesome line?", "Also, all of the kinder and subtler ways were tried and dismissed. Was it harsh?  Maybe. Necessary?  Definitely. NTA.", "I mean, she is straight up sexually harassing the poor guy. I think it is time HR heard about her behavior.\n\nNTA", "He needs to go to HR and get the facts on record before she goes and tries to twist the story", "I’m not a man, but the archaic beliefs people perpetuate when a man is a victim of sexual harassment/assault is infuriating. NTA, op.", "THIS", "This exactly. \n\nIt's obscene and unacceptable that even in the modern day, a high majority of female perpetrated sexual assualt goes completely ignored if not defended with lines like: \"she was just kidding\", \"women can't do that\", and the worst imo \"he probably liked it\"", "You are so right. OPs husband needs to involve HR as it’s obviously that he feels awkward about the situation.", "I’d probably say ESH in that case. I agree it was just not necessary to bring up something unrelated to get her to leave the husband alone.", "Nope! She delivered a cut so surgical that Lucy had to leave or die of embarrassment. Concise but so very effective.", "Absolutely.", "But that's the norm. Women can get away with fucking murder. Literally.", "Y'all are my people . My hubs is kind of like the big ol teddy bear . With his wife, daughters and my mom. Other women flirt and this poor man looks at me like save me.. ❤️lol"]}