{"id": 20684, "submission_id": "14jrdu3", "title": "AITA for not wanting to help my brother and his ex babysit?", "selftext": "I’m a stay at home mom with a toddler and a foster mom to a teenage girl. My brother and his ex have 3 kids. An infant, toddler and a 7 year old. My brother or his ex would ask me to help babysit and I enjoy seeing them and whenever I can I’m always happy to help. Well, recently they’ve been asking for me to babysit and I agree, but tell them I need them picked up by a certain time, then they go MIA or my brother will drop them off and promise that their mom will pick them up by a certain time, then they don’t pick them up when I need to. Then they’re filled with excuses as to why they can’t pick up the kids. \nI love these kids, however I’m tired of my time being abused. It’s also very hard to babysit all the kids since my toddler fights with their toddler. They assume because I’m a stay at home mom that I can watch them whenever. Now I don’t want to watch them at all. My brother is calling me an AH because I am refusing to help. So am I?", "created_utc": 1687809314, "permalink": "/r/AmItheAsshole/comments/14jrdu3/aita_for_not_wanting_to_help_my_brother_and_his/", "score": 90, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > My brother and ex girlfriend constantly ask me to babysit, I used to say yes almost all the time, but recently they stopped picking the kids up whenever I needed them to be picked up. So now I’m refusing to watch them at all. They think I’m an asshole because I don’t work and they do, so they think I should help them with babysitting. Also, they don’t pay me for babysitting. They will leave them with me all day.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. Your kindness is being taken advantage of. They wouldn’t be allowed to do that with a sitter they pay without monetary consequences. They don’t show up on time because they don’t think you’ll ever put your foot down and you’ll just be fine with it. I wouldn’t watch their kids again without bringing this up and letting them know either you’re going to start charging, or you’re not going to watch them anymore.", "NTA; not even a sliver. They cannot honor FREE babysitting pick-up times. This is outrageous. You are not an ahole.\n\nMost day cares charge a late fee such as: $15 late fee arriving between1 to 5 minutes and it increases past this or $5.00 per every late minute.\n\nThey are exploiting your kindness and are not adulting. Yes, set a boundary that ends you being taken advantage of.", "NTA-SAHM doesn’t mean you have no responsibilities and endless free time for others to take advantage of, if they expect you or anyone else to babysit they need to respect the boundaries you’ve placed. If they don’t want to respect them they need to find another sitter.", "NTA - Your kids are your responsability. Their kids are theirs responsability. They are just abusing you and being ungrateful.", "NTA.  They took advantage of you, and are now reaping the results.\n\nYou don't owe them your time, you already have two kids of your own to manage, +3 makes five.  Once or twice is an unfortunate circumstance, but every time means they do not value your time.", " NTA.  They’re taking advantage of your kindness and your time.  If you were charging for late pick-up, they’d probably be on time.", "I think it's better just saying \"*It's too much. You need to find childcare.\"* \n\n   Yeah,you could to say: \"*I can only babysit on Tuesday and Thursdays from 9 til noon!\"* or whatever\\~but I think he'd continue to take advantage. Someone who's expected **free** childcare, & is  consistently late picking them up is NOT going to be reasonable. He's going to bit\\*\\* and moan to guilt you into doing this.\n\n   He will be mad. He may try to keep his kids away from you. He may trash talk you to others.  But you AND your kiddos deserve to have your lives back, honestly!!", "NTA in the slightest. \n\nIf you’re happy to help but sick of being taken advantage of, perhaps give them a set time limit ban (two-three months?) then offer a one-off babysitting moment as a trial run. If they are late to collect or otherwise don’t meet a reasonable condition, never offer again.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI’m a stay at home mom with a toddler and a foster mom to a teenage girl. My brother and his ex have 3 kids. An infant, toddler and a 7 year old. My brother or his ex would ask me to help babysit and I enjoy seeing them and whenever I can I’m always happy to help. Well, recently they’ve been asking for me to babysit and I agree, but tell them I need them picked up by a certain time, then they go MIA or my brother will drop them off and promise that their mom will pick them up by a certain time, then they don’t pick them up when I need to. Then they’re filled with excuses as to why they can’t pick up the kids. \nI love these kids, however I’m tired of my time being abused. It’s also very hard to babysit all the kids since my toddler fights with their toddler. They assume because I’m a stay at home mom that I can watch them whenever. Now I don’t want to watch them at all. My brother is calling me an AH because I am refusing to help. So am I?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Nta.  Stop being a doormat and let them know since they don't keep their end of the bargin they an fimd another babysitter.  Their child.  Their responsibility.  Not yours.", "NTA. You’re not refusing to help. You’re refusing to let them take advantage of you. They’re confusing the two.", "NTA\n\nIt's great that you're willing to help them out, but they are abusing your boundaries and they are abusing your time.  Cut them off.", "Nta tell them if they drop them off or dont pick up the tile they say next time  you'll call cps  on them because it is abandonment your not responsible for there children", "NTA. You were helping out and they took advantage of you.  FAFO.\n\nTime to declare yourself a reformed doormat! You can do it!", "NTA. They took advantage of you.", "NTA. They aren't being dependable at picking up their children,  and taking your kindness for granted. Their children are not your responsibility.  It's been very kind of you to help,  but they are not holding up their end.", "I wouldn’t even bother viewing it as a late fee. It’s straight child abandonment", "I like this approach.  It's a teachable moment, if brother is in fact a teachable person.", "NTA.\n\n\"Brother, the only asshole here is the person who believes they can drop their children off and leave them as long as they like. You seem to think I owe you childcare, when in fact, I have been doing you an enormous fucking favor, and I am not going to continue doing so when you cannot be relied upon to pick up your children at the agreed upon time.\"", "NTA. They didn’t stick to the agreement - you wanted specific pickup and dropoff, and they flout that at every chance. They know they’d owe fines out the wizzwazz if they pulled that crap with a daycare.", "NTA. Your brother played himself. \n\nInstead of abiding by your boundaries, he ignored them and worked his way out of free babysitting. That’s on him, not you.", "NTA nest time he calls you an AH just smile and tell him you're actually an AH that doesn't watch his kids.", "NTA; call the police the next time they pull that crap.  It's very obvious they're taking advantage of you.", "NTA They couldn't follow the rules so they lost a babysitter. That's fair.", "Amen - to piggyback on your comment, I think she should have the brother pay a $50.00 down payment every time she babysits.   If he doesn't pick the kids up when he says he will, he forfeits the money.    If you were a paid daycare, you would charge him extra for not picking his kids up on time."]}