{"id": 20740, "submission_id": "14kgh8e", "title": "AITA for calling my SIL a medication queen and ultimately slamming her parenting?", "selftext": "My SIL is very much so the \"if there's meds to help, take all of them\" type. This ranges from OTC meds to narcotics. The type who tries giving you her prescribed tramadol if you say you have high anxiety that day and gets offended if you say no because she \"would never give you anything that would hurt you\". I've gotten in to it with her so many times because she thinks I'm ignorant for refusing to take meds if I don't need to. So, needless to say, she's had her kid heavily medicated since she was 5 (she's now 12) for her ADHD and if her kid so much as exhibits a single sign of energy, she's calling the doctor to up the dose because it's \"not working anymore\". \n\nNow, since our son started school he has been off the walls and getting in to trouble for not sitting still and disrupting class. The school pushed for an evaluation and we agreed to it no issue. But where it was so close to the end of the school year and they kept pushing it out, the evaluation was never completed. We just pushed it out of our heads at this point because it's summer and made the decision to have him evaluated a month or two prior to returning to school so next year he will be all set to go with no issues. But where it is summer, our kids have been hanging out with SILs kid a lot, since the yard is conjoined. SIL has mentioned to me several times that I need to get my son medicated because he's \"too much of a handful\" and he \"needs help\". Most of these comments are made following my son screaming through the yards while the kids are playing tag or when he randomly stops what he's doing to start dancing. He does stim a lot so he squawks and randomly starts singing made up songs but it's in no way being over the top disruptive for a mid summer afternoon and it in no way affects anyone other than my SIL. He's just playing. \n\nWell, SIL came here yesterday and said she needed to express a some \"tough love\" and basically flew off about how we weren't helping our kid because we \"refuse\" to medicate him and help him regulate his emotions. I simply got up from the table and said \"we are done here, you can leave\". She kept pushing and she wasn't listening to my husband, who kept telling her to mind her business. So I said \"just because you are a medication queen who would rather see your kid doped up rather than handle her does not mean we are those parents. Leave.\" My MIL called and said I was a \"fucking cunt\" for bashing my SIL for \"doing right by her kid and is trying her best\".", "created_utc": 1687878981, "permalink": "/r/AmItheAsshole/comments/14kgh8e/aita_for_calling_my_sil_a_medication_queen_and/", "score": 1178, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I feel like an AH because this is the first time I've ever spoken up about my feelings on her medicating her kid the way she does and it came out like venom.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "ESH. Both you and your sister seem to have extreme views on when medication should be given, in what doses and situations. Your sister shouldn’t be messing with her kids medication so much trying to make them conform perfectly to the kid she wants. You should be taking your son’s signs more seriously and examining support for him more actively. You both could have expressed your opinions without devolving into personal attacks on the other.", "Info: when will your son's evaluation be complete?", "Info: if your child ends up with an ADHD diagnosis, will you medicate?", "ESH.\nIf your child is having to stim to manage their environment, you’re not doing enough to help them. You should’ve pushed harder and with more urgency for evaluations. Long before school age. (Note, I understand that therapies, medication, and other treatment doesn’t stop stimming. But stimming is often used to reduce stress.)\n\nAnd your SIL is a major AH. There’s lots of different ways to manage various conditions, medication is not always the only solution.", "ESH. Seems like you both harshly judge each other while only maintaining pleasantries for as long as it suits you aka you are in-laws.", "I assume he’s getting evaluated for something like ADHD. Go over to r/ADHD and read some stories. NTA for your comment to your SIL.", "Erm ESH. Your son clearly needs intervention and she’s not wrong so you massively overreacted. Also she’s not wrong for medicating her kids but she should not be pushy re yours or giving you drugs.", "NTA because you are getting your son evaluated. From your description your SIL is going overboard. She should never offer prescription meds to another person for multiple reasons. She doesn't knowing if any meds she gives you have interactions. As for her daughter you don't know the full situation it sounds like the daughter is in being over medicate because a child having energy is normal. Hopefully your son's evaluation goes well. If I had been diagnosed as kid or even in high school my whole life would be be different. The meds certainly helping me and you don't seem against using medication when needed.", "SIL is an AH for pushing drugs onto you.  OP, you are an AH for not pushing to get your son evaluated immediately.  \n\nDrugs are not always the answer.  My grandson is currently under evaluation because he is showing signs of being on the spectrum or maybe even ADHD.  His therapist prefers to teach him techniques to manage himself, so he can be successful in the classroom and in the real world.  She also works with his parents so they can assist him in managing himself.\n\nThis is such a difference from 20 years ago.  My son's kindergarten teacher begged me to medicate him.  Of the 26 kids in his class, 20 were on some kind of medication.  He was partially deaf from having several ear infections as a baby and we had finally gotten speech therapy when he started school.  His teacher had him using every available assistance from the school system, and he still acted up in her class.  By 2nd grade, I admit I was starting to think I was wrong and maybe he needed medication.  I had been told he wouldn't graduate high school, would never go to college, never live on his own, etc.  \n\nHis 2nd grade teacher called me in the 1st week of school.  He asked to take my son out of all the extra assistance classes and keep him in the classroom. He felt he could be successful as long as my son knew he what he was expected to do.  To my shock, he became a model student that year.  He ended up graduating, going to college and now is a network engineer for a major hospital.  All because of that teacher.\n\nI am so glad I stood my ground and didn't medicate him.  I am so thankful my daughter and SIL are working with my grandson's therapist and taking my grandson's \"oddities\" seriously.  I am also very grateful that there are ways to manage without mind-numbing medications.\n\nOP - push hard to get your son's evaluation done sooner rather than later.  And, seriously consider what needs to be done so your son can be successful in life - not what makes your life easier.  Good luck!", "NTA. Wow. So many things wrong here. First, tramadol is a pain med, not anxiety medication. Second, though it is not actually a narcotic, it works similarly in the body and is classified as a controlled substance. She should NOT be just handing those out. Not to mention, most doctors are so strict with Tramadol scripts since they’re trying to avoid a repeat of the opioid crisis I’m surprised she has extras to spare if she really needs the script. \n\nThird, ADHD, if that’s what your kid has, needs way more than just medication to treat. Many kids do far better with just behavioral treatments, like letting them “get the crazies out” (what my ADHDer called her energy release breaks) and other accommodations to help focus. As a parent of an ADHD kid, I’ve met a lot of other kids with it. It’s hella rare for meds alone to help. Also, rare for behavioral treatments alone, btw. It’s got to be both combined. If SIL is just medicating kid, kid is never going to learn to self regulate her symptoms and is going to have issues her whole life. Let your boy be until the eval and follow his doctors’ advice. \n\nAnd good luck to you with him. I hope you can find a good balance that works for him so he can be his best wildling self.", "Tramadol is not for everyone.  It's too good, and addicting.  I would probably take one right now if I had it ,and I am not in pain or anxiety. Actually, maybe a little. anybody got a Trammy ?", "ESH. You for not getting your son assessed and just waiting all summer, and her for pushing pills. You both sound like poor parents in this case.", "I mean. \n\nShe's not wrong on this one. You even had the school asking for an evaluation. And then you kept putting it off.\n\nSo yeah. ESH. Although in this particular context I think your hole is a bit larger. \n\nShe's too much of a helicopter parent and you're being the opposite and neglecting the medical needs of your kid.", ">Most of these comments are made following my son screaming through the yards while the kids are playing tag or when he randomly stops what he's doing to start dancing.\n\nGotta comment on this, what a chad.\n\nI was kind of thinking maybe you should have gotten the evaluation finished regardless of the school year finishing but if it wasn't possible it wasn't possible.\n\nYou didn't tell them how to raise their kids, they don't tell you how to raise yours. Simple as.\n\nI honestly cannot give a verdict as I am not an expert in behavioural issues with children, but I know many people with ADHD. Not all of them take meds and all of them have been pleasant people. \n\nOver prescribing medication is not good also.", "ESH The SIL may indeed be overmedicating her kids, though I assume they are prescribed by the kids doctor so the dr is involved. If not, that's time to call protective services. HOWEVER, you describe your own child as displaying stim behaviors which seems like maybe you shouldn't be so lax about getting this evaluation done and can step it up more for him. Neither of you sound great here.", "NTA\n\nYour sister is a pill pusher, no doubt about it, and that's extremely unhealthy. Over time, the effectiveness of pills diminishes, which requires people to up their dose, and ultimately causes addiction. Your SIL is setting her daughter up for having a miserable life.\n\nBUT, you're not without fault in this entire situation. Kids with ADHD, ASD, and other neurospicy conditions may not be able to tolerate the situations presented in front of them, but there are methods to circumventing that kind of behaviour without the need of an assessment. Maybe it's because I worked with neurospicy kids, but I'd have your son calm in about 10 minutes.", "NTA-Medication is a good thing but no one should be blindly popping pills or giving them to children without research at the very least. You and your spouse are going about it the right way. SIL sounds like a my way or the highway asshole.", "YTA \n\nYou're literally postponing medical evaluations that could improve the quality of your child's life and education? (things don't just get pushed back for weeks, and now months, for no reason). Your sister is completely irrelevant to this conversation.", "NTA\n\nThere have been a lot of great points made.  \n\nI will just add that sharing prescription medication is illegal and can even be a felony in some circumstances.  You SIL is not only an AH, but one that could find herself in deep trouble if she is not careful.", "NTA.  Your sis & MIL are fucking AH's.  You know what's going on with your child & you are getting him evaluated.  Even if the doc gives him meds, they recommend that you only give them meds during the school year.  Most docs recommend that they take the summer off from the meds.  In the summer kids are loud & FREE!!  They are celebrating the summer.  It doesn't mean he needs meds.  It would suit your SIL if she would just let kids be kids & not try to medicate everybody.", "NTA, she just wants to medicate your kids so she doesnt feel bad about how she failed her own kid", "NTA. You have a right as a parent to take your parenting into your own hands. For me, 5 years old, is too young to be medicating behavior. Getting your son tested is a good step which you said you agreed to do. It’s what you’re comfortable doing, not what your SIL wants. He’s not her child", "NTA...Your SIL is in no way qualified to medically assess your son.  She needs to mind her own business and hopefully your remarks will help in setting some boundaries.", "NTA. Your SIL's kid is going to have so many substance abuse problems when they grow up. If she can't handle kids being loud then she shouldn't have had kids.", "You could have said a lot worse things to her and your MIL needs to handle her own kid. Everyone has an opinion but to constantly push their opinion on you is just annoying and rude. NTA for saying what you did, good job!", "NTA.  It amazes me how many parents medicate their kids for just being kids these days.  Well guess what people, children run, play, scream, and yes stim, as part of normal childhood behavior.  One of my favorite things to do as a child was twirling around in circles until I became so dizzy I fell down.  All 3 of my siblings, and all of the neighborhood children did the same thing. None of us had ADHD, autism, or any other disorder.", "People think OTC meds cannot do harm because they are OTC but many of them can cause serious problems if you take too much. It's important to follow the directions of ANY medication and not just pop them like candy. \n\nNTA - MIL is enabling SIL's crazy. While words could have been better chosen, you're doing the right thing by having your kid evaluated and treated by professionals. Young boys have a lot of energy - maybe he's autistic, maybe not but it requires a highly trained professional to make those decisions and medicate correctly.", "NTA.", "NTA. Your SIL is a massive piece of work but, with a mother with a nasty mouth like that, it's no wonder! There's no such thing as tough love. That's a term to cover up abuse by saying you're loving someone else. SIL wasn't loving you or your son. She was forcing her opinions on you and then berating you for disagreeing. You clearly love your son and doing what needs to be done. In your own timeline. Good for you!", "I would have a huge talk with your husband about cutting his family out of y’all’s lives. Nobody needs that kind of negative energy. Doing this shows your child(ren) that you don’t let people walk all over y’all, and so he may follow that advice. I would have probably ended up blurting out the same thing at that point. You as your son’s parents are allowed to choose what’s right for him. You are not the asshole, your in-laws are.\n\nEdit: I guess those of you who downvoted me like to be called c***s.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy SIL is very much so the \"if there's meds to help, take all of them\" type. This ranges from OTC meds to narcotics. The type who tries giving you her prescribed tramadol if you say you have high anxiety that day and gets offended if you say no because she \"would never give you anything that would hurt you\". I've gotten in to it with her so many times because she thinks I'm ignorant for refusing to take meds if I don't need to. So, needless to say, she's had her kid heavily medicated since she was 5 for her ADHD and if her kid so much as exhibits a single sign of energy, she's calling the doctor to up the dose because it's \"not working anymore\". \n\nNow, since our son started school he has been off the walls and getting in to trouble for not sitting still and disrupting class. The school pushed for an evaluation and we agreed to it no issue. But where it was so close to the end of the school year, the evaluation was never completed. We just pushed it out of our heads at this point because it's summer and made the decision to have him evaluated a month or two prior to returning to school so next year he will be all set to go with no issues. But where it is summer, our kids have been hanging out with SILs kid a lot, since the yard is conjoined. SIL has mentioned to me several times that I need to get my son medicated because he's \"too much of a handful\" and he \"needs help\". Most of these comments are made following my son screaming through the yards while the kids are playing tag or when he randomly stops what he's doing to start dancing. He does stim a lot so he squawks and randomly starts singing made up songs but it's in no way being over the top disruptive for a mid summer afternoon. He's just playing. \n\nWell, SIL came here yesterday and said she needed to express a some \"tough love\" and basically flew off about how we weren't helping our kid because we \"refuse\" to medicate him and help him regulate his emotions. I simply got up from the table and said \"we are done here, you can leave\". She kept pushing and she wasn't listening to my husband, who kept telling her to mind her business. So I said \"just because you are a medication queen who would rather see your kid doped up rather than handle her does not mean we are those parents. Leave.\" My MIL called and said I was a \"fucking cunt\" for bashing my SIL for \"doing right by her kid and is trying her best\".\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "I'm not going to make a judgement, but I'd strongly encourage you to not wait on the evaluation. If you do decide with your doctor to try medication it would be much better to figure out what med and dosage is helpful before your kid is back in school and potentially experiencing side effects that negatively impact his ability to learn (like falling asleep in class) that you could get past if you start trialing now.", "ESH. Her for being pushy, and you for not getting your son evaluated when his school literally told you you need to. She may be over the top but you’re just as bad in the opposite direction.", "It should have been completed when he was at school but they kept pushing it out for a week here or a week there. So, going through the doctor it takes longer apparently. They are projecting 4 weeks.", "Absolutely! Just not in the way she wants me to.", "The issues with his schooling wasn't presented to me until nearly a month before school ended. We had no reason to believe there was the need for an evaluation prior to that point and when it was brought to our attention, we agreed to the evaluation. They didn't complete the evaluation before school let out, as I said in my post. \n\nHim having a lot of energy and being loud while playing with other kids during the summer and me not worrying about medicating him during this time because there's no need for it (especially considering most doctors recommend a \"medication vacation\" from ADHD meds, normally during summer time) does not mean I am failing my kid.", "Yes, so they want him tested for a range of things but ADHD was top of the list. I guess when they do evaluations, they don't just evaluate for one thing anymore. They do the testing for like.. everything under the spectrum or something. So when he was being evaluated through the school, they were also evaluating him for ASD, anxiety disorders, attention seeking disorders, etc etc. There was a whole list.", "She is wrong. For op already has a plan to get her son evaluated. There is no reason to keep pushing to get him medicated. Especially when he has not be diagnosed with anything. Just because her child has adhd doesn’t mean medicate every child she finds a lot.", "What kind of methods? Share your knowledge please, lol. I personally see no problem with my sons behavior during the summer. He can be loud, sure, and he definitely has **a lot** of energy but he's not a bad kid. He's just loud. He's never mean. He never harms others. He truly is just having fun. The evaluation will be performed prior to him returning to school simply because I do want him to succeed and get the most out of school and he doesn't have the ability to sit still long enough to absorb the material.", "I don't think you'd take your child to his cousin's doctor but don't take him to his cousin's doctor.  \n\n\"needless to say, she's had her kid heavily medicated since she was 5 (she's now 12) for her ADHD and if her kid so much as exhibits a single sign of energy, she's calling the doctor to up the dose because it's \"not working anymore\". \n\nNTA", "You’re looking at this as though the only problem with ADHD is classroom management. \n\nIt’s not.\n\nYour child has his whole life ahead of him, a whole life that doesn’t just stop when the school bell rings. If medication can help his distegulation with executive functioning it will help all aspects of his life. \n\nMy parents didn’t medicate me. My life would be PROFOUNDLY different if they had. I wish they would have.\n\nAlso: doctors who suggest a “medication vacation” are also doing a disservice. For one, a lot of drugs that work on the brain just don’t work as well after a hiatus. For two, see the comment about ADHD basically being treated as a classroom management issue, not a systemic thing affecting all areas of life. \n\nYTA. I might say ESH, but I’m not 100% sure that I trust your narration around your SIL’s behaviour and attitudes.", "So he just started to stim this summer?", "Has your kid's doctor recommended a 'medication vacation'? Oh, right, they haven't seen a doctor yet.", "One method I've used in the past is to find out what a child's interests are, and to present activities that cater to their interests. One kid loved Pokemon, so we printed out Pokemon colouring sheets and gave them to the kid. At first the kid would just be scribbling on the paper, but eventually slowed down and started to really pay attention to the lines and using different colour crayons. Another method is to play videos that are stimulating to the senses. Search up \"dancing vegetables\" on YouTube and play it (by Hey Bear Sensory). It's 20 minutes of just veggies dancing around, and several neurospicy kids loved it.\n\nNo one should be accusing your kid of being a bad kid, because he's not. He just needs avenues to channel his sensory overloads, and vibrant colours, sounds and other sight-based feedback are known to help neurospicy kids cope with their overloads.", "INFO: Are you having your SIL watching your kid? If so, and you're just leaving the behavior for someone else go handle, this does sound a bit like YTA. Especially if your already have seen neurodivergent behavior he exhibited so you brush it off, and never bothered to actually to have it evaluated. I doubt the stimming is new, and if your kid is running into her yard and she's now responsible for watching him, I get her frustration. Maybe stop having him go over if that's the case", "ESH - your sister sounds like she’s overdoing it (although I take that with a grain of salt since we’re only hearing one side) and you sound like you’re ignoring very real issues.", "Your SIL is correct. She isn’t insulting your kid and saying he’s too much to handle, she is concerned for him. I have ADHD and it is EXHAUSTING living in my brain, especially unmedicated. I didn’t get medicated until I was in my 20s, and due to this I struggled with so many mental health problems: anxiety, depression, ocd, suicidal thoughts and actions, self harm, etc. I dropped out of high school because of it. I didn’t get to be a teenager because of it. My life would be so different now if I had been medicated as a kid, I would be long graduated university by now instead of in 2nd year. I would be able to afford to marry my fiancé and move out. Help your kid and stop being so fucking judgmental about medication. YTA.", "The medication thing is over the line, but it seems like she does have a point—you aren’t helping your son. You can identify coping strategies and behavioral interventions even in the absence of an evaluation. You’re not doing him—or those around him—any favors by shrugging your shoulders and waiting for a few months. Evaluation or no, you do owe it to your child to help him more than your post indicates you are doing.", "Huh. Well you really stepped into it, didn't you? You know your son is having issues and were going to have him evaluated. Great! But instead of rescheduling during the summer so if any further testing needs to be done, you figure you'll just wing it and about a month before school starts schedule the initial evaluation. Not cool. This is a convenience issue for you instead of what's best for him. Should he be given medication, he'll need time to adjust to them. What better time than when he won't have the pressure of fitting in at school?\n\nYour SIL seems extremly vocal about this issue, and I do think she could have mentioned it in a caring manner, instead of a judgmental one. That does not change the fact that you too are judgmental of how she raises her kids.\n\nHonestly, ESH except the kids.", "There's someone I work with who was diagnosed at age 30 with adhd.\n\nShe couldn't tell me enough what a difference it made to her life to be medicated for it. Everything was easier and more manageable and life in general felt so much better for her. \n\nThe right amount of medication can be a godsend for some people, you should absolutely be looking into this for your child.", "To your specific question about the response to your SIL, you’re NTA. \n\nHowever, YTA for how you’re handling your sons situation and not advocating as strongly as you can for the testing the school recommended. If you’re in the US, that testing from the school is one of a multitude of tests that have to be done to properly diagnose and treat a child. Speaking as the parent of a child with a recent ASD diagnosis, the sooner you work on this the better. And as a person who had parents who refused to have me evaluated as a child when it was recommended, you’re absolutely doing wrong by your child by not pushing as hard as you can for testing. I’m now on ADHD medication 30 years after the school brought issues to my parents attention, and I finally feel like a fully functioning human being. I struggled for far longer than I needed to as a result of having parents with the “there’s nothing wrong, she’s just spirited/bright/energetic” mindset, and both socially and emotionally, it was awful. \n\nAt the very least, please call your child’s pediatrician ASAP to discuss what the school has told you. They can help guide you and get you referrals to the places that can do this type of testing. A lot of these places have huge wait lists, so the sooner you get on them, the better.", "ESH. You both sound exhausting.", "ESH. But mainly YTA. \n\nTo me it's all about how she approached the situation that's wrong. You're flat out neglecting your child because you have frankly backwards and outdated opinions on mental health and medication. The way you look down on your sister for actually taking care of her kid and getting them medicated for their ADHD so they aren't suffering through it is gross.", "It is difficult to actually have a proper judgement here.\n\nPush harder for an quick evaluation of your child. Besides medications, there are many other options to help your child in school and daily life. Sometimes just a little thing needs to be changed and everything is good. He has school break now, so if he needs medication you can monitor the effectiveness or side effects. Even if your kid is young, get him involved too. When I was in in the diabetes pediatric ward, the parents had more problems accepting the diagnosis. The kids learn it.\n\nThe SIL is harming her kid and the doctors are doing it as well if they know. Like I can just tell you what you have written but Tramadol is not for dampening the activity. It is a pain drug (my dad had it for cancer pain). Most medications have specific dosages for younger kids depending on age, weight. Sometimes medications for adults are not for children. So, I hope that she is not giving her kids drugs in off label use that will harm the kid long term.", ">since our son started school he has been off the walls and getting in to trouble for not sitting still and disrupting class\n\nIf there have been issues since he *started* school, why is it only being addressed now?\n\nAs an ADHD parent of ADHD kids I can tell you that it is *not* pleasant for kids who can't control their behaviour, whether in the classroom or out of it. Not to mention the social isolation that can result.\n\n>made the decision to have him evaluated a month or two prior to returning to school\n\nIt can take months to make sure the meds are effective, get the dosage right and figure out how to manage any side effects. Leaving the evaluation this late is irresponsible IMO.\n\nESH (and your MIL is a real piece of work, wow).", "ESH you know why your sil sucks but giving a kid with adhd appropriate medication will help them in life. What you describe sounds like autism though which again would need to be teased out by professionals. By not pursuing these assessments you are being negligent.", "ESH get your child evaluation and stop waiting. Sil is completely wrong and poor child. Can't even exhibit normal behavior before mom doses them up.", "ESH. You're on the opposite sides of the medication spectrum. She's abusing meds and you're not taking your son's signs of disorder seriously enough.", "ESH. As much as she may be for meds, you sound anti med. \n\nShe needs to stop messing with her kid’s meds bc it’s going to create a bigger problem. \n\nYou need to get your kid evaluated asap and stop being anti med. Youve actually stated in your rant some signs that need to be addressed. \n\nThere is a balance and room for both. Being conservative and appropriate is where the balance is found.", "YTA. Go get your get evaluated. Take whatever paperwork the school gave you to the doctor go from there. You don’t even know if your kid will be prescribed medication. However it sounds like your kid is unable to sit still, control his body his mouth. Do you quickly that can be dangerous? I had to grab my neighbors kid from behind cars reversing SEVERAL times. My own kid is like this, he took off in parking lots. It’s not safe, that’s why you medicate your kid in the summer. My kid now enjoys his hobbies. Stop worrying about your SIL and take care of your kid.", "ESH. First of all, sharing prescription medication of ANY kind is a felony, and tramadol is a controlled substance. \nSecond of all, choosing to medicate your child for ADHD (if they indeed have it) is your choice, just like it’s your SILs choice to medicate hers.", "I'm not going to go into AYTA because I'm sure everything has already been said on that front, but if your child is stimming... that's not ADHD. You might want to ask for a full evaluation from the school as well as an outside source. (The school will only screen for EDUCATIONAL autism, which is different than a medical diagnosis of autism - it's stupid, but it is what it is.) This is not necessarily a push for meds. There are a ton of therapies available that your son may benefit from that have nothing to do with meds. My son is Autistic and ADHD and has seen so much improvement from speech therapy and occupational therapy.", "ESH both bad Parents, neither of you have the right to act superior. \n\nNeither of you are doing well by your kids.", "Info: how old is your son? \n\nBc a 5 year old running around a backyard making crazy sounds during their summer vacation is fine. If he is 15, take him to the doctor. He will thank you for it one day.", "Soft NTA.\n\nPlease get your son evaluated sooner rather than later. It takes forever for this sort of thing and he might not be \"all set\" in time for school. It's not just about medication, but classroom modifications that can help him (ball instead of a chair so he can fidget while still paying attention, etc). If you wait, he may end up struggling because things are delayed and now he really is causing major class disruptions and not learning.\n\nBut I do know a lot of parents who are lax with the meds over the summer and let the kids be just a little bit feral. If its still appropriate timing and place, it's fine.", "ESH. You’re both horribly judgmental of each other.", "YTA.  ADHD meds are not one size fits all.  It is often a long process of trial and error and summer is the best time to start that, when he’s home and you can monitor any changes.  What you don’t want to do is start him on a new medication and send him off to school without knowing how he’ll react.  Also, schools don’t push for evaluations in children with mild or even moderate symptoms, meaning your kid really needs help.  From your own description your kid is out of control.  If you don’t deal with this now, he will start losing friends, if he hasn’t already, because other kids won’t want to be around him.  He’s going to ride his bike into traffic and get hit by a car due to his impulsivity and inattention.  \n\nYes, based on your telling, your SIL has issues as well, but considering your nonchalance about your own child’s behaviors, I’m not sure you’re a reliable narrator.", "I am a medicated adult with ADHD who has an unmedicated child with ADHD (both inattentive type, so not really hyperactive). \n\nI can tell you that your statement about having a “doped out” kid is absolutely harmful and that alone makes YTA. Kids who truly have ADHD aren’t doped out when they take their meds, they are regulated. I literally feel doped out *without* my meds, an incoherent zombie that procrastinates the day away and isn’t able to finish a simple task. I forget about 100 things, obsess about 100 other and am generally a mess. It’s exhausting and terribly frustrating. On my meds I am closer to a normal person. Definitely not doped out. \n\nDo yourself a favor and forget about your SIL and focus on evaluating your kid.", "NTA. Well - comment was rude, but it was just returning to sender. Your son does obviously have something going on, but you know that and plan to get him assessed and appropriately treated within the next few months. That’s completely reasonable.", "NTA. Stimming isn’t by itself a bad thing and seeing people on here saying he needs to be medicated just for that are weird. You plan to get him evaluated and said if that includes meds you’d go that route. If it was to become actually disruptive at this time, since it’s summer and kids are kid-ing, then I’d say you should really get on an eval. But nothing wrong with letting him live in the mean time. Especially so young. SIL definitely sounds like she pushes meds too much. I take meds when the situation permits no problem bud am also able to realize when I can just push through a little something or come up with other methods to work through whatever’s going on.", "Your SIL would hate my kiddo's pediatrician then. Soon as school is done for the summer, doc wants kiddo off the meds (gradual stepdown so it's not cold-turkey). She also doesn't give medicine unless it's truly warranted. \n\nI'm of the same mind. I hate taking meds when I have pain or a headache and will wait until the pain is damn near unbearable to do so.\n\nNTA op, but I worry about your SIL taking so many meds and pushing them. It's not healthy.", "NTA. You were harsh but many people are too quick to medicate kids and your sil is textbook overmedicate a kid.", "Good on you!!! I applaud your remark, I’m sure it felt good to get it out off ur chest!! \nNow hopefully they will acknowledge your stance and respect it but something tells me they are going to be vindictive and call child protective services on you for neglect or something.  Nta.", "NTA, SIL is not a doctor and shouldn't be handing out her \"advice\". \nAlso MIL needs to but out since you're all adults and her lack of teaching her own child anything is the reason there's an issue now. \n\nAlso being medicated from a young age, for what seems no good reason other than for SIL to not have to parent, can dangerously impact their bodies in future; speaking from experience.", "NTA let the kid be a kid!", "NTA and this comment section is wild. I’m assuming the majority are bots.", "NTA", "Medication has its uses but you Americans doping up your kids for being kids, fuckin bizarre and definately dangerous, your doing the right thing and personally if she's as bad as you say she is she should be arrested for child abuse and neglect", "You are right, and I have so many adhd friends that wish they weren't medicated as kids, make sure your kid goes to therapy and get then a diagnosis, but don't mess with their brain chemistry when it isn't even developed yet", "ESH. She seems way way WAY over the top and she shouldn't be coming at you like that.\n\nHowever. You're also an AH for not getting your kid the help he so clearly needs. My husband has severe ADHD and has been on meds since he was about 10. They don't need the meds just to pay attention in school- life gets significantly easier when their brains are helped by the meds. Adhd isn't a \"he has trouble paying attention but he's fine the rest of the time\" issue, it's a brain chemistry issue. Get your kid evaluated, they very clearly need it. Some things you just can't help and they will be much happier with help.", "ESH", "ESH. \n\nAnd as an AuDHD person, medicating isn't \"doping up your kid\" because you don't want to deal with them. It's a tool in a toolbox that helps THAT CHILD feel better about THEMSELVES and learn to navigate the world we live in. It's ableist and offensive to say what you did. Isn't let your child grow up with parents who shame access to the whole toolbox.", "Okay, so I am child free and arguably have no idea what I am talking about but \n\n>my son screaming through the yards … but it’s in no way being over the top disruptive \n\nThere are 7 kids in the immediate vicinity of my house. They’re pretty young, and there’s a lot of squealing, giggling, raised voices, especially during the summer. They’re outside basically 24/7. And then there’s the one kid that *screams* when he is over stimulated or the game isn’t going his way. Literal screaming or shrieking *is disruptive*.\n\nESH but you’re also the TA for writing his disruptive behaviors off as *welp, kids, am I right?*", "Ok so as an adult who has been medicated since childhood(nmom) who developed addiction issues early on I am very careful about giving meds to my kids. I don’t do medication unless we have SAFELY tried other options first etc. But putting off evaluations and allowing your child to struggle because of your views on medication isn’t acceptable either. It seems that you and SIL both have extreme views on medications. While she is overly medicating, you’re not doing anything. Either way the children are the ones hurting. You guys could have calmly discussed this rather than both attacking each other. \n\nESH", "ESH. With my ADHD as a child I was very hyper. I took medication for school. But obviously at some point it does wear off. No one should be so medicated they’re walking around like a zombie.\n\nHowever if you are noticing the stims you need to get the evaluation sooner then later. Your son will most likely need a routine that works for him and it will take more then two months for it to feel natural. Also best to have it place sooner for school", "ESH, you both sound like awful parents", "YTA, as a full grown adult with ADHD I can’t understand why you’re talking as if adhd is only relevant towards schoolwork and being in class. It’s not. Get the kid assessed, learn about whatever they’re diagnosed with- sounds like it could be more than *just* possible adhd.", "YTA. Summer, at least where I'm at, is 2 months. So the time to get your kid evaluated is now. The better intervention, the better the outcome. Sure, she shouldn't have pushed. But her concern doesn't just mean medication.", "YTA for name-calling, but NTA for voicing your concerns. Maybe try a calmer approach next time?", "esh - she needs to mind her own business but you sound like my mom who refused to be told my brother needed some sort of intervention when he was younger which ultimately sabotaged him transitioning into adulthood. he's medicated now, but way behind where he could be in life. if the school is telling you there's an issue, you should take it more seriously.", "ESH. Your SIL is sticking her nose where it doesn't belong, and you are doing no favors by dragging your heels on an evaluation. also, you're judgmental as hell of your SIL's decision to medicate. \n\nAlso I want to know where you are that you think you can just get an eval done when you want it. Most places have you wait months, so I hope you actually have it scheduled already.", "You need to get him evaluated so he can get the proper help he needs in life. ADHD is more complex than you think especially when you've never had it, there's many things to cope with such as decision paralysis, depression and anxiety have high numbers for people with ADHD, stimming, etc. \n\nNot all people with ADHD are medicated and not everyone needs to be, there's plenty of medications out there too that have different affects on the brain. \n\nYou need to do right by your son and get him evaluated so he can succeed, so he can see a therapist, so he can get an IEP to help him in school because many kids with ADHD struggle. \n\nYour SIL is not handling her situation with her child properly but neither are you. You are NTA because that was probably the wake up call she needed but you are TA for not taking the school seriously and getting your child checked out. If he goes on medication the doctors would rather do it when it is summertime and he can be more closely monitored vs in school with the added stress of doing well in school.", "ESH, but  tramadol for anxiety?  i have severe social anxiety and have never heard of tramadol for anxiety.  I've taken it for a sprained ankle before and if anything it made my anxiety worse.", "ESH-she shouldn’t be giving tramodol like candy but I don’t really consider you a reliable reporter. I just got diagnosed with inattentive adhd in my late 40’s and what I’ve experienced my whole life ( anxiety , depression and thoughts of I un-aliving himself since childhood) might have been better if I had been on the medication I’m on now. I’m angry I had to suffer so long .  You only see the outward signs of adhd- your kid is probably acutely aware that they are different and that they struggle compared to other kids and I guarantee you that it has impacted them.  Please get the evaluation started now.", "As an adhder, feel free to ignore every single one of her pieces of advice. You know your kid better. And adhd is such a spectrum, there are people like me who are hyperactive but super happy either way, and there are some adhders who are absolutely miserable when they feel out of control and they end up with major behavioral issues. Only you know where he lands. To me, he sounds like a kid. 🤷🏼‍♀️\n\nThe only suggestion I will make is to keep him busy. Like busy-busy. I did every activity under the sun (softball, soccer, ballet, camp, flute, etc). It kept me even keeled and looking back I had an *exceptional* childhood, with loads of fun.\n\nOh, duh. Typical adher forgets the entire point: NTA.", "NTA. Medications are good, but it’s not like you can only use those. SIL doesn’t understand the human mind and doesn’t realize that her kid needs therapy. She’s making her kid a zombie, but “that’s ok as long as she does well in school”. I honestly feel bad for your SIL. And she’s been bothering you about it for years, obviously you would just snap one way or another and tell her the truth. And your MIL had no right to call you a c#nt, SIL and MIL are both the AH.\n\nTo add-on: I reread some of it, and I’m changing this to ESH. You should have gotten your son evaluated right away, but you slacked off. That was an AH move.", "ESH, SIL sounds a bit much. It’s impossible to tell from this account what’s actually going on, but if your kid is suffering due to ADHD, meds are a gdsend and are the gold standard treatment, (because, adderall, it is a chemical-based disorder, so chemicals are the best solution). Of course you should be doing the evaluation and speaking to doctors, but it might behoove you to seek out those supports sooner rather than later. You can read through ADHD fora and see thousands of accounts of adults who lament the years and even decades of lost time due to not being properly diagnosed and medicated. Many harbor major resentments against parents who refused to seek outside help for whatever reason. Just some food for thought, and of course it should be based on your kid’s needs first and foremost. I will say, though, I could see a scenario where a wellmeaning-if-nosy ADHDer was keying in on things you might not notice, so if you were already going to investigate an evaluation, maybe better to jump back into that process rather than keeping it on the backburner. I also caution you against what appear to be some stigmas or discomfort around medication, because chemical intervention can be utterly lifesaving for ADHDers in several ways. Please do some research and be openminded!", "ESH I think you both are being unkind to one another. It's nice that you are allowing your kid freedom, but it sounds like other people in his life and in multiple venues (school and family) are concerned.\n\nI think more importantly for your child, you are underestimating the time to get an evaluation, potential prescription, IEP(or your equivalent) and negotiations, and acclimation to medication if that ends up being the route.\n\nYou should be pushing for your kid to get assessed NOW. So that you can negotiate with the school PRIOR to the beginning of semester crunch. AND if your kid does need meds, have some time where you can see how they affect him and get dosage right BEFORE the start of school.\n\nThen if she comes at you you can say \"we have an appointment, it's in x weeks, thank you for your concern.\" I think you are vastly underestimating the amount of time that it will take for this to get handled, and that's making you unfairly dismissive of people who medication or no have actually been through the process.", "NTA! Unless she's the specific child's neuro psychiatrist, she can't prescribe or recommend meds. If the proper medical professionals say the child in question needs medication on top of therapy to regulate then that's based on an evaluation and years of studying and treating patients, but is not a random adult's \"job\". She kept pushing and pushing so you lashed out and spoke harsh truths but truths. She's such a fan of \"harsh love\", she should experience what it is herself", "Nta at all! Young kids, especially boys, have LOTS of energy. I would have told your SIL the same. So what if he’s being a happy high energy kid. Drugging your kid into submission seems like a fucked up thing to do imo", "NTA you gave a warning shot across the bows and she kept pushing she got what she deserved. as for the MIL, well, there's language for her too.\n\nsince the gardens connect make sure she doesn't try to slip your son something just to prove her point", "ESH, but let me be clear. You can't get a medical evaluation that may require medication or therapy 2 months prior to school and be \"all good.\" These all require the patient to have time to adjust and adapt to the new normal. You are doing an extreme disservice to your kid here. School starts in August, and it's almost July. The time to have this done was April at the latest.", "ESH\n\nExtreme Opposite sides of the same thing. She shouldn't be pushing meds so much, and you should absolutely be far more proactive in following up on diagnosis and support for your child.", "Yta on this one particular thing. Your SIL is dealing with the consequences of you not getting your kid evaluated. You say *she's* the one who would rather see her kid doped up rather than handling it but you ALSO aren't handling it.\n\nYou already had trouble with an appt being delayed, delayed, delayed. What makes you think that your new appt won't  also be delayed, delayed, delayed.  And then your kid will need time to adjust.  Why do it all at the start of school?? You're just setting your kid up for frustration and failure.\n\nDoes she sound like a diaster over all?  For sure.", "i 100% dont believe your narration on this, you seem so against medication that youre basically exaggerating SIL, and youre so lack-daisy about your own child, that its ESH, get him his needed evaluation and help your child instead of worrying about what your SIL says, dude", "YTA. Medication queen? That's harsh. Next time, try a more gentle approach like 'have you considered alternative options?'", "ESH. I know that in-school evaluations can be a pain to get them to complete and that private evaluations are typically worse on top of being outrageously expensive. I think some commenters have misunderstood that issue as you just not caring. \n\nYour SIL is the type of parent that makes everyone else mistrust ADHD diagnoses and medications. I was a late-in-life diagnosis case in large part because my parents were surrounded by people like that. It sucks for her kid AND for everyone else’s, and any doctor who is willing to continually up a child’s medication without further exams should be investigated. \n \nOverall it sounds like you may be taking a step toward  that same trap and underreacting to your child’s symptoms. Obvious, disruptive, constant physical AND vocal stims in low-pressure environments like playing at home with familiar people - that’s a very strong indication that his difficulties are pretty severe. Again, I understand the limitations you’re experiencing on getting an actual diagnosis. But don’t let your SIL’s ridiculous overreaction send you in the other direction. \n\nY’all’s interaction with one another didn’t need to deteriorate into personal attacks. She came in bad, you answered bad, it was bad. You can’t control what she may do, but should probably apologize for your part in that.", "NTA. \n\nThe first paragraph told me everything I needed to know, it just got slowly but steadily worse as I go on. Usually when somebody offers me something, it's ibuprofen, not goddamn tramadol. SIL is definitely unhinged, and has an incredibly unhealthy relationship with drugs. This is just technically-legal substance abuse, and she's forcing it on her kid and trying to force it on yours too. Your child sounds a bit like I was at that age, and I've never been prescribed medication to \"dope me up\".", "ESH. Like others said, it seems you and your SIL have extreme opposite views.\n\nI will say, please consider getting tested or evaluated as soon as you can. My son (12 this month) was diagnosed ADHD combination type a year ago and we've been through 6 different medications and 2 different psychiatrists trying to help him. We started with a telehealth psychiatrist because the wait for a local in person visit was 6 months. The telehealth doctor tried several different non stimulants that didn't help. He couldn't prescribe stimulants without an in person visit and he was in a different state. Luckily by then it was time for our in person visit with the local office that we had been waiting months for. The new doctor tried a stimulant and we've since upped the dose several times, it doesn't yet seem to help too much, but it's not giving him any negative reactions so we're trying to see if a higher dose will work.\n\nAlso, it took us months to get an official 504 plan on place with the school for accommodations. Mostly, many many reminders about homework and accepting late work without penalty and informing me if he's not completing assignments so we can help at home.\n\nYou deciding to just wait until some specific time before school starts to get something in place might not be as easy as you think. It can be a long process. The earlier started, the better! Good luck.", "ESH she’s pushy about medication but your son sounds downright obnoxious. I was the same way before I was prescribed ADHD meds. If you plan to continue to not get your son any help you can expect to be called to the principal’s office regularly about him", "ADHD doesn’t just affect classroom behavior, but literally how your brain works DAILY. Please take your son to get evaluated ASAP. Your son may be suffering in the summer and it’s just not as apparent as in the classroom. \nGood on you for standing up for your kiddo, but you really could be doing more to help your child.", "As someone who was over medicated by my parents as a kid, y'all have no idea the kind of damage you are pushing this parent towards. I'm not here to deny medicine or science but let's not act like there isn't a long documented history of the FDA pushing drugs that aren't safe, especially on children. NTA. SIL needs to mind her fucking business and y'all need to do some research. Don't bother replying I'm not here to argue, just here to state my opinion.", "NTA\n\nShe had no right to interfere. \n\nThe kid doesn't even have a diagnosis. You are prepared to get him one and sooner rather than later is advised but it doesn't necessarily mean medication is the best choice for him. That's a conversation to have with your health care provider. \n\nIf he's stimming he may have autism and not ADHD and the medication route may or may not be appropriate depending on the symptoms the child has and what it's designed to treat.\n\nGiving out prescription medicine to people it wasn't prescribed for is both harmful and illegal.", "ESH\n\nYou're not wrong about your sister. I can't judge whether her child needs medication, but it's best to defer to the actual doctor's judgment. However, despite the risk of unreliable narrators in this sub, if your sister will offer her own prescription medications to other people, that's something that's just undeniably wrong.\n\nHowever, it sounds like you're in denial about the help that your son needs.\n\nBut that doesn't make it your SIL's business. It's also not YOUR business what medications her daughter is taken. Those were medications prescribed by a doctor, not ones your SIL is slipping her in secret.", "NTA, Even if he has ADHD (which is wildly over diagnosed these days) it doesn't mean he should be medicated during the summer anyways. Honestly, it doesn't mean that he needs to be medicated at all. Docs are so quick to medicate but learning how to work through his disability with an IEP and counseling can be good for him too. Not everything has to be solved with medication. ADHD is dangerous in the long term. Its a dulled down version of meth in a lot of ways. I have ADHD and was on medication for a while. It has caused permanent heart problems. I can no longer take stimulant's (no matter the brand, type or dose) because it puts me in SVT. I have had to learn skills to manage my ADHD without medication which is a lot harder as an adult. I have managed to get through college and working on my master's now without medication. Of course if he really needs it I am sure you will put him on it.", "YTA. Her child has ADHD and is on medication. The doctors review the medication to ensure it is correct. They do blood pressure tests and all sorts. It's not as simple as just calling them to up the meds. I know this because myself and my partner have ADHD.\n\nAlso sounds like your kid might also have something similar so it's worth getting them assessed. The stimming is a very clear sign of this. It's not just playing ffs. People with ADHD often group together. Took 30 years to get diagnosed and it has been a very long and difficult journey that lead to poor school performance. So yeah you're not helping your child at all. I really agree with what she said here. \n\nSide note: she still shouldn't be giving her meds to others, that's illegal for a reason", "ESH. As many people have already said, your sister sounds like she needs to stop forcing her beliefs about medication on you and your child. \n\nBut you need to be WAY more proactive about getting your child evaluated. I understand these things are a spectrum and our situation might be different to yours but our now 5 year old has been exhibiting symptoms of ADHD since he was 3 years old. It has made it extremely hard for him to make and maintain friends and has made it nearly impossible to get him integrated into any type of drop-in class (like a music, gymnastics, art etc) which has added to his difficulty of becoming better socialized. I’m sure every school is different, but it took 3 different evaluations over several months with our public school to get him set up with an IEP for the fall when he goes to kingergarten. It took us another several months to make an appointment with a Developmental Pediatrician and when she suggested we also get him tested for Autism, some places were scheduling *18 months* out. Thankfully we found an appointment for late fall that we made in early spring. \n\nIt has taken us the past two years to find coping mechanisms and techniques to help him function in the day to day, and it will still be an ever changing journey to find the right fit of techniques as he hits different developmental stages as he ages. We do occupational therapy weekly, speech therapy biweekly and talk therapy every couple months. We’ve adjusted his diet, we limit screen time, we help him use calming techniques- all to his benefit and yet every day is still a struggle for us as parents and for him as a little guy navigating the struggles he has. And we’ve done all of this as a framework to go hand in hand *with* medication if he needs it (his doctors don’t want to medicate him this young and we agree- though his doctors and my husband and I will be looking at the high possibiltiy of him taking medication when he goes to school in the fall).\n\nYou have shrugged your shoulders and used the “kids will be kids” excuse when it sounds like it has gone beyond that at this point. I am not going to project my experience onto yours. I just share our story to highlight how long it has taken us to find things that work to help him and how much ADHD (and possibly other neurodivergencies) have effected all our lives. You really should be having a bit more urgency to help your child because no one else is going to.", "While this is definitely an ESH scenario for the reasons others mentioned, I definitely think over-medicating is more dangerous/harmful than undermedicating so SIL sucks more.\n\nOP absolutely still needs to address their son's ADHD, but there are plenty of options that aren't medications they should be trying.", "YTA, but at least you recognized it. Time to apologize and start a constructive conversation.", "YTA because your child needs help (which may or may not be medication) and you’re ignoring it because “it’s summer.”", "ESH. \n\nAs other posters have noted you and your SIL are both at the extreme ends of the same scale.  Not at all helpful. \n\nI have no direct knowledge of ADD, ADHD or the various versions of it. \n\nWhat do have is the experience of a friend who was diagnosed in his 40s.  \n\nAs with kids it can take time to find the correct medications and dosages to help so they can be the best version of themselves.  \n\nAs another poster noted my friend lamented how if he’d been diagnosed as s child his life could have been considerably less stressful for him and those around him.  Especially the help with learning coping skills. \n\nSo I would ask you to please consider getting your son tested as soon as possible because unless you are really lucky it could be months to find what works.  And then get him into what ever therapy the doctor recommends because you know kids can be cruel when someone is different.", "ESH", "Esh. My child actually thrives on their low dose of adhd medication, only takes it on school days during the school year (so no weekends or school breaks) because they need it to focus on school work. They actually came to me to up the dose when they felt like it wasn’t working as well anymore and we took them back to the doctor. \n\nYou’re not doing your child any favors by going to the complete opposite of your sister and refusing to treat your child’s medical needs and letting their grades and mental health suffer.", "Wow, SIL sounds like she would watch a drug commercial on TV and go to ask her doctor if the drug was right for her!  What's up with those ads.  Do people really do that?", "My, what a lovely family. A sister in law who dopes up her kid and tries to run everyone else’s life. A SIL who doesn’t respect people. A MIL with a filthy mouth. NTA and you have my sympathy.", "ESH her daughter being on meds is none of your business and your condescending comments about it right out the gate were inappropriate.\n\nYour sons medical business is also not hers. I can understand her bringing up his wild behavior in a group situation as a point of concern but she should’ve kept her opinions to herself.\n\nYour child needs to be evaluated. Also if you’re in the US an FIE wouldn’t be allowed to not be done by the end of the year. I’m pretty sure that’s a Title IX violation so I don’t know if I believe you on that front.\n\nEdit: also super curious how you think you’ll “just get him evaluated a few months before summer ends.” It takes sometimes many months for this to happen. You’re very ignorant.", "ESH. Summer is only two months, so if you plan to get him tested a month OR TWO before school, you would have done it by now. Her kid should be allowed to be a kid and shouldn't be drugged all the time. But for fuck's sake, you're going to fuck over your own kid trying to do the exact opposite of you SIL instead of doing what's right for YOUR CHILD. I genuinely do not know why people have kids.\n\n&#x200B;\n\nThis is brought to you by a kid who had ADHD and got diagnosed in university. Woulda been fucking nice.", "As an ADHD kid who got diagnosed young, medicated in my tweens for over a decade and got little to no help outside of that… ESH, yeah. \n\nSIL is TA for the way she pushes her perspectives on your family, AND for acting like medication is all you need to do to deal with neurodivergence - if those kids aren’t also in regular counselling, they’re going to grow up believing they need meds to be socially acceptable in society just because of how she speaks about them, and how she calls their doctor to up the dose when they start “acting out” \n\nThe way she treats her kids meds as the end all be all solution WILL open up a lot of doors to addiction; Speaking from experience, the way a lot of ADHD meds are pushed on kids comes down to “take these and it won’t be so hard for you to fit in” \n\nHowever, you are ALSO TA for letting the school system push your kids evaluation off further and further and just shrugging your shoulders. You can’t fall asleep at the wheel with parenting- kids slip through the cracks for any number of reasons, even WITH a diagnosis and a support system in place. You are supposed to be your kids advocate; do your damn job and advocate for your son’s needs to be evaluated and accommodated. \n\nMeds are NOT the end all, be all to neurodivergent minds. Just like stitches are not the end all, be all to wounds- there are bandaids, there are compresses, there’s anticoagulants- there’s a MULTITUDE of tools to be used, and overusing one in place of all of them doesn’t necessarily equal better treatment.", "I'm seeing a lot of E S H and I have no idea why. I'm straight you're NTA. I do think you should out more energy into being seen before you plan to because dx and assessment can take longer than you would expect, but you're not harming your child by allowing him to stim or simply be 5 years old. \n\nNow I won't say whether her child needs the meds or not, ND cannot be compared between people. Symptoms will present differently or affect different people differently. Same with meds. But it does sound like she relies on medications in general entirely too much, and she butted in where her opinion wasn't needed, wanted, nor relevant. She is the AH here 100%", "ESH. There’s a time and a place for medication whether OTC or prescribed. Your SIL is overkill regarding her “need” to medicate instead of parent or manage without and is undoubtedly doing some kind of harm the amount she medicates herself and her child. Antibiotic resistance and increased tolerance to pain medications and anxiety medications are a thing and she is actively increasing the risk of medications not working as a result of overmedicating. So yeah she sucks here. \n\nThat being said you also have a strange view on medications. Like I said, there’s a time and a place for them. You should be getting your child evaluated NOW. Not two months prior to the start of the school term. If your child does need some kind of medication to help manage their behaviour, you need to give the medication time to work and become effective. That means allowing enough time for your child to be thoroughly evaluated. You never know if there may be a hold up getting a diagnosis or difficulty getting medication. \n\nFurthermore it gives you as a family enough time to adjust and find a suitable dosage, implement some behavioural therapies and get into good routines NOW rather than add in the stress and anxiety of school, getting back into a routine, homework, new teachers, new friends. \n\nMake your child’s transition into the new school year easier. Make it easier for your child’s teachers from day one with a well established plan in place so that they can support your child from the get go and not scramble to manage his behaviour because you’ve taken the relaxed approach to getting him evaluated and appropriately supported.", "ESH, but you not as much\n\nI agree with medications BUT your SIL's reasoning for medicating appears it might not entirely be for the benefit of the kid. The up the dosage comment, if true is worrying. Kids acting out line comment is worrying too.\n\nI also understand why you responded to her the way you did. Yes she might very well be concerned but as you said, your kid wasn't beating anyone or causing such a disturbance that time stood still. \n\nThe comment about it helping your kid is potentially true though. Some people really struggle with ADHD and medication is helpful, but so is education on the condition. SIL would have been far more impactful if she had not tried to bludgeon you into accepting her position. She kept pushing and definitely found out. Part of me thinks she wants your kid to just be quiet. Yes it's annoying living next to a loud person but far more annoying living next to someone that doesn't observe property lines. \n\nRecommendation: next time SIL gets aggressive go British on her and say \"I'll bear that in mind\" a polite way of telling people to jog on or ARGO. Best part is it's polite so if she gets offended by your assertion of boundaries then she is the baddie.", "Wait wait your MIL said WHAT??? That is the worst part of the story!\nJust FYI though- it takes a LONG time to get from evaluation, to the report being generated, to getting to a doctor who can prescribe medication. We started the process March of 6th grade and my daughter got her eval in September of 8th grade and no meds until January. She was always SO hyper but I kind of loved that, she and my son were the same- nuts at home, able to hold it together in school- but at such a cost. My son developed strategies- although he was a hummer and would kick the desk leg or table rythmically, so his homework to the sound of the TV…my little hit a wall when the workload ramped up.\nLong story short- ADHD *and autism*. She takes a low dose of concerta, only on school days- and she has gone from struggling for high Bs to one of the highest GPAs in the class (97.2) after 9th grade. I feel I did a disservice to my son- who was definitely diagnosable as both, like his little sister.", "YTA The school saw something to recommend that your son be tested and you can see something too because you just described it. If your son needs help, why would you wait? Having the diagnosis sets him up for extra help at school which they can organise during the break. Also means that he can receive treatment for behaviour and mood etc. Yes some of that treatment will be meds, which is appropriate when prescribed by a medical professional.", "NTA. This sub is now sponsored by Big Pharma. Y'all are whack", "NTA. It's not her business, but if your \"off the wall\" kid stims, screams, and squawks, you should probably get that looked at sooner rather than later.", "When I was young, they used to call that being a child. Our society is really over medicated at this point. Kids workout of the crap by being able to be like. All of the great discoveries and things that people made before they were able to be medicated. I wonder how they did it?  I’m an anti-medication person too. Though I use over-the-counter things when I need them like Tylenol and stuff but no prescriptions.", "ESH\n\nYour kid *really* needs to be evaluated. This sounds like severe adhd or autism.", ">We just pushed it out of our heads at this point because it's summer and made the decision to have him evaluated a month or two prior to returning to school so next year he will be all set to go with no issues  \n>  \n>He does stim a lot so he squawks and randomly starts singing made up songs but it's in no way being over the top disruptive for a mid summer afternoon and it in no way affects anyone other than my SIL. He's just playing.  \n>  \n>So I said \"just because you are a medication queen who would rather see your kid doped up rather than handle her \n\nMa'm, you are absolutely in DENIAL about both your son and how long testing and treating will take. Not to mention abelist, to boot. \n\nYTA", "YTA", "ESH, but with your child a gentle YTA. The real issue has nothing to do with her. I have pretty intense ADHD that my parents refused to deal with and it was fucking torment. My son also has ADHD and once he got evaluated and on meds he was much happier. There is a lot more to ADHD than just being hyper. Emotional dysregulation is just one of many many symptoms that can make it unbearable to live with. And you never know any different until you treat it.", "Info: Is your child in public school? If so, public schools typically have 60 days to evaluate from the day you sign the permission to evaluate. It is a legal obligation, schools cannot just continue to “push it off”", "YTA: doctors don’t really just hand out stimulants to small children like they did 10-15 years ago, and your whole tone of this post makes it pretty clear you are unreasonably judgmental about medication so I’m taking your review of SIL’s behavior with an ocean of salt because a grain doesn’t cover it. Secondly, you aren’t prioritizing your child’s medical needs, which immediately makes you an AH. So the school pushed it out and you just…said okay? It may have taken longer with his MD, but you’d probably have been evaluated by now had you bothered to schedule.", "You may not be an AH, but you're not too bright. Who TF would choose to live next door to in-laws??? Huge mistake for exactly this reason. You need to put some (literal and figurative) space between your family and hers. Healthy boundaries within families are hard enough to set without their property touching yours!", "ESH\n\nYour MIL for her appalling language.\n\nYour SIL for one extreme.\n\nYou for the other. Get the evaluation completed. Your son may well not need medication when not in school - a lot of kids with ADHD take a break when they are off. But why wait?", "ESH\n\nYour SIL is crazy but you haven't even gotten your son evaluated and the school thought he needed it.\n\nIt is actually NOT FUN to have ADHD and it is very frustrating to live with it. I can't imagine what I could have done if I had the chance to be evaluated and medicated when I was in school. The meds I needed didn't exist then.\n\nNow I am medicated and attending college as an older adult. It turns out, I am great at learning very hard things, I just needed help.\n\nMedication isn't always bad. Sometimes it is help.", "Has anyone bought the young man an instrument or considered theatre classes? \n\nI don't think yta", "You know you can get therapies outside of school right? You can literally have your son seeing an outpatient OT in the meantime to help with stimming and the interactions he had with the people and environment around you. It doesn’t just have to be from the school.  My 5 year old is in outpatient OT and ST along with having an IEP at school.  It will only give your son more tools he needs and added benefits beyond what the school can offer.", "ESH. You aren't taking your son's issues seriously. If you don't want to medicate (fair enough!), you need to get him other help so he can actually learn in a classroom and not ruin the chances of every other child in the room because your problem kid sucks up a lot of the teacher's time and attention.\n\nYou believe a month is all you need to get him \"set to go, no problems\" after farting around and doing nothing all school year. Sure. Yeah.", "NTA! Your SIL needs to stay in her lane. JFC NOT all active children do not need to be medicated.", "ESH - ADHD is treated with so much more than *just medication* and every case is different. \n\n1. You SIL should not be relying so heavily on medication, especially with her child's symptoms. There needs to be other coping mechanisms in place. Her not doing that is borderline abusive. \n\n2. *You* should care more about your child's mental health and start implementing the same coping mechanisms at home as he'll need in school. Pushing it off and procrastinating will only further hurt your child. It is neglectful and lazy. \n\nI stick **heavily** to routine because that is what my ADHD child needs. He needs routine, rules, explanations, and swift consequences for inappropriate behavior. We have the same routine in the summer as we do in the school year. Otherwise, the transition is too much for him. At age six, we started identifying and regulating emotions so that he could identify when he is getting overwhelmed or over stimulated. He isn't medicated yet, but may have to be later in life. \n\nI understand you felt attacked, but you're both wrong.", "I have suffered ADHD my whole life, absolutely YTA if you push off getting your child help with this.    It can be debilitating, misunderstood, and spiral to other mental health flares throughout life.   \n\nI will however ultimately say ESH.   Your sister needs to back off, but you need to help your child.     You say the school is delaying testing, cool, go to your own doctor then..to hell with the school.    \n\nAdderall changed my life, do not look at medication as a sign of bad parenting or a shameful intervention.  Not everyone has proper executive function, there’s nothing wrong with that.", "NTA I am sorry you're dealing with this. Kids were not created to sit still and not speak ALL day every day. I don't believe in prescribing kids ADHD medication personally until they are past some of their formative years. I child has a lot of energy and no way to regulate their emotions. I certainly understand your outburst, as \"cruel\" as it may have been. A lot of parents I know unfortunately think their child has and get their child diagnosed with ADHD when actually it is just them being a kid and they don't know how to handle it, mind you these parents also spend most time on their phone and not interacting, playing, with their child before ever taking them to see a specialist. MY kids are rambunctious as all get out, and do some of the things your son does. There is NOTHING wrong with that. You do need to be active in helping him regulate some things though. The fact that MIL says she's trying her best, may mean that people in the family have thought it, and just never said anything before, or SIL has felt convicted and spoke to MIL before. \\*edit because I forgot a line\\*", "YTA - sound like the guy who does not want to give his daughters meds to keep her from wetting the bed", "Your SIL sucks, now get your kid assessed.", "I’m not gonna lie OP, you’re N T A for what you said, your SIL was out of line…in her delivery. She’s not necessarily wrong. If your son is stimming then he is doing that to regulate/release his emotions. The longer you let him do that without some kind of intervention (medication, therapy, or both) the harder it is going to become for him to stop because it’ll be like a bad habit. I’m 24 and still have issues in high stress situations and end up reacting quite negatively to those around me because I was not treated for my ADHD until I was nearly an adult. I’m on the more mild side of the spectrum so that should be a big enough warning sign that your son needs to see someone. While it may not seem like it, you are essentially neglecting him right now.\n\nESH", "ESH. She is being rude and overbearing, but you are ignoring clear signs of neurodivergence in your kid. As somebody that struggled all through childhood/early adulthood because of my undiagnosed ADHD, it’s not cute for much longer. School will get harder, consequences will get greater, and he will begin to struggle. I am NOT saying you need to medicate him. But you do need to help him.", "ESH. your sister is… to put it lightly, intense about medication. yes, that is harmful. medication is not a cure-all, especially when it comes to mental health. this is a terrible mindset, and trying to “medicate the mental illness away” is very often like placing band-aids over bullet holes. \n\nthat said, i have ADHD (this is relevant— i promise). i was diagnosed when i was 17, and medicated for the first time when i was 18. i was a high achiever through the entirety of K-12, and apparently my mom had a hunch for a while, but figured i functioned just fine so i didn’t need testing. i got good grades, right?\n\nmy quality of life has improved greatly just from the diagnosis alone. it’s changed nothing about me, but now i know that i’m not fundamentally broken for having a hard time completing tasks, sitting still, talking a lot, being considered “weird”, etc. i am on medication, at a moderate dose that i take once a day 5-6 days a week, because it helps me.\n\ni’m not joking when i say that getting tested earlier in life would have quite literally changed my ENTIRE trajectory. who knows what i would’ve been able to do, had i been able to focus? had i been able to initiate homework assignments on time, had everything not taken me twice as long as they should have? it legitimately keeps me up at night. \n\nyou can disapprove of your SIL’s toxic behavior without also letting it radically affect the way you parent your own children. to be honest with you, if he has ADHD, the longer you refuse to test him, the more you are doing him a disservice.\n\ni know you’re probably thinking that it’s only a couple months, but that’s a LOT of time proportionate to how long this kid’s been existing. those are two months he could be, at the very least, receiving the proper support from YOU at home.\n\nplease, please don’t become anti-medication because of this. the OVER-use of medication is bad, but medication is great! helpful, even, when it is supplemented with the necessary support and/or lifestyle changes. healthy use of medication is possible. please, for your son’s sake, consider how this has affected your stances on things and how that might be affecting him in the long run.\n\nthis was repetitive. and long. and i am deeply sorry for the overly-passionate response. but truly, if you can save your son even a month or two of what i went through over the course of 18 years, please do it. he will be very grateful later in life— probably even very successful.\n\nmuch love.", "NTA. \n\nYour SIL sounds ableist af and instead of helping their kid navigate the world as neurodivergent, would rather suppress and in their view “erase” it so make them as neurotypical as possible. Most ADHD medication is basically a form of meth and speed.", "NTA Americans don't even realize what a firm hold Big Pharma has on us. It's disturbing. Your views are not extreme, kids will be kids. People are far too over diagnosed with mental disorders and stuck on mind altering medications simply because existing in our highly stressful, unnatural society takes a massive toll on many peoples mental healths. I may be in the minority on this because most of the people in this subreddit are American and, again, we are brainwashed", "Wow! Your MIL sounds lovely- what wonderful language to describe a family member (or anyone really).  SIL needs to mind her own business- your son is going to be evaluated, and who knows what the outcome will be.  But even if he’s diagnosed with ASD or ADHD that doesn’t mean he needs to be medicated.  My son and my nephew are both diagnosed and have almost identical diagnosis letters.  My son is not medicated.  We worked with school, went with coping strategies, dealing with triggers, managing outbursts and his behaviour has improved hugely with the help and as he’s become older he is able to self regulate.  He is my son with all his glorious quirkiness.  My nephew is medicated.  He’s subdued, the sparkle has gone, he’s super quiet, super well behaved, no longer cheeky and funny.  I know what I’d rather choose over and over - it’s hard work, but you keep the essence of them, what makes them the awesome people they are.  Don’t cave OP.", "And here I am over here thinking that kids are so heavily medicated in order to conform to a social expectation of constant calm/obedience that few know how a normal functioning kid behaves anymore. Especially boys who are by nature more active than girls.\n\nOh, and ESH", "YTA. Bigtime. Your poor kid is missing out on having the ability to function properly. :(\n\nLike even if you leave your SIL completely out of the picture whatsoever and just talk about what you’re doing and what your kid is doing. Big yikes.", "INFO: Is this about your SIL? - https://youtu.be/6DyPtvxln2c\n\nNTA - Everyone doesn't need to dope their kids up to be proper parents to them; not to say that they shouldn't be used when warranted, but this isn't that, and that isn't this.", "YTA. Get your fucking kid evaluated. His issues are so noticeable that even his TEACHERS have addressed it with you hoping you’d make a modicum of effort to address his clearly disruptive behavior. He’s literally stimming and you haven’t had him evaluated. \n\nI don’t trust the rest of how you’ve tried to paint your SIL. You’re clearly one of those holier-than-thou parents that doesn’t care how disruptive and neurodivergent their kid is no matter who tells you, you convince yourself “it’s just normal kid stuff!” No it’s not, address your child’s behavior. Parents like you make your children’s lives harder, and teachers hate you.", "YTA\n\nEven only having two things, it does sound like your son might benefit greatly from an evaluation and likely from medication. Avoiding doctors and avoiding medication is at least as bad as taking a pill for everything. It seems like you're definitely doing your son a disservice by sticking so strictly to what seems like an ideological stance against medication.\n\nMedication is real and medication helps. If your son does have ADHD, then the sooner he's able to get treatment for it, the better and the less he'll suffer. Growing up with undiagnosed or untreated psychological disorders is no good.", "NTA - It's no business of hers what you do and do not put in your kids body, simple as that. \n\nI was that kid, I don't have ADHD, it's normal. Could he have it? Sure, and you SHOULD proceed with the evaluation. But it is no place for your SIL to get involved. \n\nFor what it's worth, I have a friend who got put on ADHD meds early on in his life. He hates it, has become fully dependent, and wishes he could go back and stop his parents from doing it to him. His biggest gripe is that it's caused him some serious sleep issues, and without a prescription he's borderline narcoleptic. So it's not a black and white situation. The discussion should only include: you, your husband, your kid (maybe, specific kid dependent), and a trusted doctor. Everyone else, including reddit, can pound sand.", "I think the way you spoke to her was AH-behavior. However, she is out of line and showed AH behavior for the way she spoke to you. \n\nBoth of you need to be better-informed about ADHD and medications. \n\nJust a bit of personal experience… don’t wait to get your son’s evaluation. Doctors may be booked up months in advance, you may have something unforeseen happen and have to reschedule, it may take time to get medication types and doses figured out, then you might have to have meetings with the school ahead of time to get accommodations set up, and the school may need to make sure he is placed with the appropriate teacher and communicate with them or other staff to make sure things are set up. These things typically happen in the mid-to-late spring to set up for the following school year, so you’re already behind and will be scrambling. They have lots if other families’ needs to attends to as well, and your delay will result in difficulty for them, not just you. That won’t get you on their good side. I know. I’ve been there. Your SIL is correct in trying to encourage you to get moving bc she has likely been through all this red tape and she knows the timeline or possible delays and complications. But the way she handled it was more selfish and rude, coming off like his behavior is bugging her instead of really caring about your family. \n\nSounds like it very hard living next door to each other and starting to be intrusive for both of you bc you see everything and you mutually feel responsible for each others’ kids and to speak candidly about issues you see. The boundaries are kind of gray and challenging to navigate, it seems. I don’t really have advice for that other than to be aware of it and to try to build in some healthy space and boundaries to help prevent overexposure to each other. It’s that old “familiarity breeds contempt” thing bc you see each other’s faults or start to draw unfair comparisons and judgements about things. \n\nMaybe share this paragraph with her: \n\nSpeaking of unfair comparisons… she seems like she is comparing her daughter’s behavior and needs with your son’s. This is not appropriate. No two kids are going to have the same presentation due to differences in diagnosis, how it affects them and their family, and especially age and gender. You can’t even reliably compare boys and girls’ behavior even if they are exactly the same age. Boys typically need more physical activity and can be louder and more energetic and unpredictable when compared with girls, and they tend to develop things like communication and self-Regulation later than horns. Behavior that is a big red flag for a slightly older girl may only be mildly atypical for a younger boy. That being said, your SIL may be legitimately seeing telltale signs that are pretty universal regardless of gender, and may indicate a need for intervention. Do not discount that perspective bc she is conditioned to notice things by her experience and access to parental education from her daughter’s care providers in a way that you are not. My son has autism, developmental delays, had behavioral problems and has attention/focus issues. He’s 12 now, and I have 2 other sons, one who we suspected had a developmental delay, and both of them exhibited problems with attention and focus that had me expressing concerns with his teachers and pediatrician. Their issues did not affect them enough to result in a diagnosis or need for medication. I have spent a good amount of time with teachers, school counselors, behavioral therapists, and other care providers that I somewhat understand the typical and atypical behaviors of young boys and how that differs from that of girls. \n\nI also struggled with similar issues plus obsessive-compulsive behaviors and never got help growing up bc my parents lacked skill and knowledge. I have struggled most of my adult life bc only a few years ago did I know I needed help. Don’t downplay your child’s need for evaluation and intervention or your need for support and parental education. Most parents are not equipped to handle this stuff alone, and the default or typical parenting strategies don’t always work for atypical children. Don’t let your lack of skill be barrier to your child reaching his full potential. \n\nFrom the way you described your interactions with her regarding pharmaceuticals, it does sound like there is an over-reliance issue, but it’s not really your place to butt in unless you are concerned about pharmaceutical abuse. Just as it’s not her place to butt in if she thinks you’re not medicating your son enough unless there is a concern you’re withholding necessary medical treatment. There’s nothing wrong with speaking openly with each other, but you both overstepped here.", "NTA\n\nYour sister sounds a nightmare and I’m going to assume you’re in America where it seems that there’s a completely unhealthy obsession with being medicated.", "Elementary aged children should not be on legal meth. It's fucking bad for them. The school system and parents needs to adjust to be able to accommodate a very manageable disease.", "Right. The earlier you can intervene, inform yourself, understand your child and help them with good coping mechanisms, the better because of mental plasticity when they’re younger. It has a huge impact in quality of life later on. And the longer you wait, the more painful and expensive your child’s adult life will be because his parents decided to ignore the signs.", "Right. They're two sides of the same AH coin. \n\nSIL is seemingly reliant on using medication to parent her children for her and seems to view prescription meds overall as instant cure-alls (which they are not). She seems to think that feeding children increasing doses of ADHD medication is equivalent to taking an Advil for a one-off headache, while in reality it's roughly equivalent to taking an increasing dose of Advil for chronic migraines. She's not actually making any attempt to figure out the root cause of the issue or methods of helping/coping with that issue  *outside* of medication. This is damaging her child's mental health. \n\nMeanwhile OP is flippantly procrastinating getting their son evaluated for ADHD (even though they clearly agree that he has it based on their word choices and descriptors) \"because it's summer\" and ignoring every sign that whatever the issue may be, it needs to be addressed *outside* of school as well. ADHD is a neurological disorder that, if OP's son is diagnosed with it, will affect *every* aspect of his life *for the rest of his life*. Not just while he's in school. Especially because ADHD is a disorder with a fairly strong chance of comorbidities, including depression and anxiety. The sooner he is introduced to professional care, the better the chance he has of learning how to acknowledge & cope with his symptoms in healthy, productive ways. OP's casual failure to do so and flippant dismissal of their son's symptoms is *also* damaging their child's mental health.", "All of this, 100 percent. It's almost like they're fighting against each other to see which kid will turn out \"better\" (meds or no meds). \n\nTake my poor man's trophy, you deserve it.🏆", "I wonder how accurate the portrayal really is. OP clearly is against medication and she isn’t around her niece 24/7 so calling the doctor about meds may be legitimate. Especially since adhd meds do work like that.", "Came here to say this, glad it is top comment. As an elementary teacher, I’m sorry but it does sound like your kid is genuinely disruptive if they act like this in class (dancing or squawking while the class is supposed to be on task IS very disruptive), and we usually don’t push for an evaluation unless there’s a real issue in my experience. On the other hand, I also don’t think we should medicate kids at the first sign of energy lol", "> Your sister shouldn’t be messing with her kids medication so much trying to make them conform perfectly to the kid she wants. \n\nWhile I agree with E S H, I feel this part might be unreliable narrator. OP isn't sitting in on SIL's daughter's doctor's visits.", "I’m gonna second this. You don’t even have to go the meds route, but your kid is showing signs that he may need additional support, and you keep pushing it off. There’s tons of ways to manage ADHD, but most should have professional input from therapists to psychiatrists. \n\nI hope you know that your child having ADHD or needing additional help (even in the form of meds) isn’t a reflection on your parenting. You can be a good parent and have a child with ADHD, it shouldn’t be a badge of shame. Needing medication shouldn’t be a badge of shame either. \n\nI don’t think it’s necessary to keep giving the kids higher dosages so they stay calm, and I think children should have a space to be rambunctious and explore and live their lives. However, there should also be an understanding of what behavior is appropriate for what environment.\n\nESH.", "As someone who wasn't diagnosed with ADHD until college, your kid needs that evaluation, OP. If he's stimming and not able to focus on things he needs help. I was more on the side of daydreaming and not able to handle a lot of noise without getting overstimulated, and that was bad enough!\n\nAnd your sister could get into a lot of trouble for sharing prescription drugs. Tramadol is controlled now, and has been for about a decade I believe. I'm sure on the controlled part, just not how long. It wasn't when I was younger, then I didn't have health insurance but when I did again it was. Also it sounds like she could be over medicating her child. But what she's doing shouldn't affect how you raise your kid. \n\nLastly, if your child is diagnosed you can get help with giving them coping skills. It doesn't mean drug them until they can't function or lose their personality. It means help them cope with a world that doesn't cater to the way their brain works.", "Agreed. Even if OP wants to take a different approach to medication it still doesn't excuse blowing off recommended evaluations just so that they can put off supporting him until the very last possible moment. Summer is one of the best times for working out what works and what doesn't with medication (if they choose to go that route), coping mechanisms, etc. Even if they decide not to medicate they should at least understand what they're choosing not to medicate FOR, and the risks/benefits of both.", "i agree this 100% ESH", "i came here to say this too. as a licensed therapist (not able to prescribe meds) parents on both ends of the spectrum suck to deal with.", "I can't agree with this more my son exhibits those same tendencies and he also has can't take 90% of the medication available for ADHD because he exhibits the bad side effects it took years to figure that out and months of insomnia and self harming in-between each medication.", "I don’t trust OPs explanation of their sister at all. If they won’t even get their child tested and claim it was all scheduling conflicts? \n\nNo, they’re failing their kid, the tough love was necessary. OP YTA. \n\nThere are long term and permanent negative effects of going undiagnosed.", "Stimming is part of normal behaviour for nd folks, it’s not just used to relieve anxiety but often for extra fun times too.", "There is absolutely nothing wrong with stimming, its a useful coping mechanism and not something that needs to be medicated or suppressed. It also does not necessarily mean an environment is too stressful or needs to be managed. OP does seem rather flippant in getting an evaluation done but stimming in and of itself is not a problem.", "Honestly I’m willing to bet a fair sum of money OP isn’t being exactly fair describing SIL especially based on some of their wording choices in the rest of the post. It’s very “I’m posting this so the internet takes my side”. Sounds more like OP needs validation vs the SIL actually being some cartoon villain lol", "I'm another comment OP clarified that the school was putting the testing off.", "She lead up with all that, “always offering everyone medications” stuff to cloud our judgement about her SIL. The actual event was nothing about giving unprescribed medications. 🤔", "He literally said \"they\" keep putting it off, as jn the school kept rescheduling. It's the school that schedules the eval. Also after requesting evals, the school has 30 or 60 days to complete depending on the state.", "I'm not sure how it works in the states, but where I'm from if the school wants the testing, then the school sets it up for the children and the parents just need ti give consent. So it could of been the school but like I said idk where OP is and it's just my limited experience", "THIS", "OP clarified it was the school who postponed, not her and going through her doctor will take longer than waiting on the school.", "Best comment so far!", "Totally agree that handing out prescription meds willy-nilly is not okay—what if the SIL pushes meds on someone who’s already taking a conflicting medication? It could be incredibly dangerous.\n\nThat said, I want to note that Tramadol does indeed get prescribed for anxiety. Similarly to how benzodiazepines can work as a rescue med for panic attacks, the calming effect of tramadol can reduce anxiety symptoms.", "\n> Third, ADHD, if that’s what your kid has, needs way more than just medication to treat. Many kids do far better with just behavioral treatments, like letting them “get the crazies out” (what my ADHDer called her energy release breaks) and other accommodations to help focus. As a parent of an ADHD kid, I’ve met a lot of other kids with it. It’s hella rare for meds alone to help. Also, rare for behavioral treatments alone, btw. It’s got to be both combined. If SIL is just medicating kid, kid is never going to learn to self regulate her symptoms and is going to have issues her whole life. Let your boy be until the eval and follow his doctors’ advice.\n\nSeconding this, as someone who has been medicated since they were a kid I can tell you 1. When I was a kid I fucking hated my medication and the way it made me feel ( and yes I tried more than 1 kind of ADD medication) 2. Being on this medication is exhausting and I need frequent breaks even as an adult 3. The side effects and impact on mood/happiness (not just while on the drug but when it wears off) can be pretty overwhelming \n\nI would always default first to non-amphetamine solutions first, behavioral therapy, alternative and more engaging methods of learning, etc. if medication is still needed after this, then at least you know you actually need the medication and the juice really is worth the squeeze. But parents who immediately stick their kids on amphetamines thinking it’s an easy solution make me facepalm, the method with the most drawbacks shouldn’t be the first thing you turn to, nor is it even going to work on its own without behavioral methods to supplement it.", "Exactly what I was thinking. I know a lot of people with ADHD and though I understand the ADHDers in the comments have had good experiences with medication, that's simply not the answer for everyone.\n\nAll my siblings and I had some similar behavioral traits to OP's LO, and we ended up all different diagnoses. Outside factors held us back from these diagnoses--our schools didn't help at all, sometimes evals take time and that's no one's fault--so we were all older when diagnosed and all contributed to decisions over medicating ourselves. One of us chose meds, one of us got on one medication but keeps a low dose and relies more on other things to help, and one of us opted for no meds whatsoever and has found other ways to manage. All are perfectly fine choices and we are all doing well. We should not push anybody to go on medication or put their children on medication when we aren't there to understand the environment, available alternatives, possible effects or clashes in medication, etc.", "To be fair, it sounds like they mean starting kindergarten. Most teachers will take a wait and see approach for the first bit because some children in kindergarten have never been away from their parents all day, and anxiety can mimic some symptoms of ADHD (and vice versa ime). Comments from OP say that they were supposed to be evaluated at school, but the school kept pushing the evaluations back until the end of the school year, so now they need to wait a month to get the evaluation from their doctor.", "I'm curious, have you ever actually asked your son how he feels about your refusal of medical treatment and substitution of essentially a \"discipline\" intervention instead? Because many neurodivergent adults I know (myself included) have Strong Feelings about how our parents handled things even though we turned out relatively successful as adults. Just saying. Someone having a good career as an adult doesn't inherently mean their treatment plan as a kid was the best one for them. Sometimes we succeed despite how our parents handled things, not because of it.", "I got diagnosed late because of my parents’ fear of ADHD medication, and while I appreciate your worries about medication as well as your early diagnosis of your son, I want to correct the misconception about medication. It’s far from mind-numbing, at least with ADHD medication. For me, it just makes me feel sharper. When I tell myself to get out of bed, I can actually do it instead of getting distracted by something else, or tired out immediately by the thought of sitting in a library all day. I have control over my brain with medication.\n\nBefore medication, I had to get up before 4am every school day just so I had time to do my “coping mechanisms” in the middle of doing homework. I’d pass out sitting up in class, and I didn’t make any friends for years because I slept during lunch. I did well academically, but it came at a much larger cost than it would’ve had I been medicated. Maybe your son was fine without medication, but “standing your ground” on medication is not good general advice. I’m still bitter over my parents knowing I had adhd but not getting me diagnosed and not getting me any help in the school system. They did their best, but I’m still dealing with the consequences in higher education.", "LOL, Tramadol was useless for me.  Norco on the other hand.  I miss my Norco sometimes. ;)", "This is reddit where a lot of people are prescribed SSRI's, or ADHD medication and they have a strong strong emotianal attachment with the drugs that they are prescribed.  Its crazy but any negative comments about their medication is like saying their diagnosis isnt valid,  and their reaction is usually super emotional.", "Personally I’m really glad I was medicated as a kid. Not having them is miserable for me, so by getting them as a kid I suffered less. I think the benefits of medication vary for each child.", "If by that you mean “medicated on the exact dose and schedule that the doctor prescribes,” then 10/10.", "Hey, as someone with ADHD, I 100% understand not wanting to do the medications. I've been on Adderall and Strattera before and the side effects were too unpleasant for me :(\n\nYou could try the herbal route. I don't believe herbs can be a cure all and while I generally despise those that think it's a replacement for all medical attention, herbs like rosemary, lavender, and especially saffron have been found to be beneficial to someone suffering.\n\n**Saffron** extract itself was [studied in comparison](https://phillyintegrative.com/blog/saffron-for-adhd) to Ritalin.**Lavender** I recommend mostly because it's an \"anxiety treatment\", which unfortunately tends to go hand in hand with ADHD.**Rosemary** has very good effects on memory. This is a HUGE problem for people with ADHD. The only thing I've read on this was [here](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7491497/), which is kind of hard to navigate and understand, so I'll just copy & paste some quotes from it\n\n>*The neuronal dysfunction observed in disorders associated with aging such as Alzheimer’s disease is mainly thought to be from* ***oxidative stress****.*  \n>  \n>*In this regard a study by Farr et al. 2016, investigated the effects of rosemary extract contained 60% or 10% carnosic acid and spearmint extract contained 5% rosmarinic acid,* ***anti-oxidant-based components of rosemary*** *for 90 days, on memory and learning in mice and their results showed the* ***positive effects*** *of these ingredients on memory improvement in a mouse model.*  \n>  \n>*In another study, the aroma of rosemary oil* ***improved performance*** *in exam students by enhancing free radical scavenging activity and decreasing cortisol levels.*\n\n&#x200B;\n\nAll in all, I do not believe the herbal route is *as effective*, but I do think it would make for a more pleasant experience and treatment.\n\nOn the topic of saffron, I do not think 20mg is necessary. When I took Adderall I would frequently split my pills into halves or even quarters because I found it to be too much. Same could probably be done for saffron supplements- however, it does appear that it may be difficult to get actual saffron.\n\nRosemary and lavender I grow myself. :) I've only started this recently, however, so I can't really report anything on it unfortunately. Rosemary of course has plenty of other benefits elsewhere so I'd recommend growing it regardless.", "What other way is there other than the prescribed way?", "Preach. I didn’t get diagnosed for or help with my ADHD until I was an adult and it has taken Herculean effort to develop non-medicinal strategies and stick to them (though medication is 100% a part of my management plan).", "Exactly this, I think OP is completely unaware for some reason that a diagnosis of ADHD doesn't mean your kid gets a prescription for a sedative and off you go.\n\nGetting a formal diagnosis opens the door to finding the right kind of social and educational support for both parent and child, which is not medication-related. Being informed way ahead of time as a parent means you're able to advocate better for your child in education, social, and medical scenarios. Downplaying your child's need for support doesn't do anyone any favours, especially not the child.", "The brain is very plastic until around 26 years of age. In the 80s, many kids were getting diagnosed who did not actually have ADHD and put on medication that harmed them. \n\nSure, assess the kid, but there are many reasons a kid may have unusual behaviour patterns, and professionals often don’t rule those out before prescribing meds. If the kid is on summer vacation and not hurting anyone, there should be no rush to medicate.\n\nI have ADHD, and my partner was also diagnosed with ADHD as a child. He displayed symptoms OP mentions, and I did not display any of them. He does not take drugs and has never taken drugs, and as and adult he is super organized, had little trouble focusing or getting tasks done, and is excellent at planning. I, on the other hand, struggle with all of these to this day—even with medication. \n\nExcept in the most extreme cases, parenting makes the most difference. For some, meds will work, for others it will nuke their creativity and zest for life. I do not think “the sooner the better” is good advice when it comes to medicating a kid for non-destructive behaviours. If they become self-destructive in school, then look at solutions. Medication is only one option, and it often only works in tandem with other behavioural supports. \n\nOP’s SIL sounds like someone who doesn’t want to do the work of parenting and that’s why her kid is medicated. Medicating a 5-year-old for ADHD is absolutely unnecessary and, to your point, can affect brain plasticity—except in a potentially negative way if it’s not the correct solution.", "I lived many years with undiagnosed adhd. Did i get by? Yes, did I graduate, yes. But i spent my life not understanding why some things were so hard and I also engaged in a lot of risky and thrill seeking behaviours in my teens and twenties that put me in dangerous situations including some that I’ve had to seek therapy for as an adult to work out the trauma I didn’t realize I had from them.\n\nI cant help but feel what life would be like if I was diagnosed sooner. My adhd felt lkke extreme anxiety all day and everyday it was mentally and emotionally exhausting. Now that I’m medicated I am relieved of my noisy spinning head and my life has improved\n\nBut the sister increasing meds like that could easily go past the dose where it’s helpful and you don’t feel anything but relief and into the zone of feeling high from it and creating addiction issues. These meds are not to be take lightly. At the right dose it’s safe at too high a dose it’s risky stuff.\n\nAnd sharing prescription medication is a huge issue. It’s dangerous but also contributes to why its so hard so some people to access these meds when they need them. She’s abusing the meds if she’s sharing them. Its also an indicator the prescriptions are bigger than necessary. I don’t have meds to share, I have no extras to pass around. I have just as much as I need", "Also, treating ADHD is not a quick “he’s diagnosed, here’s a pill that will help” thing to wait until school starts back. She’s not doing her son any favors.", "The \"because it's summer\" kills me. I was a camp counselor and had a kid with some very serious behavioral issues that basically required me to be 1:1 with him, even though we had over a dozen other kids in our group. When I brought it up to camp staff, they reached out to the parents who said \"Oh we're aware, he has a diagnosis but we like to take him off his meds in the summer so he can put on a little weight\".", "Honestly we have no idea what SIL is doing for her kid other than what OP said.", "Summer is a wonderful time to get this done and help implement any tools to help- which may or may not include medication- while there is time to work with adjustments and get into new rhythms. Providers get booked up, and putting it off means they may need to wait additional time depending on scheduling!", "Not every active child has ADHD. JFC", "I don't know it's a huge waving red flag that the SIL's use of medication goes beyond her daughter. She's pushing prescription pills to adults who don't have prescriptions.\n\n\"I would never give you anything that would hurt you.\" She's not a doctor, even if she was she's not their doctor, so she actually doesn't know that. That's not okay.", "I was wondering this too--mainly because of my own direct experience with people with this mindset after I was diagnosed with ADHD as an adult. They don't think ADHD is a \"real\" thing and don't understand it, so *anything* to do with medicating it is 'too much' because in their minds, the correct amount of medication is zero. \n\n>adhd meds do work like that.\n\n100% this. It's a process and that's a *good* thing because that's to ensure that the medication is as effective as possible. \n\nEverything from finding the right brand, dosage, release schedule, etc. can all take a while. If life circumstances/demands change or you change from one brand to another, then the process can start all over again-- which with the ongoing Adderall shortage, has been a huge pain in the ass for some of us. This is e*specially* the case when it's a growing kid. My cousins that have it were all diagnosed as kids and there was always a bit of tinkering whenever they were hitting a growth spurt; particularly once they hit puberty.", "TBH this doesn't sound like stimming to me, OP says her kid was being disruptive.", "This. If the kid just started school, as indicated in the post, he's probably around 6-7 (assuming they mean 1st grade). He's literally being a fucking kid! My coworker has a child around the same age and he is constantly singing, dancing, laughing, showing us random clips of tv shows he likes. None of that means anything other than he's a fucking child being a child. \n\nI do agree that Everyone Sucks Here though. I feel bad for both kids, honestly. :(", "As someone with ADHD. Medication vacations are hell. I don't need medicine just for school. I need medication to function and not want to vibrate out my skin. I agree with all the ESH. She's over reliant. You are not taking enough action to help your son. He may not be able to express it but I went my entire childhood undiagnosed and miserable. When I finally got on medication I cried, because my brain was finally quiet.", "Okay you can't have a \"vacation\" from something you haven't been on! Also, summer is the perfect time to start meds, IF you go that route, because it can take awhile to find the right medicine and the right dosage and that can be much more disruptive during the school year than during the summer. And having a diagnosis is not just about medications. It's about understanding exactly what challenges your son is facing and helping him find strategies to cope and succeed. And about having a diagnosis on record so that you can get accomodations from the school that may help him, and so his teachers understand him better. You don't have to medicate but you're doing your kid a HUGE disservice by dragging your feet on diagnosis. You're assuming he's ADHD but he could have other things going on too, like autism or anxiety. And it can take a long time to get in for an evaluation and to get the full report so even you called TOMORROW it might not even happen until after the school year starts.", "ADHA isn’t just a classroom issue, it’s effects literally every aspect of his life. Stop ignoring it and get ahead of managing it now.", "Hi. I’m your kid from the future. I was ignored (from the era where girls were mostly ignored for being diagnosed with ADHD and autism as we did not show the same signs as boys) and not treated and now it’s extremely bad. I have all the “unmedicated ADHD issues”. Summer is the best time to get your child tested and treated. So he can get used to medication (if warranted), and not have it affect his school. Don’t be that parent. Don’t be like mine.", "Doctors do not routinely suggest “medication vacations” in this day and age.  It is actually well studied and not recommended for kids to take med breaks except for in the case where the child is pretty extremely underweight.", "anecdotal but - my teachers thought for YEARS that I had adhd and my mom swore UP AND DOWN that I didnt, was just high energy. \n\nTurns out I definitely have adhd, have struggled with executive function my whole life, and once medicated, realized how much I lost from all the years that my mom fought medicating me. \n\nmy child also has adhd, is on a \\*very low dose\\* and it was life changing for her.   \n\n\nkids with ADHD end up with tens of thousands more negative interactions with peers, parents, and teachers throughout their life. you may not think you're doing your child a disservice by completely ignoring the possibility that he might need help, but you are.", ">He does stim a lot\n\nNo reason, huh?\n\nYou realize medication isn't the only thing that helps those that are ADHD?  It isn't only about the medication.\n\nGet you son the evaluation, and the help. You are failing him because you are not getting him the help he needs.", "The fact that you think an evaluation should wait until a few months before school time as if it is just a term time issue means you are failing your kid. Mental health is not a school problem", ">especially considering most doctors recommend a \"medication vacation\" from ADHD meds, normally during summer time)\n\nWho told you that?", "A lot of doctors also recommend evaluating a medication vacation based on how your kid is doing and how they feel on the meds. You can't do that if your kid isn't even on meds, so it's premature to think that you are in the same position as someone whose kid has been diagnosed and medicated for awhile.\n\nAlso there is a lot of data right now that suggests ADHD meds can have positive effects on kids' brain development depending on how young they start and how consistently they're given. The doctors I talk to have been recommended starting meds earlier and giving them consistently with the goal of weaning the kid off them at some point. The whole 'medication vacation' trend seems to be losing favor from what I've seen. Plus it's completely dependent on the kid in question.", "As someone neurodivergent, youd be neglecting your child to not get them medications and therapy they need. Stop thinking of this in terms of behavior and visible symptoms and think of this in terms of your childs quality of life and consciousness being altered and skewed because of an imbalance in their brain. Your view of your child is so two dimmensional. They're not this thing you have to care for and get to behave, theyre a fucking person with their own issues, needs, and feelings.", "Also no \"most doctors\" do not recommend a medication vacation. One of my kids needs his meds year round. The other one (who is 16 and old enough to have a significant say) is fine with not taking her meds over the summer.", "There are other options than medications you can use if he needs it. Summer is great time to get your kid into therapy and start working on the skills to help him start to manage any behavioral problems. I tell parents \"Summer is still a good time because we can work on giving so and so a tool box of things to help them once school starts.\" It's also good so you can start learning how to help your child. Not every kid with ADHD needs medication, but I wouldn't not consider it ever. These evaluations and stuff take time as well. Why not set your kid up for success?", "There are ways to deal with adhd that don't include meds", "I don’t believe they suggest med vacays anymore (this is newish, like maybe the few years), that it’s actually too disruptive to the child to feel so different. Just thought you should know.\n\n(I hated meds and always looked forward to the weekend off, btw)", "You and your SIL are both thinking about this the wrong way. ADHD effects literally everything, including play time. You’re thinking about how adhd impacts others, not how it impacts the person who has it. It’s not about how disruptive his behaviors are to others. It’s about his daily functioning and how he feels about himself. He could be perfectly behaved but still feel totally out of control inside and exhausted from trying to hold it together. Speaking from personal experience, you don’t want him to have to live like that. While some doctors do still recommend taking a break from meds, that is outdated and studies have proven that you should NOT be doing that. Studies have also shown that when some children with adhd are given stimulants before puberty, their brains develop more normally. Getting him medication now could mean that he might not need it as an adult or might not need as much. \n\nOf course, he might not have adhd. Many things can look like adhd. Some examples include anxiety, autism, bipolar disorder, vitamin b12 deficiency, iron deficiency, lead poisoning, thyroid issues, sleep disorders, low blood pressure, etc.. Even hearing and vision loss can look like adhd sometimes. \n\nDon’t wait to get an evaluation. Maybe nothing is wrong, but if there is, you don’t want to make your child suffer needlessly when they could be getting help.", "ADHD is a systemic issue, for some things it seems like it “doesn’t matter” because he’s just a kid and can be as wild and crazy as he wants during summer. But kids *grow up* and they do not *grow out* of being neurodivergent. Even if you never give him stimulant medications he still needs *support*. He needs things like occupational therapy, he needs to learn how to create the external scaffolding to do what his brain won’t do on it’s own naturally. A lot of ADHD kids that grow up crash *hard* as soon as they leave school and move out because they relied on the structure that school and parents provided and without it they’re *toast*. I speak from personal experience here. I set alarms to drink water because I don’t have a passing period every hour to remind me to do so. I set alarms to eat because my body doesn’t send hungry or full signals right, so I can work for 12 hours straight and then wonder why I feel like *shit*, nauseous and sick. It’s because I didn’t eat or drink. I needed to learn what kind of calendar system to remind me of deadlines worked for me, I needed to learn how to manage my emotions, especially anger. I had to figure out how to organize my physical space and a reward system to get me to clean it because my brain doesn’t give me the dopamine hit for a “job well done!” That everyone else gets. I had to *learn* all that shit slowly and painstakingly on my own, and if you can get your son into things like occupational therapy so he has a guide and can start learning this shit in elementary school instead of in his 20s he will be *much* better off in life. \n\n(And this is my perspective as an unmediated ADHD adult. I was medicated as a child but had rare and severe side effects that meant I discontinued meds as a teenager. So it’s *possible* to not have or use meds, but by god if I didn’t have those side effects I would still be taking meds today)", "What doctor have you actually talked about medication? Because zero doctors recommend it.", "…why do you think he hasn’t been diagnosed with anything? Because he still hasn’t been evaluated.", "Make the 4-week appointment with your doctor now.  If the school gets back to you before then, fine.  But there's a good chance this fall the school will *keep* pushing the appointment for a week here or a week there.\n\nStand up for your son.  He needs to see a doctor, because there's a good chance he needs more than just medication.   Don't rely on the school system to eventually get around to it.", "And you couldn’t push for this? ADHD doesn’t just impact the classroom but his every day life. As his parents you should be in your school ass about the constant date changes and getting him evaluated ASAP", "So when will your doctors appointment be? You surely have it booked as soon as possible because you wouldn't be so shit a parent to think it only matters in term time?", "Have you at least started the process with your doctor then? If there is a wait period you should be signing him up ASAP", "So there is no appointment scheduled yet?", "He’s young, it’s summer and you’re only looking at a 2-3 months at most before getting an eval. It doesn’t sound like there’s behavioral concerns other than by your SIL. This few months is not going to be a make or break for him. Definitely advocate for him and always communicate with his teachers. Part of it might just be the new experience of school. Plus he’s a boy. I have 3 boys who were always “balls-out” and loud. One is on the spectrum (late diagnosis because everyone wasn’t an expert 13 years ago) which in turn is de facto adhd (for most). My other 2 are not at all. The 10yo and most of his friends are outside playing all day long in the neighborhood. They’re loud and busy. People aren’t used to that. Neuro is always a spectrum. Interventions are helpful but not always necessary. Many people have lived with ADHD & ASD and figured out how to function on their own without any help. \nI’m sure this will get completely downvoted but NTA - keep doing you. What we think is proper treatment now may be found to be more damaging in the future. For example many older teens & adults who have gone through ABA therapy find that it didn’t actually help and consider it toxic.", "Yeah I got that vibe too. \n\nBut I could also be projecting cause I begged my mom for an assessment as a kid and got nothing. Took being an adult and having my own insurance to get my ADHD diagnosis and get Adderall. \n\nAnd holy f. Adderall has been life changing. Having it in HS especially would have been literally life changing.", "Yeah it’s not always easy to get an evaluation, and medication can be a part of a management plan for ADD but it’s not the end all be all. Letting your kid run around the backyard and scream is good for them, but given OP’s nonchalance about their behavior at school SIL could be tired of an unmanageable nibbling causing issues for her or the kids using the shared yard.", "I wanted my son to be evaluated on his IEP (individual education plan) at school for the following school year. Raised my desire for evaluation in October; school scheduled the evaluation for January; we went over the results in March. This was for a kid who was already receiving services. Schools are stretched thin on this kind of thing", "And why is it taking the school to get him assessed in the first place. The parents should have also done more outside of the school. And before it got bad enough that a school needed to intervene.", "Then they darn well know they need an appt asap.  What's to say this new appt won't also be delayed multiple times?", "OP should have scheduled an evaluation on her own through a counseling service.  My daughter was 8 and having severe tantrums and she's scared of flushing toilets and the washing machine.  We chalked it up to the crappy house we lived in with my parents. We thought, oh, it's just anxiety. But she was having scream down the walls fits earlier this year.  We decided to get her into therapy and we moved forward from there. She was evaluated for sensory issues, ADHD, and autism. She has ADHD and anxiety and has meds. \n\nOP should really look into therapy for her son on her own since the school dropped the ball.", "You dont need the school in order to do an evaluation. There are other ways/resources available. They like the convenience of the excuse that it's not their fault because the school pushed it out", "I'm confused as to why or how it can be up to the school to put off an evaluation. They're not medical professionals. When I was diagnosed with adhd it was because my parents took it upon themselves to take me to a doctor for an evaluation. Then the doctor sent paperwork to the school so I could get my extra test time and whatnot. The school can't stop the parents from taking their kid to see a professional so I really don't buy that excuse one bit.", "And why did it take the school to finally get the kid assessed in the first place?", "Why didn't they get him assessed earlier as well?", "I just don’t believe that. The school pushed hard for my kid to get all her evaluations. And she just goes to a regular public school.", "Nah, they're making excuses, and likely haven't put much effort into getting an appointment. A few weeks delay? Sure, it happens, but not months.", "She said so where else that they would only have to wait 4 weeks. OP just hasn't bothered with setting anything up.", "Schools have a legal obligation to complete an evaluation 60 days from the parents signing the permission to evaluate. They do not just postpone evaluations. I’ve only ever seen it happen during Covid when schools shut down and even then, we were evaluating students by bringing them outside of the school, wearing PPE and testing", "OP could then take their kid to the family doctor and get referred through them if they took it seriously.", "Good!  If you only look for nails, you’ll only ever use a hammer.  For small kids, it’s better to test for a wide range of stuff, since it’s harder for them to explain their experiences of the world with the doc.\n\nAnd “difficulty self-moderating” is a symptom of so much.", "You need to have him evaluated by your own doctor as well. Don’t dump this on the school district. You’re neglecting your child.", "You don't sound very informed for someone who has a child who needs services. \n\nYou need to be an advocate. They push for the initial evaluation when it's bad. When your child is struggling or is a problem in the classroom. But they won't be an advocate for him in his IEP meetings and suggest accommodations that will actually help him succeed.\n\nYou seem very laissez-faire about this whole situation concerning your son's education and possible medical conditions. There are so many services and therapies that aren't medicine available that help kids with ASD and ADHD. That makes it YTA for me. Set your kid up for success.", "I didn’t once disregard the child or any one person having ADHD or any medical condition. I more so commented on how the family handled the situation. If a person finds that wrong, then that doesn’t say anything about myself, but says so of the person getting offended on the issue, which probably means they shouldn’t be on social media, much less a community of people commenting opinions of all sorts.", "No one is calling him a bad kid, ADHD is not a synonym for brat or bad kid I think you are really defensive about this and don’t really understand that sometimes people, not just kids need some extra help and it doesn’t make them bad", "You're still stuck on seeing adhd management as a classroom issue and wilfully ignoring all of the neurodivergent adults telling you that it's so much more than that. Your son doesn't have to be harming others to be struggling. You see a high energy kid and are assuming he's happy and therefore needs no help, but for all you know he'd be even happier if he felt like he were more in control of how he feels and uses that energy and desire to move.\n\nFor your son's sake, I'm begging you: listen to and learn from adults who've been where your son is now. ADHD still exists and still affects us outside of classrooms and workplaces. My ADHD doesn't go away on the weekends just bc I don't technically have to sit still and work on those days. The biggest challenge I've had with my adhd is around self-regulation and emotional management, which affects me in areas of life other than just at work when I need to sit still and do repetitive tasks, and it's a lot harder learning coping strategies for that at 37 than it would've been at 7.", "> …” lol”\n\nSays it all really, that you think it’s funny that your kid’s potential needs are going unresolved because you can’t be bothered because it’s the summer. ESH.", "Your son needs occupational therapy.", "Adhd meds usually need to be adjusted because you build a tolerance.", "The part you quoted also makes me believe OP is NTA. \n\nI've known parents who would rather medicate than actually take the time and investment to help their child, because medication can be faster than patience.  I've also seen parents medicate because they just don't want to deal. And SIL is giving off those vibes a lot. Heavily medicating isn't always an answer and I don't think we should be HEAVILY medicating children.", "I got diagnosed 2 years ago for ADHD, the first time I took meds I cried because it was so much easier to do everything and I wished so badly I would have gotten medical help sooner.", "Yes if I had been diagnosed younger I could have gotten more help and regulation of my chaos brain and could have done better in life. Medication can be harmful and it can be helpful. These ladies need to find a balance.", "In my day, there were no meds.  I just got the boxes that said, \"does not use time and materials wisely,\" and \"talks excessively\" checked on my report cards. 🙄 squirrel...", "Just to inject a note of caution here, I was on the flip side of this coin and while medication can help it can surely hurt as well.", "Ugh same. I got diagnosed shortly after entering law school. Accommodations have been a godsend and it breaks my heart to think of where I would be now if my parent's hadn't insisted I was fine because I could hyper focus on things (which...if you know, you know.) Like, I was making honor roll but BARELY. I could have probably been a straight A student with my meds :(\n\nu/Savings-Basil2035 one thing you might not realize yet is that, if your son DOES have ADHD, it is CRITICAL that you get him diagnosed NOW and get accommodations NOW. Otherwise it might be much harder to get them in the future, as you have to establish a history of accommodations and medication in order to use them on certain tests. I've been diagnosed for 4.5 years now and the ABA will not grant me accommodations on the bar exam because I haven't established enough of a history. You don't even have to give him the meds if that's your issue- it's the accommodations that you don't want to eternally block him from.  If he has aspirations beyond undergrad, you really should do him the favor of getting a diagnosis.", "Just a question for you, both my daughter and I have ADHD but have been told that if we aren’t going to school or working we couldn’t get medication help for it, is that true everywhere?", "I was 38 and I had back spasms partially from stress. Bad enough to wake me up every night for 3 weeks and I've slept on the floor on a thin mattress since 2016 because anything soft means my muscles will pull because I'm so tense and hypermobile", ">  My adhd felt lkke extreme anxiety all day and everyday it was mentally and emotionally exhausting.\n\nThis is me right now. My insurance situation is all messed up and doctor's appointments are all scheduling months out, but I'm only just now realizing how badly I need help. I've worked through the depression and anxiety but now I'm realizing that all that is doing is treating half the symptoms and not the actual issues.", "I had undiagnosed ADHD for 17 years, and wish I was diagnosed sooner too. From being punished for being \"too active\" in kindergarten to not being able to even pass my classes anymore in high school, I suffered a lot from not being diagnosed and not getting any help because of it for so long. OP putting off diagnosing or helping their kid at all is still an AH move. Get your kids help if it is available, don't make them suffer unnecessarily.", "We don't know if SIL is unsafely increasing meds for her daughter. I feel OP might be an unreliable narrator in that regard---after all, OP isn't sitting in on SIL's daughter's doctor's visits.\n\nOf course, SIL trying to give her own prescription meds to other people  is wrong.", "I could have written this. For all intents and purposes, I have developed outwardly, socially, normally. Internally though, my head is absolute chaos and I've needed a lot of therapy just to calm from a constant state of panic. I *wish* I had been medicated or at least aided in some way as a child. OP and SIL are two opposite extremes and neither is doing what's best for their kids.", "This is all precisely what I mean about the two-sides-of-the-same-coin thing. Both of them are setting up their children for severe potential long-term failure solely due to selfishness and laziness on their own parts as parents. If it persists like this they'll end up with one kid who, at best, doesn't know how to coexist or cope with her disorder without being on an obscenely high dosage of medication, and one who, at best, develops extremely detrimental comorbidities that, like the root disorder, never go away (I wasn't diagnosed with ADHD until I was 16; I developed severe clinical depression at 12--OP's son's age--and am still suffering with it over 10 years later). People with ADHD that wasn't adequately diagnosed or treated in childhood often grow into adults who struggle to complete even basic tasks like taking showers due to their crippling executive dysfunction and engage in self-destructive behaviors, be that the dangerous risk-taking you mentioned, recreational drugs, alcoholism, and/or unprotected sex. \n\n*Neither* child is being taught how to take accountability for themselves, much less how to healthily coexist and cope with their potential disorders. *Both* parents in this situation are choosing their own convenience over their children's actual health and wellbeing.", "It took us from March of 6th grade until January of 8th grade to go through the whole process and start meds. (She had to be cleared by cardiology and neurology first, due to other issues, but still!) And fortunately she did great in the lowest dose of the first one med they tried.", "I mean, to be fair--it does depend on the specific instance/child and the prescribing doctor's discretion. When I took my ADHD meds, I wasn't just not hungry: the sight and smell of food actively made me nauseous. I'd go 8.5 hrs every school day having only eaten breakfast and a granola bar or ice cream sandwich for lunch. They also gave me horrendous burnout when they wore off, so I'd be in a nasty mood, pass tf out immediately after school for 2-3 hours, and then wake up feeling fine. When I was a teen I didn't need the meds to function outside of school, so my therapist and psychiatrist suggested that I simply not take them on weekends or breaks. \n\nHOWEVER, as I said, this was carefully considered and regulated *by licensed professionals* who knew  me, my disorder, my medication, and my reactions/side effects to that medication personally. This wasn't something my parents or I had just arbitrarily decided on our own, and imo that's the key here. I was also receiving professional support for my disorder *outside* of just medication, so I was actively being taught how to recognize, take responsibility for, and cope with my own behavioral issues and symptoms. \n\nMy point being that far too many people believe that adequate treatment of ADHD starts and ends with medication. It doesn't. Medication is not a cure for ADHD, it's a management tool--and not for everybody else, but for the person taking them.", "That's true--but medicating a child starting at *5 years old* for ADHD/neurodivergence is hardly an encouraging sign.", "It’s tramacet… likely very low dose. Not such a huge deal. lol It’s basically a step up from Advil.", "Agree.  My instinct was to take OP's description of the SIL's approach to ADHD meds with a grain of salt but it's extremely odd and behavior to pressure other adults into taking her own prescription medications and it indicates an overall problematic approach to medication.", "Stimming behaviors can be seen as disruptive to others. Even some of the innocuous ones like hand flapping or rocking are considered “distracting.” Vocal stims, similar to how OP described, are not uncommon. They range from echoing sounds they hear/have heard, to making up sounds. Stimming is used to help express the sensations or emotions someone can be feeling, so its not unusual for a child to stim while playing outside.", "Some people seem to find just about any stims disruptive. These are the people who complain when someone else is fidgeting. Source: am on autism spectrum, some people take exception to my stims, even when they’re quiet and I’m doing them in my own space.", "It doesnt sound like stimming, but what OP described does sound like just normal kid behavior.  \n\n\nRunning around screaming while playing tag, randomly stopping to do something silly like dancing, making weird noises and singing made up songs, etc.  \n\n\nIf we take OP 100% at her word then sounds like he’s just being a normal kid, and SIL doesnt like that and wants him to be more silent and obedient like her own child.   \n\n\nNothing wrong with being Medicated, but SIL is being very rude about medication.  I mean she even offers her own prescriptions to people just because theyre having a high anxiety day.  You dont give other people your prescriptions!", "Very much this. I may have said the same thing as OP about my nephew and his need for meds until I saw the difference the meds made for HIM and his happiness.", "Absolutely on that last point. I very much question OP’s portrayal of the SIL and her use of medication. Is the SIL calling the doctor to up her daughter’s medication dose if she “so much as exhibits a single sign of energy” or is she just actually aware of her child’s needs and symptoms, adequately managing them with the help of a doctor, and changing the doses appropriately?", "That last bit is an excellent point. Someone who refuses to pursue an evaluation for their clearly neurospicy kid \"bc it's summer and he can just run around outside\" is Not exactly a reliable narrator around the general topic of neurodiversity and management thereof for other people's kids either.", "My life would be so different if my ADHD had been consistently treated as a child.  I was a classroom management case whose doctor believed I would \"grow out of it\".  After 5th grade I was offered no further support.  I was at that point presenting as inattentive more than hyperactive, so they ignored how much I began to struggle.  I was just 'lazy' at that point.", ">Also: doctors who suggest a “medication vacation” are also doing a disservice. For one, a lot of drugs that work on the brain just don’t work as well after a hiatus. \n\nI agree with most of your comment (especially that ADHD isn't only worth treating for the classroom) but when it comes to Adderall this isn't the case. It's not like a lot of drugs for mental health. It doesn't have to build up in the body over time. You pop it and it works. You don't HAVE to take it at perfect intervals, you can take it if you feel like you're going to need it. Lots of people take it every day, but many people only take it during the week and then have a break over the weekend, or only take it for specific tasks that they can't focus on by themselves. \n\nTaking a break from the medication can help you keep your doses low so you don't build a high tolerance. It works for some people just fine. Again, this is strictly speaking about Adderall.\n\nAll that being said, OP definitely shouldn't wait for the next school year to get the evaluation.", "Yep, I was diagnosed with ADHD at 35. I'm still unmedicated due to some insurance and doctor scheduling issues.\n\nAnyway!\n\nI've heard of people not taking their meds on the weekend (when they're off from work). \n\nAnd it's like, but why? Work shouldn't be the only place that benefits from you having full use/control of your brain and your limited ability to function.\n\nYou have chores and projects and errands and fun stuff to do when you're not at work too, and if your executive dysfunction prevents you from doing them, you're the one who loses out.\n\nIt's like, part of my brain is locked behind a paywall. Why would I pay the price (for the doctors and prescription) and then only use it to make money for other people? I wanna be able to clean my house and make vet appointments and walk my dog without mental agony and constant guilt.\n\nThe first time I'm actually able to be medicated, you can pry my meds from my cold, dead fingers and not a moment before.", "As someone with ADHD who had been on stimulant's long-term, I hate how people don't realize how dangerous this medication is. There is no telling how your life would be different. My life would have been different if I **wasn't** on it because simulants has caused permanent heart problems for me. Working in the healthcare field, this is not uncommon. I was on it for years before it caused the problems it did. That's a huge reason who they like kids to take breaks because its really not great for your body.", "Ha, everyone just ignored my issues as a child. It’s hilarious when you read my report cards because it almost seems like all my teachers got together to post the same sentence every single year, it’s practically verbatim: intelligent but ‘visits’ her classmates far too often during inappropriate times in class’. \n\nBut adhd wasn’t really a girl thing back then. So my folks just kept me increasingly busy. It did work, but I’ll never know what meds would’ve done.", "That and op didn’t mention him being diagnosed with anything.", "If you're looking at it realistically, these kinds of things take a lot of time, and pushing for a faster evaluation usually doesn't help. From the time my doctor recommended an autism evaluation to the time I got diagnosed, it took about a year, and more than half of this time was spent waiting for my first evaluation. \n\nOP mentioned in one comment that the school recommended an evaluation a month prior to the end of the school year, so if they plan to get their child evaluated about two months before the next school year starts, so the child would only have to wait two months to be evaluated, which is really fast. It would be much different if OP was the one who kept putting it off, but it was the school, and they are planning on doing it as soon as they can, so there's really not much more they can do to help.", "I think OP is either extremely ignorant or just plain lying. If they’re in the US the school doesn’t just randomly decide to do a meandering evaluation at the end of the year. FIEs are always scheduled and must be completed in a specific time frame.", "Because parents generally only know their kid. Therefore, they don't have a meter for what's normal and what's concerning. So they could have a kid with ADHD, or autism, or even poor eyesight and think \"there's nothing wrong, that's just how my kid is.\" \n\nIt's one of the reasons I believe in public school vs. homeschooling. Being in the school system means better access to people who are trained to notice those differences and let you know when it's time to have an evaluation. \n\nAlso I think if you go through the school, those evaluations are free and provided by the district. Getting them yourself means finding a doctor, making sure the insurance links up and paying the copay. It's easier to go through the school for a lot of people.", "LOL Some schools suck. My aunt's son is non-verbal autistic and the school moved the only SpecEd teacher in the county qualified to help him to another school as a gym teacher. \n\nJust because you had a good experience doesn't mean everyone does.", "Depends on the school, their resources and criteria. End of the year can be challenging to get all the necessary testing completed. My now 18yo didn’t get an eval until 6th grade. At his 1st grade school the teacher got him on the list but there were so many kids with more obvious issues that they had to deal with.  We switched districts and it wasn’t until 4th grade that an eval was brought up. Not because of the school but because my son showed no signs of having any issues. He got a medical ASD diagnosis at 18. He had gone through the same testing at age 10 with just an ADHD diagnosis.", "Where I live it's a 2 plus year wait for the school system to do testing, or 2500 dollars to have it done through a private psychologist.\n\nIt's not necessarily accessible everywhere.", "Imagine that - different districts and school boards exist all over the place, all with different resources. Without more context all we can do is take OP at their word.", "And it's *faster* to get it done now. My kid is in the process now and they keep telling us it's months faster when school is t in session.\n\nOP needs to get on the stick.", "Depends on your area", "Good for you and your kid, it took 3 years and a suspension for my school to evaluate me. Some schools just don't care.", "And my kid goes to regular public school, but we had to have a lawyer send a letter for them to hustle and get it done within the legally mandated time frame. I think OP is an A and vote ESH, but just because your public school can get an evaluation done swiftly doesn't mean it is the norm.", "This. Once the process has been initiated, there are timetables to get things done. Kids can fall through the cracks if their parents don't give two damns about getting them help, though, so maybe that is the case here.", "> likely haven't put much effort into\n\nSo you're admitting you're making an assumption with no backing?", "Absolutely. My siblings and I all struggle with self-moderating, but they're both ADHD, and I'm ASD/OCD. It can all seem similar, especially at that age.", "I cried, too! I was in the middle of a PhD program when I took meds for the first time, and I thought to myself, _it's this easy for everyone else?!?! All this time I could have lived like this?!?!?!_ It honestly felt like I'd just started playing with cheat codes built in. And my brain was so blissfully quiet.\n\nI'm a little ambivalent about medicating kids, and I do understand OP's reluctance to meds in general. (I, too, will ask myself, \"does this hurt enough?\" before evening taking ibuprofen.) But when you do need them, you should get them.\n\nAnd just getting the diagnosis (if applicable) as soon as possible is important because there are so many coping mechanisms and \"life hacks\" to sift through to see what works for you.", "My kid had the same reaction. She has inattentive adhd and it was a fight to get meds for her.", "Yes. I got the ‘does not apply herself’ too.", "I got diagnosed at 38. It's never too late!", "Me too!!", "I'm sorry that happened to you but also I just wanted to say I love your username", "Oh, I don’t wish I was medicated as a child/adolescent. I wish I was taught good behavioral/coping strategies to help mitigate symptoms when I was younger. Instead, I got a lot of ingrained habits/work-arounds that are more destructive than productive and they are tenacious.", "Not true anywhere I know of. I frequently don’t take my meds on weekends or while on vacation because you shouldn’t have alcohol with them (fast acting so not like they accumulate on your system over days). However I find that it’s helpful to take them as regularly as possible to support building and maintaining routines. There’s also podcasts and YouTubers and you can find behavioral strategies to help. The solution is a combination of everything and a constant process.", "All the doc’s I’ve encountered in the 15 years since my original diagnosis have been (rightly) stingy with their scripts - but this sounds you’ve either gotten bad intel or your doc has their personal guardrails around it. \n\nIf your symptoms are negatively impacting your day-to-day function, definitely talk to your pcp about a referral for a psychiatrist (if you don’t already have one).", "Same boat. I hope you get the help you need <3", "Good point but sharing prescription meds is an indication to me that she’s not thinking about this responsibly and has more than what’s needed. Hopefully she has a good dr that’s paying close attention and treat the kids are at the right dose\n\nI can only speculate from OPs perspective as that’s all the info provided. But you have a good point", "Such a good way to explain and relates perfectly to my own experience! Developed normally outwardly and socially but internally I was a mess for many years.\n\nSocially I was fine in regards to how i interacted with the world, not so much is the activities I was choosing to participate in but it was brushed off as being a rebellious teen, only problem is I didn’t exactly grow out of that phase and I certainly didn’t get out unscathed", "Yes, and OP needs to understand getting diagnosed doesn’t mean you have to medicate. Sometimes having understanding on why we are the way we are is enough to develop some coping skills and sometimes it’s not. But not seeking answers is wrong imo.", "It happens. I'm a therapist and sometimes I've seen kids who genuinely need medication to function day to day. All the interventions in the world and they just don't have the capacity. It can really hurt their self esteem. I had a kid who wanted to leave school or die because he just couldn't focus.", "In the US tramadol is a controlled substance.", "Also according to google tramadol is for pain management so I don't know why you'd give it to someone with anxiety", "That’s definitely possible (speaking as someone who is autistic and has autistic kids) but I get the vibe from OP that she would have said if she thought the school was off base and he wasn’t actually disruptive. She seems to accept that there is an issue and in this case I’m inclined to take her at face value—she seems more to downplay issues than exaggerate them.", "Exactly. Plus, she can’t up the dose without a valid Rx so it’s not like she’s just giving her child adhd med dosages willy-nilly.", ">neurospicy \n\nAs the mom of kiddo on the spectrum, I **love** this. I shall be using this from now on.", "I'm currently getting my 4 yo evaluated for neurospiciness (lol). \n\nShe's never been in formal schooling, between me being a SAHM and Covid it hasn't been on the radar. (My community also doesn't have universal preschool, though I'd like to find room in the budget for her to go to a Pre-K a few mornings a week this fall to get her acclimated to the concept of school routines.)\n\nAnyways, OP's passivity grinds my gears. I noticed when my kid didn't talk, and discussed it with her pediatrician, and got her services for her speech delay until it improved.\n\nI damn well notice that she's a very late toilet trainer, that we can't get through a store without her freezing up and then rearranging at least one display (tbf they're improvements, Carol down at Dollar Tree can't do merchandising for shit lol), that sounds send her into hysteria, that she's a very picky eater, that she gets in her own way and just seems a bit different from other kids her age.\n\nSo once again, time to talk to the pediatrician, and we start the evaluation process tomorrow. \n\nIt's my job as a diligent parent to be a keen observer of my child. And if something seems challenging for her, I need to support her and get her the tools she needs so she can manage her possible spice and be happy. My parents didn't notice my learning disability, I wasn't diagnosed until my mid-30s, I want better for my kid. \n\nSo I think OP is full of shit. I don't think SIL is overmedicating her child, I think OP feels they're being shown up by a diligent parent. YTA.\n\n(Also, lmao I totally offer random meds to people, and I'm totally poking fun at myself for all the drugs it takes to keep me upright. Unless it's ondanestron. I have a bizarre surplus of that and y'all can have as much as you want.)", "As someone neurospicy, I’m putting this on my business cards! 😎", "also girl, I did so many sports and activities and pushed myself to the point of burnout on a regular basis because without them I am so dysfunctional. so, similar. as an adult, I struggle so much with burnout and calibrating balance, like I have no idea how to rest. my boss consistently comments on this and \\*asks\\* me to take days off because she doesn't want me to burn out (fortunately my job is always novel, so I manage it pretty well with a low dose of meds)", "#Because he hasn't been evaluated to be diagnosed", "They are arguing the child should have undergone evaluation already.. probably shouldn’t need public school teachers to make it happen", "I have a lot of experience with that kind of stuff, with autism evaluations, ADHD and dyslexic evaluations because of my siblings and myself, now it’s understandable that a lot of these things take a lot of time but by the sounds of it the school kept delaying the evaluations and op just sat there and was like ‘ okay cool ‘. Op mentioned that they pushed the thought out of their head because it was summer, evaluations take a while but pushing the thought out of your head doesn’t make it go quicker, and honestly just shows a lack of caring for her son and his possible struggles", "Agreed on the frame of reference for normal (for ND), though eyesight should be really apparent unless it’s just lightly fuzzy.\n\nSpeaking as someone who didn’t get diagnosed with ADHD until 23, sometimes it really is a matter of having no frame of reference. My dad is undiagnosed ADHD, my sister is unofficially diagnosed, and it turned out that all of the shared personality traits we just thought we inherited from my dad were all ADHD. My dad likely didn’t get diagnosed because his older sister has it but hers was much more apparent, so by comparison, my dad seemed ‘normal.’\n\nMedication has been a godsend though, holy shit.", "It's easier for them to let it get so bad that a teacher finally stepped in you mean. Schools are stretched very thin in most places. If it's bad enough the school is stepping in it's usually full on neglect. Especially for something like poor eyesight. \n\nIf you pay attention to your child at all you'll notice squinting, moving closer to observe things, failure to immediately notice as you approach ECT. Same with lack of hearing too. Neurodivergences are a bit more difficult....but if you're regularly checking in and doing parenting research or hanging out with any other kids and parents it tends to start being very obvious that your kid might be a bit different.", "OP does not sound like a reliable narrator.", "Yes, exactly. This is the internet.", "Ugh i feel this with my whole heart. Also- the beautiful thing about ADHD meds are you actually DON'T have to take them every day-- so OP can just let her son be a wild, hyper kid on the weekends, summers, etc. and just give him what he needs for school and certain playdates.", "Thank you <3 you as well", "Right-- I'm not saying that it never happens or is never necessary. I'm saying that, in the context of everything else OP has described regarding their SIL, it's not really an encouraging sign of SIL's overall approach to her parenting style or her daughter's disorder. \n\nMy point is that all we have to go off of is OP's description. Whether that description is reliable or comprehensive or not, it's still all that we have to judge off of. And by that description, SIL is, at the very least, treading a fine line of medicating her daughter for her own convience as a parent as opposed to her daughter's actual overall health and need for that level of medication.", "Exactly. In addition, most doctors are relatively strict with prescribing ADHD medications (usually stimulants), especially to children, since higher doses greatly increase the risk of adverse effects. There is little chance that the doctor doesn’t assess and monitor the child’s current condition before increasing the dosage of their medication.", "I can't take credit for it, I yoinked it from someone else on reddit lol", "She’s going to need a Princess Spice crown. 👑", "Omg. Please give me all your ondensetron. lol And yeah, I’ve offered my tramacet to family members when they have a migraine or something. Like… it’s not that big a deal. \n\nOP seems similar to my ex, whom I actually had to TAKE TO COURT to even get her to agree to get an ADHD/ODD assessment for them. And it didn’t even happen until grade 7, and I’m sure she’s going to push just as hard about the medication and I’ll have to take her to court AGAIN. Thing is that ODD can be avoided entirely if they’re medicated already by this age. So that’s a big piss-off.", "\"It's my job as a diligent parent to be a keen observer of my child. And if something seems challenging for her, I need to support her and get her the tools she needs so she can manage her possible spice and be happy. My parents didn't notice my learning disability, I wasn't diagnosed until my mid-30s, I want better for my kid.\"\n\nFuck yeah, mama (or other gendered parental term of choice)! You're doing exactly what a good parent should, and your kid will have a better life because of it.", "Balance? What’s that? 🧐", "I swear, so many people hop on here with their asinine opinions yet we can tell they severely lack reading comprehension when they spout off nonsense like this....", "Different doesn't equal neurodivergent. \n\nAnd yes, schools are stretched thin. But that's not because parents are neglectful, it's because our government refuses to fund them. \n\nAnd I'm sorry but parents are busy. They have to raise their kids, go to work, maintain a house, maintain their relationships, and a bunch of other shit just to get through the day. Not all of them have the time or energy to do research on the side. \n\nAnd by the way, stepping in is what teachers do. It's part of the job. An important one in fact. \n\nAs long as you're taking the teacher's recommendations seriously, which the OP is, then you're doing fine in my book.", "I literally hide bottles of ondanestron in people's bags as they leave my house lmao.\n\nUgh I'm sorry about your ex. My husband can be foot-draggy about things, either because of denial or because he's not very observant (like, dude, do you not see how all the other kids sat and watched the cute little puppet show while our kid faffed about and rolled on the floor?). But I just make the appointments and he gets with the program. I don't have to take him to court.", "haha considering I am manically cycling through reddit twitter and my work responsibilities, in an effort to self soothe through chasing the dopamine... your guess is as good as mine. :P", "Ikr, it boggles my mind", "What is the literal definition of divergent?\n\nAnd parents still need to parent. \n\nAnd stepping in is the job of the teacher. But if they're stepping in for something medical that the parents didn't even notice then the parents also failed. And parents are going to fail. But shitting on someone else instead of recognizing that is where OP really went wrong. \n\nAnd I say this as someone with multiple divergencies.\n\nBut either way I appreciate the discourse and wish you a lovely afternoon as I won't be continuing this conversation further."]}