{"id": 20805, "submission_id": "14l6a38", "title": "AITA for being upset with my housemate for allowing a homeless man into our home?", "selftext": "I 24f live with a housemate, Erin 25f. Erin and I aren't very close and will only talk if I run into her in our shared spaces, living room/kitchen. Erin told me a while back she befriended a homeless man, Sam. She used to give him spare change and started to cook for him, so he would have something to eat. That is completely her business.\n\nHowever, last month she gave him our address and told him he can come pick up food from ours. She didn't tell me this until I found out as we have a ring doorbell, which has a camera that alerts your phone if someone comes over. I normally don't check as I am at work most days and most the alerts are just someone walking by. I am only in the house to sleep or my one day off. Erin knows if I have 2+ days off I usually go see my parents who live in the same city, but it is a long commute so not feasible everyday.\n\nI had a parcel coming last week, so did check the phone alert, and saw Sam at our door. She has shown me pictures of him, so I knew it was him and I was angry she had given our location to a stranger. I confronted her over this as I feel that this is unsafe and uncomfortable that he know knows our address? She told me that he was only there to eat food and stays in the kitchen. Erin argued that I have friends over all the time too, and I am judging him for being homeless. I let it go, but told her that I don't want him to be anywhere near my room.\n\nI went home for 3 days and usually I go straight from my parents to work, but I came last night around 11pm instead as I was scheduled to come in earlier. I found Sam was sleeping in my bed. We have a single bed each and I screamed, waking up both Erin and Sam. I told him if he didn't get out now I would call the police for trespassing. Sam left and Erin is now angry at me and will not speak to me.\n\neta- I was mad that Erin had Sam over before as she didn't tell me about it. When we have people over (especially males as I wear a hijab), we tell the other housemate, but she didn't.", "created_utc": 1687949569, "permalink": "/r/AmItheAsshole/comments/14l6a38/aita_for_being_upset_with_my_housemate_for/", "score": 1228, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > My housemate let a homeless man come in and sleep on my bed when she thought I was out. I came back earlier than expected and threatened to call the police on him for trespassing if he didn't get out.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. I’d email the landlord about this and see about either breaking your lease or getting a deadbolt on your door. This is completely unacceptable, homeless man or not.", "NTA.\n\n>I found Sam was sleeping in my bed.\n\nNot under any circumstances.", "NTA.  \n\n\nWhile I understand your housemate's urge to help another human being, and wouldn't consider that an issue under normal circumstances? Letting a stranger literally sleep in your bed isn't something that was hers to offer, and seems invasive by itself.", "NTA\n\nYes, Erin can befriend a homeless man, and normally friends can be bring over to a shared rental... But the fact she let him sleep in your bed was clearly crossing an boundary.", "NTA\n\nFirst things first, get a lock put on your bedroom door !\n\nReport this to your landlord and get your housemate out. You have no idea what she is up to for the rest of your time away from the house and what other liberties she is taking and allowing others to take with your privacy.\n\nIf your landlord fails to act, I would seriously consider moving yourself as your current housemate has absolutely no respect for you.", "NTA\n\nI'll be honest, my judgement was going a different way until\n\n> I came last night around 11pm instead as I was scheduled to come in earlier. I found Sam was sleeping in my bed\n\nThis is absolutely not OK. Sure, judging a homeless person because they are homeless is very much a violation of rule 1 but your housemate absolutely fucked up here. \n\nYou have every right to be angry, and Erin has no right to be anything other than apologetic. That is a huge violation of privacy by letting him sleep in your bed.", "NTA - he was sleeping in your bed?! Nope.", "[removed]", "[removed]", "NTA- getting upset with someone invading your privacy (both your space and religion) is completely justified.", "Nta\n\nShe had him sleeping IN Your bed.\n\nI do feel sorry for Sam because I doubt she made situation clear-- that you did not know nor gave permission.", "NTA.", "NTA \n\nIt was already wayyyyy over the line to let Sam know where two single girls live alone and completely ridiculous, off the cliff, to let him sleep in your bed!!\n\nRoommate is living in her own world and no regard for safety\n\nAnd also if you wear hijab it is common courtesy for her to inform you if any man might be in your living area, not just Sam. I do not know how strict you are about having men around but you should know, so you can make a decision whether you want to be in the same place or not. \n\nAssuming you have discussed your religious requirements and she has agreed, at the very least she should notify you, because it could easily be the equivalent of blocking you from your own home to have a man there with no chaperone. Or, if you are not so strict, you might automatically remove hijab when you get home because why would you think a man would be there?", "NTA - He shouldn’t be in your room. I would look to find another place to live and definitely call the police if you find him there again.", "NTA - Ok, you were judgmental about him being homeless and coming around just to pick up food, especially in the light of the fact you also have guests in the place you share with another person.\n\nSam sleeping in your bed is a big no-no. I would report your housemate's behaviour to your landlord and ask for the termination of her letting agreement since there's a severe breach of trust. Your room is your private space; no one should enter it without your express consent. Erin fucked up big time since she allowed someone who's a stranger to you to invade your privacy and even sleep in your bed without you knowing.", "I was headed a completely different direction until the bed plot twist. Nope. NTA.\n\nI can't believe your roommate thought that would be remotely okay. I wonder if this is the first times she's allowed this?", "NTA. It’s already bad that she didn’t talk with you about sharing your address with a stranger. But it’s completely unacceptable for Erin to allow Sam to sleep in your bed directly after you told her not to allow him anywhere near your room.", "NTA and Erin needs to deep clean your bed spread", "Nta get a new roommate", "NTA.\n\nYou are right, it is indeed unsafe to give your address and have someone else sleep on your bed?! HELL NO. She crossed boundaries when she let a stranger sleep on your bed.", "NTA\n\nI don't know how receptive Erin is with things, but maybe try to tell her about local resources for the homeless and explain that aside from her generosity OUTSIDE of your home, this is the best way to help him, if that's her goal. She can get him to the right people to get him shelter, benefits for free food, healthcare.  You are not running a shelter and you don't know what this man will bring into your home. For example, when I lived in a women's shelter, the men's shelter on the opposite end of the property frequently had issues with scabies and bedbugs.\n\nI suggest this because even if you're evicting her, you'll likely be stuck with her as a roommate for another 30 days (or whatever duration is legally required to give her). Her giving him free reign is absolutely unacceptable and like another person said, this is only what you CAUGHT. Who knows what goes on when you're not home. Safeguard yourself with preventative measures (locks and a camera), check for theft, and launder everything that was used immediately.\n\nYou definitely don't know the full story about the guy, how often he's there, or even WHY she has taken a huge interest in him. It could be benign, or he could possibly be a connect (drugs). Regardless, the roommate needs to go, you need to protect yourself, and you shouldn't have to worry about strangers appearing in your bed. If you get her to move, hopefully you can make the time between now and her departure as safe and tolerable as possible. \n\nGood luck!", "If she wants help, she should share her own bed.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI 24f live with a housemate, Erin 25f. Erin and I aren't very close and will only talk if I run into her in our shared spaces, living room/kitchen. Erin told me a while back she befriended a homeless man, Sam. She used to give him spare change and started to cook for him, so he would have something to eat. That is completely her business.\n\nHowever, last month she gave him our address and told him he can come pick up food from ours. She didn't tell me this until I found out as we have a ring doorbell, which has a camera that alerts your phone if someone comes over. I normally don't check as I am at work most days and most the alerts are just someone walking by. I am only in the house to sleep or my one day off. Erin knows if I have 2+ days off I usually go see my parents who live in the same city, but it is a long commute so not feasible everyday. \n\nI had a parcel coming last week, so did check the phone alert, and saw Sam at our door. She has shown me pictures of him, so I knew it was him and I was angry she had given our location to a stranger. I confronted her over this as I feel that this is unsafe and uncomfortable that he know knows our address? She told me that he was only there to eat food and stays in the kitchen. Erin argued that I have friends over all the time too, and I am judging him for being homeless. I let it go, but told her that I don't want him to be anywhere near my room. \n\nI went home for 3 days and usually I go straight from my parents to work, but I came last night around 11pm instead as I was scheduled to come in earlier. I found Sam was sleeping in my bed. We have a single bed each and I screamed, waking up both Erin and Sam. I told him if he didn't get out now I would call the police for trespassing. Sam left and Erin is now angry at me and will not speak to me. \r  \n\r\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. Plenty of ways she can help homeless people, this isn’t 1 that is safe, giving your address to him was bad enough then letting him sleep in your bed?! Time for you to get a new housemate, how many other people is she going to give out your address to?", "I wouldn’t care that he’s homeless.  I care about the fact that she lets a strange man into the house and then LET HIM SLEEP IN YOUR BED?!  I would contact the landlord about this immediately because her behavior is not okay.", "Nta. I’m mean if she’s home and they’re eating something in the kitchen that’s simply none of your business but sleeping in your bed is way too much of her. It’s an actually wtf.", "NTA.\n\nApart from the fact that she disrespected you, your needs and your safety by failing to consult with you, the more egregious disrespect came when SHE LET HIM SLEEP IN YOUR BED!\n\nAt that, I'd be looking for another living arrangement, subject to your lease allowing for that!\n\nI would NOT renew a lease with her!", "NTA and do tell the landlord and police.", "NTA. Not even a question.", "NTA- you came home and your roommate had allowed someone else to sleep in your bed? I would immediately be breaking that lease and finding somewhere else to live. Huge violation of privacy and safety.", "NTA your housemate sounds malicious but I was sure when you found this man in your bed. Wow.", "NTA.... she crossed the line with having him in your room. \n\nRules regarding guests need to be discussed befor rooming together.", "wow, NTA forever. even if you take out the homeless part, this is still not okay. \n\nshe doesn't know this dude well enough to just give him your address to come eat at your place whenever he wants or, most importantly, *sleep in your bed*. this is such a weird and unsafe situation.", "NTA....I was ready to say you were a little one for judging him being homeless (at least it came off that way) and your roommate feeding him. Then both of you are. She is not discussing giving your address out and telling him to come by whenever with zero thought to you and your feelings. You still for the reasons about but less than I originally thought. To you aren't what so ever because she never discussed him coming over at all or the biggest thing her letting him sleep in YOUR bed. That's completely disrespectful and jumped miles over the line of ok. See how you can go about breaking the lease or removing yourself and get a new place without this roommate. She can have this homeless person move in and room with her and take care of him all she wants then.", "Nothing like volunteering someone else's stuff.", "This honestly is such a dangerous situation. The roomate is not only an asshole but also short-sighted. She gave way their address to a stranger without a single thought about the dangers of getting robbed or assaulted. \n\nOP NTA but please contact your landlord about breaking the lease. Also try to find another place to rent. This roomate of yours has put both of you in extreme danger.", "Erin needs to pay for the clean and replace the bedding.", "That's where I was at. Full on Y T A until I got to the last paragraph and it switched to NTA really fast.", "Naw. That needs to be tossed. Erin needs to replace the bedding.", "lol you’re right", "NTA. the issue isn’t him being homeless, it’s allowing any non-resident guest of hers in your home while she isn’t there. I had roommates do this with family and hookups and it was awful. she also does not respect your boundaries considering that you wear hijab. it would be the same if she gave a significant other a key without telling you, too. you should have a written roommate agreement that says people can’t have guests while they aren’t there unless it has been discussed beforehand.", "NTA. I can't imagine the horror of coming home and finding a homeless person in my bed!\n\nAs a tenant you do have a right to say who enters your home, and bringing a strange person with likely mental health issues is a danger. Your roommate doesn't know much about the person either. What he has told her may not be accurate. \n\nIt is nice that she cooks for him and takes him food, but she should not have brought him to a  home she shares with others.", "ESH. You are being an asshole because you absolutely are judging someone for being homeless as a risk to you and your stuff when, at least so far, it doesn’t sound like they have given you any reason to be concerned. Your roommate is an asshole for not respecting your boundaries. When you asked them to keep him out of your room and stuff, they allowed him to sleep in your bed and that is not acceptable. Regardless of whether he is homeless or not.", "NTA. Your roommate is. One of you has to have, either her or you.", "NTA and what your flatmate is doing is totally insane and naive. Putting aside the outrage of her letting him use your personal space (I'm a guy and I probably would have gotten violent over this and physically removed him, it's unbelievable) you still have the fact she's giving access, to the home of two young women, to a strange desperate man she doesn't really know. If she needs someone to explain how deeply unwise this is I think she must have some sort of mental health problems.", "NTA, that's a straight up violation. I would have absolutely lost my shit if I came home and found a homeless man sleeping in my bed.", "NTA. Speak to your landlord. And move out or get her to move out.", "100% NTA. Prior to that line, I was thinking this was relatively harmless and thinking maybe OP was the AH, but once it was discovered that Erin has been letting Sam sleep in her bed, absolutely not.\n\nWhich begs the question: How long has Sam been sleeping in her bed? Cause I doubt this was the first time.", "homeless or not, you don't give someone else your roommates bed", "I agree. Most homeless people are not very hygienic and I know I’ll get a lot of pushback on that but it’s true. Who knows what viruses he will be bringing into the house.\n\nWhy didn’t she let him sleep in her bed and she could sleep on the couch. That was just insane to allow him to sleep in your bed. I definitely would let the landlord be aware of this and start looking for another place and another roommate", "I think it is important in this case because he was in her bed using her mattress and bedding. Usually when people live on the streets can carry lice, bedbugs or skin illnesses that can be contagious. \nWas she even going to change and clean the sheets? I don’t think so… Because if OP saw that they were missing she will suspect. \nBut I would be really angry even if it wasn’t a homeless man.\nOP needs to tell their landlord asap and get the other girl evicted.", "I have shared before and we discussed about having people over, but I think no-one thinks about this exact scenario. I mean, I can get he is your friend but homeless people are dirty sometimes… I would be comfortable if someone entered my house in that condition. \n\nWhen you discuss about having people over you don’t usually say, they have to be clean, because usually people take care of their hygiene \n\n\nThe roommate should have asked before letting him in and they should have discussed some rules for that special situation.\n.", "I would immediately be breaking that lease and finding somewhere else to live.", "EDIT: Nevermind. My previous post was incredulous that this was the first line that was worth calling roommate an AH over, but I have since read it again. \n\n> last month she *gave him our address* and told him he can come *pick up food from ours*. \n\n> saw Sam at our door. She has shown me pictures of him, so I knew it was him and I was angry she had *given our location to a stranger.*\n\n> She told me that he was *only there to eat food* and stays in the kitchen. \n\nThe way they phrased it in the whole first half sounded like roommate *wasn’t home* while Sam was there, and that she basically told the homeless man to treat it like a self-service soup kitchen. \n\nI missed the part at the end where OP said her scream woke *both of them* up.", "I'd be pushing for her to supply a new mattress truth be told. Scabies, lice, bo, oily hair, farts etc. I've known homeless and have been homeless. No. Just no. (And since I've had housing I've had people here to eat/rest/shower with the stipulation they clean up after themselves, never just show up, must be same sex, know not to ask for more bc I'm still on a very limited income) you can be kind without putting someone in danger and volunteering SOMEONE ELSE'S BED.", "If they’ve befriended someone they work with and they bring them over so that they cook for them is that an issue or is it only because they’re homeless. I don’t really agree with the comment you replied to but it’s slightly more complicated", "I’m sorry, but people that have been unhoused for long periods of time are almost always in that situation due to very unfortunate circumstances. For instance, substance abuse disorder or untreated mental illness. An unpredictable strange *man* should not be invited into OPs home, the home of two young single women. Pretending this is just like inviting over a friend or coworker is so obtuse and it doesn’t make you seem more righteous to ignore the glaring the reality of what is most likely Sam’s situation- it’s ignorant.", "NTA , had you not gone home unexpectedly would Erin have told you this person was sleeping on your bed. That is the absolute unacceptable part of this, homeless or not. Boundary line crossed big time!", "You are NTA but you still need to go about extricating yourself from this situation strategically.  \n\n-Place lock on bedroom.  Take inventory, if anything is missing, notify police and press charges.  Place all bedding in a bag, disinfect your room and charge your roommate. If utilities are in her name, don't pay your portion until it equals the costs you incurred due to her actions.\n\n-Immediately notify your landlord about a HEALTH and SAFETY issue.  The homeless in the US have high rates of tuberculosis and as others have stated, potentially fleas and bedbugs on their clothing.  I imagine your landlord doesn't want an infestation and costs s/he would incur. Also is he left unattended at your apt when neither of you are home?  Does he have access to a hidden key or maybe memorized the code on a keypad? Your roommate violated your trust and boundaries but roommate conflicts in themselves are not something landlords normally want to get involved with.  More reason to emphasize health and safety.  The landlord is in a better position to possibly terminate the lease immediately for one or both of you, change locks, use her deposit, etc.  Negotiating with your roommate will get you nowhere by the sounds of it.\n\n-There  are other issues such as how often he is around and whether that violates the terms of the lease on an additional roommate, higher utilities, does he bring substances, potential for violence, etc. But these are maybes, you haven't observed yet.  \n\n- Again, get the landlord/property manager involved, document with dates and times of all incidents on paper and submit to landlord, any paperwork from police if they become involved due to any theft,drugs or acts of violence.", "NTA. Please contact your landlord about breaking your lease,  that's a safety and health concern. And she's volunteering your safe space and things to a stranger.", "Definitely NTA. This girl means well but she doesn’t know what she’s getting into by giving a homeless stranger her address. My parents run a soup kitchen from home and the house has been robbed multiple times by the same people they try to help. It’s a losing game. Also JESUS CHRIST she had him in your bed!?!?!? That’s absolutely disrespectful and disgusting. She needs to leave.", "NTA Wash your sheets in the hot water cycle to kill any potential bugs or other stuff. I used to work in a hospital and while I sympathize with homeless, they can pick up and spread things like CDiff and other infections easily. I am assuming that he didn’t use the shower before sleeping in your bed.", "NTA especially if it was in your bed, she can't give your personnal space to anyone without asking you, she have no right to do that. I would personally feel very uncomfortable with this situation too", "I was leaning towards YTA sorta kinda judgemental at first just because he was homeless but wtf sleeping in your bed nah nah f that hahah that's so bang out NTA", " NTA. Erin has completely lost the plot. She can feed him and help him find a place to stay without letting him into your shared home (AND IN YOUR BED!). \n\nLetting him in your home was already a line crossed, but having him sleep in your bed is unforgivable imo.", "NTA. Report her to management.  There’s a new trend of people picking up homeless men to have sex with. It’s a thing now. Maybe your friend is a freak.  I’d call her parents and let them know what she’s doing.", "What makes you think you are in the wrong here?", "NTA and call the police anyway. **he was in your bed** I'd start looking for a new place to live. it's bad enough she compromises security by have a person on no known fixed abode into your home but to let him sleep in your bed? that crosses the line. That is your stuff she's now loaning out. what you pay for in rent.", "NTA I'd get a new roommate. Something wrong with Erin. It's not safe to just bring a man off the street and let him sleep there with her alone. \n\nI wouldn't even give her a second chance. No reason for Sam to be in your bed at all. How dear she? If anything, She should have offered up her own bed or have him sleep on the couch or floor. You don't just give a stranger someone's bed. Smh", "This is such an extreme Goldilocks situation to a T.  You need to report this whole thing to your landlord immediately and document everything.  She has been letting strangers sleep in your bed and eat your food and god knows what else.  NTA", "Omfg 😨 what the hell man. I thought this was going toward you having problems against homeless people...but Erin didn't tell you AND had him sleep on your bed?!\n\nNTA!!! What the fudge Erin", "NTA. Your roommate is a naive idiot.", "NTA! Get out of that lease that’s CRAZY!! I’m so sorry!!!", "NTA\nThis is so dangerous and out of order!", "At first I thought maybe you were unfairly judging him based on him being homeless, but of course everyone is entitled to their opinions.  Then I thought it was very open of you to agree to let him be there with the agreement that he stay out of your room.\n\nThen he slept in your bed.\n\nFirmly NTA territory.", "NTA - even before discovering that Erin let him sleep in your bed, you have the right to express that someone’s presence makes you feel uncomfortable (within reason obviously). Her letting a stranger enter your room is a huge violation of privacy and trust and potentially can expose you to various problems like identity theft and the likes. \n\nYou should speak to your landlord and move asap.", "Why the hell would have him sleep in your bed? NTA!", "He was in your bed?? Omg \nYou’re NTA. That’s ridiculous", "NTA Excuse me Erin let some stranger sleep in YOUR BED and has the audacity to be mad at you? What?", "NTA I would find a new roommate asap. It looks like your housemate already found herself one.", "NTA and also WTF", "NTA.  He was sleeping in YOUR bed?  That's a hell no.", "NTA. Yes being homeless doesn't make him automatically dangerous, and your friend has known him for a while so it is like you having friends over. But allowing him to not only be in your room but sleep in your bed, despite you expressly telling her that is not ok, is crossing a major line, and calls into question how many times your friend allowed that before you caught her. The ETA confirmed NTA even before he was in your bed, as there is a rule that any guests are announced beforehand, so it is not like you having friends over. Contact your landlord, move out, get a new roommate, whatever else you want to do, just get away from that psycho roommate you have now", "1. She intentionally avoided telling you he was coming over.\n2. She lied about him: \"only there to eat food and stays in the kitchen\" \n3. She has no right to offer up your bed.\n4. This doesn't sound like inviting a friend over. There's a difference between inviting a friend over to hang out and giving him a free pass to come in and eat whenever and sleep in someone else's bed. \n\nNTA.", "NTA, I was gonna say yta until the bed thing. Any guest should not just be invited to sleep in a random bed thats not the hosts", "NTA. The man's homelessness isn't actually a factor at all. It's that your roommate gave a stranger full and completely inappropriate access to your private living space. \n\nErin is a roommate you need to kick to the curb. She's not \"compassionate\" to the needy; she's careless, dangerous and unwilling to respect the most basic of boundaries.", "NTA And WTF? She let him sleep in YOUR BED??? That is so creepy. I would report her to the landlord and see if you can get out of your lease and move. And to the people saying he's no different than having a friend over, that is SO NOT the same thing. The roommate doesn't know his history and a lot of homeless people do steal or are on drugs (judge me all you want). It is a really unsafe situation.", "A homeless guy sleeping in your bed??!?!?  Damn, your roommate is a major asshole!  You should move out asap.  Don't trust her at all.  And definitely don't sleep in that bed again, the mattress might have bugs in it.", "This is a horror version of goldilocks and the three bears", "This. Also, OP, I'd let Erin know she can pay the full rent that month since she's renting out your space to other people. No, she doesn't want to do that? Then she should NEVER allow someone in your space. I would get a camera for your room, plan on living with someone else when you can get out of the lease, and REALLY make sure the landlord handles it.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "And tell them some of your jewelry is missing.", "How many homeless have you allowed into your parents basement? Probably none.", "I would contact the landlord about this immediately because her behavior is not okay.", "Sam could be the nicest dude on the planet and I still wouldn't want to find an essential stranger on my bed.", "the legal term is \"A person of no fixed abode.\" he may be harmless or he may not, you don't know and for him to be in OP's bed, god alone knows how often that happened before op caught her.", "She’s been friends with him for months, he’s not a stranger to her. It’s no different than OP inviting a friend over who the roommate doesn’t know - that’s a stranger to her. The only difference is this guy is homeless, which doesn’t make him automatically dangerous. \n\n**The issue is they agreed to tell each other when inviting people over and OP expressly instructed her roommate to keep him out of her bedroom - those are the boundaries that were crossed and that’s what makes OP NTA.**\n\nEdited to bold because apparently people cannot read", "you shouldn't give your room mates bad to a blood relation without her knowing, never mind a homeless man.", "and their food too", "I’d say ESH. She’s still an AH for all the stuff before. Just because the roommate was doing/ended up doing worse doesn’t rid her of the judgement.", "What is wrong with you?", "My parents helped one. My mom helped a homeless guy when I was a kid. His name was “doc”. He was a veteran. \n\nShe took him in, fed him and I played with him as a child etc. Set him up with a home and got him back on his feet. So, one. Wasn’t the basement though. I don’t live with my mom anymore. She died about 10 years ago. I recognize this is hard to fathom, but homeless people are also people. They sometimes just need some help. The issue here was that the roommate was volunteered to help and that isn’t right.\n\nWhere I grew up, (DC), there were a lot of homeless people. I guess I just never stopped seeing them as human beings who are worse/more risky than other human beings.", "Also, I was briefly without a home (few months) and a friend put me up until I was able to get back on my feet so, I guess I am biased.", "For context, I work in the Emergency Department of a hospital in a city with a very high homeless population. A good amount of that population are fairly harmless which is why I didn't have anything against Erin making food for Sam. If anything, it's pretty cool of her to do so. Certainly not every one is harmless; we definitely have a fair amount who have various psychiatric concerns and are considered to be a \"staff safety\" issue, but not every homeless person should be treated like a crazy person.\n\nHowever, I do 100% draw the line at letting Sam sleep in OP's bed (and well before that to be perfectly honest). It's one thing to feed someone or give them your address, it's another to let them fuckin' invade another person's private living space. I mean, fuck, Sam shouldn't have been allowed in OP's room for any reason, let alone sleep in her fucking bed. I would've said NTA if Sam used OP's private bathroom cause that wouldn't have been cool either.", "She wasn't giving away OP's food though.", "Don’t forget bedbugs!! 🫣🫣", "[removed]", "Agree; if Sam was in Erin's room, I would like whatever, It's her problem, but the fact he was in OP's room was alarming", "Yeah it would still even be Y T A for me if Sam was sleeping on the couch (not super cool, but OP was supposed to be away for the night) but letting him use her bed is definitely a step too far.", "People that are homeless are worse off and more desperate than people who are not, on average. It’s not really their fault and there are exceptions on both sides, but that is irrelevant when it’s your safety at risk", "She was allowing a homeless man full access to her kitchen and bedroom.", "A lot of our homeless were put up in cheap motels occasionally and yes, bedbugs were rampant, and roaches in their belongings. It's a shame, but the unmitigated gall of this person's room mate just thinking she can do that would lead me to be...not a nice person.", "Ps you have been reported for being hostile / rude and blocked.", "That’s another time you read poorly and made a general and inaccurate statement about what I am or what I said.\n\nI think perhaps you are the delusional one. \n\nYour general statements about “the world we live in” make me think you have a lot more to learn about it than you currently think you know. \n\nBest of luck. \n\nMaybe one day you’ll be in a position where you are able to learn a few new things about “the world” you think we live in versus the world we all actually live in.\n\nCheers.", "Which for me begs the question: how long has Erin been letting Sam use OP's bed?\n\n\nCause if she only found out because she came home *early*, then I get the sinking suspicion that this wasn't a one-time thing. Not only that, but while a good amount of homeless folks are indeed harmless, I have had to get in a bunny suit to help decontaminate a few with lice, bed bugs, and other creepy-crawlies.", "Clearly you don't know many homeless people", "How were they hostile?", "Tell the landlord that your roommate let a homeless person stay in your room and you don't feel safe anymore. The landlord will either let you break the lease or kick Erin out.\n\nSam might be just a fellow down on his luck or an ax murderer- you don't know which. \n\nSuppose he refused to leave, what then? She not only let him into your apartment but into your private space where anything could have happened. If Erin wants to play 'Save a homeless person' she needs to do it in her own place.", "Ok.....I was somewhat in agreement with Erin. **BUT THAT STRANGER WAS IN YOUR BED?!**\n\nNTA NTA NTA NTA NTA NTA NTA NTA NTA NTA", "ESH. Except for Sam. \n\nYou call him a stranger but also say she befriended him over time. You may not know him but as stated ur roomie doesnt know your friends whom u bring over without discussion...\n\nYou accetped him being around and set the boundary of not allowing him in ur room but he was in ur bed. Your roomie seems to not want to inform him of ur didcomfort. Which puts Sam in a uncomfy spot, at risk of having police called on him when he may not have been aware of said boundary.\n\nI would take the chance to get to know sam if possible. Tell him directly of your boundaries, cause honestly ur roomie doesnt seem to want to do it herself. Him being homeless doesnt make him a criminal or unresonable person. And having him on security footage is already insurance if anything goes sideway, i dont see it being wrong to discuss with him directly again given that ur roomie is not following thru.\n\nSorry ur in this situation. Seems so damn stressful.", "NTA\n\nComing over and eating in the kitchen...okay, she's got a fair point about you having friends over in your shared spaces as well. \n\nSleeping in your bed...no.  That's not even a discussion.  I'd be looking to terminate the lease.  That's a huge invasion of your personal space.", "They are friends. Yes, friends stop by sometimes, but to invite him to sleep in your bed is not ok.", "NTA. She let a guest sleep IN YOUR BED. Would she even have told you if you hadn’t found him?! That’s gross!", "NTA. I was thinking you are 100% TA right up until the sleeping in your bed thing. You're totally justified for being mad about that. \n\nY kinda TA for the way you were judging and being shitty about your housemate bringing her friend over, when you do the same thing with your friends.", "She has a lot of nerve to be pissed at you. How else were you supposed to react to a stranger sleeping in your bed. Ask her why she didnt let him sleep in her bed. She needs to go, that'd be a deal breaker for me. She's the huge A.", "NTA. Burn your bedding and GTFO of there ASAP. Your roommate is beyond inconsiderate to the point of narcissism or even maliciousness. No good can come of living with such an individual.", "NTA, OP. \n\nI deal with a lot of homeless here in my home city and sometimes they don't wash, they can have bugs, or skin related issues. Its time to go to the Landlord because this could become a greater issue.", "NTA! This wouldn’t have been okay even if it was Erin’s twin sister, someone with a home that she had known her whole life, because it’s your bed. It’s not okay to share your bed without your permission. It’s extra worse, in my opinion, to allow a man to sleep in your bed when you’re a hijabi. You need to escalate this to your landlord immediately, because she will continue to stomp all over your safety and boundaries.", "NTA. The only person who has a right to allow someone to sleep in your bed is YOU. This is a breach of trust and completely disrespectful.", "NTA. To anyone who doesn't see a problem with the roommate giving out her address without asking first, is completely oblivious to the massive boundary that was crossed. Yes, homeless people are human beings that deserve to be treated with respect and have the same rights that we all do. However, it's very fair to have concerns that there may be mental illness that you're unaware of because it's either episodic or currently managed with medication. If you live alone and are comfortable with inviting the unknown into your house, that's your business. You don't get to make that decision for others. If you want to help, do it safely. Arrange to drop off food at public spaces, help to put him in touch with people qualified to care for homeless individuals.", "NTA - I thought you might be a bit extra but then he's asleep in your bed.", "NTA. Your housemate crossed a boundary. Homeless or not, it's your bed! Communication is key.", "NTA You need to get the hell away from this crazy girl.....she will get you both KILLED.....GET AWAY AS SOON AS YOU CAN......even if it means going to your parents !!!!!", "Sleeping in your where now? NTA 👎🏾", "What she couldn’t give him her bed? Dafuq", "Oof. The picking up food was one thing- but to let him sleepover and in your bed? Oof. \n\nYou're NTA. She is and it's dangerous.", "I was Y-T-A until he was in your bed. Ditch the roommate.  NTA.", "NTA. She didn’t just let him into your home, she let him use your bed. That’s just wrong!", "I don't care if it's the Virgin Mary and Sweet Baby Jesus, if I found them in my bed at night I would scream too. Private! Space! Is! Private!", "NTA That is so scary and so dangerous! \nTell the landlord and see if you can break your lease because that is NOT OKAY!  Absolutely horrific behavior on your roommates part.", "Man, your housemate is on a fast pass to stabby town as naive as she is. Who the hell lets a homeless man sleep in their roommates bed. Nta, call the landlord asap.", "The only issue here is that the roommate didn’t tell her and didn’t respect her boundaries of her room so NTA", "If she’s so worried about housing him, she can get her own apartment and let him sleep there. He does not belong in your bed.", "NTA, And I give your roommate two words; Elizabeth Smart.\n\nCompletely unacceptable that your roommate allowed someone else to sleep in your bed.", "Ugh. Check your bed for bedbugs. That's such a violation. I'd either be looking to get her out of the apartment or to move myself. She is sneaky, thoughtless and irresponsible.", "And where else has Sam been sleeping? Does he have bedbugs? Scabies? Lice? Worse things? I'd be bleaching the hell out of every bit of bedding using lots of borax and whatever else I could think to throw in the wash.", "Holy shit I would have to politely ask them to engage in fisticuffs if that happened to me, WHAT THE FUCK", "thats a fucking biohazard", "Ew. My bf’s dad has tried to befriend many homeless people (he’s not financially or that mentally stable) and it’s gotten him robbed. Even if this guy is okay how can OP be sure his friends are and that he doesn’t give them their address as well.", "Garbage. Erin had no right to volunteer OP’s bed to anyone! And OP had a right to get pissed\n\nHow you reached your illogical verdict is anyone’s guess!", "Giving your address to an acquaintance and inviting them over is a normal human interaction. It’s what most housed people do. You meet on neutral ground, get on, ask them to your place to hang out. \nWe call it ‘making friends’ and yes, there is a background level risk, but imagine going through life without friends or partners because you’re too scared to invite anyone in. \n\nWhere roommate is completely in the wrong is letting someone, anyone sleep in a roommate’s bed. Let them sleep in yours. Offer them the sofa if you must, but your roommate’s space is off limits.", "And a lock for the door", "Same can be said of any friend you have.", "I honestly don’t want anyone but me and my partner (sometimes the dog) in my bed! Homeless, stranger or someone I know… Big NOPE!", "There is no universally accepted legal term of \"a person of fixed abode\" as homeless", "In fantasy world roommate might be right for letting homeless guy in house. In real world it is completely dangerous and OP should move out", "I was about to write something in reply to this comment but I guess the downvotes are enough.", "I've seen it on police reports in the UK and the Bronx.", "Being unhoused doesn’t make a person dangerous. If you don’t know any unhoused people, you probably haven’t listened enough, because chances are that you do… they just don’t feel safe sharing with you. \nThey may be couch surfing, camping, or sleeping in their cars but still turn up for work or school on time and you’ll never guess. \n\nTo the roommate, this isn’t ‘homeless person’. It’s Sam.", "Yes she was, read the post.", "Honestly don’t get the downvotes. OP was shitty for multiple reasons including the judgmental attitude of homeless man bad and getting mad at roommate for inviting him over at all. Acting like he’s a stranger was odd too. Stranger to her sure, but not the roommate at this point. Being controlling about who can come over based on her not having met the person is AH behavior unless they agreed on mutual meetings elsewhere first (didn’t see that anywhere). Roommate definitely should not have let the person sleep in her bed and should have said she had someone coming over. Hence my ESH. That rating doesn’t mean they are equally assholes, but that they both suck.", "I was just homeless cause I had no safety net. It took me a long time of working while living in a tent and showering at the gym to get my first place. It was the hardest thing I've ever done.", "How is a substance abuse problem a \"very unfortunate circumstance\"? They literally do it to themselves.", "Because it’s often systemic. And people who are systemically exposed to it are often systemically less likely to be supported in overcoming it. That doesn’t mean giving them a free pass, but it’s worth acknowledging.", "NTA\n\nAlright op you were a bit harsh with the doorbell situation but i'd also scream if I saw a homeless man sleeping in my bed and the fact your roommate let the man sleep in your bed after you specified to not let him is concerning if more stuff like this happens I'd concider getting a new roommate", "This is ridiculous. She can befriend whom ever she likes but wth would she let him sleep in your bed ?! That’s crossing a hard line and honestly wouldn’t feel comfortable continuing to live with her", "[removed]", "NTA! My dear you are not the A hole but you are in an unsafe situation.  \n\nYour roommate has ZERO respect for you in any way and is displaying an indifference that borders on pure Hostility.   Giving someone permission to sleep in a bed that is not your own is beyond disgusting and would fill me with enough rage that I would erupt into a total volcano if it were my bed.  For it to be someone you don't know and an \"unhoused\" individual would just be 10 times worse.  You must remove yourself from this situation.  This is not normal.  This is not what people do, even those who are not \"close\".", "Regardless of your view of OP not wanting a stranger showing up randomly, you have to take in to account OP is a Hijab wearing muslim so her roommate disrespected her religion by having an unrelated male potentially alone with her without previously discussing it! \n\n\nNTA", "Nta. In your bed? Absolutely not.", "Time to get a new roommate. This must violate your lease (if you have one). Report her. \n\nNTA", "NTA homeless or not she let a stranger in your personal space and in your bed.", "I am someone who struggles to not give, give, give. However, I now live in an area where there are far too many people to give to, and I do not have enough to give. I understand where your roommate is coming from, but there has to be a line drawn. Just the other night I had a man ask me for a place to stay because what is known as the dope spot motel was full for the night... and this man was not an oddity. It happens a lot. Have I ever said yes? NO!!! I would never put my partner at risk like that. \n\n&#x200B;\n\nYour roommate, even if she doesn't care about herself, should not put YOU at risk like that. This isn't even solely based on the fact Sam is homeless; it is based on the fact he is a STRANGER. But the fact he is homeless matters, because many people in desperate situations will do desperate (and dangerous) things. Not to mention, sleeping in your bed is just plain wrong and gross, regardless of if he is homeless or not. Wash your sheets 10X; you don't want bed bugs or scabies... or random human juices. UGH. NTA", "Time to find a new place to live.  I can't tell you how dangerous that is", "NTA. It seems like you and Erin normally give each other prior warning when you have guests over. If this is the case then it's reasonable for you to be angry at Erin for disrespecting this rule, and for letting her friend enter your room and sleep in your bed. \n\nYou might want to look for a new housemate, because it sounds like this one doesn't respect your boundaries.", "Go invite 20 or 30 homeless to dinner and sleepover with Erin.  They are friends.", "Nta. The moment I realized he was sleeping in your room, my opinion of the situation changed. Get a lock for your door and contact your landlord.", "NTA. Your friend is a moron.", "NTA. Wow you have terrible roommate, I am sorry. Definitely call the managers of your living space, that is absolutely not okay.", "NTA.  Kick her out and give Sam her room.", "NTA\n\nOMG I would freak out.", "I was prepared to call you an AH until the bed part. After that you are firmly NTA. Erin is allowed to have guests over and not having a home doesn't automatically make a person bad or dangerous BUT BEING IN YOUR ROOM AND SLEEPING IN YOUR BED??? OH MY GOD", "what the fuck she let a random stranger into your room and your bed", "NTA.\n\nThe audacity of your friend to think that it's acceptable to let a stranger sleep in your bed... Wow. 😯", "Right?! I was so ready to call OP the AH until that bit (the info about her not getting warning when a man would be there as a hijabi was also enough to make her NTA) if it was just him coming in and having a meal, as OP's roommate said, that would be one thing. But she literally let him SLEEP IN HER BED?! I would feel ill if anyone slept in my bed without permission.", "It's not crossing a boundary. She did it on purpose", "So if you found out your daughter's roommate was letting homeless guys in house, you would totally be cool with it? Be honest", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). If we’ve removed a few of your recent comments, your participation will be reviewed and may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "I'm going to let some homeless people know your address and to stop by for a sleepover anytime. I'm sure you would love that", "That was my thought process as well. OP is ok to be cautious but she shouldn't also look down on someone because they are homeless. If she has friends over, then the roommate can too. But when I got to the part where the roommate was letting her friend sleep in OPs bed, that was an immediate NTA for me. Roommate is a huge AH.", "Call me anti homeless all you want but if I was OP i would be getting mace/taser or move out", "Unless you let homeless people live in your house and you would want your daughter's roommate to let homeless people sleep in their apartment, you probably shouldn't shame others for not wanting to either.", "You have clearly misread my comment.", "Where did i say the roomie had a right to offer OP's bed? /:\n\nI simply suggested OP go straight to Sam n set the boundary with them directly, cause obvi roomie isnt gonna do it.\n\nI never said they werent in their right to be upset. Their boundary was crossed. Im the type to assume ignorance before malice; Sam may not have been made aware of OP's room bein a no-go-zone\n\nI jus feel OP has immense distrust of homeless people simply because their homeless, that is why i said e s h. And a way of ridding that distrust is by getting to know people, even rudimentarily by setting boundaries n seeing how they react to it. Assuming Sam is ignorant of the beef he may have misled to believe the bed was an option for him. If he was aware, which isnt stated as of me reading it, then i will happily change my verdict", "Two words: Bed. Bugs.", "A friend of mine lived in a communal space in SF with approx 15 other people. There was a super nice, friendly, young homeless guy who lived on the block who they interacted with on a regular basis. They 'knew' him for at *least* 6 months or more. \n\nOne of the housemates allowed him to come in for meals. They had a house meeting & voted to offer him a free room (closet sized, not much more than a bed). My friend was furious because she paid rent/bills every month & had been out-voted at the meeting (she voted No). She had spent 5 yrs as a homeless drug addict in her early 20s, so it's not like she couldn't empathize with the guy. \n\nThe man didn't have a job & spent a good portion of the day hanging out on the couch in the shared space, smoking weed. He'd rummage through the fridge & eat whoevers food he wanted. Soon after, he began to invite his street friends inside & 2-3 more strange men would be hanging out on the couch with him. Others began to hang around outside the front door, asking for cigarettes, change & food. The guy then moved his girlfriend in, who had a crystal meth problem. They smoked meth & fought constantly in his room. He'd scream obscenities at her, calling her a 'b***h, etc.. this all happened in under 1 month. \n\nNone of the housemates felt they could ask him to leave, I believe many were too scared. My friend wanted to but was told that she 'needed to attone for being a white woman and telling him to leave would be racist' (he was black). Apparently, some housemates felt they were taking anti-racist action by giving him a free place to stay/food, that was the initial idea. I'm unsure why his white methhead girlfriend was allowed there tho. \n\nThey amended the situation by trying to charge him rent. Nothing changed, he didn't pay. My friend felt unsafe and moved out. Last she heard the guy left after a few months, owing them money, of course.", "There is a difference between letting someone into your home who you know via friends/family/work and a person who is homeless who you know nothing about. Many homeless people are in bad states through the tough economy. But not all. Unless Erin knows this person has zero mental health, addiction, serious illness issues, she has no business taking them into a shared flat let alone giving them OP's bed. It is irresponsible and potentially dangerous.", "he had NO business what so ever being in ops room and especially being in ops bed! its roommates friend and the person should have been in that room with the roommate. the roommate is in the wrong for not respecting the boundary that ops room be off limits to others that visit.", "Even if he were a close friend, what makes it ok to allow him to sleep in her bed when she was explicitly told he wasn't to be near her space?", "The ew was to letting someone sleep in her bed without her permission. Which is a crossed line no matter who it is yes. But in this situation if another person in dire straights laments to Sam who informs them of this nice girl who helps him out and sends them her way that is a bit of a different situation than a friend in need. Because even if Sam is not in a bad way that makes him particularly desperate he could think he’s helping someone out who’s like him rather than someone who might take advantage. Erin is also being shortsighted in my opinion. And reminds me of my bf’s father, a man in need who his kids have given up gifting even a nice coat to because he gave it away to someone homeless rather than take care of himself first. Erin is concerned with helping this man at the expense of her safety and her roommates, as well as OP’s comfort and personal space.", "People in desperate situations do drastic things. You are way more likely to be robbed by someone in a desperate situation than someone in a stable situation. Just a fact of life, even if you don't like it", "You were going to say YTA until bed part right? If not I apologize. If so, if you think young girls should let homeless guys come over willy nilly you are a terrible role model snd are setting up these kids for triuble", "So he was an ass. But think about how many people we hear about on this community who are just as lousy, but start out housed and go on mooching off their friends/family/partners/roommates anyway. \n\nAnd once this guy had moved in, he was technically ‘housed’ and just as much of an ass as before. \n\nSam’s only crime seems to be to have believed roommate when she said ‘you can do x’. And I cannot condemn him for it. I’d be equally pissed to find Sam in my bed than one Andrew Albert Christian Edward, because money and housing status are irrelevant here.", "But they're all innocent sweet flowers who the world destroyed and don't do anything wrong!/s. And feel bad for your friend but those roommates deserved everything they got", "[deleted]", "Unless you let homeless people live in your house and you would want your daughter's roommate to let homeless people sleep in their apartment, you probably shouldn't shame others for not wanting to either. And people inviting normal friends over is nowhere near the same thing as letting homeless people sleep over and you know it", "I wouldn't want anyone named Sam, Fam,  Jam or Tam sleeping in my bed without my permission.", "I honestly hope you have roommates/people looking out for you because if you are this painfully naive you are in danger", "In court and legal reports it's usually transient, unhoused, or houseless person not a person of no fixed abode because nobody wants to say that mouthful. There isn't a universally used term but there are preferred ones.", "Nowhere near on the same scale. The overall rate of criminal offenses was 35 times higher in the homeless mentally ill population than in the domiciled mentally ill population. The rate of violent crimes was 40 times higher and the rate of nonviolent crimes 27 times higher in the homeless population. https://www.crimeinamerica.net/the-homeless-are-far-more-likely-to-commit-crimes-and-to-be-victims/#:~:text=The%20National%20Institute%20Of%20Health,higher%20in%20the%20homeless%20population.", "It's because you are talking out of your ass. Something tells me you don't let homeless people in your house and wouldnt want your daughter's roommate letting homeless people sleep there either. You are just trying to give the PC answer and act all high in mighty because it's a person you don't know", "She was judgmental, and that's on her. But for all the rest she has no fault. Being the cohabitant of a flat she has a say on who enter the premises. The lease she signed and the current state laws on the matter give her all the rights she needs to bar entrance to anyone she doesn't want to.\nHer flatmate breached her trust, her privacy, and she made shared accommodation umbereable. Being protective of someone's own domicile doesn't equal to being an asshole. There is fault on her casting judgments on someone she never met, but she's a human being and as such we all have our flaws. What's absolutely inconceivable, is someone willingly betraying the necessary trust relationship needed for sharing accommodation, as well as someone else's personal space. That's illegal, and hopefully her flatmate will bear the consequences of such idiotic behaviour.", "If someone I know and trust needs a place to stay and I have the space, of course I let them stay. How is this even a question? \nSo far, no-one has outstayed their welcome or taken advantage. \n\nI would want my daughter and her roommate to make informed decisions about who they invite to stay over, but meeting someone at breakfast and asking ‘who are you’ is not exactly unknown in student living. \nIn fact, I’ve never lived in a flat share where that didn’t occasionally happen. \n\nSam isn’t inherently untrustworthy because he’s unhoused. Sam is an individual.", "I don’t want anyone of any gender (or whatever other characteristic) sleep in my bed without my permission, either. I don’t want them in my room, and that part was never under discussion, just the idea that he’s less safe because of his housing status. \n\nMaybe I know too many people who got kicked out for lousy reasons, such as ‘you’re 18 now’ or ‘I don’t like LGBT people, even if they’re my own child’. Plus people who would rather be unhoused than in an abusive relationship. And people whose housing fell through for whatever reason and who cannot rent in a very competitive market without saving up.\n\nWe don’t know what Sam’s backstory is. His housing status is irrelevant to the problem of ‘roommate let someone sleep in my bed’ (ugh).", "[deleted]", "Yeah and none of that conflicts with what I said. Her getting mad and yelling at the roommate for giving the address to someone? That’s still asshole behavior. Like it or not. She can’t unilaterally ban someone from the shared home just because she doesn’t know him. Unless that’s in the leasing/roommate contract, no she cannot. She has a case with it after being allowed to sleep in her bed though. Hence why all her previous actions are still AH.", "She's known him for a month, and he's been homeless the entire time. The fact you are treating this like inviting a friend from school over shows how naive you are. Guaranteed you find out a homeless guy was popping into your daughters house because roommate clearly has mental issues you would take her outta there so fast their heads would spin. But since it's someone you don't know, you are just acting high and mighty and shaming them for being completely reasonable", "There's a reason no good deed goes unpunished, nice ppl finish last, and look out for number 1 are all sayings. You gotta look after your safety first and foremost. If you went to a downtown city everyday and let a different guy come to your house you wouldn't last a month without being assaulted or at least robbed", "My roommate's black, so ya. And 99% of homeless people have a reason why their homeless, either drug addiction or mental illness.  The black comparison is so stupid and racist it's absurd. And I hope to god your daughter has someone in their life that actually wants to keep them safe so they don't end up like these poor people. Ask them now what they think about letting strange homeless men in their house. All in last 2 years:\nhttps://www.the-sun.com/news/1875000/homeless-man-sexual-assault-woman-thanksgiving-florida/amp/\n\nhttps://www.brainerddispatch.com/news/homeless-man-charged-with-raping-minnesota-woman-who-let-him-stay-at-her-house\n\nhttps://www.foxnews.com/us/utah-womans-throat-slit-by-homeless-man-who-she-let-into-her-home-to-take-a-shower-police.amp\n\nhttps://www.mylondon.news/news/uk-world-news/evil-homeless-man-raped-woman-26602273.amp", "You both live in fantasy land where unicorns run around and noone ever gets assaulted or robbed. Do I want to help women in middle easy? Yes. If I was a woman Should I go to the streets of Egypt or Iran and protest in the nude to fight the sexism? Absolutely not, you are asking for trouble. Same applies here. I am sure there are some homeless people with hearts of gold, but hand em some food or money or buy em a hotel room, don't put yourself in danger", "She’s known him longer than a month and him being homeless the entire time doesn’t speak to his character at all. Don’t say that as if someone is inherently not worth your time just because their circumstances have ended up in homelessness. There are millions of reasons people end up homeless, not all of them even bad decisions; stop being a snob\n\nAnd yes, I have let homeless people stay in my house before. So I’ve practiced what I preach", "Dunno sounds like you're stereotyping to me. Clearly Erin has known him for a while and trusts him. It's not a random person she just met as explained in the OP. Obviously she shouldn't let someone sleep in OPs bed, but there are plenty of homeless people who are just normal guys under hard times.", "And plenty of homeless guys like this. \nAsk these what they think about letting strange homeless men in their house. All in last 2 years: \n\nhttps://www.the-sun.com/news/1875000/homeless-man-sexual-assault-woman-thanksgiving-florida/amp/\n\nhttps://www.brainerddispatch.com/news/homeless-man-charged-with-raping-minnesota-woman-who-let-him-stay-at-her-house\n\nhttps://www.foxnews.com/us/utah-womans-throat-slit-by-homeless-man-who-she-let-into-her-home-to-take-a-shower-police.amp\n\nhttps://www.mylondon.news/news/uk-world-news/evil-homeless-man-raped-woman-26602273.amp\n\nBut lets make your house a homeless sanctuary. And your daughters. Whats the big deal?\n\nYou should be ashamed of your shaming leads to one naive person letting a homeless guy there and get attacked. Bloods on your hands", "NTA\n\nThat is a major security issue and you need to put a stop to this ASAP. There are other organizations that know how to screen and properly offer help.\n\nHomeless people spread word very quickly- soon others will show up for freebies. \n\nSource- I used to work with organizations that assisted the homeless", "NTA, she violated your trust and privacy. Report her. She needs to face the consequences.", "You are judging him for being homeless but sleeping in your bed is absolutely not okay", "NTA. I'd have gone nuclear on her. I'd have called the police too! She was wrong for giving out your address without your permission. She was wrong for letting him sleep in your bed. Since she was offering, why didn't she offer him her bed?!?!\n\nI hope you can break your lease and it doesn't matter if she never speaks to you again. She's a walking danger!", "NTA. Roommate needs to pay for locks and NEW mattress and bedding", "NTA She shouldn’t have allowed Sam to sleep in your bed.", "NTA. \n\nYou should have mentioned being hijabi and the lack of clarity on having Sam over earlier. It changes things. \n\nThe fact that she didn't respect your room and space is a massive issue, it's so disrespectful. \n\nThere was nothing wrong with her feeding and befriending Sam. But she should have been giving you a heads up that a man was about to come over so you could put your hijab on. And she should never have let him be in your room.\n\nContact your landlord. Tell them that you're not happy and don't feel safe because your room is being used to house a homeless person against your will whenever you're away. Ask to break the lease.", "NTA Even if he wasn’t sleeping in your bed, your roommate giving a homeless man your address and letting him come over to use your kitchen whenever he wants without consulting you is insane", "What the actual fuck \n\nNTA \n\nYour roomie is insaaane\n\nThat's not cool", "NTA, allowing him to go into your room at all, let alone allowing him to sleep in your bed is not even a little acceptable. Not even the couch, your BED?!", "This was taken from a Tiktok, or [the TikTok](https://www.tiktok.com/@saaaarrrrraaaah2.0/video/7249336209619586310) was based on this story. \n\nEither way, I'm not buying it.", "The only reason you're NTA was the part right at the end. No one should be in your room, especially your bed, without your permission.\n\nYour roommate has a homeless friend. It wasn't a random person she met. She had multiple encounters with him and felt safe enough to have him over for food. If it wasn't for the ending, you were definitely YTA.", "ESH. it definitely sounds like you're judging Sam for being homeless. your roommate was home every time he was there, she seems to know him decently well on a personal level, and is trying to show kindness to someone struggling. even when that's all it was, you were upset. if it was someone not homeless, it seems as if you would not be reacting this way because he is NOT a stranger to Erin, he is just homeless. your roommate sucks for letting him sleep in your bed but the fact that you seem to have such low views on homeless people makes you forever the bigger asshole in my eyes.", "Hijacking top comment in the hopes that OP sees this - OP CHECK FOR BED BUGS.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). If we’ve removed a few of your recent comments, your participation will be reviewed and may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "He wasn’t a stranger when he was invited over for food, she’d befriended him. Some of the best people I know have had spans when they were homeless, the only issue in the first incident is that they usually tell one another when they’re having guests. But letting him into OP’s room (and bed!) was so incredibly inappropriate I’m at a loss for words.", "Living in a shared house resulted in a roommate stealing my underwear. (Technically, he stole my laptop bag, which contained my computer and two pairs of undies. But he gets to be the panty thief to the end of time.) Does this mean you should never live with roommates?", "The nicest dude ever wouldn’t sleep in someone else’s bed they knew didn’t want them there or without their express permission \n\nI mean I’m sure the guys desperate but", "He's a stranger to OP, whose BED he was in.", "This. They agreed to give each other a heads up with guests and the roommate had no business letting anyone sleep in OP's bed. I think it's safe to assume that the roommate planned on having Sam out before OP came home which is another huge violation. I don't want to sleep on the same sheets as someone I don't know whether homeless or not. The rest may add to the drama but is irrelevant. OP is entitled to have her room remain private and is NTA for expecting that.", "He was in her fucking bed! No. No. No.\n\nYou don’t have some rando sleep in your roommates bed!", "Yeah this post confused me at first because \"if she knew him for awhile on the street  how is he a stranger?\" But then I got to the bed part! Oh absolutely not.\n\nBut if I was making friends with someone I gave change to now and again, it wouldn't be far fetched to he like \"Hey you know Sam, the guy I've been having lunch with? I invited him over for a shower and a meal!\"\n\nBut also none of my family in my house wears hijab and that would also totally change things. If someone did it would he a bigger issue FOR SURE.\n\nI don't think homeless folk (they're just people) deserve to be treated like \"a homeless person\" until they have a house, but I also don't think you should bring your male friends around to women's safe spaces and let them sleep on their bed!!!!", "& where did I say he did?!\n\nI absolutely said that the OP was NTA and was not in the wrong because the roommate failed to behave in the agreed upon way and allowed their friend in OPs room. I literally said it was wrong of the roommate.", "& I said it was an issue that he was in her bed and in her space in general!", "It can be dangerous, but we don’t know. Erin seems to be his friend and we have no reason to assume he is dangerous or in poor mental health other than he’s homeless. Which in my city people with full time jobs are homeless because of the cost of living. \n\nI just said we are jumping to conclusions without all the info.\n\nObviously it can be dangerous. My cousin invited a homeless guy to live with her and he spent a year slowly poisoning her by putting poison in all of her pantry food. I just Said we don’t know.", "Where did I say it was okay for him to be in the bed? Show me.", "Exactly this, the roommate was totally gonna usher him out and not tell OP which is such a big violation, no matter who it is!", "Tell me where I said that was okay? Point to it.\n\nI clearly said it wasn’t okay", "Oh damn it hit me as someone who's been homeless - it was the desperation. If I did horrible things it was out of desperation. When I stole food to eat, or took drugs in the end. I was desperate to eat or stop feeling or just desperate to be left alone to die in my ditch.\n\nI have housed other addicts until they get a place and I can tell when someone uses it for help vs takes advantage... but I never clocked it was the desperation. Sometimes it was desperation to get on their feet and quit, so they'd be shaking vomiting on my couch, poor beans. Sometimes it was desperation to have money, so a couple things got pawned by one person, which still bugs me...but it was desperation. I know it was. I know I should have known the person longer.\n\nThose of my friends who were recovering on my couch I had known from the streets for awhile.\n\nAt some point though on the streets you get your \"crew\", and you know who will have your back through a drug addled crisis and who won't. And I've had massive panic attacks where my home(less)boys helped me. So now when they need a couch  I've got one for them.\n\nDesperation. Damn.", "That particular guy (in my friends sitaution) was definitely an ass but you gotta wonder if being an ass is possibly the reason he was unhoused in the first place. \n\nThere's just a higher chance a person without a stable home has severe issues that would make them more of risk/danger in some way. To say otherwise would be denying that mental illness, substance abuse, etc. put people at higher risk for homelessness in the first place. \n\nIn OPs post, I didn't catch if the roommate actually gave him permission to sleep in OPs bed or not. I just read that OP found him there & started yelling. If the roommate allowed Sam to sleep there, that's actually bonkers. Doesn't matter who the person is or where they live, the roommate had no right to let anyone into OPs personal space like that. In that situation, the roommate is the more dangerous person who doesn't understand boundaries & Sam didn't actually do anything wrong.", "Ngl I was homeless because (edit whoops, not because, as well as) I was a drug addiction once. It was because my mother kicked me out after I finally went to the police about what she let her boyfriends do. I got on drugs to cope. It was cheaper than food.\n\nIt was actually thanks to one guy, who wanted nothing from me, but paid for a few basics for me to get on my feet. I quit drugs then because I no longer was in so much stress that I used. I had a job, and an apartment, etc.\n\nThe trauma still gets to me sometimes but now I'm on legal drugs for that.\n\nBut I also don't have two women, one who wears hijab  living with me. That does definitely change things.\n\nBut my partner and I have house addicted homeless folk. I think a bonus is I know the situation so I know what people are like behind the drugs. We've had one problem from this, but out of 4 times we've let someone stay with us to sober up and get an apartment.\n\nI understand why folk don't want homeless addicts living with them too. I do. It just makes me a little sad cause sometimes, like 17 year old me, you just need that two weeks from someone/anyone to get back on your feet.\n\nBut that is definitely not the job of two women who live alone who haven't discussed this, especially one in niqab.\n\nAnd yeah most of the other folk on the street? We're not on drugs. Like you.", "I think it goes both ways: certain factors put you at greater danger of homelessness and being unhoused can fuck up your radar for what’s ‘normal’ and ‘healthy’ and ‘acceptable behaviour’. The methhead girlfriend, for instance: most people would not invite her into their space. \n\nI read the original post as roommate invites Sam, let’s him sleep in OPs bed, OP flips out. Which I would have, too. Roommate is the root of the problem. She could have invited anyone, rich or poor, and it would have been inappropriate, but it’s the ‘invite into OPs space (room, bed)’ that is the transgression, not ‘invite a friend into her own/shared spaces’ (kitchen, living room). \n\nSam is Schroedinger’s guest: we don’t know whether he manipulated roommate or whether he simply accepted her invitation. For OP, it makes no difference, but I choose to give him the benefit of the doubt.", "Yeah cause I’m not a dick who stereotypes people. You’re more of a danger to raping your daughter than some random homeless dude if we want to go based on stats. They’re both assholes. Just admit it and move on.", "I will absolutely not admit that and I never will.  So if OP was your daughter, you would be totally cool with her roommate letting strange homeless men in the house late at night? If you say yes you're blatantly lying and should be ashamed at being such a hypocrite and shaming this poor girl for pritecting herself just for some internet PC points.  The only way OP could be considered an asshole is for not getting out of there second she told him address. Tell your take to someone in real life, not on internet, and I guarantee they laugh in your face", "And that could happen whether those people had homes or not. If the roommate had made a male friend at university and invited him to drop by all the time and let him sleep in OP's bed, it would also be unacceptable.", "I agree, but there are people saying they were going to vote YTA until bed part, which I wholeheartedly disagree", "ESH, that’s her friend but she should give a heads up", "ESH. \n\nYou need to stop seeing homeless people as dangerous animals, Erin needs to learn the entire concept of boundaries and being a normal human person, and Sam needs to learn to not use a fucking stranger's bed what the actual fuck. \n\nGet a lock on your door and check your bedding for bedbugs. If you want the nuclear option, tattling to the landlord is also a thing. Good luck and don't renew your lease with this woman.", "I was all prepared to name you the AH because of prejudice against Sam's homelessness until I saw he was in your bed.  I dithered between everyone and just Erin, but given that you grudgingly allowed it until he was in your bed?  NTA.", "NTA.  She allowed him to sleep in your bed? I would be putting a lock on your door and  telling her to look for another place to live", "NTA. although you couldn't get him arrested for trespass. He was invited by an equal resident of the home.", "Yeesh I was going with YTA at first because her having someone over for food is no issue. Him being homeless is not a problem as long as he is respectful. However I quickly changed my mind when you found him in your bed! That’s so rude of your roommate(I sure she told him it was okay). Makes me wonder how often he sleeps in your bed", "I was so ready to say YTA until he was sleeping in your bed. Holy shit NTA. That's wildly put of line.", "ESH. You ARE judging him for being homeless. If he stayed in the kitchen YWBTA but she let him into your BED?! FUUUCK NOOOO", "NTA.\nTime to look for new place or new roommate. In the meanwhile lock your bedroom door.", "Yeah. YTA. you added homeless like it makes it worse. Reevaluate why you felt it necessary to mention you wear a hijab as well. That's a personal decision and if the other woman is paying them she had the same right to have guests as you.  \n\nYeah him being in your bed is bad,  but I feel like maybe their is more as aren't being told.", "NTA. I can't believe she put him in your bed yet is mad at you. Your roommate is crazy.", "NTA. I can't believe she put him in your bed yet is mad at you. Your roommate is crazy.", "NTA. \nErin is the character that gets everyone killed in a scary movie.", "She did know him though as well as you know any of your friends", "I'd be pissed to find my roommate's sister crashing on my bed, and my bedroom was **her** bedroom before she moved in with her girlfriend and is someone I trust not to mess with my shit. Finding an actual stranger in my bed, vagrant or not, would end poorly for everyone who was involved in the decision-making process that allowed this to happen.", "Yeah, I was on the fence until the part about him in OP's BED!!! And the edit that they have an agreement about letting the household know when someone will be over. NTA!", "I don't let homeless people into my home lol but I have had a friend come over who is homeless.", "You do realize that like 90 percent of young people with full-time jobs are one or two bad decisions away from being homeless yeah?\n\nBeing homeless doesn't make people inherently bad or more likely to steal. I've known people who have good jobs that have still stolen from me.\n\nYour comment is super classist and people like you are the reason the world doesn't operate with more empathy in general.", "You said her, and it wasn't clear which her you were referring to. Perhaps you should bold that instead. He was not a stranger to the roommate, he WAS a stranger to OP, who was posing the question. For us readers in the room.", "Relax, hun, i think perhaps too much reddit for both of us today. Was just pointing out the major issue. Not how I meant it and take care. ✌️", "90% of young people?  Bs. Also 98% of stats on reddit are completely pulled out of the commentators ass.  And unless you are pushing your 20 yo daughter to let strange homeless men into her place at night you should prob just stop. Something tells me you would freak. \"But 1% of homeless people don't have mental health issues or drug addiction, how dare you make an assumption\"", "Haha okay. I know plenty of homeless people and every one of them I would be comfortable interacting with my family.\n\nI'd bet these two girls in this post are a broken down car and a huge power bill away from being staring homelessness down the barrel.\n\nI'm done engaging with you. You clearly have your thought and I have my own. We can leave it there.", "Speaking of stat's, looking at your user profile - 100 percent of your comments are you being an overly abrasive person hiding behind a Reddit profile.", "Exactly, you often don't realize how bad a situation really is because there's always someone worse off. When I was younger, I used to drink almost every night for a few years. I didn't think I had a problem because I had friends who started drinking when they woke up & didn't stop until they passed out at night. I knew so many people doing heroin or smoking dust at that time too. I thought they had the *real* problems since I didn't do drugs *every* day. \n\nI had to take a big step back and see I was *not* ok, I had just gotten way too comfortable surrounding myself with dysfunctional people. It enabled me to be a total fuck up & not have to feel too bad about it because I was still doing better than the person next to me. \n\nSeems like a subconscious maladaptive survival tactic. I probably avoided people who were doing well because I felt like shit in comparison to them. But then a person loses sight of what's considered 'acceptable', becomes more immune to horrible things, let's themself slide down even more & then finds that healthy/stable people seem repulsed- which just perpetuates the problem. I have no doubt that's part of the downward spiral when a person ends up on the street. \n\nIf I choose to take a risk & bring someone into my home, that's one thing. I just can't live with anyone who makes that decision for me. I wouldn't feel comfortable relying on my roommates ability to judge how safe someone is. I was a lot more easy going about that when I was younger. I've had maybe 30 roommates over 25 yrs & had enough problems with them that I no longer can tolerate living with people.", "So you're wrong and out of ways to defend a take that makes no sense, got it.", "Sorry I am the voice of reason while idiots on this sub give horrible advice. And in 10 days got 3,000 karma so can't be that bad", "Um major violation by roommate. Having him over was like ngl I'm sketched out. I'm gonna write the rest of this, generously assuming that he's a totally lovely and trustworthy guy. Others have addressed the safety issues which are many. \n\n I don't even wear hijab and i definitely do not want a random man in the house. the fact that he's houseless doesn't change stuff a ton for me if his hygiene is decent, no bugs or communicable diseases. esp if he's just picking up food or using the bathroom (and he or erin keeps it immaculate). but I don't want any random man messing with my possessions... and the standard of hygiene I need to feel happy about someone being near my space is frankly real high\n\nBut i DEFINITELY do not want some guy SLEEPING IN MY FREAKING BED, holy shit that is inappropriate. ALWAYS unless you enthusiastically said it was ok. but you EVEN TOLD HER EXPLICITLY NOT TO LET HIM NEAR YOUR SPACE. erin is clearly trying to push your boundaries, to a point that out seems like that's a bigger goal than helping sam at this point\n\n Again, being houseless doesn't NECESSARILY make it worse, yet it certainly COULD be relevant at least depending on hygiene concerns. I would be very distressed to find ANY random or uninvited person in my bed, especially a man. who I hardly know.\nthis is all assuming no dirt, bugs, which are like, not something to assume or judge a houseless person for but they are valid concerns when it comes to sharing a bed. \n\n\nWERE THEY GOING TO CHANGE THE SHEETS? DID THEY TAKE YOUR OLD ONES OFF? DID THEY KNOW THEN YOU WERE COMING BACK!? I'm totally convinced that there was no world in which they were gonna be thoughtful enough to change out your linens. Sooo gross no matter who the uninvited guest is. \njeeeeez.\n\n\nyou are completely NTA, your roommate is giving you the silent treatment because you rightfully told someone to get OUT OF YOUR OWN BED that you came home to find him in.\n\nhelping houseless people is great, but this ain't it. Sam was honestly probably mortified. I bet Erin told him it would be ok (and that's why she's so mad that you're not rolling over for her). I bet he didn't love learning that it was completely not ok, not because of you asserting a boundary, but because his friend put him in an uncomfortable situation. One that could easily get him arrested. Like I'm just imagining being this random dude in your house, having probably been told it's ok, and realizing as you screamed at him that whoa, he's literally trespassing in some lady's bed, and if you called the cops it wouldn't even be his word against yours, it would be erins against yours. he would almost certainly be presumed guilty by the cops based on his situation. i understand the value of sleeping on a real bed but honestly i think a lot of unhoused guys, at least those who are somewhat managing their mental health, would probably rather just tough it out (what is one more day sleeping outside or in a shelter or crashing on a couch) than risk being subject to potential police brutality if you were the kind of person to call the cops on him with NO WARNING, maybe even while he slept, which he had no way of knowing. \n\nall of this is to say i think this is on erin. \nand she used someone else to push your boundaries. i feel like people who push boundaries do this - they say you need to do this, it's not for me. it's for my friend/family. they tell that person it is all ok even though they know you are upset. then when the third party does something that violates your boundary they may not even know what they did or they may be dejected that something went wrong just like they knew it would (or they may be teamed up with the boundary pusher). the boundary pusher then tries to guilt you, \"oh, this was for Sam, how can you be so cruel, he's struggling\" - but he either chose to use your bed without caring how you would feel (awful of him). or, he was told it was ok, leaves feeling used, and erin tries to make you feel bad for getting in the way of her Totally Kind, Reasonable, Selfless, Kind, Victimless Act of Kindness .", "NTA", "NTA, your roommate has been lying to you for some time AND allowed this man to sleep in your bed! That's inexcusable behavior!", "Your roommate was fine in everything she did up until the bed thing, \n\nCooking for a homlessman \nThat's chill \n\nGiving your roommates bed to a homeless man \nThat's fucked.\nNTA", "AS A FORMERLY HOMELESS PERSON when given the option I would never impose! All graces were given by God, and who was I, a simple homeless f@ck, to lie on someone else's sheets!  Even though I had day shelter privileges *slang for I could shower and do my hair and makeup there * I would never suggest to a housed person that I could swan in and... NO! I was homeless and this makes no sense.", "NTA\n\nWhile it is kind of an AH move to say you don't want him at your house because he is homeless. It is complete BS that she let him sleep in your bed. Your bed. What the actual fuck?\n\nOP you need to find a roommate that has common decency and respects boundaries.", "Exactly, that's crossing a boundary.", "I would go further and say there is an automatic, implied boundary that you simply don't sleep in someone else's bed or go into their bedroom without their express permission (even if they didn't set an explicit boundary). especially if it's a roommate you don't know that well. op would not be the AH even if she hadn't explicitly said \"and by the way, keep him out of my room\" because it's a common sense boundary. nobody expects to come home to a stranger or a roommate's friend in their bed. \n\nand then as you said, OP went further and reinforced the boundary explicitly, to the point that not only is OP NTA , but i have a hard time believing Erin wasn't just absolutely messing with her having him borrow her bed right after she reinforced the boundary. OP was right to respond as she did", "Well he might not have known. I don't think OP had ever even interacted with him.", "I re read it and you’re right, my bad. But I still wouldn’t sleep in the bed of someone I had never met if I was the nicest person ever. Erin is gross and naive.", "You really typed out that last paragraph and said people shouldn’t jump to conclusions to keep themselves safe lmao. Homeless people deserve the same respect afforded to every other human, but to not acknowledge that the hygienic standards are different, not to mention the prevalence of mental illness and addiction struggles in that community is naive at best. Nothing wrong with feeding someone in need, but bringing a stranger into a shared home is dangerous and stupid. Also if Erin was so kindhearted, why wasn’t Sam snoozing in her bed????", "See I was kind of feeling like the judgmental about him coming over was kind of AH behavior but then OP mentioned that she wears a hijab and so her being uncomfortable with a man she doesn’t know coming unannounced into her space is valid as she could have walked in the door and removed her hijab before knowing he was there", "That’s not what she yelled at her roommate about though. I could see that as an argument (though the other AITA thread about the boy not sparring with a girl because of his religion would say otherwise if Reddit was consistent), but her argument was that she didn’t know him. She had valid arguments to be mad about, but argued and yelled about other stuff (him being a homeless stranger) and telling her roommate she can’t have him over because of that fact. That’s why I think she is also an ah.", "OPs exact words are “I was angry she had given our location to a stranger. I confronted her over this as I feel that this is uncomfortable and unsafe” all of this uses the fact that he was a stranger. She never mentions any of her reservations being due to him being homeless it’s her roommate that puts that into play and the roommate could easily be using it to try and shut OP up. OP only expresses discomfort with a strange man being in her house especially without her knowledge.", "My god it’s like you can’t fucking read. Everything about me saying op is the asshole is the part where she is trying to not permit the roommate from having him over at all. Not sleep in her bed.", "You’re right, in that quote she never said it was because he’s homeless. Regardless, saying she can’t have people over because they are strangers to her is still AH behavior. She has no right to do that. OP has friends over. At some point they were strangers to the roommate too. Was she an AH for ever bringing them over? Obviously not. But the roommate would have been if she said that OP couldn’t bring friends over at that time. Same applies here.", "Sigh... No. Because we're now arguing over opinions. You seem like a sour human who gets off on \"being right\" and will by no means entertain another perspective. I could argue with you all day if I enjoyed our interaction, but I don't, so why would I bother wasting energy on something I don't enjoy?", "Congratulations on making a tonne of comments? I'll go organise you a ticker-tape parade for such a high achievement.", "Direct quote from OP “I was mad that Erin had Sam over before as she didn’t tell me about it. When we have people over (especially males as I wear a hijab), we tell the other housemate, but she didn’t” OPs fine with her bringing people over but not without her knowledge and ESPECIALLY not an unknown man due to her wearing a hijab and the risk of being seen not wearing it by a strange man", "No, NTA. It's reasonable to be upset with your housemate for allowing a homeless man into your home without your knowledge or consent. It's a breach of trust and a potential safety concern. \n\nYou have the right to feel uncomfortable with someone you don't know having access to your living space, especially when you explicitly expressed your concerns. \n\nYour reaction to finding him in your bed was justified, and you have the right to establish boundaries for your personal space.", "Nah fam, crabs, them shits don't just live in pubes but beards as well", "This story oozes everything wrong with SF", "I'd feel comfortable sleeping anywhere a resident of the house told me I could sleep. As a guest, you take cues from the host.\n\nFor me, This whole situation comes down on the AH roommate.", "You don’t think Erin’s overall judgement is sus when she puts Sam in OPs bed? \n\nOP doesn’t have enough of a relationship with Erin to trust her judgement in lieu of own and she has no relationship to Sam to trust him at all. Erin has broken all trust. OP has no reason to be examining  her personal bias of the homeless when she and her  home are not secure. Everyone virtue signaling here are sitting tight in front of a screen. \n\nI’ve volunteered at a hypothermia shelter. There are strict rules in place for how we interact with the residents. Giving them things that are not shelter provided is a no. Too much personally identifying info is also a bad idea. Focus attention and conversation on them if they’re eager to talk", "NTA\n\nIt’s harsh but the reality is homeless people are carriers of diseases and parasites. You might think I’m just hating but it’s the truth. If you work in a hospital or around children you’re not allowed to do homeless outreach.\n\nHe was in your bed? That is…disgusting.", "NTA. U need to call your landlord and get her kicked out. If he was sleeping in her room and is only around when she is, thats mostly her business; especially if she claims that is her friend. But she let him sleep on your bed! Wtf? No way.", "NTA get out of there as fast as possible", "That is just *wrong*. Sleeping on your bed? EWWWWWWWW. I don't care if he's homeless or not, you don't let someone use someone else's bed without permission.\n\nNTA. But sounds like Erin has a big case of Saviour Complex. You should look for somewhere else to live (or a new roommate, whichever is easier).", "Honestly. How well do you know someone after a few months? \nLet's for the fun of it, say 2-3 months. \n\nHow much do they sit and talk based on she cooks some food and drops it off. An hours worth of talk pr meeting? \nAnd we assume what he tells her is truthful. \n\nThis statement goes for everyone you come in contact with, online, at work, a bar, a cafe you both use in lunch break. \nHow well do you know them? \nHow often have we heard some family member, or super close friend, who has known a person for 20+ years, say, \"I can't believe he/she did,\"insert a big crime\" that!!. They are so nice and well loved!\" \nSomeone starts dating someone at work, and they turn out to be like the guy from \"you\" but he was so nice and polite at work? \n\nNow I'm not saying you should fear every single person in the world. \nBut to state, \"but he is not a stranger to her after a few months\" is not a safety guarantee. \nespecially when he is a stranger to OP still. \nHomeless or multi millionaire. He is still a stranger/beginning friend after a few months.", "Yes. The fact that he's homeless is a red herring. The roommate shouldn't be letting anyone sleep in OP's bed without OP's permission, full stop.\n\nThis happened to me once in a shared house - I returned after some time away, and it was clear someone had slept in my bed. It was a visiting friend of one of my housemates. Still a complete violation of trust, as I wasn't asked and they didn't even change the damn bedding.", "I’m just saying he’s not inherently dangerous just because he’s homeless. The roommate is clearly friends with him, for months. She likely has a vibe on his danger level.\n\nMy cousin is just a see the best in everyone person who works with the homeless so she was easily manipulated by one guy. Doesn’t mean all homeless people are like that, that’s just a human thing. I can name more non-homeless people who have committed acts of poisoning that homeless people.", "It's a classic reddit technique for when wrong, \"I'm done arguing not because I don't have anymore coherent arguments but rather because I'm so right it's pointless\". Seen it many times", "I average 300 likes a day for my comments, even though I'm being \"overly abrasive\". That doesn't make sense"]}