{"id": 20812, "submission_id": "14l71xq", "title": "AITA for ordering food for my gf without asking what she wants", "selftext": "Bit of context, I want to try every dish in the world. I think every culture has some amazing dishes. She on the other hand is very picky.\n\nWhen we try eating out and trying to decide a restaurant she rejects all my choices and I give up and have to eat at her favorite restaurant. \n\nWe spoke about this and she agreed to try some new restaurants that I would pick. I choose an Ethiopian restaurant, we drove there but then she goes \"I am full, you can eat though I will sit there\". Again we had to go to her restaurant. Another time we chose an Uyghur restaurant. She did the same. I decided not to ever suggest another resraurant. \n\nFew weeks back we were home and both hungry. I told her I was gonna order some food through Ubereats, she asks that I order for her too. I thought about what she liked and ordered 5 different rice and meat dishes (she likes rice and meat) from this amazing Indonesian restaurant. \n\nFood arrives and she throws a tantrum why I didnt order from her favorite restaurant. I asked her to try it. If it is bad, spit it out and I will order from your restaurant. She didnt even taste it despite my begging. She boils some eggs for herself and eats those.\n\nFew weeks later she is ordering some food. I ask she order some for me too. Food arrives and it is 2 dishes, she takes 1 and hands me the other. It is what I hate. I ask why she ordered me this, she goes \"aha, see you hate it when I do it. Then why did you do it to me\". I tried arguing that I had ordered 5 dishes she would have loved if she had tried them. But that she never tried a single bite. On the other hand I have eaten this before and she knows that I hate this. Anyhow I ate it.\n\nYesterday I had a reason to celebrate. Shared the news with her and she says I am buying dinner. I agreed happily. Ordered 6 different dishes from her favorite restaurant. Food arrives and she is shocked. She asks I never asked her what she wanted to eat. I tell her it is from her favorite restaurant and a total of 6 dishes all she likes.\n\nAgain she throws a tantrum saying how could I do it to her again when I myself dont like it when she orders food without asking me what I want. I am baffled and think shes being u reasonable. Again she ate boiled eggs and slept.\n\nI cant figure it out. Am I the asshole here? I have certainly learnt a lesson but just need to know if I was wrong.\n\n*Edit last night when she got angry I asked \"what would you have ordered? She says the lamb bbq (this has 4 skewers). I had actually ordered the mixed bbq plate. This has 2 lamb and a bunch of other skewers. Pointed to it and said she can have both. But she was already pissed and said no.", "created_utc": 1687951960, "permalink": "/r/AmItheAsshole/comments/14l71xq/aita_for_ordering_food_for_my_gf_without_asking/", "score": 56, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1. Ordered food without asking girlfriend what she wanted to eat.\n2. Shes done this before but circumstances were vastly different this time.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Next time just say „I want to order at this restaurant. Please look at the menu and tell me what you would like to try.“ If she can’t find anything say „We agreed to trying different places. If you can’t find something here you can order at your fav restaurant but I want to try this food“\nMy bf and I do this when we cant decide and it works for us.\nSure ordering seperatly is a little more complicated and it‘s harder to reach the minimum wage (we order a side dish or a drink that we eat or drink anyways to reach it for example fries or chicken nuggets) but at least you are avoiding the stress and both can eat.", "NTA but I think you know this judging by how you expressed the situation. This is really petty behavior. Why can't you ask each other before ordering? Why should someone try to \"get you back\" or retaliate. Talk about it and express that you want a change in dynamic. If all else fails, 2 phones, 2 apps, 2 orders. Simple.", "ESH. This was annoying to read. You are both being insufferable. \n\nHer for obvious reasons, but also you for 1) not asking someone what they want off the menu before ordering (it’s not hard to do so) and 2) for letting her walk all over you and letting her dictate almost all of your meals. \n\nYou need to either stand up for yourself or end this relationship and find a partner who isn’t so selfish.\n\n*Edited to add judgement*", "ESH.\n\nYOU for trying to force her to have your perception of food i.e. 'trying new food is wonderful'. She doesn't and you can't make her feel that way by pushing it or forcing it - it was a mistake for you to keep trying as her actions have clearly signaled that you will not see eye to eye on this.\n\nHer, for her poor communication skills. I can't tell if she is doing this on purpose so you feel you never do anything right, or if she genuinely feels disrespected that you don't ask her.\n\nBut I would suggest breaking up because this relationship sounds too difficult quite frankly if she is unhappy when you did the exact thing she was mad you didn't do last time. Can't please someone looking for reasons to be mad.", "ESH.  Even when you know dishes someone likes, you don‘t know what they want unless you ask.  Ordering for someone instead of asking what they want is weird and rude.  If they haven’t already said what they want that meal, use your words and find out.\n\nHer refusing to try anything or eat anywhere but her favorite restaurant in very childish, not to mention self-centered.  A person doesn’t have to like everything, or be willing to eat every cuisine, but they do need to be able to accommodate some variety in restaurant choices.  Making you choose between eating at her one and only accepted restaurant or eating without her isn’t fair.", "ESH. Take turns picking a restaurant but let the other person choose from the menu. Damn, it shouldn’t be this hard. Why are you always making assumptions about what the other wants to eat and then being petty about it?", "Yes ask her what she wants in the future, but she’s acting extremely childish and petty here. If she knows you’re ordering food why doesn’t she tell you what she wants? I understand being picky but she’s being unreasonable and rude by the way she’s acting.", "ESH. You guys behave like teenagers. Is it hard to ask before ordering?", "Your both the asshole. Just break up now. You'll never be able to pick a bed, paint color or living situation together.", "ESH \n\nFor you, it wouldn´t kill you to ask her before you order food\n\nFor her, she is being childish and bratty with the boiled egg tantrums and revenge ordering dishes you don´t like on purpose.", "INFO: how old are you?  This is some high school bullshit.", "NTAH\nOrder take out from where you like for yourself and have her order her own herself from where she likes. If she says order for her, politely decline. If she’s petty about that, then your partner is definitely is TAH. Learn your lesson from those experiences.", "Both of you need to talk to each other before ordering food\n\nFfs\n\nEta", "ESH, everyone’s behavior here is extremely childish. The next time when she says she’ll just sit there while you eat at a restaurant of your choice. Do that. Also, why don’t each of you stop ordering food for each other.", "\"I choose an Ethiopian restaurant, we drove there but then she goes \"I am full, you can eat though I will sit there\". Again we had to go to her restaurant.\"\n\nI have a hard time understanding why you didn't take her home and then ordered take out for yourself. Or go in and order for one.\n\nI don't find your girlfriend credible. NTA.", "ESH. You can ask her what she wants and she sucks more for being petty and vengeful.", "NTA\n\nIt sounds like you are always the one who ends up giving up on what you want to eat because she doesn't like it. In her place I would totally support you in trying new foods even if I wouldn't try them because I would want you to be happy.\n\nAnd I totally don't see anything wrong with ordering for her without asking if it was something you know she likes and she's eaten it before. My SO actually asks me ALWAYS what I want and it gets annoying because he knows what I like and I have decision fatigue and I want him to choose for me sometimes 😃.", "NTA She asked you to order for her. If she is this picky she should have 1) asked first which place you’re ordering from and 2) chosen her meal herself. Then she didn’t even try, as far as i can tell she has no dietary restrictions or intolerances and you even ordered something with her tasted in mind. She was just being a stubborn child. Then she tries to get back at you and then once again when you order from her favourite placw this time and her favourite meals, she refuses and starts a fight just because. Honestly she sounds exhausting.", "Just order what you want and eat it in front of her? Man idk. You both sound 14", "YTA It really doesn't matter if you think you know better than her what she wants to eat. Her being picky and unadventerous is annoying, but valid. You can't just force someone to change their preferences to match yours. \n\nShe's made it clear that she wants to choose her own meals. Respect her choice. \n\nIf it's such a big deal to you, go find a girlfriend with a better palate.", "ESH \n\nWhy can y’all not Simply say “Hey I’m ordering from *food place*, what would you like me to order for you or do you want to order from somewhere else?” \n\nAlso ubereats - you could order from\nMultiple places. We have done that a few times", "ESH\n\nThis situation is easily fixable.  I'll show you:\n\nYou:  Hey babe, what do you want to eat?\n\nHer:  I want X.\n\nYou:  Ok, I'll order that for you.\n\nSee how easy that could have been?  But no.  You just blind ordered.  You set yourself up for failure.\n\nShe's not much better though.  Her purposefully ordering food she knows you don't like to get back at you is teenager level maturity.  It's pretty sad.\n\nYou like trying new foods.  She doesn't.  You need to stop trying to force that on her.  She needs to stop with the pettiness.  Both of you need to work on your communication.", "YTA.  What is so hard about asking her what she would like to order?  If the answer is that she doesn’t want anything from the restaurant you are ordering from, fine, order for yourself and she can get her own food.  But would it really have killed you to ask what dish she was in the mood for from her favorite restaurant?  It’s kind of controlling and infantilizing to not let her have a say in her own food.", "NTA. While you can’t force someone to eat what they don’t want, the fact she refused to try anything, then deliberately ordered something she knew you hated, is uncalled for.", "ESH. Y’all are both being childish about this. As a picky eater myself, I try to expand my food horizons by trying new things and I would never expect someone to eat at the same restaurant all the time because that’s what I like. I also hate being asked/expected to eat something if I don’t know what’s in it (ALL of what’s in it, not just “meat and rice”). You need to respect her food boundaries and you both need to communicate about it like adults instead of what you’re doing now.", "ESH.  Asking what she wants is important (all communication is) in a healthy relationship.  That said, you do not sound compatible at all and her reaction is over the top and immature.  Are you in high school? Because if not, not talking to each other and retaliating/throwing a tantrum about food is ridiculous.", "NTA. You've asked and made suggestions which she didn't like.  \nYou have every right to try different foods, even if you go off by yourself to do so.  \nShe also has the right to go get food from the places she prefers, without being childish about getting revenge.", "NTA. Next time, ask her first. Go to the restaurants you like by yourself or with a friend who appreciates the food. Let her eat her chicken nuggets by herself.", "ESH\n\n  \nDude, just bloody ask her what she wants. Not that difficult. You're both making this WAY more complicated than it ever has to be.", "ESH - you both are being petty and seemingly wasting a lot of food, which is also not cool.", "NTA - how old is your girlfriend? Because she sounds like shes barely graduated Kindergarten. I understand being picky, as I myself am extremely picky also. The fact that she straight up refuses to even give new food a try is ridiculous. Then she throws a tantrum when you go out of your way to order from her favorite restaurant and things she does like as well? It literally doesn't even make sense. \n\nAlso, her ordering something you've previously tried and didn't like at all is petty.\n\nTo be honest, the next time you want to go out, pick the restaurant you want. If she doesn't eat, that's on her. You're always giving into her needs and wants and you need to put your foot down and put yourself first for once.", "NTA\n\nYou tried to broaden her palate with some new restaurants and SHE chose to be a brat about it.  Next time you decide to go to a new restaurant and she pulls the \"I'm full, but you eat\" DO IT.  Don't leave and go to HER favorite.  That is unfair to you.  Go to the new restaurant, enjoy your dinner, and if she suffers because SHE is choosing to be a brat, then she can go hungry.   \n\nYou tried several times to order food you though she would like and SHE *chose* not to try them.  SHE did.  Then she thought she'd \"do the same to you\".  But she actually DID pick a dish she knew you wouldn't like.  Not something you hadn't tried...something you specifically didn't like.  \n\nYou ordered dishes she actually LIKES from HER restaurant.  And she decided to be petty about it because \"you didn't ask\".  \n\nHonestly this girl sounds like a petty brat.  You sure you're willing to put up with this for the future?  Because it sounds like this is how she's going to act about this --- and if she'll act this way about food...what else is she gonna act this way about?", "So many different childish behaviors here. Guilt tripping you to only eating at the same place over and over again is ridiculous. She obviously is immature and petty. I’m usually against the breaking up over this small stuff comments, but I’m assuming she’s this immature in lots of other ways too. I wouldn’t myself put up with someone who’s acting like a baby all the time.", "ETA here.  \n\n\nThere are some serious control and communication problems here.   Your elationship seems petty on both sides.  \n\n\nYou know what she likes and doesn't like, but you keep trying to force her to change.  And she is being difficult with food choices.  \n\n\nI'd recommend that both of you either come to a compromise or find better partners.", "ESH.  This is a communication problem deeper than what to eat. You're right,  you can't read her mind and she's being weird telling you to order her something and then being mad when the food isn't what she wants.  But you shouldn't assume something similar to what she likes is the same as what she wants. I have favorite dishes from the same restaurant but sometimes I prefer a different meal.\n\nYou're both going in circles over this. Ordering food is just hiding the real problem.", "I mean, a lot of this isn’t about being TA. The situations are also all different ones. \n\nFor instance, I think the ones like the Ethiopian restaurant is possibly N A H — she’s not into it and I get how is awkward to have her there not eating, but people should be able to eat what they want. It’s weird she only likes one restaurant. But being odd doesn’t make her an AH, though it can be a dealbreaker for you. But she was not being rude necessarily, she accompanied you and didn’t want that food. I get that’s annoying but that’s who you’re dating. \n\nI think the you ordering food is kind of E S H. She assumed her restaurant, but then again that’s her only restaurant so maybe the assumption made sense? You should have been clear where you were ordering from, possibly in that case, and you certainly seem to really really be forcing her to “try” stuff which is never a good attitude for adults and food. \n\nHer ordering you what you hate is N T A unless you kept bringing up her eating stuff she didn’t want to maybe, but I don’t understand why you ate it. That was her being petty and mean either way though.\n\nYou ordering from her restaurant without asking her seems E S H ish since she was buying especially. I mean asking is normal and it doesn’t sound like she asked you to choose? You just assumed? And bought 6 dishes but not what she actually wanted, so I can see that being annoying. Idk, many people dislike others ordering for them but she seems really intense overall. N T A if you didn’t know any better but it feels like you’ve been low key battling over food and engaging in that actively so partly on you.\n\nOverall ESH and y’all need better communication. But it does sound like, from your perspective though, she’s the more difficult one. But you both sound not great.", "ESH. Reading this is exhausting. You're both petty and incapable of communicating properly.\n\nIt wouldn't have been hard for you to say \"I'm ordering from X, what would you like?\" Or her when asking saying \"Can you order me Y\"\n\nI have a suspicion that your gf may be neurodivergent in some form. From my experience, reacting that way to a new food that they don't know for certain they like is pretty common. Certainly for the first time. The second time she sounds like she's being an A H, as what she wanted was included in what you ordered.\n\nHer specifically ordering what you hate is an A H move. And you probably should have asked when you ordered from her favourite place after the fight last time.\n\nYou both sound too immature for a relationship, and your food pallettes might genuinely be a cause to break up because this shit isn't healthy and I can see it causing many fights and all sorts of resentment in the future.", "ESH. It’s not about food - it’s about control. You’re both trying to have control in your lives and food is how it plays out, yet neither of you respects your partner’s need for control. I get that it’s exhausting feeling like you’re the one who always has to compromise. So why compromise? Instead, try turn taking. If that won’t work, then just eat separate meals. And if that wont work, the relationship isn’t going anywhere so it’s probably time to break up.", "Was it a tantrum, really? Or did she just not react like you expected? There’s frustration and then there’s kicking and screaming.", "Any fan of Ethiopian and Uyghur food is clearly a man of good taste\n\nYour girlfriend may have behavioural or sensory issues, though. Acting that extreme, and being completely inflexible, are warning signs to say the least\n\nNTA", "YTA. I’m sorry, but how long are you going to pretend to be a victim?", "NTA.   \n\n\nSounds like you're being reasonable in the face of childishness. As you describe it, sounds like she's actively trying to upset you at the points where she isn't just being petty for its own sake. Not a great look.", "Borderline NTA. I would hate for someone to order for me without asking what I’d like, but she sounds like she has the pallet and temperament of a child.\n\nAs someone else pointed out- if she’s like this around food, what other issues will she be childish about?", "NTA - Your girlfriend seems incredibly picky and her reactions seem somewhat immature. However, there is a simple solution to this issue: communication. If you're wanting to try something new, it is probably best you both get your food from different locations. She should tell you what she wants when requesting you order on her behalf, but if she doesn't, make sure you find out before placing the order. Otherwise, you can anticipate her frustration and disappointment.", "YTA.  And wtf!  Why is it so important for you to order for her without asking?!  It's a weird and bizarre power play. She wants to decide for herself what she wants to eat, like everyone else.  Stop trying to force her to eat what you, the all seeing, and knowing God of distinguished pallets, wants her to eat.\n\nYou order 6 dishes you decide she needs to eat instead of getting her what she wants.  Your need to demean and control her food choices is deeply concerning. Get help.", "ESH but you are seriously dating  a child. Nothing worse than someone acting like a toddler about trying new foods.", "Nta - but there seems to be more going on here than just her being “picky”. You ordered food from her favourite place and she still got upset. So, something else is going on.", "NTA\n\nPicky eaters can be picky but they can't force their bullshit on others. \n\nAnd she's not going to change. You're going to spend a lifetime with someone who never wants to try anything new or different. How stagnant.", "NTA. She’s a child.", "I'm going NTA here. She agreed to branch out and try new restaurants and then would never actually eat at the restaurants. Doesn't seem like she was honest from the start.  You then ordered food similar to other dishes she likes in an attempt to get her to try something new ( which she agreed to do with you) and she refused to eat it. You're NTA but stop trying. Just order from separate places. You don't want to eat the same old every time and she doesn't want to try anything new.  Agree to alternate restaurants when you go out to eat and she can have her favorite every other time. She's free to eat before she goes with you to your restaurant and maybe eat a salad or app.  Or you can break up.", "NTA. Your girlfriend is a toddler", "1. U didnt miss anything with ethiopian food. \n2. If u want to try something new, see if they can make.something she will eat. If not get it as take out and get her something from somewbere else. \n3. Ordering for her is a no no. Just somethung you dont do. She shouldnt order for you either.", "NTA\n\nYour girlfriend sounds exhausting. Just order for yourself and let her sort her own food out.", "NTA in my opinion. You had no bad intentions and ordered the food you knew she liked. You could have asked beforehand but don’t think it’s a big deal. However food is very important to me and I would not put up with someone making me eat at the same restaurant every time we go out and refusing to try anything else. You should at least compromise 50/50 of the time. More if you are the one paying.", "NTA but her behavior would drive me insane.  She's gone beyond picky eater into brat territory", "NTA, but I don't think you two are compatible. Food is one of the most basic pleasures in life and we spend a great number of our waking hours preparing and eating it. If you are constantly squabbling over food, you are going to be squabbling on a very regular basis. \n\nLike you, I am an adventuresome eater and I was once in a relationship with a man who would never eat at a restaurant that was not personally recommended to him. I could never eat anywhere I wanted, and it drove me nuts. \n\n\"Can we try this place? It has rave reviews.\"  \n\n\"Not by anyone **I** know.\"\n\nThen there is my in-laws, who have very bland tastes. I don't invite them to our home because I am terrified of trying to make a meal they will enjoy. They won't touch a dish containing onions or garlic. I don't know how to cook without onions or garlic! So I made a beautiful chicken dish in a mildly spicy sauce with toasted pecans on top. MIL cleaned the sauce off the chicken and ate it with no sauce or even the pecans, which she wouldn't eat because they caught in her teeth. And they wonder why they never get invited.", "NTA OP. You are not dating a woman with an adult palate. In the future, if you are charged with getting the food, buy what you like and boil her some eggs. \n\nAnd, seriously consider how long you want to deal with this. Food is one of the greatest pleasures in life. For some, this is tantamount to incompatible sexual preferences. I couldn’t be with a picky eater unless they fix their own meals 100%.", "NTA but you guys sound either incompatible, or just accept that you’ll always eat separate meals.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nBit of context, I want to try every dish in the world. I think every culture has some amazing dishes. She on the other hand is very picky.\n\nWhen we try eating out and trying to decide a restaurant she rejects all my choices and I give up and have to eat at her favorite restaurant. \n\nWe spoke about this and she agreed to try some new restaurants that I would pick. I choose an Ethiopian restaurant, we drove there but then she goes \"I am full, you can eat though I will sit there\". Again we had to go to her restaurant. Another time we chose an Uyghur restaurant. She did the same. I decided not to ever suggest another resraurant. \n\nFew weeks back we were home and both hungry. I told her I was gonna order some food through Ubereats, she asks that I order for her too. I thought about what she liked and ordered 5 different rice and meat dishes (she likes rice and meat) from this amazing Indonesian restaurant. \n\nFood arrives and she throws a tantrum why I didnt order from her favorite restaurant. I asked her to try it. If it is bad, spit it out and I will order from your restaurant. She didnt even taste it despite my begging. She boils some eggs for herself and eats those.\n\nFew weeks later she is ordering some food. I ask she order some for me too. Food arrives and it is 2 dishes, she takes 1 and hands me the other. It is what I hate. I ask why she ordered me this, she goes \"aha, see you hate it when I do it. Then why did you do it to me\". I tried arguing that I had ordered 5 dishes she would have loved if she had tried them. But that she never tried a single bite. On the other hand I have eaten this before and she knows that I hate this. Anyhow I ate it.\n\nYesterday I had a reason to celebrate. Shared the news with her and she says I am buying dinner. I agreed happily. Ordered 6 different dishes from her favorite restaurant. Food arrives and she is shocked. She asks I never asked her what she wanted to eat. I tell her it is from her favorite restaurant and a total of 6 dishes all she likes.\n\nAgain she throws a tantrum saying how could I do it to her again when I myself dont like it when she orders food without asking me what I want. I am baffled and think shes being u reasonable. Again she ate boiled eggs and slept.\n\nI cant figure it out. Am I the asshole here? I have certainly learnt a lesson but just need to know if I was wrong.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "How do people live like this? Folks act like it’s petty, but I couldn’t be with someone who is so picky that I’m stuck eating at the same restaurant for the rest of my life, let alone is this prickly. ESH she is not a food person and you need to accept it. She is also coming off as impossible to please and looking for a fight. Both of you seem like you are ignoring your lack of compatibility in this area in favor of trying to pull your partner into your way of thinking.", "ESH. You’re both annoying. Start a group order so everyone can pick out their own food.", "INFO: can’t you asked her that you should order for her?", "YTA\n\nShe is telling you in plain words of one syllable that she wants you to *ask* her before you order for her.\n\nThis is not hard. Next time *ask* her what she wants before you order.\n\nAs for your different food preferences, find a friend that enjoys being adventurous and have adventurous meals with them.\n\nWhen eating with your girl friend *ask* before you order. Go where she likes to eat. Or find one of those multi-restaurant food places that are becoming popular and she can get what she wants over there and you can get what you want over here.", "You guys are very incompatible when it comes to food. Maybe you guys should DoorDash or whatever and just order from 2 different restaurants. Or have her look at the menu before you order and pick what works for her.", "I think you should break up tbh. I’m like you, I love trying out new foods from different cultures and I agree with you that there’s probably some amazing dishes that I haven’t tried out yet and am missing out on. \n\nThe fact of the matter is that you have a huge incompatibility with her. It’s not an issue if she doesn’t like going outside her comfort zone food-wise but it’s a problem that she never compromises. Meaning you’re always defaulting to her choices and you don’t get to explore any of the places you were looking forward to — that would seriously bum me out and I can imagine can lead to resentment because in our minds we’re incapable of understanding why someone can’t just take a bite of something, try it and be done with it if they don’t like it. Right? Like JUST TRY IT. \n\nSo I can see you thinking that buying 5 different dishes just for her to try is an act of love (I’d love that) but she doesn’t share your mindset so to her it feels like you’re taking away her autonomy. That’s why she pulled that super petty move and ordered a dish she knew you didn’t like. \n\nUltimately? You either stop trying to get her to try new foods and just order separate meals from different restaurants or you just go your separate ways. You should also start asking her what she wants instead of guessing — she’s told you she doesn’t like surprises multiple times now so it’s about time you get it. She has a much different mindset than you when it comes to food and you need to respect that if you want to be together. That being said, she could afford to be more flexible. Both of you need to have a serious convo about how to deal with this moving forward because it’s not just you that needs to change. You should both feel equally respected. \n\nESH", "NTA... but but but... why can't you order from two different restaurants???  Would she throw a tantrum if you ordered her food from her fave restaurant, and yours from another? \n\nAnd go find yourself a food trying buddy.  And if she has an issue with your indulging a passion without her then she can go eat rocks.", "INFO: Is your GF on the spectrum or have some sort of sensory processing disorder related to food? Is it possible that she has [ARFID (Avoidant-restrictive food intake disorder)](https://centerfordiscovery.com/blog/arfid-adults-not-just-disorder-childhood/)? \n\nJust asking because sometimes people really are just super picky and closed minded, but other times there is something medical/mental health-wise behind the pickiness. An extreme level of pickiness and an insistence on always sticking with “safe” foods from the same restaurant just sounds like it could potentially be something more going on instead of your GF being stubborn. \n\nThat said if there *is* something medical behind her pickiness that doesn’t make it OK for her to be rude or petty about food. Just means you guys can understand what’s going on and how to work with it.", "NTA just stop ordering her food and taking her to restaurants. If she wants to throw a tantrum over food she has never even tasted, then stop trying and if she gets mad let her be mad.", "Next time just order her a vat of Iranian yogurt. NTA.", "YTA.  You keep ordering without asking what she wants.  Just ask her what she wants & there won't be a problem.  It doesn't take a genius.", "ESH\n\nYou for repeatedly trying to treat your girlfriend like a toddler that won't eat her veggies and her for saying she'll try something new but planning to just awkwardly sit in the restauraunt and not eat once you get there.\n\nI'd never just order food without asking my wife what she wants unless for some reason I can't get an answer from her before I'd need to order, like she is napping or something.\n\nI'm confident in my ability to order something she'd at the least be fine with but...why wouldn't I ask if I can?\n\nHer being picky is understandably frustrating but at this point it is what it is. She isn't a child for you to try to cajole into trying something new. She clearly doesn't appreciate you trying to get her to expand her palette or surprise her with food you think she'd like.\n\nIn the end, you'll have to fulfill your desire to try lots of food without her being a part of it. Whether that means trying out food with a friend or finding a partner with similar food sensibilities is up to you, but trying to change your girlfriend is not going to work out.", "YTA\n\nI am not a picky eater but I do know what I don't like and it drives me crazy when people think they know better than I do what I like or should like.", "I wasnt trying to get back at her. The Indonesian restaurant I ordered 5 dishes thinking she'll eat and like at least 1. She loves those dishes. If only she had tried them.\n\nYesterdays one, I ordered from her favorite restaurant. Dishes she loves and orders everytime we go there.", "I agree the gf is closed minded and petty, but I don't see where she's preventing op from eating wherever he chooses. She agrees to accompany op while he eats but declines to order for herself. But it's not good enough for op that HE eats at his chosen restaurant, he insists SHE must also eat and when she doesn't cave he makes the choice to change restaurants.\n\nHe could visit those restaurants alone, with a friend, order separate takeouts, or simply accept his gf will go but not eat. If none of those solutions are acceptable and SHE MUST EAT, he's the one being controlling.", "I completely agree with this! I’m a picky eater but I’m willing to try new places and dishes. If someone suggests a restaurant I’ll look up the menu so I have an idea of what I can order that I will probably like.", "Yesterday the order was from her favorite restaurant. What more can I do. Issue is that I didnt ask her. The order included 2 skewers of what she wanted to eat.", "You are right. I think ordering 2 items are they way to go. 1 for you, 1 for me. This is leading to conflict even if I were to order the entire menu.", "Why is it so hard for his gf to tell him what she wants to eat off the menu? You can’t only place blame on him. She also agreed to try different foods but didn’t so she went back on her work.", "This is the way.\n\nMy hubby isn't a very adventurous eater, but he will try. I've just found that MY pleasure in trying new foods is lessened by being anxious about him enjoying HIS meal. We've also found\"fusion\" type restaurants work great for us.", "No food was ever wasted. I put it in the fridge and ate them/will eat until they are gone.", "Yep, let her eat eggs. They seem to be a go-to tantrumeal anyway.", "My thoughts almost exactly. Not sure of their ages but this girl sounds like she’s 8", "But at that point, why even bother being partners? Maybe it could work if the problem is only about food preferences.\n\nIf she is so picky about what she won’t try, she should never leave it up to OP to choose the menu when they are planning on eating together. And if OP wants to try out new things, she should not be stopping him or be bitter about him eating without her. And OP should just give up forcing her to eat new things. Some people are picky for life. Accept them for how they are.", "Wish it was that easy.\n\nWe once visited Vegas. She ate French fries the entire time we were there. Couldnt enjoy properly.\n\nHad a chance to go on a discounted cruise once. Couldnt because she was gonna starve there.", "Unsure if you read the full text.\n\nYesterday the order was from her favorite restaurant. Multiple dishes she always likes to eat.\n\nShe was unhappy I didnt ask what she wanted. When asked what she would have ordered (after the food har arrived she said she wanted lamb bbq (1 serving is 4 skewers). One of the dishes I has ordered was mixed bbq which has 2 lamb skewers.\n\nShe was offered both. But declined and was pissed because \"why didnt you ask\".", "Not really. She trusts her sister in law, anything the SIL eats she eats too. Adventurous stuff too.", "Mast o khiar or mast o mosir 🥺", "How do you know that she loves those dishes if she has never tried them?", "Still - why order 5? If you ask, you can get what she wants at that moment rather than order too much\n\nESH - all seems rather childish to me", "Honestly, I would seriously consider if this is a relationship you'd like to remain in... You're clearly not communicating well, you're both petty, although she's certainly way worse than you. Can you really see yourselves 20 years from now, still ordering from that one approved restaurant and still fighting over it? NTA - and you can do better...", "She tried to get back at you. That was wrong of her. Hence me saying you are NTA.", "But why not ask her what she wants? She might something, doesn't mean she wants it in that moment.", "But yesterday, why didn't you ask what she wanted BEFORE ordering?", "YTA for the amount food wastage your doing.\n\nJust ask her what she wants,it's not that hard.", "There is nothing in OP’s post to indicate that for this meal, he asked her what she wanted before he placed the order.", "Have you ever asked her *why* she likes the foods she likes and dislikes the foods she dislikes? Is it a texture/taste/smell thing? Do new foods make her anxious? Etc. \n\nIf you can learn something about why she eats the way she eats that might help you guys figure out what to eat better in the future.", "The were identical to some dishes she loves. Even better in certain ways. Crispier chicken, flavorful rice. Good sauces.", "Right? This whole situation seems exhausting.", "Their is nothing in OP’s post that said his gf looked at the menu before asking OP to order food. He specifically ordered meals that he knows she would eat. She said she would new foods but went back on her word. She lied to him and then she ordered something he wouldn’t eat on purpose.", "She'll give random reasons depending on when you ask. Looks weird, smelly funky, chefs could be dirty, dont know of the ingredients.\n\nShes never tasted Steak in her life because raw meat is gross to her. Asked her to try a well done steak but then she says it stinks (without ever smelling it).\n\nShe does eat Mexican and Thai though sometimes. Which I dont get why.", "So you acknowledge they are different, but assume she will like them (and especially that she will like them better) because *you* think they are better than the ones she likes.  But different people have different palates, so what tastes good to you may not taste good to someone else. \n\nYour girlfriend is not just an extension of you, she is a fully independent, autonomous human being in her own right.  If you cannot respect that, then you have bigger issues in your relationship than what food to order.", "You don’t get to police what your adult GF eats. You are treating her like a child. Her taste in food is particular. That’s her decision. You don’t get to force her to meet the standard of what you think the perfect GF should be.", "The difference is that you are assuming certain events happened even though nothing in the post suggests they did, while I am assuming things happened as OP said they did without inserting imagined additional information.", "He ordered meals that he thought she might eat.  10% different. Turmeric vs cumin. Big difference in taste but only 10% different.\n\nGrilled vs fried\nMayo vs yogurt\n\nAll things that turn a food from edible to inedible for some people.", "Or maybe he’s been paying attention to the person he’s dating and knows the types of things she usually likes. She decided to be petty here", ">So you acknowledge they are different, but assume she will like them (and especially that she will like them better) because you think they are better than the ones she likes. But different people have different palates, so what tastes good to you may not taste good to someone else. \n\n100%\n\nAll she had to do to prove me wrong was to have 1 spoonful. Then tell me this isnt what she likes.\n\n>Your girlfriend is not just an extension of you, she is a fully independent, autonomous human being in her own right. If you cannot respect that, then you have bigger issues in your relationship than what food to order.\n\nI wasnt trying to get her. I ordered something that was 10% different to what she likes. I had thought it was a dish that was a 10% improvement on the dish she liked. It was meant to make her happy. But I did learn my lesson.", "Then girlfriend needs to step up in the relationship. They can’t always eat at her favourite restaurants just because she is a picky eater. When your preferences impact your relationship that way, you need to realise how selfish you’re being. Relationships are about give and take. All she does is take.", "She. Gets. To. Make. Her. Own. Choices. About. Her. Own. Body.", "See this is why I think you’re at least part of the problem: she didn’t need to prove you wrong. That’s the thing. She can just say she doesn’t want to eat that.\n\nI think she sounds a bit picky (one restaurant?) but people are allowed to be picky. She also eats lamb and I’m super confused why she only likes one restaurant but it doesn’t sound like she’s so picky that she only eats chicken nuggets or something so I don’t quite get her food dynamics but whatever it is, she does get to say she’s not eating a thing. That’s totally fine to do—any adult can do that.", "You know she doesn’t like to try new things. Having one spoonful is trying something new. It’s possible she’s afraid to try food she isn’t sure she likes.", "Do you even hear how controlling you are, demanding that she eat food she doesn’t want to satisfy you?  This relationship sounds toxic.", "OMG. No. She doesn’t have to prove *anything* to you. Your behaviour is controlling. She’s an adult. You don’t own her.", "You’re not wrong BUT it still doesn’t give OP the right to demand she take a bite to prove to him she doesn’t like it. And here’s a crazy thought - with take-out, they can each order from their favourite restaurants separately.", "How the hell did this devolve into a discussion about body autonomy!? This is an utterly ridiculous sexist take.", "Then she should be a grown up and order her own damned food.", "He. Literally. Just. Ordered. Her. Food.", "What are you talking about. She asked me to order food and I ordered food I thought she would like. Ffs\n\nThis is what I would do for anyone that I think I know", "This is the point you exit the thread immediately or you go insane", "You are projecting your own sexism. I would take the same position if the genders were reversed.", "And then got pissy and punished her when she decided to eat something other than what he chose to order.  That’s where the controlling part comes in, and it’s the part you are conveniently ignoring. \n\nAll of this could have been avoided if she had simply *asked her what she wanted him to order for her*.  But apparently respecting her preferences and her right to choose her own food was too much for him.", "But she has told you before that she would rather you ask her what she wants.  If you did ask and she said to go ahead and order whatever you wanted, I would be on your side.  But there is nothing to suggest you did that.\n\nI have been with my husband for over 20 years.  99% of the time, I can look at a menu and know exactly what he will order, even at a new restaurant.  But I still don’t plow ahead and order for him without asking him first because I could be wrong and he should be able to choose his own food.", "You're just generally not getting it are you?", "Everything in AITA seems to come back to this issue. No matter how irrelevant it is tot here subject matter. You are right. I’m out.", "At no point did he get pissy with her or “punish”. She was the one who intentionally ordered something he didn’t like to be petty and “get back at him”. \n\nAll of this could have been avoided if she just told him what she wanted when he said he’s ordering food like a normal person", "Wow, you're really running with your own head-canon here, aren't you?\n\n*She* was the one who did the punishing, by ordering a dish (and only one so he had no choice) that he's tried before and doesn't like. He next ordered several dishes that she's had before and liked and ordered more than once herself, from her favorite restaurant.", "Are you delusional? You’re literally making up in your head that he wronged her in some way. Do you hate all men? Is that what this is?", "Unlike you I am not psychic. I didnt know she wouldnt eat it the first time when I was ordering the Indonesian food.\n\nTo add. When I said I am ordering food, she replied with \"get me something too\" and disappeared somewhere in the house. \n\nSo naturally I ordered her something."]}