{"id": 20819, "submission_id": "14lapq3", "title": "AITA for snapping at an acquaintance for repeatedly bringing up I matched with her on a dating app?", "selftext": "Throw away. \n\nI (31F) and my (26F) partner have been together for about a year now.  Before I met her, I briefly tried a dating app and nothing came out of it so I uninstalled the app.\n\nAnyway, we met with a friend (Nat) and her partner Sally (who is also our friend) for a drink. Nat also brought her friend (Liz) with her which is fine. The more the merrier. So we introduced ourselves and soon after that, Liz mentioned that I matched with her on a dating app. Everyone was surprised. I laughed and mentioned it's a small world. I also said I only used the app for a short time and I don't remember who I matched with as it was more than a year ago then quickly followed that I don't even remember what I had for breakfast. Everyone laughed and we continued chatting and drinking. However, throughout the night, Liz kept bringing up the dating app thing. Which was starting to annoy me and I could tell that my partner was starting to feel uncomfortable. I brushed my annoyance aside and mentioned that we should talk about something else because I really don't recall. Then as the night goes on Liz moved on from the dating app match thing to saying that if she had matched me back that time then I would not be together with my partner now. At this point, I just snapped at her and told her to \"quit it\" as I don't even remember her or matching with her and it's rude to say something like that. We left shortly after that. \n\nSo we got back to our apartment and I checked my phone. I got a message from Nat saying I'm an AH for snapping at Liz like that and she was just trying to befriend me and my partner by making conversation. I just ignored her message. To my surprise, Sally also massaged me and said she thought Liz was being weird and she understands why I reacted that way. \n\nSo, AITA for snapping at an acquaintance?", "created_utc": 1687961789, "permalink": "/r/AmItheAsshole/comments/14lapq3/aita_for_snapping_at_an_acquaintance_for/", "score": 946, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1. AITA for snapping at an acquaintance for repeatedly bringing something up?\n2. I may be the AH as I may have over reacted.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. This person was making you and your partner uncomfortable and being disrespectful towards the boundaries of your relationship. You had every right to shut it down. It was likely even more distressing for your partner. You did the right thing removing yourselves from the situation. \n\nYour friend saying otherwise is being unreasonable.", "NTA. Liz was disrespectful as fuck not just to you but your partner. Liz is bitter because she wants you still. If Nat can’t understand that, then she needs to be limited contact then", "Nta. She was inappropriate and out of line to mention it more than once.", "NTA - Liz sounds socially awkward.  I would've snapped at her too for her digging in like that.", "NTA - Liz sounds like she was jealous and who TF remembers who they matched with over a year later. Sounds like you dodged a bullet. \n\nAnd if your friend can’t see where you’re coming from, then that’s a whole different conversation you need to have once she calms down.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nThrow away. \n\nI (31F) and my (26F) partner have been together for about a year now.  Before I met her, I briefly tried a dating app and nothing came out of it so I uninstalled the app.\n\nAnyway, we met with a friend (Nat) and her partner Sally (who is also our friend) for a drink. Nat also brought her friend (Liz) with her which is fine. The more the merrier. So we introduced ourselves and soon after that, Liz mentioned that I matched with her on a dating app. Everyone was surprised. I laughed and mentioned it's a small world. I also said I only used the app for a short time and I don't remember who I matched with as it was more than a year ago then quickly followed that I don't even remember what I had for breakfast. Everyone laughed and we continued chatting and drinking. However, throughout the night, Liz kept bringing up the dating app thing. Which was starting to annoy me and I could tell that my partner was starting to feel uncomfortable. I brushed my annoyance aside and mentioned that we should talk about something else because I really don't recall. Then as the night goes on Liz moved on from the dating app match thing to saying that if she had matched me back that time then I would not be together with my partner now. At this point, I just snapped at her and told her to \"quit it\" as I don't even remember her or matching with her and it's rude to say something like that. We left shortly after that. \n\nSo we got back to our apartment and I checked my phone. I got a message from Nat saying I'm an AH for snapping at Liz like that and she was just trying to befriend me and my partner by making conversation. I just ignored her message. To my surprise, Sally also massaged me and said she thought Liz was being weird and she understands why I reacted that way. \n\nSo, AITA for snapping at an acquaintance?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA\n\nSally is right!", "NTA. And good on you for ignoring the message. No reason in engaging in a pointless argument to discuss actions that were completely justifiable. Continue to not respond to it.", "NTA she was absolutely flirting with you and disregarding your relationship right in front of your partner. You were right to shut her down, and I think the way you handled it was still pretty kind given what she said", "NTA.  You were much nicer than I woulda been.  She was told multiple times you didn’t recall it and it was clear that that topic of conversation was something to be moved on from.  She was fixated on something that was making others uncomfortable and once she made that comment about you and you current partner, I don’t blame you for snapping at her.  You were standing up for and defending yourself and your partner.", "NTA- liz was definitely up to something and it good that you said something especially because your girlfriend was feeling uncomfortable.", "Mentioning it once is kinda awkward but not that bad.\n\nMentioning it again might be a bit tactless, but hey, maybe she is an awkward person and really tried to engage with the group.\n\nMentioning it a THIRD TIME, plus saying op wouldn't have been with their partner if they hooked up with her (Liz) is offensive and gross and SHOULD be called out", "That's what I was being annoyed about. I could tell my partner was feeling uncomfortable and she is non-confrontational. Thank you for your insight!", "Yeah I think Liz may have problems with social settings too. But still the OP is NTA", "Or she may have consumed too much alcohol. The post mentions that they all met for drinks. Still doesn't excuse her behavior.", "Thank you. I'll let it pass in the meantime then I'll have a talk with my friend about it.", "NTA. The WLW dating pool is small and there is ALWAYS some overlap. My current partner and I went out with at least three of the same women before we met each other. It's just how it is. But part of what allows lesbian social circles to continue to function is that you don't harp on it or bring it up when it's not welcome!", "That is a weird way to befriend someone if you ask me. Sounds more like she wants to date you still and is still reeling from not getting that chance.\n\nNTA.", "NTA. Liz is a creep.", "Nah she was being a weirdo bringing it up. Keep your head up king.", "NTA", "NTA. A rude acquaintance.", "NTA It was weird of her to continue bringing it up in front of your partner and after you tried to brush it off several times. She should be embarrassed.", "Lol NTA we should say quit it more often it’s just perfect", "\"If I matched back, you wouldn't be with your partner right now.\"\n\n\"... I highly doubt that.\"\n\nNTA", "Liz was hitting on you in front of your gf. I would understand bringing up the matching thing once, to get it out the way.  Personally I would do so in a, \"you didn't need tinder to find your perfect match,\" and then move the conversation on. \n\nI would ignore Nat. She's trying to defend her friend but Sally is right, it's was weird and you had every right to nip it in the bud. NTA", "Exactly. Heck I’ve been to parties with more than one ex present. We all behave like civilized people and generally don’t bring it up unless it’s in passing or truly relevant. I only once in my life exited a social situation because an ex was present, and I did that quietly and discreetly - it was because we had recently broken up and I was still having a lot of feelings.", "Just because you matched on a dating app doesn't mean that you would have clicked in real life. The app most likely looks for certain patterns then puts the people together (like if you say you like blue and Chinese food, the program would search for people who like blue and people who like Chinese food and match you to them).\n\nLiz was trying to diminish your current relationship and trying to insinuate that you missed out on a 'good' thing. Ignore her and tell Nat her friend was making you and your partner uncomfortable.", "Pick-me-girls do not like to not be picked. Liz knew what she was doing, she was trying to cause a fight with your partner. NTA", "She wasn't trying to befriend you, she was trying to pick you up and not taking no for an answer. Be glad you deleted the app when you did and did NOT end up with her. NTA", "NTA not only was Liz being weird, she was being outright rude to you and your partner.   How exactly is saying \"you wouldn't even be with your partner if it's given you the time of day back then\" trying to befriend you and anything less than insulting to  your partner.  \n\n\nShe was absolutely trying to start some drama and trying to get you to see what you \"missed out\" on.   You didn't remember it or even care so she kept trying to drag it up stove you clearly weren't as infatuated with her as she hoped or expected you to be because her who was bruised.", "NTA, after the first couple instances of her mentioning it and you not engaging on the subject, she should have left it alone. Given the context of it being the first time IRL encounter, it doesn't even have the legs of it being a call back joke or a somewhat inside joke. Like if it turned out you two are polar opposed a joke of \"dam dogded a bullet there eh?\" or \"See, this is why we wouldn't have worked, your allergic to fun\" would be more in line with a friendship based around gently teasing. It's also weird to say, \"She'd be with me, not you if we dated,\" to your partner because what are you meant to do with that? It's making your partner seem like they are lesser but she also is putting down her own partner, being like, \"You are option B.\" \n\nI can understand why your friend messaged you being upset. They are likely embarrassed that the night didn't go the way they wanted to. Hopefully, the next time you guys get together, you'll all be able to move on. Good luck with it all.", "NTA", "NTA. It definitely was a weird thing to bring up in front of your current partner. As soon as you attempted to shut it down, she should have stopped and she didn’t.", "NTA, she was clearly making you and your partner uncomfortable and kept going even when you tried to change subject", "NTA Nat is out of line for not sticking up for you. Liz is out of line on so many levels.", "NTA. She should have avoided mentioning it even once. Who would ever think that bringing up something like that is a good way to befriend a couple?? \n\nShe wasn't befriending. She's just a jealous a**. You did the right thing by shutting it down.", "> saying that if she had matched me back that time then I would not be together with my partner now\n\nI would’ve responded by thanking her, effusively and at great length, for not matching me.\n\nThe vibe to aim for would be ‘holy crap I really dodged a bullet there’\n\nNTA but maybe you should’ve been a little bit of one", "NTA.  She repeatedly brought something up after telling her to stop AND THEN had the nerve to mention your partner in all of this.  This was not making friendly conversation...this was uncomfortable and unwanted.", "NTA. Weirdo behavior. Avoid Liz she's the type to live to stir up drama. Very inappropriate. Don't go out with her alone. Next thing you know she'll be saying you made a pass at her.", "NTA, although I think \"snapping\" is really a good thing.  Better to value respond, \"Well, I've met you now and I can assure you that we wouldn't have made it to even a second date because you are very annoying\".  Ok, maybe my way isn't better.", "Yes that's what pushes it over the edge from awkward connection to rudeness-the implication that you would not have be with your current partner if you had given this person a try. \nHow on earth she would think \"oh I know what would make these strangers feel comfortable with me!\" at this idea is absurd.", "I can be socially awkward and sometimes think things are funny that other people aren’t. I tried to put myself in their shoes and see if she thought they would all laugh about the coincidence…but I don’t know…I think once OP mentioned they should talk about something else after the second mention, even I would get the hint. I think I agree with OP being NTA and right to say something.", "NTA - *Liz moved on from the dating app match thing to saying that if she had matched me back that time then I would not be together with my partner now.*\n\nThis is not making conversation.  This is making a statement.  And to make it when your partner was with you was a dick move.  She was challenging your partner to her face.  There was nothing \"friendly\" about it.", "NTA, it's extremely rude to mention in front of someone and their partner that if you had gotten a date with one of them before they met they wouldn't be together.", "You already know you aren't because Liz was being rude to start. NTA.", "You already know you aren't because Liz was being rude to start. NTA.", "I'm willing to bet she didn't get that many matches and that's partly why she's so fixated on you. I don't even remember what most of my matches look like, except for the ones I actually dated of course. NTA", "NTA. Very bizarre and inappropriate behavior from Liz.", "NTA.\n\nYou tried to be polite about it and she didn't get the message, and from what you've described, you weren't even actually rude when you snapped.\n\nShe may not have actually had any ill intentions, but constantly bringing up something and making people feel awkward and uncomfortable even when you've been told to stop is just weird at a certain point.", "She was trying to befriend you and your partner by bringing up yall matched on a dating app multiple time no she wasn't she was trying to make you and your partner have a fight so she could fuck.", "Nta Liz sounds like she was jealous. There's no way she was trying to be your friend. If she was trying to be friendly she would have drop that whole dating ap from the start and not kept bring it up. She was rude and being disrespectful to your relationship because she said had she match back you both be in a relationship. Nat is wrong to put the blame on you. You did nothing wrong even sally is on your side.", "NTA. Liz shouldn't have constantly pushed to have a conversation about the dating app match. I don't blame you at all for snapping at her. She was rude and inconsiderate.", "NTA. Nat has shown she is not your friend- she prefers creeps.", "Nta", "Info : have you told your friend you don't want to be friend with her ? That she was not friendly ? Like where's the aita here", "NTA. Liz needs to let go", "one does not befriend another and their partner by bring up the dating app and how thither matched.\n\nOnce is fine.  you all had a laugh and moved on.\n\nLiz brought it up a few times and that would make most people uncomfortable.\n\nNTA", "Liz looked jealous. There is no way she is trying to be your friend", "NTA This Liz is troubling and I’m really glad you stood up for self and gf. It really should have been on friend who brought Liz to shut this down. I’m really sorry you ended up having to deal with it but I think you handled things perfectly. Super weird behaviour.\n\nE: extra word", "Too bad she’s nonconfrontational because of this happened to my partner I’d say “well you did match and he doesn’t remember you so I guess you’re not really a threat now are you?”", "NTA. Her bringing it up the first time I think is fine like \"haha small world\" polite conversation, as you said, and then it should've ended there. Her saying shit like \"if we'd matched you wouldn't be with your girlfriend\" is weird and very much makes it sound like she's hitting on you. Very out of line.", "NTA. Clearly Liz believes that you were the one that got away. Mentioning it so many times proves she was  hung up on it. You weren’t wrong for losing it on her because she was being completely inappropriate and if your friend can’t see that, that’s anew issue within itself.", "NTA it’s not “befriending” to tell someone or their partner that they would be with you instead of them if you two matched. \n\nThat’s how you make enemies, not conversation.", "There's probably less AH ways of shutting someone down but it's not on you to come up with them, she was the one making everyone uncomfortable. Since she was single and meeting 2 couples out, I wonder if she felt like a 5th wheel and felt the need to prove she's attractive or some weird competitive nonsense.", "NTA. I’d love to know what response they think would have been appropriate… “If we’d matched faster you’d be here with me instead of your girlfriend!” \n\n1. “Nah, my girlfriend is the only one for me, I’m sure I would have dumped you quick enough.”\n\n2. “Oh yeah, bye (girlfriend), I swiped right before we met so I owe it to her and myself to give that a go!” \n\n3. “You’re right! (Girlfriend), wanna try a threesome?”\n\n4. “Funny that I made such an impression, I guess you don’t get many matches huh?” \n\nI’m pretty sure your response was about as appropriate as she gave you the chance to be. You didn’t encourage her when she brought it up the first time but she kept bringing it up, eventually you had to be direct.", "She keeps bringing it up because she’s interested in you.  You were right to shut her down.  Befriending someone isn’t disrespecting their relationship.  If that’s what Nat thinks friendship is, she needs to see someone.  NTA", "Pick me vibes all the way 🚩", "They're all women.", "NTA. You already tried asking Liz politely to drop it, and that didn't work. Liz shouldn't have kept bringing it up, and Nat shouldn't have expected you and your partner to sit there and take it to \"keep the peace\".", "NTA\n\nI think there’s a reason she’s still single.", "Her saying you would be with her and not your partner is not ‘trying to befriend you’. It is trying to establish some kind of dominance. You were right to shut it down. NTA.", "NTA. You are finding that the dating app world can be surprisingly small. Even though you and Liz allegedly matched on the site, it's significant that you two didn't connect! All of Liz's suppositions of what-if are pointless. She may have been bowled over at the coincidence of meeting you. You must have left quite the impression if she remembered your face after so much time had passed. You, on the other hand, didn't recall having seen her at all.\n\nLiz may not have meant any harm, but she was being socially tone deaf not to realize you didn't want to be held hostage as she went down memory lane over an encounter that didn't actually happen, never would have happened, and is meaningless.\n\nYour only gaffe was snapping at her -- but I understand why you did so. You were right to ignore the commentary from Nat. You should also ignore commentary from Sally, even though Sally agrees with you. You are an adult and can think and act for yourself. Really, the only persons whose opinions matter are yours and those of your partner.", "NTA, she clearly didn't gave good intentions. if I were you I would have said \"oh I used that dating app but didn't really find anyone of value or interest so deleted it. Thank God my partner came along\" or \"yikes I must have been desperate back then\"\n\nThen again, im petty", "NTA. Liz was not trying to befriend BOTH of you, she was trying to call dibs. So obvious it's embarrassing. Glad you called her out.", "The person you're replying to is talking about how they would react in regards to their relationship, not necessarily the one described here.", "NTA", "NTA, that chick was an attention hog that seemed incapable of conversation that didn't focus on her. Refuse to ever be in her presence again and if your friend gives you shit, dump her as well!", "NTA", "NTA \n\nShe wasn’t trying to befriend you. *She was trying to say you need to notice her and she is better than your partner*\n\nShe is a rude asshole. \n\n“I don’t remember you” is the perfect responses. Over and over and over again", "NTA. She was being weird and kind of territorial.", "NTA lesbian community is a small world and we’re all about 2 or 3 degrees of separation.  Her saying those things was really wrong.  She was hitting on you in front of your partner.  Not okay", "\"Sounds like I dodged a bullet, then.\"", "NTA\n\nYou adroitly responded, deflected and redirected the repeated dating match mentions. She challenged your partner and how strong your relationship is with that last comment.\n\nI don’t see how saying “quit it” and pointing out her rudeness is snapping. Snapping would have been Real Housewives face slapping. \n\nWhy is your mutual friend scolding you  and not outraged by Liz’s behavior", "NTA she crossed boundaries and made you and your partner uncomfortable, i would’ve had some choice words to say to her as well", "NTA, but for next time when she says \"if I had matched you back you wouldn't be with her\", the answer is \"haha, oh yes I would, you're really not my type\".\n\nShe sounds jealous and kind of stalkery.", "NTA\n\nMentioning that once, no harm done. You can all laugh about it! \n\nBuilding up on it as \"had we met, you and current partner would not have been an item LMFAO\" over and over is ridiculous and it's giving vibes that she did that on purpose. \n\nNTA, keep your distance from her, you don't have to entertain this person, nor having her around to make you guys uncomfortable about your relationship", "A foruth time and she'd escalate it to \"What do you even see in your partner!! I'm **hawt,** why didn't you go for all this!?\"", "Boom! I get it that partner is non-confrontational but damn, better start training to be stealthy confrontational! Like \"I highly doubt that, lol! What's for dessert?!\" and not give a care about that person xDD.\n\nBe petty like, if they see each other again and that pick-me girl starts again, OP's partner can say \"Oh yeah, you're the one he doesn't even remember, lol! Lisa, right? No, wait, Zoella?!\"\n\nThrow the uncomfortable back!", "I think it's the other way around? \nAs I read it, OP matched her. But she didn't match back? \n\nWhich only makes the conversation even more weird tbh. \nSounds like now she saw OP and what she's like in a social setting. She got annoyed that she didn't match back a year ago.", "NTA. Been in this same situation and I got way more confrontational than you. As far as I’m concerned you were well within your rights to tell her to shut the fuck up and then turn right to your friend and ask what the hell.", "NTA- She didn't just bring it up once she brought it up multiple times throughout the night. You're obviously in a good relationship and aren't looking for another one. If she didn't want to get snapped on, then she should have read the room and moved on. If she wanted to make friends then bringing up the dating app was the wrong thing to do, as that applies to her still looking not trying to make friends. She could have tried to find common ground to talk about instead.", "NTA\n\nThat wasn't befriending, that was hitting on you in front of your partner. She has an unhealthy fixation.", "NTA - she was trying to befriend you and your partner with those comments? I think not. Very rude person, and you did the right thing standing up for your relationship/leaving  the situation", "'You'd be with me if you'd met me first' is a hell of a weird thing to say to someone you've just met in front of their spouse.\n\nLiz is really odd.\n\nNTA.", "Well some people remember alot of things 🤭\nStill, doesn’t change this situation. You are right, OP was right.", "Yes, and Liz was even more rude in that she said \"if I had matched you back you wouldn't be together\" meaning OP picked Liz but Liz didn't pick her back, so Liz rejected her back then but if she hadn't they would be together. So it's also a dig that Liz didn't want her but OP wanted Liz. Narc vibes all the way.", ">I think it's the other way around? As I read it, OP matched her. But she didn't match back?\n\nOoohh I see! Yes, it does make it weirder, now, lol!\n\nShe's defo now thinking that she lost a good chance. But if she's annoyed then she shouldn't be \"taking it out\" on them, the idiot. It's like OP dodged a bullet xD", "> As I read it, OP matched her. But she didn't match back?\n\nI only used dating apps briefly, but in all the major ones I tried you both had to match with each other to even know, right?", "Oh, I agree. OP definitely seems to have dodget a bullet there. \nShe had never met OP or her gf before. And that's how she acts? Ouch. especially when it was herself who didn't match back. Who even remembers someone who matched you a year ago. Unless you have a insane good memory.", "\"If she had matched me back, I wouldn't have been with my current partner.\" That's the line I base my comments on, haha. \n\nBut I honestly don't know. I haven't used dating apps in a lot of years. \nBut what I hear from friends, most places notifies you when you have a match, you can then go see who matched you, and decide if you want to match them back and the talking can begin. \nSometimes, texting will be locked until you match each other.", "NTA", "NTA", "NTA, obviously, she was waay out of line.", "I remember matching with bots, but that's about it.", "And still Liz has no idea why she's single, lol.", "I agree, the comment about how OP and OPs partner wouldn't be together had OP met the match really moves it beyond awkward and into conpletely inappropriate/disrespectful.", "If this is the way Liz \"befriends\" people - she needs some serious help with communication.\n\nNTA. Good for you.", "A damn mystery that is.", "If she remembers him, might even be because she was like \"Look at this idiot, thinking he has a chance with me, LOL!!\"! Otherwise why be so memorable to her when she didn't accept the match? \n\nDunno, I'm spiralling here xDD", "NTA. Liz was being rude, even if she wasn't meaning to be.", "NTA", "No ure not. Liz deserved it. Wtf is she trying to do? Break u guys up while ur gf is there? Rude.", "This is so true. I know a lot of friends past partners who are also friends or acquainted with me.", "According to what she said (Liz), she did not match back. From what I recall, I used a dating app (exclusive for WLW) where you get notifications if someone liked/matched you. You can either match them back so you could start a conversation with them and view their profile OR you could pay for a subscription to freely see who liked/matched you."]}