{"id": 20822, "submission_id": "14lbu2n", "title": "WIBTA for banning my adult children from the kitchen?", "selftext": "I have 3 adult children and one daughter (15F) who live at home. My only bone of contention right now is that EVERY morning when I get up, the sink if full of dirty dishes. I clean up those dishes in the morning, grumbling all the while, and by evening when I start making dinner, the sink is full again. I use the sink for food prep, so that means I have to do dishes before I start.\n\nWe have a long-standing and long-ignored rule that dishes go in the dishwasher, or if they can't go in there, they are washed immediately. I remind them of the rule, but it is ignored because everyone assumes that I don't know who left the dishes. (They're right).\n\nI want to post the following on a laminated sign that will be right next to the kitchen sink\n\nATTENTION ADULT MEMBERS OF THIS HOUSEHOLD\r  \nDAUGHTER (15), Dad, and Mom are not your staff.\r  \nYou are responsible for putting dishes in the dishwasher (properly) or washing them immediately.\r  \nYou are not to leave any dirty dishes in the sink at any time. \r  \nThe next time I catch an adult member of the household leaving so much as a spoon in the sink, you will be BANNED from the kitchen entirely for two weeks. That will mean no cooking or microwaving food. That will mean no using any dishes, cups or silverware.  If you want to eat anything that is not served to you AT THE TABLE you will have to buy it in a restaurant. \r  \nI AM SERIOUS ABOUT THIS. NO EXCEPTIONS. \r  \nLove, XXXOOOXXXOOO\r  \nMom\r  \n\n\nI intend to follow through, although two out of three adult children can not afford eating out very well. But I feel like I  have to have a serious consequence to get through to them. WIBTA if I enforced this rule?", "created_utc": 1687964462, "permalink": "/r/AmItheAsshole/comments/14lbu2n/wibta_for_banning_my_adult_children_from_the/", "score": 366, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I know my adult children will call me an asshole if I ban them from the kitchen for breaking a long-standing rule about leaving dirty dishes for other people to clean up.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nThey are adults now, not children. They know what they are supposed to be doing, and choose not to do it.\n\nAdvice, get a camera and set it up in the kitchen so you will know who is just leaving dishes in the sink.", "NTA. \n\nThere was a recent post floating the internet with a mom that bought her young children their own set of dishes, each with their own color, so she could tell who was or wasn’t cleaning up. Maybe you should do the same for your adult children. \n\nPutting dishes in the dishwasher is a very basic and simple request. They should respect your time and effort enough to clean up after themselves.", "NTA - They're adults and should behave like adults. They need to know that just expecting you to do it isn't a solution. Again, they're adults. They should move out if they don't like it.", "NTA.\n\nThese are adults not children, they know better.", "NTA.  Put up the sign and follow through.  They’re adults and should know how to put the dishes in the dishwasher.", "Go ahead. Put up the sign!! Putting dishes in the dishwasher isn't hard. If you don't treat a space right you don't get to use it.", "Definitely NTA. I had the same rule. My mids in their 20's. I used to hear excuses about dishwasher being full so I told them dishwasher was only optional. If they couldn't use the dishwasher they were to wash the dishes and put them away. No dish ever was allowed in the sink. \n\nI stay up late and told them I'd be checking the sink daily at 2am. I don't care who is at fault. If there's a mess, everyone is woken up. The first night at 2am I found 1 spoon with peanut butter on it (everything else clean) and everyone had to get up and come down until it was cleaned. When I woke everyone up  I told them there was a huge emergency etc. Everyone was pissed when all they saw was the one spoon. That was the end of it. I never had the problem again.", "NTA... you can offer a get out of jail free cars, earned only after they wash 50 dishes.\n\nIf you can put a dish in the dishwash, thats next level lazy.\n\nOr you can have them buy thier own paoer plate and spoons.", "NTA but this is too passive. It’s time to stand up and be blunt. 1) they are still your children, age of majority or not; 2) they are acting like children; 3) your house, your rules.  Dishes in the dishwasher- no exceptions.\n\nThey may be “adults” but they are still members of the household so they get chores, too. If they don’t like that, there’s always real adulting where they pay rent and buy their own food and no one is there to clean up after them. Stop being a doormat to your kids.", "NTA - but walk away from the kitchen yourself.  As you say, it's not your job to tidy up after them.  If ANYTHING is left in the sink, you don't cook that night.  You order in for you, SO & 15.\n\nRemember, you don't have to know who left something to enforce consequences.  And if any of the 3 adult children finds something in the sink, even it it isn't theirs, they can wash it up.\n\nOR - you add a premium to their rent to cover OP-as-dishwasher costs.\n\n*Edited to add a bright idea.*", "NTA - I am not sure why people ask if your kids pay rent. Paying rent does not mean you don't clean up after YOURSELF. It's not like OP is making them clean house, wash everyone clothes and pay $1500 a month in rent. I love this idea! I know it sounds mean to people who think banning people from using the kitchen is unfair, but leaving your dishes for your mom to clean when she is also making you supper is immature to say the least. Tell them this is step 1. Step 2 is a camera. Step 3 is a hike in the rent to cover maid service. Step 4 is that all three can go rent an apartment together.", "INFO:\n\nHow much rent are the adult children paying? I would increase their monthly rent and I would also start assigning them chores they have to complete to keep the house running, just like your 15 year old has. Sounds like they are too comfortable living like slobs rather than adults. \n\nI would make all of them pay a monthly rent. But if they are willing to do weekly chores, then the rent amount could be reduced if the chores are completed correctly (mowing the lawn, vacuuming, cleaning the bathrooms, someone can be assigned to load and start the dishwasher every morning.)", "Quit cooking until they clean up.  Take the 15 year old out for food.", "Stop cooking and washing the dishes. Leave it there", "ESH\n\nMy dad tried this on me and my siblings when we were younger (not adults yet, but still cooking for ourselves). This did not work on us, because my mother and other members of the household would leave dishes and blame them on us.\n\nHowever, banning people from using the kitchen is a complete over-reaction. How do you expect to enforce this rule if you can't even figure out which of your children is leaving dirty dishes in the sink?", "[deleted]", "INFO - Your kids pay rent?", "YTA- I understand that you are frustrated. Your plan though not only involves banning people from the only place to prepare food, it (perhaps unintentionally) pits your daughter against her older siblings.\n\nThe adult children need to step up. The laminated proclamation banning kitchen use just isn’t the way to do it. Do you eat as a family? Could you insist on the adult kids cleaning up then?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI have 3 adult children and one daughter (15F) who live at home. My only bone of contention right now is that EVERY morning when I get up, the sink if full of dirty dishes. I clean up those dishes in the morning, grumbling all the while, and by evening when I start making dinner, the sink is full again. I use the sink for food prep, so that means I have to do dishes before I start. \n\nWe have a long-standing and long-ignored rule that dishes go in the dishwasher, or if they can't go in there, they are washed immediately. I remind them of the rule, but it is ignored because everyone assumes that I don't know who left the dishes. (They're right). \n\nI want to post the following on a laminated sign that will be right next to the kitchen sink\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA and as a parent with similar issues, I like it a lot.", "NTA... Good job. \nYou have to know what line they cant cross.\nMy rule is that my kitchen must be cleaned befor I will cook in it. I leave it clean. So if I am going to make the family dinner, I wont start till it has been cleaned.", "NTA they are adults and it is way past time they started respecting your shared space.", "INFO: If you can't enforce them washing the dishes before you get up in the morning, how are you going to ban them from the kitchen?", "NTA, but I don't think a note is going to do the trick. \n\nSomething a little more... Active.. might be appropriate. A note will be ignored.\n\nI know this is drastic, but something that could help is physically designating plates to a specific person. I.e write names on the bottom of dishes and have each person only own 1 of each. 1 plate, 1 bowl, etc. \n\nIf they keep leaving their own kitchenware in the sink, confiscate it and have them buy their own. The financial impact will eventually force them to correct this behavior, then you can return the normal dishes to the cabinet. \n\nIt's excessive... But I don't think a note will work. Trust me, my spouse has the same issue out of me. Lol", "Nta. I'm going through this. Have teens at home. I will share a few things that work, for me anyhow. One important thing... I removed more than half of my dishes to the basement so that there were only enough dishes for each family member plus a few extra so they couldn't just keep grabbing nonstop glasses.... Which they totally did..... The family didn't like this...bwahahh but it's because it worked :)\n\nAt night delegate emptying the dishwasher to a family member  SO THE DISHWASHER IS EMPTY IN THE MORNING. Then there is no excuse. They have to load their breakfast dishes into that empty dishwasher. Bam!!\n\nI was so fed up I would call my teen downstairs just to put their dish in the dishwasher. They eventually realized and didn't want the hassle of coming downstairs so they started to put their dishes in the dishwasher..", "I actually just discussed this with my husband. I hope it doesn't come to that, though. I hope a threat is enough, and I will just have to trust my luck in catching someone red-handed.", "Do this. And then have a movie night where you watch all the highlights. Add a bit on the end when you tell them how you feel when they do this. Then have your husband and your daughter say how they feel when the adult kids do this.", "I was going to suggest different coloured plates. And seriously putting dirty dishes in the dishwasher is a very low bar.", "I know that they are, and they do! And this feels a lot like treating them like children by offering a consequence. I don't want to be demeaning, but I am at a loss, since simple communication is not working.", "Yes, I caught one of them the other day, and she said she thought the dishwasher was clean. I explained the other option to her. And our house is really easy - we just use a soap wand with a sponge, so it's a 10 second task to clean a bowl.\n\nEDIT: narrator's voice: The dishwasher wasn't clean.", "&#x200B;\n\nI'm with you, I can't understand why this is relevant to the question. But to answer the question for the curious, as I said in another comment , one pays $250 and the other pays $100.", "One pays $250 and the other pays $100. That's another long story. The one paid $100 last year (she's 27) and the other one was in school (M22). When he got out of school I told him he could have one year of $100, just like F27 did, and next year it will be $250. Which is nothing, because, he literally eats $250 worth of food, anyway. He's a big boy. I am not going to hold my breath for them to move out. And I'm ok with everything else the way it is.", "Security camera will catch the dish slobs\n\nOP is NTA", "I would only ban them if I caught them red-handed. Others may ALSO be to blame, but sometimes someone has to be made an example of, maybe?", "They aren’t children though.  They’re adults", "I just don't know how to make them do that ... that's the problem! Plus, they can eat the food that I serve them.", "They are not denying their ADULT children food. They can buy it themselves or eat what's being served", "Would that make a difference? Yes, they do. One pays $100 and the other pays $250", "It's actually Daughter (15) whose job it is to clean up after dinner. It's not enforceable to have the adult kids do it, as they often leave for work etc right after. I am ashamed to admit that the adult children have actually no assigned household tasks.", "Feel free to adapt to your own purposes :-)", "Hopefully the threat is enough to get them to right their wrongs. But as a person who has had roommates who do this and worse (had one roommate leave a half-eaten bowl of ceral in his room so long that there was mold growing in it, couldn't go into his room after that without gagging on the smell of rotten milk), I just think they'll keep doing this. \n\nBut maybe cause you're their mom, they'll actually listen to you. I hope they straighten up, cause this is no way to treat family, much less roommates.", "Set up a camera in the kitchen. Tell everyone that you will know exactly whos leaving what where, and its time for them to start respecting you or there will be consequences. NTA, your house, your rules and they are disrespecting you.", "So I was just thinking about it, and if you really don't want to set up a camera right now, you just tell your kids you're planning on setting one up soon, and you won't tell them when.", "Cameras maybe?", "Except how would I make them use the right plates?", "Seems like punishment is the only way to go here. They're acting like children, why not give them a childish punishment to match the behavior? You tried communicating with them about this and they're not listening. This is the only way they'll get it.", "Adults deal with consequences too, the difference is if they were doing this to a roommate or partner they would soon find themselves on their own when no one wants to live with them. Kicking them out of the kitchen seems like a minor consequence when you could kick them out if the house instead.", "If she thought the dishwasher was clean she should have emptied it!", "I have a magnet on the front of my dishwasher that you can flip to show if its clean or dirty. Which negates this argument totally. For a mere £3.", "Info: Can I move in?! Please? I'll put all my dishes away. These kids have NO idea how good they have it.", "Rather than banning them from the kitchen, I would sit them all down for a family meeting and reiterate that ALL DISHES must be put in the dishwasher, always. That the sink is never a place to dump dirty dishes. If the dishwasher is full of clean dishes, put them away and then put your dirty dishes in. \n\nTell them you are giving them two weeks to change their behavior and if they keep leaving dirty dishes for you to clean up every day, all three of them will start paying $150 more in rent per month on top of what they are already paying beginning next month. \n\nMy guess is this will motivate them to start putting their dishes in the sink, and to also get on the guilty party if they witness one of their siblings doing it.", "It... Kinda makes a difference... If they're paying rent then it's not okay to ban them from the kitchen, which is ostensibly a part of their rent payments.\n\nNow, those rent payments seem really low to me. But rent is always dependent on area, and I have no idea how much a typical room + shared spaces rental goes for in your area.", "I'm surprised that the 15yo isn't resentful about having to do chores when the adult siblings don't", "Time to give adult children cleaning tasks. Even if it's a weekly chore.", "Camera in the kitchen. Legitimate suggestion. \n\nIf your adult children have that much of an issue respecting your home and your time they haven’t really earned much respect back from you. \n\nIs this a symptom of a larger issue? Are there other places where they expect you to keep mothering them? Laundry, cleaned rooms and bathrooms, purchasing their own toiletries, etc?", "I think simply by assuming they did and enforcing the rules.\n\nIf someone used someone else's plates, they should then get mad at *each other*, and that problem may then take care of itself.", "plain white paper plates with plastic cutlery all round apart from you, dad and the daughter who does the chores.", "Tell them you're yellow, you're red, you're blue. If there are any issues, they sort it out themselves. Put all the other plates away somewhere.", "It wouldn't matter; that's not your problem.\n\nThe person whose plate is left gets the punishment. If they are not the guilty person they need to enforce against the one who is.", "Right now theybare doing whatever because they know you can't tell. They'll get defensive over their own colour plates if someone else uses theirs and they get the blame.", "She is surprisingly not terribly resentful. The only reason I can think of is this kind of long story...\n\nWhen they were all young, I used to assign chores. They came to me after a year or two of this and said they really hate assigned chores (who doesn't?) and claimed they would rather volunteer for things. I said fine, full well knowing they wouldn't volunteer. But I was tired of the fighting and they weren't actually that much help anyway because, you know, being kids and all, so I just went on doing all the chores. \n\nBut the funny part is that after I had a major surgery and was not able to even lift so much as 1 lb, I had my neice and her husband come and stay with us for a while to help me with my recovery. They told my kids they needed to step up, and boy, did they. (I really only found out this part of the story much later). From that day on, my two youngest kids have never once let me help clean up after dinner. I mean, they kick me out of the kitchen. Now it's just the youngest, because 2nd youngest usually goes to work right after dinner. But on the days he is home, he helps, too. \n\nThe other two never really pitched in, and I am pretty laid back and non-confrontational, so I just let it go. I ask for help with a specific task, occasionally.", "They do their own laundry, and \"clean\" their bathroom. I do still buy toiletries, but I am pretty frugal, so if they want something fancy, they're on their own.", "I suggested the same, a camera in the kitchen and color coded dishes.", "That’s a good suggestion, except they will still be using pots, pans, etc.", "You WNTBTA. My suggestion is rather than go through the hassle of setting up a camera, let them know that if there are any dirty dishes in the sink ALL ADULT CHILDREN are banned from the kitchen for 2 weeks. That way they police each other....or \\*gasp\\* put any dirty dishes they see in the dishwasher.\n\nI had a teacher that did this with our homework. IF the entire class did their homework then there was no test on Fridays, or whatever day it was. He would go up and down the rows checking homework. Although he never announced who didn't do their homework it was pretty apparent when he walked away from a student's desk declaring a test would be given.\n\nI was not big on doing my homework at all but the peer pressure of having to do it or else be responsible for the class having to take the test was enormous, so in that class I did my  homework. \n\n&#x200B;\n\nFunny thing is if you did your homework the test should be a breeze.", "NTA. The first time this happened, you should have had all 3 in the kitchen ASAP to clean it. Yeah you don't know who made the mess, but it doesn't mean you don't hold ANYONE responsible, you just hold ALL OF THEM responsible.", "NTA. Time to lay down the law. You are their mom; they are used to being taken care of and they are expecting you to cave because you probably did when they were younger. (Which isn’t always bad - sometimes teenagers over extend themselves with school and sports and academics- my sister has to periodically take over her daughter’s chores during exam periods because her daughter gets so stressed - daughter is going to college in fall with engineering scholarships so not a slacker).  But adulthood means stepping up. \n\nI would tell them you will not be cooking dinner when the sink is full of dishes and will expect them to pay more rent to cover your takeout costs. Also they will need to pay for their own takeout separately.", "I would go further and not serve them dinner either.", "I'd go a step farther and install locks on all the cabinets.  But I'm kind of petty that way.", "NTA", "NTA  Your children are just some ones future bad roommates. They need to start taking responsibility for themselves sooner than later", "NTA. But the correct response would be to go pull all 3 adults into the kitchen and make them wash the dishes RIGHT AWAY. I don't care who dirtied them. Cause the ones that are innocent are going to make life very unpleasant for the culprit.", "I'd add that if you come into the kitchen and a sink full of dishes, you'll walk out and not cook or clean until they've been take care of. Not chase down people to do dishes - they already know they are there. Take your 15yo out for dinner. OK to dump this on your husband, he's obviously been dumping this problem on you.", "NTA.  I actually walked into the kitchen one day and threw the pots, pans, dishes, utensils, everything right into the middle of my son's bed.  He'd been warned.  In case you're wondering, it was a full pancake breakfast and it took a lot for him to get the syrup and butter out of the sheets and comforter.  Lesson learned.", "Why are people going right to \"get cameras in the kitchen\"???  These are adult children, living in your home, and I'm sorry but you're enabling their behavior.   *I clean up those dishes in the morning, grumbling all the while, and by evening when I start making dinner, the sink is full again. I use the sink for food prep, so that means I have to do dishes before I start.*  You're literally showing them day in & day out that there are no consequences, as they KNOW you'll always wash the dishes.  That passive aggressive note you want to leave will literally get laughed at, and probably have a plate put on top of it with a smiley face.  If you don't cook for them, there won't be any dishes to clean...adults should be taking care of themselves.", "NTA.  Your house, your rules.\n\nI recommend it look something like this:  The next time you wake up and find a sink full of dirty dishes, go wake all of them up and keep harassing them until they clean out the sink.  I would also refuse to make dinner and repeat the process of pestering them until they clean the dishes.  If they refuse, get take-out for the 3 of you and let the adults figure it out for themselves.  \n\nThis has been going on for a long time.  Unless you make it painful for them, they are not going to change.", "NTA", "I laughed but this is so great!", "That's an idea. We have WAY too many dishes around here.", "I'm a light sleeper and I can hear them in there at night. I just don't get up to see who it is. But I will surprise them with a spot check from time to time for the near future.", "Skip the warning, go straight to the cameras. You have given them enough chances. Putting dishes in the dishwasher is such a bare minimum rule and they are ADULTS. This is not a rule you are trying to teach a 5 year old where reminders are necessary. They don't care and they won't care. Words from your mouth or on paper won't make a difference, until it causes problems for them they have no incentive to change. \n\nAlso, I'm reminded of the parents with a teenager who improperly loaded the dishwasher so the dishes were never clean. They had him eat off of one of the \"washed\" but still dirty plates and he finally changed his ways.", "This all seems like a lot of work.  The next morning you wake up, and there are dishes in the sink, go wake up all three of the adult children, and tell them to get up NOW and clean up the mess.  Do not leave their rooms until they are up and dishes clean.\n\nThe 3 of them can figure out \"who is leaving the dishes behind\", and you just need to make sure they are all cleaning up in the morning.", "Put all the dirty dishes in a bin and leave it. Keep one set for you, one for husband, and one for the 15 year old locked away. Put all the other clean dishes  locked away too.. The three of you can use your sets and clean them as you go. If the other kids want a clean dish they can wash it themselves. \n\nStill get the cameras, see who actually washes dishes for themselves.", "Omg it was awesome, you have no idea ... It worked so great!!! I hit that limit too where I was so fed up about the dishes. You may have to hide the ones you put away, lol", "But how would you enforce it? Are you planning on staying in the kitchen and physically stopping them from entering? This is an empty threat. Make the sign if you want but you can't stop them from using the kitchen. Unless you plan to pack up all of their things leave it outside and change the locks. If you can't get them to clean up after themselves you won't get them to stop using the kitchen.", "I also had roommates like this in college, and chronic offenders got those dishes dumped on their bed.", "Just hand them their colour and tell them they are now responsible for that set. Regardless of who uses it they need to wash their own. They can keep them in their room so no one else will use it. Wash after use, dry and store in bedroom until they all learn better manners.\nNTA and good luck!", "I guess a time or two of them using someone else’s and that person getting blamed will straighten out who’s being honest and who’s being lazy.", "exactly.", "This. They really are taking advantage of the tremendous privilege of living there. Dishes is such a bare minimum ask of them.", "I used to do this but the cat keeps stealing them.", "A lot of family “rent” is really just a contribution to utilities and/or food. So not really like renting in the “real world.” (Source: my family and friends ).", "So rent includes maid service where you live?", "I don't see why it shouldn't be analogous to it, though.", "No, them leaving the dishes dirty is not okay. But that doesn't mean it's okay to ban them from the kitchen, which again ostensibly they pay for with their rent.", "It is. But that’s why it’s so much smaller", "Well if it's analogous to it then I don't think OP can ban them from the kitchen", "NTA.  Make that sign even shorter.  Get the camera from amazon, it's under $100 and uses your wifi.  \n\nYou are being more than reasonable!!", "NTA but how can they be adults if they are doing this?  who would ever want to live with the person who does this?\n\nand if they don't care about the 'clean your dish' rule, won't they just ignore the kitchen ban and keep doing it?  I say put a lock on the fridge or the door to the kitchen (if you have a door to the kitchen or start charging them ,. $10 for each dish and if they don't pay it, evict them (but you're too nice to do that).\n\nThe problem is that they don't expect any consquences", "NTA. You sound like your family has a pretty traditional structure, and you hate confrontation. Would your husband speaking to them be more effective? \"Stop taking advantage of your mother's kindness. Do your dishes. I will not tell you again.\" It can be very effective in some cases.", "ESH\n\nYour adult children are using you as a doormat and you’re letting them.\n\nSit down with them and tell them their behavior stops today. Tell them that before they go to bed, the sink will be empty. If it’s not, make all of them clean it together. If you arrive in the morning and there are dishes, wake them all up and make them clean them together. Banning will do nothing and only teach them to be sneakier or hoard dirty dishes and food in their rooms. You would have a worse situation on your hands. If you hold them all equally to consequences, they will regulate each other. No one likes their sleep interrupted because of their dumb, lazy sibling. I promise.\n\nFuture roommates and romantic partners depend on your success here. Do not fail the world.", "NTA. Make those three entirely responsible for dishes. Same general rule that everybody should do their own dishes but ultimately, one week it's A's responsibility to ensure the kitchen is clean and if dishes are undone on A's watch, A is banned from the kitchen for the next two weeks. Then it's B's turn. They'll police each other for you and hopefully everybody will learn that it's better to just do your own dishes in the first place, like mom said.", "NTA - do it", "NTA. I saw someone online had locked away all plates etc and given each child a single set of plate/bowl/cup/cutlery in a specific colour to force them to wash up& make it easy to identify the culprit if not.", "This is one of these situations which a prior post points about about judgements not aligning with the rest of the world. Can the subreddit emphasise with you and judge you N T A? Absolutely because you are technically correct. However, I think your rule is going a bit far and if you enforce it, you are going to create tension/resentment from your children who are going to be a lot of valuable in your later life than the opinions of strangers of Reddit going yes you are correct when we have no idea about your family dynamic. Not going to make a judgement, this is just my two cents.", "NTA Why exclude 15yo and Dad? Sounds like you have been doing too much for the family.\n\nIn my experience, making rules for other people doesn’t work and you can only make rules for yourself. I enjoyed success when I made a rule for myself that I would not cook dinner until the dishwasher was empty because I like to clean as I cook. Didn’t take long for the kitchen to be clean by 6pm.", "Well, if a grown ass adult can't put a dish in a dishwasher, it's not your problem that they can't afford to eat out. They sound very childish. Do they at least keep their rooms clean?\n\nMy mother once took all the dishes my sister didn't wash and and made them up in her bed.", "NTA. The are acting like children, so they will be treated accordingly. If they don’t like it, they can either straighten up or move out. Even the 15 year old is old enough to clean up after herself, so the rest have zero excuse.\n\nAnother tactic may be charging them for your maid service, especially if they are not paying rent.", "NTA.  I suggest a metal pot and spoon that as soon as you see dishes you start banging away and go around and ask who left the dishes.  Tell them no one is getting fed until they come clean them up.  Repeat every single time pounding away on the metal pot while doing it.  Let them feel your irritation through their ear drums.", "NTA. Quit cooking and doing the dishes.", "I have opinions on this because I understand how you can get mad that the dishes are dirty but there is not much information", "How are you going to catch them?  you have already said you don't know who leaves the dishes.", "Hah that's not such a bad idea. They have to get permission to check out a plate from the plate library.", "Nah, not cooking won't do any good. They know how to make snacks and get stuff out. They just don't feel any compulsion to clean up after themselves.", "I admit I am a bit of a doormat. I would rather do something than continually ask for it to be done. I feel like people should just step up and do their share, rather than me having to give constant reminders. I didn't like doing this when they were younger, and I hate doing it now.", "I made threats like this in my work kitchen for breaks. It was not enough. Save yourself the aggravation and camera up.", "Too much work to get a camera. Just stand there and make them clean up like the adults you claim them to be until they actually grow up.", "Nta. Even better idea is to split the dirty dishes by 3 and place them on their beds. If they’re asleep, even better.  Anytime you find dirty dishes in the sink, just do this. Yucky food bits, oh well.  They’ll get the picture.  Or get a cheap camera and install it so that you could absolutely know who’s behind the asshole.", "It sounds like it would be better to just tell them that since they aren't cleaning up after themselves,  they have three options: clean up after themselves,  start paying rent to alleviate your annoyance at having to clean up after adults, or start looking for a place to live. \n\nThis will become a game of cat and mouse and finger pointing.", "Wake them all up. Make them all clean. Repeat until the problem goes away. No one is going to want to room with them in the future if they don’t learn to clean up after themselves-not friends. Not romantic partners. You would be doing the World a favor by treating them like children until they learn to live in the world like adults.", "INFO: Why are three adults living at home, especially when there's a teenager there? I wouldn't worry about her picking their habits, but she doesn't need stressed-out parents at a crucial time in her life.(I know, they're all crucial, but realizing that adulthood is bearing down hard is uniquely challenging.)", "This will only teach them to be sneaky. Just make them wash the dishes as a group every day and solve the problem.", "Every time you find a dirty dish, put it in their beds. Distribute among the three.", "Weird how OP's kids are defending themselves with \"you don't know who did it\" because a) it was all three of them b) OP shouldn't even care. My mom didn't and it was effective. No more slacking, no more fingerpointing. If we had to do it anyways we might as well do it right away and avoid the motherly wrath.", "This is the way", "Every day I think about my roommate in college who left a plate of half eaten fried chicken in his room and then LEFT TO GO ON SPRING BREAK. and closed his door so I didn't even know about it until I followed the bugs and stink to his room 🤢🤢🤮", "This sounds like a great idea (and works for scuzzy housemates) but… who do you think will end up stripping and cleaning those beds covered in food scraps, digging out the crumbs that fell behind the mattress, etc?", "Let them police that.\n\nThe yellow plates are Jane's. If you find yellow plates in the sink, Jane either deals with her sibling or washes the plates.", "Another redditor commented they would put locks on the cabinets. I'm literally thinking about it...They would have to see me to check a dish out of the dish library.", "I say sit them down for a family meeting and explain that their behavior stops today. And any dishes in the sink will be taken care of by all of them before they go to bed. And any dishes in the sink in the morning will end in all of them being woken up to take care of them. And follow through on that every day until they decide to grow up or move out.", "I feel like I can keep them out of the kitchen easier than you think. My bedroom has a clear view of the kitchen. I know who is out there, I just don't know who is leaving the dishes. I can stop them from entering.", "And if A doesn't do it, B & C will get on A's case to get it fucking done, because all three of them don't want to be woken up in the morning!  Once you know who the culprit is, you can now focus on just A in the morning if you need to.", "They are all doing it including the 15yo + Dad", "[removed]", "They’re only going to start hoarding dirty dishes in their room like so many gross roommates. Just get them all up and make them all clean every morning until the problem goes away. They will start enforcing each other if it impacts their sleep schedule.", "No. If they don't respect you enough to do their dishes they won't respect your note. Unless you plan on getting into physical altercations with them it's an empty threat.", "What if I just explain to them that the money they pay goes towards their room, the washer & dryer, the water, the electricity, the fiber internet, the toilet paper and the meals I serve. There is no money left over after that to pay for the kitchen. That's why it's called \"kitchen privileges\" because it's a privilege, not a right.", "NTA. The absolute audacity of these adults living under your roof and not even being able to put away their dishes.", "YTA for having you adult children still living at home and complaining about the mess the leave. It’s simple have them move out and have there own house.", "NTA, but why the hell are THREE adult children living at home???", "[removed]", "nta, i did the dishes in my parents' house most of the time, so i agree completely.  i hate people who just leave shit in the sink with no intention of actually cleaning up after themselves.", "Adult children you say? No you would not be TA.", "If you can afford take-out/restaurant meals, you could refuse to cook if there are dishes in the sink. Buy food for the innocent parties (if there are any) and yourself and let the rest of them figure out their own food. Or do as someone else suggested and out the dirty dishes on their beds. \n\nWhat a bunch of disrespectful, entitled people.", "NTA but why not just tell them you're going to start charging a kitchen fee for all of them if it doesn't stop, regardless of who the problem is? 40$ per week per adult. If they don't pay, they don't get kitchen access or need a new place to live. \n\nI bet the dishes would stay clean real fast after that, and if they elect to pay then hire your youngest to help with dishes and split or give her all the fee. :)", "No, ywnbta, but I have to ask why you still have three so called adults living with you and taking advantage of you?", "Why don’t they each have a day when they do all the kitchen cleaning?\n\nThere are 6 human beings in the house. None of them small children. \n\nEven the 15 year old can take one 24-hour period of kitchen responsibility. (If that thought bothers you, then maybe you might start to understand why your 3 adult children think you are their house slave! In most households that wouldn’t be a big deal!)\n\nMidnight to midnight. Or whatever time of day you want to select. \n\nThe kitchen needs to be left perfect at the end of each shift, so it’s not left to the next person to fix the last Lazy Person problem. \n\nLet the kids enforce this on each other. \n\nFind ways to make them comply. \n\nEither they start paying rent or they stop getting free food. Or you change the internet password £ they don’t get it till they’ve cleaned up. Whatever it takes.", "Ah, the 15F and Dad are excluded because the three of us do all the dishes.", "That's easy. I can see them in the kitchen from my bedroom. But I don't actually watch what they are doing. I would have to walk in there to do that. But if I know someone is banned, I can keep my eyes peeled.", "And yet I hear on Reddit every day how it's impossible to live on your own as a young adult.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Look, you can try the sign, and you can put up a camera, and you can forbid your adult children from using the kitchen. But I think you're dreaming if you believe this is actually going to work. They're going to use the kitchen anyway, and you're not going to be able to stop them, and they are not going to suddenly magically become responsible.\n\nWhat you really need to do is give your adult children a short timeline to get jobs (within 3 months if they don't already have one) and move out (within 6 months). Never mind the inconvenience to you, you are not doing your kids any favors by allowing them to remain children instead of becoming responsible adults.", "Then NTA.  TY for taking the time to answer my question", "It’s not impossible by any means.", "They already don't listen to mom or care about her feelings, so this threat will probably have little impact. Even with a camera to tell who is doing it, how are you going to enforce that kitchen ban? Are you going to stand guard 24/7, lock up the fridge and cabinets? They are already eating and depositing dishes when she is unaware, they could keep doing so.  \n\n\nDo they pay rent? Maybe hit them with a consequence where it will really impact them. Charge them a fee every day dishes are in the sink. If using a camera, then you can do it by person, but you don't need a camera -- you can charge all three the fee every time it happens. They'll pressure each other once the fees start piling up.", "If they don't straighten up, let them know if continue they can start looking for their own place.  My job growing up was the dishes (keep in mind - my siblings living with us were 3 and 8 years older than I was) I'd do them after dinner and in the morning the sink would be full - I'd do them before school and when I came home the sink would be full.  I was the kitchen slave for all junior high and high school.  Somehow, they were shocked when I moved out the night I graduated high school!", "Lock up the household dishes and give them each one bowl, cup, plate, spoon, fork and knife, with different colour/pattern.", "It's self correcting. Whoever's color gets used gets the punishment. If it's not them, for sure they will make sure to catch out whoever got them the punishment . . .", "Ahhhh, I put them back in their cupboard, dirty. Soooo satisfying.", "They can if the agreement is that living at that rent rate includes kitchen clean up.", "Get a camera so you know who leaves what dishes. What ever they leave on the counter/in the sink, put it in their rooms.  \nNTA", "Nta \nTape plastic wrap over the sink at bedtime with the note attached. Get a camera. Or if you have any unused phones you can download an app to turn it into a camera.", "NTA. But I don’t think it will work.\n\nDo the adult children pay rent?", "NTA but rather than catching them in the act say the next time I find dishes or whatever is left in the sink then all adult members regardless of who was responsible will be banned.", "NTA - I like my brothers solution for his 2 kids Nad 3 friends of kids that basicly live there. Camera on the back of the sink pointing up. \n\nSometimes the solution of not knowing is to figure it out. \n\nThe note is fine.", "Get adult kids their own dish sets. Plates, bowl, etc, each unique. That's all they get to use, and if it sits in the sink, it gets left on their bed.\n\nIf that doesn't work, paper goods for all.\n\nNTA.", "I understand the idea, but I'm not sure it's workable. You said yourself you don't know who's leaving the dishes, and how are you supposed to enforce banning them from the kitchen even if you do know?", "I mean have you seen the economy lately", "I broke my leg and was taken to the hospital via ambulance and admitted. In the chaos of going to the hospital I completely forgot that there was still packaging for chicken breast in the trash--and it was June. And very hot. And at this point it had been there about 5 days. Yeah :P", "Ory roommate who stashed a bag of potatoes in his room. I found rotten potato water when I couldn't stop gagging walking past.", "u/ProofRestaurant8694 is a bot who stole this from u/flyingleaf555. Downvote and report.", "ESH     \nThe tone of your response is super patronizing and treats them like employees you don’t like. These are adults, and your children. Calmly outline the expectations and consequences; if you want them to ACT like adults you should TREAT them like adults.    \nIdk how old they are because you omitted that but I find it odd you did. The only one who doesnt suck is the youngest daughter, and I feel badly for her that she’s stuck watching her family disrespect each other and fail to listen to each other with the ease and consistency of breathing.", "Why didn't you teach them better?", "NTA, but why is the 15 year old exempt? Pretty certain the 15 yr old could generate and leave dishes out just as easily.", "NTA.  Have lived this life, with messy older/adult children.  And from prior experience, I can tell you the behavior will continue because you keep washing the dishes.  There's no downside for their continued gross mess-making in the sink, and they won't change unless there's a negative consequence from their behavior. \n\nGet a tub/bucket. Like, get one of those big rubbermaid storage containers a little bigger than the sink.  When you get up in the morning, transfer the dirty dishes to the tub, place the tub to the side in the kitchen, and clean the sink so that it is usable.  Inevitably someone will leave another dish in the sink; just place it in the tub with the rest. Soon you will run out of dishes, and they will complain.  Explain that you have cleaned the sink (what you care about), and if they want the dishes washed (what they care about), then they will put them in the dishwasher.  DO NOT WASH THEIR DUMPED DISHES.  Run a load or two of YOUR dishes without their stuff. It may get a little sparse, but stick to the plan.  If it gets gross, put the lid on the tub.  If they still want someone else to wash the dishes, making that job simpler is the least they can do. \n\nIt took a long time for mine to get it thru their thick skulls, but years later, there's never a smell of spoiled food from the sink, and no cloud of fruitflies in the summer. You know, almost civilized in here.  OP you can do it!\n\nEDIT: A switchable clean/dirty magnet for the dishwasher turned out to be super helpful. Something like https://www.amazon.com/Fred-Friends-FLIP-FLIPSIDE-Dishwasher/dp/B00EIFXB18/", "I was going to say that.  After you get a recording invite everyone into the room and play it for them.  Then don't make dinner or clean up.  If they're adults and even the teen can all take turns cooking and cleaning.", "OP, you do know that that note won’t make any difference at all.  And, do you have the means/method to actually block an offender from the kitchen?\n\nI suggest you get a small wireless camera and position it to catch the offenders.  Do NOT let them know there’s a camera.\n\nAlso, I recommend a REAL consequence - kicked out of the house.  Not harsh at all given their total lack of respect for you and your home.  Good Luck and please provide an update.", "The threat won’t work. Get a camera.", "If there are consequences for whoever’s color plate is left in the sink, the owner of the sink will make sure no one else is using their plate. \n\nEx. If the blue plate in the sink means Sally is getting punished, Sally isn’t going to let Tom get away with using her plate and taking the blame when he doesn’t clean it. \n\nI do think barring kitchen access- especially for that long, is a bit harsh of a punishment, I do think there needs to be consequences for this to correct their actions. \nI think the coloured plates are a good idea and the camera isn’t a bad one either.", "Obligatory “username checks out”. That’s funny- we also had a dog who would lick the magnet until it fell off, rendering the thing useless.", "Why are your ADULT children all still so reliant on you? I say skip all this matching dishes, cameras, kitchen ban etc nonsense- start treating them like adults if you want them to act like adults, and give them adult consequences. If they aren’t going to respect you and do their part with regard to maintaining a clean home, then stop giving them a free ride. Stop buying them shit and tell them to grow up- either they contribute as you have asked, or they can gtfo and fend for themselves. No capable adult should be relying on mommy to buy them toiletries and wash their dishes, much less THREE in one household.", "NTA Wake everyone up in the morning to deal with any dirty dishes in the sink.  I doubt they'll want this to keep happening and will put the pressure on the guilty party.", "Find them or wake their arses up and make them clean their mess immediately.   I wouldn't give a hoot about the time or who did it.   Wake them ALL up.  They'll start holding each other accountable.    \n\nIf they aren't around when this occurs,  then put all the plates in storage (and keep disposable ones in your room to bring it when YOU need them.", "nta. it’s not that hard to clean up after yourself. i would wake them all up at 2-3 in the morning and demand the kitchen be cleaned or we’d all be up all hours of the morning. that is absurd", "N T A for setting boundaries in your home but YTA for needing to mention they have ADHD. Like...wtf does that have to do with it? You raised trash human beings and you're blaming ND?  Naw.  My kids all have it, just as I do, and they do dishes every night. The toddlers put their dishes in the sink, the pre-teens wash and put away (and clean the kitchen).  It's not an ADHD thing, it's \"raise em right the first time.\"", "I get your frustrations, I feel signs are never the best form of communication.\n\nJust have a family meeting with your adult children and tell them what you want to write in your note. That you do not want to continue picking up after grown adults so from now on ppl who leave dishes in the sink will get banned from using the kitchen.", "NTA- but m only do that if you were actually willing to follow through. If you don’t follow through, nobody will listen. And it might get worse before it gets better. I would also suggest giving everybody a color-coded plate, bowl, and cup. And maybe do the same with some cooking things as well, and say that they’re only allowed to use their colored one. Then take out all the other dishes and have them stored away. Then everybody will have to wash them because if they don’t, then they don’t have any utensils or dishes to use.\n\n*edited:typos", "Also, maybe it’s time for the adults to move out? Good grief. 3 adult children still living at home?!?!", "Some adults need consequences. If you ultimately wash the dishes for them with little to no complaint, there's the component of why should they bother. Hopefully it won't take more than them suddenly finding there is no dishes made available for them if they don't clean them or having their dirty washing 'haunt' them. \n\nAdults do get consequences - for jobs you can be demoted or fired. If you mess around in a shop, theme park or similar you may get kicked out/banned. If you break the law, you can get fined or imprisoned. \n\nYes, it would be nice if everyone would naturally clean up after themselves, but it's not the case so sometimes there needs to be that incentive there.", "NTA.  It’s high time.", "They don't seem to respect household request to wash your own dishes, they're not going to respect a laminated sign. There needs to be actual consequences. Wake them up to wash the dishes, put the dirty dishes right on their bed. Grown ups need to be responsible for their messes.", "They don't listen to the rule as-is, why would they listen to your order to ban cooking, etc?\n\nYou should buy each of them their own 1 set if plates/bowls/silverware that are 1 color. There are $1 plastic things at Walmart like this. Take all of the other plates and hide them for you, husband, and 15 yr old only. Tell them if you see A, B, or C color items in the sink, whoever's that respective color item belongs to has to wash ALL of the dirty dishes no exception.\n\n1 set each also means no dishwasher. Oops sucks for them. \n\nIf they want to act like entitled children treat them like it lol\n\nNTA", "I'm going to go with ESH. You have 3 adult children still living at home, eating your food, using your toiletries and not being bothered to do basic things like put their dishes in the dishwasher. This wouldn't have happened if you'd made them do age-appropriate chores while they were growing up. You raised them to expect being served by mommy, and now you're dealing with the consequences of that. Even your attempt to solve the problem (\"food served to you at the table\") shows that you're ok with continuing to be their servant, as long as they refrain from creating even more work for you. You're enabling them to be lazy moochers.\n\nYes, they should be doing their dishes. They should also be contributing financially to the household expenses, or moving out to live like actual adults.", "NTA Split the dirty dishes into three piles and leave them on their beds.", "YTA \n\nSomething needs to be done, but a two week ban is unenforceable on its face and nothing will change. If anything it will be worse because you will have given your power as a parent away when they call your bluff. \n\nHave the adults be in charge of kitchen duty or fund a housekeeper for you. The most logical consequence is to only have disposable pans, plates utensils that they are required to use and pay for until they are interested in loading the dishwasher. A chore my eight year old does capably", "This is what my mom would threaten me with and just mentioning it worked for the few times I forgot before I got in the habit of cleaning up. \n\nSet up the cameras, tell them you'll dump the offender's dirty dishes on their pillow, and that way they can keep using the kitchen and eating on a budget.", "Probably, but these things come out in the process in my experience. It's about changing the dynamic, not the dishes themselves.", "Before you do this, you need to stop enabling them by doing the washing up. Have a few days where you yell at them all to come and clean up before you cook. Drag them out of bed. Refuse to cook dinner unless they do the washing up (or at least put the dishes in the dishwasher). Do the 'I don't care who left them there, you're all cleaning it up' schtick.\n\nAnd then put up the notice.\n\nNTA"]}