{"id": 20837, "submission_id": "14lfqpv", "title": "AITA for moving and not telling my ex?", "selftext": "My wife and I recently decided to move. We wanted to downsize and move to a more affordable state and selling our house will free up some debt. We visited some friends recently and fell in love with the area and the cost of living is much cheaper. \n\nI have an ex who was a teen mom. We briefly lived together. I believe her kids are around 10 and 13 now. I occasionally get mail for her and I will try to contact her and sometimes I can’t so I have just been doing return to sender. I contact her about her mail and tell her she needs to forward her mail because we are putting my house on the market.\n\nMy ex flips out and demanded to know why I’m moving and I basically told her none of her business. She asked if I could hold off until August to put the home on the market and I told her the home is already on the market and I have offers. She tells me that her now 3 kids go to that school district and she uses my address because where she lives has a crappy district. It takes a few seconds to absorb this information. The first thing out of my mouth was “I’m sure that’s illegal and if I had known about it I would have put a stop to it” \nShe tells me she’s hit a rough patch and is unemployed and it makes her feel better that at least her kids can go to a good school and for me to hold off on selling the house just for one month. I said no. I told her that her kids aren’t my problem and I’m sorry you never found the support system she needed but there’s no way I’m holding off on selling my house or allowing her to use this address so they can stay in the same district when I didn’t even know she was doing that. My ex called me a bunch of names including an asshole saying how could I just force her kids into a rougher school with no friends. I told her it really wasn’t even my problem in the first place.", "created_utc": 1687973636, "permalink": "/r/AmItheAsshole/comments/14lfqpv/aita_for_moving_and_not_telling_my_ex/", "score": 96, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > School registration is just a month away so it might make me asshole because I’m forcing her kids to go to a whole new school on such a short notice\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA like you said, those are her kids, not yours. There’s no need to keep your ex in the loop if you didn’t have kids together", "NTA. As sad as her situation is, she isn't entitled to roping you into a fraud situation that you never agreed to in the first place.", "You did the right thing, time for her to grow up!", "NTA. Her shitty circumstances are not your problem.", "NTA You went above by telling her you were moving. I wouldn't have done that. Her missing mail is her issue.", "NTA.  The ex was taking advantage of OP, unbeknownst to him.  Not his responsibility to provide an address for the kids, or to prop up the ex when she's out of work.", "NTA. She’s the one committing fraud here (and likely making poor life decisions that got/kept her in the situation she’s in). I feel for her kids, but they’re also not your responsibility.", "I can tell why this woman is your ex.  She's been using your address for her kids for years and never mentioned it once to you?  Did she think you would never move?  Now she thinks you should light yourself on fire to keep her warm.  She seems to think she is entitled to tell you what to do all because it's better for her kids.  Good luck to her, maybe the new owner of your home will forward her mail for her.", "NTA you didn´t even know she was using your address! No reason you owe her anything.", "NTA- She intentionally lied for years using your address. You were kind to reach out re: her mail and she dumps guilt and blame on you. Shake it off. Best to you creating a new chapter in your life.", "NTA. As Michael Jordan famously put it, “Fuck them kids.”", "NTA", "NTA", "NTA. Some people never grow up.\n\nGood on you OP for taking a stance. You should probably report her too.", "How did she fool the school for so long? My son’s school requires a recent electrical bill showing your name and address of your home to enroll each year. It is for just this reason so people don’t lie to be in a school they aren’t zoned for. NTA but you might reach out to the school and let them know she somehow slipped through. If she is doing it, others might be too", "I can sympathize with her, and find your lack of empathy about it somewhat disturbing, but overall, you have no obligation to help her keep up lies, or risk losing out on the sale of your own home. You can move as you wish without informing every ex. \n\nNTA\n\nBut... I'm very very strongly hoping that none of her kids are yours, because if any of them are, my opinion is going to change very quickly, and dramatically.", "ESH Your ex definitely sucks ass obviously but honestly i feel like there is plenty of better ways for you to go about this as well, you sound like you just dont care about her and her situation but why go out of your way to put a stop to something that only really affects the kids. Honestly inclined to think this is fake considering how little the educational system cares about students and their families… i doubt theyd care enough to actually be checking up on things like this so as long as you dont go out of your way to say anything i dont see why she cant just not say anything either and its no big deal and the kids stay at that school", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy wife and I recently decided to move. We wanted to downsize and move to a more affordable state and selling our house will free up some debt. We visited some friends recently and fell in love with the area and the cost of living is much cheaper. \n\nI have an ex who was a teen mom. We briefly lived together. I believe her kids are around 10 and 13 now. I occasionally get mail for her and I will try to contact her and sometimes I can’t so I have just been doing return to sender. I contact her about her mail and tell her she needs to forward her mail because we are putting my house on the market.\n\nMy ex flips out and demanded to know why I’m moving and I basically told her none of her business. She asked if I could hold off until August to put the home on the market and I told her the home is already on the market and I have offers. She tells me that her now 3 kids go to that school district and she uses my address because where she lives has a crappy district. It takes a few seconds to absorb this information. The first thing out of my mouth was “I’m sure that’s illegal and if I had known about it I would have put a stop to it” \nShe tells me she’s hit a rough patch and is unemployed and it makes her feel better that at least her kids can go to a good school and for me to hold off on selling the house just for one month. I said no. I told her that her kids aren’t my problem and I’m sorry you never found the support system she needed but there’s no way I’m holding off on selling my house or allowing her to use this address so they can stay in the same district when I didn’t even know she was doing that. My ex called me a bunch of names including an asshole saying how could I just force her kids into a rougher school with no friends. I told her it really wasn’t even my problem in the first place.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. No wonder she’s your ex….she’s TA for using your address without telling you. The nerve of that woman.", "NTA - like you said 'not your kids'", "NTA. You didn't even KNOW she was using the address for her kids to go to a different district, and there's no way in hell that you should pull your house OFF the market at this point or delay the sale for her. It's unfortunate that she's in this situation, and even sadder still that school districts in this country are not equal. It's a huge problem and it is unfair, but it's not YOUR fault, or your responsibility to correct. \n\nIf she had been upfront with you, you maybe would have helped her out, maybe not, but she would have had more notice. It's too late now, and her situation is her own fault. Did she think it would never catch up with her? It's a shame, but again - it's not your problem. It's your house to sell, and your life, and you should continue doing exactly as you had planned before.  She has been using your address for fraudulent purposes without your knowledge or permission for quite some time.... she has no standing to be mad at you about anything.", "Make sure you document your surprise and disgust at her fraud scheme in your text when you respond to her. She seems like the type that will try and claim “victim” if she’s caught. She would probably say you convinced her to do it and didn’t tell her you moved.", "NTA. While it’s wrong for her to use your address, I can understand why she did. It doesn’t make her actions/words towards you ok nor should you have to give in to her.", "NTA\n\n&#x200B;\n\nIt is ridiculous to expect you to stop your hosue sale for her fraud.", "NTA \n\nTime to cut all contact!", "NTA.  I would contact the school district and tell them you found out what she was doing.  Don't know what the laws are, but she sounds like the type to say you allowed her to use your address.", "NTA\n\n>I’m sorry you never found the support system she needed\n\ndoes this mean she never looked for it or she did but never received it?\n\n&#x200B;\n\nI wonder where the father of the 3rd child is in all this, considering she already had the first two when they met\n\nIt's a difficult situation for her and her children indeed, but you can't be responsible of her bad decisions (I mean the address thing and nothing more)\n\n&#x200B;\n\nThis is fraud, protect youself", "nta she can’t hold you back she is an ex for a reason I would block her because she is being disrespectful just because you are moving that’s not right", "I also wonder about her kids and the school lunch program. If she is that poor, but is lying about the residence, how is she maintaining eligibility for school lunch. In my state, schools with enough eligible kids can give every child breakfast and lunch, but schools in more wealthy areas expect the family to show need.", "If they lived with him at any point at the address she would have proof of residence to register them that school year, but I’ve never heard of schools requiring proof beyond that initial year unless there is a problem. At every school I’ve worked at, he proof of residence goes into a cumulative folder that follows the student. If they move within the district, a new proof is required, but since she’s been using the same one it likely has never been questioned.", "I wondered this. \n\nHave the school never sent a letter?", "How is he going out of his way to stop something?  He contacted the ex to tell her he’s moving and she needs to update her address, as he won’t be in the house to forward it. She’s the one being difficult.", "Here in the states, parents have went to jail for using a fake home address to enroll their kids in schools. It’s sounds ridiculous, but there are places that absolutely do check these things. If OP knowingly let her use his address, he may get in to trouble as well.", "OP *isn’t* going out of their way to do anything aside from moving forward with their move as scheduled. They said that *if* they had known, they’d have put a stop to it, but they didn’t say they’d be contacting the district or anyone; why would they? It’s not their problem since they’re leaving the home. Whatever follows is the kids’ mom’s issue to handle. *She* created the situation and now *she* is responsible for any fallout.", "Bad take", "I think that it is obvious he doesn't care about her or her situation. That in itself doesn't make him an AH, we don't have any information on how the relationship ended.\n\nI agree on the school not checking though, unless the new owners contact the school and inform them those kids do not live there.\n\nNTA", "To have eligibility the parents fill out a form at the beginning of the year that states their income. It has absolutely nothing to do with an address for individual eligibility.", "From the sounds of it (\"she NOW has three kids\") one of the kids wasn't even born when they last were together.", "My son's school only used email.", "“Im sure that’s illegal and if i had know i would have put a stop to it”", "OP doesnt have to “know” anything regarding this situation. I suggested he did nothing actually. Doing something is the only way for them to find out, and going by your logic OP could already get in trouble, so why not just do nothing and let the crazy ex deal with it? He wont even be in the state anymore soon enough. Plus even if this chick goes to jail over this idk if thats worst case scenario for these kids tbh lmao", "I completely agree. I made multiple points throughout my comments but over all i was just defending the kids lol seems like everyone focused on one thing i said that they don’t agree with and ran wit it", "Wow what a thoughtful response big dawg. Take you all day to think of it?", "Thats fair, she sounds like a problematic annoying prick. And those kids gotta deal with having whatever presumably crappy life someone like her is capable of providing. My point is why would he go out of his way to make the kids have to go to a shitty school? He can literally just do nothing. Its not his problem and doesnt affect him in the slightest. All telling the school does is make those kids shitty lives even shittier. If the school district really truly cared then they could have easily found out by now on their own", "Yes. She’s committing fraud and using him to do so. The correct thing for him to do is to contact the school district and inform them as the property owner that she and her children do not reside there", "So for you it’s better if the ex goes to jail then if the kids just have to go to another school district? Weird take.", "Yup", "Why is that the correct thing? Like i said, it only negatively affects the kids. From how stupid and shitty the mom sounds i cant imagine they have very good lives. Whats the harm in simply doing nothing so they can go to a better school with their friends? Plus if the school cared enough they could figure it out on their own… its not like the kids have lived there this whole time anyways", "No, I dont wish jail upon her lol In a perfect world the kids get to stay at the nice school with their friends and the ex turns a new leaf and becomes an all around upstanding citizen. In reality, though, crazy people don’t usually just wake up one day and decide to change their life for the better… maybe some consequences might cause that seemingly much needed change in her. Nothing hits people with a dose of reality quite like some jail time. And just maybe wherever the kids end up might produce better opportunities for them than whatever mindset is being instilled in them being raised by a psycho unemployed mother", "Because she’s committing criminal fraud and once he finds out, if he doesn’t do anything to stop it, he is aiding and abetting. And as Michael Jordan once said, “Fuck them kids.”"]}