{"id": 20840, "submission_id": "14ljc0b", "title": "AITA – I don’t want to start having a relationship after 22 years with my In Laws", "selftext": "When I was 18, I was a single mom to a beautiful 6 month old girl. I reconnected with an old friend & as they say “that’s a wrap” – we started dating & he immediately connected with my daughter & has raised her as his own for the past 22 years. (He’s an incredible man!) We also had a son together, got married but instead of a wedding, we bought a house & decided to wait until we were more financially secure for the wedding.\n \nMy husbands father was absent from his life starting around the age of 12. His father re-married & had a new family. My husband was always an afterthought to them & naturally, it has hurt him all these years. \n\nHis father made it clear he didn’t like me the 1st time I met him because in conversation with my husband, away from his sisters, I swore in a joking manner. His father overheard it. After we left, his father called my husband & told him how bad it was for me to have sworn & how offensive it is. To be clear, his father swears & that is okay because he is a man, apparently women shouldn’t swear? The invitations from them never came again & it was more or less like we just didn’t exist with the exception of Christmas gifts – only for our son, nothing for our daughter.\n \nWe invited them to every birthday party & they never once showed up. I threw my husband a BIG 30th birthday party & they declined coming. We had that delayed wedding (it was amazing & beautiful!) & they declined the invite 9 months in advance. They’ve only “met” our children 2 times when they were little & they are now 22 & 18. (This a the very short abridged version of the slights through the years)\n \nMy husbands grandfather passed away & his father planned a dinner & invited us & I would never allow my husband to miss that. I felt like I was in the twilight zone – the 2 people who previously treated me & my children like pond scum & my husband as a stranger magically loved spending time with us. They wanted us to go back to their house, want to make plans to do “things” together, dinner this, plans that.  \n\nAfter wearing a “Scarlet Letter” for over 22 years now, I can’t even fathom starting a relationship with them. My husband & kids are welcomed to have a relationship with them but Momma Bear will NEVER forget the hurt feelings of her little girl & her husband as they continuously slighted us as a family not to mention my son who couldn’t pick them out of a crowd. \n\nAITA for not wanting anything to do with them knowing that my husband won’t in turn? (If I made a point of having the relationship, he would be on board but because I’m not, he won’t be) basically, am I being selfish & putting my feelings of disappointment before his?", "created_utc": 1687982145, "permalink": "/r/AmItheAsshole/comments/14ljc0b/aita_i_dont_want_to_start_having_a_relationship/", "score": 245, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1. I refuse to have a relationship with my absent in-laws after 22 years. \n\n2. It prevents my husband from having the relationship because he’s amazing & wouldn’t do that if I wasn’t on board\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Does someone need a kidney?", "I'd treat VERY lightly for a long time.  There is something \"off\" about this whole thing.  Like they're being nice all of a sudden because they want something.  I'd be keeping my guard up all the time.  The last thing I'm sure you'd want is for your husband to open up and then end up being hurt even more.", "nta.  they were extremely rude and excluded you and your family and made it clear they didn’t want to be around you.  your husband’s father also has some awful misogynistic views and double standards, which is reason enough to not want him around you and your family.", "NTA\n\nHe's free to build that relationship if he wants. But it's insanely unreasonable to expect you to want anything to do with them. Personally, I'd have just acted as if they had already passed, and thought nothing beyond that.", "NTA, you're already entitled to ask where is your medal because you didn't RSVP with a curse.\n\nBUT: your hb seems a pretty supportive person and someone who cares for your feelings. On the other hand, his dad's family is horrible. Hence supporting him for a single dinner would probably suffice either for him to realize it definitively (just think the different treatment they'll surely give to your son and your daughter) or for them to decide they don't really want a relationship/doing something that would reveal their true colors even more.\n\nLong story short: by accepting the invitation you would probably get a happy and never resentful/what if husband AND never seeing them again.\nAlso: hope you're still on the sworing side and same for your daughter :)", "NTA you’re not responsible for creating a relationship for your husband either. If he wants it he can have it, but if it hinges on your efforts, then it doesn’t seem very important to him.", "NTA - I’d stay away too", "NTA. You’re not obligated to reconnect to a AH father-in-law. Stand your grounds and stay away, there’s no law you have to forgive him.", "NTA. And as your kids are now adults, you can be honest about why. Let them know, if they ask, that you are fine with whatever decisions they make regarding a relationship with this side of the family but you will not put in the effort and explain why.", "NTA and maybe I've spent too much time on Reddit but did the grandfather leave your husband (or your children) anything? Or tie some assets into your husband having a  relationship with his father? I understand why you are torn- your husband sounds like a great guy and probably wants some sort of relationship with them but... A complete turn around after this many years is really suss.  Extreme caution from everyone interacting with them and look into the grandfather's situation.", "INFO: do you think those hurt feelings your husband has carried with him for years over feeling unimportant to his dad, could be repaired by having a relationship with him now?", "My first thought is that there is something in the grandfather's will that mom and dad are conniving to get. Be careful", "Very fishy. So does someone need a transplant? Or has misogynistic Daddy Dearest been affected by a clause in the Grandfather's  will and wants to get at it?\n\nWe have nothing to do with my husband's side of the family for pretty much all of the same shit here.  I'd be on guard the minute they rock up at my door for the same reasons.", "People don’t just change like that, especially people like your FIL. I smell something fishy. NTA", "NTA\n\nIf it was important to your husband to spend time with them, he’d do it regardless of your decision, especially since you’ve clearly stated he and the kids are welcome to.\n\nIf he follows your lead, it’s a choice he’s actively making. Do not feel you have to fake a relationship with them so your husband can have a (no doubt equally fake) relationship with them.", "NTA. As you said your husband can if he wants to. Show him and make it 1000% clear that he and your son can reform a bond with his dad guilt free. I can only assume that your father inlaw heart has soften after the loss of his dad. He wants to be closer to the family he has left.", "NTA for not wanting anything to do with them.\n\nBUT, I would suggest, for your husband's sake and only because your kids are older, be civil and try.  If the kids were younger, I'd be saying h to the ell no.  But since they're older, do this for your husband, at least a little bit, just to see where it leads.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nWhen I was 18, I was a single mom to a beautiful 6 month old girl. I reconnected with an old friend & as they say “that’s a wrap” – we started dating & he immediately connected with my daughter & has raised her as his own for the past 22 years. (He’s an incredible man!) We also had a son together, got married but instead of a wedding, we bought a house & decided to wait until we were more financially secure for the wedding.\n \nMy husbands father was absent from his life starting around the age of 12. His father re-married & had a new family. My husband was always an afterthought to them & naturally, it has hurt him all these years. \n\nHis father made it clear he didn’t like me the 1st time I met him because in conversation with my husband, away from his sisters, I swore in a joking manner. His father overheard it. After we left, his father called my husband & told him how bad it was for me to have sworn & how offensive it is. To be clear, his father swears & that is okay because he is a man, apparently women shouldn’t swear? The invitations from them never came again & it was more or less like we just didn’t exist with the exception of Christmas gifts – only for our son, nothing for our daughter.\n \nWe invited them to every birthday party & they never once showed up. I threw my husband a BIG 30th birthday party & they declined coming. We had that delayed wedding (it was amazing & beautiful!) & they declined the invite 9 months in advance. They’ve only “met” our children 2 times when they were little & they are now 22 & 18. (This a the very short abridged version of the slights through the years)\n \nMy husbands grandfather passed away & his father planned a dinner & invited us & I would never allow my husband to miss that. I felt like I was in the twilight zone – the 2 people who previously treated me & my children like pond scum & my husband as a stranger magically loved spending time with us. They wanted us to go back to their house, want to make plans to do “things” together, dinner this, plans that.  \n\nAfter wearing a “Scarlet Letter” for over 22 years now, I can’t even fathom starting a relationship with them. My husband & kids are welcomed to have a relationship with them but Momma Bear will NEVER forget the hurt feelings of her little girl & her husband as they continuously slighted us as a family not to mention my son who couldn’t pick them out of a crowd. \n\nAITA for not wanting anything to do with them knowing that my husband won’t in turn? (If I made a point of having the relationship, he would be on board but because I’m not, he won’t be) basically, am I being selfish & putting my feelings of disappointment before his?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Fr", "That’s where my head went.", "Excellent comment and I agree with the energy. They want something. Has the will been read yet?", "They're thinking of their old age, they want to reconnect so they will be looked after. Purely selfish reasons.", "Exactly - it was the literal twighlight zone! It’s like we were “long lost family” from another country when in reality, we live 20 minutes away & they have disregarded our existence for 22 literal years. And you’re totally right - never even thought of it, if we make the effort, it opens the door to even more slights when we both closed the wounds years ago.", "Exactly how I feel! Thank you.", "That’s exactly what we do now! They no longer “hold power” aka their absence no longer bothers me. (Took me a LONG time!) Totally thrown for a loop with the 360 turn. Perplexing.", "I am a lucky gal - he always cares about our feelings & he genuinely is my best friend!! I like that, don’t go “all in” but accept a periodic invite! (Because their true colors will show) Thank you!", "NTA", "Sad part - the kids don’t even ask because it’s always been a “constant” that they don’t “exist”.", "Seriously I have to wonder what changed.  People don't change their behavior that drastically for no reason.", "Nothing whatsoever - hubby wasn’t even invited to the spreading of his ashes - just the dinner following. 😔 (and the kids weren’t invited, just hubby & myself) It’s the total opposite of my family who literally considers my husband like their son. I think my dad likes my husband more than he likes me ahahahhaa. I agree wholeheartedly on extreme caution. Thank you!!!", "The hurt feelings absolutely bother him or have through the years. (Part of why I’m resentful of them - he deserves better) Can that be repaired if he had a relationship now is a question I ask myself as well. I’m torn!", "Can’t write off any of that at all - I want to give the benefit of the doubt but at the same time, they’ve been nothing but downright horrible people in terms of “family” & quite honestly, they haven’t earned that benefit of the doubt!", "You know what, you are darn right! Thank you!!", "That’s what my gut keeps telling me too. Hubby’s a great guy & cares about my feelings & in a case like this, will put them above his own. And I normally do the same - I just have a ton of resentment & it’s weighing big time on me. Thank you for that. I think I needed to hear it.", "Wouldn’t that be a kick in the pants to the hateful parents… recently deceased granddad left everything to OP’s husband or made the inheritance to OP’s in-laws contingent on them making amends with OP’s husband.", "Or maybe there is an inheritance that OP's husband will be receiving instead of his father?", "They need money or a kidney. NTA.", "of course!", "See, I couldn't accept that 360. Especially after DECADES. They'd have been mourned, and moved on from.", "yeah, that's tough. i totally understand feeling fiercely protective of him and your family. the most i'd give if i were you is letting them earn a relationship. let them be the ones to put in all the effort and really prove to him that they have changed. your husband's father losing his own dad might've made him reevaluate his past behavior and really want to repair the damage he did to your husband, which is like the ideal situation, if your husband is open to it. have you asked him how he feels about all of this?", "OP I agree with the NTA vote but completely disagree with the advice.  With their actions they scolded you for 22 years.  Why should you even entertain the idea of starting one now?\n\nMy advice?  Give your husband all the flexibility to have a relationship with them, but make it clear that you will not be involved at all.", "How much did your husband's grandfather leave him in the will. If you've been told \"nothing\" time to lawyer up and get those details.", "Thank you so much for that. I’m totally okay with hubby & the kids being in their lives & support it wholeheartedly. I just detest how little regard they have had for the most important people in the entire world (to me) & Having the worst time with forgiveness & I certainly can’t forget. I have lots of thinking to do.", "😂- Absolutely nothing! Not even a picture.", "NTA.  I do wonder where this is coming from.  As many have suggested, it may be because they want something, or there's something do to with the will, but it might also be that his father is grappling with his mortality for the first time in the wake of his own dad's death and has some regrets.  Whatever the reason, you are all old enough to decide for yourselves whether you want to have a relationship with them, and if so, what kind.\n\nIt might be helpful for you to sit down together as a family and discuss their sudden change of heart and your individual feelings about it.  If some of you want a relationship where others don't, it would be helpful going forward if you know each other's boundaries.  Make it clear to each of them that they're free to act as they please toward your husband's father and that there will be no hard feelings either way.", "NTA. I've been in your shoes. As much as this sucks, people do change, sometimes they do get better.. It is mostly when they get older/weaker. I try to forgive them and slooooooowly let them back in. What pisses me of is that they never apologised for acting like they did.", "Doesn’t really matter, they’re gonna go back to their normal selves in a couple of weeks", "NTA as I read this it makes me wonder if maybe the grandfather left something to your husband that his father wants.", "Oh what bullshit! OP carried the burden of these peoples bad behaviour for 22 years and is now supposed to let them back in?\n\nThe only way OP is the AH here is if they let these turkeys out of the pen and back into their lives.\n\nNTA", "NTA - I’d have the same stance honestly", "Lol your husbands grandfather left most of the estate to your husband instead of his son. \n\nYour FIL wants to reconnect so he can guild your husband into giving him the money. \n\nNTA and go low contact.", "NTA. You sound like you have a mature take on this. None of this is your fault and you don’t have to make up for anything", "Absolutely agree! Didn’t think of the morality aspect of things until you guy’s mentioned it & it clicked. It makes perfect sense! I was “blinded” by my own feelings to not have seen the obvious. I’m thinking that is exactly what it is - his father is getting older, his kids are all adults, he lost his dad & maybe just maybe he took a good hard look. Great advice on sitting everyone down & all just talking about how they feel & making sure everyone knows that the door is open & they can choose whether to shut it or walk through or a little bit of both!", "If that’s the reason for his turnaround, then I am so golden with that!!! I will make sure I tell him again that he absolutely should explore the rekindling if that’s what he wants. (I told him on our way home but also told him I didn’t want the same for me aka he should absolutely spend time with his dad but I will stay home with the fur children lol)", "Will was read at the spreading of ashes we weren’t invited too. (Just the dinner after-I honestly think he wasn’t in it which is why they didn’t invite him or I want to believe that they didn’t want his feelings hurt since everyone at the dinner besides us was at the Will & ashes spreading)", "They want something or they want to hide the inheritance. \n\nBe VERY suspicious.", "Trust your gut, if it feels wrong it is wrong.\nWe developed that sense for a reason.\nThe biggest risk we face as humans, is other humans.\nPeople like that only ever have self serving predatory interests.\n\nYou’ve gone this long without them and managed.", "I don’t think it’s “Will involved” - there’s 5 sons so my guess is the sons inherited & not the grandchildren - His dad makes GREAT money too & his wife has always been a stay at home mom aka they can afford a true high middle class to lower end upper class lifestyle. Aka I don’t think his dad needs money. Could be totally wrong though, the reality is we only see what they show which sadly is very little!", "Why are you guys still keeping in contact with them again??", "I wouldn't rush into a relationship.  This could totally just be the thing where people go \"I missed you! Let's do this again!\" when they see you but never reach out.", "You “think” but it’s actually worth “knowing”. Maybe they should give him the money but keep for themselves? And now try to at least get him involved so DH would feel guilty when it finally blow up in their faces.  \nCheck it op. Just to be sure. And your kids are old enough to decide for themselves. Just give them the full honest version.", "So then we are back to someone needing a kidney or bone marrow.  They sound awful, I’m sorry.", "I don’t understand why you are entertaining this at all. If neither you or your husband want the relationship (and who would after how crummy and neglectful they’ve been) , what is even the issue?", "NTA. But I would want to read a copy of the will... just in case.", "It's simple: have you heard an apology from them? If not, scrap that. But even if they did apologize it sounds like a sure recipe for more heartache for your husband so either way I'd give it a pass. It doesn't seem like that branch of the family was missed all these years by him or you.", "NTA. If your husband wanted a relationship with this folks, he could say so. The fact that its \"If I did it, he would go along but wouldn't go without me\" (paraphrasing) I understand to mean he doesn't care enough about these people to put in effort for a relationship.", "NTA.  If they really wanted to make amends, they'd be addressing the past and, you know, apologizing.\n\nThey can't just pick it up now and pretend that the last 22 years didn't happen.  It would be a different matter if they had invited you and told you that they'd been wrong in the past and wanted to start over and try again.  They didn't.  They're hoping for instalove without repercussions for any past actions.", "NTA and OP, most of us are as suspicious as you are and really need you to check with the probate court to find out what was in that will. Something very strange about 22 years of silence and now you are the prodigals returning? It is just too far off.", "NTA… these people showed you exactly who they are.  Consider that your kids dodged a bullet not having their influence in their lives.  They either want something or they’ve alienated other relatives due to their A Hollery.", "NTA. You don’t owe them anything… if they want to have a relationship, they can work for it.", "NTA. You’re right to be very cautious. Nobody goes from excluding you utterly to suddenly wanting you in their life without reason. Until you know what that reason is, keep your emotional distance", "NTA. But just a thought, could it be that the grandpa had an issue with OP or didn't approve? Now he's gone and they want to reconnect. Doesn't make the situation or their actions right for the last 22 years, but seems odd that they did a 360 right after he passed.", "I", "Info: Was your husband close with them before you two became involved? Any chance they were against the relationship? I ask because they sent your son gifts, but not your daughter.", "NTA but YWBTA if you didn’t tell them how you feel.", "NTA\nHave your husband get in contact with the lawyer so he can read the will.  They are either being nice to him so he doesn’t find out what’s in the will (his portion) or they are being nice because he wasn’t written in and they don’t want him to sue (some people would if everyone else was written in and they were singly out of it).", "Did grandpa leave some money?", "NTA Look at it this way: are you happy with your life? If so, why would you make an effort to include all that drama and any that may come in the future because they want it? Why do they want it? Why should you trust them? They had every single day for 22 years to change their mind and contact you and... crickets. They owe you a ***massive*** apology before anything should move forward and then a huge and very convincing explanation of why they have oh so suddenly changed their minds.", "NTA\n\nBut I would ask them point blank what changed?  Why do they want to start getting together after 22 years?  \n\nYour behavior won’t change, but it’ll be interesting to see what they say.", "NTA, what are they looking for, help as the age? Money?  What is the excuse for what they did to you and your family.", "NTA", "NTA", "My thought as well. Did grandpa leave moat of his estate to husband, so now \"Dad\" wants a relationship? Money and greed often create these massive shifts.", "If you reject them, be sure to tell the wife how ludicrous it is to cut family off just because one of them swore once. You see, I think FIL told a very different story to his wife. One of the dangers of communicating through a single hostile person is that they have full control over what everybody else gets to know. Honestly, the whole going NC over swearing sounds like a pretext to cut contact. He never intended to have a relationship with his son's family. He was looking for something, anything to justify cutting you off. If not swearing, it would have been something else, something just as ridiculously minor. I suspect he always viewed your husband as a threat to his reputation and marriage, somebody who might reveal unpleasant truths.", "Is it possible the will did leave something to your husband and he just hasn’t been informed about it?", "If you’re in the US just know that wills are public record & once it has been filed you could get a copy for yourself to see what was in it.", "FWIW it was just my gut but I got this immediate impression of like, you were a single mom and your partner stepped up to be a parent with you..\n meanwhile partner's dad was a deadbeat who was present off and on.\n\nI think your relationship to his son might have been for him to process in part because his son was a reminder of the kind of man he should have been, and you were a reminder of the kind of pain he caused. Combine that with misogyny and stubbornness and you get decades of unfair resentment. But in that time and especially with his dad's death, maybe he wishes he had done better instead. I certainly hope his motivation is remorse as he should definitely feel remorseful.\n\nThat said, he hurt your partner, you, and your kids. His reasons, if he ever shares them, might help you understand whether his intentions have shifted but don't excuse his past. It's unrealistic to expect that he ever becomes truly like family to you or your kids, after this long. Honestly I think it's a long shot with his son. But you could probably all be cordial and something good might come out of that, like closure for your partner. Personally I would be very guarded in case the inlaws are trying to get something out of your husband or you. Personally I'm really not big on bio family with mine having been abusive or absent a lot, so if it were me i would probably just focus on what kind of support my husband told me he needed.or if I were your husband I would process grief about grandpa with him if I felt any, and tbh just kinda wish him a nice life and move on\n\noh BTW you're NTA", "I would get in touch with the estate lawyer if you can. It could be an enlightening read.", "Exactly, how would they know what the Will contained until it was actually read. That information is confidential until the deceased's lawyer reveals it. It sounds like they may have had a rude awakening at the 'reading'.", "The lawyer would have contacted her husband if he was mentioned in the will - it's a responsibility in legal terms. (I found out my grandmother had passed and left me money from an ad in my local paper. That's how far the lawyers need to go to confirm that legatees are not swindled.)", "Maybe the lawyer has been trying to do so via the dad because of outdated contact info and dad and stepmom have been deliberately keeping them away? OP, I’d have your hubby follow up directly with the lawyers about the will. Even if you all don’t even want any part of a potential inheritance, the reconnecting business is suuuper fishy and the timing of it points to will issues. You should investigate if only to see if that’s what’s behind this sudden attempt at a relationship.", "Yes, but not while the family is still going through the process of burial/cremation. The lawyer would have contacted the people listed in the Will when the estate is being finalized. The whole gathering to spread ashes and have the Will read sounds like something the family arranged assuming they knew who was in it. It would not be the lawyer's responsibility to ensure everyone affected would be in attendance."]}