{"id": 20929, "submission_id": "14mgnhm", "title": "AITA for 'ruining the vacation' and casuing a scene over something so small ?", "selftext": "Throwaway because my friends do not need to know about this.\n\nFamily and I (15M) are currently on a vacation in Florida for my sister's birthday whos turned 17 2 days ago. We booked 4 tickets for my mom me, and my 2 sisters. It was something we anticipated as a 'getaway' (I think that's what irs called) after some personal events that I won't get into details. I forgot to bring my luggage until we were at the airport and decided against ubering back and to just borrow my sister's clothes when we get into the hotel. Growing up in a family of girls, it was something that's not unusual for me to borrow their clothes as we used to grow up dirt poor. We did come along and started to get back on our feet where we are able to be where we are now. I'm forever grateful for the moment and of course appreciate mom for getting us here.\n\nWhen we arrived, my sister gave me her shorts and t shirts and I thought she was joking because it was obviously too short. I asked if she had anything longer but the only things were dresses, shorts, and pants that wouldn't really fit me. Growing up poor, I learned to not ask for anything although we were financially stable now because it is something that's been drilled into my brain so I didn't ask for a whole change of clothes. I didn't care about having to wear her clothes, I only cared about how short they were. I explained to mom how embarrassing it is, especially as a teenager but she dismissed it as me being 'over dramatic.' I'll be blunt and say that she is so hard to talk to because she is so old school where she can never ever understand our point of view, and rather thinks we are over reacting. \n\nWhen we went out for dinner, I got a few stares and asked mom if we could just buy regular pants or something to cover up because it is blatantly clear how embarrassing it was. She blew up at me and said that I was 'ruining' the vacation and how she can't catch a break for atleast a day. I explained to her that this could all be solved if I can just change my pants and it had nothing to do with girl clothes as I never asked for a change of shirt either. She lost her mind and threatened to make me wear my sister's dress to 'cover up' if I wanted to so badly. I just stayed silent to not escalate things and cause a scene unlike what she was doing.\n\nShe was never this aggressive until a few months ago regarding a family incident which would explain her anger. I just can't fathom spending a whole week doing something so embarrassing when it can be solved so easily. It just feels like she's taking advantage of my problem to redirect her anger onto me.\n\nI think I may have been the a-hole because it does no harm to anybody and she does deserve a break, but I can't just wear her short shorts for a whole week when this could be solved so easily.", "created_utc": 1688073060, "permalink": "/r/AmItheAsshole/comments/14mgnhm/aita_for_ruining_the_vacation_and_casuing_a_scene/", "score": 58, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) I kept complaining about the clothes i had to wear although could've been preventable had my mom actually done something\n2) I might be the a-hole because I escalated it\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YTA, this is not what you want to hear, but they didn’t leave your luggage at home.  At that age, you should be responsible for making sure you have your luggage. Don’t you also have what you wore to the location?   Switching out every other day if need be to reduce days in shorts.", "YTA\n\nHow the hell do you forget your **_SUITCASE_** on vacation?", "I think I missed it, were you dirt poor?", "INFO: What do you mean, you forgot your luggage? You forgot your luggage? On the way to the airport? Presumably while getting into a car with three other people who had luggage? How??", "Info: how did you forget your bag? And then get to the airport with no one in your family asking where your bag was? I genuinely don’t understand how this is possible", "YTA-  \n\nA) Forgot to bring your luggage (how do you even do this?)\n\nB) It sounds like you had an opportunity to go back and get it and didn’t.\n\nI’d just take your shit, learn from this moment, and move on.\n\nEdit: Oh and stay out of any family photos or social media pics/videos if you value not getting roasted into oblivion by classmates.\n\nEdit: 2. Actually you might need to bribe your family occasionally to not mention this to friends or classmates either.", "Uh yeah, no shit. YTA\n\n“This can be solved so easily” it would not have been hard to just bring your luggage, or go back and get it. You CHOSE to borrow your sister’s clothes so I’m not really sure what you were expecting. Maybe you should consider offering to pay for the pants you want so badly. Sorry to say this but you 100% brought this on yourself.", "Ya YTA, you decided not to get your clothes via Uber, was that an actual option? Sorry to say it, but yes yta. Your mom does deserve a break. She doesn’t need to blow up on you, but we are all human. And you messed up by forgetting luggage", "Ofc YTA, you forgot your luggage and you pay the consequences. No one cares if a boy is wearing short shorts. It's 2023. Maybe this will teach you to stop being reckless", ">I forgot to bring my luggage until we were at the airport\n\nAre...are you serious right now? And blaming your mother for the situation \"not being preventable\" (In the judgement bot) is just over the top.\n\nIf you want clothes on vacation, you...*checks notes*...**bring clothes on vacation**. It's an entirely different thing if you land in Orlando and learn that Delta decided to reroute the bag that you handed to the baggage carrier in good faith to another city.\n\nThat, my friend, is an emergency.\n\nBut to leave the house and not bring your bag at all??!!?? How is this the fault of any of your traveling companions, especially your mother??? \n\nYTA, like a thousand times.", "YTA. You forgot your luggage, decided against going back for it, and said you would wear your sister’s clothes. Now you’re upset that sister’s clothes aren’t to your taste and are too revealing—I’m not really sure what you expected. Your mom likely budgeted tightly for this getaway and buying you new clothes may not be in the budget. You should apologize to your mom, tell her you’re sorry you forgot your luggage and that if she lets you borrow $20 to go to Walmart/Target/whatever store is close by and buy a cheap pair of shorts/pants you will pay her back in either money if you have a way of earning it or chores.\n\nAlso—why can’t you just wear the pants/shorts you wore on the plane? Hotels usually have coin operated washing machines and dryers OR you could wash them in the sink every couple of days.", "Dude YTA. YOU are old enough and should be responsible enough to take your own luggage on vacation for goodness sake. YOU decided you’d wear your siblings clothes instead of fetching your luggage. YOU were given the clothes. YOU feel that your mom is in a better financial position so she should buy you clothes for your silliness. Come on", "Idea: buy clothes yourself! Otherwise: YTA!", "I am honestly surprised your mother did not blow up on you for the forgotten luggage already, dude how even ? Forgotten passport , boarding pass is also almost inexcusable , but somewhat comprehensible....the whole thing ? I can't imagine", "YTA you forgot the bag, you then chose not to go back for it. You also assumed (against all common sense) that your 17 year old sister would have packed clothes that would look appropriate and fit a 15 year old boy. The only thing I can fault your mom for is not intervening and forcing you to go back for the bag.  If this was a genuine case of a bag being lost by the airline, I’d say she should have immediately bought you one outfit to get you by. But it was you who didn’t bring it in the first place and I suspect she is also trying to teach you a lesson about being careless.", "YTA", "WAIT YOU Forgot your luggage??? BUt your mom is at fault? YTA", "INFO:  Was this written by AI?  It's weird.", "On the one hand I love that you were upsetting Floridians. One the other hand, YTA.", "So not to be captain obvious but it's not like you flew down naked. Why can't you just wear the same clothes you flew down with??", "○How is this supposed to be even a 'learning moment'\nYes I had an opportunity to get it back, but it doesn't mean I suffer the consequences when it can be solved fairly quickly○\n\n\nI was on the fence until I read this comment from you. You're old enough to remember your luggage. You had a second chance to go get it. Just because you go on vacation does not mean you get to take a chance on getting a new wardrobe. You don't need the internet to tell you to grow up a little. No sympathy for you.", "YTA - you’re the one who “forgot your case” and didn’t want to take an Uber to collect it. \n\nI am also getting a hint that the “personal events” may mean you were engaging in something you possibly shouldn’t have been. And the comment re your mother not being this “aggressive” until a family incident a few months ago makes me wonder how much you pull this shit.", "YTA\n\nYou forgot your bag but then had the opportunity to go back and get it but said no. You really have no room to complain. Sounds like you need to suck to up with what you got.", "Dude just enjoy the degenerates, animals, sunshine and let ‘em hang low. It’s Florida", "YTA.\nI can't help but think there was some shitfuckery in your action.", "“I forgot to bring my luggage until we were at the airport and decided against ubering back and to just borrow my sister’s clothes.”\n\nThis is entirely your fault, and you’re taking it out on your mother.\n\nThat said, I can’t believe three other people got into a car or Uber with you to go to the airport and didn’t notice you didn’t have luggage.\n\nESH, with you taking top prize.", "YTA. You are well old enough to be responsible for preparing and bringing your own items on a trip. You are LUCKY your sister agreed to share anything at all with you. If not, you would be wearing and washing the same clothes you wore the entire trip. These are natural consequences of your own actions. I’m hoping it will teach you to be more conscientious next time you travel.", "I couldn’t even read this…", "YTA. So you didn’t bring your own luggage, then you made a conscious choice not to go back for it assuming you would just wear your sisters clothes and now that they don’t match your ideal clothing you expect your mom to shell out on a new wardrobe for you for the rest of the week as that’s the simple solution. So basically you want to be reward for your lazy stupidity. No that’s not how life work.", "Your explanation of why you might be the AH completely skips over the fact that YOU’RE THE ONE WHO FORGOT YOUR LUGGAGE and puts the blame on your mom!!! YTA YTA YTA !!!", "YTA. Lol so you’re mad your sister didn’t anticipate you forgetting your own clothes and only had clothes for herself? How dare she /s", "[removed]", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nThrowaway because my friends do not need to know about this.\n\nFamily and I (15M) are currently on a vacation in Florida for my sister's birthday whos turned 17 2 days ago. We booked 4 tickets for my mom me, and my 2 sisters. It was something we anticipated as a 'getaway' (I think that's what irs called) after some personal events that I won't get into details. I forgot to bring my luggage until we were at the airport and decided against ubering back and to just borrow my sister's clothes when we get into the hotel. Growing up in a family of girls, it was something that's not unusual for me to borrow their clothes as we used to grow up dirt poor. We did come along and started to get back on our feet where we are able to be where we are now. I'm forever grateful for the moment and of course appreciate mom for getting us here.\n\nWhen we arrived, my sister gave me her shorts and t shirts and I thought she was joking because it was obviously too short. I asked if she had anything longer but the only things were dresses, shorts, and pants that wouldn't really fit me. Growing up poor, I learned to not ask for anything although we were financially stable now because it is something that's been drilled into my brain so I didn't ask for a whole change of clothes. I didn't care about having to wear her clothes, I only cared about how short they were. I explained to mom how embarrassing it is, especially as a teenager but she dismissed it as me being 'over dramatic.' I'll be blunt and say that she is so hard to talk to because she is so old school where she can never ever understand our point of view, and rather thinks we are over reacting. \n\nWhen we went out for dinner, I got a few stares and asked mom if we could just buy regular pants or something to cover up because it is blatantly clear how embarrassing it was. She blew up at me and said that I was 'ruining' the vacation and how she can't catch a break for atleast a day. I explained to her that this could all be solved if I can just change my pants and it had nothing to do with girl clothes as I never asked for a change of shirt either. She lost her mind and threatened to make me wear my sister's dress to 'cover up' if I wanted to so badly. I just stayed silent to not escalate things and cause a scene unlike what she was doing.\n\nShe was never this aggressive until a few months ago regarding a family incident which would explain her anger. I just can't fathom spending a whole week doing something so embarrassing when it can be solved so easily. It just feels like she's taking advantage of my problem to redirect her anger onto me.\n\nI think I may have been the a-hole because it does no harm to anybody and she does deserve a break, but I can't just wear her shorts for a whole week when this could be solved so easily.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "How poor are you, really, if you all mamage to go to Disney but cannot just buy some extra boy clothes?", "ESH. Your mother should not be publicly humiliating you. But it is your fault that you are in this situation. If you care so much you can Uber to a store, buy some pants yourself, and Uber back. Don’t expect your mother to pay for it. You knew how long your sister’s shorts are. You were irresponsible and this is what happens when you are irresponsible.", "[deleted]", "Going against the grain here, but NTA. You made a mistake followed by a poor choice, but that’s what 15 year olds do. Hopefully you can get yourself some pants somehow. I’m not a parent, so maybe I don’t really get it, but if I saw a CHILD feeling humiliated and I could end that easily, I would.", "NTA It really doesn’t seem like that ruined the vacation and she should respect that you weren’t comfortable with the shorts. It doesn’t seem like that hard of a request. And sometimes girls pants are uncomfortable for a guys I would think especially shorts because girls and guys proportions are usually different. Lots of people forget their luggage because traveling can be stressful and stuff.", "NTA - you are obviously very uncomfortable and self conscious. You’re also a child communicating that, and your mum could be showing a lot more sympathy and care. Perhaps ask for a little cash if you don’t have any and offer to run alone to a store for some cheap shorts.", "If you're at a hotel, ask if they have shorts (or a bathing suit) in the lost and found. \n\nMy uncle forgot his luggage for my aunt's funeral (I cannot believe now there are two people in the world who didn't bring luggage) and asked and they had a tie and blazer that they let him keep. It fit him perfectly. It was weird.\n\nGet yourself in order so you don't end up like my (wonderful but wildly irresponsible) uncle.", "I’m sorry but I feel this can’t be true. You ‘forgot’ your luggage and NO ONE in your family questioned it ??????", "YTA…how does one forget to bring the most essential item needed for vacation?!   The one item that has their necessities in it?  Toothbrush, clothes, etc?  And you expected mom to purchase you a whole new wardrobe?  Oy.  The entitlement.", "INFO: why you can’t just walk/bus/Uber to a thrift store, and get 2 outfits?", "Dude YTA\n\nYou're 15 yrs old and \"forgot your luggage\" everything that happened beyond that is nobody's fault but your own. And if \"it can be solved so easily\" then why do you need to ask your mom to buy the pants? \n\nAre you getting my point? The easiest solution would be to not forget your luggage in the first place (which to be honest baffles me, you're not a little kid and shouldn't need reminding had you said it was lost I might be sympathetic, but YOU FORGOT) and then made a conscious decision to not go back and get it.", "YTA. Forgetting the luggage was careless, but choosing not to go back for your stuff was lazy. You choose to then wear your sister's clothes, your choice rather than getting your stuff and then you're disappointed that you're sister brought girls clothes. \nI'm not saying you should down the time being\"humiliated\" but you too on slot having been dirt or, maybe there just isn't anything in the budget to get you more clothes, especially as you already had the opportunity to rectify your initial mistakes. YTA all day long. Take some responsibility for yourself and actions.", "Yep. He can wash his outfit in the sink everyday. Won't kill him.", "right like ?? didn’t even think to double check before jumping in the car??", "lol", "I assume Mom said 'let's go' and she left her suitcase in her room instead of putting it in the trunk.\n\nOP: Do you have any money or an allowance?  Why haven't you just bought new pants?", "I thought I covered it in the post? I had the oppurnity to Uber back to my house and get it but I decided to just wear my sister's because I'd always do that back when we were dirt poor. \n\nIt's not something unusual to us but I thought she'd pack pants that would actually cover me up", "Honestly, if I was OP's sister and had to give up some of the outfits I'd packed because Golden Boy simply assumed one of the womenfolk would carry his suitcase out to the damn car for him, I'd be taking every photo I could.\n\nNot to humiliate him over the clothes he was \"forced to wear,\" but the sheer audacity of his expecting everyone in the family to cater to his whims.", "Sounds like he wanted a shopping trip.", "How is this supposed to be even a 'learning moment'\nYes I had an opportunity to get it back, but it doesn't mean I suffer the consequences when it can be solved fairly quickly", "Forgetting your luggage is wildly irresponsible.  A 15 year old should know better.  Expecting your mom to buy you new clothes because you couldn't be bothered to go back for it is also so irresponsible.  I would totally make my kid wear whatever was available to teach a lesson in consequences, even if it was embarrassing.   Maybe then they would learn some personal responsibility.", "Yea cause it was something I'd do back when we were dirt poor, I expected to wear something normal, not something so revealing for a boy", "That's not what matters, it was an honest mistake. Doesn't mean I have to be humiliated..", "He probably expected her to carry his bags to the car for him as well.", "I’m amazed how far I had to scroll to see this, and I’m also curious what OPs reply is.", "Don't ask a minor to send you photos, creep.", "It shows how much you'd expect it to show, we're not that different in size, and no I'm not showing you pictures wth", "Also all the Ubering back and forth to the airport. You could afford that but can't go buy a pair of pants?", "I get that, I learned from my mistake. I just don't get why I still have to suffer the consequences", "I'm not big on humiliating kids but he is acting so far beyond the pale of entitled he clearly needs to learn this one. He has the clothes he wore on the plane and the hotel has laundry. He can wash his clothes every night and no one else will know he doesn't have other clothes and he won't have to wear sister's shorts. I honestly think he wanted to buy new clothes and was trying the Lisa Simpson trick...", "Yea it wouldn’t be hard for them to just give him money for a pair of shorts and just wash them as needed is it his fault yea but if my kid is uncomfortable I’m going to do my best to fix it", "No I’m asking HOW you forgot your bag. And then how no one in your family asked where your bag is before getting in the car? Makes no sense to me", "Why would she pack with you in mind?", "So the problem isn’t your sister clothes then, it’s the expectation that her clothes were appropriate for you to wear.", "Why would she pack pants that would cover a boy when she's a girl going to one of the hottest and humidest places in the country? And you still haven't said HOW you forgot your bag! I'm ADHD and I forgot to pack a coat when I went to Iceland, but forgetting to bring ANY luggage to the airport when you're in a group of people who all have luggage is... not very believable. Unless you are so used to someone else taking care of everything for you?\n\nBut regardless of how it was forgotten, YOU forgot it. YOU turned down the chance to go get it. And YOU unreasonably expected your sisters to solve your problem for you. This is incredibly immature even for a 15 yo.", "You’re being deliberately obtuse, kid. I’m starting to see the holes in this post", "How old were you when you were dirt poor and had to borrow your sister’s clothes? As a former stupid teenage guy, just take the L, if it bothers you that much wear what you wore to the airport every day and try to wash it at the hotel", "He did the Lisa Simpson gamble and lost.", "Lmao how about “don’t forget your suitcase on vacation” like a complete neanderthal.\n\nAnd yes, you should suffer the consequences. You chose to NOT resolve it when you had the chance and want everyone else to accomadate you, when you are the only one at fault. Go buy some pants yourself if you want them", ">> it doesn’t mean I suffer the consequences \n\nThat’s *exactly* what it means. *You* forgot *your* suitcase. *You* chose to not go back and get it. *You* are responsible for *your* actions and for the consequences of those actions.\n\nIn this case, those consequences include not having appropriate clothing. Maybe next time you’ll remember your suitcase or take the opportunity to go back and get it. \n\nYTA.", "Man if that’s your attitude toward your sisters and everyone else, definitely pay close attention to my suggestions above because it sounds like kids already got plenty of ammo to pick on you. It’ll just become open season if you get posted to social media like that lmao. \n\nIma say something that you should carry with you for the rest of your life. The world doesn’t wait on you or revolve around you. Have your shit together, be ready to capitalize on second chances, or get reaaaaaalllly used to life kicking your ass. Because it will and everybody will enjoy doing it if you’re this entitled, kid.\n\nEdit: Just so we’re clear. It’s a learning moment because you fucked up. Actively chose not to correct the fuck up. And your mom isn’t letting you off easy with your fuck up. Don’t fuck up in the future. But when you do and get a second chance, go correct your fuck up.", "Solve it yourself then and buy your own pants", "You keep saying it can be solved quickly. Do you have money to buy yourself some pants? Take an Uber and get some. You backed yourself into this corner and these are the consequences. The only one feeling humiliated is you, and only you can control your feelings. Nobody gives two shits what kids wear these days.", "My kids have been responsible for their own luggage since they were 7. They've never forgotten their luggage.", "And you were expected to wear your own clothes that you packed and brought with you.", "If you know what it’s like to be “dirt poor” like you keep saying, then you should understand that having to go spend money on a bunch of clothes for you while supposed to be on vacation is a pretty unreasonable expectation. You forgot your luggage (not even sure how you do that). You also had an opportunity to go back and correct your mistake and still make your flight. And you chose not to, automatically expecting other people to accommodate your carelessness.\n\nYou’re being a burden on everyone else when they’re supposed to be enjoying the vacation too. If you didn’t want to wear girl’s clothing, then you shouldn’t have chosen to borrow clothes from your sister instead of going back for your luggage. Massive YTA", "This is not helping your case. What you’re considering as “normal” is normal for men. She is a girl, who from what you described has feminine taste in clothing and are obviously meant to be worn by a woman. \n\nAlso why are you surprised at the clothes she has? You presumably live with her and see what she wears on a regular basis, right? You should have had a good idea of what you were getting into.", "Dude, you had an opportunity to GET YOUR LUGGAGE BACK and said “nah, I’ll just wear yours”\n\nSister: *Has obviously clothes not meant for men*\n\nYou: *shocked Pikachu face*", "Do you have any money of your own? I don't know where you are, but you can probably get a pair of shorts to wear for the week if you mix it up with whatever you bought for the trip.", "My point still stands", "You shouldn’t no point in forcing your kid to be uncomfortable the whole time when you can buy two pairs of pants or a shirt and a pant", "suffering from the consequences is how you learn from your mistake.  if your sister had magically had outfits for you or if your mom had bought you new clothes, WOULD you have learned from your mistake?  probably not.  this is the lesson, sinking in.  next time you won't leave for the airport empty handed.  anyway, wtf, just wear your same clothes you flew in.  wash them at night.", "Yes, and why can’t he just wear his own clothes that he wore to the airport. Doesn’t add up.", "Neanderthal. \n\nI. Am. Hollering!! Lol fml", "Well now I get it, im just not gonna keep being seen like this for a whole week, especially when we can literally solve the whole problem in 20 minutes", "No one cares about your legs.", "this could have been solved if you acted like a responsible person and brought your clothes. how do you manage to forget your luggage ?", "Can't you just wear the same clothes you wore on the trip there? I know my 15 yo son, would rather wear the same clothes, over and over again than to ever wear his sister's short shorts lol the hotel should have free laundry or just hand wash in the sink. Maybe, your mom, would be less stressed and angry, if she sees you making an effort, to solve your own problem, by wearing the same clothes instead of whining. Who knows, maybe she might actually buy you a new set of clothes, when or if she gets tired of seeing you in the same clothes, or if she or your sisters get tired of the smell lol. Good luck kid."]}