{"id": 20950, "submission_id": "14mmtby", "title": "AITA for not wanting my boyfriend to bring his gaming PC on vacation?", "selftext": "My boyfriend (M24) and I (F23) have a vacation coming up that I’ve been actively planning for about 3 months now. This is something I’ve always done every year whether it’s with a friend group, family, or S/O, so it’s something I’ve been anticipating for basically an entire year. \n\nThis year I wanted to make it a private trip for me and my boyfriend who we’ll call Brad. I’ve already booked and paid for the hotel and a few of the activities we’ll be doing, which I was bringing up to him to see if there’s anything else that he would specifically like to do. I eventually brought up the fact I’d like to go bar hopping and see some live music and/or go walk on the beach at night when Brad said we couldn’t do anything after 9pm since he would be playing video games.\n\nBrad plays Rainbow Six Siege with a group of his college friends on his gaming PC. They play every night in order to practice for some sort of competition/tournament they have coming up. It’s nothing professional esports level or anything, but I know they do take it seriously and I understand and respect that. I play games on my own PC myself so I understand. But seeing as how they need to practice, he says he’s bringing his entire PC setup to the beach with us.\n\nI tried bringing up the fact I was hoping the trip could be more intimate and focused around us doing stuff together since it’s only a 4 day/3 night trip and we wouldn’t be gone that long. Brad is adamant on bringing his PC, and saying that me trying to convince him not to is selfish and he feels like I’m controlling him and how he spends his time. His main argument point is that we have all day to do stuff and he only wants to be on his PC at night. He also said I should bring my PC so we can play games together, but we don’t even play games together while we’re at home since I don’t play R6 and he constantly has a full group anyways. \n\nI’m trying to put my foot down about this and the argument has come to the point where he is saying he won’t come on the trip if he can’t bring it and have his gaming time at night.\n\nAITA for wanting a trip without his PC coming along with us?", "created_utc": 1688089062, "permalink": "/r/AmItheAsshole/comments/14mmtby/aita_for_not_wanting_my_boyfriend_to_bring_his/", "score": 211, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I understand they take the game very seriously which makes me feel like TA\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\nPut your foot down. If he insists h brings the PC, tell him he isn't going and invite a sibling or friend instead.", "NTA, this is a serious red flag.\n\nIf he can't dedicate 3 nights to you instead of his friends, he is not the right guy for you.\n\nThink long and hard about whether you should be investing more emotional labour into this relationship.", "NTA in my opinion. The whole vacation would be to get away for a little while, and spend time together, not play video games while you do what? I doesn’t seem your SO is willing to make that sacrifice, and to me that seems selfish.", "NTA. Sometimes putting down technology is the healthiest thing he can do to live in the moment. This is going to be one of those times. Gaming with the boys is fun but you need to make time for your significant other as well.  \n\n\nBe firm on this one, he's being a child.", "He plays EVERY NIGHT? That's really not necessary. I love videogames, don't get me wrong, but I couldn't justify playing them every night after 9 pm. Unless I was a professional and my income depended on it—I'm assuming he isn't.\n\nIt's not even the videogames. There's not a single activity that I would absolutely have to do every night after 9 pm that would take priority over everything else, even activities with my partner on vacation.\n\nIt's super selfish that he is choosing to game every night without fail instead of spending time with you on a vacation that you planned.\n\nEdit: NTA", "NTA\n\nIt's frankly concerning that your boyfriend can't put his game away for a few days to spend time with his girlfriend. Makes it very clear where you land on the priority list.", "You're not his gf, you're the side piece. He loves the computer and his games.\n\nEither make peace with that or make other decisions accordingly. \n\nNTA", "NTA. My husband likes to game as well, but if we are on a trip just the two of us, he wants to spend all his time with me. He may bring a switch to play when we have downtime.", "ABSOLUTELY NTA.  Vacation is a break from life and you are literally paying to break your routine.", "NTA, your bf is a loser", "NTA.  And your BF is nuts.  If I was one of his buddies I’d refuse to let him play.  How does someone like this even have a GF?!?", "NTA\n\nYou just learned an expensive lesson that you come second to a video game.", "NTA. Brad, however, is an absolute AH. \n\nThis is vacation-ruining stuff and it shows he will never prioritise you. Selfish in the extreme. I enjoy video games, but I ensure that it doesn’t interfere with even downtime in the evening (we both work irregular, non-matching hours). The thought of someone cutting off the vacation every night at 9pm is maddening. \n\nCall his bluff, go with a friend instead.", "**NTA**\n\nI had an ex like that. If his online friends said their whatever started at 8EST, I didn't exist after that. He was thoroughly confused why I walked out not long after that. 😂", "NTA. Leave him behind. I hope you can take a friend or family member so at least you can hear some live music at night.", "nta he plays rainbow six that is his fault", ">I’ve already booked and paid for the hotel and a few of the activities we’ll be doing,\n\nNTA. If you are paying for all of this, or a significant chunk of this, you are definitely NTA for stressing that you have a say in how the two of you spend your time. If you're paying for all or mostly all of this, then his choices are either to go with sans PC you or stay home.You didn't mention this, but I would imagine the PC coming with you also entails that from 9pm onwards, you're in the room with \"ROTATE LEFT!! CONTACT! DRONES UP... OK... SHIT!! FUCK... GO BACK!!!  ...GET REKT!!!\"???\n\nI'm so sympathetic to your situation, because I know you don't want to be on this awesome vacation and Brad is just pouting all the time... nor do you want to feel like you have no say and just give into whatever he wants.\n\n~~Maybe explore a compromise that you both can live with? What if the deal is that the PC comes along, but is only setup for 2 nights... and then the other 2 nights he agrees that the damn thing stays in his luggage?~~  EDIT: I'm giving Brad too much credit. If he knows he could be gaming on the off-nights and is PC is RIGHT FUCKING THERE, he's going to be thinking about it non-stop. Nah, PC needs to stay at home. \n\nAnother tactic -- say the PC doesn't come along with you. Is there a world in which you guys go do a nighttime activity and both leave your phones in the hotel room? I know it's a big ask, but this is the best way to keep him away from his friends pinging him on discord, him checking in on the bois, or otherwise finding sneaky ways to 'work' on his upcomming competition.", "NTA and take him on his offer to not go.  It sucks, you want to spend time with him, but he is showing you he is not actually worth your time.  Start asking your friends now, I don’t think it will be as hard to find a replacement companion for this trip as you think.  Then while you are away you can think about whether or not you want to continue to be second fiddle to video games.", "NTA. It’s a VACATION from everyday life. It’s weird that he isn’t comfortable taking a few days off from his friends", "NTA.... its for 3 nights, there are tons of stuff to do at night for vacation, sometimes the most fun.\n\nInvite someone else. you should have a great time on your vacation, day and night.", "Are you tho king about making babies with this guy?  Cause he won’t change a diaper or make a bottle after 9 PM.  NTA", "Wait, so you've already been planning this vacation with your BF for a few months, and he mentions wanting to bring his gaming PC with him *now*? You'd have figured this would've been one of the very first things to get straight during the planning. I guess not. If the nightly gaming sessions are so important to him, I don't know why the vacation planning was even allowed to hit the *one*-month mark.\n\nAnyway, isn't the whole point of a vacation to take a break from a person's regular routine? To relax and do other things for a bit while having a fun time?\n\nBut also, you mention this is a gaming PC, as in a whole desktop setup with monitors, keyboard, mouse, and other things, right? That would take up a *lot* of room. I would at least give your BF a very slight amount more credit if this were a gaming laptop we were talking about, but I can't fathom bringing an entire PC setup, no way.\n\nNTA", "NTA!!\n\nEdit: I see now you commented they don't play for money.. Then wtf are they practicing for!??? Are they working up to compete someday? Cause there are a ton of small events non professional teams play and actually get rewards and the event is hosted and everything. Your bf is out of touch. \n\n\nyeah I understand having to practice but he was out of line with what he told you. \"and how he spends his time\" well he can spend it at home since his time doesn't involve you not even in gaming since he always has a full lobby anyways.\n\nIt's sad you guys don't play games together as well. Me and my bf met through CSGO and been living together for nearly 3 years now . We met at the end of 2018 and started dating in 2020 and we always play games together and always have. Of course we have our own games we play separately. I play ESO and he loves to play a variety of small games mostly hack and slash.\n\nGirl, you deserve someone who includes you not act like you are in the way. You shouldn't have to make it clear to your partner you want quality time. A relationship comes first.", "NTA. Tell him to take his gaming PC and fuck off. Or, if you want to be super, super petty about it, let me know and I'll tell you how to delete all the files off his computer.", "NTA. If his gaming is so important then leave him at home and find someone else to go on holiday with, or go on your own and have a great time. There is no reason for you to miss out or be second fiddle to a computer game because of Brad’s selfishness", "Yeah NTA, but he definitely is. As previously stated, vacations are for getting away from the absurdity of everyday bs we call life. Have I taken a game console to a hotel with us before? Sure, but it was never unpacked unless it was raining and miserable outside, but that was mostly for sanity's sake and never on a romantic getaway. \n\nI do find the visual in my head rather humorous though. Are you maybe confusing PC with laptop? I honestly can't see someone dragging an entire gaming rig on vacation. Either way, still not cool.", "Girl just end this relationship, good god. You seem like you're interested in living in the real world, making memories, having experiences. He isn't. Find someone who values the same lifestyle as you.", "I honestly don’t think either of you are really assholes, but neither of you are willing to compromise your happiness. A vacation is supposed to be spent doing what you wanna do, not what someone else wants you to do. Is it fair to call it a vacation for him if he isn’t able to do what he enjoys? I don’t think so, but same does go for you as you want more intimate quality time. \n\nSo one thing I also wanted to point out, if he does leave his PC home. Whatever y’all do at night won’t be as nice as you want. He’ll be holding that bit of resentment in and it’ll probably end up being worse, \n\nAt this point, I think you’d be better off going with someone else who would enjoy the things you will, instead of forcing your boyfriend to ditch his happiness to do what you want. Since he clearly has his foot down and so do you, I don’t see any other solution really", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy boyfriend (M24) and I (F23) have a vacation coming up that I’ve been actively planning for about 3 months now. This is something I’ve always done every year whether it’s with a friend group, family, or S/O, so it’s something I’ve been anticipating for basically an entire year. \n\nThis year I wanted to make it a private trip for me and my boyfriend who we’ll call Brad. I’ve already booked and paid for the hotel and a few of the activities we’ll be doing, which I was bringing up to him to see if there’s anything else that he would specifically like to do. I eventually brought up the fact I’d like to go bar hopping and see some live music and/or go walk on the beach at night when Brad said we couldn’t do anything after 9pm since he would be playing video games.\n\nBrad plays Rainbow Six Siege with a group of his college friends on his gaming PC. They play every night in order to practice for some sort of competition/tournament they have coming up. It’s nothing professional esports level or anything, but I know they do take it seriously and I understand and respect that. I play games on my own PC myself so I understand. But seeing as how they need to practice, he says he’s bringing his entire PC setup to the beach with us.\n\nI tried bringing up the fact I was hoping the trip could be more intimate and focused around us doing stuff together since it’s only a 4 day/3 night trip and we wouldn’t be gone that long. Brad is adamant on bringing his PC, and saying that me trying to convince him not to is selfish and he feels like I’m controlling him and how he spends his time. His main argument point is that we have all day to do stuff and he only wants to be on his PC at night. He also said I should bring my PC so we can play games together, but we don’t even play games together while we’re at home since I don’t play R6 and he constantly has a full group anyways. \n\nI’m trying to put my foot down about this and the argument has come to the point where he is saying he won’t come on the trip if he can’t bring it and have his gaming time at night.\n\nAITA for wanting a trip without his PC coming along with us?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. I truly believe that gamers make the best partners but they still need to be willing to put down the game from time to time. It's 3 nights, he should be excited to spend that time with you. He's playing **every night** which should be all the more reason why he can forego 3 nights to make memories with you.", "NTA. If he can't step away from his games and friends for a few days of fun together with you, then he doesn't deserve any of it. He can game by himself for those 4 days, and the rest of time. \n\nFind someone else, or alone. And good luck finding Mr. Right (or Mr. Right Now) whi I e you're away.", "NTA  \n\n\nHe's being absolutely ridiculous. 3 nights without practicing R6 isn't gonna hurt him. Also the internet in the hotel is going to be crap for gaming.\n\nIf you really want him to come, and he really won't budge on it, maybe compromise and say he can do one night of gaming maybe if there's a night you think you won't have much to do? Honestly though, I think you may just need to threaten to leave him behind and go with someone else if you can. He may change his tune if you do that. Also if it turns out he'd genuinely rather stay home than to go on vacation with you, that may be a little telling on how much he actually respects your time together.", "Nta - that game is more important to him it seems.", "Girl, you deserve so much better than this. There are so many nice guys out there who would love to prioritize you over a damn game and, perhaps, over everything else. NTA.", "I’m an only child and I’m a bit worried none of my friends would be able to get the time off from work. Since I don’t like traveling alone I’d be out almost $600+ from the stuff that’s only partially or non-refundable", "I was thinking the same thing - I can't imagine never being able to do something with my partner after 9 PM because they're always gaming.", "I play every night for two hours with my fiancé and friends. However, we leave our gaming systems at home when we travel.", "Yes, every night for almost a year. Before they started taking R6 seriously it was other games like Overwatch and Smite. All with the same group. No income is tied to any of it.", "He has a switch too, which I brought up that he could bring while trying to find a middle ground.", "She’s the one dating him though 🤷‍♂️", "Also, I'm giving your SO a HUUUUGGGEEE benefit of the doubt by treating his upcoming tournament as if it's his job, career, or otherwise just as significant to him as this trip is for you.   \n\n\nEither way, you're still NTA for wanting it to not come with you to the beach.", "In another post she says that he’s planning on bringing BOTH MONITORS- this just keeps getting better 😂", "Lol nope, we both have full tower custom builds. He plans on bringing both monitors, too", "Start asking around now, then.  \n\nAlso NTA if he can't go without his computer for 4 days and show you that you're a priority, he might not be worth your time.", "\"free trip\" will gain alot of takers.", "So he is going on a holiday and doesnt want to go out dancing or spend the evening out or have sex?\n\nFrame it like that\n\nI love to play games on my xbox and use it most days but I can go on holiday for 2 whole weeks without it", "I’m so confused?! Does he not want to get laid?", "Nta. He's being really inconsiderate. It's kind of frustrating when someone places so much importance on games. He's pretty much saying you'd be stuck doing things in the evening alone while he games. Cringe. The evening is the best time! Someone is bound to go on the trip with you. Tell your bf you understand if he can't make it because him practicing with friends right now is more important and you can do something together after his... Thing.", "If you had asked him in advance for a time you could schedule the vacation when he would not be gaming, would he have taken 4 nights off from it at a time of his choice?", "Look, work out how much you will lose by cancelling versus how much you will lose by going on your own (if you can’t find someone to go with you). Then choose the one which makes more financial sense. \n\nOnce you’ve taken that decision, sit down and have a good hard look at your relationship. He’s not willing to make any sort of compromise ( an entire PC setup on holiday! What in the world!), as you said he could get his switch instead, but he presumably said no. \n\nSo this is how the future is going to be, with him. It’s up to you to decide whether you can live with that.\n\nNTA", "Everything you add to this just makes it sound worse!! TWO MONITORS! I’m picturing you two rocking up to the hotel with a stack of boxes and the staff wondering if they’d messed up the reservation, and you guys were supposed to be staying for a month. \n\nI’ve already given my judgement but wow, this guy.", "Yeah that's really going too far. I could see if it was a weekend planned specifically as a lan party, but not this.", "Ngl if you asked me if I wanted to go dancing or play on my pc in a hotel, I choose the hotel every time.", "I’m not 100% sure but my gut feeling says no", "I just got back from a two week vacation with my husband. I’d be lying if I said I didn’t spend like 1/4-1/3 of my time in the hotel reading (I read 4 books!) but I have in the past spent that time gaming too. Not on a whole rig mind you. But I do think it’s okay to not spend every minute together. Maybe it’s different in the honeymoon phase, but he’s probably had this gaming team longer than he’s had her.\n\nE- I missed the 9 PM comment. Yeah, that’s quite inflexible. I was thinking like he had to get on for an hour around dinner time or closer to midnight.", "If he can't take a three night break, he's definitely the AH in this scenario. If his friends would say one word about him missing three days of \"practice,\" they're assholes too. And he wants to spend every night of a beach vacation gaming with his buds instead of spending time with his gf? You may want to cut your losses. NTA, go by yourself and take the time to reevaluate your relationship.", "NTA- my partner makes their income off of posting gaming videos online, and frankly I don’t even think they’d be unable to go FOUR DAYS without gaming 😭", "This is so weird.  It reminds me of when I was in college.  I was going abroad to Greece for six weeks and I got a 30 day beta key for Star Wars: The Old Republic that 100% overlapped with my trip.  I stubbornly packed my gaming laptop insisting that I would make time.  Pfffft.  Never even cracked that thing open.\n\nThis is THREE nights.  NTA.", "Mabey move the vacation to after the tournament?", "NTA, as a gamer, there's time to game and time to spend with your SO. You made the effort to plan the whole vacation, wanting to bring his computer is disrespectful IMO.", "Take a moment to listen to Dr. K at healthy gamer on YouTube about gaming addiction. It'll maybe help you find some root issues to why he feels this way.", "Eh if I was you I’d go with someone else he sounds exhausting", "No just no. It’s different if he wants to bring a gaming laptop as it’s designed to be mobile. Whilst lugging his PC around if there are any damages it will automatically be your fault. Leave him at home and take someone else.", "Me and my husband play games, sometimes together, pretty much every night. BUT NOT ON VACATION. I wouldnt even think of bringing my whole setup with me.... vacation is meant for getting out of your daily routine, dont bring it with you!!\n\nAlso, its only 3 nights, not like hes abandoning his friends for weeks, they can manage. \n\nNTA, but the bf is", "NTA. Did he help pay for this trip? Or did he leave you to plan and pay for everything? He wants to benefit from your hard work and completely ignore you.", "NTA. I would be livid if my ex did that and he actually makes money off of gaming", "NTA, and I think you should find a friend to go on the trip with you. Apologize for trying to “control his time” by dragging him off to a fabulous location, and leave him at home with his beloved PC. \n\nI’m a gamer, but what he’s doing isn’t normal or healthy. He has a gaming addiction, and you need to seriously consider if you want to stick around for it.", "Yeah unfortunately if my partner asked me to go dancing that's a hard hard no with zero wiggle room. I find it so awkward and embarrassing that there is no way I'd do it even to save one of our lives.", "And this is a guy you want to potentially spend your life with?\n\nI love gaming as much as the next guy…but come on.  This is ridiculous.", "😂 🪦", "Tell him that if the gaming is so important to him that he has to be in the room by 9 every night he's going to have to make a compromise for you. Your dancing feet are going to sleep with him and while he's gaming, you'll be out kicking up your heels. Make it seem like you'll be out on the prowl while he games. Even if you just go sit on the beach till midnight with margaritas, make him think you had a great time without him. In reality, someone that hooked on gaming would make me think twice about hooking my wagon to his star.", "I don’t think you are the asshole in this situation, you are far from being the asshole. I think Brad needs to understand that you love him and that he shouldn’t put video games before his S/O. I also think that not being able to survive just a couple of days without playing a video games is what makes him selfish. If he really loved you he would be perfectly fine with sacrificing his games over doing fun activities with someone he loves.", "NTA, even as a gamer. \n\nBut I'm not sure you can win this one. Your request is reasonable; I'm not sure this man is. \n\nIf he insists, he's giving you valuable information about himself and his priorities. I'd suggest considering that information carefully before taking any steps to move forward in this relationship.", "NTA. I'm a gamer and it would never occur to me to bring my gaming pc on a vacation.\nIf your boyfriend can't go a few days without gaming, he has a serious problem.", "NTA\n\nI had to go back and check the age at the beginning. This reads like he's 14 not 24. Man is not ready or interested in a serious relationship. He's making the same arguments a literal child would make to his mom when asked to stop playing for a moment and come down for the nice dinner she has made.\n\nHe's been clear that if it's you or the game, the game takes priority. Invite someone else in his place and don't waste anymore time on him, or at the very least, don't plan and pay for any more vacations for him cuz he clearly doesn't appreciate it.", "NTA, if he can't go for a couple days without his computer, he has an addiction and needs to get that checked. Bringing a pc to a vacation is just ridiculous.", "NTA tell him no PC and if he doesn't agree bring someone else or go alone.", "NTA. I enjoy gaming as well, but I know how to prioritize. It absolutely does not take precedence over a short vacation with a partner. \n\n\nSure, you don't have to spend EVERY minute of your vacation together, but to be quite so inflexible about it would be infuriating to deal with if I were in your shoes.\n\n\nAlso, think about it. Right now it's just a vacation, there could be a point where you genuinely need your bf's help on some unpleasant situation which may pop up any time of the day. God forbid if it happens after 9 PM, because that would be highly inconvenient for him and he'd ask you to deal with it yourself since he's so serious about his gaming.", "NTA he's more interested in playing video games than in a relationship with you. He's got problems", "NTA but if he does this every night when do you spend time together? Does he go to bed after you?", "NTA, I play games on a daily basis (and even make an income out of it) and I still would be able to make a 2 week vacation without my PC with no problem at all. This is just 4 days, he's being unreasonable.\n\nYou deserve to have the vacation you wish to have.", "Your partner needs professional help. This is not normal behaviour - you need to put your foot down. \n\nI know *everything* is breakup worthy for Reddit … but this is just genuinely concerning behaviour. The fact that he can’t go without gaming for THREE nights is genuinely worrying. Even if it was his job it would be worrying. The fact that this is a recreational league makes it honestly really really weird.", "NTA, Brad is the one who is being selfish.", "INFO: \nIs any of the stuff you planned stuff he actually wants to do? Does he seem at all interested in going or is he going because you want him to go? Does he like bar hopping and live music? Are the day activities stuff that he's interested in?\n\nAlso is the tournament immediately after you guys come back?", "NTA, seriously...he can't take 3 nights off from gaming? What kind of a like will you have with someone like this? \nGet a new boyfriend ASAP", "Nta.\n\nYou do know that this is how your life with him is always going to be don't you?\n\nIf you dont want to play 2nd fiddle to his gaming for the rest of your life get rid.", "NTA but I would cancel the trip until he feels like he can go without the computer.  Might be after the competition, but I would certainly not want to waste a vacation with my spouse on the computer every night.", "YTA - the man needs to game dammit. Why would you prevent him from that? /j", "Red flag for what exactly? \n\nWhy does this term keep getting thrown around as if any sort of disagreeing trait means imminent danger with a side of possible death? \n\nOP is certainly NTA and while Brad is being a bit whiny about gaming, it is clearly a passion of his and his reasoning for bringing it is to prepare for a tournament. \n\nIf anything, it’s more of a warning sign that “look OP, Brad likes gaming and takes it seriously and a vacation won’t hinder it when he’s prepping for something big in terms of his hobby.”\n\nOP will have to figure out if they’re okay with knowing that super important events aside, if Brad’s hobby has a thing, that thing will revolve compromising around. \n\nI don’t think him wanting to bring his nerd station on a vacation spells out the end of a relationship.", "He's most definitely an AH. Dude seems addicted and needs help, he does NOT need to be enabled. If he can't stay off the PC for 4 days that's just says a lot.", "He'll just find another excuse. He sounds addicted by the sounds of it.", "Things are only going to get worse from here. You're only dating and he's doing this. If you guys get actually committed or married it will be so much worse. 😔", "Who mentioned bloody death 😂 \n\nWhat are you talking about?\n\nI agree it is a warning sign.  Perhaps there should be some sort of symbol, perhaps in the form of a flag, that could be used to warn others?\n\nI think wanting to play games with his mates, be they \"nerdy\" games, or otherwise, every night of a holiday, is a huge red flag.  It would be the same if he decided to go an watch sports in a bar every night of the holiday.\n\nShe has planned a trip away and he just wants to play with his mates, despite it upsetting her.", "A red flag is literally the term for warning sign... it doesn't mean that bard even is a bad person. Everybody has a red flag here and there. The problem is when the red flags built a traile...", "... so you never go to the movies, never go out drinking? What about brithdays? Dinners?", "Jesus. He sounds addicted and he needs to get professional help for it. This is NOT normal.", "Yep, even if this is a fulltime job, sometimes you have to prioritise your family, mental health etc.\n\nThis however, sounds more like an addiction/hobby gone overboard.", "And I am sure if you had a choice between video games or sex, you'd choose sex! \n\nMy husband will drop video games quick, if I said 'let's have sex\". No save of the game or anything!", "YTA for staying", "NTA. A whole ass pc? On vacation? A Switch (or other handheld) is the only acceptable console to take on holiday. If R6 is REALLY that important to him he can invest in a steam deck, but this is unreasonable", "NTA.\nReal life and a real world  relationship is better than any game... or at least should be.", "NTA\n\nThis guy has made it clear that gaming with his pals comes before everything else in his life, including you.\n\nIt wouldn't kill him to take a few nights off, but he simply doesn't want to. \n\nI'd say that this relationship has probably run its course.\n\nAsk around to see if anyone else wants to go with you. If nobody is available, then see if you can change the booking to when someone is available.\n\nLeave this guy at home with his gaming chums.\n\nDon't marry him - he is already married to his gaming team.", "nta", "How do you feel about going to the bar and going dancing solo? You have all day together, but can you go out without him?", "NAH\n\nI mean, it's a bit weird that he wants to take his PC on holiday with him. But if that's what he wants to do then ok 🤷\n\nDoes the entire vacation have to 100% revolve around what you want to do ?", "YTA\n\nSome people read to unwind after a day filled with vacation activities.\n\nSome people type on their phone.\n\nSome people call friends and family.\n\nGaming should be given the same considerations as the above stress-relievers (And, yes, vacations can be stressful) after a day of planned activities at a vacation spot where people may be forced to have fun.", "NTA but I’d like to go bar hopping and see some live music and/or go walk on the beach at night .  There is nothing stopping you from doing any of these things indeed you can do things solo in the evening and leave him behind entirely to play with his buddies. \n\nYou had hoped to have a romantic evening but Brad has other things that bring him joy and he isn't willing to make you the priority on these few days.\n\nSo YOU an adult woman can totally go to a bar and live music and a beach and you will enjoy them without Brad grumbling about the gaming he is missing.   You might even do things solo during the day without considering Brad or what he wants to do in the slightest.  Take a day on this holiday for YOU - Just YOU - nobody but YOU.\n\nWhen you get home, you will discover lots you can do without Brad -", "NTA. This is a massive red flag. Ask if this is the person you want to spend your life with. Your clearly have different relationship expectations. \nYou are not controlling him. \nIf I was you this relationship would be over. I’d find someone else to take on vacation or I saw you said you don’t like going alone) I would go alone", "The internet will be bad enough that it will cause him to have a meltdown", "NTA, if it’s not an esport he does not need to practice over time spent with you.", "So a few things. First off, NTA\n\nI play games, my husband plays (including online games with other people). So I do understand how these things work.\n\nHe can take a holiday. If he CAN'T, he has a problem.\n\nIf he WON'T, you have a BF problem. Honestly, this would be a time for a conversation about your future. Do you want to spend your youth with someone who won't go out with you? This really feels like a deal breaker to me. It's not even a week. It would be reasonable to ask for it for two weeks! If he won't commit to spending time with you, it's time to break up and move on. \n\nBaby, go on the trip by yourself if he won't leave the system behind and you can't find someone to go with you. Be brave, go experience new things and relax. Have fun on your own, meet new people. There are ways to be safe (particularly with your phone, get some air tags (or the like) for your car/person/luggage) if you're worried about being a woman traveling alone.\n\nYou're young and should be enjoying life. Enjoy your trip, BF or not.", "Dump the bf, take me instead!\n\nI cannot believe you are paying for a whole holiday with someone who wants to spend their night doing what they do everyday anyway ?!\n\nI would never even consider bringen my gaming setup. Maybe my switch for on the plane. But come on ?! You're paying and he's being so ungrateful!\n\nStart hitting up friends and family, go with your mom or another friend!\n\nNTA", "NTA, at some point he needs to grow up and learn to prioritise, gaming, family time, work, vacations, they all must be balanced. Taking your gaming PC on a vacation with your girlfriend is immature, selfish and as others have pointed out, a pretty big red flag, i guess spending time with you OP while you two are on vacation is not as important as gaming with his buddies.", "NTA my daughter’s boyfriend plays R6 every night and has played in monetary comps. \n\nThey are about to go traveling for a month. Not one peep about playing whilst away. \n \nHe needs to get his priorities in order. The games should not rank higher than his chosen person. This shows you he doesn’t choose you. \n\nSee if a friend can come, or go yourself and spend some time and energy on you.", "NTA vacation is typically a time when you do things & spend your time *differently* than normal day to day life. He’s obviously not seeing it that way but he should be able to adjust. The competition & practice sounds like an excuse to continue enjoying his bro-time with his buddies. I don’t know if I’d *not let him* come on the trip because that will probably lead to a relationship crisis or end & not sure you’re up ready for that. But do try to re-frame your hopes & expectations to him after taking in all the comments & advice here. If he doesn’t comply, then I would just try to make the best of the trip & enjoy *yourself* as much as possible & spend the hours after 9pm reflecting on your relationship. Remember what it was you wanted in the first place. For some of us, *romance & intimacy* are what we hoped & dreamed for but we settle for less & the become more of a pipe dream. If you’d prefer to spend your nights differently on this vacation & he can’t give you that, when will he? *Never*", "Start asking everyone you know if they can get those days off and take someone on this vacation that is willing to not be massively disrespectful of you on your vacation. \n\nAnd am I understanding correctly that you're paying for the vacation? Cause if so, please try taking someone else even more so. \n\nNTA but honestly why are you with him? \n\nMy bf is super into gaming, loves it so much that he studied game design, and makes video games as a career, and the thought that he couldn't go without gaming for a couple days is absolutely ridiculous.", "As a hardcore gamer (married with kids and a job), I play a lot at nights / evenings when family is asleep as well.\n\nBUT! Vacations are sacred. On vacation there is no PC, no laptop and at most a mobile game I play at times.\nVacations are for real life.\n\nEven as a hardcore gamer, I advise you to drop the guy dead, unless that championship has guaranteed significant money prizes he has a real chance to win - and I seriously doubt that part.", "When do you guys do things together? Playing EVERYDAY after 9pm means no dinners at a nice restaurant, no movie night, no sitting at a friends house drinking booze without looking at the clock. Ffs not even having spontanious sex after coming home.\n\nI'm not a big gamer, so i can't relate wih this exact thing, but there is not one activity that would cross my mind being worth sacrificing EVERY evening and therefore my realitionship. NTA", "NTA\nhonestly something unhealthy has been normalized and now you’re gonna be gaslit trying to fight for fair/reasonable ground.\n\nmay or may not be successful but I’d strongly consider whether you want that dynamic lifelong", "NTA. If missing three practices is gonna have that big an impact they can’t be very good anyway. We should all go to the beach instead of Brad!", "NTA he should stay at home if it is this important to him to train for the game. And that would in my opinion be super okay, but he should have told you that he didn't have time for a vacation right now.", "This is so sad. Your boyfriend prioritizes his friends and his gaming over a vacation with the person he is supposed to love and you are wondering if you’re the asshole. Your BF has made his priorities clear. He all but erected a Billboard with the message “I do not care about you or this relationship enough to spend 3 nights of vacation in your company.” I have to ask, does your BF even like you? NTA", "NTA\nA 9pm curfew on vacation would be a deal breaker for me. He does not want a vacation where he spends the evenings in activities with you. He wants to bring his daily gaming routine along unaltered.\n\nA couple's vacation SHOULD be focused on the couple, not giving you attention in daylight, then ignoring you at night. He does not want what you want in this vacation. He seems willing to come along, but not to make compromises.\n\nI'd find a more compatible traveling companion. I wonder how committed to your relationship he is. Have you vacationed with him before? He seems adolescent, unwilling to give up his bro time for a vacation with a gf. I don't think your priorities and goals for this relationship are well aligned. Are you expecting him to change into your ideal of him? That's unwise.", "NTA and you need a new bf", "NTA, sounds like you have an addict on your hands.", "NTA. Your BF sounds like he's either a child, or too committed to videogames to maintain a relationship.\n\nIt's literally 3 nights, what's his big issue about not playing a videogame he plays everyday for 3 freaking nights.\n\nYou're NTA at all. Wanting your BF to be present on your couples holiday is not controlling in the slightest", "Love this answer. Short, sweet, and straight to the point.", "His friends might not know", "Ask one of his friends and see if video gaming is as much a priority for them.", "In any case this is an example of what will your future life with him look like. It will not magically get better.", "The sad thing is you are already going to be alone…every night at 9 pm sharp", "\"Red Flag\" means warning sign doofus", "You have a weird and extreme interpretation of \"red flag.\" Perhaps work on your defensiveness.", "A red flag doesn’t mean ‘look out you’re going to get murdered’. It’s just an alert that there may be differences that are incompatible. It’s a warning. Everyone has red flags. I do agree that they get thrown around way too easily, but they don’t mean what you think they mean.", "Sounds like he needs a reality check.", "Noooo way. I was trying to be flexible and thought « Maybe it’s a laptop so it could be seen as taking a Switch or a book ? » but hell no, addiction runs deep here 😭 I feel for OP", "Literally! I was just coming to say this.", "If he can’t prioritize you now, even on a vacation for Christ sake…what’s going to happen if you have kids or are sick?  Sorry honey I’m gaming take care of yourself?  You will be alone in this relationship until he grows up, and that will never happen until you force him to. \n\nI have a group of friends like your bf does.  We all played games probably 4-6 hrs a day together when we were single; less when we got into relationships and moved in with our girlfriends.  But we never did that shit on vacation. Even on our vacations together we didn’t bring our PCs. We tried to enjoy the place we were at \n\nYour bf should be embarrassed and you should seriously reconsider the relationship."]}