{"id": 20963, "submission_id": "14mvbe3", "title": "AITA for defending myself against a jealous toxic friend's gf", "selftext": "I'm a female (20) and I have been friends with this guy (18) for a couple months. I met him in an app called Epal where you can order people to either play with you video games or many other things. We somehow became friends and we sometimes play games or watch movies. He made clear he had a girlfriend from the start and I didn't say much about it, except how pretty she was. Never I was disrespectful or being weird towards him and his girlfriend. \n\nHe was looking for a job recently and I proposed to help him, I won't just give him money for no reason. He basically would be giving ideas about pictures content (NO nxdes or any kind of nudity pictures), he agreed and we spoke about some conditions and terms so there is no misunderstanding and nothing that violates his relationship. We agreed that he would be on a trial for a week and then I would decide if he is hired or not. \n\nWell I received a message yesterday of him asking if he could call, I first asked why and he replied that he wanted me to explain the job to his girlfriend so she can feel more comfortable about it. At first I was a bit confused but I agreed to reply by voice message because I was busy and outside of my house. \n\nWhen I got home, I sent them a 2 minutes voice note, explain the job to her ect. I mentioned everything and anything without hiding any details from her. She then replied with a few messages saying \"don't push him, pay him, trial is over, pay him and thanks\" \n\nI processed to send a new voice note of almost a minute explaining that this doesn't work this way and that if she has a problem, she needs to talk about it to her boyfriend and not me. \nHe then replied and said that I should ignore this, that she didn't listen to the voice notes and just basically attacked me without reason. \n\nI was obviously very upset about her randomly coming after me, and explained him that this was very immature behavior and that she shouldn't do this. He then replied by taking her side and saying I should talk about her like this. He said it was all on him but none of them apologized.  \n\nAITA ?", "created_utc": 1688116321, "permalink": "/r/AmItheAsshole/comments/14mvbe3/aita_for_defending_myself_against_a_jealous_toxic/", "score": 125, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) I defended myself against her and called her immature.\n2)  I don't know if I did good or not and would like to know if I am the asshole for this.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA dont work with him if he's not going to realize how toxic his gf is to someone who is literally helping her bf get a job", "NTA you’re literally helping the dude get a job and his gf should be thankful to you instead of being antagonistic. I can kind of understand why the gf might be worried but that doesn’t give her the right to be a rude. Personally I wouldn’t hire the guy if this situation continues like this.", "NTA\n\n&#x200B;\n\nThis is getting far too tedious. Fire him.", "Well I’m really confused. You sound smart and capable and busy so why would you need a epal? Why would he need help finding a job? He has one. This just seems weird and doesn’t make sense. Move on from the guy. Nta.", "NTA\nHe's too much drama. Why would you need paid consultation from an 18 year old? If the relationship is based on sharing games and movies remotely, moving into a different, employer/employee relationship seems odd.\n\nHe is still very young. Back off and give him time to grow up a bit more.", "NTA, I don't think you did anything wrong.", "NTA, his girlfriend should discuss her issues with him and he has to decide how to deal with it. It has nothing to do with you", "NTA don't work with him and fall back. Leave the dude alone.", "I dunno about this one. On one hand, I know that my wife of 19 years wouldn’t approve of a woman sending me photos for any reason. However, I don’t think you’ve done anything wrong here, either. I’m going with NAH, because both you and GF are coming from honest places.", "If I understand correctly, someone sends your photos, and you pay for them? If my partner regularly sent pictures to some women and got paid for it, I would find it uncomfortable too. She's is not a jealous toxic girlfriend. She is just a concerned girlfriend who is genuinely concerned about what kind of scam you have. Because you already get photos form the guy but don't pay?\n\nYTA for your response to his girlfriend and this situation is just bizarre.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI'm a female (20) and I have been friends with this guy (18) for a couple months. I met him in an app called Epal where you can order people to either play with you video games or many other things. We somehow became friends and we sometimes play games or watch movies. He made clear he had a girlfriend from the start and I didn't say much about it, except how pretty she was. Never I was disrespectful or being weird towards him and his girlfriend. \n\nHe was looking for a job recently and I proposed to help him, I won't just give him money for no reason. He basically would be giving ideas about pictures content (NO nxdes or any kind of nudity pictures), he agreed and we spoke about some conditions and terms so there is no misunderstanding and nothing that violates his relationship. We agreed that he would be on a trial for a week and then I would decide if he is hired or not. \n\nWell I received a message yesterday of him asking if he could call, I first asked why and he replied that he wanted me to explain the job to his girlfriend so she can feel more comfortable about it. At first I was a bit confused but I agreed to reply by voice message because I was busy and outside of my house. \n\nWhen I got home, I sent them a 2 minutes voice note, explain the job to her ect. I mentioned everything and anything without hiding any details from her. She then replied with a few messages saying \"don't push him, pay him, trial is over, pay him and thanks\" \n\nI processed to send a new voice note of almost a minute explaining that this doesn't work this way and that if she has a problem, she needs to talk about it to her boyfriend and not me. \nHe then replied and said that I should ignore this, that she didn't listen to the voice notes and just basically attacked me without reason. \n\nI was obviously very upset about her randomly coming after me, and explained him that this was very immature behavior and that she shouldn't do this. He then replied by taking her side and saying I should talk about her like this. He said it was all on him but none of them apologized.  \n\nAITA ?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "In retrospect your using epal makes sense, I’ve done similar.", "It was a few months ago, I didn't have much friends to play with, and I was ordering people to play with me Valorant (a video game), there is girls and guys and everyone is nice. Me needing or ordering an epal isn't the problem here. He doesn't have a job, epal is a side hustle thing that doesn't bring much.", "Thank you for your comment, but no, I am not sending him any pictures. He give ideas, and that's it. That was the conditions we agreed to.", "No, you are not getting this right. He is giving ideas of what kind of pictures I can post on my social media (I am a model, influencer), and he was on a trial for a week, which means he does not get paid, he is being judged. He was going to be hired either way and paid because he is a friend of mine. But I'm thinking that maybe not anymore. And yes I understand she might be concerned, but did you not read that I sent her a 2 minutes voice note explaining her everything and how it works ? She decided not to listen to it and attack me instead.", "I don't use it anymore, I was just making friends there, to which I met this guy. And he was making clear he had a girlfriend from the start to everyone, even posting pictures about her. So it's not like no one knows, but her being passive aggressive out of nowhere is my concern. I didn't send any weird pictures, I was not doing anything weird, and in fact, I am currently meeting up with someone (in the stage of knowing each other), so I am not interested a bit in this friend.", "Okay but very important question.\n\nWho is your valorant main?", "How does he give you ideas without pictures? Does he even know what you look like?", "So he would be a regular photographer for you then?", ">which means he does not get paid, he is being judged.\n\nYTA. Any employer who does this is TA.", "I main both Reyna, Sage and Killjoy, I'm a big rat in this game haha. And you ?", "He doesn't get anything in dms, all my pictures are on Instagram, and none of it is inappropriate. I could share it with you to give it a look.", "He won't be taking the pictures, he was suppose to give content ideas. Nothing that bothers his relationship.", "LOL I also main Sage and Killjoy! Though recently I've been having a blast as Deadlock.\n\nSentinel player for life lol.", "No, that’s ok. I’m leaning a little more towards N T A. Maybe OP can get his GF involved. Women tend to have a good eye for this sort of thing.", "I didn't try her yet, how is it ? I play sentinel a lot too."]}