{"id": 21012, "submission_id": "14nfogo", "title": "AITA for humiliating my bf and telling his friends?", "selftext": "My bf(29M) and I(28F) met in the same company. I since left but he’s still there. He makes about $130k in tech sales. I make $180k as a cloud architect. He likes to complain because his commission compensation was reduced and the pre sales engineers got a raise. I know it’s because a lot of sales people were writing really aggressive contracts that led to unhappy customers and now the guidelines for sales has made it harder to make sales. My bf use to make $40k more so he’s a bit pissed about that although to me it’s just the natural downturn in the tech sector. \n\nHe was talking shit about how all presales engineers do is talk about products on PowerPoint and don’t do any actual work that makes the customer sign. I got annoyed because he doesn’t know anything about tech and most presales engineers I use to work at had 4-8 years of software development experience not to mention very specific training on the products before they got to be making that salary. I have 2 years of support experience 3 years of software dev experience before I made 180k and my bf only has sales experience so to discount with how much knowledge is needed is pretty shitty. He said he knows some coding and could take their jobs.\n\nI told him since he thinks he thinks he knows their role he should be able to pass a junior coding interview and technical questions. He agreed and said loser pays for dinner and I agreed. I got some interview questions and coding questions like fizz buzz and hash map coding questions. \n\nHe couldn’t answer a single question not even things like what’s a difference between Java and Python, explain what the OSI layers are, what caching is and the craziest one is what’s the difference between SAAS and IAAS which he definitely should know because he is selling SAAS products. I had 10 very basic questions and he couldn’t answer a single one. He also did make any of the code run. \n\nHe was pissed and argued with me the entire time but I googled things to prove he wasn’t right he would sulk and didn’t pay to dinner.\n\nI was kind of bitter he didn’t pay for dinner and when a friend of his came over a week later I told him about it and we had a good laugh because he always likes to complain how easy engineers have it while he has to travel and boasts how he could do their jobs easily. He was there and yelled at me later for humiliating him.", "created_utc": 1688168041, "permalink": "/r/AmItheAsshole/comments/14nfogo/aita_for_humiliating_my_bf_and_telling_his_friends/", "score": 1635, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the asshole for making a mock interview that my bf couldn’t pass and then telling his friend who laughed at him\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA Break up with him and move on", "ESH. But soft TA for you. You are dating a salesperson after all.", "ESH.  Your boyfriend for his attitude and refusing to honor the bet.  You for bringing it up with a friend of his just so you could both laugh at him about it.", "NTA you and his friend were just having a good laugh over something light hearted. it sounds like your bf is a little embarrassed about not knowing something simple for his field of work.", "ESH\n\nYou didn't have to tell the friend, but you did, specifically to humiliate him.\n\nHe talked a good game, but could back it up and is a sore loser. He lost a betand didn't pay up.", "ESH. He was talking smack, you proved your point. Rubbing salt in the wound by telling a friend is just making fun of him and just made him feel worse. This is a small disagreement and you could have defended your feelings in a much less inflammatory way.", "NTA. He got the right treatment for acting so winey", "He welched on a bet.  Humiliate him some more until he pays up.  NTA", "ESH.\n\nTelling his friend about it was cold and unnecessary. You already made your point.", "Yta look I have been an engineer for awhile. But without sales people none of us would get paid. Me saying solve fizz buzz to a salesperson would be like them telling me to close a customer. I think we would both be failures.", "I was (no longer in tech started a business with my wife) a PSE at a large network security company. I would deploy and fix but also demo and scope. Kinda a intermediary between sales and development. Technical expertise is priceless. Knowing I had a team of wizards to call was always more valuable than having a sales guy that promised such crazy shit I needed wizards. Having said that, a big ego is important for sales. Don’t crush his ego if you want him to be successful. He doesn’t need to be an astronaut to be sales, just a confident monkey.", "As much as I can’t stand braggarts OR sore losers,you crossed the line when you told his friend. ESH,but him much more than you.", "ESH. You actually make yourself sound slightly worse than your bf, which is impressive because he comes off as a jerk *and* an idiot. Googling results to rub his failure in is kinda understandable; humiliating him in front of his friend just makes you sound horrible.", "YTA", "Not enough info. Was the friend one of your former/his present coworkers? If so, YTA. Otherwise, your bf is being a sore loser and has some ribbing coming to him. However, sharing this kind of thing with his friends is probably going to hurt your relationship/his trust in you.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy bf and I met in the same company. I since left but he’s still there. He makes about $130k in tech sales. I make $180k as a cloud architect. He likes to complain because his commission compensation was reduced and the pre sales engineers got a raise. I know it’s because a lot of sales people were writing really aggressive contracts that led to unhappy customers and now the guidelines for sales has made it harder to make sales. My bf use to make $40k more so he’s a bit pissed about that. \n\nHe was talking shit about how all presales engineers do is talk about products on PowerPoint and don’t do any actual work that makes the customer sign. I got annoyed because he doesn’t know anything about tech and most presales engineers I use to work at had 4-8 years of software development experience not to mention very specific training on the products before they got to be making that salary. I have 2 years of support experience 3 years of software dev experience before I made 180k and my bf only has sales experience so to discount with how much knowledge is needed is pretty shitty. He said he knows some coding and could take their jobs.\n\nI told him since he thinks he thinks he knows their role he should be able to pass a junior coding interview and technical questions. He agreed and said loser pays for dinner and I agreed. I got some interview questions and coding questions like fizz buzz and hash map coding questions. \n\nHe couldn’t answer a single question not even things like what’s a difference between Java and Python, explain what the OSI layers are, what caching is and the craziest one is what’s the difference between SAAS and IAAS which he definitely should know because he is selling SAAS products. I had 10 very basic questions and he couldn’t answer a single one. \n\nHe was pissed and argued with me the entire time but I googled things to prove he wasn’t right he would sulk and didn’t pay to dinner.\n\nI was kind of bitter he didn’t pay for dinner and when a friend of his came over a week later I told him about it and we had a good laugh because he always likes to complain how easy engineers have it while he has to travel and boasts how he could do their jobs easily. He was there and yelled at me later for humiliating him.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Boy, this was a real slog", "OMG, break up with him. He's too old for this shit. \n\nNTA\n\nIf he'd paid for dinner that it would be Y T A, but he's a brat and doesn't appreciate other people's expertise, nor apparently his GF, nor honor his word. Dump him and move on. People like that don't grow up.", "This. That guy sounds like a looser. Nta.", "I would agree if he paid for dinner. Being a sore loser opens you up for ridicule", "Humiliating a person will just make them more angry and resentful of whoever humiliated them. OP won the bet and I think the bf should pay up, but making fun of him will just make this stupid situation snowball into something even dumber.", "OP crossed the line of light teasing and enter squarely into being a ah.", "How is she?", "[removed]", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Nta. He’s disrespectful and you don’t like him.  What Is keeping you there?", "NTA. Your boyfriend sounds like a lot of sales guys I've dealt with, first as a field engineer and later on the customer side as a solutions architect. If he's taken a commission hit because of more stringent rules, I'm assuming he's the kind of bait and switch artist I hate working with the most. Those types need to be taken down a peg from time to time.", "You’re not the asshole and also why the hell is your boyfriend yelling at you? huge red flag", "ESH. Of course your bf was an ass, but I would ask you this. Do you care about your boyfriend? If you do, intentionally and publicly embarrassing him is not something you do to someone you care about, unless you're an AH too.", "Out of curiosity, do you want to date this guy? Purposefully going out of your way to humiliate him in front of his friend is a good way to start a break up imo \n\nESH tho cus he should have paid up", "Yes, YTA for humiliating your bf in front of his friend. Tearing each other down in front of friends is a good way to lose trust and respect for each other, and without that it's hard to keep the relationship going.\n\nYou proved your point. If you are still bitter about him not paying for dinner, that's something to resolve in private. But bringing other people into your relationship drama is pretty much always a recipe for disaster.", "ESH. Both of you should be evaluating the future of this relationship", "Oh, NTA. He's definitely the A here.\n\nIs he like this a lot? He sounds like a super fun guy to hang out with.\n\n(that last part was sarcasm, for the Sheldons in the room.)", "NTA. He is talking smack and does not know even the most basic technical things.", "both are AH lol you both are clearly not made for each other even though you have similar job fields   , you both look to throw mental jabs at each other any chance you get so it will lead to fighting and only escalate in the future to full blown fighting", "NTA. I'm in the same same industry, started as sales then moved to post sales engineering, we should have a similar job scope. I have been on both sides. The number of times sales talk shit about us but afraid to meet client tech team by themselves is hilarious. I have also sat in meetings and listen to the sales team promise the sky, none of which was deliverable, even in the case that it were it is way beyond the client's budget and they need to partner with 3rd party providers which sales will conveniently neglect to mention. Boyfriend sounds bitter and over estimate his own ability.", "You're above his pay grade. NTA", "I hope you enjoy the single life", "NTA\n\nBecause he’s a sore loser and wouldn’t honor the bet. If he had paid for dinner then yeah it wouldn’t be cool of you to laugh about it later.", "ESH \n\nIt sounds like you didn’t really respect his career as “only sales” is mentioned a few times. Are you sure you like this guy? And were you smug while he got every question wrong?\n\nHe also seems to have a pretty bad attitude, which is is why ESH.", "He should have paid for dinner. NTA.", "What does ESH stand for?", "ESH i think because he’s talking out of his ass and not acknowledging the work that you have to do but maybe you shouldn’t have told the friend about it … kinda unnecessary unless you and your bf are already at the point of laughing it off together.", "YTA. Mock interviews can be cruel, but sharing with friends? That's a low blow. Communication is key, not humiliation.", "NTA\n\nBoyfriend set himself up to fail, through a heady combination of arrogance and ignorance. Aim higher, OP. You’re too smart for him and you always will be. \n\nDon’t settle. Ever.", "You weren't the AH for challenging him.\n\nYou were for telling people.\n\nNeither of you look good in this story.\n\nAlso, he's in sales, most of them are like this and no offence but really don't contribute as much as they think they do and they often have an unreasonably favourable contract for what value they bring to businesses in my eyes as well as what skills they require so I'd have expected the same outcome as you did when you challenged him.\n\nThat being said, it was humiliating enough for him to be proven wrong, telling his friends is a real AH thing to do, far more than his arrogance made him an AH.", "Esh", "ESH. Him for welching on the bet and you for needlessly humiliating, especially since it seems that you knew how he'd react. Both come across immature.", "YTA, but hey, at least you're creative. Just remember to use your powers for good next time! 😅", "Anytime I see a title with, \"AITA for humiliating my partner,\" I immediately think, YES!\n\nIt's never ok to humiliate your partner or your friend.", "Why on earth would you do that? If he’s acting childish, etc, that’s for private conversation and/or therapy.\n\nSo. Yes.", "A lot of people are saying ESH because you talked to his friend about it, but in my opinion, he got what he paid for. NTA, especially since he makes the same claims to others in his group. You proved that your boyfriend is all bark and no bite.", "ESH. You ended your relationship and his friendship essentially.", "ESH - you for laughing at him with his friend and him for being a sore loser.", "You had us all cracking up! Definitely an A, but a hilarious one. Hope your bf has some revenge planned!", "I dunno. Maybe you shouldn't have brought this to people outside the relationship.\n\nSales people can be very obnoxious.", "Some thing about this is off.", "His ego is bruised 🙄 just have a chat with him \nI don’t think it’s anything major to break up over \nHe is probably very unhappy about his situation and doesn’t know how to deal with it so he is taking it out on you ( which is awful) … if you notice him getting worse with his mood , behaviour etc he might have to go to therapy \nTherapy is amazing!! It helped me so much", "ESH, him for talking out of his ass and you for telling the friend about the whole thing, and both of you for being completely insufferable.", "Why are you dating him? You sound awful for each other. NTA", "ESH. Stop competing with your BF. There are no winners.", "Another very rational comment in AITA", "400+ upvotes what the actual hell?", "Yeah listen to the dogmommy on reddit and end your entire relationship and 300k combined income instead of communicating!", "you for real?", "My point as well", "[deleted]", "This exactly. NTA He went from being a tool to a flaming AH when he went from talking smack (about his own girlfriend, no less) to being a sore, footstamping loser when he lost the bet and refused to act like an adult about it. Maybe he shouldn’t have tried to prove how worthless his girlfriend was in the first place and talked such a big game about himself to that friend in the first place. 🙄", "ESH for just being so deeply, deeply insufferable.", "Rather that than a dude that disrespects her whole field of work. What a piece. He brought it on himself", "Yes, but ot was him acting like he could do her job as good as anyone else. He did not understand that each field is important but vastly different. Cocky man paid his price by asking her to test him.", "Everyone sucks here. Make sure to space it out tho or it will get counted as your vote", "Everyone’s shitty here. Basically both sides are assholes", "Looser than what?", "Right? “Instead of communicating with each other, break off your relationship you’ve had for however long because of this one spat.”\n\nAbsolutely wild take.", "Going out of your way to humiliate someone to others is  not partner behavior, this is the very opposite of a loving act.  He'll likely end up paying her back for that humiliation one way or another - don't be surprised, OP, if he cheats on you or leaves soon, he's definitely being an AH in his envy of how others are compensated (and his failure to buy dinner is dishonorable), but humiliating him to others is going to leave a scar, my bet is this relationship is on the way out. ESH.", "If the genders were reversed and a guy was making fun of his girlfriend for being stupid in front of a mutual friend you’d prob have the exact opposite reaction", "Is it her job to actively work to damage and challenge it?", "There’s a difference between coddling an ego and going out of your way to be cruel", "He made the decision to put his skills on the line with his ego as collateral.", "Yeah, but they weren't making fun of him for being a sore loser, they were making fun of him for not knowing things.", "Seriously. Did they make the post so they could brag about how much they each make? The tale could have been told without that. And yes, I am jealous. That's a lot of money. Bf sucks for being a sore loser and being pissy about his partner making more than he does, but ugh. ESH for sure.", "Looser than all those screws he had loose.", "[deleted]", "This may come as a surprise but the goal of a relationship is not to decimate the other person", "WOO , LOUDER FOR THE PEOPLE IN THE BACK!!  👏👏👏 beautifully put. NTA", "Which he talked big shit about knowing. He shouldn’t have talked such a big game if he was gonna be a crybaby when people laugh at him not actually knowing anything.", "Yeah but if he werent such an arrogant loud mouth he would not have ended up humiliating himself. Respect the different fields of expertise. He brought this on himself.", "Has literally nothing to do with the women you date I’m commenting on your reaction to another persons argument. But congrats on dating, we’re all proud of you.", "Nah, it's still a dick move to publicly shit talk your partner", "Nah, he humiliated himself, but she also humiliated him in public. It's a dick move under pretty much any circumstance to publicly humiliate your significant other.", "It’s a joke among friends, not public shit talking.", "It was not publicly, it was in front of one person. Yes it is very petty, but he did not only first provoke this, but also shit all over her whole profession and then denied to pay up for the bet he easily lost. In comparison what she did was prob just to blow off some steam since the bf is acting like a child.", "I'd argue that laughing at someone *in front of them* is humiliation. It becomes humiliation when it ceases to be friendly or supportive, and OP explicitly says they were bitter about it (and, frankly, it can be inferred that that's why she brought it up.) That is definitely not friendly or supportive.", "In front of a friend of his, and in front of the boyfriend, *is* public. She didn't 'blow off some steam', she went out of her way to make fun of him to his friends. He is *much* more of an AH in this situation, but she is one too.", "I’d argue you’re a bit sensitive. OPs boyfriend sounded like he needed some humbling.\n\nGetting downvoted to shit over a perfectly normal conversation lol", "I don't necessarily disagree that he needed humbling, and that he's the much bigger AH. However, it's still intentional public humiliation of her partner, which is an AH move no matter the circumstance. She's a 2/10 on the AH scale and he's a 6/10 here.", "He yelled at her over this, which puts him at a nice firm 10/10 for me. \n\nIdk what to tell you man. My girl cracks jokes, sometimes at my expense, with her friends and vice versa and we don’t get pressed about it because it’s just jokes. If I was stupid enough to act like I knew something and clearly didn’t, I wouldn’t get upset when people laughed. I would expect them to.", "ESH. Why are you together, you both clearly don’t respect one another?", "You both sound insufferable.", "YTA. You DID humiliate him - on purpose", "Gonna go with ESH because y'all don't seem to like each other very much.  Like, why are y'all even together?", "ESH y'all need to communicate better goddamn 😭 bf bad attitude problems and you e got pettiness problems. Just talk things out", "YTA. Because why you telling his friend? It’s not your friend it’s his. It’s kind of belittling. It’s like you wanted to piss him off. Your boyfriend a Ah too though", "Esh...", "ESH, as someone that makes the same salary people making this much more than the majority of the world and complaining just suck. Both of you are assholes.", "So you guys are the ones who can afford to rent in San José.", "ESH- You both sound like real pieces of work. Also what is with all the not the asshole votes. Redditors showing their real basement dwelling skills in force tonight.", "ESH, but I think OPs bf just wanted to vent about his salary getting nerfed, but it just devolved into a debate about sales vs engineering. I think the thing to do as the gf here was to listen and be supportive instead of trying to prove that he was ignorant and that he deserved to have a lower salary, and then later humilate him in front of his friend.", "You two sound utterly insufferable.", "INFO: Was he just venting and looking for someone to vent to? It doesn’t sound like he was specifically talking about your career and just wanted to bitch about the folks he works with. sometimes it’s ok to let someone be irrational if they’re just getting stuff off their chest", "ESH you both sound insufferable 😣", "YTA. Never loop a third party into a domestic quarrel, it’s mean. And a quick route to a breakup.", "ESH. That's your partner and I imagine you knew he wasn't going be a good loser. I get that he's an ahole, and you were taking him down a peg, but I feel like you already made your point by the fact he failed so hard. \n\nI guess I'm saying that you're an ahole because you knew it would be a bad outcome, and you humiliating him wasnt going to do anything positive.", "NTA. \n\nI’m sorry but these comments are confusing to me. A lot of ESH for telling his friend and having a laugh but ignoring the fact that he not only essentially bashed your career by talking down on it the way he did, but being such a sore loser that he refused to do exactly what he agreed to do solely because he lost? Sorry not sorry but having a laugh with the friend when they’re that bothered by something HE started does not make one an asshole to me", "Sore loser, poor sport, reneged on his bet, argumentative, lied about his stellar expertise AND doesn’t know the difference between SAAS and IAAS. NTA.", "NTA\n\nYour boyfriend sounds like a bitter, insecure wanker.", "NTA. He's one of those sales men who thinks they know tech when they don't know shit. He just got put in his place. BTW, engineers >>>> salesmen all day.", "Wow you design clouds? Can you make me an elephant?", "NTA . The joking wouldn’t have happened if he paid for dinner. Or if he was less of a munch he would’ve laughed along.", "NTA. I feel a lot of people are focusing on the sore loser/not paying the bet part. Instead of focusing on what actually brought them to this point: the fact that he is belittling her knowledge, education and accomplishments (he doesn't talk about her directly, just about professionals like her) to talk himself up. He's chipping away at her accomplishments to make himself feel better. He's an AH for that, OP should laugh his ass out of the door.", "NTA\n\nI honestly don’t see a problem with talking to a mutual friend about it especially if your BF has been boasting about it. Calling people out on their BS isn’t humiliation. Unless it was full on degrading him, it’s fine. \n\nThis seems like a mix of your BF being bitter about his pay cut as well as ignorance about the work of engineers. \n\nIf this is a more modern occurrence, then you guys should talk it out. If this is a pattern then you move on.", "NTA People who can't admit when they're wrong generally deserve what they get. You should be telling someone about his ridiculous behavior because it's a little alarming. I have to wonder if he has any trustworthy qualities, or if he only shows up for others when it benefits him.", "INFO - how long do you think relationships last when you feel contempt for the other person?", "NTA but just break up with him, he sounds like a loser and you're gonna be spending your time doing petty things with him rather than just being happy", "Tbh sales is the first red flag here lmao mostly /s but seriously when has anyone ever been swept off their feet when they hear \"I work in sales\"", "NTA\n\nYou shouldn't date people to would bring you down. He obviously thinks he would even could take your job since he could also do the job of the other engineers. \n\nI'm sure that if he has technical questions, he'd ask you, and then use the information to make people think they are dumb and he isn't. In which part of all of this is he helping you?", "NTA only because I would be so fed up with his behavior that it feels warranted. He constantly claimed he could do the job, couldn't pass a test about the job, argued with the results, refused to pay the loser fee. \n\nNot the best way to start this conversation but it sounds like a real issue in your relationship that needs to be worked out. You're insulted that he's degrading people with careers similar to yours, and he's jealous and bitter that you guys make more money than him. He lost a good chunk of his salary and he's lashing out. Or was he making comments like this before the salary change? Either way, neither of you are saying those things to each other though and you're both just being passive aggressive instead lol", "Nta, also tech architect. I love when people say I am not technical after 20+ years as an ops engineer prior to doing TECHNICAL pre sales. \n\n Seriously consider if you want to be with someone that far below your intelligence level with absolutely no self awareness in our profession. There are better ones out there, trust me.", "ESH. He shouldn't be belittling your profession and background so much.\n\nYou shouldn't be trying to hurt your partner. Seriously why are you still with this guy? It seems like your relationship is just petty at this point and a quest to one up eachother", "NTA. But I have to ask, has he had this kind of attitude in other areas as well? Like always needing to be right, never listening or wanting to believe that you may know more about a subject other than this particular subject? \n\nNot saying that you should always be claiming to be right either. Obviously there will be things that he does know more about and things that you know more about.\n\nIf this is a one-off thing, it would warrant a good discussion about everything. But if he is like this with other things as well, or shows other concerning behavior or attitudes that you haven’t listed here, it may warrant a re-evaluation of your relationship and whether you two are compatible.", "What is a \"cloud architect\"?", "NTA I work in the technical side of the tech industry, I am all for name and shame. He fucked around and found out.", "NTA he sucks", "ESH \nYou both make 6 figures.  You’ll be fine.", "Your boyfriend is an arrogant AH.", "Why is this sub so biased towards women", "Now I know a cloud architect isn’t someone who builds clouds (as in clouds in the sky). But now I’m stuck on it and wondering how you could construct different clouds. \n\nJust standing outside looking at the sky. Taking some measurements. Idk.", "NTA. Bf is a sore loser who got his comeuppance.", "NTA. Husband is a typical salesman and sounds insufferable. You're both earning crazy money and he isn't satisfied, and chooses to blame others for his own ignorance.", "NTA \n\nlol. arent they totally different jobs. sales and engineers. depending on the industry one is more valuable than the other. but the fact he agreed on such an asinine bet. its like why not bet who can sell something? i for one know i cant sell something as good as a half decent consultant. but he lost the bet and he isnt paying up lols.", "NTA\n\nYour husband needed to be taken down a peg", "He humiliated himself. Jealousy is a very ugly trait. As your partner he should be proud and encouraging you to climb higher in your field. But he chose to belittle your ability. Honest question-why are you still with him? A partnership=support and a joy for each other’s successes.", "ESH. He shouldn't have talked shit about presales engineers. You shouldn't have shared the incident to a friend without his consent.", "ahahahahahaha tech sales takes another L", "ESH.\n\nYour boyfriend is one for refusing to honour the bet. You also became the AH when you humiliated your boyfriend with a friend and laughed about it. \n\nBasically you’re saying, \n\n“I did A because my boyfriend did B (in this case, did NOT honour the bet)”.", "NTA. He's just jealous, and mad that you revealed his incompetence. Did you need to tell his friend? No. I do think you're both being petty, but I think you're justified in your pettiness.", "NTA. \n\nHe asked for it with all his shit talk. \n\nAlso. Dump that guy. He’s got grossly low self esteem and he sounds like a sulky baby with a false sense of superiority.", "I don’t understand the E S H votes. When I read the post, I just couldn’t shake the image of OP’s boyfriend as a petulant child. \n\nBoyfriend clearly lacks respect for more technical jobs. While he wasn’t undermining OPs job role directly, him talking shit about pre sales engineers points in that direction. \n\nHe is also a sore loser and a complainer.\nNTA. OP is in the clear. I don’t see it as a personal matter which shouldn’t have been discussed with the friend.\n\nThe boyfriend had already complained about engineers to the friend before. OP was just setting the record straight. Boyfriend needs to be pushed off his high horse.", "NTA, that's just banter. If he can't take it that's weak.", "ESH - you might be right but your relationship is starting to circle the drain and you probably cant undo it.", "ESH I think. The BF is mega A.H seems like, but that don't mean you should be one too.", "ESH - assuming that someone’s job is easy (with no knowledge of the field) is an AH move, but laughing at your boyfriend behind his back is too.", "ESH. YTA for telling a mutual friend something embarrassing about your bf just so you could make fun of him. Not to mention it sounds like he was just looking to vent and you used it as an opportunity to bruise his ego. That’s not being a very good partner and honestly you sound kind of condescending. He’s TA for acting like a child about the whole thing and trying to take down others because he feels down. You both sound immature tbh.", "YTA. Intentionally insulting your partner for laughs at their expense is a dick a move.", "ESH but I think you suck a bit more by humiliating him in front of his friend. It does not sound you respect him.", "NTA - The guy sounds like a whiny blowhard.", "NTA. He accepted the bet, sucked at it, didn't pay up. If he had honored the deal and paid for dinner or had just a modicum of humility, you might suck for complaining later. But he's a big whiny baby and you are in your rights.", "Holy sh\\*t that's just the greatest comedown.  But, you're not planning to stay with him after that?", "everyone is getting caught up in \"did it feel good doing that/was it justified\" rather than \"was it an AH move.\" There's really no argument that this is ESH. Obviously he's an AH, I don't think anybody is arguing against that. Whether he \"deserved\" it or not, you went out of your way to embarrass him with a friend. The quiz itself was one thing, but there's no way you didn't think \"oh this is gonna piss him off\" before you brought it up with his friend in front of him.", "ESH. You two really don't like each other much, huh?", "YTA. Mega lega bigtime . Super duper huge.", "ESH you are both petty and arguing over how one of you makes slightly less of the obscene amount you both make for people in their 20s. Get some gratitude and let that shit go.", "ESH. Him for obvious reasons, you for unnecessarily bringing it up a week later just to embarass him. That's not a good partner.", "ESH. That was easily the most unpleasant thing I've read in a while and I follow r/oopsthatsdeadly.", "NTA. Your boyfriend was degrading towards your career, and everyone working that career. He didn't like it that you proved him wrong. Maybe he shouldn't be so arrogant.", "You need to dump him. He is not only the asshole he’s an immature child.\n\nHe’s rife with Toxic misogyny \n\nLeave before he drags you down with him further he’s not gonna change and you really want to stick around someone like that who belittles you and your career and what you do and then acts like a baby when he hast to do what he said he would do", "ESH\n\nYou guys are both making a killing. $130K is more than the average household makes, combined. And you guys are having a pissing contest?\n\nYour boyfriend is a wuss, but you should also grow up.\n\nI hope that whatever layoff is coming, comes to the two of you. Then you’ll be able to have a pissing contest about your misery.", "Eh.\n\nAs someone who works as a consultant at a consulting firm, I have to say that the sales people _are_ fucking clueless, _do_ think they can do our jobs, _and_ are frequently very arrogant about it. \n\nIf they get taken down a peg or two, they brought it on themselves.", "nah, he wants to act like a child throwing a tantrum, he can be sit there and be laughed at.", "I think when you cop that much attitude you earn a little getting laughed at for it, honestly. He sounds exhausting to put up with.", "He embarrassed himself by being a gobby prick. He absolutely should be laughed at for it.", "That was a shitty move on her part", "I'd agree maybe if he wasn't shitting on her career with his friends", "Yeah, I know she was well within her rights to laugh at him after he paraded her and refused to do what he said he was going to do\n\nShe’s just expected to sit there and take him being abusive and belittling her ?", "It quasi reminds me of the guy who belittled his GF by constantly calling her a bookkeeper when she was a full-blown account with her own business. Some people just refuse to accept that their SO has a better job and is more successful than them, and need to constantly try to tear them down.\n\nETA: Not saying that OP should definitely break up for this alone, but it does warrant a closer look at the relationship to see if this attitude is a temporary one-off type issue, or if there are other red flags that would warrant a break-up.", "People are fucking insane. You’re saying to breakup with someone over a single relatively insignificant event. I can’t decide whether Reddit “advice” is purposefully terrible or if there’s just that many morons giving advice.", "Just imagine if the genders were reversed. OP would (rightfully) be slammed to hell for humiliating his girlfriend in front of her friends, as would the guy that comes in and says \"She sounds like a loser, break up with her and move on\". \n\nClearly ESH", "I don't know, with his shitty attitude afterwards, it might have been good for him. It definitely feels like he's been allowed to let his ego run rampant for a while and needed to get a little bit embarrassed. \nIt was such a small thing, nothing to be overly humiliated about.", "I dunno, teasing with a mutual friend is fair game with people that don’t take themselves too seriously. Like, this shouldn’t have been a sensitive issue; it’s not like it’s about his personal life, it was just about his arrogance. An emotionally healthy person would be able to take the L, have a laugh over dinner, and take some light teasing about it imho", ">You didn't have to tell the friend, but you did, specifically to humiliate him.\n\nHe shouldn't be so butthurt. Friends tease each other all the time and that's probably what she was going for.", "Merloty or Chardonnay-y?", "This. This why so many tech people loathe sales people: sales will promise *anything* a client wants to make a sale, and if tech says “Uh, no, we actually *can’t* do that (for real tech reasons)” tech gets shat upon for them losing a sale.  Or tech comes close, but not actually what sales promised, and suddenly you have a *very* unhappy customer. \nOr, if somehow tech does work their butts off to deliver what was promised, it’s sales that gets the kudos and huge bonus, rarely anything ‘extra’ for tech.", "she also discounts his entire career and the work he's put in as \"only has sales experience.\" He's definitely an out of touch asshole who needs to respect engineers more, but a salesperson who makes over 100K is doing pretty well for himself. sad she has zero respect for his job because of her own skillset. though it's possible she only looks down on him because he may look down on her as well. unclear", "Exactly this. NTA.", "she should just dump him for being an ignorant asshole who doubles down and loses badly.", "That might all be true,  but it's still horrible to humiliate someone . Especially your partner,  and even more especially, in front of their friend", "Sure, in general he should get humbled every once and a while, but that rarely helps make a relationship work. I think OP was right to show him that he doesn’t know as much as he thinks but making fun of him in front of a friend is just unnecessary.", "Man as a sales person I always rely on my engineers. Couldn’t do my job without them. I let them know all the time. Couldn’t imagine not appreciating them.", "Nah. He asked for it with his stupid bravado/superiority BS.", "Dealing with people as a salesperson sucks-it looks as the non-sales people don’t do much because you don’t see them arguing or bending backwards to appease a customer who in the end might not even buy it", "Yet, in order to do *their* job, you would actually need to speak to strangers.  With energy and such.  And pretend to care about the client. And that obnoxious a-hole VP’s kid’s big game.\n\nAll roles take talent to excel at.", "> If they get taken down a peg or two, they brought it on themselves.\n\nTotally healthy attitude to have towards your partner. /s", "This was my thought too. Boyfriend is completely intimidated by OP because she makes significantly more than him.", "Children and young adults who have never been in a serious or long relationship is my guess", "> 300k combined income \n\nDo you think this is a reason to stay in a bad relationship?", "No. You’re right. She should waste several more years on a guy that can’t handle her success and diminishes her accomplishments.  😂😂😂", "Lol, if she didn't have to carry his dead wait she'd be making $180 for herself alone.  If you split $300k she only has $150k for herself, definitely on the losing side of the financial argument.   \n\n\nBut really she should talk to him and see what this is about, not because of money but because she got into this relationship with the guy for a reason and that reason is probably worth a little work.  Talk to him about how him saying she's useless is way more humiliating than talking about how he lost a dumb bet.  And see if he's open to that line of inquiry.  If he's not, that's when you think about moving on, but at least try first, geez.", "That’s exactly it.  He is immature and butthurt, and probably needed to be brought down a few pegs. NTA", "Pino grissly.", "He disrespected her profession and lost . \n\nHe should expect to be disrespected back.\n\nYou get what you give.", "throughout the whole post, its clear she has no respect for his job/career either. they don't seem to be in a supportive partnership", "What was his badmouthing engineers then? He’s publicly bashing his partners job and all but calling her useless to his friends, coworkers, and directly to ops face. The only difference with what op did is she referenced specific ways in which he was useless, and he didn’t even do it in front of his coworkers. And to add in how hypocritical and bad sport he is, he refused to pay for dinner when it was his own idea. \n\nESH maybe but I’m still side eyeing the partner and telling op her partner is not supportive and would absolutely humiliate her with a smile if the situations were reversed. He’d sing her failings from the rooftop because that’s the kind of guy he is.", "I think the implication of the whole post is that the friend is a salesperson who _does_ have technical experience, like Op and unlike the boyfriend, and so could/would appreciate the fact that the boyfriend finally had his bullshit called out, but I'm not entirely sure. But if true, it would be more like Op sharing the story with someone who would appreciate it, and not just Op looking for an opportunity to humiliate him; the humiliation was just a bonus.", "Pointing out someone was wrong isn’t humiliating though. Being wrong isn’t humiliating.", "If he'd taken his lumps with good grace and paid for dinner, OP likely wouldn't have told the story.  But no, he had to be a petulant asshole about it and reneged on the deal that *he* came up with in the first place.", "Considering this humiliation seems like a *gigantic* stretch. \n\nIf the BF is really that think skinned this isn't a relationship that is likely to work out. Gotta be able to take at least a little flak when you fuck up.", "I think you need to redirect that because he’s the one who is trying to humiliate her", "OP doesn't need to be in a relationship with someone who acts like a toddler when he gets proven wrong.", "I imagine every comment on AITA telling someone to break up with him is written by the female equivalent of a basement dwelling neck beard", "She doesn't seem to respect him much, although I can't say I blame her with the way he behaves.  If she doesn't respect him she shouldn't be with him.", "\"Break up with/ divorce them\" is such a common AITA comment. Gotta remember that the Majority of Reddit are children (or emotional equivalent) who have never been in a romantic relationship.", "\"Date someone who mocks your job as super easy and is an ass to you, and you are an ass to right back.\"\n\nHow is breaking up not the right call here again?", "They both clearly have issues. The BF was very immature in how he handled having his ego hurt. She was also vindictive and petty enough to humiliate him in front of his friend. Maybe this can be an opportunity for them to learn together.", "Solid take", "This was a Cold War style fight and OP brought in a third party. ESH", "so? if he wants to pretend to know everything when he knows next to nothing, he deserves to be made fun of for it.", "They weren’t publicly shaming him for any random or general ignorance though, they were shaming him for actually knowing nothing about something he is frequently chatting shit about and claiming he could do a better job than the trained professionals. He totally opened himself to this.", "With posts like these, I like to pretend they’re discussing their salaries in Colombian Peso which also uses $ sign.", "Nowhere did I say his behaviour was acceptable. He's definitely an asshole   but tit for tat is how you end up in  a toxic relationship", "Well, it is to a certain toxic sort of person...", "The humiliation part isn't that she let him know he was wrong. The humiliation came when she shared that with someone else and laughed at his expense.", ">Pointing out someone was wrong isn’t humiliating though.\n\nit is when you go out of your way to bring it up to others. It's one thing to not skirt around the fact that he was wrong, it's another thing to specifically bring it up with one of his friends so they can laugh at him together.", "I don't disagree.  However if you feel the need to tot for tat  in a relationship,  you'll end up in a bitter relationship where you both resent each other. \n\nIf that's what you want... have at it", "Humiliation is the act of humiliating someone \"humiliating: making someone feel ashamed and foolish by injuring their dignity and pride\"\n\nThat's exactly what she intended to do, and she was successful.  It's abusive and no one should have to \"toughen up\". In this situation they're both wrong for the way they behaved.  \n\nYou've now firmly arrived at the point,  neither of them should be in a relationship with the other,  because they do not respect each other.", "I am literally laughing out loud at this \"basement dwelling neck beard\" 🤣🤣🤣", "BF's immaturity isn't starting with \"having his ego hurt.\" It's his frequent comments belittling her job prior to that.", "He deserved to be made fun of for being a sore loser. She wasn't making fun of him for being a sore loser.", "Sounds like something the partner who always loses would say. \n\n(This is a joke, y’all.)", "HE’s making it toxic.", "Ha!  Yep.  I have recent experience with one of those.", "When you are degrading the technical capabilities of colleagues in front of your friends and partner repeatedly it is absolutely fair to say hey friend remember how X goes on about how easy their colleagues job is and how he could do it, well he had to eat humble pie about it. That’s normal. \nHe has been telling everyone that he could do it and these people are overpaid and don’t have technical capabilities from a degree and work experience.\n\nIt’s not haha you are wrong. It’s “you need to stop degrading your colleagues, their degrees and work experience” because it’s poor form and also NOT TRUE.\n\nImagine being so full of yourself and not even being able to answer ONE question for a junior position. And on-top of that to not even know the question relating to the product he is selling - he was proven to be a bit sub-par at his own job. \n\nThe man has the insight of a potato.", "Respectfully there's a huge difference between humiliating someone and giving them a little bit of flak for boasting about things they can't deliver on.\n\nIt's not humiliation to deflate the ego of an egotist.", "Of his behaviour is toxic   and she's behaving in the same way,  what does that make her behaviour?\n\nSeriously,  use your head", "Yes it is. You can dress it up how you like  but you're doing the exact thing that the word is defined as. \n\nYou can argue it's justifiable,  (it's not) you cannot say it isn't exactly what it is though. \n\nIf I was with someone that behaved how either person behaved,  I would not be with them, because it is toxic. \n\nIn a healthy relationship,  you communicate and talk like adults,  you don't act like a spiteful child.  If you can't communicate with the person to resolve the issue,  get out of dodge. \n\nAn eye for an eye leaves the whole world blind.", "Isn't this what the BF is described as doing regularly with his comments about how easy her job is?", "I'm not sure it counts as public, but whatever.\n\nI think the implication of the the whole post is that the friend who came over is a salesperson who _does_ have a technical background, unlike Op's boyfriend who _does not_. So the conversation with the friend makes sense, because the friend would also have known previously that the boyfriend was talking shit he couldn't back up. \n\nAs in, she wasn't just doing it to humiliate him, she was sharing it with someone who _knows_ he's talking shit out of his ass, _and_ could appreciate what ought to have been a learning experience for him."]}