{"id": 21030, "submission_id": "14nldrh", "title": "AITA: Took a snap of the pool at my apartment, got the cops called on me", "selftext": "So, these people show up to the pool outside my apartment building around 10:45 this morning while I’m working from home. It appeared to be two couples and three kids. Since I work from home three days a week, I look out at this pool all day most days.\n\nIt was too hot to run outside today, so I decided early on that I would go down to the pool and swim for my workout. Around 12:30, I am standing at my very large bedroom window and I take a single picture of the pool, as I’m snapping some friends and saying “once these people clear out (that I’m about 95% sure aren’t even residents) I am gonna go out and swim laps.”  \n\nI only mentioned the nonresident part in my snap because we have that happen here all the time and it’s really kind of frustrating. \n\nWell, around this time they were getting out of the pool and one or two of them noticed me taking the snap. One of the guys then proceeds to take a picture of my balcony and throw his arms up at me like “wtf” while I’m sitting at my desk working and waiting for them to finish heading out. I try from there to wave him off like “dude, it’s not that deep.”  I proceed to take care of a little bit of housework while I wait and after about twenty minutes I hear a knock at the door. \n\nTurns out they had called the police over concerns that I was taking pictures of their children. The cop was cool about the whole thing, and he didn’t even bother to confirm my identity or anything. I explained the situation and voluntarily showed him the last 24 hours of my camera roll and he left to relay the message to them. Idk, maybe it’s because I’m not some pervert and don’t have children, but this seems like an overreaction on their part. \n\nSo Reddit, am I the asshole here?", "created_utc": 1688185220, "permalink": "/r/AmItheAsshole/comments/14nldrh/aita_took_a_snap_of_the_pool_at_my_apartment_got/", "score": 71, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I could be the asshole for taking a picture of the pool while people were using it, but I don’t think I’m the asshole because it should be okay to take pictures of the pool that is literally in my back yard.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA- you took a photo of the pool and people happened to be in it. It's not like you took the pic while they were inside private property", "I'm not sure why they called the police or why the police responded.  If you're in public, you can't really stop people from recording you or taking your picture.  I guess if they're residents of the building then maybe it was considered a private pool?  Or maybe one of your neighbors is AirBNBing their place, and the people thought the pool would be private?   I don't know.  just seems like a weird thing in 2023, when every teenager wants to be a social media star, to call the police because you saw someone take a picture in public that may or may not have included your kids.   \n\n\nWould I consider it a little creepy to see some rando taking pictures of my kids in a pool?  Eh, maybe.  And if I did, I'd avoid that pool in the future because some rando was there taking pictures of kids.   But I'm not sure what the police are supposed to do ... like, what if you had a ring camera set up?  Would they call the police to report that you were recording their kids in the pool?  \n\n\nPeople are so weird.    \n\n\nNTA, but maybe be more careful when taking random photos.", "Where do you live where cops actually respond to bs calls? It takes half an hour for cops to show up in my area when someone’s half dead in a puddle of their own blood.", "no, those people who called the cop are.", "NTA but there are a lot of people around these days who do take photos of children and do all sorts of sick stuff. \n\nI can’t really blame them for calling the police", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSo, these people show up to the pool outside my apartment building around 10:45 this morning while I’m working from home. It appeared to be two couples and three kids. Since I work from home three days a week, I look out at this pool all day most days.\n\nIt was too hot to run outside today, so I decided early on that I would go down to the pool and swim for my workout. Around 12:30, I am standing at my very large bedroom window and I take a single picture of the pool, as I’m snapping some friends and saying “once these people clear out (that I’m about 95% sure aren’t even residents) I am gonna go out and swim laps.”  \n\nI only mentioned the nonresident part in my snap because we have that happen here all the time and it’s really kind of frustrating. \n\nWell, around this time they were getting out of the pool and one or two of them noticed me taking the snap. One of the guys then proceeds to take a picture of my balcony and throw his arms up at me like “wtf” while I’m sitting at my desk working and waiting for them to finish heading out. I try from there to wave him off like “dude, it’s not that deep.”  I proceed to take care of a little bit of housework while I wait and after about twenty minutes I hear a knock at the door. \n\nTurns out they had called the police over concerns that I was taking pictures of their children. The cop was cool about the whole thing, and he didn’t even bother to confirm my identity or anything. I explained the situation and voluntarily showed him the last 24 hours of my camera roll and he left to relay the message to them. Idk, maybe it’s because I’m not some pervert and don’t have children, but this seems like an overreaction on their part. \n\nSo Reddit, am I the asshole here?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "[removed]", "NTA. Not everything is child abuse.", "INFO - \n\nWhy was it necessary for you to send a snap of the pool to your friends? Couldn't you just send one that was a selfie saying you were waiting for the pool to clear out?\n\nQuite frankly, it is kinda creepy to take snaps of strangers and unnecessary. It may be legal, but it really is pretty rude to take pictures of people without their consent. \n\nI'm leaning towards Y T A. Not every mundane part of your day needs to be captured by your phone's camera.", "YTA for taking pictures of people and sending it to people. Sure you have every right to do it but it doesn’t make it any less weird.", "YTA.  That entire conversation could have taken place without taking pictures of the people in the pool.  DOUBLY TRUE when there are children in those pictures.", "Yta - don't take pics of other people and their kids and send them to other people. Duh.", "YTA - don’t take pics of other ppl’s families .. and don’t be passive aggressive.. just got out next time and tell them they’re trespassing", "YTA: you are lucky you live where you live, many European countries that is a massive fine", "YTA\n\nJust get off of Snapchat and live your life without everyone being in your business.", "If you are in the US, you shouldn't have even answered the door, let alone voluntarily show the cop pics on your phone. Police are always investigating and the cop was \"cool\" because you presented all the potentially incriminating evidence. Even if you did nothing wrong, the cops are not your friends,", "YTA. Taking photos of children in a pool? You’re lucky you only got the police called", "If I'm reading it right, he was inside his apartment when taking the pictures.  I can understand the parents concern because that does come across as creepy to me.", "NTA\n\n>  They should have used their brains and realized that taking pictures of the pool was unrelated to taking pictures of their kids. \n\nI'm not sure how they were supposed to realize that to be honest.  Of course, if you go to a place to use the pool where you're not supposed to you're an asshole to start with so hard to expect any common sense from them.", "Where?", "Name one. Taking a photo in public that happens to contain children? Good luck not being laughed out of the court/police station/lawyers office or wherever else you tried to take this.", "You say that, yet you are here on Reddit, in this sub... Social media and being up in OP's business...", "Spain \n\nThe Spanish constitution, Section 18 reads as:\n\nThe right to honour, to personal and family privacy and to the own image is guaranteed.\n\nIf the person can be recognized you need their permission and if children appear their faces must be blurred unless they (parents) sign a waiver. There are only a few exceptions to the law (reporting something important for the news, major sports events, fiestas and concerts where you know there will be cameras so implicit consent etc). But there have already been lawsuits from people who didn’t consent  and all of them have been won unless it’s one of the exceptions. A teacher in my former school got in a lot of trouble because she forgot to blur the faces of the kids without a waiver signed and almost lost her job.\nCon\n\nhttps://www.citizensadvice.org.es/faq/posting-photos-facebook-am-i-allowed-to/", "I say that without having to record and validate my entire life for everyone to see.", "France - droit à l'image - image rights. Need permission if people are identifiable.", "Yup! Switzerland has similar rules as well. Seems like some people don’t realize that their laws mean nothing in other countries.", "You're telling me there are no pictures of the stands in French soccer stadiums?", "Crazy I know! \n\nI’m sure Germany is the same or similar, actually, the only counties I could say definitely don’t have some restrictions are the UK and Ireland, there could be others.", "Different expectation of privacy.", "Implicit consent in soccer stadiums, just like concerts, fiestas, and any multitud organized event. But no you can’t take pictures of people for example in a local pool, if you get caught and they can be identified easily then privacy laws kick in  since there is no implicit consent in that place", "Are the people easily identified? Or when taking photographs of stands, does it become a faceless crowd? Is it a considered a public or private place? \n\nDon’t take my word for it - this is the best I could find in English. \n\n[France](https://www.thelocal.fr/20210927/explained-just-how-strict-are-frances-privacy-laws)\n\nA resident pool would be considered a private not public place."]}