{"id": 21074, "submission_id": "14o0gvy", "title": "AITA for saying I'm happy to finally have a daughter?", "selftext": "I always wanted to have a daughter but only ever had 2 sons Jake and Brian.\n\nJake got married about 18 years ago. I never liked his wife and we never got along.\n\nBrian is getting married soon and his fiancèe, Laura is an amazing person. Brian has a daughter Sara, from a previous relationship and Laura treats Sara just like her own daughter. She is also kind and sweet and I think Brian is so lucky to find someone like her.\n\nA few days ago I invited everyone over and we were discussing the wedding and I mentioned how happy I am to finally have a daughter\n\nJake and his wife got mad and called me an asshole for saying that", "created_utc": 1688232029, "permalink": "/r/AmItheAsshole/comments/14o0gvy/aita_for_saying_im_happy_to_finally_have_a/", "score": 46, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be an asshole for saying I'm happy to finally have a daughter because I already have another DIL\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YTA, obviously. What did you think would happen when you publicly announced that your other son and his wife mean nothing to you?", "YTA\n\nYou won’t have a daughter, you will have a DIL. Of which you do in fact already have one. It appears you intended that statement to be a jab at Jake’s wife. I’m sure Laura was not very impressed either.", "Aw man, I was so ready to defend you, this was so wholesome, until I read that you *already have* a daughter (in law)\n\nThis is weird. It's really weird. It's like you took a sweet moment and used it to take a pretty jab at your other son's wife. I'm a petty queen, but I have my limits. \n\nYTA.", ">I mentioned how happy I am to finally have a daughter\n\nOuch. What an insensitive thing to say. You may not like your first DIL but making a public announcement to that effect is very rude. YTA.", "YTA. Keep your comments private. Your DIL knows you don’t like her, but you needn’t make it public. You’ve also  let your future DIL know what a jerk you are.", "Of course YTA. Your new DIL is no more or less your daughter than your first DIL. You're basically saying \"I'm happy to finally have a daughter in law who I like,\" which is an extremely rude thing to say in front of your first DIL!", "YTA. You have diminished position of your other DIL and marriage of your other son. You may not care for Jake’s wife but you are also an A toward Jake", "Seems like u just wanted to throw it in her face. It's not wrong u consider Laura as a daughter as ur relation with ur first DIL isn't great . But to humiliate her publicly saying this isn't cool. What did u think u sounded like? 'i finally have a daughter ' really?  U chose to do it intentionally.\n\n\nYTA", "YTA.  I can understand you feeling more bonded with one DIL over another because they are people that you had no choice in adding to the family. Parents don't get to choose their children's partners. \n\nI can even understand you considering one like a daughter over the other. That's just how you feel you don't connect in the same way .Fair. \n\nHOWEVER, actually saying it out loud, especially in a room with both present and clearly in earshot, even if not part of the conversation is a complete asshole move and would easily come off like as petty shade to anyone who heard it.", "YTA and you lack all sense of tact and kindness.", "YTA , you've publicly shown favoritism towards your second DIL in front of everyone and humiliated Jake & his Wife, so no wonder they're upset.\n\nThis doesn't invalidate the way you feel by any means, but sometimes it pays off to be more diplomatic in Family gatherings.", "YTA. You publicly announced that you favored one daughter in law over the other. While that's something that may naturally happen it's rude, messy, and petty to announce it.", "YTA.  That’s the kind of thing you think and feel, not actually say.", "Yta obviously. In what way would you not be?", "YTA. I can only think how poorly I would think of someone who said this in front of me. I hope all your kids pull back from you.  If I were Laura I would have been so uncomfortable.", "YTA. I would be mortified if I were you and had said that.", "YTA. You need to apologize.", "YTA, are you seriously this obtuse?  When they were in the room? Jesus.", "YTA and with the way you’re arguing with people here is further proof of that.", "YTA", "YTA obviously", "YTA. How did you expect that comment to be well received when your other daughter in law and Jake were around? Like it or not daughter in law is her title.", "YTA. \n\nIt’s one thing to think it. \n\nIt’s a whole other thing to share it out loud with the whole family.", "YTA. No surprise if your son jake and his wife go no contact after that comment. I know I would ask my husband to go no contact or low contact.", "You don't have to think about your other daughter in law as your own daughter. You don't have to love them both the same. You don't have to be close to both. \n\nBut saying that in front of the whole family is premium asshole move. Do you not have any manners ? YTA", "When I was 13, my sister was born. Her and I have different dads. When my step-grandfather held her for the first time, he said, in front of me, “look *step-grandmother’s name*, our first granddaughter.”    \n\nI understood I wasn’t related, but up until that point, I didn’t feel unwanted.    \n\nI always resented him after that and never visited. I didn’t attend his funeral either.", "Ah were I but Laura, who would have met your eyes and with a gentle smile upon my lips would have said” I already have a mother and you are not her”\n\nEdit: YTA", "YTA. Regardless of your relationship with Jake's wife, she is still your daughter-in-law and part of your family enough to be present at this gathering. It was mean to say something like that in front of her. You could have a rocky relationship with family members while still accepting them as family. You could have instead just said that you are happy that Laura is joining the family.", "YTA. If you’re this insensitive it’s probably best you didn’t have a daughter. I hope the boys take after their mom.", "yta - the op was being petty and rude and lacks over all class.  like it or not she is who your son chose.", "YTA.", "YTA. Did your first DIL piss in your cornflakes or something? Please share specifics on why you hate her so much. Not just character traits you claim about her, but actual specifics on why you feel the way you do.", "YTA. You can think those things in your head and feel them in your heart but never actually say it out loud.", "Info: Do you like Jake? Because your AH behavior could result in sourness between you two.", "You've already had a DIL since Jake got married 18 years ago. And your DIL was present when you said this...\n\nAlso, If Brian has a daughter, you've had a DIL from Brian's former relation as well.\n\nYTA", "Info: I think more context is needed. You mentioned in another comment that your DIL is racist and this is one of the reasons you don’t like her. In this case I’d tend to pick your side so, so far for me NTA. You should edit your original post and add the bad stuff about DIL. Honestly in some cases, hate is justified. And her being racist, in my point of view, justify your actions and i don’t judge you at all.", "YTA\n\nJakes wife is your dauther in law either you like it or not.", "YTA. \n\nAnd if you’re so certain that you’re right and refuse to consider any feedback you’re getting here, then why did you post?", "YTA. How long do you think it'll take to find the son and DIL story on r/JUSTNOMIL telling how OP has been a massive arsehole for years.", "[deleted]", "unpopular opinion but ESH if Jake's wife wanted to be considered a daughter to you she should have made more of an effort to be involved and play nice with the family... You however shouldn't have announced you don't view her as a daughter that was embarrassing for Jake's wife.", "ESH. It sounds like you were being intentionally mean to Jake’s wife, however, given that you never liked Jake’s wife and apparently don’t get along, they are calling you out. It sounds like this battle has been ongoing.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI always wanted to have a daughter but only ever had 2 sons Jake and Brian.\n\nJake got married about 18 years ago. I never liked his wife and we never got along.\n\nBrian is getting married soon and his fiancèe, Laura is an amazing person. Brian has a daughter Sara, from a previous relationship and Laura treats Sara just like her own daughter. She is also kind and sweet and I think Brian is so lucky to find someone like her.\n\nA few days ago I invited everyone over and we were discussing the wedding and I mentioned how happy I am to finally have a daughter\n\nJake and his wife got mad and called me an asshole for saying that\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA. You don't get to decide on who Jake and Brian can get married to. You just ruined your relationship with Jake for good because of what you said about having a daughter in Brian's fiancee, but not Jake's wife. If I was Jake, I would cut contact with you because you disrespected Jake's wife.", "Soft YTA since you don’t like the first daughter in law you don’t think of her as a daughter. Your son and his wife need to suck it up and act like adults. I’m sure she knows you don’t like her. You spoke out of turn and just should have said so and apologized. At this point all you can do is say your sorry and move on but understand that may never be enough for them.", "How would you feel if everyone was gathered around and your son stood up and made an announcement to his mil I am so happy I finally got the mother I always wanted? \nYTA", "YTA - I get not liking your first DiL, but this is really just rubbing her face in it.", "YTA and the reason MIL's get a bad reputation. We'll probably see a post from Jake's wife saying what an AH you are.", "INFO: is this the hill you want to die on with your relationship with your son? You know that what you said was basically erasure of your current DIL. Own it, and either apologize to them for it, or be willing to accept that this may have permanently damaged your relationship with Jake. You can’t have it both ways.", "YTA and you know it.", "YTA", "YTA\n\nAt best careless and at worth deliberately scoring points against your other DIL.", "YTA. And you know it, which is why you are trying so hard to defend yourself. You don't like your son and you don't like you daughter-in-law, and saying that in front of them is top notch assholery.", "No way this is real. Yes, YTA. What a nightmare person, I hope the new DIL starts talking to the other DIL so she’s knows what kind of nightmare you are and can steer clear.", "YTA. Why would you say that in front of everyone? Are you just tone deaf, or are you passive aggressive?", "YTA that was a comment you could have made about a first granddaughter \"it's so nice to have a daughter in the family\". Not the second woman to become your daughter in law, whilst your first daughter in law was around.", "YTA and reading some of your comments you come across as mean, manipulative and down right not a nice person.\nYou definitely know you're an AH but want to try and justify it all by spouting rubbish.", "Maybe, but at least she's honest lol", "YTA You obviously meant it as a dig to your other daughter-in-law.  Otherwise you could have said something like” I am so happy to welcome a new daughter into the family” Same meaning to you without dissing your other son’s wife.  You don’t have to like her or think of her as family to not be rude", "He doesn’t care. If they go no contact with him and his wife i.e. his mother and father neither one would care also.\n\nI think they should just get out of that situation it sounds toxic no wonder daughter-in-law doesn’t like you I don’t like you", "Idk guys, I imagine myself being the unfavoured DIL, and if op said “aww daughter yay”, I’d say smth like “yeah okay that’s cute” if I’m being civil or “aha pass the salt pls” if I’m being cold. If they don’t get along, then op has no reason to try and pretend their relationship is somewhat better. And it doesn’t matter to the first DIL. She doesn’t like the op and doesn’t care. \n\nAlso it’s kinda wrong of Jake to get mad at EMOTIONS. Op feels good around the second DIL and doesn’t feel good around the first one. You can’t go ahead and tell him “hey mate that’s wrong, you gotta start feeling warm toward Edna as well because you know fairness”. NTA as your intention was not to put the first DIL down but to welcome the second one.", "That's not what I said", "The statement had nothing to do with DIL and Laura is very happy that we have accepted her in our family. She doesn't have a family of her own so she sees us as her parents too", "I was also completely misreading this, I thought the first daughter was going to be Sara, and this was an \"adult children aren't really the same as children children\" thing, where like... poor wording, probably even apology worthy, but once understood it's not too bad.\n\n\"[By the way, I quietly disown you as a member of my family, now that the upgrade is here]\" is... I can't express how absolutely YTA this is.", "I wasn't tryin't to offend DIL I was mostly talking to Laura. DIL wasn't even a part of the conversation", "Well neither of them are actually my daughter so it's mostly a choice to see them as my daughter and I can't see someone that I don't like as my daughter", "I'm really sorry that happened to you. So thoughtless, almost to the point of abject cruelty. My sister-in-law experienced something similar,  but she was rejected by the grandmother because she was adopted. That story was enough to keep her away from getting to know my kids, it also helped that grandmother lived really far away. I am not relaying this story to take away the focus from your experience, but to say that I understand the lifelong impact a throwaway comment can make.", "Yeah she is my DIL. Not my daughter. Glad to see we agree", "He's FIL tho", "Did you miss the fact that OP is saying she counts the new DIL as a daughter but not the one who's been in the family for nearly 2 decades?", "Jake has been married for 18 years. Op didn’t say that when they got married. Just about her future DIL.", "I think you may have misunderstood what has happened here.", ">but Jake and fiancée\n\nWife of 18 years. \n\n\"Finally\" got a daughter. You seem to be missing the AH for the trees.", "How do Jake and his wife suck for calling him out for being INTENTIONALLY mean?", "She insulted her daughter in law to her face and when they called OP out on that, they’re assholes too? Bull.\n\nOP YTA.", "Enlighten us, then—how is saying you “finally” have a daughter when you’ve had a daughter in law for 18 years NOT publicly announcing that your other daughter in law means nothing to you?\n\nBig time YTA.", "If the new lady is the daughter you finally had, it means your current DIL never was your daughter. YTA", "✨ *s u b t e x t* ✨", "Go ahead and paraphrase what you said, because you literally said the other DIL doesn't exist.", "That's exactly what you said. YTA.", "OP, it's fine to feel that way, it's fine to tell the new girl privately that she's like a daughter to you.  What's not fine is announcing it in front of a group of people that included your other son and his wife of 18 years\n\nYTA\n\nShe may be racist, manipulative and unpleasant to be around, but even she has feelings.", "But it kind of is.  If you had said it privately to Laura and maybe Brian, it would a little less aholeish but you didn’t. You did it in front of everyone. The only purpose was to call out how much you dislike Jake’s wife. Sorry. But YTA. Find your filter and use it.", "close enough.", "Would you appreciate it if Jake’s wife said “finally there will be one woman in this family that I will actually like”", "> wasn't tryin't to offend DIL \n\nBullshit.", "You said you invited everyone over. \n\nHere's the thing, assuming you didn't intend hurt by your comment, you did hurt with your comment. Does that make sense? \n\nYou owe them an apology. It was still meant to be exclusionary. Anyone in your family would know you \"finally having a daughter\" means you never considered your first DIL a daughter. So the moment you said it, it translated as \"I never considered *her* my daughter.\"\n\nDoes that make sense to you? \n\nEdit: sorry, I typed it twice but accident", "But you didn't even have the common decency not to say it RIGHT IN FRONT OF HER. \n\nSeriously, how can you even think you're not a giant AH?", "And your choice to voice it makes you an asshole.", "And had you said, \"I'm so happy you're joining the family, \" you'd be fine. Instead you made it clear you don't like your DIL. And worse, you did it while she was present. Of course YTA. I hope you don't like Jake either, because you just damaged that pretty badly.", "You are correct. Our feelings are what they are. But you don’t have to announce it to the world. It was unnecessary and hurtful.", "Why post here if you don’t want to accept what people are saying", "And so is the other one. \n\nYOU HAVE NO DAUGHTERS!", "Ok… but doesn’t that make Laura your DIL too…", "Ok  r/JUSTNOFIL", "Yeah she wasn't. She doesn't become my daughter just by marrying my son", "She is just my DIL not my daughter. Laura is like a daughter to me", "I'm not sure but I'm guessing my wife would be upset", "Yeah, my doubt isn't up to date on its benefits 😅", "I never considered her my daughter and she already knew it. We don't even like each other why would she be like a daughter to me?", "I think there's a pretty good chance Jake doesn't really like OP and we can see why.", "But that's what happened with this one. She's suddenly your daughter because she married your son. She wasn't your daughter before they married. Now they signed papers she's suddenly your daughter. Yet the other ones been married and she's not seen as a daughter. That's hypocritical as heck.", "That's kind of literally what it means. By definition she became your daughter in law. So by saying you finally have a daughter, you've made it incredibly clear how you feel.", "You are clueless if you cannot figure out why that is a rude statement to say infront of someone.", "Express your feelings in private, not in front of other people. Not everyone needs to know how much you dislike your DIL", "\"Finally, there's SOMEONE in this family that I actually like\". How about that instead?", "Lol .... okay. You’re Dad.... Be better Dad. \n\nI’m not certain what your goal is here. Do you want to know if it’s okay to act like an ass in front of your son & his wife? Jake thinks you’re an ah so maybe you should be talking to your son about this & not asking strangers. What are you going to do if Laura gets along with Jake’s wife? Just keep making more passive-aggressive statements. Are your DIL’s suppose to compete for your affection now? You may to want to reign your attitude in a little before you lose both sons & DILs. I don’t think you realize how unkind & rude your statement was. Laura just found out her future FIL is not always a very nice guy. \n\nIf my husband said that to our son’s fiancée in front of our other son & his wife... I would think he’s an ah too.", "I have three girls. One of them is bound to marry a guy I can't stand. But he will still be my son. \n\nYou don't have to like someone to accept them as part of the family. As the parent in this situation, you should  be the bigger person. Why is that hard for you to understand?", "What you said was mean. Regardless of her character…you were being petty. It’s not a good look.\n\nYTA. Grow up! You are deliberately trying to cause drama.", "No she is my daughter because she is a wonderful person. She would still be my daughter if she wasn't going to marry my son", "I'd say good for her I don't like her either so why would I care?", "And any grandkids will almost certainly side with their mum. YTA.", "Right, you basically announced that your other DIL is NOT a wonderful person. Y are SUCH TA.", "One bullshit. Because chances are she wouldn't stay in y'all's lives unless y'all had some super enmeshed relationship.\n\nTwo. Y'all could have EASILY had a private little moment AWAY from everyone else. You had this conversation in public so everyone is a part of the conversation even if they are contributing to it.  It wasn't a private thing away from everyone it was right in their faces.\n\nSo knowing this you made it a huge thing by making sure she was included since again public conversation.\n\nAnd considering you didn't explain WHY she was such a bad DIL in the initial post, your added information is going to look suspicious and like you are back paddling in an attempt to pain yourself in a better light vs her. Her behavior is an actual relevant piece of advice. \n\nGranted your still YTA for doing such a display in a public situation knowing it was going to go over like a lead balloon in water. Aka a huge splash of drama-aid", "lol, that's not how that works.", "So the goal is to turn family against family. Not a great goal, Dad.", "You cared enough to post on Reddit and ask a bunch of strangers.", "No she is not. She is racist and manipulative and arrogant. I'm sorry I don't find her wonderful", "That's not the reason people are calling you T A. We're saying it because you made a big show of it in front of her.\n\n&#x200B;\n\nYou don't have to find her wonderful or even mediocre. You are absolutely within your rights to favor your new DIL.\n\n&#x200B;\n\nBut you didn't need to make the grand announcement purposefully snubbing the other one.", "If she is really so racist and awful then cut ties and don't have dinner with her/them.. ? Also include context like that in the post itself instead of saving it like ammo for commenters when they disagree with you.", "Yes but some things you just think. It’s not thinking it that makes you an ass hole. It’s saying it….."]}