{"id": 21080, "submission_id": "14o3jf3", "title": "AITA for attending my parents 35th wedding anniversary dinner delaying our date by a day?", "selftext": "Gf[24F]and I[24M] live in different cities but see each other every weekend. I was supposed to come up Saturday and cook her dinner and watch a movie. I had asked my parents to watch my dog which my dad responded “I hope you both will be there for our anniversary!” I completely forgot it was my parents anniversary which we celebrate yearly. I called my Gf and told her I would still be coming up but it would be Saturday night and not midday as planned. She responded very dismissive and questioned why I would want to celebrate an anniversary with my parents as “it’s weird” and “I’ve never heard of anyone celebrating their parent’s anniversary with them”. I’ll most likely be moving later this year and want to be there with my parents for these types of things, especially while it’s easy. I feel bad postponing our date as the distance does make things hard sometimes. Her reaction to my oversight is giving me anxiety as I know now when I go we will fight about it. AITA?\n\nTLDR: I postponed a date with my gf to celebrate my parents anniversary and she is upset about my decision. AITA?", "created_utc": 1688239996, "permalink": "/r/AmItheAsshole/comments/14o3jf3/aita_for_attending_my_parents_35th_wedding/", "score": 43, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I postponed our date night to spend time with my parents for their anniversary. My Gf is a planner and I know she hates when I have to rearrange our schedule, especially last minute. I’m much more flexible when it comes to plans and this is a frequent issue within our relationship.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Info: Why didn't you ask your gf to come and celebrate with you and your parents? Your dad had invited both of you after all.", "NTA you legitimately forgot and it's a family event you normally attend. She needs to understand that instead of trying to belittle you (read manipulate) for taking part in something you normally do with your family. Everyone's family dynamic is different you either respect what people do and let them enjoy it or take a walk.", "NTA, but I can understand why she's upset about a last-minute change.   Some people think an anniversary is just about the couple.  It always irked my MIL that her husband's mother sent her a card on their wedding anniversary and expected the same on their own anniversary.   It's just a difference between families.   Personally, I prefer most anniversaries to be just hubby and I, but I think milestone anniversaries can include other people, especially any children created from that union.   Why didn't you invite her to the anniversary dinner as your dad suggested?", "NTA It’s not weird to celebrate your parents anniversary at all, it’s more weird that your gf would think that way. Are her parents divorced/ not together or unhappy? It also sounded like your parents wanted her there, did you mention that to her?", "NTA and why be with someone who's behavior spikes your anxiety and is condescending. This is not loving. \n\nFamilies differ in what they celebrate. Instead of her being open she insults what your family values and how it is celebrated. \n\nYou made a mistake re: the anniversary; something you want to attend. You adjusting time together may disappoint her but we all make mistakes. Best to you.", "NTA. It sounds like you and gf might have different values. This is a big anniversary. Of course, you should be there. \n\nAre you chronically late or changing plans??? If not, then I am notngetting her upset.", "NTA.  This feels like a red flag, TBH.  Unless you're a chronic canceller or always changing plans last minute, then she's being selfish and immature.", "NTA\n\nIt's not weird.  And even if it was, who cares.  \n\nDating and having to give up every single weekend is crazy hard.  Missing one day is no big deal.  \n\nPart of being in a relationship is learning to respect the things your partner is really into even if it makes little sense to you.   I feel like she's being awfully dismissive.  \n\nPlus, ummm, she's never heard of an anniversary party?  Never seen one on TV?", "NTA. It seems pretty normal to me to celebrate with them. Either way, it’s normal for your family and it’s a bigger day. Postponing it shouldn’t be that big of a deal.", "NTA.\n\nPeople celebrate anniversaries, especially milestone ones all the time with their families.\n\nIs there something going on that you're not reporting?  Have you done this frequently?  Because I'm getting a seriously \"Main Character Personality\" vibe from your GF.", "NTA. Being a good person requires flexibility", "YTA. Learn to use a calendar.", "Nta. Dump this girl.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nGf[24F]and I[24M] live in different cities but see each other every weekend. I was supposed to come up Saturday and cook her dinner and watch a movie. I had asked my parents to watch my dog which my dad responded “I hope you both will be there for our anniversary!” I completely forgot it was my parents anniversary which we celebrate yearly. I called my Gf and told her I would still be coming up but it would be Saturday night and not midday as planned. She responded very dismissive and questioned why I would want to celebrate an anniversary with my parents as “it’s weird” and “I’ve never heard of anyone celebrating their parent’s anniversary with them”. I’ll most likely be moving later this year and want to be there with my parents for these types of things, especially while it’s easy. I feel bad postponing our date as the distance does make things hard sometimes. Her reaction to my oversight is giving me anxiety as I know now when I go we will fight about it. AITA?\n\nTLDR: I postponed a date with my gf to celebrate my parents anniversary and she is upset about my decision. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NAH. You have every right to feel the need to prioritize your parents anniversary if you feel it is important to attend. However your gf has every right to feel slighted by your decision and to be disappointed in your choice. People have different habits and views when it comes to their families of origin (FOO). One thing that might be a good idea is for you and her to have a serious discussion at some point about what your expectations of commitment to ones FOO particularly where it might impact her expectations of you as a partner. Best to sort these things out early, rather than later.", "NTA. Slightly your fault for forgetting but this is a red flag.", "He was referring to my dog and I. I don’t believe she’d make the drive atm.", "I should clarify they meant the dog and I. Yes her parents are divorced. My parents are also going through a bit of a rough patch so I think that may also add to her reaction", "I rarely cancel plans but I am late to things often. It’s about a two hour drive to visit each-other and I’ll say I’m gonna leave at 3 and I end up leaving at 4 which puts me in rush hour which adds and hour or so.  This is a common area of conflict between us. Not just driving but stuff like this happens more often than I’d like to admit", "NTA. Coming here to say this. Complete red flag. Find a local girlfriend.", "I do have a problem with dates and time management. Personally I think my time management is my biggest personal problem but it has gotten better especially since the two of us started dating. We are still leagues apart on that aspect though."]}