{"id": 21089, "submission_id": "14ny8mp", "title": "AITA for bringing up that friend I hit on before had a revealing dress in front of a new date?", "selftext": "So we were hanging out with a girl I have been dating for two months and things are going pretty well, let's call her Linda. At the gathering, another girl that I used to like (let's call her Carole) and had asked on a date was also there and wearing a pretty fancy (in the context of the hangout) and revealing dress. Have in mind that this was a very casual board game gathering. Also, I had been totally honest with Linda about asking Carole out a long time ago and that everything was platonic between us now. Later when we were alone, I mentioned that I thought it was a bit weird that she was wearing such a revealing dress at a very casual board game event, to which Linda got annoyed and said I am a pervert for thinking like that or even noticing that the dress was revealing.\n\nAITA in this situation? Was my surprise from the dress and noticing it inappropriate? Or is Linda being too sensitive and judgemental?", "created_utc": 1688226278, "permalink": "/r/AmItheAsshole/comments/14ny8mp/aita_for_bringing_up_that_friend_i_hit_on_before/", "score": 99, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) Noticing the revealing dress on an ex-crush and mentioning it to my date?\n2) It might indicate that I am shallow or still interested in the former crush. Or it might indicate that I am perverted.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YTA.  There is no reason to be commenting on what someone else is doing if it's not disrupting anyone.", "YTA It was not particularly inappropriate but very unnecessary and a bit clueless to discuss the dress of the girl you used to like with your girlfriend. Can’t you truly not grasp that? Why do you refer to your girlfriend as Linda rather than your girlfriend?", "YTA\n\nIt's just not the kind of thing that you are meant to comment on", "A) making judgments about one's attire (YTA)\n\nB) still thinking about Carole in her revealing clothing after the party but still dating Linda (YTA)\n\nC) Thinking about Carole after the party while still dating Linda and putting that in Linda's head (YT trifecta A)", "Don’t talk or criticize any other person while on a ‘date’ you are supposed to only have eyes for your gf or your Linda. Examples: You looked wonderful tonight. I was so happy to with you tonight. \nWhy were you even bothered by anyone else in that way?? Enough to mention it?", "[removed]", "YTA. You aren’t the fashion police. Women are constantly told how to dress and look which isn’t appropriate. A person, male or female, can dress however they feel comfortable and confident. I would dump you because you feel the need to police women’s attire, not because of any type of jealousy or insecurities.", "YTA\nAND a weirdo. She can wear whatever she want. Why would you even bring that up", "Yta - why would you tell Linda that? What did you hope to gain?", "YTA. Keep your comments about other people to yourself. Why would you talk about another woman (especially about what they’re wearing) to the person you are seeing?? That just make you seem like you so stuck on the other woman.", "YTA.\n\nGonna go out on a limb here and predict Carole did not choose her wardrobe hoping to get a judgmental response from a platonic friend.", "Some things are better left unsaid, especially if they are unkind. YTA", "Mind your own business asshole", "NAH but it wasn’t a good idea to say to your girlfriend “Hey did you notice that girl’s tits tonight?” Come on dude, that was dumb.", "YTA\n\n&#x200B;\n\nSo you are not over Carole, and se still is in your mind a lot.", "YTA for bringing it up to your girlfriend. Obviously people are going to notice if somebody's in a revealing dress (and it's particularly weird in this situation) but your girlfriend probably doesn't want to hear about it", "So maybe I am also an AH because my husband is my favourite person to gossip with. We leave gatherings all the time & immediately catch each other up on things that have been told to us and we share our opinions about EVERYTHING with each other. From food that was there, to “he said, she said” situations we witnessed or heard of, to questionable parenting, etc. (I know people are going to come at me for being judgemental, but honestly, everyone is judgemental to a degree & just because you don’t vocalize your judgements doesn’t mean you are morally better than other people) so I cant technically say YTA for commenting on what someone was wearing because it’s very likely something myself or my husband would do.\n\nTHAT BEING SAID!!! She was clearly upset about you making that comment. Doubling down & saying she’s sensitive & judgemental would make YTA because you would be minimizing & blowing off her feelings. Maybe she genuinely isn’t the kind of person who wants to comment on thing people are wearing. Maybe it made her feel insecure, especially given you guys haven’t established a relationship. Maybe she was overstimulated after being in a social situation. You won’t know until you have a conversation so I would talk to her & ask why it was so upsetting to her & hear her out when she responds. That way you can change course in the future or try to find a solution.", "YTA. What are you the game night police lol. What do you care if it’s a bit much and what did you expect the response here would be.", "[removed]", "YTA.\n\nCan you explain to us what everyone else at the gathering was wearing? What was Linda wearing? Or are you only focused on the one that got away? That's probably what Linda thinks.", "Word to the wise:  You don’t have to verbalize every single thing that crosses your mind.  This is the perfect way to be disrespectful to both your girlfriend and the other girl at the same time.  Don’t be an idiot again.\n\nYTA", "Yta.\n\nWhy would you tell your girlfriend that a girl you used to like is wearing a revealing dress? What did you hope to achieve by this?\nYou basically admitted that you were looking at a woman in a revealing dress. That probably isn't going to make your girlfriend feel great, and maybe she is concerned you still like chloe. Why else would her dress bother you so much you had to mention it rather than keep that fact to yourself.\nYou should be focusing on your girlfriend. If you were really in to your girlfriend you wouldn't even be thinking about chloe and her dress.", "YTA i cant see how you dont know what you just did!! \n\nBesides who are to police what ppl wear? I WFH so i get  to be comfortable in my wardrobe. I dnt like make up, love messy buns and joggers and over sized t shirts. But some days i just want to feel really good about myself and love my reflection. So i put make up on, style my hair, wear something that makes me feel amazing and i did it all for me. I do the school run looking like ive been at a wedding or going on a night out.", "NTA but you're inexperienced for sure.\n\nNever talk about another woman with your date unless it's necessary.", "NTA but there are times to keep your thoughts to yourself. This was one of those times.", "i don't really see the problem so NTA in my opinion\n\ni think it was not a public judging but a comment so make in private - maybe not the nicest thing to say but i think it was just misinterpreted", "Unpopular opinion here, but I’m leaning towards NTA…\n\nMy bf is the person I love gossiping to the most! He is my most trusted confidant. Granted, we’ve been together many years. In this case…. Your comment was probably insensitive given the context. I hope you apologized.", "NTA. How could anyone not notice?", "Meh. Sounds like a NAH. You should learn not to comment on other women's bodies in front of your girlfriend, but I do think some people just pay attention to different things and I've heard that it's hard for those attracted to women to completely blank other women out even if they're in a committed relationship.\n\nIt sounds like what she wore was unusual. If she was wearing a charizard onesie it would have been weirder to NOT say anything.", "ESH - and Im referring to this thread", "Yta", "NTA. You weren’t shaming her for her choice, just making a comment on how it was an odd choice for the occasion. It’s like a dude showing up in a three piece suit to the Honkytonk. It’s fine to do so, it’s just odd and will get a few comments.", "NTA. Look you’re not blind, you happened to notice that Carol was over dressed for the occasion and you mentioned that casually to your girlfriend. Did you have to bring it up? No. But you did and that’s ok. There is nothing weird or perverted about making that observation. Linda’s reaction makes me think that she might be feeling a bit insecure.", "NTA, Linda was being a little too judgemental, but it was probably the wrong choice to bring it up.", "NTA  But as a general rule of thumb don't make comments about other women's appearances in front of her. If she wants to make catty comments, feel free to join her then.", "NAH. Linda knows you had a thing for Carole and got a little insecure seeing her in the fancy dress. She got even more when you made your comment. If I had to pick an AH in the scenario I would choose Carole, although she may have just felt like dressing up or been misinformed about the type of party it was. Everything is within the realm of reason, so no real AH's here. Hopefully everyone can work through this and life can move on.", "NTA - reverse genders and realize why it’s attention seeking and borderline psycho to show up to board game night in a suit", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSo we were hanging out with a girl I have been dating for two months and things are going pretty well, lets call her L. At the gathering, another girl that I used to like (let's call her C) and had asked on a date was also there and wearing a pretty fancy (in the context of the hangout) and revealing dress. Have in mind that this was a very casual board game gathering. Also, I had been totally honest with L about asking C out a long time ago and that everything was platonic between us now.  \nLater when we were alone, I mentioned that I thought it was a bit weird that she was wearing such a revealing dress at a very casual board game event, to which L got annoyed and said I am a pervert for thinking like that or even noticing that the dress was revealing.  \n\n\nAITA in this situation? Was my surprise from the dress and noticing it inappropriate? Or is L being too sensitive and judgemental?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Well, yes, YTA...first it's not your business what any woman wears at any time. EVER. That includes a woman you are dating, except to say...\"wow, you look really good.\" \"I am so lucky to be your boyfriend\"...\"husband\" whatever...finding someone to marry you will be a challenge, since you have a social grace of a toddler. We don't know why this woman wore this outfit. Was she planning on going out after? Was it her favorite \"lucky boardgame\" dress? Was she wanting to be sure perverts noticed her? We will never know. And it's not our business. But, as an old woman, I can assure you there is nothing wrong with the woman you are dating except her taste in men.", "YTA. There’s no reason to have said that in any context, let alone this one", "YTA. You should NOT have said anything to Linda about Carole. NOTHING. You also shouldn't comment on a woman's dress unless you're saying it is pretty. Slut shaming is not allowed. Maybe nobody told Carole what the dress code was. Maybe she'd come from another event, or was going somewhere else after the gathering, or doing laundry and her jeans were wet, maybe she just wanted to wear that dress because she likes it a lot.  It doesn't matter why she wore it - it does matter that you were obsessed with it and just had to mention it to your date. Awwww man, you put your foot in it. There is nothing you can do not to repair the damage - just don't do it again.", "YTA", "YTA- A. It's none of your business what she wears. B. No girl you're dating is ever going to appreciate you pointing out another girls outfit, you're just showing her that you're paying attention to someone else.", "Just be more sensitive to your gf feelings next time.", "You are an oddball. Girl you are with is happy to be with you and you are clearly obsessed with a girl who doesn’t like you.", "Thanks for the comment.  \nShe's not really my gf, we've talked about these stuff a bit but haven't had the \"talk\" yet", "It’s the kind of thing u comment on when ur a sexist asshole", "*chef's kiss* yta op", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "I think u are a little harsh here and guessing by ur response u r single. Because no self respecting man would ever want to b with someone who doesn’t understand that men have feelings. Was it wrong for him to comment yes but to carry on how u did is the AH move. And yes as the father of a girl I judge outfits on her and tell her if I think they r too revealing. That don’t make me misogynistic. His comment I feel was more on the she is awfully dressed up for board games. Did u ever consider his gf accuses him of looking at women and he was telling her his thought before she laid into him? Let’s not forget woman will dress for attention of certain people. Is it also possible she was trying to get the attention of OP because she is interested in something more than platonic? Of course not because ur immediate response is misogyny.", "Thanks for the comment!  \nI think I should add that it really wasn't about them being a girl but more about being overdressed for an occasion. For example, I would have mentioned the exact same thing if a guy had come with a formal suit or tuxedo.   \nThat was the point.", "He didn’t do any policing, just commented", "He didn’t say she couldn’t wear whatever she wanted, just that it was an odd choice.", "What was unkind? That was a stupid comment, but also a mistake", "Dumb, but not an ah", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Yes, actually I did notice them too. For example, another friend was wearing a semi-formal jacket while wearing a very chill cap so that contradiction caught my eye too.", "He's judging someone on their clothes.... He's the ass!\n\nOP YTA", "Why does it matter WHAT she was wearing\n\n\nOP YTA", "Calling the dress ‘revealing’ was definitely meant to shame her.", "This sub can hate truth.", "None of his business....\n\n\nOP YTA", "It's NONE of his business.....\n\n\nOP YTA", "I don’t think Linda is insecure. He is looking like he is still stuck on Carol. Why would you even say something about that to a woman you are seeing. YTA", "It is psycho to show up to a boardgame night in a suit??? Wow...", "You're well on your way to having the other talk with her.", "She’s not going to be now you’ve shown your misoginistic tendencies", ">>she’s not really my gf\n\nHmmm, wonder why? lol", "Everything you’re rattling off here is misogynistic.", "You weren’t telling Linda about it because it was too formal. You told Linda that it was too revealing. “I mentioned that I thought it was a bit weird that she was wearing such a revealing dress at a very casual board game event”", ">it really wasn't about them being a girl but more about being overdressed for an occasion.\n\nBased on the way you describe it and the language you used in your post, that is just not true. Your focus is on how revealing the dress was. You only mention the formality of dress in passing.", "No it wasn't. We have the point. If it was about her being overdressed for the occasion, you simply would have commented that she was overdressed for the occasion. Instead you had to comment on the cut of the dress and the fact that in your opinion it was too revealing. The two are totally different and completely steeped in misogyny", "Maybe she was dressing up for someone else at the event that she was hoping to get the attention of. Or maybe she just felt pretty that day", "When did I say he did ? I stated she can wear whatever she wants. It’s weird for him to comment that", "Because if I showed up in a full suit to board game night my friends would be like “lol wtf??”\n\nSensitive asses and terminally online don’t realize when they’re autistic in public", "Saying something is revealing isn’t necessarily shaming though? It’s a description of an outfit. If he had said it was “too revealing”, sure.", "[removed]", "I was just about to say, going for a Speedrun of relationships here. Over before it started 👍", "U attack a man’s penis size. Everything to you except a man bowing to your every order is misogyny. U have no ability to rationalize anything or to even stop a second and asses the situation. It’s just small penis misogynistic AH’s always wrong and at fault. Ur direct solution was to belittle and name call. And everything I said apparently is also misogyny even though I never defended OP, I simply gave u another angle to look at it. Simply put, I do not believe in legislating a human body, nor don’t not believe anyone has a say over what anyone wears, I do not believe men are superior to women. But since u feel this man has no right to comment to his GF about a mutual friend’s attire simply because he is a man, u have no right to comment on his penis. U can’t have it both ways.", "Ok fair enough, I guess I'll be more careful about how to mention it. But the thought process really was what I mentioned.", "It’s entirely possible. As long as he wasn’t saying it in a negative light, I don’t see an issue with the comment. I’m not in his friend group though, so maybe they’re a different breed than the people I associate with and take offense to things I wouldn’t even remember.", "So you can’t comment on these things ever? What if someone showed up to game night wearing a swimsuit? You could make a comment about that without it being rude, even though it’s technically none of your business.", "People make observations. People say those observations to people they’re with. People watching is a pretty common occurrence.", "Your friends sound lame.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "f\n\nEdit: lower case f, damn reddit", "I never mentioned your dick size, ma’am. You’re feeling some kind of way about it.", "No it isn't because the male equivalent would be you commenting on someone wearing a tuxedo but also that the tailoring that helped emphasize how big his package was and how bigly and manly his muscles look under that shirt and why would he wear something so revealing of his body shape too ? If it was just about the formality your comment and thought process would've been more like oh she looks like she's going to a wedding or formal party didn't that feel at odds with the vibe and dress everyone else had ? Not wow so formal so revealing look at her just putting all that out there so inappropriate for the occasion", "No it wasn’t. Otherwise you wouldn’t have said anything about it being revealing at all. Your actions speak louder", "Why need to mention it at all? Some people like to get dressed up. Maybe she was going out afterwards. In the nicest way possible, it's none of your business what someone is wearing.", "You don't need to mention it in the first place", "People are just purposefully misunderstanding the situation, there’s nothing wrong with some casual small talk/gossip, and nothing you said was particularly rude or anything, it’s more that people think you should have known what Linda’s reaction would be, which is not fair because her reaction was unreasonable", "Yeah these people are very quick to find offense in harmless comments", "I would probably crack up? But that’s different than talking behind their back", "It’s an opinion sweetie", "Oh okay so if you laugh in their face that’s better than making a comment they couldn’t hear"]}