{"id": 21133, "submission_id": "14oip41", "title": "AITA for not wanting my wife’s dogs move in?", "selftext": "My wife has two dogs that she has had for quite some time. They’re currently at her parents’ where they have been for about 4 years now. My wife adopted them about 6 years ago (before we met), but she was forced to leave them at her parents’ house when she moved to London for work. Then she’s moved back in with her parents twice. She’s been around the dogs most of their lives, I guess. \n\nMy wife and I are now finally moving in together again and I couldn’t have been more excited after a few years being all over the country/away from each other at various intervals for work and school.\n\nI stupidly didn’t think she’d want to bring the dogs considering just how long they’ve been at her parents.\n\nShe’s already agreed to leave the dogs at her family home but AITA for not wanting to live with her dogs? \n\nI am not a pet person. I hate the way the way pet homes smell and I don’t want the commitment. She says she’ll happily clean up after them and take on 100% of the responsibility. It’s not like I doubt her sincerity but that’s bs. I’d feel like an asshole not helping out and the lines would get blurred quickly. Plus, I’ve put a lot of effort into making this a nice home and we’ve got plans for the garden that might not mesh too well with two dogs. \n\nAnd honestly, her dogs are already where they’re loved and wanted.", "created_utc": 1688285301, "permalink": "/r/AmItheAsshole/comments/14oip41/aita_for_not_wanting_my_wifes_dogs_move_in/", "score": 15, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > The wife wants to move in with her dogs she loves and had before we met. I talked her out of it because I don’t want the responsibility and more importantly they’d smell my house up and ruin the dynamic and plans I’ve got. Not sure if I’m being reasonable\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "INFO: Had you discussed this situation prior to getting married?", "YTA for marrying a pet person while disliking pets", "YTA for knowing she had dogs and making assumptions about their long-term living arrangement without a discussion with her.", "YTA\n\nNot wanting a dog in your home is absolutely fine, but you should have brought this up before getting married. Even if the dogs stayed at her parents, what makes you think she wouldn't want other dogs in the future? Ones that would've obviously stayed at your home. You are now forcing her to choose between her marriage and having dogs in her daily life. Maybe she would have been fine with this even if you discussed it before marriage, but you did not give her that choice.", "i wish op had told his wife  earlier that's he'd make her chose between pet and him so that she could have dropped his ass before marriage. huge YTA.\n\npets are like children. husband/wife is just a partner. you dont abandon kids", "For thinking it? NTA\n\nIf you try to stop it? Y T A\n\nYou married this woman, how did you miss that she wants her dogs?", "Nta for thinking it. \n\nYta if you tell her that she can't", "YTA. She needs to find herself a new non-dog hating husband", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy wife has two dogs that she has had for quite some time. They’re currently at her parents’ where they have been for about 4 years now. My wife adopted them about 6 years ago (before we met), but she was forced to leave them at her parents’ house when she moved to London for work. Then she’s moved back in with her parents twice. She’s been around the dogs most of their lives, I guess. \n\nMy wife and I are now finally moving in together again and I couldn’t have been more excited after a few years being all over the country/away from each other at various intervals for work and school.\n\nI stupidly didn’t think she’d want to bring the dogs considering just how long they’ve been at her parents.\n\nShe’s already agreed to leave the dogs at her family home but AITA for not wanting to live with her dogs? \n\nI am not a pet person. I hate the way the way pet homes smell and I don’t want the commitment. She says she’ll happily clean up after them and take on 100% of the responsibility. It’s not like I doubt her sincerity but that’s bs. I’d feel like an asshole not helping out and the lines would get blurred quickly. Plus, I’ve put a lot of effort into making this a nice home and we’ve got plans for the garden that might not mesh too well with two dogs. \n\nAnd honestly, her dogs are already where they’re loved and wanted.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA for not wanting to live with them but you would be TA if you forced it on her without a discussion.", "Nta. Don’t believe her. You’ll have to get involved. \n\nNow there is a chance you’d grow to like them. But that’s much more likely with a new puppy. \n\nPlus taking the dogs from their house is a AH move.", "NTA, pet homes are vile no matter how hard you try and “maintain” it. The hair and smell are beyond fucking disgusting. \n\nIt’s disgusting and fucking a massive asshole move to try and force you to live in a gross home.", "It sucks. When you don’t like pets like me, you easily forget about their existence.", "Right and OP just assumed they would get their own way. Its fine to dislike dogs, but as a pet person I genuinely couldn’t marry someone who didn’t like them. Should’ve discussed it before, considering OP literally knew she had and loved her dogs", "Exactly. At the initial stages of dating, compatibility surrounding marriage, kids, pets and other commitment types should be discussed. If there is an incompatibility, then the relationship should not proceed. Both parties should have shared goals and if not, are not meant to be together. OP should've ended things as soon as OP knew there were animals involved."]}