{"id": 2116, "submission_id": "yt78xs", "title": "WIBTA by outdoing my MIL?", "selftext": "I(28F) have been married to my husband(34M) for 6 years now. And for all of these 6 years we spent Thanksgiving with my in-laws. I don't have a family so that is not the issue.\n\nNow first let me tell you, my in-laws are great, they welcomed me and treat me like a family. My FIL walked me down the isle, my MIL and SIL helped me all throughout the wedding, when I was seriously sick 3 years ago, my MIL took care of me for 4 months straight. I love this family to bits.\n\nThe only issue (if it can even be regarded as such) as that they are all horrible cooks. I, on the other hand, am a great cook (lived with my Grandma all my life, and she taught me to cook since I was 7), and when I cook for them, my MIL gets kind of sad/jealous. Nothing obvious or anything like that, but she just withdraws enough for it to be obvious.\n\nLike I said before, we spend Thanksgiving with his family every year, and every year his mom cooks the dinner. But it's usually (and I am not being rude here, just describing accurately) a dry on the verge of being burnt turkey, kraft mac-n-cheese, box mashed potatoes, cranberry sauce from a can, store bought pumpkin pie and very bland peas. Every year I would be thankful for the dinner, but would cook a proper one the next day for me and my husband. We never tell anyone about it too.\n\nThis year my MIL broke her wrist, so I jumped at the chance of hosting Thanksgiving. So far so good.\n\nBut now I was planning the dinner, and my husband says if I go foreward with what I planned, I would ruin MIL day and be an AH. Here's what I have planned:\n- a turkey (obviously)\n- mashed potatoes (regular and garlic)\n- asparagus\n- green beans casserole\n- homemade stuffing\n- homemade cranberry sauce \n- buttered corn\n- homemade dinner rolls\n- yams\n- homemade pumpkin and cherry pies.\n\nI just want a chance at a Thanksgiving that matches my memories, so WIBTA if I go foreward with it?", "created_utc": 1668260124, "permalink": "/r/AmItheAsshole/comments/yt78xs/wibta_by_outdoing_my_mil/", "score": 1507, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I am hosting Thanksgiving dinner this year because my MIL broke her wrist, I know for a fact that she doesn't like it when I cook better than her, even so I am still planning to make a dinner she can never cook, which will surely make her sad and withdrawn. So AITA?\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "nta. you aren’t doing it to be mean or show her up. \n\nmaybe you both should talk to her before and explain that you and your grandma always cooked together. and what thanksgiving memories mean to you so she understands the sentiment behind it and not view it as a competition.  that you aren’t competing but you want to have the same kid of memories you had growing up with his family \n\nwhat does he want you to do?  make a crap dinner for his family on purpose.", "NTA. Your menu seems very standard. We have every you list except asparagus. Just make sure you don't compare it in any way to MIL. Always express that your cooking \"just like MIL does\". This is \"almost exactly her menu\" you just made a different vegetable or two.", "Why don't you invite MIL over to \"cook\" with you? Obviously she can't do much with a broken wrist, but Thanksgiving is about family, not the food. Just do it together!", "NTA, you aren't an AH for making them a good dinner, and spending a lot of energy and time too. She will be the AH if she ruins the day because of petty jealousy though.", "NTA. I was wondering if you were planning on some ridiculously over the top dinner that took weeks of planning and making with stupidly expensive ingredients. But it's sound like your planning a lovely, (and I don't mean this in a bad way) standard dinner. I dont think that \"cooking well\" counts as outdoing your MIL. What's the alternative? Purposefully burning the turkey?", "NTA.  You are hosting, you menu plan and cook.  A grown woman, which I assume MIL is, just has to be able to handle her jealousy or not attend.", "NTA. What does your husband want you to serve? Fewer dishes and/or burnt/unseasoned food to save his mother’s feelings? It’s time for his mom to grow up. She can go back to serving her Thanksgiving-in-a-box next year when she feels better. You should do the best to give your family a great meal. If she’s upset that her family is eating well for the holiday, that’s an issue she should work on.", "NTA. Can you ask your MIL to come over and help you cook? Nothing to heavy or stressful on her wrist. But stirring, measuring, etc. Tell her they are family recipes from your grandmother. She may like that you are still including her in the preparation.", "NTA but prepare to cook every year after you do it once. Also you could come over and cook me Thanksgiving dinner I end up going to the inlaws and when they cook ham they put pineapple on it. Who does that?", "Clearly NTA, \nwe are all born with different talents. Your MIL doesn't have a knack for cooking, but you do, so they should be happy that the \"family's skill set\" has been expanded by you instead of keeping your own skills under a bushel. MIL should work on her character, which is otherwise absolutely great, except for the jealousy.", "NTA. It’s ridiculous to say you need to change your menu because your MIL is a bad cook. Ignore him and host the Thanksgiving you want. If your MIL is mature and has EQ she should then invite you to help her in future Thanksgivings.", "NTA", "NTA, it's not like you rub it in her face and it is weird of your husband. What does he want you to do? Serve raw turkey and burned potatoes? No, you cook a nice meal. Also, think about it might lead to something positive. Meaning maybe you and MIL can prep the next one together etc.", "So, instead of what you plan on doing, you're expected to prepare a bad meal for the sake of her ego? Here's a better idea, suddenly come down with the flu, let the family go out to a diner for dinner and save yourself a headache , as this is a no win situation. NTA", "Careful, OP. Your meal sounds delicious but it might blow up on you like [the apple pie saga](https://www.reddit.com/r/AmItheAsshole/comments/ykdgjo/aita_for_stealing_my_mils_heirloom_recipe_and/) for this baker whose MIL's feelings were so hurt by his outstanding pie that he got asked to leave.\n\nOTH, MIL's meal sounds so bad that almost anything you cook will outdo her.  Maybe if you consult with MIL and ask her for \"help\" you can bring her around?", "NTA of course!", "NTA: ask husband if he would like to do it instead then.\n\nhonestly at the meal itself I'd word it like \"it's so nice to take the pressure of MIL, she works so hard\" so she can think about how it's a Gift For Her", "So my MIL is a shite cook.  Salt is an exotic spice in her kitchen.  \n\nA couple of years ago my husband and I cooked the Thanksgiving dinner so there was flavor and everyone said everything was delicious.  She was HURT because she never gets compliments on her cooking.  Throughout the last couple of years my husband and I have been working with her saying things like \"Hey! Let's make these together and all show you this trick I learned.\" Her cooking has improved a little (she still doesn't understand why salt is important, but things aren't overcooked as much and she IS trying.  \n\nYWNBTA for proceeding with your planned menu, but maybe simplify it some and then ask to cook with her randomly and show her some cooking tips for the sake of her feelings.  Good food is always a plus but is it worth completely hurting someone you love over?", "NAH\n\nLook, if she can’t cook and you can then who cares? Are you supposed to make the exact same meal she made? Of course not.\n\nIf she agreed to let you host then you can cook whatever you want. Have fun and try something new!", "Info: has anyone brought it up to mil how she acts after eating your food?", "NTA but this may not be a bad time to tread lightly… A few thoughts:\n\nYou could just go through with your menu entirely. You’re the host, it’s your house so you have the right to do things your way. There’s nothing wrong or spiteful about it. If anything having so many options cooked from scratch is incredibly generous and hospitable for your guests. Also, she’s an adult?? You’re not responsible for her reaction to anything… you don’t have to appease others in your own house. \n\nPersonally, I’d aim for a compromise. Every year you go without most of these sides. You could cut back on the menu. Like, do you really need two different kinds of mashed potatoes?\n\nOr, if MIL wrist could handle it, maybe you can compromise and have her bring one dish, maybe her cranberry sauce or whatever you and hubby care for least on your menu? Don’t tell her that of course. But, as someone who’s prepared your thanksgiving meal for the last 6 years, it would be nice to include her rather than completely show her up.\n\nEdited for typos :p", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI(28F) have been married to my husband(34M) for 6 years now. And for all of these 6 years we spent Thanksgiving with my in-laws. I don't have a family so that is not the issue.\n\nNow first let me tell you, my in-laws are great, they welcomed me and treat me like a family. My FIL walked me down the isle, my MIL and SIL helped me all throughout the wedding, when I was seriously sick 3 years ago, my MIL took care of me for 4 months straight. I love this family to bits.\n\nThe only issue (if it can even be regarded as such) as that they are all horrible cooks. I, on the other hand, am a great cook (lived with my Grandma all my life, and she taught me to cook since I was 7), and when I cook for them, my MIL gets kind of sad/jealous. Nothing obvious or anything like that, but she just withdraws enough for it to be obvious.\n\nLike I said before, we spend Thanksgiving with his family every year, and every year his mom cooks the dinner. But it's usually (and I am not being rude here, just describing accurately) a dry on the verge of being burnt turkey, kraft mac-n-cheese, box mashed potatoes, cranberry sauce from a can, store bought pumpkin pie and very bland peas. Every year I would be thankful for the dinner, but would cook a proper one the next day for me and my husband. We never tell anyone about it too.\n\nThis year my MIL broke her wrist, so I jumped at the chance of hosting Thanksgiving. So far so good.\n\nBut now I was planning the dinner, and my husband says if I go foreward with what I planned, I would ruin MIL day and be an AH. Here's what I have planned:\n- a turkey (obviously)\n- mashed potatoes (regular and garlic)\n- asparagus\n- green beans casserole\n- homemade stuffing\n- homemade cranberry sauce \n- buttered corn\n- homemade dinner rolls\n- yams\n- homemade pumpkin and cherry pies.\n\nI just want a chance at a Thanksgiving that matches my memories, so WIBTA if I go foreward with it?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "I don't understand how someone can get offended because someone is cooking them a good meal... Your MIL sounds pathetic as fuck if that's the case", "NTA. You deserve to have food you like for a holiday if you are the one cooking.", "INFO: is your motive in this to just cook a good meal or to simply show off and “out do” your mother in law.\n\nNTA if you are just cooking what you like to cook and not purposely going over the top (ie normally for your husband you cook from the tube biscuits but now you can show off).\n\nYWBTA if you are using this opportunity to try and show off and prove you are better than them.  It appears they have done nothing wrong to you and if anything have been exceptionally welcoming compared to a lot of stories on here.  What’s the motivation here?", "NTA make the meal you want", "NTA does he want you to purposeful make garbage food to make her feel better??? if she knows you’re a good cook and she agreed to you hosting then she should know what to expect. doesn’t even sound like you’re being ridiculously extravagant with your meal choices. i guess if you’re really worried she’ll make a fuss then it’s worth mentioning to her how excited you are to cook for them and how special it is to you as something you shared with your grandmother\n\nedit: if you really want to compromise then depending on how badly she’s injured maybe you could suggest she bring her Famous Sauce or Dessert or something that could make her feel included that isn’t awful/totally out of place. and compliment it even if it sucks", "NTA. You aren’t doing this to compete with your MIL, she has a broken wrist, she can’t host it. \n\nBut I would suggest you do get her involved with the prep so she feels as though she has still contributed and is still an important and valued contribution to the meal if she is sensitive about these things. Even if it’s running through your meal plan, discuss it with her as “you always put so much work into thanksgiving (yes it could be better but everyone has different strengths and she still puts time and energy into it), and I just want to make sure this is going to be good because I know important it is, and would love to involve you as much as you would like to be,” as long as she feels relevant and respected I don’t think she will mind that you put in more skill and quality into the meals, and involving her will show her you aren’t trying to muscle in on her tradition.", "NTA.  Food is bonding.  If your food being better makes Mil sad, don't do it.   Do her all the honor, ask her lots of questions about how she cooks the dinner.  Do the same stuff, praise the heck out of her \"helping\" with dinner so it could happen even without her hand.  Maybe  don't over cook the turkey quite as much.  \n\nYes I am saying do bad cooking to save her feelings.\n\nShe has almost  certainly done lots to save yours that you did not know about.  Her family is loving and kind they go out of their way.  That is her accomplishment.  If you choose to do this you will be showing her that she has taught you to be deep level kind.  Her family won't suffer, this is their familiar meal.  \n\nYour desire to give your family better is a fine one.  Just do it over a series of years very gradually.   Continue to honor your grandmother with the great meal at home.  Two Thanksgivings is not nothing.  I wish you the joy of your loving family.", "INFO Did they agree to come to Thanksgiving? What is your husband suggesting instead?\n\nWhen you are over there for Thanksgiving do you comment on the food? I mean there is nothing wrong with store bought pie and your acting like it's crazy. If you have that attitude I understand why your husband is concerned.", "NTA can you possibly make a toast at the start of the meal? Maybe a little over the top sugar coated about how much you love them and being accepted into their family. You’re so thankful to have them and everything they do and have done for you. Which is why you’re so glad you had the opportunity to recreate one of your best childhood memories with thanksgiving dinner to share with them after everything they’ve shared with you.  You could and might want to warn her in advance of your spread if you think it’s going to be that big of a deal. Communication is key, especially if you’ve got such a great relationship \n\nThe other question I have is can MIL bake (obviously not with the broken wrist, but in general)? My mom doesn’t cook, Boston market thanksgiving for the win, but she’s a great baker. Could you make her feel valued and like she contributes by having her make desserts while you make the meals?", "I would buy the canned cranberry sauce as well as making your own though.  Some people really love that can of cranberry but otherwise cook your heart out.", "Your meal looks delicious. I don’t honestly see the problem with it. It is better than your MIL. You are going to have to sit down with your MIL at some point and discuss how it makes you feel when she pouts because you cook differently than her.", "Sounds like a great dinner", "Your husband WBTA for even thinking about asking you to not cook a decent meal on a holiday devoted to eating a decent meal. So does he expect you to make a crap box dinner for the in laws and your regular good dinner the next day?", "NTA Why would you cook a dinner and not do your best. There will always be someone better than you at any given task. No one can be the best at everything. I have a relative that makes the best stuffing I ever tasted. My sister makes the best ham and green beans. My BIL is the baker, and no one can compete. They are both all great cooks but excel in different dishes. I myself am an outstanding dishwasher. Everyone has their strengths. No need to hide your light under a bushel. \n\n If your MIL likes the food she may ask for the recipe or cooking tips. It is an opportunity to share what you learned from your Grandma. It is a way to celebrate your Grandma and the lessons she taught you. You not putting your best food forward is disrespecting the lessons you learned.", "Really simple....talk to her or let your husband talk to her. There is a reason why she's feeling this way.", "Stick to her menu and tone down the \"fancy\"", "That doesn't work, even if no one compliments my food, as soon as she tastes it she just becomes withdrawn and it brings the mood down for the rest of the day/night", "They have to drive from another town, and they would not arrive untill the day of (they have responsibilities in their town) so that is not possible", "I personally wouldnt invite someone into my kitchen during an event. It leaves too much open for bad interactions or one party trying to instruct the other.\n\nWhat about asking if she wants to bring a dish? That's the normal sharing is caring in my family.", "Sadly that's not possible, they live 4hrs away, and because of prior commitments can't arrive untill the day of", "I wouldn't mind cooking/hosting every year. And while I don't put pineapple on ham, I don't mind it. If done correctly it makes the meat so tender because the acid in pineapple degrades the fibers and makes it melt in your mouth tender", "Probably the same evil monsters that put pineapple on pizza.", "Oh my God that was so funny, I personally don't mind sharing my recipes, but maybe because I honestly believe that even with the same recipe, no two cooks' food is the same", "I hate people who don’t share recipes within their family so the recipe dies with them. What a shitty non inheritance.", "She lives 4hrs away, I don't have that many chances to cook with her. And God as my witness, this is the simplest menu I can make. I could have gone full southern on the dinner, and then I would be an AH.", "I don't know, I know that neither my husband nor I did. She doesn't do it obviously enough to be rude or anything.", "No I never comment on the food, I give compliments and say how fun it was to spend the day with them. And I didn't say it was bad, just that I prefer homemade that's why I was going to make it my way since I am hosting this year", "what’s fancy about it.  looks pretty much like what we do minus the asparagus. \n\nI think what your husband wants is for you to make a crap meal that doesn’t taste good so his mom doesn’t feel bad", "Cook what you want. You’re hosting. BUT, I would reach out and ask if there’s anything she want included. That way she feels like she’s still a part of it.", "It’s not really fancy. There’s nothing in there except the homemade cranberry sauce that lots of people cook. I have never had homemade cranberry sauce but that sounds awesome.", "That is her problem. Does she also refuse to eat at restaurants because it tastes too nice? \n\n\n\nIt’s lovely that you care enough to not want to hurt her feelings, but to do that you’d have to eat a bland dinner. It’s unrealistic and unfair on you. \n\n\n\n\nMIL can learn to cook better if it’s so important to her.", "That's a her problem and you have to not be effected by others moods. Does it suck, yes. Is it childish, yes. Should it happen, no. Is it your problem, not even a little.\n\nPrep some conversation topics. Be prepared to start a riveting conversation with your SILs to distract everyone from the sour puss.", "What if you gave her a heads up on your plans? Gently explain that you love how their family does Thanksgiving but you are excited to share your family's version. Maybe explain that making things from scratch used to be a family event and even though you are going to be doing it on your own it is going to help you feel connected to the family you lost. And sharing it with your ILs will help you feel even more connected to the family you have gained.\n\n\n\n\n You have to let her know it isn't about trying to show her up or that your way is better. It is just different and sentimental and something you want to share with them. Talk her through the menu and share specific stories about making the items or eating them with the family. That way she 1. isn't blind-sided by the range/quality/prep of the food and 2. Doesn't take it as trying to show her up on the day of because you have shared each of those stories. Also, I know you said they have to drive so she can't help, but could you invite them to come a day early and stay the night so she can help prep and be involved as your sous chef?", "Fair! Then just cook your heart out but be sure to compliment her past hosting (even if you're lying 😅)", "Bummer. I was hoping she could help out.", "It may do that but it also ruins the juice for gravy.", "In the UK gammon is served with pineapple alot I'm sure. I don't like pineapple so don't eat it but I'm sure I've seen it served like that in loads of places", "Go with that - “MIL. I’m so appreciative of this family and love that you share all of your traditions with me - I grabbed this chance to share of bit of my southern tradition with you all and got to spend time in my kitchen remembering my childhood with my grandma so the meal is a bit old fashioned.”", "I think possibly your husband should call her and talk to her about it before thanksgiving. She may not even be aware that you guys notice it.", "Did they agree to come to Thanksgiving? Have you talked to your MIL?", "He meant store bought stuffing, cranberry sauce and pies. Then I can make homemade everything else.", "I mean besides the food, Thanksgivings with them are super fun.", "This is a great idea. Invoking the memory of your grandmother and your past traditions can certainly make it seem like this is something you've really looked forward to sharing with your \"newfound\" family!", "This!  Yes!", "Well yes, I offered to host and they accepted weeks ago. It will be a full house of my FIL, MIL, SIL and her family and my BIL.", "yes crap food.  \nwe don’t do store bought on turkey day \n\nblasphemy", "Your 100% NTA.\n\nThat said, my BFF had a similar issue once she started hosting big family meals, and it turned out her hubby & SIL actually liked all the boxed/canned stuff (strange to all us home made all the way people I know), so every year she makes home made & boxed stuffing (they've conceded that home made cranberry, Gravy & pie better, but still love their stove top lol)....so, it might be worth asking questions to see if there's an easy compromise on this (e.g. do they actually like boxed stuffing as my BFF in laws do?) . \n\nEither way, your planned dinner sounds delicious & I wouldn't back down on your plans.. perhaps when it's time to eat you can acknowledge how honored you felt to get to prepare all your grandmother's favorite things for this holiday & that you appreciated the opportunity.", "Maybe he likes that stuff? Maybe other folks in the family like that stuff? Both me and my step dad are pretty discerning about food but still LOVE canned cranberry sauce. Thanksgiving is all about food but we love food not just because it tastes good or is the best that can be had but because it invokes memories or feelings.\n\nJust to be clear, I don't think you're an asshole at all. Nor is your husband and his family. Your dinner sounds lovely and I'd bet you a million dollars that when it's all said and done, everyone will heartily enjoy it. I only think you should communicate with his mum about the meal and simply consider making changes, additions, or compromises if that's what makes the best sense to you. In the end though, your meal, your rules!\n\nI really hope everything works out for you folks and you enjoy a beautiful meal together!", "Since none of that requires cooking, what about some compromise.  Ask MIL is she can bring the pie, since it’s just store bought, and don’t make a separate one.  Maybe let her bring store bought rolls, too.  \n\nYour post could come off as trying to show her up.  Maybe evaluate your intentions to make sure they are in the right place with your plan.  Honestly, cooking all of that homemade by yourself sounds exhausting.  That’s a multiperson job in my house.  \n\nThanksgiving should be homemade, not boxed, in my world, but it doesn’t need to be extravagant.", "Terrific! Then you can honestly say that you've got big shoes to fill (in terms of being a host).... just don't mention the food 😇", "Be sure to tell them how much you miss going there and how much fun it is.\nTalk to MIL about combining efforts next year.", "I do with cranberry sauce and stuffing. Not really a fan of stuffing so I doubt I could make it good homemade but everything thing else I make homemade. Especially the pumpkin pie. My stepdad doesn’t eat much sugar any more so I only put about a quarter of the sugar that’s supposed to be in it. I do that with apple pie because I like it that way too.", "Valid. I grew up poor and prefer generic breakfast cereal. And if somebody in our fam hosts thanksgiving, even if they make cranberry sauce, we still have to serve the canned kind.", "NAH I don’t think you are the AH for wanting to cook an all out special meal, but if you know it will hurt MIL feelings is it really worth it? \n\nI know you mentioned she wouldn’t be able to help you cook, but can you include her in the planning? Just call her and talk to her about your wonderful memories of your grandma and go over what you are wanting to cook. Make it clear you aren’t hating on their thanksgivings and that you still want thanksgiving to be special for them. Maybe ask her if she has a favorite dish/recipe that she would like you to try to cook on thanksgiving? Even if it’s just boxed Mac and cheese.", "NTA \nyour menu sounds like the perfect Thanksgiving dinner for you, and hopefully your husband. When a different person hosts, the meal changes. Just don’t mention anything about past Thanksgiving‘s and hopefully your father-in-law won’t either. Your husband should get kicked under the table if he attempts to make any comparisons. And at this point your mother-in-law might very well want to pass on the task to you. And being gracious about the entire situation is how you get both a happy family around the table, and edible food", "I wouldn’t do it all if my husband said that 😂", "NAH, but.... I can see why your MIL feels outdone. It all sounds amazing! She probably wishes she can cook like you!   \nNot that you have to do this, but to save yourself a little bit of work (you should get to enjoy the holiday too!) maybe only do one kind of mashed potatoes (because with all the other stuff I don't feel like you need two kinds) and maybe get some really good quality but store bought dinner rolls. Or even ask MIL to get the dinner rolls and bring them if she asks if there's anything she can do. That way you are compromising- you don't have so much to do in the kitchen, MIL maybe doesn't feel quite so salty about it!", "Nta, people have different levels of cooking ability. Don't make a bad dinner just to appease your MIL/husband", "Oh man. \n\nSo my mom is lovely, but cannot cook.  She had three kids, a full time job, had to manage the house and grow all of our food, and my father's idea of \"helping\" was to occasionally yell \"you kids need to help your mother more\".\n\nSo cooking was about getting her family nutrition, and the only good food was when we had fresh veg from her massive garden. After Octoberish, all we had was veg she'd canned.\n\nSince my father's death and my mom's increasing frailty, my brother- an excellent cook - has taken over hosting Thanksgiving, and let me tell you.. I had no idea that roast turkey was supposed to taste *good*.", "NTA. You are allowed to have a talent and share lovely home cooked food with your family. That’s normal - it’s good. If your MIL has insecurities then that’s for her to work through. \n\nI might be more sympathetic if she was someone who cared about cooking and did all this home made stuff but you were just better at it. I purposely avoid cooking certain things that are my MIL’s special thing she does even if I feel I could do it better because she is so proud of her recipe and it would hurt her. But that’s not how things are in your case. You have to buy a store bought pie because she does? No, that’s silly.", "Looks yummy.  What time should we get there?\n\nNTA.  But seriously, I think you need to play the long game because this could send MIL over the edge, and I don’t think that is what you want. \n\nCan you pare it down a bit?  Maybe, one type of mashed potatoes, make one pie (your favorite) and buy her favorite), have the canned cranberry sauce in addition to the homemade, in case she wants to save face by saying it is her favorite.  \n\nThe thing is, if you play this right, you MIGHT get to host permanently.  MIL could be getting to the age where it is too much, and honestly, the wrist might be just the thing for her to recognize not hosting can make the holiday more enjoyable.  At least, maybe it gets you to the point of being able to bring dishes to her house so that she can take it a bit easier.\n\nOne last comment - call her and ask her what her favorite side is.  Maybe she loves the Kraft mac and cheese because it reminds her of her grandma at Thanksgiving, and incorporate that if you can.", "NTA. Based on your comments, your MIL is aware that you are a better cook than she is, so hopefully when they agreed to let you host, she knew what she was signing up for. \n\nIt would be kind to give them all a heads up and as other commenters have mentioned, lean heavily on sharing your grandmother’s recipes and honoring her memory.", "YWBTA.\n\nIt really does sound like you’re trying to show up your mother-in-law’s cooking. But it also sounds like there’s room for compromise. Pick two or three things that she can buy from the store and ask her if she would be able to bring them. Then she will have some of the things she’s used to (and clearly likes!) and you can have some of the things you like.\n\nAnd next year, you can tell her that you enjoyed collaborating with her on Thanksgiving dinner and ask if you can keep sharing the cooking responsibilities.", "NTA. You can say “I’m so excited to share some of my childhood memories with you guys”, and “I know I’m not as good as a host as MIL but I hope this takes some stress off of her!” \n\nAlso, I get this. My MIL is a god-awful cook. I won’t tell you what this woman does to that poor turkey. It’s inedible. Nothing has flavour. Doesn’t stop me from bringing edible food. We have hosted in the past and she still brought her “turkey”. And she still hosts and won’t stop. \n\nHaving a big spread isn’t an insult even if your cooking is better", "NTA, and I know she can't cook this year but maybe you could invite her to cook with you next year - that way you both host, you have bonding time for the two of you, and you can help her improve her cooking by sharing/teaching her your ways and recipes, so she won't feel sad in future.\n\nJust don't say that last bit out loud okay!\n\nCould be the start of a lovely MIL/DIL tradition.", "Do not down your menu for her. She has to know there are better Thanksgiving dinner options being out there and has access to the world wide web where any skill can be improved with videos and research. She is fine being herself and you should too. Do it up girl!\nBTW our Thanksgiving dinner is yours almost to the T! Except no asparagus and with sweet potato casserole.", "She's just gonna have to step it up then. You can't be mediocre to meet someone else's personal standards.", "I would suggest you pull back a bit. Do the canned cranberry sauce, at least. That's so nostalgic, and I've found that most people actually prefer it. One type of mashed potatoes. Buy the pies, or let them buy the pies and bring them. Make the bland peas. \n\nMake it delicious, but familiar. They've been generous to you--be generous to them. Thanksgiving is not just about food, it's about nostalgia and connection.", "Create a menu that bears no resemblance to hers. That way you aren't doing her dishes better. Then tell them these are the recipes you learned from your grandmother, and you appreciate being able to share part of your history with people you love.\n\nYWBTA if you did something you know would hurt people you love...like making their past meals seem inferior.", "I think YTA, and hiding a bit behind sympathetic word choices. \n\nLet's really lay it out:\nYou don't like MIL cooking. \nYou want a specific menu from your childhood traditions. \n\nYou're using store bought vs home made as an insult to your MIL.\n\nYour husband asked for certain plates that he and his family look forward to. You disregard his traditions and request. \n\nJust because most of us (myself included) cook from scratch on Thanksgiving doesn't make us better than. \n\nYou're setting yourself up to never host again because the family wants their traditions carried on. You've changed all of them, and continually insult them.\n\nEdit:\n\nYou have a chance to salvage it...you can compromise (serve the peas and Mac n cheese in addition to what you plan) and own it. Don't hide behind \"it's so simple\" or empty platitudes (lies). Be accountable: say that you want xyz from your traditions and combine it with some of theirs.", "NTA but why don’t you compromise? Make the Kraft mac, buy the canned cranberry and buy a store bought pumpkin pie. Take out your home made version of those two things, maybe it’ll help her feel like ‘her’ thanksgiving just like you are looking for ‘your’ thanksgiving?", "NTA but maybe see if you can find out what her favorite part of her thanksgiving meal is and do that her way. Like maybe the Kraft Mac n cheese is really important to her for some unknown to you reason. My oldest has some sensory stuff and there was a time where he pretty much lived on Kraft Mac n cheese (it’s still his favorite food) so I made it for thanksgiving so he’d eat something and now it’s kind of tradition.", "NTA and i think the key is to not make a big deal about it", "NTA. Girl,MIL has NO ABILITY WHATSOEVER right now to make Thanksgiving dinner. Use the opportunity to make the dinner you want and stop listening to your husband who is definitively asking you to DIM YOUR LIGHT for her benefit. Don’t you do it.", "Maybe you guys have very different taste.  You say they are all horrible cooks but maybe they like their cooking.  I don’t think anyone’s TA here but I always find it weird when people say, “I’m a fantastic cook and everyone else sucks”. I have a friend like that.  Always cooks a ridiculous amount of food and hosts big parties.  I brought chips and homemade salsa one day and she was super bent out of shape that people loved my salsa and my $2 bag of chips.  Why don’t you make your stuffing and cranberry sauce and have the canned cranberry sauce and stuffing they like too.  Is it really that inconvenient to use a can opener to get some cranberry sauce they like and some Stouffers?", "NTA\n\nI’m sorry but your SO expects you to buy store bought crap to make your MIL better in your own home? You’re the host, cook to your hearts content. Your SO needs to suck it up", "I know it's a traditional meal but is there any deep reason why you can't do different dishes, esp sides, to her usual ones to avoid the pain of direct comparison? It looks like there's already not huge crossover. Possibly credit husband with doing the turkey. NTA", "NTA but...people tend to like whatever food they are used to. Prepare yourself for the possibility that they think MIL's food is better.", "“Mom, I am so excited to go all out for you after all you’ve done for me! I’m going to treat you like the queen you are!”  Make your yummy meal. It’s ok for you to be good at something they are not. It’s lovely you want to treat them to a feast. Your husband needs to be careful of the tone he sets with them. This is a way for you to show them how much you love and appreciate them.", "Maybe you could present your dinner as you wanting them to experience thanksgiving dinner the way you did while growing up. It doesn’t have to be about whose is better but that they’re just different.", "NTA. This menu looks normal.\n\nBoxed mashed potatoes are awful. I never make those.", "NTA. But I'm curious, OP. Have you or your husband ever asked her directly what's up with the withdrawal? I'm wondering if addressing this directly--and empathetically--might be helpful.", "NTA. Can I come over for dinner?", "You’re NTA, I’m English so I have absolutely no say on your turkey day thingy but it’s sounds like standard Sundays dinner to me.\n\nIt may be worth actually mentioning something to her though, quietly take her to one side and say that it’s never a dig at her you just like doing food and turkey day like this as a way to honour your grandma.", "This is a great idea.  But maybe include a serving of the mac and cheese and say that it is one of your favorite parts of the meal at her home.  In above sincere way.  I can see how it might come across as insincere if done wrong.", "Maybe. But just as an aside: the 2 kinds of mashed potatoes will take as much time as 1. Basically you just roast garlic and mash it with the potatoes to get mashed garlic potatoes, add a bit of chives if you want to be extra fancy", "She broke her wrist… Isn’t the point of OP hosting so she doesn’t have to cook?", "Then let him cook it. He doesn’t seem to know even copying his mother’s food will take time and effort so let him do it.", "I would definitely not attempt any fancy flourishes, but don’t go out of your way to make the food bad, please.", "It’s unfortunate that she’s so insecure that tasting your delicious food makes her unhappy. Why is she trying to compete? Guess what, if I had a DIL who was a renowned track star, I wouldnt feel bad that she could beat me on a run through the neighborhood. You two clearly operate in different lanes, she needs to understand that.", "What if hubby, mil, fil look forward to their tradition and to them, you've changed everything (like the way mil's is nothing like your grandmother's)?\n\nI don't like cranberry sauce, but I do look forward to the canned one on Thanksgiving.  Because of the tradition. \n\nThink about it from that angle...the tradition of mil hosting is already gone this year.  In your family's eyes, they may find comfort in seeing at least one or two plates from their tradition.", "This isn't the simplest. It's what you most want. If you cook as well as you say, you'll find a way to incorporate the sides that signify Thanksgiving to your family.", "But why though?  Yes you can obviously prep a lot of things the day before, but MIL can still do something.  Like I can't imagine what kind of prep you need to do with asparagus?  Let her season them and stick them in the broiler.  Yea you'll bake the homemade rolls the day before, but you can have MIL's help to warm them up before serving.", "Sounds amazing! I will be trying that sometime!! But seriously, your menu sounds amazing, but as I said don't chain yourself to the stove- you deserve to get some relaxing time in too!!", "It's super easy to make, you can even do it in a microwave! I showed my mom how easy it was and she never bought canned cranberry sauce again. My trick is use apple cider for the water, lol!", "It mainly cranberries and a ton of sugar and a bit of a long time to cook it down.", "Like mac and cheese. That is the only thing missing from the menu. Someone (it would be me) might miss it.", "I think embracing the southern might be a good thing because then it’s not a 1 for 1 comparison. If your traditional stuffing is totally different then the focus can be on the difference, not the fact that it’s better. Heck, you can also make a quick stove top stuffing on the side too and now they are “options”, not comparisons. \n\nI do have to say though - don’t underestimate the dedication people might have to canned cranberry sauce (the kind that retains the shape of the can). For some reason that particular item really has an ability to embed itself in peoples’ thanksgiving nostalgia and becomes “necessary” if they grew up with it.  Like someone might fully appreciate and understand why real home made cranberry sauce is superior and still miss the darn canned stuff.", "I have never heard of doing gravy for ham. That’s a new one.", "If the food is mentioned, speak from the heart. Tell everyone about learning to cook with your grandma and how this meal represents so many wonderful and loving memories you have of her.", "NTA but I think you should make an extra effort with your MIL. Tell her how much her trust in letting you make dinner means to you, gush about how much fun and warmth her past hosting has provided. Shyly admit to wanting to make everything perfect FOR her. If she has enough ego boost, hopefully the dinner being way better will sting a little less", "Could you ask her to cohost? \n\nSay “I love your thanksgivings, would you mind helping cohosting so we don’t miss out on the fun this year?” And have here even be  the social coordinator while you “just” cook? \n\nEdited for being an idiot who typed to fast while their brain is asleep.", "Put her in charge of something else…you know MIL you’re such a good welcoming host while I cook perhaps you can help keep everyone entertained. Maybe you can plan a post meal game or something like that so she is involved. And then of course the trump card is I wanted to make dishes my grandma taught me just like you make dishes you learned.", "Fwiw, i do make a small bowl of instant stuffing for my in-laws because they love that crap. I can make the objectively best homemade stuffing in the world, and they’ll still eat the box stuffing because that’s that happy Thanksgiving memories tastes like for them.", "People are weird about cranberry sauce, to the point we have 4 different kinds. I would buy a can of their usual out of hospitality: They probably use it to choke down the dry bird and will panic if it’s not there.\n\nWhere are you finding asparagus in November? We can only get it fresh in spring.", "Now that sounds like an awesome twist!", "I use orange juice.", "That sounds like my tastebuds would be in 7th heaven. I love foods but due to health issues I can’t eat much at one time. I would just make sure to save room for the cranberry sauce.", "Ha ha me too", "Why not talk to your MIL? Tell her plan and see if she is upset. Or talk to your his about why he thinks she'll be upset.\nIt's a pretty standard menu and it's not odd to tell people the dinner plan.", "\"I was nervous hosting after all the amazing Thanksgivings at your house, so I might have gone a little overboard. I didn't want to let everyone down since the tradition at you house means so much to us all.\"", "(The canned cranberry sauce is legit the best cranberry sauce.)", "I always loved cranberry sauce, even the canned stuff. Homemade is just irresistible to me. My other hack is Trader Joes fresh cranberry sauce, it's pretty close to homemade.", "We actually love cranberry sauce from a can. I buy the jelly kind and the kind with cranberry bits in it each year.\n\nWith stuffing I don't have time to start from scratch scratch. So we always buy store-bought stuffing, but then even the labeling on it suggests that you add 57 different things to it. Which of course we do. So by the time I'm done with it, the only original part of it is really the bread and whatever minimal spices they put on it. \n\nSide note. When stuffing is cheap like right now. We buy bags of it and use it as croutons throughout the year. So the niblings would identify plain store-bought stuffing as croutons.", "The best part about the sauce in the can is getting it out whole, and serving it in a very fancy crystal dish. It's like food sarcasm. My whole family loves this bit. The goal is to get the sauce out without a cut or mark in the jelly. Then, we call out the first person who takes a slice for ruining the beauty of the jelly, which still looks like a can. Just a fun Thanksgiving joke.", "Go for it. If your MIL can't handle this, it is her problem", "NTA", "NTA there's nothing outrageous on this menu", "YWNBTA.  If you were doing it specifically to rub her nose in it, you would be, but that's not what you're doing here.  You just want to make a fantastic spread and for everyone to have a good time.  If MIL gets butthurt about that, that's on her.  You should not have to change anything about your menu just to placate her feelings.\n\nI'm thinking, tho, maybe see if you can include her in some way in the prep?  I know there's not much she can do with a broken wrist, but she can maybe hand you ingredients and you can chat about why you cook things the way that you do?  (Edit: just saw that they live a ways away and can't come until day of.  I mean, maybe you can still chat about how you cook stuff?  but maybe she would find some way to take offense to it.\n\nMy husband and I tried to convince his parents FOR YEARS to brine their damn turkey.  They didn't for the longest time.  When we said it kept the turkey from going dry and helped with the flavor, they basically said that turkey is supposed to be dry and that's what the gravy was for.  I forget how we swung it, but one day, we got them to brine a turkey, and they were converts from that day on.  Whether they actually brined their own turkeys when we weren't around, who knows?  But when we were around, they no longer complained that brining a turkey was an unnecessary extra step.", "You’d be the AH if your goal was to “outdo” your MIL.", "NTA just say you might have gone overboard because you had big shoes to fill like another said. Compliment her thanksgivings and boost her ego and it won’t make it sting.", "NTA As long as you're don't it from a place of wanting to give everyone a nice meal it's fine. If you're wanting to do it to make her look bad or purposefully show her up, then you'd be YTA", "why not frame it as something your mil can do to help you? i think a simple \"hey, i just really want to be involved and i think because you and fil are amazing hosts, all i can do is cook. pls let me take over the cooking so i can contribute!!!\" \n\nidk how to judge this...nta but it would be so easy to appease your mil", "NTA. Maybe ask her if there is a dish she really likes and include that so she feels special and thought of?", "NTA for planning a nice meal. Might be an ass for having anything against canned cranberry sauce. How dare you!", "NTA. I have a family member who can mostly sorta cook and would do similar. They'd get so disappointed if I did not eat (I do eat some actually) their bland plain butter noodles, bland mashed potato, bland baked canned chicken casserole or bland baked canned tuna & potato chip casserole. Oh don't get me started on their bland canned green bean casserole or their bland canned pumpkin pie! I tried so hard to show them how to cook new recipes, make things fresher, or even just the basics like adding GARLIC OR SALT/PEPPER OR ANY KIND OF HERB/SPICE MY WORD!!!! didn't help lol. They just like cooking bland canned comfort food.\n\nSooooo when the self proclaimed food snob foodie cooks, you can imagine how much difference there is. At first they were sad and disappointed that they weren't cooking the same. I made sure to NEVER compare my food to theirs, talk more about the recipe or my interests (i.e. got this from auntie so and so or from my culture whatever), and not mind too much at their withdrawal. There's not too much you can do. It's a her problem and she has to kind of get over it. You can compliment her cooking as you are eating her dishes of course. But if you are a different cook then you shouldn't change your cooking to make her feel better. That's wayyy more insulting in my opinion. I would do my best and never mention the elephant in the room. Maybe her reaction is a bigger deal to you but it might not be to others? Anyway be happy and upbeat and positive. She has to work through this insecurity on her own.\n\nETA my family member now loves both my cooking and their own cooking. There is room on their taste buds for both. Whenever they talk about their favorite recipes I always make sure to talk it up too, \"oh yes your signature #1 spaghetti that everyone loves!!!\" Which people do love it but I can't really stand it.... That secret is going with me to the grave lol\n\nEdit: wow so many typos sorryyyyy", "NTA - I thought I had read this post before though?", "You’re NTA but maybe ease into. Do some stuff they’re used to and some stuff you want to do. \nIn the future maybe y’all can bring a side to these meals. Slowly introduce these folks into home cooked goodness.", "NTA. I love my MIL to pieces. She is not a great cook. My first turkey day with her many moons ago was turkey cooked in a bag, stove top stuffing, instant mash and gravy from a jar. I was shook. I am a good cook and I love cooking. \nNow she helps me prep but I do the cooking. She is included, I get my cooking. Win win. \nPlus it could be a bonus if your MIL picks up some skills and recipes!", "YWNBTA, my MIL is a terrible cook and I can not wait till our renovations are done so I can start hosting. They're very anti-salt (FIL had bad blood work years ago when he survived on Coke and Hot Pockets at work) and that equated to nearly every other spice as well. She uses chicken broth to make her mashed potatoes after seeing the commercials saying it was healthier than using butter and cream, so they're this weird bland, sloppy mess that's somehow also dry??? Which she adds to stove top to make her stuffing, so that's also a weird sloppy mess, and they put canned corn and green beans in the crock pot??? If you want them buttered, FIL breaks out a spray margarine bottle. They also always used jar gravy, until I volunteered to make it one year so thankfully there's at least decent gravy to mask it all, plus I just started bringing green bean casserole a few years ago and it was a hit, so I'm allowed to bring that. The turkey itself isn't terrible, but they literally thaw it, stick it in a crock pot bag thing, and put it in their large roaster, no spices, nothing to stuff the bird, so while it's never dry, it's just incredibly bland.", "Your husband needs to talk to his mom about her insecurities rather than making you cook worse food.", "NTA. Your husband needs to set boundaries with her. He should not be worried about her feelings about you cooking Thanksgiving. You offered because she’s injured. store-bought Thanksgiving food is disgusting.", "What matters is your intent: are you doing this to outstage her? If not, NTA\n\nIf it were me, I probably would say something like, “would you like to take care of the dessert?” This way, she still feels involved, it doesn’t require the fridge for the car trip, and won’t be stressful for her broken wrist so she can still contribute and feel useful. Thank her for bringing the pies and compliment them.\n\nI know I wouldn’t be happy “half-assing” my cooking and spending money on something I wouldn’t truest be satisfied with. But be prepared: if they like it, you might get stuck with this in the future. Think before you commit.\n\nEdit: I’d probably scrap the asparagus off the menu,  just do one potato, and keep the canned cranberry (nothing else is like it) to more closely resemble her menu, give it the impression you tried to stick to tradition", "NTA - do what you planned and say you wanted to make it special for them because you love them so much", "Seems like as pretty mainstream fare. Nobody should feel like you’re showing off with a basic thanksgiving dinner.", "NAH   Some holiday meals are about tradition, nostalgia, and familiarity. I’ve tried to jazz up some Thanksgiving classics for my family, some people enjoyed it, others were disappointed. Your menu sounds amazing. I’d suggest you prepare or purchase a couple things exactly as MIL would, instead of or in addition to your version. Good luck!", "Maybe set her mind at ease. This is not about showing her up, but about sharing your fond memories of past Thanksgiving with your grandma. Your sorry that she can't host this year due to her injury, but your grateful to be able to share this with her.", "YWBTA.\n\nIt feels wrong to say that but this woman is nothing but nice to you. I would tone it down a notch.\n\nUse the instant mash in front of her but pimp it up like crazy. A shedload of butter and my husband can't tell the difference. \n\nCranberry jam, add some spices or adapt it. Or if it's from scratch ask her to stir the pot.\n\nMac and cheese from the packet- you weren't going to serve it but it's a family thing so why not?\n\nRolls can be bake from frozen and they taste awesome as long as they're warm and have salted butter.\n\nNot everyone is cut out to do huge dinners. Wandering in with home made everything and not one but two mashed potatoes and pies IS showing off. Be kind. Ask her to help taste as you make and ask what she thinks. A bit of bought stuff concedes you're not superwoman.", "NTA\n\nI understand where he’s coming from but truly just state that it’s all for your MIL and you’re repaying her for everything she has done for you. \n\nJust say food is your comfort and love and that’s how you’re repaying her. \n\nMaybe get her a lil gift on the side just to smooth it over as well", "NTA BUT\n\nmake the boxed Mac and cheese. Don’t forget that bit. \n\nThat shows that you aren’t showing her up. It’s just that you have cooking skills. But you aren’t judging *what* she serves.", "NTA your dish is not over the top.", "NTA, if this is truly something that bothers her, it's not hard to learn how to cook better, and her insecurities shouldn't keep you from cooking and enjoying good food.", "NTA", "NAH it’s a legit concern but you can overcome it with words! Like the other comments have said, MIL you can always admit you were nervous and overdid it a bit but wanted to impress AND be like MIL. My MIL just throws things together and hope it works so when I showed her how marinating a beef roast with onion for 24 hours would make it so soft when I cooked it, she was amazed by it and took it well. You can always also share recipes or ask her an opinion on a recipe in future “I saw this and I thought it looked neat but I want to know what you think? Maybe we could cook it together some time?” Stuff like that\n\nAlso do please update how it goes! I truly hope it turns out good", "NTA. \n\nYou're allowed to cook what you want. MIL probably will feel inferior but it sounds like she IS inferior (in this respect), and there is absolutely no reason to hold yourself back just for the sake of her feelings. \n\nI do have some questions, and they have no bearing on my judgment. You are NTA no matter what your answers are. But do you think any part of your motivation has anything to do with wanting to show your husband's family just how much inferior their usual Thanksgiving cooking is? Just how much better you are at it? Would you prefer to take over the reins of Thanksgiving from now on?", "I will say NAH. You and your MIL sound like lovely people. You say that she has this reaction, and it is just barely noticeable, to your cooking. I can’t fault her for that, people are allowed to have emotions and she is not making a big deal out of it. You can’t help that you know how to cook. I think accepting to eat Thanksgiving at your house means everyone knows it’s going to be good. I think that being a SAHM, cooking comes with the territory, and you “outdoing” her is bringing up some feelings of inadequacy or guilt, because she simply couldn’t do it. I would do your thanksgiving. You are the host after all, but I would call MIL up and go over the menu with her so that she feels involved. If there is the same reaction then I would talk with her about it. \n\nAnd after all of this please take this woman to a cooking class.", "Of course NTA.    You have the right to your traditions as well.  Thanksgiving is about being with family.   Just try to be inclusive and make sure everyone enjoys themselves.", "Sounds like you’re making pretty traditional thanksgiving dishes-I don’t see what the issue is. Just because you’ll be making them a different way (homemade mashed potatoes versus boxed, properly cooked Turkey versus dry and burnt), I can’t see how anyone would view that as you “upstaging” MIL. Maybe you can throw in a box of Mac and cheese for the table and let your MIL know you tried your best to make all the wonderful dishes she makes every year? NTA.", "Lovely menu. But don't shame your MIL and you definitely WBTA if you go forward as planned.  Pare it down a little.", "What if you asked for her \"recipes\" and then cook how you normally would and if there's compliments make sure you say something like \"MIL recipes helped SO much\"? That way u can cook to ur heart's content and she doesn't feel slighted because she was a \"part\" of the cooking process? I seen on another comment they live out of town.... Best I could come up with lol", "YWBTA. Tone it down a touch. One kind of mashed potatoes and consider store bought rolls and pies. Part of being a gracious host is not embarrassing your guests, in this instance, the people who have treated you like their own daughter. Also, you said you cooked a “proper” meal the next day for years. You’re not missing out on anything. You can kick it up a notch each year going forward, and she may actually relish handing over the responsibility. Enjoy!", "NTA\n\nWell, if you are going to go all out, be tactful.  While the menu looks good, perhaps only one kind of mashed potato would be ideal, just go easy where it shows that you not only know how to cook, but that it would be something that they may try to recreate and see if they can get it as well.\n\nIf you over do it, then yeah you would be showing off, but if you hold back a bit, then you will still wow them and show them a good time as well, as not to hurt their feelings or make them feel a bit off by the entire meal.\n\nYou could say forget say a dish or make a dish that is a bit off, where it shows that you are not so perfect in the kitchen and they could see how to improve and do such themselves as well.  Things like you make the cherry pie but it is a full cover and not the fancy lattice kind, or with the pumpkin pie, you have a can of rediwhipped instead of the real heavy whipping cream present.  Things like that where is shows that you know how to cook, but are not trying to show them up.  Even messing up a dish like the kraft mac and cheese may be in order.", "NTA but this will probably affect your relationship with your in-laws(it shouldn't but it seems older folks can't let things like this go), especially if everyone raves about the food.   Maybe use some store bought cranberry sauce or stuffing?  We usually do both because we have some ND family they like the store bought stuff(sensory thing for them).  \nGood luck, your meal menu sounds amazing and delicious.", "NTA that all sounds like what I'd expect of thanksgiving meal to be (English here) why should you have to down play it I'd be like I am thankful I don't have to cook everything!", "NTA just tell her that you had some big shoes to fill this year so you went all out.  Tell her how much you have always appreciated the time it takes her to prepare everything every year and because she is so good to you, you wanted to go over the top.", "You seem bent out of shape to tell the whole world that your cooking is so much superior. It rubs me the wrong way. We get it, you know how to cook. Now why is it that you need to prove a point on Thanksgiving of all day? Introduce 1 or 2 nice things and keep everything else the same. Otherwise, I'm going against the grain : YTA", "NTA. Cook what you want. I've got the feeling that MIL knows she can't cook and after they get a taste of your cooking, you will be hosting from then on.", "How about you don’t do turkey? A few years ago my husband’s side of the family (who we usually spend the holiday with), we all came to the conclusion that none of us actually like turkey all that much, so we’ve started offering different entrees- smoked ham, brisket, lasagna, etc. \n\nThat way there can be no direct comparison made!", "Maybe he wants OP to let him cook since he's got such an idea of what it should be...", "Can I upvote this more times?\n\nYou're right. OP can't win here. Neither making the night awkward and potentially falling out with MIL, nor cooking a shit dinner seems like a good choice. OP should think outside the box and avoid the situation itself.", "Anywhere that post can actually be read?", "So this might get me stoned, but I pre-cook the turkey before putting it in the oven, and it is so tender an juicy too \n\nIf you are curious here's how you do it (apparently an African -not sure what country- neighbour taught Grandma how to do it): dice an onion (half an onion for each lbs of turkey), brown it in butter with some salt an pepper, add in some herbs (whatever you like, I use bay leaf, rosemary and thyme) and spices (I use some cardamom pods and cloves) then add some chicken stock. Once it's boiling put in your turkey (the stock should not cover the turkey, just 1/3 in) on a low heat.\n\nCook it on each side for 10 minutes (if big) or 5 minutes if small.\n\nThen smother it in herb butter, cover it in foil and into the oven it goes. It cuts the cooking time in half and it is so flavorful and juicy too", "My MIL's cooking isn't as bad. I think she is afraid of under cooking the bird, that's why it's always dry, but she uses aromatics and salts it well. And while she uses boxed everything, it tastes good, just not as good as homemade. The only exception is the peas, those I don't touch because they are overcooked and bland.", "You can say you did the turkey like you learned from grandma, and bought everything else from a local place (it’s a lie, and lying is wrong… but at least you don’t take the credit (if it’s such a big deal) and get to eat good home made food). \n🤷🏼‍♀️\n\nNTA anyway.", "Make the boxed mac and cheese Op I can’t stress this enough to you. And have the canned cranberry sauce. \n\nThat will help illustrate that you still appreciate her traditions. It will show that you have no issue with *what* she serves. \n\nSure, you’re a better cook. But make it clear you aren’t trying to show her what the meal should *be*.", "Leave something for her to help with, and incorporate some of her traditional items.", "Most of our food is cooked day of so that could still work! The Turkey probably has to be started early but the rest of it is just cooked while the Turkey is baking. You could always cook some before and leave some to let her “help” with", "Maybe ask her to arrive a few hours early before everyone else? And then you guys can make a quick side dish together", "There's nothing you prepare the day of? She could help with potatoes or putting food into their serving dishes. She could also put together a crudite plate.", "Ha, good luck keeping people out of the kitchen on a holiday in my family….that’s where everyone hangs.", "I like this idea a lot! Also, since you're asking, the one thing about your menu that does veer into \"showing her up/showing off\" is two kinds of mashed potatoes.", "I consider it a strategic retreat...", "the key word is “YOU ARE HOSTING”. You get to make the decisions. If hubby is making any food, he can make it to her standards. But he doesn’t get to direct your cooking .", "I mean, you make it all, just take credit for the turkey, and say you bought everything else from a local restaurant/place…", "Slow down Dr. Oz", "Lol, we have a tiny, \"2 and a half butt\" kitchen, so my husband's only job on Thanksgiving is to keep people the heck outta my kitchen!! They all know by now, though, so it's all good! ;)", "I had the same thought about the potatoes.", "Compromise. \n\nHave MIL pick up a pie, CoolWhip/Redi-Whip and a can of cranberry. That way she feels like she’s contributed to the meal and hey, some people really do prefer canned cranberry. And on a related note, I offended at least 3 of my dorm mates back in college when I said a relative insisted on picking up pies from the bakery for Thanksgiving 😆 For some people, that’s the tradition vs a homemade pie. \n\n\nOh, and NTA for doing Thanksgiving YOUR way. Everyone has their own traditions.", "I’d say have both the store bought cranberry sauce for them and the homemade for you, and maybe both versions of stuffing. I come from a blended family deeply divided on cranberry sauce based on what people grew up with, so we always had both. I also grew up with doctored store-bought stuffing and have a deep craving for it at thanksgiving. I’ve made my own, and it’s delicious but not the same emotionally. Holidays are partially about objectively good food and partially about nostalgia.", "Not necessary. Serve what you like.", "Could you make yours and the stuff they prefer? I'm sorry, but is there an income/ time disparity?\n\nI've had both versions of these dinners in my family, and cost and time was always a key player in using the storebought versions. \n\nI would just make both if you can afford it. Honestly some people's homemade recipes are hard to swallow, so you can say, oh I've always wanted to share my grandma's recipes with you, since I love you so much but I understand if you prefer the classics.", "Get the can of cranberry sauce, and have two options for people to choose from. That’s a stupidly easy compromise. I’m with you on the stuffing and desserts (though I’m not a baker), but you’d have to pry the canned sauce from my cold dead fingers.", "Do you think the cider would work if I cooked it in the stove?", "You could say something like \"Thanksgivings with you are always the most amazing celebrations and I feel SO very much welcomed in your family, so I felt the need to go all-out to give something back to you and make you feel as welcomed as you make me feel everytime we are at yours!\" \n\nI mean, it's not even a lie, because as you said, the only not-so-good thing about the celebrations is the food... and you wouldn't mention it if you said something along those lines... :)", "Gravy belongs on EVERYTHING at Thanksgiving 😂", "I make the homemade rolls, dressing, everything from scratch I can’t make gravy. I have to use a packet. And my family loves it.", "I still vividly remember the disappointment of the one thanksgiving meal I’ve eaten that was from the grocery store.", "My ex was like this about food. I made homemade Mac and Cheese, which he hated, because his mom only made Kraft; he hated my chocolate pudding, with cinnamon and real whipped cream, because mom only made instant from the box... And he wondered why I let him do 99% of the cooking from then on. Also a reason why he's an ex.", "1) Four kinds of cranberry would be like a Thanksgiving Dream Come True for me 😆\n\n2) I’m on the East Coast in the US, and we typically have asparagus in grocery stores year-round. I presume the OP has similar access.", "When I used to live in my small town that was the case for asparagus, jow I live in the suburbs of a big city, everything is available all year round.", "I would compromise by letting them do part of the meal their way, like let them bring the cranberry sauce and the pie. Op could make another type of pie. \n\nOp talks about how important her memories are and the same could probably be said about the in-laws. My husband loves banana pudding the way his mother makes because it is a holiday staple from his childhood. I would never replace it. I love yams with marshmallows, he doesn’t. I compromise and do half with/half without. I love store bought desserts because pie is pie! Sometimes it’s okay to like nonhomemade things. \n\nIn the future, when MIL hosts, op can offer to just bring a side, bit a replacement for something the family obviously enjoys, but a new exciting dish. Instead of trying to “fight” them, maybe OP could help broaden their minds.", "No, actually they are much more financially stable than us.\n\nAs far as I know MIL was never taught to cook, and my husband, SIL and BIL grew up on microwave meals and box meals even with a SAHM. That doesn't mean she was a bad mom or a neglectful one (she is an awesome mom) just that she didn't know how to cook.", "Works great too!", "Yes i've done it stovetop and in the microwave. I think the recipe is on the ocean spray cranberry bag. I use less sugar if i'm using apple cider.", "agreed and you can say that you're going all out with the cooking because it's your way of thanking them for being such a welcoming and loving family, & a way to show your MIL how much you appreciate her doing all the work of hosting in previous years", "You are so right. I order food in for Xmas because I can’t stand missing the most important part of family gatherings…. Family", "Yeeeees!", "I think this a good idea.", "Yes, this.  Make it known you appreciate all the Thanksgivings she's hosted in the past, and that you just wanted to add some traditional foods from your past to share with the family you have now.", "Sure, I agree with the general idea. But if I was going non-traditional with my protein and cooking ham, I wouldn’t use that juice for gravy- I’d use a chicken or beef stock with a roux to thicken.", "I was never a fan of stuffing  either, until I found this amazing recipe that uses sourdough bread, pancetta, apples and herbs, etc and it's delicious!! If you want the recipe, let me know and I'll message it to you.", "i remember the massive disappointment my sis n i had when we went to a relatives home and they had a hispanic thanksgiving.  pork. rice beans. yuca.  i wanted to cry lol", "Ha, I'm the opposite. I grew up with Kraft and instant pudding, but I can't eat them now as an adult because they taste disgusting to me after having the homemade versions. It does keep me healthier because I'm usually too lazy to make the homemade stuff.", "This right here will make her feel good, like you are trying so hard to impress her, as opposed to putting her down.", "This is the way.", "That's even better than what I thought of.", "Could also include other traditions of theirs (OP references everything else being fun, is there any particular activities?) and mention she’s trying to make it “like MIL’s thanksgiving” “because I love Thanksgiving at your house”\n\nI would suggest in future years working to “collaborate” on the cooking… either you help MIL or share/swap recipes or have MIL help you", "I hope OP sees this!  It’s absolutely perfect.", "I love this comment so have this award.", "We start ours with stove top too, but mix sauteed celery and onions, mashed potatoes and bags of bread cubes. My brothers can each eat about 3 lbs of stuffing each, so we make two large batches to feed everyone lol.", "Our family did the same, \"presenting\" the cranberry canned jelly in a crystal dish! Nowadays I make homemade cranberry sauce and I'll never go back to canned, lol!", "My mom always made the real thing as well. This started out with the kids not wanting to eat the real thing, and the adults only having the time to plop the canned stuff in a bowl. It morphed from there.", "Be careful.\n\nAs with many things, food is not just food.\nYour MIL always hosting the Thanksgiving meal means more than just making bad (to you at least) food. It is a way of expressing love and care for her family. She welcomed you into that tradition.\n\nWhy do you say that you cook a 'proper Thanksgiving meal' the next day for you and your husband? Many people eat what your MIL cooks for Thanksgiving dinner. The turkey may be burned and the peas bland but the family is together. You are trying to recreate something that existed in your memories. That might have been your Thanksgiving tradition but it is not hers.\n\nYou learned to cook from your grandma, who taught MIL how to cook? Maybe she learned from her mom who was a terrible cook. How's her cooking at non holiday events? Have you ever had them over for a simple meal? The 'problem' with you making everything homemade (and you seem to revel in your perceived status as a 'great' cook) is that you are going to make your MIL feel small. She might be aware that she is not the best cook but you showing her up is not the way. Use the canned cranberry sauce, the kraft Mac and Cheese. Buy a pie in addition to making one. Think about how you would feel if your child's partner told you that your cooking wasn't up to snuff and she made her own version of Thanksgiving dinner.", "NTA. Maybe you’re overthinking it. MIL might seem sad/quiet because she knows your cooking is better, but that doesn’t mean she wants you to cook crappy food for her. Just thank her for always hosting, because it’s a lot of work, and say that you’re happy to return the favor this year.", "NTA. MIL needs to deal with the fact you are a better cook. If someone invited me for a feast and I did not have to do anything I would be happy.", "i mean, does she feel bad going out to eat at restaurants? of course not.  everyone knows they can't be good at everything, and most self-aware people know the things they're not good at.\n\ndo i wish i was good at painting?  sure.  do i want to badly enough to take time to learn and practice?  no.  does going to art shows make me feel bad about my inability?  not in the least.\n\nyour MIL clearly knows you can cook.  her feeling down about it is something she has to figure out herself, either accepting it, or trying to improve her own skills.  don't rub it in, but don't feel bad.\n\nNTA\n\n(personally i'd just pick one kind of mashed potatoes though.  lots of pies is one thing, but who really needs 2 kinds of mashed potatoes)", "NTA. \n\nLife is too short to celebrate with bad food when you have other options. There are a lot of concessions I'll make so as to not bruise the ego of someone else, but intentionally cooking mediocre food is out of the question.", "You cook what you want to and hubby needs to be grateful you are willing to do this for his family. If his mom is upset at a good meal, let her pout. You can't fix her immaturity. Your meal plan sounds delicious", "NTA. Your husband can help smooth things out by telling his mother in advance that OP is ‘very excited but very nervous about making a nice meal for you all, please be considerate of her feelings’ or something to that extent. MIL is a grown adult and can own her own feelings. Husband shouldn’t need to tip toe around to avoid a sulk / tantrum.", "NTA, but I would reduce some of the dishes to keep the peace if I was in your place. After all, you do love your inlaws.", "NTA. Maybe limit it to one type of mashed potatoes for only 4 people? But seriously, enjoy your first hosting!", "NTA. If I were you I’d start the dinner with a little speech about just how grateful you are to be in such a wonderful helpful selfless and loving family, give examples like in your post, and tell them you are grateful that you get to give a little bit back by cooking for them and that you poured you love into this meal. \n\nIf they have Anything negative to say after that then they are truly assholes.", "OP, help me understand. I read your menu, my best wishes to your MIL healing that wrist. What does your husband mean by ruining her day? Do you have to make shitty food to not hurt her feelings? He’s being a shitty husband and your list of dishes looks perfect to me. NTA at all", "You used to make stuffing with your grandmother, no reason to change that. If you add the Mac and cheese and a store bought pie or two you get to honor your mil for so many great Thanksgiving’s and honor your memory of your grandmother.", "Nta. Cook what ever you want. When they sit down to eat I would just say something like “I am sorry if the food taste a bit weird or differently to what your use too. My grandmother and I use too cook together when I was younger and all the recipes I know comes from her. So I mil I know your an amazing cook but I hope my food is to your liking. And hopefully next year you feel\nBetter and we can both cook together”", "NTA and unless she says something, don't acknowledge it. You are a speck of dust floating in the wind, unaware of passive aggression or anyone's unspoken discomfort. Talk endlessly about how happy you are to have them over, that you're so glad to repay the kindness she's paid you time and time again.", "NTA,\n\nI mean its a pretty basic Thanksgiving menu you have planned. Maybe just skip the two types of mashed potatoes that might be overkill. One should suffice.\n\nHowever, MIL and me would have had a strong conversation year one for the kraft mac and cheese. My cousin made that mistake one year and my family waited an extra hour to eat while my mom found a store and came back and made the good stuff. In my family that might as well be a deadly sin to serve at any family function only okay in the privacy of your home with no guest lol. Even then you got to answer to your household for even buying it. Homemade mac is easy to make unless you making your own noodles.", "Just cook it, and whilst you're all sat down eating, just say something like \"I wish this was as good as all the dinners you've cooked\" or something to really compliment her cooking so she thinks you're not quite obviously trying to outdo her 😂", "NTA \nI say make your meal. You are allowed to be good at something and allowed to make a meal along with your memories and traditions and not feel bad about it! Don’t dull your shine. You aren’t doing it for spite and she needs to be able to appreciate your gifts without feeling hurt she doesn’t have the same talent. Imagine if you were at a painting class and one of you was an artist and another one was not. Would you downgrade your painting and paint unhappy trees just to not hurt the other persons feelings? She needs to work on her self esteem and thats not on you. I’m sure she has some other great talents.", "NTA\n\nHowever, you want a chance to taste the thanksgiving you remember… What if that’s what thanksgiving is to your MIL. That could be her childhood memory shining through because her mom did it that way. Some people prefer canned or boxed. I personally LOVE the jellied canned cranberry sauce. Lean in a little.", "NTA, but to make an effort to make your MIL comfortable, skip one of the mashed potatoes, add Kraft Mac and cheese and sub the fresh cranberry sauce for store bought. Trade one of the pies for store bought, so one home made and one store bought.", "Phrase it as 'You've welcomed me into the family and done so much, including hosting Thanksgiving for so many years, I really wanted to say thank-you for all that support and do this for you'. NTA. There's nothing malicious in what you're doing, it's coming from wanting to feed your (new) family a great meal for a special occasion.\n\nETA also, burn something, like really badly. It'll take the pressure off.", "NTA- but your husband is . \n\nSo everyone has to eat crappy food because his mom doesn’t put the effort in learning better recipes? \n\nMake the best Thanksgiving meal any of them have ever had but be prepared for them to tell you it wasn’t any good to spare MIL’s little feelings of inadequacy.", "NTA. You’re just cooking. If she’s offended, that’s her prerogative.", "YWNBTA, it sounds like your in-laws love you. I don't know why they would be upset about you cooking them a good meal. They're only reasoning would be insecurity, and honestly that's an unreasonable thing, it wouldn't be your responsibility to cater to that. I don't know why your husband is being so insecure about it", "What's with these people who if they had a brain know they're cooking crap food but want to be praised for doing so? Cook what you want. I have no sympathy for people with such fragile egos. Especially with the plethora of cooking shows I don't know how anyone could not be aware of good food. Doesn't she watch TV?", "NTA. MIL is a wonderful woman, with lots of great qualities. So she can't cook. That's okay. No one can do everything. She can learn from you if she wants to, and you two and bond over it. After all, she just didn't have the same grandma as you. Instead, she has a DIL. But wouldn't it be lovely to pass that information to another family? Maybe she could sit with you while you cook and you could tell her your stories about your grandma. This could be lovely. People would just have to be open to feeling good. \n\nMake a great meal, treat everyone well, pamper your MIL, and tell husband good food is for sharing with the people you love.\n\nOh. PLEASE have some canned cranberry sauce on hand for them. If that's what you were raised on, any other kind just isn't right. We need those ridges!", "NTA. Time to rip the bandaid.", "He should be thankful!", "NAH. But get her involved somehow, asking for her advice on decorating, lighting, anything really. If she looked after you for four months she clearly is very caring, so you could just say you're nervous and get her to encourage you. Everyone likes to be helpful, and I think it's really sweet you've noticed its something she feels a bit sore about. Do you know what her favourite part of the meal is? E.g. if its cranberry sauce introduce this as \"MILS cranberry sauce\". Idk, you know this woman, pamper her is what I'm saying.", "If you force feed your mil food I could see where the AH vibes would come from but I'm sorry hurt feelings are ridiculous and not valid enough to dumb down a beautifully handmade Thanksgiving dinner.\n\n\nYour MIL and your husband need to rethink their mole hill-mountain complex.\n\nNot the AH OP", "NTA. But I suggest also including canned cranberry and some boxed mac & cheese. Both are super easy, some folks do actually prefer the canned sauce, and combined they cost less than $5. This will bring to the table their traditions.\n\n\nDid you ever read the meme? Repost? Whatever there's an ancedote going around social media written by a foster mom talking about her foster kid eating raw ramen noodles. She offers to cook them, but he wants to eat them plain because it reminds him of his roots.\nNow that post is surely more heart wrenching, but it speaks to how the *food* itself is what holds the memories, not the quality or preparation.\n\nIncluding two, easy, affordable, small bowls on the table, foods from *their* tradition will help them feel seen and validated.", "NTA.  Why some women get so funny about other people being better cooks is beyond me.  I mean surely your MIL knows she sucks at cooking, so there are probably a lot of people she knows who are better cooks.\n\nSince you are close to your MIL (aside from this cooking thing), maybe find a way to start teaching her how to cook.  Start small by inviting her and FIL over for dinner sometime and cooking a dish you know your MIL doesn't know how to make and have her help.  Some people are afraid to cook because they don't know little things like how to measure ingredients or how to peel a potato.  See if you can find a way to start teaching her.  Talk about how lucky you feel because your Grandma was such a good cook and she taught you a lot about cooking so MIL doesn't think you are just some natural talent.  MIL may realize she just didn't have any good cooks around to teach her like you did.", "NTA. But maybe take ask your MIL her opinion about the menu? Would she like you to cook the same foods as other years to keep the tradition or would she rather you cook some different items she can help you pick out? That way she can feel involved.", "If having good food to eat will hurt her so badly she should’ve put more effort into cooking and not just throwing boxes and cans into pots. NTA enjoy your homemade food.", "NTA. Maybe you can present it to your MIL about how you were so excited to do your first Thanksgiving and you want to go all out to impress her?", "NTA, but perhaps suggest something that your MIL could bring that she doesn't have to cook?  It would obviously not be as good as your homemade dishes, but she could at least feel like she participated.", "NTA. Tell them how excited you are to share some of your traditions with your grandma growing up and how you wish they could have met your grandma. Tell her that it means a lot to you to be able to share these dishes with them as they come from a sentimental place.", "I’m torn on this.  People like to eat good food and it sucks that everyone walks on eggshells about your MILs poor cooking.\n\nHowever, your comments come across as kind of TA because you have shot down a bunch of reasonable suggestions to the point that it does lean toward you wanting to show off.  \n\nYou don’t have to make crappy food, but also you won’t acknowledge that some of the options your MIL makes are nostalgic for your husband and his family, just like you have an emotional connection to the food that you made with your grandma.  Lots of people (as you see in this thread and the askreddit threads on this topic that pop up pretty frequently) have a soft spot in their heart for Kraft Mac and Cheese and canned sauce, among other “non-gourmet” or cheap foods.\n\nThings you could easily do but seem to refuse to:\n\n1.  Include your MIL in cooking something the day of.  Surely there will be SOMETHING left to do.\n\n2.  Include some of the options that your ILs usually have, like the canned sauce or Kraft Mac and Cheese or peas.  Make the cherry pie and allow a store bought pumpkin.  Let your husband take the lead in this or ask your BIL/SIL to bring.\n\n3.  Streamline your own menu.  Two types of mashed potatoes or two pies or three types of veggies might be overboard.  Combined with number 2, there’s no reason why you can’t make ONE “fancy” option and have your ILs responsible for their option.\n\nYou say Thanksgiving is about family and it sucks that your own family isn’t around, but you’re definitely putting out the vibe that it’s your time to shine.", "YWNTA - that is a Thanksgiving dinner and you like to cook so everyone should just be happy and enjoy the nice meal. Just be humble and don’t make a big fuss and you are fine. If MIL gets offended or upset then that’s really not your fault. She is an adult and she should have the capacity to understand that it’s not a competition, it’s a holiday and it’s supposed to be about family getting together.", "INFO Can you husband cook? Can he pretend that he made the meal?", "You could lose one of the mashed potatoes, and the asparagus. Add canned cranberries to the table (my family loves both), and do the Kraft Mac n cheese. That way, she’ll see that you aren’t trying to make her look bad, just adding some of your own family recipes to hers.", "NTA that sounds like a pretty standard thanksgiving. Maybe get her included in other things? Can she plan a game to play?", "NTA My first thought was to have her help but you said that won’t work. Can you video chat with her through part of it?  How about damaging one dish (sorry that’s stupid)?\n\nIf not then trust her to be the adult she is.", "NTA do it up. Go all out!!!! She can be hurt,but who wants bland dry food... nobody!!!", "I would just say to her how honoured you are to cook for them this Thanksgiving and how you now get to thank them, through your cooking, for all the wonderful things they have done for you and your family over the years. Food is love and you going all out is proof of that.", "I’m sorry, but CANNED cranberry sauce is not negotiable!  AND it has to show the beautiful molded can dents!  It’s not thanksgiving, otherwise!", "NTA.\nBut make sure to tell your MIL you choose to cook this way to honor your Grandmother.\nAnd I read a lot of advice to include her in the hosting part, that is something else I would also do if I were you.\n\nGood luck figuring it out. And wish you and your family a wonderful holiday", "Well as someone who prefers canned cranberry sauce to fresh maybe scale it back a bit.\n\nYou know your ILs better than anyone in this thread, you know what will hurt their feelings and if thats worth it to you. It doesnt matter if we think youre showboating or if we think mil is too sensitive.\n\nNAH go with your gut. Maybe in future years offer to bring dishes to your ILs thanksgivings, get them acclimated slowly to a thanksgiving meal that doesnt suck", "I understand your predicament but just make basic foods as well as you can.  Resist the temptation to worry about presentation or plate appeal. Just make basic fare but make it well. You WNBTA in my humble opinion.", "Maybe cut down on a side or two and only do one mashed potatoes. Otherwise, you can't be blamed because you can cook. Just present it nervously and say \"I sure hope it is as good as yours\"", "I would do a toast or her hosting abilities (being a good host is about more than cooking). And perhaps you guys can marry the two experiences next year.", "NTA MIL can watch you and maybe learn how to cook properly without it being rubbed in her face", "NTA. Shine in the kitchen at Thanksgiving! Make no apologies for being good at something! 🦃🌽", "Lmao no you wouldn't be TA for being a better cook than your MIL. If she cared that badly she would make the effort to be a better cook lol", "NAH\n\nThis may sound weird, but how about planting some empty Boston Market bags and pretending to have purchased some food from there?  That way they'll think you weren't trying to show anyone up by making everything homemade, etc.", "Yta because you want to out do her. You said your mother in law is a good woman who loves you so why be petty? The way you described everything about her food so negatively that tells me she cooks better and you're just jealous.", "NAH- but your husband is right. It's definitely going to make your mother-in-law feel badly. Has someone who loves cooking. I know how exciting it is to share what you love with the people you care about. In this case though, less is going to be more in the end when it comes to the overall experience. \n\nBut I support some catch up. Do turkey, one type of mashed potato, either the asparagus or the green bean casserole but not both, gopher canned cranberry sauce, boxed mac and cheese, corn, and the rolls.\n\nThe meal you have planned is undoubtedly amazing, but your mother-in-law might feel like you were making an effort to show her up.", "Even if she was, WHO CARES??! If it's what she LOVES to do, she has every right. Cooking like that may make someone feel good and make them feel like they are spoiling their loved ones!! Nothing to do with showing off! Only jealous, immature people with unnecessary large egos would think that. Be appreciative and recognize we all are different and have our own strong suits and that's okay!! No one should ever little themselves to make a person, who needs to maturely do some soul searching to be secure with themselves and learn to appreciative others instead of being awkwardly jealous, feel \"better\". I promise you, it won't make them feel better either because they will always have an issue with insecurity and making other great people feel bad for no reason. We are all great in our own way. Maybe she needs to have some extra reassurance from her husband, but nothing else is anyone else's responsibility.", "And maybe that it’s a way to say “thank you” for all the years she cooked for you.", "I know it's crap, and I love home-made as well, but something about that jellied tube of cranberry goop makes me happy. It was actually the only not home-made thing at my family Thanksgivings when I was a kiddo.", "That is a classic ham preparation. Are you a youngster? It was all over the place back in the day.", "It's still possible to invite her to the kitchen to help you with final taste tests. Get her involved somehow even if it's for a few dishes. No reason you can't compromise and include some of what she provided before, like the boxed mac and cheese or canned sauce, especially since those involved shared memories for your husband and FIL.\n\nHeck, if she's open, share with her your love of cooking, the memories you have of Thanksgiving and how you'd love to form new (cooking) ones with her moving forward.", "She can make the cranberry sauce, that’s easy. My kids make the sauce. You just need one hand to pour and stir.", "That's disgusting. Telling her to LIE and eat disgusting boxed mac and cheese??? Her guests who know better will also be widely confuse. And I can just imagine this lady serving boxed mac and cheese every time exclaiming to everyone it's OP's favorite🙄 This helps NO one to grow or bond properly, just feeding someone's immature ego who doesn't want to learn better", "LOL this had me dying. My MIL sounds very similar to yours in terms of cooking abilities. For quite a few holidays I secretly cook a version at mine and my husband's house, but always go on the actual days to their home and spend time with the whole family.\n\nTwo years ago I tried my hand at homemade cranberry sauce and brought her a little to try, last year she requested I bring it to Thanksgiving for everyone.\n\nMaybe have a conversation along the lines of 'I know it's not your version of Thanksgiving, but this was mine growing up, I hope there's something that you enjoy enough to let me make again next year'\n\nIt feels like she might be insecure about how good your cooking is, but is just set in her ways at this point.", "Is part of it an economic thing?  Cooking well costs a lot more $$$ than store bought pies and boxed mac and cheese.", "exactly. talk to mil prior.  maybe ask her for ideas on what to make so she feels involved. and tell her not only bout grandma but you want to do this for them!!", "Oh okay so she is actually insecure. It's still not your responsibility to cater to that, it's her responsibility as an adult to work through that", "But people can compliment her food and eat it and enjoy it just fine😒 Goodness she should be appreciative she is being shown love through a delicious meal! You eat her food without being snobby, she can grow up and do the same. She could ask for tips or just appreciate you both have different strengths JUST LIKE EVERYONE ELSE in the whole world and not let it bother her. She's allowed to struggle with feeling insecure, I know I do sometimes but we cannot take it out on our loved ones!!", "Which is more important to you?  Your MIL's feelings, or food?  Which is going to matter most in 5 years, your yams, or MIL? Can't you decide which 3-4 dishes are the most important to do well, and then do the rest like your MIL?  It doesn't have to be black or white.  You don't have to annihilate the poor woman, and you can still have a (mostly) enjoyable meal.", "What if you swap out Turkey for ham or some other meat so there’s less of a direct comparison? Would that be appealing for you at? I don’t think you should have to do a worse job to not offend her.", "\"Full Southern\" makes me think perhaps it would be better if you made the dinner as different as possible from what your MIL normally makes. For example, fry or smoke the turkey, switch up the sides so none of them match what MIL makes, etc. That way you're not making the same things as she normally does. Maybe even buy a premade turkey from a local restaurant or caterer. Might make her think you \"weren't comfortable trying to do as good of a job as she does.\"", "No you wouldn't have been an A H. You would  have been lovingly spoiling your family and showing them something different and delicious!!!", "Good lord you sound conceited, I'm sorry. As god is your witness? My eyes rolled back in my head and I can't see anymore. Just ask her where she buys the stuffing, the cranberry and the potatoes salad. Then forget the asparagus and keep them for your fine palets. Cook the turkey so it's not burned. Do your beans casserole and a somewhat better mac and cheese. And voila. You did not insult anyone on Thanksgiving and actually make it about this family tradition, not your own little pride.", "Why not ask her to provide the pies then? Yes they won’t be homemade and come from the store but it’ll be the same as everyone is used to and you can shower MIL with thanks for taking care of dessert", "Ooh, sounds interesting!  I watched a video the other day on YouTube where someone breaks his turkey down before he cooks it.  That looked interesting as well.", "Traditional??? You mean toxic, plastic tasting boxed foods?? I would never do that to my family just because someone else does!", "Mmmmh.  I don't have an opinion on mac n' cheese, but homemade cranberry sauce is trivially easy and delicious.\n\nThat said, some people prefer canned and it might make sense to have some of both.", "Yeah no. Stop babying grown adults and minimizing yourself because someone is OVERLY insecure and has no interest in learning better. Being sensitive and empathetic is one thing, coddling and changing what you love to fit yourself in someone's jealous box is not helpful to themselves or that insecure person.", "My husband only likes the canned cranberry sauce. And he prefers it to still be can-shaped. 🙀", "No! Stop pandering to someone else's immaturity! Too type of mash is for preferences of others🙄🙄 not showing off", "Indeed, if you're going into an encounter and you find out no matter how you participate in it you're going to be screwed, it is a strategic retreat to not participate", "Ooh yes!  That would actually be a great way to frame it...\"mom, wife is very nervous about making the food as good as you do,  could you try to not react negatively?\"  Then mom gets to feel good about being generous", "What's traditional about unhealthy boxed meals that taste like plastic? This an American thing??", "That's cringe, \"weren't comfortable as trying to do as good of a job as she does\"??!! Who says or suggests this as normal, healthy behavior??! What on earth", "You sound bitter. She was being honest. Is it HER pride or the immature MIL with an jealousy and ego problem??!! NO, it's OP's turn to host so why on earth would she make the SAME things the SAME way??? Why stifle her love for cooking and spoiling her family with delicious food because someone else has issues they need to work out?? If MIL was writing this post from her point of view, y'all would be telling her to get a grip and stop being jealous and just be grateful and appreciative, maybe even telling her to ask for tips and help next year or just accept that we all have her own strengths and be secure in them!! OP shouldn't belittle herself to fit into someone else's box of fake mac and cheese lol It's not about showing off and competition (unless that was her know reputation about things), and any friend or family has love for her and themselves wouldn't assume such a silly thing! She knows how to cook (basic homemade food might I add, y'all are so odd to think this is abnormal),  loves to cook, and loves feeding her family good food and that's a GREAT thing!! My goodness.", "This is so basic knowledge, idk why everyone is making such a big deal about her cooking normal, delicious, homemade meals and it's not CHAINING yourself to a stove if you love to cook and love your family.", "That is an interesting conversation and I think it's one that they should have, like if they do want the jelly cranberry sauce. But currently the conversation is that the mother-in-law is insecure cuz she's a bad cook, so her husband wants her to dumb it down so that his mother doesn't spend the entire day sulking as she has done before", "We do both canned and home made . \nCanned because an uncle’s girlfriend will be upset without it.\nHomemade because my aunt can’t eat the canned . \nEveryone’s happy. Everyone has their traditions. Done.", "IL’s probably don’t want to drive that whole way just to have to sit and wait for the food to then be prepped, cooked and then finally eaten. They’re gonna have 8 hours of driving to do that day back and forth so they’re most likely going to want to arrive when they food is ready to eat so that they can just visit and then leave.", "Yes do this. \n\nCook what you want but totally give your MIL compliments throughout, like;\n\n“I know it’s not as cosy as when you host, but I’m just glad I get to help you out this year…”\n\n“I’m so happy you made it here safely, I wish you could have come down earlier, I would have loved for you to join me in the kitchen, to keep some of the magic Thanksgiving at your house always provide” \n\n“Puu, I never considered the amount of work you do for us every year, please tell me if you ever need a helping hand or for me to bring anything next year, you always do so much for us, and having done all this this year I really appreciate it”\n\nAnd if there is traditions of games etc. MIL normally does keep them and let her instigate them like normal. “To keep as many family traditions as possible”\n\nAnd it’s okay if you and hubby don’t go overboard in complimenting the food, you know your worth don’t rub it in, and I sense that’s not what you want anyway.", "What about it makes it \"super fun?\" Maybe acknowledge that before hand and ask her to be the \"event hostess because the atmosphere is always so fun at your Thanksgivings\". Let her have some role in something that everyone can compliment.", "Can you ask her for helpnwith planning decorations or activities or plating or something?", "I make everything from scratch even during the week. But if a friend would like that for comfort food I will do that for them. That doesn’t mean I have to eat it. As a hostess you try to make your guest comfortable", "I think having both feels like a comparison...  I think picking one or two dishes that she can make just like MIL does, would go a long way here...\n\nnot to mention, my mother makes a pretty basic Thanksgiving, but it's what my father and brother are used to.  If we ever hosted and cooked a bunch of elaborate, homemade food, my Dad would be asking after the boxed mashed potatoes and where the Pillsbury Cresent rolls are, because that IS Thanksgiving to him.", "That’s a caustic take. Real life does not work like that. You sometimes have to accept and accommodate less than stellar characteristics of a loved one. Nobody’s perfect. Ywnbta but I agree with the suggestion of boxed mac and cheese and/or canned sauce.", "I’m so confused why there is even a problem here, and I’m someone who places a lot of importance in cooking/entertaining. \n\nThe cook and venue changed; obviously the food is going to be different. This is not a big deal. They all seem to get on fine.", "Lol. I thought of that just as I added my comment. I should've written vegetable tray.", "lol, take my poor person's award 🏅", "Girl no! NTA and don't belittle yourself to cater to someone else's immature insecurities or ego. If she was a loving person and knows YOU ARE A LOVING PERSON, she would not assume the worst of you. She has the right to feel bad but that's something she needs to work out internally or with her husband to help her grow more self esteem. She should be THANKFUL and appreciative and and realize we all have our different strong suits and she is still loved!! She could ask for tips too instead of letting her ego make you feel bad. Those suggesting you lie or buy toxic, plastic tasting food in lieu of you making a wholesome, traditional homemade meal with love, is asking you to put a bunch of bandaids on a deeper issue and won't truly draw you two closer together, only superficially and based on lies. If you're MIL wrote this post from her point of view, reddit would be telling her to get a grip! So many stories like this and they never ask the OP to downsize themselves for an insecure person as long as it's not obvious mental competition and degrading behavior going on.", "That doesn't sound like a bad compromise.  You can do your all-out 100% amazing from-scratch Thanksgiving meal any other day of the year.  I usually do one in July.  Lots to be thankful for!", "Is there a chance he is trying to shield you, not her? He’ll know his families tastes best and there might be a chance that they don’t like the taste of home cooked stuff (this is a genuine thing that happens when people eat store bought all the time) so he doesn’t want you to feel unappreciated when no one touches the asparagus or someone pulls a face at the pie?", "So high sodium? Yuck! That's why I never do that bean casserole! Store bought pies are crap. How about you bake them in throwaway tims, so people THINK they are store bought?", "I do that and add cinnamon and a bit of orange zest", "Hmmm, was I just mansplained? I mean, was an explanation really necessary? I suppose now you will reply with a definition of mansplain and an explanation of why an explanation was necessary...", "Um no? Why lie for someone's ego?? She should feel good about being appreciative and grateful, not having her family feel so guilty because of her own insecurity that they need to loe and stroke her ego", "Oh this is actually a better suggestion. Do that. Don't hurt your MIL because cooking. Who cares about that.", "All I meant was it's her holiday too, she should allow herself time to relax and not do too much. Also, everyone is making a big deal because it sounds good. Maybe it is simple, but it sounds good. Chill out.", "Yes, exactly!  Simple solution, everyone is happy! I love this, and it's so not an issue", "In our family we are obsessed with games at holiday events so if this were our family I would ask her to select games and order of play, choose the teams, direct the kids in setting up the game tables, and basically lead the games. Then she has something to be doing and feel needed. This is all about her feeling needed.", "I agree with that but this is totally different though. She is making a meal for EVERYONE, not just to cater to one person who is insecure. It's not that those box meals (that you can literally make in two seconds with one hand and eat any other day) is her comfort food, it's just that's what she cooks for whatever reason (convenience, not being a good cook, being too self absorbed to ask for help etc). I bet you her MIL loves her homemade food, she is just jealous it actually taste good and that's toxic and immature that she is making OP feel bad and guilty because of that.", "Well said. This isn’t the chopped kitchen, there’s nothing to win or gain.  \n\nMy FIL fancies himself a grill master but his steaks were always well done.  When we hosted I busted out the meat thermometer and had perfect med-rare filets.  Turned out, FIL knew how to grill the whole time but his family just liked it their way.  I had to go put them back on for a few minutes. \n\nPeople used to eating boxed, canned, premade foods often are used to so much salt and sugar scratch food can taste bland.  Mashed potatoes could be too chunky compared to the boxed mush they like. There’s a future version of this where OP goes all out and nobody appreciates her food (even if it’s objectively better). \n\nAt the end of a good holiday, everyone goes home happy.  OP can cook one hell of a meal and be really proud even dialing it back 25%.  Husband should help identify traditions his family really likes (Kraft Mac or Canned Cranberry) and include those.", "Real life DOES work that way if we stop babying stunted adults! What is this teaching OP? That the one time she gets to host and show her love the best way she knows how, that she... shouldn't?? Because of someone selfishly making it about their own insecurity they need to work out?? This is her home and what she makes reflects on her and her heart. When you cook from the heart, you would never make boxed food for loved ones and you would be hurt if your adult family was unappreciative JUST LIKE OP'S MIL would feel just as hurt if OP reacted poorly about her boxed foods because she's used to something else🤷‍♀️🤷‍♀️🤷‍♀️ OP has enough respect to eat it, appreciate it and not be weird, so can this adult MIL who is just jealous. Jealousy is toxic. So is telling OP to minimize herself for toxic behavior and serve toxic, bland fake mac and cheese🤔🤦‍♀️", "Wait what's wrong with canned cranberry sauce?", "Hurt her because of cooking?? Sounds like the MIL has issues not OP🙄🙄 Do y'all hear yourselves??", "But she knows that? You don't need to remind a grown woman that lol. Lots of cooks find cooking relaxing and exciting. It's not about her getting compliments on the good food I was referring to, it's the \"tWo mAshPotato dishes??! Omg too much and this and that\" is what I referring to; like chill people, it literally is not as complicated as y'all are assuming for some reason", "Y'all make me chuckle. I don't understand why someone wouldn't just be appreciative for one and ask for tips for two! Now you have your love ones having to dance around you and sound overly patronizing🙄", "This is a great comment. Keep pointing out how you are just trying to be as welcoming as they have always been to you and that you want to spoil your MIL since she has always been so gracious.", "The diplomacy and social skills here set an example for us all", "This should be top comment. It’s perfect.", "Yeah and the EVERYONE she is making dinner for are all folks who are used to eating MIL's cooking...  which means they may very well prefer the canned cranberry sauce and react poorly to homemade.", "I legit made my own cranberry sauce one year. It was a lot of work and not worth the effort. Canned is just fine.", "Maybe that's an pain point for her: she knows she can cook and it make it feel like insecure.\n\nIt feels like a good idea to share with her this change in menu and what it means to you, and maybe ask her if she wants to include something from her traditions or ask her if she would like to bring the desserts or similar, with a white lie that you love them so much. \n\nI know this sub most of the time has a \"other people's feelings don't matter if I am right and they have to deal with it\", but sometimes people are people and we have to got out of the way to protect their feelings even if they are not right per se.", "By your response I’m going to assume you originally meant you “never heard of gravy FROM ham.” Changes the context of your comment. I also would use beef, chicken, or turkey gravy. And that belongs on everything :)", "Yes this is perfect. Perfect.", "💯", "Who cares??! They are GROWN adults in someone else's home who is showing love and care!! She should be able to make what she loves to show her love! Not minimize herself to gross food to accommodate immature toddler adults with poor palates. They will either appreciate it or not and that's on them! And you're ASSuming they won't like it, which does NOTHING for OP's self esteem to at least try and see if they like it. This is sad. Any other post where someone is jealous UNNECESSARILY about someone else's strengths, styles, or looks, we never ask that person to change but help the insecure person to seek help and look inward because otherwise that person will always be a brat about normal things. Let's not put bandaids on deeper issues and tell other human being to minimize herself for other who need to work on their insecurities, appreciate their own strengths and those of others. If this was OP's MIL complaining about her good cooking, y'all would not be bashing OP or suggesting she suggest OP change for the worst but for MIL to grow up for the better.", "No, I also admit that while I would be putting gravy on potatoes and stuffing, I wouldn’t be putting it on the ham itself. I dunno, I’ve just never gravy’d a ham.", "Actually, although I do homemade cranberry sauce, my daughter loves the \"can shaped\" sauce and we have it too.", "I like Stove Top stuffing better than anything else I've ever had.  Better than restaurants, homemade, and more expensive boxed stuffings.\n\nI add Jimmy Dean crumbled sausage and onions.\n\nMaybe because that was what I had growing up.  My mom was a great cook and had homemade dishes for a lot of our Thanksgiving feast.  But she only used Stove Top for the stuffing.\n\nI also like cranberry from the can, better than homemade.  It's a stronger cranberry flavor to me.  I eat it as a lower calorie dessert, year round.", "INFO have you considered a compromise? Do the box stuffing, Mac and cheese, and canned cranberry sauce. Those things in particular would be a decided olive branch to MIL, and I can tell you personally I have had thanksgiving dinners with multiple families who are professional chefs, and I invariably end up having to go home and make my own thanksgiving out of boxes, because that's what I grew up with, and that's what thanksgiving tastes and feels like.", "I think it would be sweet if you invited her over to design a menu and you can tell her all about the memories so she can be part of it too\n\nAnd if it works for you, maybe invite her early, drink some tea or coffee while everything is cooking and before everyone arrives, just so nothing takes her by suprise:) \n\n\nI don't think a judgment is necessary.", "NTA- Husband and family are if all the care about is the food at thanksgiving. Thanksgiving is a time to visit and be thankful with family and friends. You could serve spaghetti if that's what you want. MIL and husband need to stop being petty about the food, when they go to a potluck and someone else brings a similar dish do they pout about how other people think it's good. You should be proud about being a good cook not hide it. Make whatever you want its your thanksgiving and you are cooking. If they are that petty watch out for them ruining the food by adding things to it. If you truly want to extend an olive branch, when someone compliments the meal say thank you, and if she seems upset or sad you can say something about how good at XYZ she is and your not. (only do this if the situation warrants it, as some would take it as you saying their cooking sucks.", "The other comments on this thread say it all . You want to collaborate, not compete. You can make the food and still make the holiday about family.", "NTA and make a lot of genuine self deprecating remarks (“oh I *wish* we could have done it at your place. I’m so sorry about your wrist but thank you so much for allowing me to *attempt* to return the overflowing hospitality you’ve always shown me. I can only hope this will hold everyone over until next year, though I know everyone’s preference would have been at yours over mine. Let me pour you more wine, MIL.”)\n\nSide note: this woman is likely in her fifties at least. If she hasn’t learned how to 1) cook better, and 2) regulate her own emotions beyond sad/jealous when her cooking is clearly subpar, *it’s not your problem*.", "YWBTA.  Its human nature to want to show off.  Your husband already knows you're a great cook.  Why rub her face in it?  It will just make her sad or embarrassed, upset your spouse, and spoil the day.  Possibly even future thanksgivings.  Tone it down a bit.  It will still be a nice meal.  Listen to your husband's concerns.", "Nta. So you're supposed to make a shitty meal so MIL feels good about herself? What the actual fuck? That is a new level of selfishness on MIL's part. Wow.", "NTA - but be prepared to host every Thanksgiving and doing all the cooking from here to eternity.  Best be prepared to follow through for years.  Seems only fair.  Maybe ask MIL to be company while you do this, so she can pick up some tips and tricks along the way.  Share the knowledge or carry the whole load, I say.", "NTA\n\nBut why don't you guys communicate?\nYou should get one on one with your MIL and tell her how awesome she is and how much you love her, feel accepted, appreciated and loved.\n\nTell her that you noticed she looks a bit sad when she eats your cooking. \nIt's not her forte and that's ok! \nI'm sure you have your own shortcomings.\n\nTell her that you'd really love to have the opportunity to let them experience the recipes your grandmother taught you.\n\nShe gave you so much and that would be your opportunity to give a little back.", "NTA. I have similar feelings about my MIL's cooking. But some people genuinely prefer canned cranberry sauce.", "NTA. You love to cook (and you're good at it)?!?!?? You should cook and enjoy!!!! If there was a family sing along, we wouldn't ask the best singer to do no better than the worst. Why should it be different with cooking??? It is just a different talent.", "Unpopular opinion: YWBTA\nAs someone who is estranged from my family and also has amazing in-laws, this post makes me cringe a bit. \nIt’s great to be so proud of your cooking! I also love to cook and feed people. Maybe it’s the title that’s offsetting to me? “Outdoing” your MIL. These people have given you a family. Why would you want to outdo your MIL, knowing she would feel bad? She’s opened her heart and family to you. She didn’t need to do that. I’d listen to your husband (he knows his mom well). Don’t ruin a great relationship with people who love you, just so you can show off. \nThe intentions don’t feel pure from your post. I apologize if I read it wrong.", "NAH. You're not wrong to miss your traditional foods and not wrong for sharing them, but I also don't think your MIL is wrong to have sensitive feelings about it, she's probably very aware that what she has been cooking up is not exactly gourmet fare. She probably wishes it were different. Maybe she just never had as much time or energy needed for it? Sometimes, food quality takes a hit in favor of time and energy to spend on the big/important stuff when the kids are growing up, and it eventually becomes the norm and what's comfortable for them (relatable, I looove the boxed mac and cheese as a comfort food). As long as she's not mistreating you, she's not T A for just having the unhappy feelings. \n\nI would do my best to be sensitive about it and make it a bonding moment, if you can. Whenever I learn someone relies a lot on the quick and easy foods, what I tend to think is, \"These foods are at the very least good money/time-savers, and cooking that way meant that they were focused on providing adequately so no one went hungry while also leaving them time to be emotionally/physically present in other ways.\" If that's the case with their family, maybe have a really nice heart-to-heart with MIL about how much they mean to you, how thankful you are for the quality of son she raised and for the relationships you have with everyone and how this meal you're putting together is your way of thanking them for making you a part of their family?", "Nta cook your dinner. She could easily make an effort to not serve horrible food.", "NTA - it’s insane to me that MIL might now be able to accept other people can cook better than her and that your hubby feels the need to have you dumb it down for her. What you could do to lessen the fall out it just accentuate that you love love love cooking as much as you love love love your in-laws and you just wanted to express your love for them since they are unable to host this year, which is something you know they love doing. Make sure they know it’s an expression of love and appreciation for all the other years they put in the hard work and not you trying to one up MIL.", "NTA. Cook a nice meal and enjoy it.", "NTA - you’re doing the family a kindness by giving them food they will actually be thankful for", "NAH I would make sure to have some of the jellies cranberry sauce on hand  because once you’re used to it the other stuff just isn’t the same", "Nta. You aren't going too far. And most of things you're making are different than what she serves. \n\n I would suggest buying the canned cranberry sauce just in case. I have a few family members who won't eat the homemade and actually prefer the canned.", "She may not bevthe best cook but lives her family and wants to get them together, cook for them an suggest next year you work together to lighten the load on each other.", "NTA. If your DH bullied you out of your plans, THEN YWBTA. You have a gift/talent/passion. Let it be alive! Your MIL may surprise you by being thrilled with what you do. Give them the chance!", "Im aussie and dont celebrate Thanksgiving but I thought the holiday was about being grateful for what you have and shouldn't OPs husband be thankful for a wife who can take on the stress of baking for his family and shouldn't OPs inlaws be thankful for their son finding a woman who loves him and his family enough to step up and make sure the family can still get together? NTA by the way", "Only things I would change is the cranberry sauce, stuffing and asparagus. The sauce in the can is lovely as well and they may prefer that to the homemade version. And they like peas so provide a veggie they like. Boxed stuffing is a taste many who grew up with prefer over homemade. \n\nPart of being a good host is catering to your guests as well. It’s not difficult to make a few dishes how they like and some how you like. \n\nYWBTA if you didn’t compromise a little and be a gracious host.", "**Order Thanksgiving Dinner from your local upscale market.**\n\nThen no one in the family has cooked the meal. \n\nSolved!", "Do it but say you ordered from an online store like harry&David. Tell them you got overwhelmed and just couldn't do it", "Your cranberries and canned cranberries. Your garlic mash and her box mash. Your pie and a store pie. If his family really likes MIL food, give them something as the hostess. Or don’t, and potentially ruin relationships.", "NAH \nBut, be prepared for people to prefer thanksgiving like your MIL has done it for years. Sometimes the memory is more important than the food.", "NTA Minnie don’t burn the chicken and neither should you dumb down Thanksgiving dinner because your MIL is threatened you are outdoing her. Why can’t people be appreciate instead of jealous and insecure? Prepare a wonderful dinner, be a gracious hostess, be attentive to your guests and she can get over it.", "NTA. Just make the dinner and get ready to host forever.  I don’t even think MIL will be mad at you your skills.  If she is making Kraft Mac and cheese she knows.", "Just don't forget to add Mac n cheese and the peas as well. - NTA \n\nBut you might be if you exclude all of her \"favorite\" dishes...! Maybe she truly likes those things for all we know that may have been her own special memory.", "Nta.  I would frame it like this is the tradition I would like to share with you all.", "NTA Instead of allowing it to slide into a competition why not address it as having the opportunity of sharing very special memories, of your grandma's receipes with your new family.  As a thank you for the way in which they embraced you into their family as one.  (This is where you ham it up a bit) Go on to explain your Grandma's love message was sharing food with loved family members, was the gift she passed on through you.  \n\nYour mil won't arc up on that, when you serve the dishes talk about when your grandma taught you to make it.  The times you shared with her and how special it is for you to do the same with them.", "NTA. Tell her while you are sorry you cannot replace the family memories from past thanksgivings, you are glad to help out by cooking. And enjoy the food.", "You could always try a Turkey fryer. That way it’s not cooked the “normal” method and thereby not directly comparable to her cooking. 🤷🏻‍♀️ And maybe she will like it and pick up that method.", "NTA, but maybe ask her for one of her recipes? Like, the least offensive dish or dessert that she makes. Maybe say something like “it wouldn’t be thanksgiving without your (insert dish here)”?  Or say that you’ve been craving a specific dish of hers. Then rave about it at dinner or mention how your so glad she gave you the recipe. If she truly is a lovely MIL, then it wouldn’t  hurt to spotlight her in this way.", "Not the ass. She broke her wrist so she can’t do it so you offered to help that’s nice considering most people don’t wanna host cause it’s a lot of work. Maybe have her come over and you can show her how you cook and drink wine and talk (most women like that) so that could be fun", "NTA you aren't trying to hurt her feelings. But you want her to enjoy her day too. Maybe ask if she has any recipes she would like included? Make some Kraft mac and cheese. Just keep it simple so she doesn't think you're trying to show her up. Maybe ask if she wants to bring the pie.", "NTA.  If mom can't deal with someone else being a better cook, there are other problems.  BTW, if she begs off, can I come to dinner in her place?  Menu sounds terrific.", "NAH\n\nI think everyone here is trying their best - but I think your husband’s approach is wrong.\n\nI don’t think the way to deal with feelings of jealousy or sadness derived from comparing yourself to someone else is to tell the other person to make themselves smaller. \n\n> I just want a chance at a Thanksgiving that matches my memories\n\nAnd you should not only have that chance, you should have that support. \n\n(But I will absolutely defend cranberry suauce from a can lol)", "NTA and would be great if your husband would talk to his mom rather than tiptoeing around her. He can emphasize how much you love to cook and share the recipes you grew up with with the whole family. That it’s important to you and him that she really enjoy herself and not get upset.", "Share your menu with MIL and ask if there is anything else she would like to see. IOW, don’t make it a surprise. Or a competition.\n\nBTW, I know exactly what you mean. My mom was a horrible cook. Growing up, I never had a good meal unless we went to a restaurant. I was super surprised when my wife and I got together. She is a terrific cook! She and my mom got along great. Mom was always happy to eat here, although I’m sure she knew her cooking could never compare.\n\nHappy Thanksgiving!", "NTA outshine the bad cooks but do it quietly.", "NTA. Absolutely make your incredible meal for the family as an expression of your love and appreciation for all that they have been to you for the last 6+ years. When the MIL shows up, all you need to do is gush about how daunting it has been hosting Thanksgiving this year, and it really makes you appreciate how much time and effort she has gone to in all the years past; how you are so happy you have been able to help out when she was injured and the perspective it gives you on the love she puts into this celebration every other year.", "NTA if mil is so sensitive about you being a better cook than her she should learn to cook, not expect you to make a lousy meal on purpose to spare her fragile ego.", "Fucking send it. NTA and have you MIL involved if she can be. Even if it just to learn cooking techniques.", "Are you able to do potluck style? Everyone brings something, that way it's not just you but a group thing? This might even be a great tradition to try in the future too", "i’m sorry, but it is nauseating the way everyone in the comments is asking you to pander to, and coddle your mother-in-law. if it was really that important to her then she could’ve learned to cook by now at her big old age. There is absolutely nothing that you need to do besides cook a meal for you and anyone who appreciates it to enjoy. If she wants to sulk and pout in the corner like a toddler, then she can feel free to do so. Nta.", "You know that your planned menu will hurt her feelings, so I think ywbtah. However, your mil knows you're a good cook, and knows you're doing the cooking this year, so maybe she'll connect the dots and emotionally prepare herself.\n\nI think it would be kind of you to discuss the menu with her beforehand, and drop in that you're really looking forward to sharing your grandmother's Thanksgiving dishes with the family. That context will let her know that this isn't you flexing in her or trying to outshine her efforts. Plus, discussing the menu will give her a chance to request any dishes from her menu that she really likes (we all have opinions on box Mac and cheese... But sometimes it really hits the spot).", "NTA but “ accidentally” burn a side dish to stay humble", "NTA. Tell her you just took a cooking class and learned to make thanksgiving dinner.", "NTA but I would definitely try to sit down with her before you make the thanksgiving dishes. Just let her know what you plan to cook, tell her how excited you are to cook for her. You sound like you love her and you have a great relationship with her. I don’t know why she gets withdrawn after she eats your food. Maybe she feels inadequate because she can’t cook. Whatever it is just let her know what’s going on. It may be something along the lines of her feeling replaced or not needed. Whatever it is just talk to her. Enjoy your Thanksgiving, make the meals you want to make. But let her know in advance so she’s not blindsided.", "NTA. If you broke your leg would you refuse treatment because it hurt a paraplegics feelings? Her feelings are her responsibility, cook to your hearts content, it doesn’t make you an asshole. If anything your husband is AH for telling you that somehow her feelings are your responsibility. You’re not god. You’re just OP.", "How hard is it to just make sure the turkey is killed twice, jeez! Hahaha. NTA.", "YTA. You have to bite the bullet and cook really badly. It's the only answer.", "Listen do not dull your shine and tarnish your gifts because another person is not gifted the same way.", "Maybe you could tell her, that you tried to step up the menu for your mil cause she can’t host it and you want to treat her for all the years she hosted you? \nSo she doesn’t see it as a competition and feels appreciated? \n\nNTA!", "Call and ask her for her recipes so you can make sure your dinner ‘lives up to hers’ - stick to flavour profiles but make your own :)", "NTA Your husband has a warped sense of assholery if he thinks you feeding his entire family food that is actually edible and enjoyable is a bad thing. Who wants to sit down and have to force feed themselves awful food just to appease one particular person. MIL is a grown up who has had plenty of time to learn how to do things right but has clearly chosen not to. Go ahead and make the meal and I'll bet even MIL will want this to be the new tradition.", "NTA they should appreciate that you would put the time, effort, and obviously love into making them a delicious thanksgiving feast. If anyone is anything but grateful they’re the AH.", "I love your menu but to keep the peace and not hurt feelings, you might want to cut it back a little bit to only the \"essentials\" that make it Thanksgiving for you. Then fix the other stuff for your husband after the holiday. I'm sure you will have left overs and could make it work.\n\n(example of cutting back - maybe only one kind of pie, one green vegetable, one starch - no need to have corn, mashed potatoes, stuffing and yams.) It just seems excessive if you compare it to what you have been served at her house. If things go well, she might be willing for you to host again and you could expand the menu a bit.", "NTA. Cook your food your way.", "NTA. I don’t think it’s fair that you are held hostage bc of her insecurities. She’ll be ok.", "And their relationship seems to be fine!!?? So wtf? I’m so confused. Why are people acting like she needs to coddle the MIL? She can’t cook this year! Obviously the food isn’t going to be the same. This is such a nonissue, and I say that as someone who understands the significance of cooking and entertaining.\n\nThere is nothing being shown up here. It’s a different meal made by a different person.", "Why is this being downvoted?", "Ask MIL for input. Tell her you're planning a dinner like your Grandma made but you don't want anyone to miss any of her special dishes, so are there any that the family just cannot do without on Thanksgiving day? Tell her what you have planned, ask her if there's anything missing. Yes, this might mean the jiggly can-shaped cranberry gunk could end up on your table next to your delicious homemade, or some other offensive thing that it just wouldn't be Thanksgiving without for them. Just be inclusive about it. You might find some of their palates prefer the processed crap because they're used to it. Do not be insulted, or at least don't reveal it if you are. \n\nAnd tell her you're really looking forward to giving her a Tday off because when you do it for decades, even if it's crap, it gets pretty exhausting. Also might be good to ask your husband to hold all compliments until you're alone together, because she's going to notice if everyone is raving. That's probably what makes her sad, that she never gets positive feedback. Imagine cooking meals for decades and nobody compliments anything, then you cook and everyone raves. Discourage that if you can because you know you're good, and you're not trying to show anyone up.", "There’s some cooking to be done the day of. Have her help with that.", "I hope you see this! \n\nOrder Thanksgiving Dinner from your local upscale market. This way, you won’t be showing her up. \n\n“I didn’t feel confident doing a big celebration like you know how to do it, so we ordered prepared food from XYZ Market.”\n\nThis is the way to pay back your MIL for her years of kindness.", "Ask her to bring something so she’ll feel a part of it. Just a spoon full of sugar and the medicine goes down. The medicine is her having to get your good cooking but at least she contributed something🤔", "There is absolutely nothing fancy on your proposed menu. Just cook what you want and say those nice things other commenters suggested to your MIL so that she thinks you’re trying to reach her over the top level of hospitality, not outdo her. After all it’s not a competition, you’re being a good host in your home. NTA", "Ok, everything makes sense now. 100% NTA.", "If it's going to be THAT BIG of an issue for her then just don't host. Doesn't seem like you can win either way. Cooking a shitty meal won't make you happy and cooking a good meal will upset your MIL (personally I wouldn't care, sounds like MIL needs to grow up in this area, you don't withdraw and ruin the mood when you have to eat her prepackaged meals). If a Thanksgiving dinner is going to cause issues just because someone else cooked it then it doesn't sound worth it.\n\nNTA", "When I host thanksgiving or Christmas I make a Facebook event with everyone that’s invited; On the event page I let people know what I’m making. And tell them that they are free to bring anything else they want to. Others will post what they are bringing also so we don’t repeat a bunch of dishes", "If you click the link and sort comments by Old, you'll see the automod comment with the original post text.", "https://www.reddit.com/r/AmItheAsshole/comments/ykdgjo/aita_for_stealing_my_mils_heirloom_recipe_and/iusmn1o/", "I also love that can of cranberry sauce.  That's why suggested both.", "Well, don't do it just to be condescending if no one actually likes those parts of the meal, but at least find out if there are specific parts of the \"traditional\" meal that people specifically look forward to. E.g. we always have canned cranberry sauce at my family Thanksgiving alongside the fancy homemade one my mom has started to make more recently because some people prefer it. Plenty of people like Kraft mac and cheese too. So don't assume what you (OP) think is objectively better would actually be people's preference -- even though your meal sounds really great and definitely not overly pretentious or anything.", "Has she ever asked you for recipes or to show her how to make something? Is this a topic you can broach with her (gently)?", "Good hosts also cater to their guests so they are welcomed and comfortable. She can definitely compromise on some of the dishes to keep the traditional", "Since you have enjoyed the experience of being with them for thanksgiving make sure you bring up memories from past years and if there are any traditions like playing games or watching a certain movie or whatever try to incorporate it too.", "Just tell her you are using your grandmother's recipes (if anyone says anything about the good food)  and you want the chance to take care of her with her broken wrist the way she cared for you.  If she insists on making something, have her bring the rolls - can't mess up store bought rolls!  Or whipped cream for the pie.  Or an appetizer and wine.", "But the can ridges provide a built in slicing guide!!", "Ahhhh, Cranberry Sauce a la Bart. Classic and delicious.", "Yeah, we always have BOTH at my family Thanksgiving because of that.  Sometimes we gently tease each other about which we like... sometimes we just focus on trash-talking about the upcoming intergenerational Uno game. (\"Ready for your Uno lesson?\" \"Ha! I brought a copy of the rules for YOU.\" You have to guess which is the 94-year-old and which is the high-schooler.)", "Or…..compromise like a compassionate adult", "Pumpkin pie, cranberry sauce, and mashed potatoes are so easy to make from scratch. I consider myself a proficient cook but not amazing by any stretch, and I always make those. Your MIL doesn’t cook so much as assemble premade food from the sounds of it.\n\nIf your MIL says anything, just tell her that you’re happy you could help by hosting this year, and that cooking is just a favorite hobby of yours. It’s not your fault she doesn’t know how and hasn’t bothered to learn.", "Ok well that’s just unreasonable.", "Maybe get the store-bought cranberry sauce and desserts.  But make your version of turkey and stuffing.\n\nActually, why not get your husband to do some of the sides as well, that way it should take away some of the tension, and make it a bit less MIL v DIL.", "That actually doesn’t sound like too awful of a compromise. Particularly for the cranberry sauce, there are plenty of people who actually prefer the canned stuff. Get a box mix for the stuffing and dress it up a bit to make it as good as it can be. Get a store pumpkin pie and make the cherry one at home (since it will be difficult to find cherry pie at the store this time of year but easy to find pumpkin).", "My trick is using red wine instead of water 😂 homemade cranberry sauce is really easy and id so good!", "Agreed on the cranberry, it’s a nostalgia machine and a nice gesture of compromise since the family won’t have their usual traditions. \n\nHomemade cranberry sauce is amazing, but if there’s canned I will always have that too because it just hits like childhood.", "What the hell kinda robot are you? I understand people of Reddit wank on their individualistic need to \"be themself\" and \"do what I want\" waaaaaa *baby cries* but if we evolved to live in society and if we continue to thrive it's because sometimes it matters more that we don't make what we want but what makes other feel good. Got it? That's not bitter, that's how the real world works. You've heard of it maybe? And I stand by my judgement. OP sounds conceited. It's food. It's supposed to make you happy to share it. If that's all you have to show off over a literal stranger that took you in as a daughter, you are indeed an AH. And a bit douchy. There's plenty of other places to make your food shine. Start a restaurant. Invite friends over. Do a BBQ for your local church. My goodness.", "Never made gravy from ham juice you have no idea what you're missing quite possibly the best gravy on the face of the earth.", "This is a great idea! And genuinely honest too.", "I get my fresh cranberry desires taken care of by slightly cooking/mashing some with some sugar and then letting them sit in a jar full of booze for a month. Do it in the lead-up to Thanksgiving and end up with a GORGEOUS cordial at Christmas.", "But how can you even make crappy food on purpose if you know how to cook? lol\nObviously I understand that you can buy canned sauce and a pie instead of making them from scratch, but they don’t necessarily have to be the shittiest kind. \n\nPurposely dehydrating a turkey and serving mashed potatoes from a box is where I draw the line, however.  I’m not from the US and we don’t do Thanksgiving, but pretending I can’t cook and serving crap to guests is just not right.", "Where on earth do you live that you can’t find asparagus in November? Is it very rural?", "That's a great idea!", "Add orange juice and a pinch of cloves, the best tasting sauce ever", "Wow SEE. You are not taking your own advice🤣🤣🤣 Literally everything you said can be spun on how the TOXIC MIL is behaving. Is being jealous and petty toxic ?? YES. Is cooking REAL FOOD, that you love for family that you love in your own home when it's YOUR TURN TO FINALLY HOST toxic?? Nope! If they want to eat the MIL's food, they can do that literally ANY OTHER TIME. The world is toxic and full of cry babies because of enabling people like you who allow toxic people to control their lives instead of helping them to better themselves like they have!! OP is not the cry baby OBVIOUSLY because she's scared that her cry baby MIL will make her feel bad over... DELICIOUS FOOD?? AM I READING THAT RIGHT?? If that's the world y'all are okay creating and perpetuating in your own life than that's on you and I feel bad for y'all but that's not how normal, healthy people choose to live and you allowing bad behavior is not the WHOLE \"real world\"🤣. The MIL is conceited, not OP lmbo. She CHOOSES to not feel good because the food tastes good instead of admiring her daughter that has done nothing but show her love, how does that make sense?? If OP can sit and eat crappy dinners without complaining like a brat and showing love, then MIL can ALSO enjoy the food she knows is DELICIOUS and not be a brat! Old enough to know better and do better with her attitude even if she doesn't want to improve her cooking! To use your same lame point, if MIL wants to eat her own type of cooking instead of branching out like a normal, well adjusted adult, she can eat at home!! It doesn't take two hands to make fake boxed food🙄🙄 If that was all I could make, I'd appreciate being spoiled by someone else, what I earth, y'all are wild! Is she just supposed to have these gatherings and make good food and not invite MIL (who would obviously be offended btw!) and skirt around her own MIL because she's jealous and petty over her own loving DIL delicious food?? Get a grip.", "Perfect. You’re showing MIL you appreciate her cooking, and are making yourself humble about your own cooking.  Just make a good meal, with traditional sides. I’d refrain from making some dish that would be outside of their wheelhouse. Brussels sprouts.and asparagus are two love/ hate items. No middle ground there. 😂", "This is a really good response. \n\nOP, have you talked with your MIL about how she feels? \n\nI can understand that she feels hurt but does she try to cook better or just doesn't want others to do better? \n\n(I only ask because I come from a very toxic family and my mom wants others to fail so she looks good. It doesn't sound like your MIL is like that but I have to ask.)\n\nMaybe set up some time where you can visit her and you both can cook together? Show her some things? Or, take some cooking classes together to bond? I get they live a few hours drive but that would be a really nice gesture if she wants to get better at cooking.", "\"When you cook from the heart, you would never make boxed food for loved ones\"\n\nI am a steadfast lurker, but I just made an account to point how how wrongheaded this single statement is.\n\nIf OP is seeking to be considerate and gentle with her MIL, taking the suggestions to include a couple token dishes in her MIL's style is absolutely reflective of her own heart and love for this family.  \n\nYou do have good points here, but you would do well to consider what the people who you are arguing with are saying.\n\nFor the record, I am a skilled and passionate cook who lives to love people with my cooking.\n\nSomething that's always stuck with me was the closing story in Anthony Bourdain's excellent memoir, Kitchen Confidential.  Essentially, he talks about being on a beach at a dingy little grill shack, getting burgers with his wife.  He talks about how they're plain, the patties are tiny, the buns are huge.  Nothing to write home about.  But it's an amazing meal, because of where he is and who he's with.", "….or serve all her amazing dishes made her way\n\nWhile acknowledging her MIL’s (and husband’s) family traditions \n\nThis ain’t hard", "My mom has a recipe for her pie crusts that mixes in some lard we get from the butcher, and I've never had a better tasting pie crust xD takes the whole pie up a level.", "It’s in packages in the freezer section all year, and the organic grocery store probably has some fresh imported from Chile, but I usually go to the budget store that does commodity stuff plus what’s in season. We’re seeing tamarin pods, cranberries and new crop late pears and apples", "No, totally. Cooking is not everyone's strongest suit. I've got lots of friends and relatives whose specialties include boxed dinner. This one's a hard one. \n\nI think I'd still offer both home-cooked and instant, that way you're not saying, homemade is the best, you're just sharing what your family traditions are.\n\nA lot of my friends who can't cook well are usually relieved to no longer be burdened. Good luck!", "Interesting. I'm going to have to test it out. Thanks!", "You comment a lot on this thread. There's something there.", "My mom and I had a tradition - Whoever was hosting made the appetizers and main course (meat), and the other person did the sides and dessert. We'd happily alternate and it made the work seem easy.", "Because it’s kind to be aware of other peoples feelings? I’m autistic and I can’t always guess but op doesn’t have to guess. She already knows. It’s not that hard to be kind if you know what someone’s insecurities are. Why is kindness so upsetting?", "... what... what traditions?? BOXED FOOD?? They can bring it themselves and be helpful then if it's THAT much of a big deal to them that they eat boxed food over home cooked meals. Or the husband can make himself useful and proudly present his boxed mac and \"\"cheese\"\".  Stop putting everything on OP and she shouldn't have degrade herself as a normal cook to make something so gross and serve it. Her husband can have the pleasure if it's so important! No one is acknowledging that everyone but MIL is okay with OP's food and MIL brings EVERYONE'S mood down just by simply tasting delicious food?? Makes no sense. If it was the MIL writing about how sad she was her lovable DIL makes good food, y'all would be helping her to do better instead of suggesting OP do worse smh.", "I have issues with certain food textures and I prefer the jelly canned cranberry sauce every time. I tried to make it homemade but I absolutely could not handle the texture of the homemade version.", "And what??? Unless you have something of use to contribute to the accurate points I'm bringing out on a public forum MEANT for conversation, don't at me silly. Ridiculous comment as a cop out for not liking that I'm making sense and you have nothing to say🤷‍♀️ Does reddit have a limit or what🤣🤣🤣 Do you limit yourself to a certain about of comments? Go on then.", "That's why I'm upset love, OP is NOT being shown kindness. In the long run, her catering to toxic behavior is not going to help MIL to be nicer or more mature and OP won't feel close to her. She mentioned in a comment that she will taste the food is delicious and bring the whole mood down for everyone. Is OP supposed to never cook for MIL again or invite her over? I'm neurodivergent and I've been taken advantage of because of my kindness, empathy and my willing and enjoying to please others type behavior. But I've realized now that a lot of times I've been abused, manipulated and had boundaries crossed when I gave too much away to those who had severe issues and NOTHING I did changed that. I am still loving, giving and will be forgiving but I will not excuse or allow toxic behavior when a person refuses to acknowledge and WORK on changing said behavior. It's hard because I know I still get manipulated unfortunately, but if I see something and aware of it, I try very hard not to allow it.", ">Who cares??!\n\nApparently YOU, because you're the one who said she was cooking for EVERYONE and not just MIL, implying that EVERYONE was why she should not change her cooking.  I was just pointing out that for a lot of people every single meal they eat in their life isn't about the culinary virtuosity of the food.\n\nSometimes, for some people, especially around the holidays, a meal is about sharing your time with other people, eating food you remember from your childhood, continuing long standing traditions as a form of comfort and stability in your life...\n\nin which case, preparing one of two dishes the way her MIL makes them might do several things that have nothing to do with MIL's insecurity... it might\n\nA) make EVERYONE who comes feel nostalgic\n\nB) make sure everyone has at least something they enjoy eating\n\nC) if her MIL not being able to cook has made the whole family think about what happens as MIL gets old and can do less and less, it reinforces that even as family dynamics change, some small things will always be the same, and that can be terribly comforting to some people\n\nI'm not saying she's the AH if she doesn't do this...  I'm saying it's something she might think about, as OP obviously cares a lot about her in-laws as a whole, and her MIL in particular.   It isn't about what people have to do, or should do, it's about what OP COULD do, not only to put MIL at ease, but also herself, as OP is clearly worried about this.  Telling OP to stop caring about the feelings of people she clearly likes and cares about, is silly and immature, and doesn't resolve anything, including OP's anxiety about this meal.", "My point is, she shouldn't let someone else's ego, pettiness, jealously etc to dictate what she loves to make for her family that she loves in her own home. That's not her or anyone else's job. They can literally eat gross boxed food any other time. Boxed food is not traditional. It's okay to have a real meal at OP, and APPRECIATE it because guess what, isn't that why y'all CLAIM to celebrate Thanksgiving🤣?? Are y'all that miserable that a home cooked meal is such an inconvenience and can't be appreciated💀\n\nTelling her to limit and belittle herself to cater to someone else's toxic attitude is not going to help OP either. It also won't make her feel closer to her MIL and her MIL won't ever be happy because she has issues that she needs to work out herself. She will always be miserable and make her loved ones feel stupid and miserable FOR NO REASON. OP literally said in a comment that even if no one compliments her cooking, MIL will taste that ot taste good and then bring EVERYONE'S mood down. The advice y'all are giving in enabling and unhelpful", "NTA but I think you’re underestimating the nostalgia value of the traditional menu. Lots of people like the foods they ate in their childhoods. My husbands family has a few similar things on their thanksgiving menu and I really don’t think any of them would be happy if those items were replaced with a gourmet version. Just be prepared for the reaction to be underwhelming.", "Just cook your dinner! Your husband should be grateful 🤣🤣🤣", "But I don't see anything wrong with this menu. Maybe my family is different, but our spread is even more options than what you listed. Variety helps so that everyone has something they can enjoy.\n\nLike, As for me, I hate turkey and ham. So, there are other meats to choose from. My grandniece is allergic to the world, so we have options for her too and to make sure dairy products, including egg dishes, and no nut items near her, so there isn't cross-contamination.. We also do potluck-type options. Everyone brings something to add to the feast. Maybe ask your MIL to bring anything she feels she can handle, and anyone else who would like to add to the menu. That way, your husband can relax and no one's feelings will be hurt.", "She should be grateful. Maybe she’ll come to realize it. I’m a mediocre cook and my husband and daughter are excellent cooks. I will gladly be head dishwasher just to eat their Thanksgiving meal.", "NTA— you’re hosting a dinner. It would be rude to cook poorly for them.", "Nta. Ask mother in law to arrange a nice cheese and cracker appetizer.", "This is the most helpful AITA comment section of all time.", "NTA. But maybe switch the garlic mashed potatoes for the boxed mac and cheese. Just since it's what your guests are used to having, atleast they won't be feeling like a traditional dish is missing. Two types of mashed potatoes is a bit overboard. The rest of your menu sounds great and isn't overboard at all", "Listen it’s not cranberry sauce if it doesn’t have can lines and I can’t cut slices with a knife!!!", "NTA, make good food.", "Let me get this straight: You're hosting and cooking amazing food, your MIL will get offended, and your husband says you're wrong? Uh.... NTA. Chances are everyone else will enjoy tastier food, too. Enjoy it.", "Add that Kraft mac-n-cheese. You don't have to eat it, and it's easy enough. My guess, you do just that and they will be right at home!", "NTA but you are missing something.  \n\nThanksgiving is a holiday and Holidays have rituals and meaning.\n\nCooking the Thanksgiving dinner isn’t just about the food it’s a ritual to be preformed by specific people. The really nutty thing is every family for thanksgiving has different rituals which causes clashes.  \n\nIn a lot of families cooking the meal is cultural expression of social status, very often only family senior matrons cook the meal.  In some families if you are not married with kids you don’t get in the kitchen. You cooking the meal pushes you up to that status which somewhat displaces your MIL. \n\nThe weird thing about this is your MIL likely can’t quite clearly articulate the family rules about Thanksgiving, most people can’t.  But what people can see is when the rules change for their kids family they can very clearly see their children have left their family which brings up feelings.", "NTA\n\nI agree with complimenting her previous hostings and how now you are returning the favour. People love to hear all the good things about themselves.", "Definitely NTA. It’s your home and you can cook the food you want to have for Thanksgiving. If they want to bring a dish they definitely can but getting upset with the food presented rubs me the wrong way. Like if you are that upset someone might have better cooking than you, either get better at cooking the dish or just get over it.", "NTA I spent 3 years with my in-laws for Thanksgiving and had the same menu but instead of Kraft it was a cold macaroni salad. And the rolls were horrible! After that I said hey, let me take the hosting off your hands so you can spend more time with your son. It worked and no more rubbery boxed mashed potatoes.\n\nI do want to add that you shouldn't be surprised when they say something like \"I prefer canned cranberry sauce to the homemade you spent so much time on\"", "NTA but ask her to help you cook to the best of her ability so you can give her credit and maybe she will feel better about it.", "You're going a tad overboard,  but not to AH levels. You might throttle it back a tiny bit.\n\nAnd YWNBTA, unless you openly say something about how much better your cooking is than hers. If you say ANYTHING, let it be along the lines of \"I learned this recipe for cranberries from my Gran. I hope you think I did it justice.\"", "Do it. She must know she's a horrible cook but that's on her. You're not making magic here. You're making food.", "Why don’t you cook exactly what she serves, but use your own recipes. Homemade Mac and cheese fresh mashed potatoes and cranberry sauce. Tell her that you love her menu and want to make it with your grandmother’s recipes. That way you honor her tradition but get delicious, if simple food.", "NAH. I agree with everyone saying you should ask for MIL's \"help\" or input and praise her for her generosity in hosting all these years. Keep in mind while you seek cheftastic glory for your tgiv culinary wizardry, that if it's *too* good, you'll end up hosting every year until the end of time. You might start to understand why MIL takes shortcuts sometimes. Embrace graciousness this year in addition to gratitude. It will go a long way.", "If you choose to purposely rub it in your MIL's face that you are a better cook, than yes - YWBTA. If you choose to make a great dinner and tell your MIL that you went a little crazy and made a lot because you enjoyed making being able to return the favor after all her years of hosting for thr family, absolutely NTA. I hope your MIL enjoys the experience of being a guest and being able to enjoy a wonderful meal.", "NTA. It’s not your fault his mother has no concept of emotional regulation and takes immense offense enough to withdraw from socializing enough that it’s notable year to year. I’d take an opportunity to help teach her later if she seems open to it, as a sort of an event to spend time together. \n\nDon’t dance around small, very self manageable feelings, it only reinforces their importance. Other people CAN cook AND it can be flavorful and delicious. If she’s so pitiful about it, she can be a big girl and maybe try learning something.", "NTA", "NTA", "I’m sorry… KRAFT Mac n cheese? On THANKSGIVING? 😭 Oh sweetie. Cook your heart out, you’ve earned it.", "NTA at all. Totally agree you should throw in some boxed Mac n cheese and canned cranberry sauce, etc.", "So your husband wants you to cook bad? NAH she could learn how to change her ways if she is sad about you being better at cooking.", "NTA! Just say this is something you remember from being younger and growing up. If she has a fit then that's her issue.", "This is how I feel, NAH but op is so focused on wanting to recreate her memories and food to her taste that she hasn't seemed to consider how much of the menu might be for their own tastes/nostalgia. If she could only make sure to include a bit more of the meal that he and his family loves too it could go a long way and it doesn't seem like it would be very challenging either. It will be a much happier day, and they might even want her to host again that way! Nothing AHish happening here unless op does a 180 and starts being rude and boastful or critical instead of considerate.", "They are guests, why do they have to cater to the feelings of a middle aged woman with adult children? In a comment OP made, she said that MIL will literally pout and withdraw and make the night more awkward and difficult. That is unhinged childlike behavior and you suggest to compromise with it? \n\nNo thank you.", "Yeah but aren’t there certain things you can make day of? We always cook at least some of the food thanksgiving day", "Still most dishes are done the day of, so why not set her at the counter and let her help as she’s able?", "I agree with him, but you have a lot to work with. Turkey, some Noodles, a veggie, potatoes and pie. Make it from scratch with the best ingredients but stick the standard course.\n\nOver time you can expand it, but I think your husband is right about this first time.", ">OP should think outside the box and avoid the situation itself.\n\nIf her husband insists on a poorly cooked meal, OP should tell her husband to order from a supermarket. They often offer Thanksgiving dinners that just need to be picked up, including a whole turkey. It's more expensive than cooking your own and in my opinion, it doesn't taste bad also it isn't anything to brag about. Then she can continue her tradition of cooking the day after.", "That’s peak child behavior and straight up narcissistic behavior. How sad you have a child for a MIL.", "OP did you see the comment about telling MIL \"I really wanted to live up to your wonderful tradition and might have gone overboard\"? That sounds much sweeter than anything else I've seen.", "write and gift her a small gift as a thank you for giving you such big shoes to fill. I would also ask what dish would she like to see that you can make in her honor?", "They've always been wonderful to you, show your appreciation by listening to your husband. I get it, I went to culinary school, everyone knows this, but I always take the lead from my mother in-law. Is your ego really more important than her feelings? I'll ask it again and I hope you think about it. Is your ego more important than the feelings of the woman who cared for you when you were sick and welcomed you into her family with nothing but love? You would be the asshole if you did this. Give her this day. Trust me I get it, I brought Wagu streaks once and they wanted them well done. It still hurts. Thanksgiving is about family, not food.\n\nIf you want to find a way to bond with her over stuff, the cooking channel is a great way to do it. Sit down and watch a show whenever. Watch it with her and say what do you think of this? Oh that's an interesting technique? Have you ever tried that?", "I am the same way lmao, idk what it is, but the canned cranberry sauce is banging to me lol", "What’s more important? Being “right/best” or your guests comfort?\n\nI know how to make homemade cranberry sauce. It’s good, but at thanksgiving I want canned cranberry sauce. It’s comfort food, and that’s what thanksgiving is about for a lot of people. \n\nTaking time out to make something that will bring your guests comfort is being a good host and person.", "It hurts no one to add an easy to make god that is a central part of their traditional meal. Also canned jellied cranberry sauce is better than literally any home made or restaurant recipe I’ve ever had.", "It’s a holiday the box and can are party of the tradition’s having them there can be very important.", "That isn’t babying a grown adult. That’s cooking a great meal while being nice to the mom and saving time.", "And you can tell how old it is by counting the rings", "We always had two gravies growing up, because of the wild difference in preferences.", "Plus, doing so will save a nice chunk of time for Thanksgiving", "Yooo🤣 please stop making excuses for this jealous MIL, this isn't the answer you thought it was💀 Stop focusing on the garbage food (which isn't traditional to their family btw it's just all this lady can be bothered to make) and focus on the REAL issue at hand in my above comment! And fyi this ridiculous holiday y'all claim is about \"thankfulness and family\" not about the food or else OP would have been a brat about the garbage food she was fed all these years. If OP was polite, so can MIL and allow her to make home cooked meals that are actually traditional and what the holiday is supposedly about. Good food you may not be able to make all of the time vs fake food you can eat anytime. The point MIL ALWAYS ACTS LIKE THIS NO MATTER WHAT BECAUSE OF PETTINESS, IT'S NOT ABOUT WHETHER OR NOT SHE WANT TO EAT FAKE BOXED FOOD! Even if it was, she needs to be an adult and loving MIL like OP was an adult and loving DIL eating whatever she was served at MIL house. and NO one else is complaining, only jealous MIL because she's sad OP's food taste good🤦‍♀️ Childish and toxic", "Store bought cranberry sauce is not crap food. I mean, it may technically be not real food, but it’s fucking delicious. And honestly, I know people who prefer store bought stuffing to home made leek and shallot brioche stuffing. That doesn’t mean that either food is crap or better than the other.", "u/ifidufofyd\n\n(Check the above comment.)", "Aww this is so sweet", "If I don’t get Stoeffers stuffing, Thanksgiving is a total wash.", "I’m not sure that MIL is jealous it’s probably more embarrassed that she doesn’t cook well than anything. Maybe MIL didn’t have a mother or grandmother to teach her how to cook, or maybe they were terrible cooks too so that’s what she learned. Maybe pride gets in the way so she won’t ask OP to teach her.\n\nIt doesn’t cost much to be thoughtful and if adding Mac and cheese and canned cranberry sauce to the menu makes it more their family tradition so be it. Her family loves her and that’s what counts.", "Yes! She could even include the Mac and cheese she uses. So to point out she's trying to recreate it!", "This is the way.", "I add celery, onion, carrots, apples, and cranberries to stove top. Tasty if you don’t want to make homemade. I’m one of the few that likes stuffing in my house so it makes sense for me."]}