{"id": 21171, "submission_id": "14oxrsh", "title": "AITA for letting my daughter be kicked out of a wedding since she wasn’t modest enough", "selftext": "My daughter is 18, Emma. Before she turned 18 we had a rule that I could ask them to change if the outfit wasn’t appropriate. Rarely happened because I truly didn’t care as long as the main parts were covered. Now when they turned 18, they are an adult and most of the house rules didn’t really apply. \n\nWe were invited to a wedding to a close friend, my daughter is friend with her daughter and I am friends with the mother. They are religious, I know this and she knows this. It was a church and the invite said modest, no cleavage, knee length and so on. I didn’t expect anything else.\n\nWell a few weeks ago Emma showed what dress she was going to wear and I mentioned that it won’t work, the dress was cute but strapless. I thought she would change it but didn’t. So on the day of the wedding she wore that, I even commented that it won’t work again. She said it will be fine.\n\nWell we get there and her friends brother stopped her at the door, she tried to argue but got kicked out. I still went to the wedding. I got home today and she called me an ass for not defending her and staying at the wedding with their old school dress code", "created_utc": 1688328352, "permalink": "/r/AmItheAsshole/comments/14oxrsh/aita_for_letting_my_daughter_be_kicked_out_of_a/", "score": 356, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > AITA for letting my daughter get kicked out of a wedding due to her not dressing modestly. I may be an ass since I didn’t support her and still went to the wedding\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. She has the freedom to dress as she wishes, she has the freedom of being the sole responsible for the consequences.", "NTA. You told her, she didn’t want to listen, she learned how the world works.", "NTA. You didn’t control your daughter, you just warned her about the dress code. She chose to ignore it, and as a result she wasn’t let in. That’s not your fault.", "NTA\n\nShe knew the dress code and regardless of the wedding entering a church in anything sleaveless and short is rude and will get you kicked out. It's about respecting the place where you are going", "NTA. When you are a guest at someone’s wedding, you abide by their wishes, especially when they are explicitly stated. If you can’t, don’t go. You even warned her twice, and she chose to ignore you, then had the nerve to get mad that you didn’t cause a scene. What the fuck did she expect would happen? Your daughter has the maturity of a 13 year-old.", "NTA.\n\nSounds like she was trying to make a point about the dress code.  Disrupting someone else's wedding is not the right way to do that.  She should have RSVPed in the negative *and said why*.  That would have let her stand up for herself without disrupting someone else's wedding.", "NTA she knew the rules, but still decided to flaunt it. Even after you repeatedly warned her about it.", "NTA", "Some churches even insist on a head covering being worn.\n\nWe were in Arles, France and for those women without a head covering, or who were showing their shoulders there was a box of shawls by the door. There was a separate box for you to place your used shawl in by the exit.\n\nAnd this was just for the tourists who wanted to look inside! NO woman could enter unless their shoulders and head were covered.\n\nNTA - your daughter was told and decided to break the dress code. Your daughter is also an adult. She FAFO", "NTA. The dress code was clearly stated on the invitation. She's an adult and needs to learn to follow a dress code.", "I assume Emma can read.  I assume she can understand what she reads.\n\nThe invite had a specific dress code.  I assume Emma read the dress code, or was informed  of it.\n\nShe somehow thought she was exempt from the dress code.  She found out she wasn't. (She FAFO)\n\nNTA", "[deleted]", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy daughter is 18, Emma. Before she turned 18 we had a rule that I could ask them to change if the outfit wasn’t appropriate. Rarely happened because I truly didn’t care as long as the main parts were covered. Now when they turned 18, they are an adult and most of the house rules didn’t really apply. \n\nWe were invited to a wedding to a close friend, my daughter is friend with her daughter and I am friends with the mother. They are religious, I know this and she knows this. It was a church and the invite said modest, no cleavage, knee length and so on. I didn’t expect anything else.\n\nWell a few weeks ago Emma showed what dress she was going to wear and I mentioned that it won’t work, the dress was cute but strapless. I bought she would change it but didn’t. So on the day of the wedding she wore that, I even commented that it won’t work again. She said it will be fine.\n\nWell we get there and her friends brother stopped her at the door, she tried to argue but got kicked out. I still went to the wedding. I got home today and she called me an ass for not defending her and staying at the wedding with there old school dress code\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. She knew the dress code and chose to ignore it.", "NTA.  Your daughter FAFO that the rules do apply to her.", "NTA. Your daughter didn't respect the bride and groom's request, and faced a consequence for that.", "NTA. *she called me an ass for not defending her and staying at the wedding with their old school dress code.* You told her more than once that her dress wouldn't be acceptable. She knew what the dress code was & chose to ignore it. That's on her. She chose to be hardheaded & got exactly what she deserved.", "NTA", "NTA. Your daughter learned an embarrassing lesson on FAFO.", "NTA. Your daughter chose to flaunt the dress code and was asked to leave. She chose to make a statement you did not.  \n\nIt is time for her to grow up. Consequences for her rudeness.", "Actions have consequences. Your daughter is an adult now, and hopefully has learned this. She FAFO. You weren’t obligated to defend her poor choices", "even if she couldn’t read, op told her. nta, emma needs a reality check.", "Ummm. that rule stoped when she turned an adult\n\nFirst paragraph before they turned 18", "I might have misunderstood because “most of the house rules don’t apply,” I didn’t realize that the dress code was included in that, my bad", "Some house rules still apply if you live there ( clean your own space, respect others property), the kids rules don’t, like curfew, dresscode etc", "That’s fair, sorry for the misunderstanding", "I saw a woman's shoulders at a wedding once and now I'm pregnant with twins. Emma needs to think about the consequences of her choices!", "F#cked around and found out!", "Wait, what was wrong with her dress?", "NTA, if you had forced her to change she would have also gotten angry. \n\nYou told her about the issue, she ignored it and she found out. \n\nHeck starting a fuss at a friends wedding because of this would have been a bigger asshole move.", "I was all set to call you an ah from the title of your post, but NTA. \n\nShe showed a lack of respect to others as a guest at their function. \n\nConsequences.", "NTA, a dress code is a dress code.  Either abide or don't go, it's pretty simple.\n\nI think you handled the situation perfectly.", "NTA\n\nYou told her it wouldn't work. She learned a lesson to follow dress codes if she wants to attend.\n\nYou were fine still attending, you don't need to support her in her poor decision making.", "NTA. You were guests at someone else’s event, a religious wedding at that. She can dress however she wants but she needs to learn to show respect to others. You were specifically told it will be modest dress code, she didn’t have to come if she wasn’t happy abiding by the dress code.", "Yes. Shoulders aren’t distracting.", "I don’t care about you, but anyone who has such ridiculous old school ways of thinking is an AH. Trying to control what type of dress other people wear because you’re a religious nut is just wild.", "NTA. \n\nShe FAFO.", "Well, she found out. NTA", "NTA. She had enough time to find something more appropriate.", "NTA \n\nIt’s a religious thing. Annoying, outdated? Sure but this isn’t an educational institution it’s a private religious affair", "Nta", "NTA \n-you warned her multiple times\n-they put the dresscode on their card so there was no guessing\n- she's an adult now and can fight her own battles", "NTA she was given the expectations, and she made her decision. She should apologize to you for several things, the least of which is blaming you for her poor decision-making.", "Nta. She knew the dress code and chose to ignore it. It is HER fault she was kicked out.", "NTA. She is an adult and has to learn how to act like an adult in public. You tried to warn her (kindly, it sounds like), and she didn’t listen. FAFO, as they say.", "NTA. She’s an adult that was taught an adult lesson. If the wedding said formal attire and she showed up in leggings and a tshirt, she wouldn’t be let in either.", "NTA.  You warned her, she blew you off, she got kicked out.  Consequences of her own actions.", "NTA, dress code was communicated in advance. She could have chosen not to go.", "NTA, the invite gave a dress code.  She went as far as buying a dress that totally broke the code.  What she did was a total look at me act at another person's wedding.", "Hey she told you it would be ok....end of story :)", "NTA\n\nThe dress code was modest. You pointed this out and she knew better. Everything that followed is on her.", "I don't know how to judge this. Your daughter was wrong ofcourse. But she was hurt and needed you.", "NTA.", "YTA. Stand up for your kid, you turd.", "NTA. Excellent parenting here, OP. No notes.", "NTA.  Your daughter can't hold you hostage with her beliefs.  \n\nYou wanted to be there so you dressed in an appropriate and respectful outfit.  \n\nShe tried to make a statement in a private venue and threw a tantrum because she wasn't allowed to. She's entitled to her opinion but not entitled to do it in someone else's private space.", "NTA.  She knew the requirements, you told her at the time of purchase and on the morning of the wedding. Why should you have to miss the party because she wanted to do what she wanted to do?", "NTA Emma got her first dose of consequences.", "I hope she gets as far away from you people and your toxic community as soon as she can. \n\nThese people are everything wrong with the United States.", "You reinforced a troubling narrative and alienated your daughter. she knew the rules but you’re still her mother. she needed at least your verbal support. she needed to hear from the woman who birthed her that her body is not something to be ashamed of. for that reason YTA. she is the asshole for expecting a rule to be changed. but think about why the rule was there in the first place and how you didn’t step in to reassure her that, though she had to follow the rule, the rule was regressive and targeted women’s bodies.", "NTA. She sounds like she’s got a small bit of I’m the main character issues and this was a pretty gentle way to show her the world isn’t revolving around her.", "NTA.  You raised her to know better *and* you warned her and she ignored you.  Some people just need to learn some lessons by experience.", "So this is more for the Y T A posters.\n1. While yes, it is an outdated concept, some families still practice some stupid dress code of modesty. This was a friend's wedding.\n2. Op has stated in the post she pretty much can where what she wants as long as majors part are coved. Around their HOUSE \n3. The friend was not the a for the modest dress code because that's also required in most churches.\n4. To those saying op should have stayed with her daughter. She is an adult and was warned by her mother twice. Why should op have to sacrifice time with her friend special day just because her daughter did not want to follow the rules that were set for the wedding. Again not the time or place to make a statement.  \n So op in my opinion is NTA", "I mean religious people are literally delusional but you are NTA.", "NTA. Consequences gotta love them.", "NTA.  My 16yo plays fast and loose with the dress code at their school.  I’ve made it clear that I will not come pick them up from school or bring a change of clothes if they get dress-coded, nor will I argue the case with the school ( we’re talking wearing t-shirts instead of button downs, not anything truly inappropriate for school).  They chose this school knowing it had a dress code.  We are not responsible for our children's informed decisions.  If they choose to eff around, they choose to find out.", "NTA\n\ngrown up actions grown up consequences", "Yeah she chose to excercise her agency in clothing and while the rules may be harsh, it was a voluntary event that she chose to attend. She should therefore take accountability for what happened", "Rules that apply in public don't apply in private spaces, and this private space made it very clear what rules did apply.\n\nThere's nothing to protest about, daughter is delusional if she thinks she's standing on any kind of principle that will rally others to her banner.", "Being told multiple times a dress doesn't match a stated dress code for a private event, then getting uppity when she is not allowed in shows the daughter may be 18, but she's still a child. NTA", "Just for the record, this isn't true everywhere. There aren't any rules about how you must dress to attend a church wedding in my country. I was very surprised when I read a different post a while back that people in the US can't just wear the dress they will be wearing at the reception to church.", "Did nobody notice the fact that that’s absolutely disgusting? Why do we put up with such degrading treatment?", "This made me laugh, thank you", "She was showing her shoulders. You known when you mingle with misogynistic asshokes even shoulders ca be considered pornographic.", "You act like these people were forcing her to be involved. Emma chose to attend", "You should probably edit your comment to include YTA. And you're right. It would be one thing if this was the \"weird\" relatives but the Mom has some pretty toxic norms as well.", "Dress codes in religious spaces (or any space really) are only problematic when they're not enforced on everyone equally. The Vatican, for example, requires knees and shoulders to be covered but I saw many men in shorts and tank tops being allowed in. However that's clearly not the case here - I doubt any man was baring his shoulder at this church wedding. \n\nI would be the first to stand up for Emma if she weren't being treated equitably, but it sounds like she just didn't respect the dress code. I'm as liberal as they come but private spaces are allowed to enforce whatever \"old fashioned\" rules they wanted as long as they enforce them on both men and women equally.", "It wildly depends on the church in the US", "But the invitation was specific about it, so she knew, so yeah it is not everywhere but in this case she knew.", "I think you have chur6rules and then you have the people putting the wedding together rules....both should be respected.", "It depends on the church, I mean in general it would be seen as in poor taste to dress like a stripper, but a lot of churches don't have strict dresscodes.  Usually Catholic churches have one for the bride but I don't know how much they police guests.  There is a general societal norm that you dress more modestly and \"nicer\" when you go in a church though, you just wont always get kicked out if you don't.", "It’s not just the US, when I did a tour with my choir through Eastern Europe, we were told to wear clothes that covered our shoulders and knees on days that we went to churches", "Isn’t this just a respect thing? You don’t have to go in but if you do you follow the rules of the religion especially in a temple of worship.\n\nIt reminds me of the time I had to take all my jewelry off before going into a monk monastery. I always just thought it was respect the religion in the place of worship", "hot take but you can choose not to go in. it’s a church, not Walmart. I don’t agree with organised religion but I love religious architecture, so whenever I visit another country, I dress appropriately on my “church hopping” days. I’m absolutely a crop top, tight jeans kind of woman, but you don’t have to “put up” with a church dress code.", "What treatment? This is their place, their rules. You don’t want to “put with such a degrading treatment”, don’t go there. Plain and simple. They don’t go to your house and demand you cover yourself, do they?", "Can you explain why you think that is degrading treatment. Or absolutely disgusting. \n\nWhen you visit a place, you respect the culture.", "I’m saying they shouldn’t be allowed to exist. Anybody enforcing “modesty” over no straps on a dress might as well be a member of the taliban.", "If it’s done to women specifically it’s misogyny. Would you be as keen on those rules if they exclusively applied to black people?", "Walmart used to have rules that applied to some demographics and not others as well, but then the Jim Crow laws were repealed.", "Treating our hair and our shoulders as if they’re obscene is obviously degrading, especially when it’s done to women specifically rather than every person. How would you like it if someone told you “your face offends my eyes, here’s a paper bag?”", "Because it’s imposing unfair rules specifically on women, criminalising their bodies because they’re female.", "So your rules are good and someone else has no choice over their own wedding? Your freedom stops at someone else’s nose", "So freedom for you but not anyone you disagree with?", "They have these rules in various Catholic Churches in Southern Europe. But for men the rules say: no shorts, no bare chests.", "Don’t most religions have standards for men also? I know a few that has men cover there hair also. I think it just depends on the religion.\n\nAlso as long as it’s not forced on someone, they have the option not to go in, then it seems fine", "No, it's not done to women specifically. The rules exist for all, but based on clothing styles, women are waaayyyy more likely to be wearing short shorts or tank tops. If a man came wearing short shorts, he would be turned away.", "you’re not comparing a church dress code to Jim Crow. you’re not.", "Sam Walton opened his first store in 1962 and incorporated in 1969, so Jim Crow laws didn't really affect them (Civil Rights Act was 1964)", "Yeah the less strict rules for men thing is what’s making me hurl. It sickens me that we put up with this. If it were a business we’d boycott it (and it is so we ought to)", "Those rules were also applied to an oppressed group for something they couldn’t change.", "TBH, I don’t see that the rules for men are less strict (I’d forgotten one: no short sleeves). The crucial difference is the covering of the head, but the rules in Catholic Churches have been that men must UNcover their heads for the best part of 2,000 years", "People do boycott churches that don’t align with their beliefs, they do it by not going to that church. For example, you would probably never go to a church with a dress code, boom boycott.", "right, because Jim Crow laws that literally stopped black people from entering places and getting served and forced them to give their bus seats to white people is the same as women having to cover their hair if they WANT TO step inside a RELIGIOUS BUILDING /s\n\nyou are delusional and you give feminism a bad name.", "going to church changes absolutely nothing in your life??? you don’t need to tell ME about black people and oppression, trust me. you do need to stop comparing oranges to apples tho. as a former Catholic, I have twenty million reasons to absolutely hate that dumpster fire of an institution. still not the same and you KNOW it. get mad at organised religion for finding conversion camps, misogynistic laws and covering up abuse. head coverings aren’t it"]}