{"id": 21196, "submission_id": "14p6eje", "title": "AITA for refusing my wifes request to throw away my beloved thrift store owl idol Oswald?", "selftext": "I found Oswald at a small weird thrift store, kinda beginning of Gremlins vibes. I have no idea what his insides are Made of but someone, possibly a retired taxidermist with dementia in a old folks home, painstakingly hot glue gunned feathers all over a pineapple husk or maybe piece of heartwood from the deepest woods. Or possibly a pile of fossilized rat carcasses ductaped together.         He has massive googly eyes that stare across space and time. I have anointed him with a chain mail necklace and a ring with real human blood infused. My wife thinks that A. He is trash and B. He controls my mind in some weird manner.\nShe actually said, and I quote \" imagine a towering heap of garbage, in a massive sprawling junkyard, and on top the stinkiest garbage,  there lies Oswald, waiting to be smushed into the rest of the trash where he belongs forever\" I found that  hurtfull and mean. All he want to do is watch over us and maybe cast some spells or something, levy some curses against redheads who say nasty things about kind old Owl idols...\nSo we are moving in a week, am I the asshole  if I keep him?\n[Link to pic of Oswald Ozymandias first and last of his line](https://imgur.com/gallery/oDOedun)", "created_utc": 1688351216, "permalink": "/r/AmItheAsshole/comments/14p6eje/aita_for_refusing_my_wifes_request_to_throw_away/", "score": 408, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I believe I could be the asshole for disregarding my wife's surprisingly strong feelings about the owl in question. I might be the asshole when I bring him to the new apartment and put him up very High where her 5'2 ass can't reach\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "This is easily the most bizarre post I’ve read today. I can understand why your girlfriend doesn’t want to keep a stuffed owl you put your blood in, however, because I’m beginning to suspect that YOU u/666truemetal666 are possessed by the owl, and the last thing I need is a possessed owl fucking up my life, NTA", "NTA. I was expecting something scarier! Oswald looks like a delightful little goober honestly. Thanks for having a silly post for this sub, sometimes it gets way too depressing and serious around here.", "I have a feeling if you try to throw Oswald out he will defy the laws of physics, space and time to appear in your new home prior to your arrival. Best to appease the gods of the new world and keep him in the family. NTA", "I was gonna say Y. T.  A....until I clicked on the picture and Oswald's mystical eyes bored into my soul... and the wall behind me. NTA. Oswald must stay", "NTA I love Oswald! Weird things are wonderful and they always tell a story. You'd 100% regret getting rid of Oswald and I think it's a strange hill to die on for your wife", "NTA \n\nHe is a little bit terrifying in a way that wouldn't appeal to many people, but I'm very much of the opinion that if something makes you happy and it's not hurting anyone else, you should be allowed that. Maybe try to come to a compromise with your wife in terms of where in your new place you could keep him where she maybe wouldn't have to see him as much but you could still love and appreciate him at your leisure.", "NTA. It doesn't matter what it looks like. It makes you happy and you've developed a personal connection to how it makes you feel. If she doesn't want to display it publicly for guests, fine... You should compromise on that. But to ask you to throw it out and be unnecessarily cruel about it is totally unwarranted.\n\nAre you able to store it some place safe? After her comment, I'm worried your wife might destroy it while you are out.", "NTA or maybe TA. I dunno I'm the kind of woman that would insist you keep your weird owl, for I have weird shit of my own and recognize that I could later use it for leverage. \n\nAll that being said I really think you should keep your weird owl. Relationships come and go, weird stuffed owls are forever (or probably a decade or two anyways, the taxidermied items in museums can be much older than that, they usually dye them and touch them up periodically though, don't know what kind of treatment your weird owl is receiving).", "I kinda love him.", "NTA.\n\nOswald terrifies me. Please keep him contained in your home so he doesn’t seek out a new place to haunt.", "NTA, Oswald. Please don’t smite me, Oswald. You’re a good owl, Oswald.", "NTA, I like him", "NTA. \n\nThat is the weirdest, most misshapen interpretation of something vaguely resembling what an owl would look like in one’s day terrors. \n\nHe’s awesome, he deserves to continue watching over his future sacrifi…I mean house mates.", "NTA, nah bro the owl stays.", "NTA if Ole Ozzy is just chilling, then no harm, no fowl", "*worships new dark God* NTA", "NTA. I’m sorry you are shackled to an Unbeliever, but her time will come.", "I think YTA if you keep her. \n\nLet Oswald continue to defy the law of Sunk Cost Fallacy. \n\nLet Oswald continue to mesmerize you…and me truth be told \n\nAnd one day, let Oswald, in all his lack of Majesty, and not some person you are connected to by a flimsy piece of paper, be the one to tell you when it’s time for him to fly away.", "This is something I would do. NTA I think I love him. \n\nAbout 12 years ago one of the insurance companies had that stack of cash with eyes (somebody's watching you) ad campaign. I got a pop up one in the mail. I set him up on my entertainment center and named him Bob. Bob died by toddler hands about a year later RIP Bob", "OK wtf are Oswald’s eyes made out of?!?!? 🤣\n\nNTA but Oswald should be hidden when guests come over & I can’t blame your wife if she refuses to have sex with you with Oswald in the room! Also your wife gets to paint the room Oswald resides in, any color she wants OR she can buy 1 thing that is weird or creepy or hideous or just plain embarrassing ….. then proudly display it next to that creepy possessed owl.", "NTA. Any woman who tried to make you get rid of Oswald should have to hit the road. Oswald will be loyal forever. There's lots of fish in the sea but only one Oswald.", "NTA\n\nPartners wanting to throw away your items is a red flag. But, that thing is kinda sht, ngl.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI found Oswald at a small weird thrift store, kinda beginning of Gremlins vibes. I have no idea what his insides are Made of but someone, possibly a retired taxidermist with dementia in a old folks home, painstakingly hot glue gunned feathers all over a pineapple husk or maybe piece of heartwood from the deepest woods. Or possibly a pile of fossilized rat carcasses ductaped together.         He has massive googly eyes that stare across space and time. I have anointed him with a chain mail necklace and a ring with real human blood infused. My wife thinks that A. He is trash and B. He controls my mind in some weird manner.\nShe actually said, and I quote \" imagine a towering heap of garbage, in a massive sprawling junkyard, and on top the stinkiest garbage,  there lies Oswald, waiting to be smushed into the rest of the trash where he belongs forever\" I found that  hurtfull and mean. All he want to do is watch over us and maybe cast some spells or something, levy some curses against redheads who say nasty things about kind old Owl idols...\nSo we are moving in a week, am I the asshole  if I keep him?\n[Link to pic of Oswald Ozymandias first and last of his line](https://imgur.com/gallery/oDOedun)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Could you put him in a cloche (glass bell jar thing)?  That could class him up a bit, and elevate him from “creepy taxidermy” to “victorian niknack / oddity”?", "**It's an eyesore**\n\n\"retired taxidermist with dementia\" describes it well, but so does \"towering heap of garbage, in a massive sprawling junkyard, and on top the stinkiest garbage\".\n\nWhile its not \"big\", at approx 10-12\" tall its large enough to stick out and just wreck the vibe of any room its in.   If it was something created by your sanity-challenged child I could see putting that somewhere visible, because Jr really needs the esteem boost\n\nIf you're trying to add that awful trash to any place in any room that your wife or guests can see... YTA\n\nYou want to keep it, put it in your man cave or hide it in your place of the closet, placed in a opaque container.\n\nYTA\n\nI don't think this is a serious post, but its worth the laugh.", "The Japanese have a word for Oswald, ‘kimokawa’…kimochi warui kedo, kawaii…creeps me out but cute. Never until Oswald have I seen anything that fits kimokawa so well. Keep!", "NTA. All hail Oswald.", "NTA this thing stared into my soul and said you should keep it.", "NTA. Oswald has personality.", "Lol NTA. Oswald is horrifying ugly but I am a weird person and appreciate weird decor. Maybe compromise and keep Oswald out of a main room and tuck him in a peaceful, quiet corner where she won't have to look at him too often.", "I would refer your wife to one of the best lines from AntMan when Scott gives his daughter her present.\n\n\"He's so ugly I LOVE him!\".  How dare she try and take that childlike wonder away from you.", "There is no God.", "Where will he live in the new house?", "Why would anyone want to get rid of Oswald!? Maybe it does control minds because i want an Oswald.\n\nBut honestly this one's weird. If it brings you joy then you shouldnt have to. She's allowed to voice her opinion. But she sounds like she doesnt know how to have fun. But then i'm biased. Oswald has gotten to my mind.", "Oswald must not be thrown out…ever. The world must know him. I’m not sure why I feel this way", "Those eyes. Those eyes. 👀", "Oh its not my blood. And my wife is the one who purchased the blood ring against the advice of wise friends", "Maybe this is the cursed owl wanting to posses me, but i like *REALLY* want it and agree NTA.", "His majesty is pretty blinding!", "Of for sure!", "All hail Oswald.", "I actually laughed out loud when I saw Oswald. He must stay. He’s amazing.", "All hail Oswald! The lord of the weird devourer of souls.", "But I prefer it when he lords over us!", "She's much too short and afraid of him to cast him out herself! (We also deeply love each other and don't do things like that)", "Hmm that's a interesting thought.  Feels more liek a thing you would do with a unliving object tho", "Eyesore??? Look at him he's beautiful!!!", "He has the most piercing side googly eye that's ever existed", "I suggested to my wife that we could put him in Victorian bird cage if that would be more pleasing and she said I'm done talking about Oswald... So I'm thinking throne built out of bird cages full of bones", "Whatever you say *Oswald*", "OP, gonna give it to you straight.\n\nI've been in a rage fueled mood all day, to the point of worrying it might trigger a manic episode.\n\nThen I clicked, met Oswald's soulful eyes.. and my rage is gone.\n\nSooo..\n\nSorry if Oswald turns into the Hulk should your wife attempt to remove him from the home. And if she does.. I volunteer as tribute to adopt him! 😍💜", "Yall buy weird stuff", "Imagine if you “threw him out” and he reappeared “mysteriously.” That’s something I’d absolutely do, but I don’t necessarily suggest doing so unless you want your wife to freak out.", "I've been laughing for few minutes at Oswald... This is the most bizzare post I've seen on reddit until now", "Do you doubt his power? He can see you no matter where he is.", ">he's beautiful!!!\n\nhahahahahahahahahahahahaha\n\nThere's a part of me that wants to buy that thing off you and give it to my mom (she's in her 70's) and tell her my daughter made it. My mom is someone who has always been the pinnacle of good taste in antiques.  Very prim and proper and I hated it all growing up and married her exact opposite.\n\nOswald would horrify her, but she loves my kids and especially things my daughter creates (she is objectively talented in drawing and painting).  To watch the dilemma on her face: should she throw that thing in the fire pit or does she  put it on the mantle in the entrance way?  I would love that.  She would probably put it in the living room on the credenza while we visited and tell us one of the dogs broke it later and \"she cried as she was forced to dispose of it\".  Sorry mom, I know you too well.\n\nYes, this would be so much fun watching her pain.", "I mean if she’s done talking about it, that sounds like a green light to build whatever cage you want", "LOL", "Not for sale. Well maybe like 20k. But I don't want the curse bro", "It sounded more like no more sex until the next full moon to me but I'll take that answer", "You know that you would only be TA if you did not follow the next logical step and start the Cult of Ozwald. Ozwald needs more followers and tax free status!", "NTA your wife needs to chill, I didn’t hear you complain about her Live, Laugh, Love sign in the kitchen. \n\nSeriously though, Oswald is a cool mascot.", "This kind of post is why Reddit is the best. LOL", "NTA Just tell her that you DID throw him out and he just keeps coming back.", "That thing is amazing! Don't throw it out!", "This really hit me in the funny bone tonight. I keep giggling at that picture of Oswald. All hail this lovely little googly eyed lad. NTA, it’s silly and harmless. Thank you for sharing him!", "no you are not the asshole , at the end of the day it belongs to you and not her", "NTA...Oswald and his guard rats are awesome!", "NTA. I kind of think he’s adorable.", "NTA\n\n\"He's so ugly! I love him!\"", "NTA\n\nOswald is a cutie. He must live on! Guess he’s controlling my mind 😂", "Lol I like him. I think you guys should compromised and have him put away but you shouldn’t have to get rid of him if he is sentimental to you.", "NTA! Oswald must stay! You need to keep him forever!", "I'm pretty sure it's just sleep deprivation but I saw Oswald eyes move and the red stone shimmer as I read the post, better keep him and not anger whatever spirits thats inside him.\n\nAlso NTA Oswald trash but magnificent trash", "NTA. Does he look like he can control your mind ? Yes. Did I instantly love him? Yes. Maybe move him somewhere where he can't control visitors to the house though. But keep him safe!", "Keep the owl. Throw out the wife.\n\nETA: NTA", "Never let him go.", "NTA i love oswald and would die for him, all hail oswald!!", "This is my new ab work-out...   ESPECIALLY the Owl-tax....", "NTA. Is there any reason Oswald should be the last of his line? Maybe your wife is simply jealous and wants an Oswald of her own. I suggest you make or find a Mrs. Ozymandias as fast as you possibly can.", "Move over Annabelle and the Conjuring Universe, Oswald is here.", "Yo Ozzy’s gotta hit the road", "NTA and OBVIOUSLY you should get a divorce.", "Hes a little bit cute tho.", "Where do I send my sign up fee?", "This is the way", "Only Oswald", "“Oh it’s not my blood” is the LEAST comforting thing that could have been said in response", "Nah it’s like the rose in Beauty and the Beast", "Hahahahahaha", "it’s right up there with [Jean and Jorts](https://www.reddit.com/r/AmItheAsshole/comments/rfwgmc/aita_for_perpetuating_ethnic_stereotypes_about/?utm_source=share&utm_medium=ios_app&utm_name=ioscss&utm_content=2&utm_term=1)", "For a minute there and due to a serious lack of coffee, I thought you were suggesting to put a green light in Oswald’s cage/throne to be. Like, perhaps it would help to put his grand awesomeness in a better light.", "Thank you so much for that. I hadn't seen that and really needed a laugh!", "At least the next full moon is in a couple of days", "NAH. \nYeesh, that is one ugly conversation starter but it's your home too. \n\nSo as long as it isn't telling you to do illegal acts and isn't giving your wife night terrors, keep him. \n\nBut please don't try to make more. Oswald's uniqueness should be enough for the world.", "Well that is one scary motherfer.\n\nI would throw him away, byt not before doikg some type of sealing ritual on him, cant let that abomination run wild in the scrapyard.\n\nSeriously tough. OP, come on… leave the demons to the wizards and move on from this dollarstore-annabell’esqe monstrosity.\n\n\nOh and why the fuck did you feed it blood?\n\nYta, but mostly scary.", "Oswald told me to say NTA. \n\nLuckily, I agree with Oswald.", "NTA. I for one welcome our new Oswald overlord.", "NTA - Oswald is the greatest thing to ever exist and as his owner, you are the greatest person to ever exist.\n\nYour wife is the biggest red flag of all red flags and you should flee in the dead of night with Oswald and leave behind a note that simply says, “you know what you did.”", "NTA. Oswald is family, obviously.", "NTA: I ❤️ Oswald", "NTA, personally i'd of replied with just 3 words F.O.B......Keep Oswald for as long as you damm well want !", "I’m going to suggest that he watches over your new home from a shoe box.", "Girlfriends can be replaced. Oswald cannot.", "This is brilliant. Keep Oswald, throw her in the trash. NTA. She’s jealous, GET HER HER OWN (I don’t think that will work - do not follow that advice)", "NTA don’t throw him in the garbage, i love him like a son.", "I want to say NTA for the obvious reasons but it appears he is currently residing in the kitchen…. Perhaps a compromise where at the next place he lurks in a closet instead of being allowed to see the light of day?", "NTA. All hail Oswald. May his loose eye never fall out.\n\nI totally get where you're coming from. Its a skrunkly little guy and you can't help but love him for it. Keep him in your office or something if she's going to be an ass about him.", "It's so ugly I love it!!\nI also have a sketchy handmade owl which consists of glued feathers on a pineapple or something lmao - found it at a garage sale -", "Oswald means something to you so should be kept\nGetting your wife to pick a companion for Oswald will maybe get her invested and to represent your togetherness \n\nGood luck 😸", "Omg he’s brilliant, my husband would hate him too! I have no advice here. You could take to hiding him where your wife can see him but just out of her reach. And then move him again by the time she comes back with a chair to climb up 😂 you could have some serious fun here", "NTA \n\nHe’s kinda scary looking and ugly but he’s so weird it makes him perfect, I love Oswald.", "NTA, that owl is awesome", "That things creepy", "NAH look, the owl is horrifying. I'm not gonna blame your wife for not wanting him and his creepy curse magic around. But since he already got to you and bewitched you, I guess there's nothing to be done.", "Yeah so I have a fuckin PROBLEM, some might say it's a mental disorder, but if I come across a really woebegone teddy in an op shop or the like, something inside of me breaks and I CANNOT leave without it. \n\nI know Oswald isn't a teddy, but I imagine I'd do the same if I saw him. Good grief NTA and please don't abandon this stunning woodland creature...", "NTA\n\nHaving an owl in the house is a sign of wisdom and blessings from the goddesses Athena and or Diana.\n\nAlso, googly eyes are cute. 👁️👄👁️", "I am baffled. But NTA. Keep your horrifying owl…friend? I hope friend.", "He reminds me of Hootie from The Owl House! Adorable. NTA", "Congratulations, the spell worked and you and Oswald won Reddit today.\n\nHe is awesome, please don't throw him away", "He’s a cutiepie, why would you get rid of him! NTA", "I’m sorry but wife is right. That owl woke me up from a dream only to summon me to your post, only to wish sleep wouldn’t have cruelly abandoned me. Why  why why Oswald!!!\n\nTo the wife, leave this man. He is obviously possessed and therefore can’t be trusted to leave the owl. They are bonded and soon will shave the cat.  Your eyebrows soon afterwards. \n\nTo the OP, Oswald is amazing. I’m not scared of him at all. Nta XD", "NTA Oswald will bless you for your faithfulness. \n\n*Hoooooooooooooooo*", "I feel better just knowing Oswald exists and even better knowing he is loved.\n\nDoes your gf know that Oswald cannot be disposed of? If he is then he WILL return and she will be disposed of instead.", "Your wife is literally hallucinating, thinking that poor little Oswald is a voodoo doll and is controlling you like wth? She also berates the toy saying it belongs in the trash and stuff like that even though she fully knows it holds sentimental value to you. Definitely NTA", "NTA. And for what it's worth, if Oswald by some insane miracle of the great beyond ever replicates himself like the aforementioned gremlins, I would beat a path to your door for one.", "NTA OP.  Your wife should be thankful that Oswald isn’t possessed by Chucky!", "Have you heard about the guy possessed by the owl?", "i pledge my fealty to lord oswald", "NTA Oswald would never hurt a soul, I can feel it in my bones, biting into the marrow.", "NTA, Oswald is wonderful and should definitely stay. He's part of the family now", "NTA because the only way you will be rid of Oswald is when he chooses to leave. He will come back to haunt her if she gets rid of him. Ultimately you’re protecting your wife.", "NTA\n\nAll hail mighty Oswald", "> B. He controls my mind in some weird manner.\n\nOh, your wife's very astute all right. Where's the blood from ? Who did y'all kill?\n\nI have no judgement. I'm *not* ready for the supernatural", "NTA, Oswald is magnificent. Oswald does also look rather like a Brownie Guide/Scout craft project of some kind though: fluff layered over random [non-literal] shite; feathers (possibly specially dyed by the group’s leader if brown ones weren’t easily available); & not simply affixing wiggly eyes to the fluff but putting them on some kind of gluestick lid/bottle top so they could be pushed into the fluff (durable!) & Oswald could have his fetching marker pen lashes (stylish!). Poor sod whose blood you fed him is probably compulsively doing Good Turns & feeling a strange urge to volunteer to herd small humans.", "LOL that is what I was thinking, if OP throws him out he will come back anyway, but this time he will come to haunt the girlfriend and make her pay!\n\nKeep Oswald happy for a happy home forevermore\n\nNTA", "Maybe your wife is simply jealous and wants an Oswald of her own.", "Why is this post telling op to get rid of their partner not the most up voted one in /r/AmItheAsshole? That must be some Oswald wizardry", "I am totally making an Ozwald. He is *glorious*. Never get rid of him.", "> Oh its not my blood. \n\nHow many have become unfortunate sacrifices to appease Oswald the Owl?", "Here’s an idea. What if Oswald wore a disguise? \n\nGet him a pair of those novelty disguise glasses with the nose and mustache attached. \n\nYour wife will wonder who the handsome mustachioed gentleman in your home is and you’ll get to know that Oswald is still watching over you. \n\nI suppose a monocle and a top hat would also work.", "He’s beautiful OP. [He looks like he would be great friends with our wall owl, who is also talented at boring deep into your soul with his void eyes.](https://imgur.com/a/xvn7p38) Wall owl would make a great simple servant to our overlord Oswald.\n\nDon’t get rid of him, dumb stuff that makes you laugh is always worth something, even if you hide him in a cupboard and bring him out on a rainy day.", "What is not alive can never die. Oswald is beyond your simple mortal concepts", "This is top Reddit.", "Maybe a cape and a cane (metal with a metal animal head at the top, because)?", "Just had hernia surgery and should not have read that post I laughed so hard I almost cried now im in so much pain from laughing 🤣😂🤣😂", ">Pam is NOT to apply margarine to any of her coworkers.\n\nis a quote that will never not be funny.", "Omg this was hilarious!", "That was a brilliant read, and I howled at the follow up! Thanks for sharing that!", "You can't put a price tag on Oswald's love"]}