{"id": 21245, "submission_id": "14ptbtw", "title": "AITA for saying I have two kids?", "selftext": "I've been with my fiancé for 6 years and she came in to the relationship with 3 kids, whom I adore. Their dad isn't in the picture very often (once every 6-8 months). They don't call me dad or anything but they treat me like a father figure. They gifted me a dog 2 years ago for Father's day (the fiancé was a bit upset about that one, whoops). \n\nWell, now my fiancé is pregnant (6 months) and we were out on the boat the other day with my buddy and my buddies wife. They were asking if I was excited about the pregnancy and having a biological kid and I said \"well, I have 2 kids now\", referring to my dog. My fiancé just got extremely quiet and didn't say anything. But my buddies wife piped up with \"Wow, you just made yourself sound like a fucking prick\". I ask why and she goes \"you have 3 kids at home that you've taken care of for 6 years but sure, only include the flea bag your fiancé never wanted and unborn child into the number of children you have\". I tried defending myself but ultimately the damage was done. \n\nNow, I spoke to my fiancé about it later (because she didn't defend me on the boat, but she didn't agree with my buddies wife either) and she goes \"that did bother me, and no, I don't want to talk about it. I have a lot to process right now.\" I tried again defending myself and that's when she kind of snapped at me and said that I not only made a fool of myself but also made her and her kids look bad in the process because I claimed my dog as my child but not the actual human kids I've helped raise. She currently isn't speaking to me and I've definitely heard her crying. Am I really wrong or is this weird women hormones?", "created_utc": 1688414902, "permalink": "/r/AmItheAsshole/comments/14ptbtw/aita_for_saying_i_have_two_kids/", "score": 2660, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I feel like an AH because I didn't mean it like that but at the same time, they aren't my kids biologically (though I wish they were) but my unborn and my dog (basically) are.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YTA\n\n“I love them to death and wish they are my kids but they aren’t” \n\nFor fucks sake, neither is your fucking mutt but somehow you count that. Everything else your buddy’s wife is on point.", ">  \"well, I have 2 kids now\", referring to my dog.  \n\nYTA - There is no way that you come out of this looking like anything but TA. You've been with your fiance 6 years and just said fuck you to her kids. Not sure there's much you can do in the way of recovery here but good luck with that", "“Weird women hormones?” No, genius, YTA. The unwanted mutt and the unborn child count as your kids, but the kids who love you like a father don’t? Biology is the least important part of parenthood. Just admit that you said something really stupid and hurtful, and start apologizing. Btw, your misogyny is really ugly too.", ">Am I really wrong or is this weird women hormones?\n\nThis alone makes you a huge AH", "\"Am I really wrong or is this weird women hormones?\"  \n\n\nCan I say YTA just for that?  \nYeah, you are really wrong. 3 children without a dad treat you like a father figure, you're with their mother and expecting another child with her. At what point are you going to consider those kids who you've been raising for 6 years to be *your* kids?\n\nAnd why on earth would you say that *in front of their mother!?!?!?!?*", "Completely YTA...bonus points for the \"weird women hormones\" comment.", "Buddy's wife nailed it. YTA.", "YTA. Grow up. It's not \"weird women hormones.\"", "YTA, do you seriously have to ask? You have been their father figure for six years and are going to be marrying their mom and you don’t see them as ‘your kids’ as much as the *dog*? And you think it’s ‘weird women hormones?’ Your fiancé is right now processing whether she really wants to marry someone who doesn’t see her kids as his own, and she’s right to, especially because of how much this will affect them when they see you treating the new baby completely differently than you treat them.\n\nAs a side note, YTA for accepting the gifted dog instead of telling the kids that a dog isn’t an appropriate gift and they should have gotten their Mom’s permission. Who even sells or adopts a dog to a minor?", "Info: You said you defended yourself. What's your defense? Why did you respond this way?", "YTA\n\nSounds like those kids look up to you and you have spent six years raising them. If I were your fiance, I'd be reconsidering the relationship right now.", "YTA.\n\nIt’s one thing to make a slip-up in conversation, and I do empathise with the fact that how one refers to step-kids etc in that kind of conversation can be tricky.  But for you not to realise that it’s SO important to treat your partner’s kids as if they are every bit as much “yours” as the new arrival, shows a startling lack of self awareness.  Your fiancé will obviously be feeling some trepidations about whether her kids from her previous relationship will get sidelined once the baby arrives, and the kids probably have some similar worries of their own, and it’s on you to reassure them that you’re there for the whole family.\n\nNow making the “2 kids” joke in the first place is an understandable error, like I said it’s a minefield and we all say the wrong thing sometimes, but the fact you seemed oblivious to why it was a problem at all until it was explained to you, and now you apparently still think you may have been in the right, just makes me feel like their (presumed) fears are justified and you’re poised to sideline your step-kids the moment your biological kid is born.", "YTA why would you date someone with children if you weren’t going to try and see the kids as something as yours especially when you help raise them. Like??? YTA", "YTA. You completely negated the existence of 3 actual children who see you as the main/only father figure in their lives. You're planning to marry their mother, and you're willing to dismiss her children like that right in front of her? Wow, you're one of the lowest I've seen here in a while.", "YTA.  You're raising your stepkids as your own, so they \\*are\\* you kids and deserved to be counted.", "YTA nothing wrong with counting the dog IN ADDITION to the other kids; “guess i have 5 kids now”", "YTA - Your fiancée considers you to be part of her family, which DEFINITELY includes her children.  The fact that you don't see them as part of your family is a huge red flag for her.\n\nI promise she's trying to decide if you'll be a parent to them after the baby is born, or if you'll only care about \"your child\".  And as their mother, she's trying to decide if it's worth it to stay in a relationship with you if it means potentially putting her children in that situation.\n\nThere is no defending what you said.  And for you to try to blame this on weird women hormones???  OML.  I will not be shocked when we get the update that she broke off the engagement and moved out with HER kids.\n\nEdit to correct the wording from \"pregnancy hormones\" to \"weird women hormones\".", "YTA for the reason your friend’s wife said", "YTA just for questioning if it's \"weird women's hormones\"... WTF is wrong with you?? 😅", "YTA let me get this straight, you consider the dog you’ve had for a year as your child but not the 3 actual human children you’ve helped raise for the past six years? \n\nI’d be upset if I was your fiancé too. Finding out you’re pregnant with the child of a man who doesn’t consider your other children as part of his family basically.", "YTA - bud, you proper fucked up. You have 4 kids, a dog, and one rightfully pissed off fiancé.\n\nThree of those kids might not technically be your kids, but they look up to like a dad. They got you a dog FFS.\n\nApologise and grovel to your family. Also, learn to think before you talk.", "YTA. Wow, bro, can you leave the \"weird woman hormones\" comment back in the 1950s?", "YTA for exactly the reasons your buddy's wife stated.", "I dare you to say that last line directly to you fiancé! \n\nYTA", "YTA, massively, for blaming her reaction on \"hormones\" instead of your own actions.\n\nThat alone says everything about you and explains why you don't get the stupidity of your original comment. It's a cliche of dirtbag behavior for a reason. You even had a 3rd party explain it to you and you still refuse to accept it.\n\nShe's currently re-evaluating where she and her-kids-you-do-not-claim-in-public rank with you (right below the dog) and realizing she screwed up.\n\nThe fact that you're blaming alcohol makes it so much worse. She knows peoples' true thoughts are revealed after they've had a few.", "Your response was indefensible. 100%YTA", "Okay, if you ever want to get yourself out of this hole you've dug, you need to NEVER utter the phrase \"weird women hormones\" again in your life.  JFC, dude, yes, YTA.", "I was fully expecting something along the lines of \"I included my biological children but not my step-children\" or similar. Not \"I'm including a *dog* as a child.\" \n1) YTA for lumping a human child into the same count as a dog. There were two acceptable choices here. This is your first child *or* you already have 3 kids. The dog doesn't count and I will die on this hill. It is legal to euthanize a dog, but not a child. Case closed.\n2) YTA for that \"hormone thing\" comment, too. Generally, emotions can get amplified during pregnancy, but they are never completely invalid.", "YTA.  So the pointed question from the other girl seems to be ‘how do you feel about having a bio kid’, normal type of question, as they know she has kids, and you’re involved etc.   so I don’t attribute any malice or disengenuous to her as the n t a’ers and e s h’ers are.   \n\nBut instead of just answering it, you attribute a dog you’ve had for two years as the same as a bio kid, and ignore the kids you’ve known for 6 years.   It would have been perfectly ok to say you’re excited for a bio of your own too, and the process and experience of pregnancy, infancy, toddlerhood etc…the stages you likely missed with hers.  \n\nYes, your fiancée does have a lot of thinking to do.\n\nAnd yeah, if she’s hearing you say things like ‘weird women hormones’…she’s really thinking right now", "YTA \n\nYou’re the AH for several different reasons. Not only did you embarrass your fiancée, you also embarrassed the kids. Imagine if they heard you say that?! Just because they don’t call you “dad” doesn’t mean they aren’t also your kids? You’re literally getting married to their mother. \n\nBesides that, it’s the fact you think the dog, THAT THE KIDS GOT YOU, is your child. And not the LITERAL HUMAN KIDS who got you it. \n\nWhen my parents met, my mom had my brother from a previous marriage. Yet my dad still treats him as one of his own, calling him his son. My brother doesn’t call him “dad” but still sees him as a father figure. You have NO excuses for what you said. \n\nLastly, “weird women hormones?” Dude you’re a grown man, act like one. Jesus christ", "YTA. You put your dog ahead of your step kids with the way you phrased it. It sounded like your dog and unborn child are your family and the step kids aren’t. I’m speaking in terms of why your wife is so upset. She thought your step kids were yours now too and she’s hurt by the line you drew differentiating them.", "YTA lol oh man you messed up big time, I can see where, why and how you made the mistake; but damn does that not excuse it.  Time for a giant paradigm shift in how you see your family and an at least equivalent apology (if not even more giant apology with family portraits and stuff).", "Oh my god. Another post about a man, a dog the wife/fiance didn't want and a pregnancy. Jesus Christ can the fake posts at least be a bit more original?", "YTA - You included the dog that your wife hates but not the children that you are helping raise, that thought enough of you on Father's day to get you a dog that they knew your wife didn't want you to have. \n\nAnd double YTA because someone called you out on it, your wife called you out on it, you wrote this and still didn't figure out yet you are an asshole, and then you added\n\n> Am I really wrong or is this weird women hormones?\n\nApologize, apologize, apologize.", "It’s hard to say if you guys have never talked about it. But, I, a mother to two children that aren’t biological to my fiancé, would be hurt if someone asked if he had kids and he said no. (We don’t have any animals). If you don’t look at them as your children, she is probably hurt. If you care for them and love them, you’re their dad. Dna doesn’t make a father, love does.", "YTA\n\nYou ballsed that one up, let’s hope that you can dig yourself out of not regarding those 3 kids as yours in any way.\n\nAlso it’s unwise to regard pets as children and not actual children as children.", "My bf (by son's only father figure for the majority of his life) gets angry if someone so much as implies that my son is not his. Your passive reaction baffles me. Way to take fatherhood for granted.", "She's your fiancée so they aren't your stepchildren yet. They are \"your fiancée's children.\" The issue is not claiming them yet, it's claiming the dog.\n\n\"As soon as we get married, I'll gain 3 children. We have 1 on the way, and 1 fur baby.\"\n\nIs the correct answer if you must include your dog. \n\nOr, \"I am a parent to 3, soon to be 4, children.\"\n\nOr, \"Yes, I'm excited about having a baby!\"\n\nYTA for ranking your unborn child and dog on the same level when that wasn't what your friend was asking.\n\nNot to mention, they asked you specifically about your *biological* child. Your fur baby doesn't meet the definition of biological.", "YTA and unfortunately showed her that you do not view her three children as your kids even though you are helping to raise them.  That must have hurt.", "Really really smooth, guy. YTA.", "YTA. Apologize to your fiancé right now AND REFER TO THOSE KIDS AS YOUR KIDS, BECAUSE THEY ARE", "It doesn't make sense that you write in your [comment](https://www.reddit.com/r/AmItheAsshole/comments/14ptbtw/aita_for_saying_i_have_two_kids/jqjsrjn?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=2) that you wanted to adopt the kids but the sperm donor doesn't want to sign off on it, that you love them to bits and wished they were yours and then when talking about your kids you just mentioned your dog and and the unborn.\n\nSo you wanted to adopt children you don't see as your own?\n\nAs your fiancé I would think about this relationship really hard.\n\nYTA", "If you honestly saw those 3chilren as yours you would of counted them as your biological or not \n\nGood luck with the birth of number 4. Hope your fiancées doing well", "YTA, also it is fiancée when referring to a woman. You included your dog but not her children. Your comments about her hormones are horrible.", "You think your pet is one of your kids?? It's a pet.\n\nSeriously, what is wrong with you?\n\nYTA", "INFO: What, \"weird woman hormones\" are you referring to? How are such hormones relevant to your situation and why aren't your own hormones relevant?\n\nPlease be specific when answering both questions.", "I'm assuming you view her kids as family, and if that's the case YTA. If you don't view her kids as family, then you've clearly mislead your fiance, as her reaction shows that she views you all as one family.", "I think you should show this post to your fiancee and especially the replies you've made to the various comments criticizing you, since it should make her decision a lot easier.\n\nYTA.", "YTA", "Honestly you should be happy and surprised if she doesn't boot you out. Everything you said and did showed your true character and where your priorities lie in her eyes. Being pregnant makes it 1000000000000000 times worse. Definitely you ARE TA", "Yep, YTA.", "You erased her children. You’re a magical AH.", "YTA", "Oh wow. YTA.", "Ohhh, what an easy one!!! you're  such an A!!! \nI'm a divorced mum of 3 wonderful kids that have NC with their dad, and though I've always wanted to find someone to have a new relationship with, I've always feared exactly  this. That my kids learn to love that man and get disappointed by yet another father figure that doesn't  appreciate the love they give so fully. \nIf I were your fiancée, I'd be crushed, I'd be questioning  everything. I'd be thinking I made the absolute worst decision  picking someone  that obviously is undeserving of my kids and my love.", "Wow. YTA. It's the fact the kids got you a FATHERS DAY present and you still don't consider them kids? I hope you're ashamed.", "Holy shit dude, I was willing to cut you some slack based on the title if it was maybe your bio kids vs step-kids (not a lot of slack, but I could see situations where that line might be drawn...)\n\nBut you called your DOG your child above your human step-children. What the actual fuck is wrong with you? YTA, for sure...", "Idk if it’s clueless man hormones that are clouding your judgment here but you’re absolutely TA here. Why exactly didn’t you count your 3 kiddos as your kids and your dog as one? That’s sincerely fucked up.", "YTA. You know she's reconsidering the entire relationship, right? I'm curious how many friends you're going to have after.", "YTA. My husband and I both had two boys from our first marriage when we met and a year after we married we had an oops baby boy and I tell everyone I have five boys and he does the same. We certainly don’t include our much loved cats when we count our kids 🙄", "The dog is not your child. While the fetus is your child, they're not even someone you've raised just yet. Certainly not for 6 years. What the hell is wrong with you? The fact you claimed the dog as your child, but not the children you've raised for years makes me raise an eyebrow at how the actual children are being raised and cared for by you. YTA YTA YTA", "YTA", "YTA\n\nYour soon to be step kids have only KNOWN YOU as their father figure, and to put the dog AHEAD of them makes you an AH", "YTA\n\nThose kids look at you and treat you like you are their father. Yet you claim the dog, who you like wise are not related to by blood, before you would claim them. You are engaged, she is joining her life to yours, and you see those kiddos as seperate. It's sad, I can see why you're getting iced out.\n\nBut what do I know, could just be all those weird woman hormones swimming around!", "YTA.\n\nSir. Your fiancé came as a package deal with three kids. That means you now have almost four human kids and a fur kid. You literally included a DOG that the CHILDREN gave you but not the children themselves. \n\nMy husband is in a similar situation. I have a 14yo, 11yo, and I'm pregnant. We've been together two years. When someone asks how many kids we have he says he has three but this is his first biological child. That's the correct way to answer. \n\nAgain in case you missed it, YTA.", "YTA", "… yes, you’re a giant flaming asshole.  Good god.  Really?  With cluelessness and tactlessness like that, you shouldn’t procreate any further.  Not that I think your fiancée is interested in it at this point.  \nJust fyi, my husband married me with 4 addon kids and we had one together.  Know what he says?  That we have FIVE KIDS.  He’s their dad in every way but sperm donation.  And he’s so so proud to claim them.  WTH man.", "YTA dude did you seriously try and blame hormones? You took care of these children and basically disregarded them and choose a dog. I'm glad someone said something yeah your wife has a lot to process.", "YTA.  Um...what are you trying to accomplish here?   What is your end goal?  How did you actually think she was going to take this?  Do you think this is funny?    As for your question...yes.  You are really wrong. Really...really...wrong.", "YTA. Why people don’t try to find out more about people prior to having their children is mystifying. Dude just leave. You don’t see what you did was wrong. You are asking total strangers if it was wrong. Your friends wife was the one to initially say something. Just leave break the engagement.", "Jesus Christ on a motorbike. YTA. You just holed your own boat. I hope you can swim.", "Yeah dude YTA 1000%\n\nIf you don't consider those kids your own by now, then I really feel bad for them and your fiancé. Because she's pregnant with your unborn baby they're basically all stuck with you. Realistically it probably isn't practical for her to leave you at this point but to be honest she should. She's about to spend her days making sure her first 3 kids feel loved and validated while you play favorites with your \"biological\" son and dog. This is a very unattractive thing for a man to do. Don't be shocked at all when you and your wife slowly drift apart emotionally and live like roommates for a few years before one of you finally realizes it's over and has been over since the day you disowned her children in favor of a dog. Your buddy's wife told you nothing but straight truth.", "YTA and your weird man hormones seem to be messing with your brain functioning. You have 3 kids that you raised but they don't count as your kids? Really now? And yeah, the canine shouldn't count. Waiting for this to appear on AmItheEx.", "YTA your fiancee's kids got you the dog for Father's day you insufferable boob", "Yes. You're really wrong. I'm sure she already loves the baby she is carrying but heartbroken that she's having it with the type of man that doesn't claim her other 3 kids, but does his dog.", "something tells me you’re about to have 0 wives. YTA", "YTA!! Weird woman hormones!?!?  Your buddy’s wife was point blank honest and correct!", "Always hold out hope that OP’s might rectify their assholeness at the end, but no this one was another nail in the coffin last line ending. YTA.", "We all need a friend like OP's wife's. \n\nYTA. Big time. She's \"processing\" how expensive and stressful it will be to leave you.", "YTA. You have really fucked it up, and if you actually wish to marry this woman you have a lot of work to do, and as fast as you can, before she leaves your sorry ass. If I were her, I’d honestly already be planning my escape from you, and to have it completed long before walking down the aisle or giving birth so… clock is ticking.\n\nWhether or not they are biologically your children, they are HERS, and you’ve been raising them as a father figure for 6 years?!?!! Why do you think she is even with you, marrying you, and having a child with you?! Good lord.\n\nETA: The woman hormones comment is another separate YTA. Get help or they are already gone…", "YTA", "Is it your weird man hormones that make you such a prick? \n\nYTA", "YTA - you need to go apologize immediately.  Once you accepted her into your life you also accepted her children. \n\nYou need to always include them. ALWAYS!!! \n\n\nGo apologize and tell her it’s not what you meant, but you understand why you’re the AH and you will never do it again.\n\n\nThe fact that you gave heard her crying, but haven’t done anything about it is pretty fucked up", "YTA.  She didn't defend you because it's indefensible.  Her kids treat you as a father and they don't even rank above the DOG?!?  Family is more than DNA.  These kids consider you their family and your \"defense\" is basically \"I'm not the one who nut inside their mother to make them so they aren't anything to me.\"  What you said and very clearly believe, whether you admit it or not, is absolutely putrid.  \n\n&#x200B;\n\nHave fun seeing your only biological kid every other weekend cause that's where this is going to end up eventually.", "If they don't call you dad and they aren't legally yours, then why would you be expected to feel like their father? And maybe that needs to change? Suggest adoption perhaps? Why don't they feel like your kids? \n\nEdit: Light YTA. If you've tried to adopt them, you can call them your kids, especially if she wants you to. I get you might want to respect the other man's rights, but...", "ESH (in the situation and in the comments) for the way they are bashing an innocent dog.", "NTA \n\nSo your friends say ‘finally having a kid’ so they themselves did not include your fiances kids, but kick up a fuss at you for doing exactly the same? \n\nMy husband has 3 daughters. I have a dog. No one gets upset that I dont go round saying I have 4 kids.", "NTA. I know I'll be downvoted for telling it like it is in front of the single mom brigade, but OP is absolutely correct: if the kids don't call you \"dad\" they're just wonderful kids who you've done your best to be around.", "Was it the most sensitive thing to say? No but does that make u TA after showing up for her kids for six years? No. Here’s what I would do-write her a letter telling her how you didn’t mean it and are sorry for hurting her. THEN (this is the important part) detail how much you love her three kids and reiterate that you will continue to love them and treat them in the exact same way as this new baby-because I bet she’s afraid you’ll love this baby more. I bet all will be forgiven!", "Honestly, NTA. Your buddy asked about *biological* kids. And frankly, I'd include a dog specifically given to you. Buddy's wife was *incredibly* out of line with her comment, but also, your fiance's reaction or lack thereof is completely understandable. Let her have her feelings. Continue loving her and her kids, and your dog.", "NTA. Why does she get mad if you don't call them your kids if they don't call you dad? I'd never make my stepdad call me his kid because I only call him by his first name. He's my mom's partner, not my father.\n\nI'm close to my cousins that I raised but I don't make them call me mom, even though I've done a better job than their actual mother.\n\nPeople are more messed up by actual titles than what actually goes on in a relationship. This is just another reminder to never date people or get with people with kids and be childfree.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI've been with my fiancé for 6 years and she came in to the relationship with 3 kids, whom I adore. Their dad isn't in the picture very often (once every 6-8 months). They don't call me dad or anything but they treat me like a father figure. They gifted me a dog 2 years ago for Father's day (the fiancé was a bit upset about that one, whoops). \n\nWell, now my fiancé is pregnant (6 months) and we were out on the boat the other day with my buddy and my buddies wife. They were asking if I was excited about the pregnancy and finally having a kid and I said \"well, I have 2 kids now\", referring to my dog. My fiancé just got extremely quiet and didn't say anything. But my buddies wife piped up with \"Wow, you just made yourself sound like a fucking prick\". I ask why and she goes \"you have 3 kids at home that you've taken care of for 6 years but sure, only include the flea bag your fiancé never wanted and unborn child into the number of children you have\". I tried defending myself but ultimately the damage was done. \n\nNow, I spoke to my fiancé about it later (because she didn't defend me on the boat, but she didn't agree with my buddies wife either) and she goes \"that did bother me, and no, I don't want to talk about it. I have a lot to process right now.\" I tried again defending myself and that's when she kind of snapped at me and said that I not only made a fool of myself but also made her and her kids look bad in the process because I claimed my dog as my child but not the actual human kids I've helped raise. She currently isn't speaking to me and I've definitely heard her crying. Am I really wrong or is this weird women hormones?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Do the woman a favor and leave or get help. You don't deserve to be in a relationship or a step-father if this is how you view your family. YTA", "Damn what the dog do?", "I think the OP is TA, but I just can't get past my curiosity about how the fiancée's kids managed to gift OP a dog without the fiancée's knowledge. How freaking old are these kids?\n\nAnd yes - I realize their age doesn't matter regarding the a ssholery.", "YTA and are you really that frigging clueless?\n\nYou're an a\\*\\*, she knows it now, its just too bad she found out about the real you AFTER she got pregnant with your 2nd kid.", "Unpopular opinion your the asshole for saying the weird women hormones thing I'm a guy and even I think that but your not the asshole for making a joke about the fur babies the people on Reddit attacking your dogs are the real asshole a joke is a joke", ">is this weird women hormones?\n\nYTA twice over.", "Gosh, I'm so glad the kids weren't there to hear that. Yes, YTA. I'm not even going to explain, everything has already been said.", "Are you fucking kidding me with that last sentence? YTA for that and all the rest of it. FFS.", "YTA and I’m genuinely wondering if you’re trying to top the guy who was such a huge AH the mods actually created a new title of Mega-asshole.", "No, you're the asshole because of your weird Male hormones.", "You could have said you have 3 bonus kids….", "Lmfaoooo you were TA before you said “weird women hormones” but goddamn I’m excited to read the comments ripping you a new “weird asshole” now 😂", "Let me guess, there was drinking involved?\n\nEdit: ESH. Everyone needs to calm down.", "YTA please for the love of god at least tell me you didn’t say this in front of the kids", "[removed]", "YTA. I have a dad and a stepdad. My stepdad calls me his kid. So does my dad. It’s not a difficult concept. Your poor fiancée finding out you’re awful while she’s 6 months pregnant is the reason she’s crying dude, not “weird women hormones”. You sound insufferable.", "ESH, you for dating a single mother when you're obviously not qualified to take on the responsibility and her unfortunately for not vetting you thoroughly enough. Those poor kids.", "\"This isn't too bad, YTA but like, I understand where you're coming from, maybe you should just talk to her-....\"\n\n\"Weird women hormones?\"\n\n\"....nvm if she killed you after this no jury would convict\"", "YTA. What the hell man?", "YTA  \n\n\nI'm not sure how you could make up for this. Holy crap.", "Maybe the dog _is_ his . . .", "He could ask to adopt the kids when they get married, but that would be just one step on the road to make things right to kids and mom.", "They have a father. You can love kids without claiming them as your own. They don’t call him dad and likely don’t look at him as their father. Why force something?", "And the dog is what the kids got him for FATHERS DAY.  Huge AH, I’m so glad the kids didn’t hear him say that, that would have been heartbreaking to them", "Maybe he thinks that he fathered the dog and it is also his biological child? Clearly, just raising a living being doesn't count, so there must be more to the story. Man, men's hormones sure are weird.", "And also \"*the* fiancé was a bit upset\" instead of \"*my* fiancé was a bit upset.\" Gives off old school \"the little wife\" vibes. 🤢", "That phrase alone makes him an asshole.", "They got the dog from their grandmother's puppy litter.", "I said that I love the kids to death and wish they were mine but they aren't.", "He kept trying to defend his position on the matter, which always makes things worse.", "and then he’ll have one kid. the dog. yta, what were you even thinking?", "They can be a part of his family without being his kids. They have a father, and whose to say they consider him to be a father to them?", "Yes, and **they** even got him the dog for FATHERS DAY.", "If she's still with him, it'll be good for faster kicking him out of her life.\n\nBig YTA, OP", "Weird hill to die on. Just because something is legal doesn’t make it okay. It should be legal to euthanize any animal (including people) in cases of extreme suffering that can’t be remedied and no other cases. Obviously children aren’t the same as pets, but pets are still an important part of people’s lives, and if referring to them as your child isn’t hurting anyone else why do you care? Obviously that’s not the case in this scenario bc OP is clearly TA but saying it’s wrong because you can euthanize pets makes 0 sense. Also, why do you think it’s perfectly acceptable to say that this is OP’s first kid? It wouldn’t make him any less of an AH", "While I disagree with the whole “my pet is my child” thing and think it’s incredibly stupid, I wouldn’t have objected to him saying he already had 4 kids. But the dog is his kid and the literal kids he is raising, the kids who gave him a Father’s Day gift, they aren’t?", "Plus, you know, he claimed the dog as a child. I have no idea how he got his DNA into a canine ... Or I don't *want* to know 😳", "I've suggested adoption but their father won't sign off, even though he has nothing to do with them.", "The word “finally” is never mentioned. The friends did nothing wrong", "My stepfather was the only father figure I had but we all called him by his first name. Being called \"dad\" is this context doest mean anything.", "Why do people get so messed up about names? It's just a title. It doesn't mean you love them any less.", ">if the kids don't call you \"dad\" they're just wonderful kids who you've done your best to be around.\n\nNeither does the dog call him \"dad\" but somehow OP included it as his kid", "The dog doesn't call him dad either", "Why would the “single mom brigade” downvote you? There are myriad reasons they might not call him dad, not seeing him as dad is only one. What’s that got to do with single mothers?", "Also the dog as he put him over the 3 kids too", "Where does it say “your buddy asked about *biological* kids? It doesn’t say it in the post and I’ve not read it in any of the columns. Why would OP include the dog, he was given for Father’s Day, if it’s only about “biological kids” ?", "The dog doesn't call him dad either", "The kids grandmas dog had a litter.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "What did he do, shit the dog out?", "And they're definitely not looking at him like a GOOD dad at the moment.", "Then why did they get him a dog for father's day?", "Why?", "Love how of all the comments this is one you reply to the one that doesn't mention how misogynistic you are", "You chose to address that instead of how misogynistic you are you coward", "Great, that makes it much easier to give it back because your fiancé didn’t agree to it and it wasn’t appropriate to do behind her back.", "You banged their grandmother’s dog?", "Omfg SO WHAT ah? Get out of here. YTA times a million.", "I mean...you didn't create your dog either....soooo", "Dude. You call them \"bonus kids.\" And you are a \"bonus dad.\" \n\n\nJesus christ dude.", "You just keep digging that hole deeper and deeper, don't you? They have been raised primarily by you and their mother for 6 years. Just because there's no biological connection doesn't mean they're not \"yours\".", "Right. The kids aren’t yours because they aren’t a product of your sperm…unlike the dog.", "OMG OMG OMG YTA. So so much YTA. That's your idea of defending yourself? Dude you made it so much worse.", "And you didn't help create the dog either......", "Surely if you care for them and provide for them, then they are important to you to the point they are yours??", "Ummmm, unless you knocked up a golden retriever, neither is the dog.", "INFO is the dog your biological child?", "You said they treat you like a father figure, so do they actually see you as their dad? Because a close family friend can be like a father figure.", "NAH but you majorly stuck your foot in your mouth. And never comment on a woman's hormones ever again.\n\nThese situations can be difficult and each situation is unique. I'm a stepmom and in that situation I probably would have said, \"Well, I have (my stepson's name), but yea, I'm really excited about the new baby.\n\nPeople tell me that I shouldn't call my stepson \"step,\" but that is what works for us. His mom was threatened by my presence. He doesn't call me mom. Your bonus kids don't call you dad (at this point).\n\nI think you and your fiance just need to have an honest conversation about this, and it's a fluid situation that will continue to change over time. There is no one size fits all when it comes to blended families.", "Why arent they yours? Are you not raising them, are you not their father figure?\n\nMy dad had no biological connection to me. I was still his kid", "Your dog isn't your kid either so....", "You can refer to your pet as whatever you want and come up with whatever excuse to pretend it's your child, it still doesn't make it your child. It's a pet at the end of the day. \nIt's the fact he qualified his pet more than the children he raised for the past 6yrs and was a father figure to just shows where his priorities lie.", "How can you suggest adopting these children but can not bring yourself to say they are your kids?", "You can still go to court about it, especially if he isn't in their lives.", "If you've tried to adopt them, you can call them your kids, especially if she wants you to. I get you might want to respect the other man's rights, but...", "It’s pretty often used against women when we’re upset about anything, ever heard someone say “Are you on your period or something?” To a woman when she’s upset? Or “Must be that time of the month”? It’s used to make us seem unreasonable or crazy for being upset.\n\nJust comes across as quite patronising and misogynistic.", "Because it's misogynistic?;", "Why do you ask? Is it that time of the month?", "Because only ahs insinuate that a woman is not reasonable because of her hormones when she criticize them.", "Because “weird women hormones” is an asshole thing to say under any context and you should never dismiss a woman’s feelings as being something as insignificant as an unknown hormone problem. It makes him sound dense, inconsiderate and shallow.", "No but she's mine and mine only. I have to share my fiancés kids.", "So then why don't the kids call him dad? It's a two way street. They don't see him as their dad either.", "The kids are not legally his, unlike the dog. You think a man should assert a claim over another man's kids? This is a delicate situation.", "Let’s not get ahead of ourselves, that could very well explain why she never wanted the dog.", "I think it bothered her more so because she always says \"our kids\" and generally speaking, I do too. I just had a few on the boat and wasn't really thinking about it like that.", "Yes, I agree, as I said, children aren’t the same as pets and OP is clearly the TA.", "You realize you will also have to share your biological kid with her, yes?", "You're right. This should have been sorted out a long time ago. If you aren't going to be a \"bonus dad\" to these kids then you never should have gotten involved with her", "With who? You said their dad isn’t in the picture.", "Why would the kids give you the dog for FATHERS DAY if you aren't their FATHER????\n\nYTA", "Well that’s not creepy at all /s\n\nYTA and I feel sorry for ALL the kids.", "No child is “mine and mine only.” All kids take 2 to create. Yes your step kids have a 3rd parent who per your description is flaky and not very present in their lives. They’re giving you Father’s Day gifts…. Dude. Open your eyes.", "The dog isn't biologically his either", "OP states they see him as a “father figure” and that their biological father won’t let him adopt them despite only bothering to see them every six months or so. There are myriad reasons why they might not call OP dad*, not just the assumptions and projections you’re giving as reasons for your claim. Or are you claiming you actually know, as a fact, what is in the minds of those kids? \n\n\n*These are all real life things I’ve heard from other kids and parents: they might associate the word/name “dad” with their biological father so it has negative connotations, their biological father may guilt trip them/emotionally threaten/manipulate them into thinking they aren’t allowed to call another man dad, if it hasn’t been expressly talked about they may be worried OP wouldn’t like it.", "They’re his step kids. There’s zero reason not to claim that.", "I've tried adopting those kids but their sperm donor won't sign off on them, even though he has nothing to do with them.", "😂😂😂", "So your excuse is \"But I was drunk!\"? Let me tell you a proverb where I'm from: \"A drunk man's words are a sober man's thoughts.\" You need to take a good, long look in the mirror, dude.", "Oh, cool.  Now you're going to the try the \"But I was drinking so....\" excuse.", "That just means it was easier for you to say what you really thought.", "INFO: If you do at some point legally adopt them then would you consider them “your kids” or no because they don’t share your dna? \n\nIt sounds like you’re placing stipulations on when they would count as your kids but you automatically counted your dog which you’ve had less than a third of the time they’ve been in your life. It’s not a defense to say “I love them but they’re not really mine because my sperm wasn’t used in their conception”", "YTA. If you marry someone with kids, particularly kids who are under 18, you NOW HAVE KIDS. It doesn’t matter if they don’t see you as their dad, you are a parent. Honestly this would be a relationship ender for me and I AM speaking from experience", "YTA \n\n>Am I really wrong or is this weird women hormones\n\nFor God's sake. I'm going to have to say this loud. WOMEN CAN BE ANGRY WITHOUT IT BEING BECAUSE OF \"HORMONES\" \n\nMen seem to think that they are the only ones allowed to feel angry or annoyed,  but when a women does it, it's only because its her time of the month, or she's pregnant and that's the only reason she's pissed off. \n\nYou say you love these kids but then infront of people make a point of implying the opposite. No wonder she's upset", "You're a fucking tool and I love your friends wife. Poor kids.", "\"Weird women hormones\"? Wow. Yuck. Hope you enjoyed the relationship cause I'm sure it'll be over by the end of the week.", "YTA. Those kids are your step-children and they count AS MUCH as biological and fur children.", "You showed your fiancé that you don’t actually care for the children you’ve helped raise for the past 6 years. She knows your lie and there’s a reason she said she has a lot to process.\n\nYTA and I hope she realizes that raising kids alone is better than being with a misogynistic man who doesn’t value her family or feelings", "YTA my dude what the FUCK is wrong with you? You clearly don't love those kids the way you think you do if not only you said that but tried to argue how you were right. \n\nPoor fiance. Ouch.", "Big big A.\n\nYTA", "YTA in so many ways. Soooooo many ways.", "\"Weird women hormones\"? 🙄 Oh boy. And then all that came beforehand. YTA", "YTA\n\nHow did you get a Father’s Day gift if you weren’t a father?", "YTA\n\nYou sound like one of those fathers who is going to spoil their biological kid like crazy and treat the other two kids as less than.", "Even if I was going NTA all the way through that (I wasn’t) the “weird women hormones “ would have flipped me. \nYTA on so many levels", "YTA, \"weird women hormones\" is very dismissive, are you 12? \n\nYou could have just said yes and moved on. \n\nAlso a dog is not a child nor does it even compare and that was a weird thing to say.", "YTA.   If she's smart she's no longer your fiancé.", "Yep. YTA.", "YTA You adopted those kids way before that dog came into play!", " YTA x1000. and blaming it on the hormones is a disgusting and pathetic attempt at deflecting from the real issue here. you clearly don’t care about your fiancés children and your buddys wife was 100% correct in everything she said.", "YTA just for that last line. Considering the rest, you are doubly so. I bet she's considering leaving you, and within good reason", "1000% YATA - how inconsiderate of your fiancee and those kids who love you", "Definitely YTA. \nLike you said while they don’t call you dad they see you as their dad. You disregarded them and made the dog more important than them who you’ve known and cared for like your kids, for the last 6 years!", "YTA and she may never forgive you.", "YTA.\n\nIf this were a 90s movie, the 3 kids would've accidentally overheard you while hiding on the boat, then they'd pop out with a present for you with sad faces. Except in the movie, it would've somehow been a misunderstanding and after a long montage of your relationship being ruined, the truth would eventually come out and everything would be fine.\n\nBut in your case, it's not a misunderstanding. You *actually* said that about them. Right in front of their mother. Wow. If I were her I'd never forgive you for that.\n\nShe's in a tough place now because she knows her children love you, and she doesn't want to tell them what you think of them and absolutely break all their hearts. But she probably wants to leave you and get her kids away from you, and isn't sure how.\n\nY definitely TA, and it's extremely sad how you could feel that way about the dog they gave you for **\\*fathers day\\***, but not for the kids who were celebrating you as their father figure in the first place.\n\nEdit: italics and bold added.", "I was gonna give you the benefit of the doubt until \"weird women hormones\". Jesus. Your poor fiance.\n\nYou may have meant it as a joke, which I would have said gentle YTA for, as in isolation that sounds like an innocent blunder rather than malicious. But I'm beginning to wonder if there isn't more to to the picture that would explain why your fiance/friends might not have felt it was actually a joke.\n\n*Edit*: the more I think about it.... heck, my stepmum didn't come into our lives til I was a teenager and even she claims us as her kids/part of her family. And our mum IS in the picture (happily so), stepmum doesn't seek to replace her, but she at least sees us as part of her family and responsibility. Same with my dad about her kids. \n\nMy pal met his wife when her kid was a toddler, and he didn't think twice about adopting - kiddo was calling him Dad before the couple were even married. To the point that when kiddo was diagnosed with ADHD, same as Dad, Mum sat kid down to talk about genetics before suddenly remembering that kid couldn't have inherited the ADHD from dad since he didn't technically contribute to kid's genetics, haha. \n\nAnyway, none of these parents contributed genes or birthed me or my friend's kid, but still managed to wrap their heads around being good parents in a way you have yet to, apparently.\n\nI'm also so concerned about how your older kids are gonna feel when you inevitably favour your bio kid and hold your bio kid in higher priority than the kids who came first.", "*sigh* what is it with men asking 'is it her crazy hormones?' Especially with pregnant women! No, dude, YTA. You just told the woman you apparently love that you don't view her three children (that you've been raising for 6 years) as your children. Not only that but, to add insult to injury, you DO count the dog as your 'child'. Nothing to do with hormones dude, just your asshole words.", "How did 3 kids buy you a dog without their mom's help?", "Yta. I wouldn’t be surprised if she leaves you. Since you don’t seem to understand what you did and how hurtful you are to all of them. Good fucking luck trying to get her to forgive you.", "YTA. That would have REALLY hurt me if I'd ever heard my step-dad say anything like that. As it is, once my step-dad's mom said something along the lines of, \"well you're not *really* my grandchild.\" It hurt my feelings really bad and I've never felt the same about her.", "YTA \n\nThat’s such weird logic I’m not sure I would have understood that you meant the dog and unborn child. I’m surprised your friends and fiancé even knew what you meant. Or maybe they did need clarification but was just summarized in your retelling. \n\nOnce I did know what you meant I’d definitely think you were a jerk. It’s fine to acknowledge that this is your first biological child but you can either group all your kids together step and biological or you can say this is my first biological kid and I have step kids also, but to group the dog in with your bio kid really does sound like it couldn’t be anything else but a dig at your step kids, they are below the dog, and I don’t know why you would expect anyone to take it any other way. \n\nOr maybe it’s my weird woman hormones", "No I don’t think so you are the bad person here. She’s bound to be a bit hurt, but you are not the father of her children , and it looks like you are going to be a first time father so I suppose in time you will be ok with saying that you have 4 or more children once you learn to recognise the emotions that being a father entail.\n\nI think you are doing a good job. I mean you are certainly ok with your partner coming into the relationship with 3 kids. If my bf walked in with 3 children, I don’t think I would like to continue that relationship. You are engaged to this person which shows intent of long term commitment. Children are not cheap so I am sure there is some financial contribution from your end. I wonder if her children consulted her before getting you a dog that she doesn’t like.", "The comment at the end about woman hormones sets of major red flags this is a bait post.", "What? You called the dog your \"kid\" but not your...kids? Biological or not you've become their father. This could be an offhand comment and not make you an AH on its own. But since you seem to not understand why this would be offensive and are doubling down in the post, YTA.", "YTA but info: How the hell do three children get you a dog without the consent of their mother? Or did you buy yourself a dog and say it was from the kids?", "Yta", "Before my husband and I were even engaged and just living together he would say he had 2 sons. \nOne being my son from a previous relationship and the other his own.", "YTA a dog and your inborn baby are your only children?", "I would have read only the main post I would have said N T A. I mean the question was about bio kids and adding the dog was obviously a joke. Me and my husband refer to our animals as kids sometimes but we are aware that they aren’t actual kids. So it seemed harmless. But your explanation to her was just weird and clumsy and could be hurtful and you don’t recognize it. All you had to say was “of course they are my kids but they are step kids and the question was about bio kids. I just added the dog as a joke”", "Having a child by a woman that already has 3 kids is a massive fuck up. Besides that it wasn't the best choice of words", "If my partner made these kinds of comments I would seriously be rethinking everything I thought I knew about them and I’d consider leaving. \nYTA", "YTA!!! WTF man! The dog isn’t your blood either, it was a gift for father days from the kids that aren’t yours. Really! They think of you as a father but to you the dogs is in a higher well deserved spot than them! \nYou are more than assh.", ">Wow, you just made yourself sound like a fucking prick\". I ask why and she goes \"you have 3 kids at home that you've taken care of for 6 years but sure, only include the flea bag your fiancé never wanted and unborn child into the number of children you have\n\nSPOT ON. \n\n>that did bother me, and no, I don't want to talk about it. I have a lot to process right now.\n\nIt definitely bothered her, and there's nothing you can do to fix it. A line has been severely crossed. This isn't \"weird women hormones,\" this is her trying not to escalate the situation in a time of high emotion. Any sane person would need to rethink the relationship after hearing their partner of 6 years say something like that. \n\n>Am I really wrong or is this weird women hormones?\n\nYou're really wrong. And that last sentence shows a lot about your character, more than the rest of the post. YTA", "Yikes on bikes. YTA for so many reasons.", "YTA.  I can't believe you had to come to reddit to ask, thinking you might get the pass.\n\nDisgusting.", "YTA and that crying isn’t “weird women hormones” it’s your fiancé reevaluating every choice she’s ever made involving you, you Burke.", "I think if my husband had said this I would never ever feel the same no matter what he said. I’m grateful my husband always includes his non biological daughter when referring to our kids. You’re definitely TA. My gosh.", "NTA. This really seems to me like a no-win situation. If you count your stepchildren as being \"your\" kids, despite them never calling you \"dad\", then you're stepping over a boundary they set and forcing your feelings onto them. If you don't count your stepchildren as being \"your\" kids then your fiancé will think you don't care about them. There was no winning for you.", "Yta, right now she is rethinking yr relationship as you don't see the kids who love and honor you as their dad as yr kids. It's not about blood. You have been in their lives for years. They consider you a father figure. They gifted you the dog for fathers day whom you claimed as yr kid but not the actual kids.......yr thoughtlessness and the fact that you don't seem to comprehend why this would be upsetting to the woman who agreed to spend her life with you is astounding. Now she will wonder are you going to treat the baby differently as you don't consider her kids your kids. Will her kids feel less than and unloved? Will they be treated unfairly by you? Will you favor yr kid and not the others because they are not yours? This is a deal breaker.", "YTA for rating the fucking dog above your step kids, jfc.", "NTA small ESH. Downvote away folks but it isn't what he SAYS, it's what he does. He has done more for those kids than their own father. He made a stupid joke, but there is no indication whatsoever that he has done anything but be good to those kiddos. He's not a demon and she shouldn't \"leave him\" over one stupid comment. I swear I can't with this sub sometimes.", "Lol at all the fucking people here saying you're an asshole. Your friends specifically called out whether you were excited having a **biological** child, as if it were being more important than your other kids - who's the asshole there? They put you in a bad spot either way.\n\nEveryone in the comments is focusing on your response, not what position your friends put you in. You responded with a joke.\n\nHonestly, ESH", "NTA. You do have 2 kids, a puppy and one on the way. You have 3 future step kids that you love. That doesn’t make them “your” kids. As you said, they don’t call you Dad.", "YTA and I hope your kid's future stepdad is more accepting and caring toward your kid than you've been to your future kid's half siblings. You still don't get what you've done wrong and stop gaslighting her by trying to blame it on her hormones. Don't be surprised when she dumps you for this.", "NTA they ain't your kids", "I have to say NAH. The way the question was posed, about being excited to have a biological child, ALREADY distinguished between his unborn child & his step kids (who don't call him Dad). I can see OP just following the logic of the conversation and adding in his dog, who he raised from a pup and has no other owner, in an attempt to be cute. Not fond of the 'weird women hormones' comment, but considering she is pregnant, I get where he is coming from. She is overreacting given the above context of the conversation, but it sounds like this made her sad, and she isn't trying to start a fight, so NAH. I hope you guys can talk this out, OP. You sound like a great step-father to me.", "NTA - sounds like you were trying to make a joke about the dog in the context of someone saying you’ll have a child of your dna. Let’s be real, legally speaking, her kids are not your kids, plus, they don’t even call you dad. Are you the dog’s owner? \n\nShe’s upset about her life more so than your poorly executed joke. It’s a tough situation, but if you want to fix it, I’m sure there’s a way forward.", "NTA.\n\nNot everyone sees step kids as their kids. Society is very hypocritical when it comes to step parents, and you'll always be in the wrong regardless of which stance you take.", "I'm gonna disagree with a lot of people here and say NAH, except for you saying \"weird women hormones.\" The F is that?\n\nI get your point of view. Fiance's kids have a father, and you two are not married. At any time over the past 6 years and even now, she could just decide to up and leave, and you'd never be able to see her kids again. So I get why you wouldn't claim them as \"your\" kids, but you could have worded it a little better.\n\nI can also see why your fiancee' was upset. She likely views you as a father figure for them, and likely read into your statement thinking you don't care for her kids as much as she thought you did. Neither of you are wrong, just talk it out.", "YTA I feel so bad for your fiance right now. How sad  and unhappy she must be right now. Her heart is breaking for those 3 kids and she is probably re thinking this whole relationship. She definitely needs a friend to comfort her right now", "YOU SAY THE KIDS ARENT URS SO U CANT CLAIM\nTHEM MY GUYYY DID YOU BIRTH THE DOG????\n\nYTA. FOREVER. GROW UP", "Oh man. \"Weird Woman Hormones\". Buddy YTA with no hesitation.\n\nYou can't even use the \"but I was speaking from a biological standpoint\" since you included the dog.\n\nYou painted yourself into a corner with this one. Good luck getting out of it. You owe several people, but especially your wife, a huge apology.", "I need more information. This seems like the dumbest hill for either to die on.", "YTA weird womens hormones? Sounds like you’ve been hanging out with too many guys who chalk up women’s feelings to being just hormones. You’re a tool. You helped raise those kids for six years and you’re thinking about marrying this woman. Guess you were never planning on being their step father.", "Ew. \n\nI have a stepson. I decided, on the day I met him (his third birthday), that he would never, ever hear me say he wasn't my kid. He has to *live in my house*. With stepkids, you are in or you're out. There is no in between. She,'s crying because she just realized you might not be in.\n\nAnd weird woman hormones?!  WTF is wrong with you? The woman you are going to marry has a fucking brain, and she's using it to figure out how she fell in love with a man who thinks a dog is more connected to him than the actual human children he's been raising. \n\nYTA", "Nta", "Unpopular opinion but NTA. They don’t call you dad.", "NTA - they said biological kids, of course he's going to think of his one biological child and the bog which was in a way given to \"him\" and was his first. I can understand this answer, it feels like he was just answering the question", "Buddy’s wife was spot on. YTA. What a lousy stepdad you make. At least the kids are used to having shit dads.", "YTA, but I’m disappointed by all the people on this thread shitting on the dog.", "Whoa, what a colossal mess you created. Do you not consider them your kids? If you don’t then why are you with your wife? There are a package deal. You became dad, they treat you like dad, and still that isn’t enough for you to call them your kids. Bravo to your buddy’s wife for calling it like it is. And don’t try to chalk up your idiocy to hormones. Your comment was thoughtless and cruel, regardless of anyone having hormones. YTA", "YTA but I’m sure (at least I hope) you didn’t mean anything by it. I think you should seriously apologize and be willing to love your 3 step children like your own. Show with action that those kids are important to you and they are your family. Your wife is probably worried now that you’ll have a bio kid that you will treat the first 3 as less than. Her mind is probably racing with fear hurt and insecurity. You owe a big big apology.", "Your friend’s wife is a hero for calling you out. YTA.", "YTA and you obviously know it", "NAH you had your foot in your mouth. that's about it. \n\nand don't say weird women hormones, jesus you say stupid things a lot.", "YTA, YTA, YTA and in case it needs repeating for those in the back YTA\n\nYou have children who love you enough as a dad to give you a gift for Father’s Day and you count the gift they gave you as a child of yours but not them. Would you want us asking if it’s weird man hormones that made you claim the dog and your unborn child as your only children?", "YTA.  I am just glad the human children werent there to hear you; it would have hurt them deeply most likely.", "Well, even though I don’t think you meant any harm with your comment, it was still a pretty stupid thing to say. I mean, you should have said that you have 5 kids.\r  \nHow do you truly feel about the three kids? That is something you need to think about, and once you have made your decision, tell your fiancé. Oh, by the way, whenever a pregnant woman has an issue, never, ever blame it on hormones, it probably won’t end to well for you.", "Makes me wonder what else you've said to her over the past 6 years.", "YTA. Get some therapy or read a book. Or both.", "Jesus Christ man, grow some self-awareness.\n\nYTA.", "How do kids give you a dog that their mother didn’t want?\nAlso YTA massively. And if she goes ahead with marrying you it’s probably only because it’s easier than leaving you. You utter donut.", "YTA, but I am surprised that this had not come up before since you have been living together for years.\n\nTry to cover your butt by saying something like, \"I didn't think I had the right to call them my kids before we were married, but I would be happy to call them mine if you are ok with that.\"\n\nNow it is your job to assure her that you love both her and the kids- and don't add, \"Almost as much as I love my very own dog.\"", "You're an astronomical asshole. You're marrying this woman, got her pregnant, and don't consider her children your own. Even if she co-parents with her ex, if they are in her life, they are in YOUR life.", "Wow... Please tell me you're not that daft. You just pushed the fact into her face you NEVER considered those kids family, even though you treated them as such and I'm telling you what's on her mind now... How you'll act towards HER  kids, because... Well, you know, you don't consider them an ounce of your family, once the baby arrives and soon she'll have to deal with four kids alone because you'll turn your back on the kids the minute the baby is home just like you did on that conversation. \n\nCongrats for damaging your relationship beyond repair. YTA and I think apologizing is useless at this point, you fucking dug your grave so deep, you'll probably burn from being so close to the equator.", "I'd be absolutely heartbroken in my stepdad didn't think of me and my brother as his kids. He's as much or more our dad than our dad, and he agrees. If he didn't though... oof. It would hurt.", "If they’re giving you Father’s Day gifts they’re you’re kids regardless of whether it’s biological or they call you dad", "Why does it matter if you’re right or wrong? You hurt her feelings and you can hear her crying. YTA.", "WEIRD WOMEN HORMONES?!\n\nYTA. And an idiot.", "1. The three kids literally have a dad. Their dad exists.\n2. They do not call OP \"dad.\"\n3. He adores the three kids and seems to treat them well. Otherwise presumably his fiancee wouldn't be marrying him.\n4. He simply didn't call them his kids, which is accurate enough.\n\n**Maybe he is literal minded, and to him they are his beloved** ***stepkids.*** **Maybe understands that actions and years of \"showing up\" matter more than** ***labels.*** **Either way, NTA. The commenters clutching their pearls are being ridiculous.**", "YTA. They couldn't have said it better on the boat - you have 2 kids you decided to step up and become a dad to, you have a fleabag you're a dad to, AND you have a baby on the way. \n\nNot great at math, but that's 4. How would the 2 kids, who see you as a father figure feel about being excluded from that count?\n\nYTA so it sinks in this time.", "I see nothing wrong with considering the dog your child, but excluding the kids definitely makes YTA.", "Seems like a dick move", "I refuse to believe this man exists.", "YTA\n\nMy uncle married a woman 30 years ago who came with a child.   He was always his kid, even after they got divorced 4 years later.  If you even suggested he wasnt my uncle would get pissed. 20 years ago, my uncle got remarried, same thing, that's STILL his kid, and he'd still come over and hang with his NEW bros and sis and to family events.  That kid is also my cousin, my parents nephew, and my grandmas grandkid.\n\nThat kid got married last year and the whole family celebrated with him and his new wife.\n\nI am appalled that you would ever even think otherwise.  ESPECIALLY to 3 kids who have no other real father figure. Your soon to be ex is probably about to make a real tough decision.", "CONGRATULATIONS, you have won AH of the year!!! I honestly don’t know why your fiancé would want to stay with a guy who would put a dog before the children he helped raise.\n\n“Weird women hormones”… YTA for that sentence right there.", "Wow.. YTA...\"weird woman hormones\" is just the cherry on top. Your friend is right.. you are a prick.", "“Weird woman hormones”? YTA????? The fact that you needed to ask this in the first place is baffling", "\"This dog I adopted is my child. These human children I adopted somehow arent.\"\n\nWhat a story mark.", ">Weird women hormones \n\nThanks for driving home the point that indeed, YTA", "NTA. Insisting that step parents are real parents has caused no end of trouble. Is step parent a real and meaningful role? Yes. If done right, under the right circumstances and if everyone is open to it, it can absolutely be similar to a parental role and even exceed that of the real parent (although usually only when the real parent is absent or there is a problem there). However a step parent is not a parent.\n\nBonus tip—pets also aren’t children. They’re just pets.", "NTA", "NTA. Maybe I read it wrong but they don’t consider him dad. So he doesn’t want to overstep and piss anyone off. Redit hive is so bipolar on this. Also, if your buddy’s wife isn’t walking in your shoes or living in your home, she has no standing in this discussion. Communication is key.", "NTA. If y'all breakup, you don't have any rights to those kids. And heaven forbid it's a messy breakup, and she then tries to keep your new child away from you too. You're a standup guy taking on the father figure role of your girlfriends kids from a deadbeat but you haven't adopted them and you have noegal ties to them. In actuality they're not your children. And if you breakup with your gf she can make that perfectly clear. As for the dog, the amount of people giving you grief over calling it your child is mind boggling to me. This whole website is dedicated to how dogs are part of the family, yet now, for you, that's just not true.", "YTA for being a misogynist. Do better", "NTA , they’re not your kids 🤷‍♀️ and obviously the dog was a joke. I don’t see anything wrong.", "NTA, it was funny.  WIFe is AH for discounting everything you've ever done for her and her ex's kids over one snarky comment.  Your feelings that this is your real 100% yours child don't matter, because duh, Y chromosome.", "For chryst sake are all of those women drama llamas ?", "ESH. I say that because why did the friend need to specifically point out the biological side? And then go off on him when he answered her stupid statement with an equally stupid answer. They both suck. I’m not even gonna say anything about ‘woman hormones’ bc we all know that was an ahole thing to say.", "This is why I feel bad for kids in this situation. Mom moves in with a guy who pretends to be happy families with the kids, then when pressed, everyone learns that even the dog has higher stature than the kids in mom's boyfriend's hierarchy. YTA.", "Other comments are being asses about this but here is the score with being a dad. 90% of the time people go wih the flow and you are used to stablise everyone emotionally phisically and mentally.\n\nYou have been doing this for the 3 step kids, and while they dont call you dad its clear they love you like a Dad.\n\nWhat you said while technically correct, makes your fiancé feel like you do not view your step children as your children and you made it sound like you care about the dog more then them.\n\nYour NAH but you are an idiot.", "My understanding of your story is that although you’ve been raising them as your own, your mind doesn’t directly refer to them as your own. Perhaps, allocating them as “hers” instead of “ours”. And this upset your fiancé.\n\nIt doesn’t sound like this came from a malicious place. We all process things in our own way.\n\nIt sounds like you have a very nice family around you, it’s worth reflecting on that and how you actually perceive them.\n\nI think NTA but your buddy’s wife fucking is with that sort of shit on a boat day.", "NTA as claiming someone else's kids as yours being disrespectful seems to be a perspective that no-one seems to acknowledge. Although it has to be said, leading with that would have been better rather than trying to squeeze it in afterwards with a look of panic on your face..", "NTA\n\nHe isn't wrong if he doesn't claim her three children as his, it can be weird or uncomfortable for someone to claim children as his children\n... And that's totally fair.\n\nI never called my mums partner my step dad or dad but by his name, that's it.\n\nNTA\nThe wife friend is out of pocket.\n\nKinda YTA,\n\nTalk to your fiancee and tell her why it may not feel right for you to say you have three children together. You could gentle explain why that is but it's fayr she is angry and shock and embarrassed. Pregnant or not", "I’m gonna say NTA but fucking stupid and she’s never gonna forget it! 🤣 there’s worse things though", "ESH. First, YTA for making that comment out-loud, even if it's 100% true. Second, your friend's wife for attacking you for being honest, after she asked you the question in the first place.\n\nYour wife is NTA, but this truth should have come out about 4 or 5 years ago, not now. I'm not sure what the future holds for your marriage, if you still want to go through with it.", "NTA, you just said what came to mind and your actions speak louder than words (taking care of them and them looking up to you as a father figure when their biological one ran off). You even tried to apologize for it. Yeah your wife will probably be mad, but it's her choice to be mad and you didn't do anything wrong", "NTA", "NOT NECESSARILY AN A**HOLE BUT DEFINITELY CLUELESS.", "You never say crap like this even if it’s joking . You’ll never win or be understood by women", "I don’t think you’re the asshole.\n\nThere needs to be a very explicit conversation about this.\n\nI am with someone with kids, granted they share custody, and I would never ever call myself their mom. I’m not really sure what we’re going to call me but we’ll talk about it - also out of respect to their mother (again who in this case is in their lives) I’m not about to just declare this status. \n\nThe conversation needs to be had and likely will not be just one conversation but will take a few times to work though comfort levels and implications etc", "nta", "ESH...OP really could have included the two kids who treat him as a dad and the fact that he didn't is telling. They don't call him dad, but are giving him Father's Day gifts. I can see why their mother feels hurt.  But I also disapprove of the judgy people who called his dog \"unwanted\" and a \"fleabag\". Sorry people, but some people DO bond with their animals and look at them as their children. Get over it.", "I’ll say ESH. This is something that obviously has never been discussed between you both, I understand their dad is less than reliable and you feel like the kids see you as a father figure but they don’t call you dad. I’ve seen where families live together but their spouse is just that and it’s divided hers are hers and his are his no mingling and it works for them. You guys need to discuss the family dynamic so it’s “set” so to speak. I have 3 kids my husband has 2 so he tells people he has 5 and I tell people I have 3 because that’s how it is for us and it’s how their mom prefers and it’s fine with me.", "I guess I'm in the minority here, but the guy has been a clear and positive presence and influence on her kids lives. He's been there, day in and day out, doing his best to raise her kids as a parental figure. There's clearly love and care here, so why is OP being destroyed for not answering the question \"right\"? Does he just get zero points for actually acting like a good dad with those intentions for these 6 years? We're talking about his INTENT. He loves these kids and wants to think of them as his, but perhaps he's being respectful since the kids don't call him dad. What about the fiance - she gets a pass for not telling the kids to call him dad? ::shrug::", "I’m a stepparent and I’m going to go against the crowd here and say NTA. You made a joke about the dog being your child, and then your weird woman hormones comment is getting a lot of heat but I don’t think it was said with any malice. \n\nI love my stepkid to bits and would do anything for him, but he’s not my child. You’re a father figure, but as you’ve said they have an actual father - he’s just not fabulous. \n\nI still think you should apologise and say it was a poorly worded joke. Also, it’s super common to have big conflict about bio vs stepkid parenting, so it’s a good opportunity to start planning for an approach to those conflicts. But you don’t seem like an asshole to me. Good luck with bubs!", "ESH. First, there is the situation of you being in a father figure role for these kids for 6 years but still not being married to their mother. I’m not a prude about unmarried adults living together but when kids are in the picture there are extra considerations. Your ambivalence towards these children demonstrates the problems associated with “playing house” without being married, especially when kids are involved. Whether it is the ambiguity of the situation that creates this ambivalence, or whether the ambiguity is a symptom of a reticence to fully commit, it’s still a problem. I say this as a man who married a single mom so I know whereof I speak. You’re at fault for that, but your “fiancé” (scare quotes because I’ve seen people describe someone they live with as a fiancé even when there is no set wedding date) has also allowed this situation to continue for 6 years without telling you it is time to shit or get off the pot, and protecting her children, emotionally i this case, was always primarily her responsibility. \n\nBut the buddy’s wife is also a major AH for sticking her nose into this and being incredibly overtly rude and offensive and judgemental about something that doesn’t affect her in the slightest, and stoking discord. You would not be out of line to have a word with your buddy about how you did not appreciate that. If my wife had spoken to a friend of mine like that I would not be happy with her at all.", "Wow this one got people really riled up. I'm gonna say NTA depending on how you said it and what you said when defending yourself.", "NTAH \nYou were just saying a goofy joke…and the other  kids are not yours…\n\nThere are cases where a man will end up paying child support for another man’s kids, while the mother goes back to living with the birth father. Can’t be too careful these days.", "I was just gonna say “not the best response” but the last sentence kind of outed you as a dummy", "Here’s the thing, yes your G. F. Is preggers. And easily emotional. Ya know what makes women pg or not emotional?  Knowing that their children only have her to care about how special they are. To love them. To know she is the only thing they have in this world. See, she had hoped that being considered as a fiancé would probably rate her children a little higher than the dog. This is going to require at the very least a very long pout. You’ll be lucky to survive it. Apologize a million times EARNESTLY and pray a lot for forgiveness. The comment may have been innocent but it was a bone headed mistake. When you marry a women with previous children, they are the rocks in HER river. Everything flows around them. The same will be true of your child with her.", "NTA. Keep the dog. Drop the fiance and her kids. And put yourself on child support. Your life will be easier lol.... I'm joking, but only a little.", "NTA truth is her kids are NOT your kids.", "Tbh NTA\n\nI'm not sure why everyone is so charged up at you as if you haven't been a good role model and father figure to those 3 kids. That's probably a difficult subject in your position to navigate how to refer to them, but it seemed like you were just making a light-hearted joke and the friend's wife just flipped out and was way out of line.\n\nEven if you were TA she has no business calling you a \"fucking prick\".", "NTA. Your love for your unborn and your dog is just as valid! Family doesn't have to be biological.", "NTA. Your kids are lucky to have a loving parent like you, even if they aren't biological. Love knows no bounds!", "NTA. Your kids are lucky to have a loving parent like you, even if they aren't biological. Love knows no bounds!", "People are so fucking pressed. YTA for trying to defend yourself knowing what you said but NTA for what you said. It’s a FUCKING JOKE 😭 everyone just took it the wrong way. You definitely could’ve mentioned you had more children after laughing at but still, goddamn", "NTA but also TA\n\nYou're an asshole for including the dog but not stepchildren. But if you didn't include kids who don't call you dad then that's ok.", "NTA. No matter how much you love them, you are not and will never be their father.", "NAH- You made the classic guy mistake of letting your mouth loose before engaging your brain. You didn't mean anything by it, going for a laugh maybe, but that fucker blew up on the launch pad! Let your wife process. It always sucks nuts when you just stumble into a shitstorm, but which of us guys ain't done that before? This shouldn't leave a scar, but it might leave a bruise for a little while. Chalk it up to hormones, fate needing to find a place to drop a deuce, what the hell ever. Be a good boy for  a while and you should be ok. Your wife is trying to just get past this, so don't pick at the scab. Congrats on the biobean!", "The other wife had no right to talk to you like this. This is between you and your wife- that’s it. People need to mind their own business . If you are with someone old enough to get married it means they are old enough to speak up for themselves", "Even if the dad was in the picture they can still be his kids! My Stepdaughter has a perfectly good mom and dad, but I still refer to her as my child and she does the same! Its a family unit, it's not like giving them love and respect some how diminishes the amount you have to give to new members of the family!", "When they call him Dad seems to be the deciding factor for OP. I have plenty of parental figures in my life I don’t call mum or dad but they sure as hell show up and are relied upon better than the ones I do call mum and dad. People get too strung out about the title.", "This is one of those posts that is so over the top.. imma just assume it's fake and read the comments like -' If this scenario were to happen, how would feel &/or respond? '", "I'm sure he's not *really* an asshole, it's just the weird man hormones making him all dumb!", "Yeah gosh yes. I am so tired of everything being reduced to hormones. I don't even want to think what it's going to be like if I ever get pregnant.", "Have you dealt with a crazy pregnant woman before? That's a valid thought", "I respect the shit out of her. I hope I would have the guts to call out a friend’s partner like that if that ever happens. \n\nYTA", "Big shoutout to the folks who call out BS when they see it 👏", "Except for the dogs comment, that was cruel af", "I mean they were the ones making it a biological conversation in the first place. Why would they even ask that?", "Imagine taking 9 months to grow a brand new life for you and your partner to love and cherish and the emotional toll it takes on you is called \"weird women hormones\". Which, in this case, I don't think could even be remotely true she is clearly upset for good reason it's got nothing to do with being pregnant.", "Dude has been living with and helping raise the kids for 6 years.  How he can view them so callously is baffling to me.", "Is it just me that thinks, when someone says “I love (someone) to death” that they don’t necessarily even like them? Especially as it’s usually followed by “but...” (insert criticism here)", "To quote The Wheel of Time, “if a man has the raising of a child, that child is his and none can say different.”\n\nOP, if you love your step kids and they love you, then you’re one of their dads. They’re your kids.", "Feeling bad for the dog taking strays left and right 😭", "I can’t help but appreciate how Reddit will go nuts over it when a kid is made to treat their step parent as a real parent and resist, but OP is a monster because he takes the balanced, reasonable view of “I’m not their parent. I love them and wish I were, but I actually am not.”\n\nThis sub is so fucked.", ">weird women hormones \n\n“It’s always that last line” -Sam Wilson", "Not only that, but she said she didn’t want to talk about it at the moment and he just bulldozed ahead to try and justify himself.", "To add on to this - while hormones contribute to SOME expression of emotion, your go-to explanation in the future for sad tears should be hurt feelings, frustration, disappointment, loneliness, shame, sorrow, grief, and numerous other human experiences. You’re trying to minimize and invalidate her feelings which does indeed make YTA. \n\nIf I were her, those tears would be from a heart breaking realization that my partner- whom I trusted to build a loving relationship with my children - does not experience it the same way and I have subjected them to a pseudo step father. \nThose tears would be sadness for realizing the relationship isn’t what I want for my kids and that I was saying goodbye to it and leaving. You didn’t make a mistake, you revealed that you don’t value her kids enough to consider them children after 6 years like you do a non-human. \n\nAs a mom, there’s no was in hell I’d subject my three kids to the disparity in your feelings for them, your dog, and your unborn child", "And thank God the 3 kids didn’t hear this!", "This. My husband and i have three earth side kids (2 are biologically mine and one is biologically his). I’m pregnant with #4. We both tell people we have three and are expecting our fourth. My kids do refer to my husband as dad but call him by his first name too. \n\nPregnancy hormones aside, I’d be disappointed to hear my spouse refer to our dog and unborn child/his bio kid as his only.\n\nOP you need to dig deep into why you don’t claim her kids as yours especially when you’ve been a father figure to them for 6 years.", "Her feelings are hurt and he's ready to dismiss tham as invalid cause she's pregnant wow", "This so much. If I was her I would leave him for pretty much openly admitting he didn't love our other children after years of raising them. \nThat is just weird and awful.", "And all the “defending myself” “she didn’t defend me on the boat” “even though she didn’t agree with my buddies wife” **and in the literal next  sentence that it “did bother her and no she doesn’t want to talk about it”**???? And then ***more*** “defending myself”???? \n\nUggggghhgghh duuuuude go marry your dog and let this poor woman recoup her dignity so she can raise her **four** kids in peace far far far away from your sewer dwelling self.", "Might soon only have the dog baby full time and the bio kid every other weekend, lol. I’m just sorry OP’s partner found out too late. YTA", "How old are the kids? Did you raise them, or are they nearly adults? In any case YTA, but might be overlooked if they're near adults.", ">or is this weird women hormones?\n\n100% OP YTA omg I can't even believe that was written. and you somehow got in a relationship and are going to be a parent? holy shit. even if OP apologizes, it's not good enough. jfc", ">The unwanted mutt\n\nPoor dog did nothing to warrant this. If most of your family wants the dog it's not unwanted. And calling them a mutt is mean.\n\nOP...I have rarely seen such assholery. Hope she dumps your ass.", "I'd be so insulted if my husband included the dog I didn't want over the children he's been raising for 6 years as pretty much the sole father figure of.. \n\nDoes weird women hormones mean completely righteous rage? Because if so, it was definitely that. \n\n&#x200B;\n\nOP - YTA - a HUGE one.", "agree but hey now the poor dog didn't do anything #teamdog\n\n\\- also YTA", "How is a \\*dog\\* his biological child? This guy is a clown. YTA", "Wow you are triggered hey", "My ex made it clear that while he would help parent my kids, his own kid would be loved more. Even went as far as to say that adoptive parents would never love their adoptive kids as much as their bio ones. That and other shitty regressive attitudes were a big factor in him being an ex.", "He's exactly the kind of person who will treat the stepkids like dirt when the biological kid comes along. I've had friends with stepdads who turned like that.\n\nEven now, he puts the dog above the stepkids. How much worse will it be for the stepkids when the baby is born?", "Yea it is crazy how sensitive men are when it comes to children in their life not being biological that they go so far as saying children they have helped raise for 6 years is not their own.\nWeird men hormones.", "I get that dog \"parents\" are a thing but when you actually have human children, referring to a dog or cat on the same level as people is just fucking goofy. I feel for his fiance, if he's anything like the way he represented himself she picked another jackass to make babies with and get entangled with for the next 2 decades.", "In the Netherlands I’m fairly certain they allow terminal children to undergo compassionate euthanasia but this is the most pedantic and inane thing I’ve ever said in my life", "I was expecting him to try to defend it as some awkward joke that didn't land. But nope, it seems he is somehow defending this position? How bizarre.", ">The dog doesn't count and I will die on this hill. It is legal to euthanize a dog, but not a child.\n\nYou're so wrong on the emotional connection it hurts. Its legal to let children die. And in more and more places its legal to let children euthanize themselves. The only reason we hand that decision off to the caretakers of animals is because they cant articulate for themselves whether they want to be euthanized. On top of that, the only reason its a common practice is because animals, for a long time, were widely thought to not feel pain, love, or any emotions.", "I agree with most of your comments, but while it is technically “legal” to euthanise a dog, it’s still obviously incredibly immoral to do to an animal that does not need to die yet (unless of course they need to be put down to avoid painful death). That’s like saying children are lesser than adults cuz if someone slaps they’re kid in public, they usually get away with it but if they slap an adult, they get charged with assault.", "He won’t, he’s digging a bigger hole than Fido ever could", "I actually kinda feel bad for OP as he said he loves the kids and wishes they were his but he has to share them (guessing with the biologically father who isn’t completely not in the picture - seems like they see him 1-2x a year). He said the dog is his as he is not sharing the dog with anyone like the kids. Maybe its hard to see them solely as his kids when they dont call him dad and their father is somewhat around? Guessing that’s different with your son and your bf as your bf is his only father figure he has ever known. OP definitely messed up & can see why his fiancé is hurt, but I think he was just being technical? The female hormones line though was ridiculous!!", "He didn't erase anything. They are not his children", "Is it just me or have there been a ton of AITA posts lately where someone is obviously being a dense idiot? It used to be that posts here were in at least somewhat of a grey area. I'm having trouble believing Reddit stories lately. Maybe the global \"dense idiot\" population is higher than I thought.", "Sounds like he stumbled onto a secret hotspot.  Maybe she's afraid he will ignore her kids for their new one.  Now the well is poisoned because he stuck his foot in it, they need to clear this up asap.", "No, they are not his children. That is a wrong answer", "No. Words matter. Especially to kids. Thankfully they weren’t there to hear that but they would’ve been crushed.", "Smugly telling people to downvote doesn't make you right", "Agreed. ESH. Friends instigated the responses. Sorry but he wasn't part of the process of procreating those children. But he was part of getting the dog and he did participate in this with his biological. I can see his side here.", "I agree with this. While I understand step- family love (I am part of one myself), the conversation was specifically about *his* upcoming biological child. \n\nFrom context clues I would have seen that as *them* excluding the step-kids in this conversation.\n\nI bet in everyday life he treats them as much as his own as he is allowed, and I don’t believe he had any malice behind this slip.\n\nEdit for verdict: NTA", "Neither is the dog", "That was my first thought. They have a father so if he tried to claim them than hed probably be accused of trying to erase him. Everyone just wants to be offended.", "Neither does the dog lol", "Why? Because the kids don't call him dad so he said he only has 2 kids so as to not impose himself? I seem to remember MULTIPLE cases of AITA absolutely roasting stepparents for thinking they are parents to their stepkids?", "Because everyone wants a woman with kids with multiple fathers and one of those fathers being a friend.", "You just made the opposite point. Family doesn’t have to be biological, so call them your damn kids weirdo.", "You didn’t get called out enough for your bad behavior. If someone if saying something incredibly stupid and hurtful in front of me, i’m telling them to stop. Period.", "You rightfully point out how hung up people get on titles but instead of calling that out and focusing on the relationships (in this case OP says he loves being a father figure to those kids - he *wants* to be in their lives) your solution is to write off whole sections of society? You’d rather perpetuate the misguided focus on titles by encouraging people to never get into a situation where they can change the status quo you rally against?\n\nBit hypocritical isn’t it?", "Yes and thanks for that ! My father as a  long time partner that was never a mother figure (came in my life when I was a late teen) but damn I would've missed her love. Why distancing from being someone that can being so much to a kid ?", "I’m 48 and was a full-grown adult when my stepdad married my mom when I was 23. I call him my bonus dad because he’s been here for more than half of my life and treats me just like I’m one of his own. You don’t have to share blood or DNA to be a father.\n\nAnd yeah…YTA. Big. Huge.", "Or \"the old ball & chain\"", "Notice that he removed that wow YTA fuckin shameless bastard", "So in Ireland, we have a version of this where guys will refer to their wives or GFs as \"herself\". For example \"I'm going to dinner with herself later\". For almost a year in work, my colleague never referred to her as her name and I had to actually ask her name.", "I've never heard \"the little wife\" before, definitely heard \"the wife\" or \"the mrs\" a lot though. I feel like \"the little wife\" is a very strange way to refer to someone", "Gives me ‘asks the doctor to do a husband stitch’ after birth vibes. Eughh", "He can't even call her his fiancée (feminine).  Details matter, but this guy wants to use a push broom for all of his fine detail work.", "‘ The Mrs’", "Bruh my dad refers to my stepmom as \"the wife\" and my younger stepbrother brother (who is only 21) picked it up and that's now how he refers to his wife 😭", "And on a BOAT too, like she can’t just get up and leave.", "Agreed. Everyone should have a friend like her.", "Have a feeling it's not the first time OP was an absolute bellend in front of her and she'd just had enough.", "And he counts the dog he's known for quite a bit less time as his child, too.", "It can be somewhat self-protective. Currently he is not married to their mother. If she chooses to leave him, she takes the kids and he never sees them again-- he has no parental rights. He can't get visitation with his non-bio kids although it may be highly likely a judge may decide that since he acted as a father, he is required to pay child support. I don't know if her kids bio-dad pays his child support...  Their father can decide to swoop in and negotiate a more generous shared custody agreement, or sue for full custody if he moved back into the area.", "Tam Al’Thor would never", "There are times made is the key word and some situations it makes sense.\n\nOther times Reddit makes my head spin. I know they're different people but the amount I've seen both blanket statements of step-parents have no right to tell the kids to do anything or parent because they aren't the parent and if you get with someone with a kid/kids and be a parent both get said a lot/high up votes confuses tf out of me.", "Lol yes, there are differences in expectations for children vs adults. I’m not sure why this is confusing.", "IF they get married. He seems the type to just keep her as a fiancee.", "The dog also has a father, and we can only hope it’s not OP.", "He says the 'kids' gifted him the dog, but the fiancee wasn't too happy about it. Makes me think he took the kids, got them excited about the dog he wanted, and he said \"hey, you can give it to me for Father's Day\". They are clearly young enough to not be able to go get a dog on their own.  \n\n\nAnd that's just the tip of the iceberg that gets him the YTA.", "Before my mom and step dad EVER got married, he made it very clear to everyone that my sister and I were his children. Op is 11010294% the AH", "I missed the Father’s Day part. I cannot make my YTA font big enough.", "An animal is not a child and will never be a child.", "I dk my dog is more clinging then the kids I pushed out. He clearly thinks I birthed him.", "This made me laugh out loud", "maybe he's into bestiality and did it doggy style with a b\\*tch ;P\n\nThat's the only way he can come out of it without sounding like an AH, but then he'll be a HUGE pervert!", "I felt such pride as a kid when a step-parent would refer to me as their child (or include me in their total number of kids) because it demonstrated that they loved me enough to publicly claim me as family.\n\nThis post breaks my heart from two perspectives: as a step-child and now as a step-mom.", "You expressed it so much better than I would have done.  When I read OP's post, all I could think was how my heart aches for the wife.  6 years of believing you are creating a strong family with your husband,  only to have the veil lifted in one harsh moment.   As a mom, I doubt I could either forgive or forget,  and I'd be making an appointment with an attorney for advice on how to proceed.", "They dont call him dad and they arent married.\n\n\nIf the woman left the kids would leave also. Theyre not his kids.\n\n\nNTA", "My husband claims the 2 kids I had with my ex husband as his and their dad is in the picture lol maybe OP is just having weird men hormones.", "Well I'm glad they're earthside and not moonside, that would be problematic", "Three earthside kids -- are there others who are not earthside? If so I'm sorry for your loss.", "Especially considering she's now pregnant with his kid and has to wonder now about him showing favoritism that will damage her relationship with her kids because \"she picked a man who loved his kid over us\"", "Leave him and take the dog", "You can’t definitely love someone kids like your own and not feel like a dad.", "He literally openly admitted he adored her/their 3 kids on the first sentence. But you go off mate.", "Even if their 17-18, dude came into their life at 11-12, and those are incredibly formative years.", "Apparently he had the merit of being honest enough that you could make an informed choice. It's great when people spell out clearly why you shouldn't have them in your life.", "I am sure that is a consolation..  to retain custody of the dog. But seriously, he will have parental rights irt the baby (her 4th kid).", "OP said, \"they treat me like a father figure.\"  That's who's to say.", ".... the kids got him a dog literally as a Father's Day present?", "Did he help raise them though? Is he allowed to punish them for wring doing? Is he allowed to set rules and boundaries for them? Or is he just present and everything goes through his fiancee?", "Exactly. I call my pet my baby (I don’t call myself a dog mom) but like a dog is not a human child and you can’t put your dog above your step kids in this way.", "Upvote for \"pedantic and inane\" 🤣", "That's fair and I'd never considered that honestly!!! Good input!", "Very few people want to empathize with him but yeah.  He really shot himself in the foot with the hormones line.", "Glad to see someone else here who has it right!!", "Wow. Toxic “blood” shit. Her children are family.", "I was under no illusion that it did so there's that.", "The posters in here are fucking mental sometimes.\n\nYeah, he's the worst person ever because he said something without thinking. Yeah all that 6 years love and money he put into the relationship and kids is all meaningless because of one silly offhand joke.\n\nJesus christ honestly, yes it is weird women hormones and the same with all the broads in here squawking away. It's not a rational reaction but a purely emotional one and a serious over reaction at that.", "Dogs are incapable of speaking, and in context the dog was added as a joke. Lighten up.", "Probably would if it could tho", "So you can only consider them your kids if you have a piece of paper saying they are?", "you want to adopt them but you don’t consider them your kids????", "thank god the kids didn’t hear you say it. you really need to have a good look at yourself mate", "But the friend asked him if he's excited about having a biological child? That already excludes his fiance's kids", ">They were asking if I was excited about the pregnancy and having a biological kid\n\nI'm not a step parent, but my dad is. And he had his dogs before he had my mom and us, and I can tell you he thought of those dogs as his children. He didn't have any kids of his own yet. And yeah we were there, but we were moms, even though he cared about us, his dogs were definitely special. \n\nIdk maybe I just have a soft spot for men in his situation. My step dad and I went through all sorts of shit together and against each other. Since I was 5, all the way up to after highschool. So yeah, even six years together can still be iffy.", "I missed that one! I guess it was in comments somewhere, which I honestly had to stop reading as I was getting so pissed off.", "Nah, it’s still there in the first paragraph about getting the dog.", "It's in Belle's I want song in Beauty and The Beast;\n\nMadame Gaston\nCan't you just see it?\nMadame Gaston\nHis little wife!\nNo sir, not me\nI guarantee it\nI want much more than this provincial life\n\nIt's a very traditional and diminutive way to refer to someone.", "I think the more common phrase was \"the little woman \"", "Notice it's his buddies wife, not my friend, or my buddy. She's just the woman who happens to be with my buddy. Now you don't have to be friends with your friends partners, but considering the other statements and way he discredits what they say or refers to them it certainly seems like OP has an issue with women.", "None of that negates an emotional attachment, it's just a list of shitty things that could happen whether he seems them as his kids or not.", "He said he has tried adopting them but their dad, who he refers to as the sperm donor, said no. He said he loves them to death & wishes he didnt have to share them (presumably with the biological father), so guessing its hard to see them as HIS kids when they have a father & they dont call him dad. He said he sees the dog as his as he is not sharing that with anyone else. He said some dumb stuff but I can see that he was probably just being technical that his unborn child is his because, it is(!) and the 3 kids are not technically his as he didn’t father them and their father is very much alive & not allowing him to adopt them. I see why his fiancé would be hurt, but think he didnt mean much harm by it & actually does love the kids (as he claims he does & you wouldn’t continue dating a single mum with 3 kids if you didnt like/love her kids).", "Honestly, I hope this is it. This is the only explanation that makes OP moderately less of an asshole", "This is what people who are piling on the OP for not seeing the kids as his don’t get. On the other hand though he’s put himself in this situation by living like this with his fiancée and her children for 6 years, but the flipside of that is his fiancée has also responsibility for allowing this arrangement to continue so long, and really she bears more of the blame because she is the one who has the responsibility to protect her children from potentially emotionally hurtful situations like this. So she really doesn’t have all that much legitimacy in being angry with OP, and where is the buddy’s wife’s criticism of the fiancée when she’s doling out unsolicited judgement?", "I think the implication is that he fathered the dog, not birthed it.", "pp hole birth", "You’re misunderstanding what he’s saying. Redditors consistently believe stepchildren shouldn’t be expected to think of stepparents as parents, but excoriating someone who isn’t even legally a stepparent for not seeing his “fiancée’s” kids as his. It’s hypocritical.", "6 years is a long ass engagement. Is she only the fiancee because she is pregnant? Conversely, it could be her that is gun shy on the marriage front. Clearly she is experiencing the epiphany that she is not that good at picking men.", "If I were his fiancée, I would be having major second thoughts about marrying this person, and possibly regretting having a child with him. What a horrible trash person, openly admitting he doesn't see her children as his despite the fact he's been helping raise them for the last 6 years. Absolutely disgusting.", "Let’s not act like people don’t refer to their pets\nas kids", "It’s one gift, and they likely wanted the dog for themselves and knew mom wouldn’t get it for them. He doesn’t say they get him something every year and they don’t call him dad.  They also have a dad.", "They didn't.  You think those kids came up with the idea to get OP a dog, went out looking for one, chose one, brought it home and surprised OP with it?  All without their mother's help, because we know *she* didn't want it.\n\nOP got himself a dog, and involved the kids to manipulate fiancee into going along with it.", "There’s plenty enough to criticize OP for in the given post without making up extra.", "Why was he even getting a gift for fathers day? Since those kids don't count as his.", "Or maybe kids found a dog and brought it home? I did this multiple times as a child…", "She’s hurt that she is with another deadbeat. The dad isn’t there for them and OP has been and doesn’t think of them as his kids. That’s just bad character. You think of your dog as your child but not your fiancés kids who you have helped raise for six years. Only your dog and baby. That’s just wrong. These poor kids.", "\"He manipulated children into gifting him a dog\"  \n\n\nWhat the fuck?  Can you get me something from the top shelve?  Your clearly can fucking make stretches form here to timbuktu.", "How did you get 900 upvotes from making something up to get mad at\n\nEdit: over 1k now", "You literally just made that scenario up wtf is wrong with you?", "That's kinda putting words into someone's mouth that might not have been said.", "I think the nature of the question has to be taken into account. He was being asked if he was excited to have biological kids, and made an obvious joke about including the dog into that statement. Also, the woman's reply was nasty...calling the dog a flea bag, which makes me think his fiancée and her have talked about this - I don't know. I'm getting weird vibes from this one. By the other woman's admission, he's taken care of his fiancées children for six years, so his actions are right, but the way he responded was wrong...but the whole convo is weird.", "That's a lot of assumptions. Wtf?", "But we don't know that, so we won't add it to the story.", "My wolfhound cross is clingy AF. We were worried while I was pregnant with my last as to how he would take the new addition but he simply moved from head on my lap to laying at my feet and then he goes and sleeps in her room after we go to bed. If it wasn't for him waiting until I go to bed to go to her then I would suspect I had been replaced by my 18mth old daughter in his eyes (they have this adorable little bond and way of playing too).\n\nOP, YTA, it's not hormones. You just told your partner her kids will never be accepted as your kids by you. I'm glad she found out now so she can leave your sorry ass before those children have to witness your blatant favouritism once the baby's born.", "My husband is a step child and as an adult he still feels so many feelings of rejection. It’s such a dick move to be involved with kids when you cannot love them.", "My stepdad didn't have kids when he married my mom and even said he didn't want to have any bio kids because he didn't want to treat us different. We were included with the wedding ceremony. He tells everyone he has 2 daughters and our kids are his grandkids, no hesitation.", "During my sisters wedding her step daughter was a bridesmaid. And during the ring ceremony she gifted her a ring as a promise to not only be there for her father but her as well. \n\n\nDuring a fight they had once. She told him if he ever did something like that again she would leave with ALL the children.", "Unfortunately yes, we had a few losses trying to conceive my current pregnancy. Thank you <3", "Oh he is definitely going to show favoritism. He doesn't even think of the kids as his.", "I'd honestly just leave him. If after 6 years he didn't love my children yet, I would be pretty confident it wouldn't happen. I hope she is doing okay hard choices ahead for her.", "This is exactly what I was thinking - she’s not crying because of hormones but the giant mistake she may have made.", "Honestly, the kind of drama you just mentioned is the cause of a good fraction of the posts on AITA.", ">pregnant with his kid and has to wonder now about him showing favoritism\n\nYes, I thought that, too.\nMy children had a step father from the ages of 5, 7 and nine.\n\nHe and his whole family considered them to be his children", "Yea I adore my cats/new object I bought. I love my family members. But you know you go off and try to defend a jackass.", "after the kid is born, sure.", "That’s not what he is saying, he’s saying that dogs being euthanised all the time isn’t a good thing even though it is technically legal to do. He was referring to something else. Obviously human children take priority over dog “children”.", "Thanks! My pregnant ass kinda felt bad for him when he said he loves the kids to death & wishes they were his when I initially thought he was an AH!", "Not his children though, his step at maximum", "As someone that had this happen to them as a child, I sure hope he doesn't. My \"adoptive\" father (my mom divorced him when I was 5) was so controlling that he went to court to adopt me when he married my mom, they even reissued my birth certificate with his name on it.  Overall it really effected my childhood, and has even haunted my adult life despite going NC with him as soon as I turned 18. \n\n\nSure their bio dad my not be very present in their lives, but I'd hate for them to resent OP later on for this. My bio dad was even less present in my life, and has a whole new family that doesn't know I exist (heck he never even told his parents about me), but I'd still rather have his name on my birth certificate than the abusive AH that was married to my mom for all of 2 years.", "It really does not. People who have biological and step children do not automaticaly exclude one or the other when referring to them.", "Oh, OP didn't say that...I was just commenting that it sounds old-timey like \"little wifey\" does :)", "I think I’m going to make Belle my wife! 🎶", "Let’s not forget that the specific topic was biological children. More ESH than y-t-a to me.", "And yet the dog have more of a right to be child than human who he also fathered", "i think tbe implication is that he had sex with the dog's mom", "The mental image is more amusing the other way around though.", "People also refer to their stepkids as their kids, especially after 6 years of raising them.", "That's not the point... It's sweet to consider a pet as a kid. It's insulting when you do it and think kids from your specie that you raised are less worthy.", "If you don't have any human children that's fine. It's also fine if you do have human children and you're counting the pets along with them (though I think most people with kids do that at least somewhat jokingly). What's not cool is to not count a dog above your full-time literal human step children.", "He also doesn't say they don't get him something every year. This particular gift was relevant since the dog is part of the story. He says they treat him like a dad and that their biological father is barely around. It's a lot more likely that they do see him as a father, since they're treating him as one in every way except calling him \"dad.\"", "They got the dog from their grandmother.", "How come in these post people alway makes up shit they have no way of know? They do it with such confidence as well.", "BUT I WANNA!!!!!!!!!\n\nto your obvious eye roll i say NOW NOW NOW NOW!!!!!\n\nSeriously though this dude is right there is way too much to be pissed over to be making up little slights.", "That part.", "Or even just went in with a grandparent for the gift to surprise them. When kids want furbabies they have ways of making it happen it seems XD", "That wouldn't be a \"gift for Father's Day\" though, that'd be a conversation between parents over whether to keep the stray or drop it off at the shelter.", "Me too, and I still do. But there's an expectation to return them to the owners dammnit.", "God I hope my future kid is like this 😂", "My dad once told us to give the kitten we found to our mom for mother's day, he's pretty mischevious", "I used to steal dogs too", "Don't seeing children you helped raise for 6 years and being a deadbeat are two completely different things. Let's not act like raising someone elses kids for years is no biggie", "A terrible joke if that's what it was....if he had just said yes, that would've been fine. Including the dog when they asked about BIOLOGICAL kids and NOT including the stepchildren is CRASS.", "My thoughts too. Her “a lot to process” is very likely “do I walk away from this relationship because he doesn’t see my kids as his own and never will?”", "This is just semantics and not a good faith argument, but you seem way more invested in all of this and I don’t have a dog in this fight, so enjoy it.", "He is raising them (his words). A stepfather is still a father.", "Oh OK, I misunderstood. Yeah, no worries, you're right about that", "Especially since I don't picture the picture the dog coming out of his ass...", "And some people don’t if they don’t feel like they are their kids. It’s not a one size fits all approach.", "You shouldn’t force a relationship. He doesn’t consider them his kids - they aren’t. It doesn’t mean he doesn’t love or care about them. Let’s normalize not forcing relationships on people", "They aren’t his step children. They aren’t married and step child doesn’t mean they are your actual children- we let step parents know this everyday on this sub", "That doesn’t mean he considers them his kids. That has to be a mutual decision.", "Seems like it's coming from a hatey place too most of the time. The know it alls don't know that that image is a reflection of them.", "Wow! I think this almost 20 times per Reddit session", "My cousin offered me a kitten once I asked my mom texted my cousin back \"sorry my mom said no\" ans she texted back \"what if u just kept it in ur room tho\" and I texted back \"bet\" \n\nThat happened twice. I have 2 cats because of that same cousin offering them and suggesting i just dont say anything. The second time my mom got pissed after finding out I had the cat for 3 weeks and told me \"you have GOT to stop doing this this is not okay!\" But guess who gets cuddles every night from that same cat? She does. And she loves them.", "That’s fully on the grandparents then, just sayin. Like no, check with your kids and then tell them to act surprised if the answer is yes.", "We just waited until mum went on holiday, she couldn't say no when the cat was already here 😉", "Can confirm, I brought  home a pregnant cat when I was 11", "You’re assigning way too much rationality to children. More like-\n\n*Walling home from school on Friday.*\n\n“Dogs following us!”\n\n“Oh he’s so cute let’s bring him home!”\n\n“Mom and dad will say no.”\n\n“We‘ll give it to dad for Father’s Day”", "Yeah, apparently snatching up a dog and running is illegal, despite the fact that the dog was a purebred good boi and I absolutely needed it!", "No, a step father is a step father", "You can't accept a father's day gift from the children you're raising and then claim they're not your kids. It doesn't work that way.", "Right but don't you think it's even a little bit weird that he'd think of a dog as his kid but not the actual children he's helping raise?", "Wtf... nothing is forced here. They already have a father-child relationship. And OP litterally said \"I love them to death and I want them to be my kids, but they're not.\"\n\nAnd when we ask why they're not when the dog is. He answered \"She's mine and mine only, I have to share my fiancé's kids\".\n\nWe're not in a case where a guy is forced by his fiancé to adopt her kids. We're in a case where the pet is more worthy of being his child because their \"sperm donator\" (his words not mine) visits less than two times a year.", "Yeah, nobody is denying that he doesn't consider them his kids. If he did, he wouldn't be in this predicament. I was responding to you saying \"they likely don't look at him as a father.\"", "🤣 \"you have GOT to stop doing this!\"", "Yooo, that's pretty much how I got my gecko XD", "We scooped abandoned kittens up off the side of the road all the time when I was a kid, the mamas left them there when they didn't have the resources to take care of that many", "My mom won't work with me and distract people while I grab the dog 😔. When I was a kid though and we lived in a mobile home park (had a gate and everything) me and my dad would once in a blue moon find a dog and give it water and such until the owner was found. He'd tell the gate guard so they could ask the cars coming in or out if they were missing a dog or anything. We didn't do it with cats cause my dad does not like them, and they were outside cats anyway that pretty much belonged to one family from what I remember.", "Do you have stepchildren?", "You can do whatever you want, and it sounds like they got the dog because they wanted one and knew mom wouldn’t go for it. Just because he doesn’t consider them his kids- they aren’t, doesn’t mean he doesn’t love or care for them. You can’t force a relationship", "No. The moment you get a dog you have ownership over it- it’s not like that when getting with a partner who has kids. It takes time to build a relationship, and that relationship doesn’t start out as parent/child, and oftentimes never becomes that.", "Key word they aren’t his kids- that doesn’t take away the love he has for them. The dog thing is irrelevant. He would have felt the same way even if the dog didn’t exist. They have a father.", "As someone with a step dad of ten years. He’s 100% not my dad nor do I see him as such", ">Key word they aren’t his kids\n\nKey word \"I want them to be my kids\"\n\n>that doesn’t take away the love he has for them\n\nIt does when the dog is worth his fatherly approbation and not them.\n\n>The dog thing is irrelevant\n\nThat's the whole point! Did you read the post? The fiancé is upset because he said the dog was his child and not the human kids he raised for 6 years!\n\n>He would have felt the same way even if the dog didn’t exist.\n\nIt would be a whole other debate if it was step-kid versus biological kids. But now that he consider another specie as his real family, it's insulting for his own.\n\n>They have a father.\n\nA guy who randomly appear every 6-8 months is not a father.\n\nBut the person who raised you for 6 years, loves you like his own child, wants you to be one and who you gift on father's day is. Especially when this person consider the dog as his child."]}