{"id": 21297, "submission_id": "14q9k4v", "title": "AITA giving shit to my wife about her partying and reckless behavior ?", "selftext": "English is not my first language so forgive me for any grammatical errors !\n\nSo a bit of context, we've been together for 5 years and been married 2 years.\n\nWhen I met her, she was the kind of girl who partied a lot. Alcohol, drugs, pretty much everything was involved.\n\nShe did not stop because of me but I know that my general reluctance to do these types of things was a turning-point for her. \n\nShe even introduced me to cocaine, mdma, etc but since I was not particularly enjoying any of these, she kinda slowed down and eventually stopped 3 years ago.\n\nWe have been talking about having a kid since january. I love her so much and I really want her to be the mother of my children. \n\nShe's been taking vitamins, I have been exercising etc. But 6 months and nothing yet. I know it can take some time some I am not overly worried.\n\nBut last weekend, one of her friends from her \"past\" spent the weekend in our flat. They both smoked a lot of weed, did some coke et drank a lot. Prior to this weekend, she was ovulating and we pretty much had sex 2-3 times a day during that period.\n\nI have been distant since and I feel like she doesn't take seriously our commitment to have a kid. I am actually hoping she's not pregnant. On the slim chance I would have impregnated her last week, I feel like the week-end of partying would have destroyed that.\n\nI told her that and her reaction was to tell me relax and since she was not pregnant and there were no signs of her being pregnant, that it was not that big of a deal.\n\nI am reconsidering a lot of things and I'm worried that maybe she doesn't want to have kids.\n\n&#x200B;\n\nSo, AITA ?\n\nTL;DR : My wife and I are trying to have a child but she partied like there was no tomorrow(drugs&alcohol), just after a huge period of trying", "created_utc": 1688460393, "permalink": "/r/AmItheAsshole/comments/14q9k4v/aita_giving_shit_to_my_wife_about_her_partying/", "score": 469, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) I flipped out on my wife and told her that she was acting irresponsibly\n2) I'm not sure if I worry too much or if i'm right to be angry\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. She is being awfully cavalier about possibly exposing her baby to drugs/alcohol. How does she know she is not pregnant, since you are actively trying? She could have just skipped that ovulation period if she wanted to party with her friend.", "NTA - drugs can ruin you mentally, physically and financially. Especially with doing cocaine there is a high risk of getting addicted. It’s not just one weekend having fun but a possibility of a relapse.\n\nI don’t understand all the comments saying you dated a partygirl and should have expected and accepted her behavior. Just because you did some stupid shit in your Teens doesn’t mean you can’t and won’t change and it’s okay to do that as a grown up.\n\nIf you don’t like a certain behavior of your partner you’re allowed to tell them. That’s what a healthy communication in a relationship is. And it’s NEVER to late to set boundaries.\n\nIf you’re not sure if she really want kids you should definitely talk with her about it again. If she can’t stay clean during a pregnancy or doesn’t really want to be a mother the one suffering will be your child!\n\nAnd if you don’t have the same dreams for the future you might have to overthink your marriage as well.", "Lmao, if you were a woman and you had a husband that did this, all the YTAs would be NTA.", "YTA for wanting a child with this woman", "NTA\nif she still has a desire to do drugs and excessive alcohol, she isn't ready for a kid. Even if this is a rare occurrence.\n\nSure, you started dating a party girl, but sobering up as you get older is a mature thing to do, starting again when you are trying for a baby is a childish thing to do.\n\nMake sure to communicate with her about what each of you want out of life.", "I really hope she doesn't get pregnant if she can't stop drinking and using.. That would be awful for the child.\n\nYou knew she was into this stuff when you guys met, so you kinda knew what you got yourself into. But also, she shouldn't try to have a child if she wants to continue to drink, smoke, and use drugs.", "Nah anyone saying yta is a fucking crackhead 😭. Even though i must say, you reap what you sow, for what reason you chose to marry a person that obviously cant control themselves to such a degree is beyond me.", "Why would you want to reproduce with this woman? Why would you bring a child into this? \n\nIt sounds like she's an addict and is falling back into the cycle. Neither of you should bring a child into this situation.", "NTA", "NTA and you may need to rethink the entire relationship.", "NTA but I really think you're probably not compatible if she's so blasé about it all.", "To be honest cocaine use fucks your prolactin as a woman. Can lead to permanent infertility in some cases, or messed up cycles and inability to implant and/or carry for others. Depends on her body and how much she’s used previously. If you’re currently trying, it’s absolutely mental that she’s rolling this dice even if she hasn’t already conceived. If she has, and does carry, risks include lower IQ, low birth weight, premature birth, miscarriage etc. \n\nHonestly I’d sit down with some facts in front of her and have a serious conversation. Plenty of resource online.", "NTA, she’s soooo wrong. Find someone better !", "NTA. She may be struggling with the process taking so long and using an old coping mechanism, but there are implications for you and the family you have built with her.", "NTA \nBut does she want kids? Your post sounds like you aren’t sure yourself. She sounds like she might just be doing it because you want them, considering how little she cares about the whole thing. If you are worried she doesn’t want kids, communicate with her.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nEnglish is not my first language so forgive me for any grammatical errors !\n\nSo a bit of context, we've been together for 5 years and been married 2 years.\n\nWhen I met her, she was the kind of girl who partied a lot. Alcohol, drugs, pretty much everything was involved.\n\nShe did not stop because of me but I know that my general reluctance to do these types of things was a turning-point for her. \n\nShe even introduced me to cocaine, mdma, etc but since I was not particularly enjoying any of these, she kinda slowed down and eventually stopped 3 years ago.\n\nWe have been talking about having a kid since january. I love her so much and I really want her to be the mother of my children. \n\nShe's been taking vitamins, I have been exercising etc. But 6 months and nothing yet. I know it can take some time some I am not overly worried.\n\nBut last weekend, one of her friends from her \"past\" spent the weekend in our flat. They both smoked a lot of weed, did some coke et drank a lot. Prior to this weekend, she was ovulating and we pretty much had sex 2-3 times a day during that period.\n\nI have been distant since and I feel like she doesn't take seriously our commitment to have a kid. I am actually hoping she's not pregnant. On the slim chance I would have impregnated her last week, I feel like the week-end of partying would have destroyed that.\n\nI told her that and her reaction was to tell me relax and since she was not pregnant and there were no signs of her being pregnant, that it was not that big of a deal.\n\nI am reconsidering a lot of things and I'm worried that maybe she doesn't want to have kids.\n\n&#x200B;\n\nSo, AITA ?\n\nTL;DR : My wife and I are trying to have a child but she partied like there was no tomorrow(drugs&alcohol), just after a huge period of trying\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA but talk to her. It sounds like she's convinced that she'll never be able to have a child, she sounds like she's lost hope and is trying to cope with the stress in a dangerous way. If you talk through her feelings, you might be able to help her get it back together. I hope she isn't pregnant too, you obviously don't want the baby hurt, but I think she's given up hope and that's why she's reckless.", "NTA, but just some info for you:\n\nIf she did get pregnant, the baby’s likely to be fine. Lots of folks do idiot stuff before they get the positive test, and if it all caused FAS/substance issues, we’d have a considerable more messed up population. \n\nAlcohol tends to cause some of the worst birth defects. In countries where 34% of women report heavy drinking throughout the entire pregnancy, there’s a roughly 4-5% rate of FAS. \n\nSo, no need to panic if she does end up pregnant. She should knock it off at this point though. I don’t know the rates of miscarriage related to cocaine, however. \n\nAll that being said, time for a frank talk with her about the situation. If you’ve been trying for 6 months, does she feel pressure because she’s not conceiving (obviously not from you, but from herself)? What made her say, “eff it, I’m gonna do what I want during the wait period”?\n\nI know when I was trying, it was difficult mentally. I can’t say I went on a coke bender, but it certainly messed with my head. I certainly reverted to some self-destructive behaviors because it was constant. Try, wait, try, wait. It was endless and honestly exhausting to constantly have to watch what I ate and have zero outlets. \n\nI’ve been in your shoes, too- my other half didn’t do some tests he was supposed to on time, so I went through an entire month of fertility treatments for what could have been no good reason if it’d been something he needed to have fixed. It was infuriating to the point that I had to take a few days to cool off before I could even talk to him about it. We’ve moved past it because he genuinely does want to be a father (it’s something he’s always made clear from the beginning of our relationship, however). \n\nIf you two decide to keep trying, depending on your ages and insurance situation, you may want to consider going ahead and talking to a fertility specialist.", "You don't need this judgement you need to talk to each other", "Dunno if you're an asshole but you're kind of naïve. People change for themselves end of the day not cos they get asked to.", "NTA. Doesn’t seem like someone who is ready for parenthood. More worried about themselves and making their friends happy.", "NTA: Are you 100% sure that SHE wants a kid, and that she’s not just trying to please you? I understand your reluctance to her doing hard drugs while TTC but SHE may not be trying", "NTA", "NTA \n\nIf she wants to continue to do drugs and party, she shouldn’t also being trying to have a kid. \n\nPeople with substance abuse issues tend to fall back into it when old friends are around. What happens if a friend visits while she’s pregnant? Or after the baby is born? Is she going to drugs with her baby in the next room? \n\nThis person is not ready for a kid. She’s needs to figure out what she really wants in life. And get some self control/maturity before having a baby", "NTA. However I do feel like she was just trying to let off a little steam before taking a massive step into parenthood. Being a parent is incredibly challenging and most the time there's no opportunity to have even a quiet drink with friends or even your partner. She should have definitely told you she wanted to have this night beforehand though. The lack of open communication on her part is a small bit of an issue. Maybe try having a discussion with her about holding off on trying to have a kid for a couple months so she has the opportunity to get all that partying our of the way before trying again.", "Why do you even want a child with her? Get yourself a new (responsible) girlfriend and be happy!", "NTA. If you don't approve of her drug use, get out of there before it's too late. \n20 years ago I also dated a partygirl I thought I could change. I couldn't. I have her on facebook. Now she's a forty year old partygirl with 3 kids from different fathers and two of them have serious physical complications from her drug use and she's lost custody of them on several occassions. She even tried to hit me up for cash a couple of times.", "NTA, and I’d seriously rethink having kids and being married to her tbh", "Not cool to be doing drugs when trying to get preg or could be in early stages of pregnancy already", "YTA. You knew she was a partier when you got together so why would you expect things to be any different. Even if what’s she’s doing isn’t right you knew that’s how it was gonna be. Maybe you should think about things because your priorities and hers don’t seem to be the same. Good luck either way", "NTA, but If you’re seriously considering a future with kids you need to set a boundary. No drugs. Never, not anymore. She wants to be a parent? She needs to lay off the drugs. Seriously. And do you trust her to keep that promise? Or will she hide her stash, only for your baby to find said stash and god knows what will happen then. What will happen if she becomes stressed out bc of the baby? Will she resort to drugs again? This is your life and your future child we’re talking about. I think deep in your heart you know what to do.", "I mean, I have no problem with people doing drugs. I do drugs. But I'm also not trying to make a baby.   \n\n\nI think bringing a new life into this messed up world is a massive responsibility. If I made $80k a year I might consider it, but I make $20k per year so what kind of life is that kid gonna have? What kind of life would my partner and I have?   \n\n\nA shitty one. That's why we aren't making a baby, or adopting one.   \n\n\nI think once you decide to make a child, your whole life should and must revolve around the well-being of that child.   \n\n\nI don't really know the science on this but I'm pretty sure conceiving a child while either parent has cocaine or hard drugs in their system is a bad idea.  \n\n\nNTA. Just make sure you're clear that you aren't against drugs in general, but when you're both trying to make a baby you should assume that whatever is in your bodies at the time of conception will have an impact on the baby.", "I think I'm gonna go with YTA. Not dating someone who does drugs is a perfectly acceptable boundary but you were well aware she liked to party when you got together. In fact, her decision to cut back appears to have been to accommodate your lifestyle. I don't think there's anything inherently wrong with her having the occasional party, as it sounds like this is a very rare occurrence and she's not yet pregnant. If this is a sticking point for you then that is a decision you should have come to quite some time ago.", "Nta\nUntil she kicks the drug habit, she is not ready to have kids.", "NTA- and quite frankly, you’re on two different pages completely. You’re ready to settle down and start a family, while she still wants to live the life she’s living. \n\nYou two may not be a compatible match, I would take that into consideration", "Don’t have a child with this woman", "NTA but she’s for the streets.", "NAH. Because thats who she is and you signed up for it earlier. Even though not an asshole, I would definetily leave her. That is not an acceptable behaviour towards journey of parenthood. Imagine her saying dont do drugs to your future 14-15 yearolds while she was doing coke in the process of pregnation. Also funny how people say a little bit of coke wont hurt the baby that early... Yeah sure mate!", "A weekend of drugs and booze is more likely to help you get pregnant.", "NTA. Woman here. I truly don't know what's going through peoples minds with the \"YTA\" votes.\n\nI don't mean to cause unnecessary worry, but I personally wouldn't like my children growing up in a home with frequent or non-frequent drug use. It's unstable and bad for children's development both mentally and physically to use drugs in their vicinity. \n\nI would personally, as much as I love my partner, leave them if this is how they were acting whilst knowingly trying to conceive a baby. It's unsafe for the unborn child, and will be unsafe when they are brought into the world.\n\nI know you love your partner, but I don't think she's serious about having a child, nor the safety of said child(ren). \n\nShe seems to not be past her drug use, and that is really unhealthy for your relationship and your potential future children.\n\nShe knows you want children, and she is taking drugs knowing she could possibly be pregnant. \n\nI would probably consider what you want your future to look like, and if she's the right person for you. I would personally see this as a huge red flag.", "Ask her how she sees the next few months. What’s the plan? To party until she’s sure she’s pregnant? To party while pregnant?\n\nThen lay down your conditions to continue trying: you’d like her to commit to not party anymore while you’re trying, while she’s pregnant and after that too I’m guessing. If that seems to hard/limiting for her then stop trying. Having a baby is the biggest decision in your life, you need to think this through.\n\nNAH", "ESH. You are with someone who you know doesn't align with your values and priorities, but still are adamant about changing them. But if she said she was dedicated to having a kid then she isn't making the best choices for a potential child. you both need to re-evaluate whether you're right for eachother", "YTA - it was one weekend cutting loose with a friend. If coke is a hard boundary tell her that (I don't think that's unreasonable I have asked my husband not to use that with friends) but weed and alcohol are legal in almost all states and are pretty minor stuff. If this is a once every year or so type thing to relieve stress that honestly sounds like a healthy release. It is not okay for you to ban her from doing things she enjoys \n\nAlso to clear up for you, even if she was pregnant drinking and smoking that early will not hurt it. If she can't even get a positive pregnancy test yet then it's too early to be worrying about what she eats. Also be careful about putting a lot of pressure on her. That can make it much harder to get pregnant. If anything you both need a few drinks and to just relax.", "So she's multiple years clean of partying and you think she doesn't love you or want to have kids because she had an old friend visit for a SINGLE weekend where they partied a bit because that's what they used to do together?\n\nMate you need to relax, if it's a constant theme then sure, but a 1 off is nothing to stress about. Seeing an old friend you reminisce, often by doing what you used to do. \n\nYTA for being so extreme. Sure a conversation is valid to remind her but 1 weekend of partying doesn't mean she doesn't want kids anymore wtf", "NTA \n\nand i think you should stop trying for a baby since she crearly won't stop doing drugs, that could be harmful for the kid on their development. Maybe help her with that if you don't want to leave her, though, if i were you i def leave...", "Ew why do you wanna have kids with someone so irresponsible 💀 That's weird. I would never bother making a future with some druggie.\n\nNTA but you will be the AH if you bring kids into this environment. Be responsible.", "NTA, if she goes back to it now, she can go back to it later. You dont want your kid to grow up with a mother that could possibly be a bad influence or, worst case scenario if she gets dependant, not be part of their life (or even worse be born with a serious deformity). Choose very carefully if you want to pursue parenthood with her. Maybe give her one more chance but if she does go back to hard drugs once more leave. \n\nDivorce or seperation is a verg big life/financial decision, but it's easier now then after you have a kid. You could end up with no custody of your kids because court systems generally favor mothers.", "YTA, she stopped for three years and has been taking vitamins for the last six months to assist with the pregnancy. A weekend of partying won't hurt. I wish you guys nothing but the best!", "NTA - she shouldn’t be doing drugs when trying for a baby. If she can’t stop for that, she shouldn’t be trying. Personally, I’ve never done drugs, but I cut out alcohol completely when I wasn’t on my period while trying for a baby. Lack of symptoms doesn’t mean she’s not very early on. If I were you, I’d stop trying until she gets completely clean for a looooong period of time.", "NTA\n\nif you married someone that did drugs and you were now just surprised they’re still doing drugs ? Then YTA \n\nBut you made steps to improve yourselves because you want her to get PREGNANT \n\nI wouldn’t worry about her accidentally miscarrying at 1 week of pregnancy \n\nI’d worry more about her giving birth to a completely disabled child that never had a chance if she keeps acting recklessly \n\nIt shows a lot of immaturity to do this \n\nYou should talk to her about postponing trying to get pregnant if she wants to use drugs \n\nNo one is saying she can’t use drugs just do it before trying to get pregnant or wait until you’re done breastfeeding … when it does not potentially permanent disfigure your child \n\nVery irresponsible \n\nI agree with you \n\nNo one is forcing her to try to get pregnant, and she needs to make the decision between the two \n\nMost women I’ve known will stop drinking the second they start trying to get pregnant (if trying to on purpose), this just seems ridiculous for anyone to defend this behavior \n\nHOWEVER \n\nYour reaction has to be justifiable in proportion to this \n\nI haven’t read any further comments past the OP but I didn’t see you saying you said anything other than being distant \n\nI think you two need to properly communicate about this at a rational and civil conversation level \n\nShe may not realize what risks she’s potentially putting a child in, if she were to be pregnant", "NTA, because she's not being serious about starting family. That lifestyle can be fun but not sustainable or good for a kid. Also if she were pregnant it would cause problems for pregnancy", "Are you sure you want to have a kid with her, knowing she routinely engages in dangerous (and possibly illegal) behaviour? Would she be able to quit cold turkey if she got pregnant, or would you be in a constant state of worry over her and the unborn baby? Do you know for sure she'd not go right back to partying after the birth? What about if she finds a newborn too difficult and goes out, parties and does drugs \"because being a mom is hard and she needs to blow off steam about 9 months\"?\n\nNTA.", "NTA - I believe rethinking children is a first step, but ultimately rethinking the entire relationship would be better. She isn't taking the situation or you seriously.", "ABSOLUTELY NTA. If she wants to Eff up her own life, that is one thing. She is gonna hurt that potential kid of yours with the drugs in her system.", "NTA", "I would not be having children with someone who acted so recklessly while supposedly trying to conceive. \n\nNTA", "NTA. You did nothing wrong and you’re rightfully concerned", "NTA \nI would seriously reconsider having kids with her. Love or not, she doesn't fond her lifestyle problematic at all and you need to consider what kind of life you bring the child into. \nExpecting her to change because she has a kid is playing roulette with your child's life.", "All these red flags man", "You have put up with enough. If she can't take care of herself, don't expect her to want to take care of a child or even want a child. \nStart planning your exit strategy. \nI was in a very similar situation for a year. My ex was a career oriented, business motivated professional. Lots of alcohol and nightlife. She is a great individual. However, we didn't share the same goals. I decided I would rather be alone and find someone who has similar family values and priorities with a drug free past. \nTook me months to get over the heartache. \nFound someone after a couple months, dated for a year, decided to start a family. Took us 2 months to conceive. We're both late 30's.", "You’re trying to bend wood. Really not sure if YTA or she is.", "Where in all this is your potential for being the asshole? In the being distant? In your feeling like she doesn't want a kid?\n\nYes, being distant is an asshole move primarily because it's passive aggressive and the longer you keep it up, the more of an asshole you are. 1 day? Not so much. 1 week? Getting asshole-er. 1 month? Yeah. That will take you into asshole. You're married. Time for constructive and productive conversation.\n\nIn feeling like she doesn't want a kid? Well, that's your opinion, more of a thought than a feeling. You're putting words in her mouth while you're being distant so that's kind of an asshole move.\n\nAt one point you say \"I told her that.\"\n\nTold her what? That you believe she's not taking having a kid seriously? That you hope she's not pregnant? That your medical opinion is that her weekend of partying would have destroyed any potential impregantion?\n\nESH.\n\nShe was reckless during a time you both have prioritized health. Although it does highlight, doesn't it, just how little room women have to exercise any agency over their bodies before, during, and (spoiler alert) after pregnancy. Have you considered that? The freedom (nil) and depth of commitment (loads) she's encountering? No, you've just been distant and judgemental and \"flipping out\" and throwing your medical opinions around without any meaningful attempt to companion your partner into a major change of life beyond having sex and having feelings and opinions.\n\nGet counselling. Get you both into see a doctor to discuss ramifications of substance use with you both in a nonjudgemental way.\n\nEdits: word choices for clarity", "YTA. You already knew a lot of her general behaviour beforehand but still decided to start a relationship and family with this woman?!?! You're both red flags and just because she started to turn around for you, doesn't mean that's the go ahead. 3 years would be way too soon to decide this. I feel like you wanted to 'Rescue' her. Please stop and see sense.", "She is definitely the AH, taking drugs when there is even a slight chance she could be pregnant is absolutely disgusting.  Shit I even stopped drinking alcohol when I was trying to get pregnant.", "ESH mostly her for continuing to abuse substances while trying to get pregnant.  But I’ll see you, for marrying a known drug user and then being shocked she still using, and trying to have a child with her. please do not bring a child into the situation until you have both grown up and are ready.", "YTA for knowing your wife was into drugs and thinking she would magically stop using once you got married.", "Lol, weed and coke is the start of a pregnancy, not to be worried about. As long as the kid's yours, she'll settle down. NTA but lighten up.", "YTA\n\nYou knew what you were getting.", "YTA, you don't get to decide what someone else does with their body, her being your wife doesn't change that. You knew she did this stuff when you got together, and it's not even a regular thing anymore. \n\n\nI hope (for her sake) she dumps you, you seem judgemental and clueless.", "NTA. RUN FAR AWAAAAYYY from this woman.", "NTA", "NTA but why the heck are you trying to bring a child into the world with this person? You’re setting yourself, your wife, and any children you have up for an unstable, potentially dangerous life.", "NTA. It’s hard to think of the child now as they are just an abstract idea but you don’t want this for them.", "ESH - She is the bigger AH based on taking steps to get pregnant while using recreational drugs. This can lead to a lot of problems for the baby. I have a feeling that you married her thinking she would change and that you could save her, which is your AH moment. If I’m being honest, she doesn’t want a kid or doesn’t want it bad enough to quit her party lifestyle. If this isn’t what you want, leave now. You can’t expect to change people just because you married them.", "YTA lol adults can party once in awhile and in fact; it happens more than you’d think.", "YTA. Mostly because you sound insufferable and really judgemental. Please remember you’re her partner not her parent", "ESH for trying to have a baby when you all are still in your party years. There is nothing wrong with partying, but you shouldn’t be doing so when trying to get pregnant. The first 4 weeks (before many people know they are pregnant) is when some very permanent developments happen with your fetus.\n\nYou married a party girl and are surprised that she’s partying, which I don’t get", "YTA, it’s her body that’s going to go through a huge amount of changes and trauma while pregnant/after. She probably just wanted one last hoorah, and besides there’s heaps of people who fall pregnant without knowing and continue their lives like this for a while before realizing, with no affect to the pregnancy.", "YTA\n\nAnd you sound insufferable. There is so much contempt for her in your post, anger that she isn't pregnant already. That it took you two all these to talk about life goals regarding kids, seems like a red flag to me. You want her to be pregnant, yet hope she's not. It all sounds as if it only to get control over her and force her into a position of dependance. And be it ony depending on you to be a decend father to an inocent child that's not responsible for your failing marriage!", "YTA. \n\nClearly your ideals don’t align OP. It also seems like you haven’t made up your mind as to what your boundary is? What frequency of partying is comfortable for you because obviously you already knew the type of person she is before you decided to commit. \n\nAlso I don’t see others mentioning this, but have you guys discussed your views on parenting in reference to her partying? Would she be indulging while you guys have a very needy baby?\n\nYou guys deserve to be happy just as much as other couples but please make sure you are on the same page about the long term and what happens post the baby’s arrival BEFORE bringing a life into your dynamic.", "YTA\n\nSaying this with a sore heart.   Can you blame a scorpion for stinging you?\n\nWe like to think we can change people, but people rarely change and if they do it's because they want to not because you want them to. Sorry bud but you have to lie in the bed you made.", "YTA, \n\nWhy are you under the assumption that you can change her? \n\nShe enjoys living her life that way and you knew that about her when you met and dated.", "YTA. She showed you who she was at the beginning of the relationship. If you wanted something different you shouldn’t have gone out with her to begin with.", "I think NTA but have y'all actually talked about what partying means at this stage in your lives, and how you don't feel comfortable with her doing that anymore? \n\nIdk if you've ever heard of the \"cool girl\" phenomenon but it sounds like you've been basically being the \"cool guy\" for a long time. The cool girl is the gf that lets her boundaries get stomped, and puts herself in unsafe situations, all to not be thought of as a nag or a downer. Would you say that describes you and how you've approached this issue in the past? \n\nIt's okay to not want your spouse to be staying out all hours, getting smashed and doing drugs. You are not unreasonable at all to not want a life like that, if it stresses you out. But you have to draw the boundary.", "How did she know she wasn’t pregnant? Nta, dump this woman and get a more healthy one.", "NTA", "NTA\n\nWhilst maybe smoking a tiny bit of weed whilst she doesn't know she was pregnant *might* be ok, hard partying and coke is not smart when TTC. \n\nI get the mentality of \"well I'm not getting pregnant anyway\" because I've been there. But this is nuts.", "NTA, fondness of cocaine and marijuana use is not the kind of traits you'll want your baby mama to have. I mean think really hard, cocaine is an addictive drug, if you have s child with her, are you sure you wanna risk having the mother of your child have a drug addiction? You're better off finding someone who actually cared enough to say no to drugs.", "YWBTA if you decided to carry on trying to have kids. Time to leave this is not the life you want to life so she's not for you. Not sure why you started a relationship if with somone so hard into drugs when you weren't.", "I think you are fundamentally incompatible and neither of you should be having a baby together.", "YTA for staying in this situation,RUN. The woman who introduced you to coke is not the woman you make your wife smh💀", "Time to assess whether you live each other for who each other is, or if there was attraction because you each have each other what you were lacking at the time. \n\nTelling you to relax when you voiced a concern is problematic because it’s not addressing your feelings or offering you the opportunity to feel a sense of resolution.There is none as she values fun with her friends and there is an obvious divergence of values.  \n\nPerhaps working with a therapist can help you both communicate what you’re feeling and what you are both working toward. \n\nIf you value a partner that will love straight edge, and raise your children not to use drugs, you may run into future problems. \n\nDid you discuss kids or eventually not using drugs when you got married? What were you both expecting when you got married? \n\nNAH: Both have different values and are struggling o communicate. Husband can work to understand his wife’s values. Wife needs not to minimize and deflect husband’s concerns.", "Why are you married to this woman? You don’t appear to share any values about what’s important to you. She doesn’t even share your goal of a family because she’s compromising her health and risking potential pregnancies. You can really harm a baby’s health by using alcohol and drugs prior to pregnancy. She needs to commit to being clean for a long time before trying again. NTA.", "2-3 times a DAY!?", "YTA for marrying her. You two have different lifestyles, and you knew it beforehand. The mindset that you can change someone is terrible. Marry someone like you next time.", "NTA.\n\nWhen she agreed to trying - and it sounds like she did - then she agreed to everything that went with it. This isn’t rocket science. Tobacco, alcohol and drugs are harmful to fetal development, ESPECIALLY in the early embryo stage. No, he doesn’t have a lock down on her body but there is nothing wrong with him pointing out obvious harm to the child that is also his. \n\nIf she was single I would still say she is the asshole - a giant asshole.", "NTA, I would be scare she is relapsing into her older self.", "Hi I went to nursing school, basically the first 8 weeks of pregnancy are extremely developmental in regards to alcohol and drug use. That’s when all the big boy stuff really is forming. And lots of people don’t know they’re pregnant that early so I think you have a crazy valid concern, cause what about next time \nNTA", "NTA, are you sure she's not still on birth control? Sounds like she isn't even worried at all about getting pregnant, whether or not she's taking vitamins.", "From what you are saying, she sounds pretty irresponsible. Are you really sure you want to have children and raise children with an irresponsible partner?", "You don't sound compatible. Why did you marry her?", "NTA\n\nIf she's not willing to stop walk away. Have you talked about how things would be if you two had a baby?", "This is more reddit anti man nonsense. You're clearly NTA, and all these hypocrites would say the same if the genders were reversed.", "Bro do yourself and distance yourself from junkies. It never works out well. If she can’t stop using, it’s a lost battle. Junkies are not suitable parents. Kids can even die in such settings.", "NTA. Her behaviour proves she's not ready for a ltr. And certainly not for kids. \n\nYou can't change who someone is. She's still a party girl. She doesn't want to change, or she'd have said no to the drug and booze fest.\n\nSounds like you're incompatible.  And at different stages in life. I'd call it quits. Cut your losses before you feel you're too old to have or raise kids. Find a girl who shares your values.", "You don’t show symptoms of pregnancy at 1 week? She could be pregnant and doing that. They say alcohol isn’t the end of the world as long as you stop when you know but anything else can be really damaging! I was ready to call OP the AH but they’re actively trying for a baby and she could be pregnant! NTA", "NTA\n\nThe wife is supposedly actively trying to conceive a child and still consuming both alcohol and drugs. By having unprotected sex during a known period of ovulation she is putting herself in the position of being pregnant and still engaging in behaviour that would be harmful to the developing fetus.\n\nI can see the concern. It's time for a sit down discussion.", "NTA. Why are you with this woman. She sounds like an addict and I'd have huge concerns about her staying clean throughout a pregnancy and as a mother. In the state she's in now she shouldn't be trying to get pregnant - she should be going to rehab.", "Honestly, I'm going with ESH. Her for obvious reasons but you for willingly getting into a relationship with someone who didn't want to quit on their own. She slowed down because you didn't like it, great, but what did you think was going to happen? Did you think she'd never touch them again.", "You should brush up on the beginning stages of pregnancy. It takes about 7 to 8 days for the fertilized egg to latch and 10 to 14 for it to start sharing blood. \n\nGiven her past and style of partying, I think your wrong here. It would have little to no impact at this early stage of pregnancy. \n\nHowever, I wouldn't want my partner doing hard drugs at any point, so it would have been a deal break for me a long time ago.", "Nta. As a recovering addict, and a mum, I can tell you that needing hard drugs to have “fun” - or even if it’s getting blackout drunk - ain’t a healthy way to be. You’re right fo be concerned", "NTA. Sounds like you are at a crossroads and should seriously consider how you want to go forward. She took the first opportunity to go back to her partying ways. Do you really want that to happen after she has a kid?", "NTA - your girlfriend sounds like she has put in a lot of effort to change her old ways into living in synchronicity with you, but this was a bit reckless. Your concerns are valid. \nP.S. Most of the redditors here do not have the life experience to judge you, her, or the situation. Do what feels best, and I suggest some couples counseling. Sometimes, it's better for her to hear it from a professional.", "NTA. Red flag. She won't change.\n\nKids changes lives, not necessarily the people. Someone who wants to care will care without even asking. It's simple as that.\n\nJust because you love someone doesn't necessarily mean that they've got that innate quality of being a good parent and you may need to accept that your wife just likes the partying life.\n\nI'm not telling you to do anything, just think long and hard what happens when you end up with a kid with her.", "Not the asshole.\n\nYou're ready to be responsible and grow up, she is not.", "NAH - you are not on the same page for your relationship. It doesn't make either of you AH. I don't think she is ready to start a family. Maybe a time for a honest conversation about where you are and what you want. \n\nI used to be a total party girl. I gave up that lifestyle to get married and have kids, but that was 100% my decision.", "NTA and I would seriously reconsider starting a family with her. You have to consider the possibility of her engaging in such behavior again in the future, and since apparently this is not ruled out as she looks like she's not worried and doesn't care much if it happens, it might as well just happen again for sure. Now imagine this but with kids involved...", "NTA\n\nFoetal Alcohol Spectral Disorders are no joke and seriously life limiting. \n\nAsk your wife if she wants her kid to have intellectual disabilities and a life expectancy of 31-37?", "Seriously, I'm not SUPRISED how many morons are here calling OP an AH. Self reflection, I guess? Op is not a AH. However OP you knew she was like this. Why hook up with someone like that?", "NTA\n\nWomen don't magically just automatically know when they're pregnant. If you were trying, she could well be.\n\nI didn't even eat soft cheese when I was pregnant! No sushi. No cold meat. No leftovers. No alcohol. I can't imagine thinking it would be okay to take drugs while potentially pregnant.\n\nI'd be upset too.", "NTA but you will be if you have a kid with her because if there's a chance she has an addiction, she'll ruin the kid's life.", "But the implantation of the embryo happens a good week after fertilization, so she really wasn't exposing the baby to anything even if she were pregnant.", "Seems like she wants to get pregnant and is destroyed that it hasnt happened yet and is convinced that it'll never happen so she's coping by reverting back to the party life. Maybe she's convinced herself settling down is hopeless and this was her opportunity to try to forget about it.", "Ikr, I skipped alcohol on my wedding day because I could have been pregnant.", "You don't marry someone while you're still hoping they change things about themselves. Only marry someone when you're happy with them staying who they are at that moment. Not everyone changes and you're an idiot if you marry someone thinking they'll change everything you don't like about them. He should have talked about this a long time ago and seen if she was willing to change and seeing how she isn't then he should have broke it off.", "Of course people can and do change, but it’s completely ridiculous to EXPECT someone to change in a specific direction. Sure, lots of people do hard drugs in their 20s and grow up and stop them and are responsible. There are also SO MANY who grow up and get more and more addicted, who always prioritize drugs over their relationships. If you marry someone with a drug and alcohol problem, you are signing up for the possibility that this person may never get their shit together.", "I'm mindblown by how there's people telling OP he's TA for not wanting his partner to do hard drugs, especially while trying for pregnancy.\n\nMen can't even get pregnant but if a woman came on here complaining her husband was off doing coke, he'd definitely be called an AH.", "Agreed. OP is NTA. Frankly I think OP needs to decide what he wants in his future and take a moment to evaluate if his wife becoming who he wants is him just wishing things where different. \n\nI don’t think his wife really wants to change. I mean what happens when she’s pregnant. Is she going to go out and party? Probably. What happens when she’s breastfeeding? Is she going to do drugs? What happens when it’s a weekend and baby needs to go to bed but a great DJ is playing downtown. Is she going to go? \n\nOP can’t ask his wife to change if she doesn’t want to. He can’t force her to be different because she’s an adult and while it’s sad he can’t make her do what he wants. \n\nWhat OP can do is evaluate what he needs from life and act accordingly. And I think that starts with maybe divorcing his wife. I hate jumping to divorce. I’m of the belief that people go there too often on this forum. But this is one of those times I just think this couple is really incompatible and I’m not sure therapy and couples counseling could solve all the issues here.", "I know lol! These people are like \"wtf bro it's just coke! Not like it's some highly addictive commonly life destroying opiate.\"", "Who the hell is YTAing OP, this is such a clear NTA. The woman has to change ASAP; if she's really making an effort, she can't hang out with these enablers, because they'll simply drag her back into these toxic vices that will only harm her, her possible baby (ehem crack baby ehem) and OP. It's hard to stop consuming addictive substances, but it's HER responsibility (With the help of friends and family of course)", "He willingly married her knowing how she was like", "Nope not true. In posts where women complain about their partner you always find a bunch of men calling her TA for being with him.", "Why? Would doing coke and drinking alcohol after a intense period of trying, change the quality of his sperms he nutted in her 3 days ago? Hahahaha\n\nThis dude married a party girl - there will always be weekends like this. He just wants a baby so he can switch to using guilt to make sure she is the \"responsible adult\" he wants her to be. \n\nThis guy will have some hard awakenings coming in the future. \n\nI have a friend couple who are the best parents you can hope for as a kid, but if they give the kids away to do a party revival from their young years.... maaan, these guys know who to make party and you would never think they have kids and are good parents when you meet them on one of these weekends, lol. \n\nThe problem here lies in the fact that she likes to party and he not only doesn't like it, he also doesn't like that she likes it - and this will be a problem when he is home with the kids resenting her for having fun when its \"this weekends with her friends once a year\".\n\nAnd no, not everybody doing coke once in a while is gonna end as an addict. Noone would say this about someone drinking booze once in a while, when alcohol is similar addictive than coke.", "Yeah, I don't get why he is trying so hard to be a single dad. But no OP, you are NTA", "Underrated comment", "Don't you mean child with this child?", "Fair", "This.", "I picked the drug addict party girl to be the mother of my children!", "I’m assuming OP thought as she got alder and matured she wouldn’t party as hard anymore. Especially since they’re trying for kid.", "nta for sure but I feel like every other comment is about how he shouldnt have married her even though he talks about how she had been clean for three years before this incident. he married her while she was clean and she was clean for years afterwards.", "If I get his story correct, she's been off it for 3 years and just did it once with an old friend. Does not seem at all like an addict falling back.", "I was waiting for someone to say this! Ugh. I literally thought this post would be OP blaming his wife for becoming infertile from past drug use but it was shitty in a different way", "And maybe some couples counseling. Trying for long periods is rough and therapists can help you communicate with each other. It might also be helpful for her if she’s struggling with sobriety.", "So what happens when they have kids and she has a stressful day, and needs to “let off some steam”? Do cocaine as a parent?? Wtf.", "I never asked her to change and she has repeatedly told me that she was glad she met me because the path she was taking a destructive one. She wants to have kids as much as me, or so I thought. Since her behaviour as continously changed and she has taken steps to avoid going back to her old destructive self, I will admit that I was foolish enough to believe that she would not go back to doing stupid things like that. I guess I was wrong", "As much as I hate to admit, I agree.  People are who they are and you can either love them for that or move on.  Forcing her to change will create resentment in both sides and never ends well.", "So you’re really only going to address one side of this? Lol. \n\nWhy is she also not to blame for choosing to marry and agreeing to have children with someone that she *knew* didn’t want a lifestyle of heavy partying and drug use? \n\nIf they are trying to conceive and start a family, there’s no argument that you could make saying that using cocaine and partying benefits that cause. It only hurts it. \n\nNTA and op needs to think about what the comments/advice in here would be if the genders were swapped in this situation. Go with what that advice would be", "We did, she told me that she wasn't interested in these kind of parties anymore. Which was why I was so surprised and shocked to see her do this after 3 years of completely stopping", "I think it would be fair to expect a woman engaging in alcohol and drugs to stop when trying for a baby. There's a risk she may be unknowingly pregnant. Not to mention some habits die hard so it may be harder to quit the moment she knows she's pregnant rather than beforehand.\n\nOP's definitely not all too clever since he married and is trying to have a child with someone that does hard drugs. But being foolish by expecting your partner to be logical doesn't make one an AH.", "Cocaine is a healthy release?", "Lol drugs aren't good for someone who's trying for kids though. That's a gross environment to bring a child into anyways", "I hope you're right. Thank you for your answer, I'll try to be more kind. I'm just angry and disappointed", "One weekend in three years is not \"routinely engaging\"", "Cool, then she’ll OD on cocaine and alcohol with her “friends”. What a comment man.", "Lol username checks out for the guy victimizing the person with the indulgence abuse issues 😆", "Classic unintelligent Man United fan response.", "I feel like you have not read my post at all. You paint a picture that is so untrue that I'm not even sure where to begin. Of course we talked about life goals, that's what marriage is about, communication ? I'm worried that her partying might have affected her possible pregnancy, that's why I hope that she's not pregnant ? I have no desire to control her at all, I think you might be projecting. You seem to have a lot of anger but i'm not here to do your therapy.", "What a stupid thing to say, please never comment ever again.", "Are you stupid? He didn't say anywhere that he wanted to control her or that he wanted her to change. He didn't agree with the lifestyle so he didn't participate in it but never asked her to stop. Its not illogical to expect your wife to stop participating in these activities when they want to get pregnant. Learn how to comprehend before posting your opinion so you don't look stupid.", "If this was reversed and the woman was the one posting, you’d be saying NTA.", "The not exposing part is not that clear cut. There is some research (on animals) that consumption of alcohol around conception may have adverse effects. It is not for sure, but erring in the side of caution  and skipping that month would have been the better choice in my opinion.", "You’re right, perfect time to go on a bender and poison your body. Gotta get it all in before the embryo implants", "…it’s been 6 months, not 6 years.", "He literally says in the post that she *had* changed and was clean for an entire year before they got married, and had been clean for three years total until this past weekend.", "And yet she did. She even started taking prenatal vitamins. It’s a giant bait and switch on her part.", "No one stays the same, we all change in the course of our life’s. We grow and learn and experience new things.\n\nAnd yes some people change negatively. Marrying someone and hoping or expecting them to always exactly stay the same is naive.", "Coke isn't an opiate", "Spoken like a true person who does not know a thing about drugs at al -_-", "I unfortunately don’t think she will be able to change quick enough if at all. Unless she’s the one who wants to. It’s sad but when you are dealing with someone whose addicted to being reckless you have limited options anyway.", "She's been 3 years clean and they're trying for a baby. It's completely fair to expect her to not be snorting cocaine rn. I'd agree with you if she'd still been doing drugs when they started planning for a baby, but that's not the case as she had quit until now.", "But- she changed, she quit, years ago, and now they’re ALSO trying for a kid \n\nShe was clean when they weren’t trying to get pregnant, and now she’s doing things that could result in her giving birth to a child whose permanently in a coma or requires full time care just to be alive - that they have to care for full time the rest of their lives or painfully send them away to a nursing home to live their whole life in a bed \n\nHis worry about a pre-term miscarriage is the least of the risks", "I don’t know if that’s fair. Sometimes people have so much hope that someone can change if given the chance that they make excuses. I think OP is realizing that he can’t make excuses anymore. Wife needs to realize how reckless she is being and she needs to come to that realization for herself.", "People change so I don’t think this is an excuse, but I do think he has no excuse anymore for finishing inside a woman like this. \n\nRegardless of the gender wars currently happening in this thread, people in general need to be accountable for who they willingly crawl into bed with.", "Ok buddy, whatever helps you sleep at night.", "I'd say this is the only valid outcome tbf.", "People don't read everything, or make up their mind to earl, so some facts don't get noticed even if it would change the way the view things.", "This is why a lot of parents will do every second weekend one of them gets to go out for a night so they're not doing this stuff around their kids. Being a parent often means losing all your own interests and body autonomy.its unfair to have such strict opinions of what a parent should be and do. Parents are allowed to have a night off", "Well she isn’t going back to a party life. \nShe had one weekend, where she let out all the pressures. So you are wrong and unfair accusing her to go back to old habits for one weekend. \n\nOnce in a while isn’t a lifestyle. \nPartying hard after a long time not doings it, often make someone realise it’s really not the life they want, however can be nice to reminiscent of more lightheaded times. \n\nShe wasn’t pregnant nor responsible for a child and got loose for a weekend. Seriously better doing that now that after. \n\nBtw even if she was pregnant at the time she did that. From the timeline the cells size of anything going wouldn’t be affected at all. \n\nOnce isn’t in any an indication of her backing out from wanting a child with you, nor her commitment towards you and getting pregnant. \nThe way you jump at that, sound like you would find any excuse to accuse her of that. And that make you TA", "I understand. I know from my experience you can’t make anyone change, and you probably shouldn’t expect one to when it comes to drugs or alcohol. You’ve done your part, it’s time for her to step up and figure out what she wants to do moving forward.", "I see your point but one person here wants the other to change.  that's why it's an issue to get involved with someone who you aren't okay with their lifestyle.  he never said that his wife wants him to change.", "You've been together for 5 years and she hasn't partied for 3. So what, you spent two years just being really annoyed with her until she eventually stopped? If this is a boundary for you then it never should have made it to the two year mark. And if it isn't then one night of cutting loose really shouldn't be a big deal to you.", "It was one weekend, and putting too much pressure on trying (causing stress) can actually hinder conception… before implantation, so like 2 weeks after conception, it’s pretty much a make or break situation, where the embryo isn’t actually connected to the mothers circulation yet. Dude once she gets pregnant, she’s gonna have to miss out on a looooot of things for 9 months plus some more during nursing. Let her have some fun before she can’t anymore", "You have to see that she clearly isnt over that yet and she wont be.\nIt is called pattern of behaviour.\nAnd i doubt she hasnt done anything(including partying) in the meantime.\n\nI know i wouldnt have even dated her to begin with but that was your choice. Now you have to deal with these consequences. Do you want to have a child with a party animal(dont think she will change anytime soon)?\n\nOr wouldnt it be better to reevaluate your relationship, count your losses and move on?", "She isn't ready for a kid yet, how old are you two? If you are under 25, let her have her wild side for a little bit longer, she will grow up. If you are heading more into 30, you maybe should think about the fact that this woman is maybe not mother material (yet)", "No OP. It’s cocaine, not alcohol or pot.", "lmao a person uses cocaine once in 3 years and you assume shes definitely gonna overdose, what a comment man", "I, and millions of other people, manage to do cocaine occasionally and not die, it's *really* not that uncommon.", "NTA 100% you both made a decision together to start a family, the fact that she chose to do something that would jeopardise a possible pregnancy and wave it off like it’s nothing shows a lack of care.  You clearly love this women so I would sit her down and explain your feelings calmly then have a conversation about your future because parenthood is forever so it’s always better to go into with both of you fully committed. \n\nAlso I agree with other comments - if the genders were reversed everyone would say you are NTA and be planted red flags outside her door not yours.\n\nGood luck I hope things work out for you both", "Bullseye 😁", "I just have to deny this request of yours!", "They’ve also shown that it’s something like 12 months before even with light drinking. It’s not particularly great but also the egg doesn’t connect to the blood supply of the mother until about 10-11 DPO for most people, so a once off is unlikely to have done anything.", "It doesn't sound like he communicated about it being a deal breaker. He dated her for 2 years while she kept doing it and she naturally stopped. Not because he said it was a deal breaker for him. If he was fine with it for 2 whole years I doubt she'd think it was that big of a deal to him so now that she has an opportunity she wouldn't see anything wrong with doing it for fun. There's a big difference between naturally stopping and clarifying you're never going to do it again. I haven't had alcohol in like the past two years because I haven't really had a good time to do so, but I definitely plan to drink alcohol again in the future. If he wanted her to always stay free from those drugs he should have made it clear it was a deal breaker.", "You get his point tho right? Cheese and crackers smh Way to miss the plot.", "Thanks I actually knew poppy wasn't a primary ingredient but I did think it was in coke. I don't believe it changes my view on how addictive and destructive it is however.", "It’s not a herb either", "Most cocaine in the world is cut with fentanyl now which is worse than any other opiate", "And with the way the US is moving with abortion rights, there’s a high possibility they wouldn’t be able to terminate a high-risk (mom or baby) pregnancy anyway.", "But if this situation was reversed and OP was the wife in this situation, it would be husband is a giant red flag and girl leave him. \n\nI know we get all southern Belle. \"But Momma, I love him, and I can change him through our love.\"\n\nThe reality is that some people change and some don't. Some grow up, and some don't. They are active trying to get pregnant, so the wife has to know that now is not a good time for weed and blow. \n\nOP, nobody would blame you for choosing to hold off on having kids until your wife has put her party favors in the past or chose not to have kids altogether.", "No that's stupid. If you marry someone hoping that they completely change who they are you're an idiot and deserve the consequences when they don't change.", "Nah, not to do cocaine.", "Stuff like coke isn't a game, even taking it once could lead into falling back into a destructive lifestyle. If you want a child, or are trying for it, \"letting loose\" and doing drugs and stuff is irresponsible as fuck, and it's completely valid for the OP to reevaluate his choice. If \"letting out pressure\" is done by doing drugs and partying, then they need some serious counseling or this relationship won't work, nevermind parenting", "No, but he did say she told him when they met that she was glad that she met someone like him in order to incentivize her to change her lifestyle. She recognized that it was “destructive” for her to live that lifestyle, as OP put it. \n\nEncouraging your partner to live a healthy lifestyle that’s safer for them and the entire family is not a negative thing, no matter what type of Olympic level of mental gymnastics you can pull off. \n\nGiven all of the details of the situation, bottom line is she slipped up and made a hurtful mistake. Period. That doesn’t make OP an AH", "Cocaine isn’t lax, man. It’s not a good look especially for a grown adult looking to start a family. Well, really any grown adult at all.", "Just because it’s not that uncommon doesn’t make it ok", "When you do that shit while trying to get pregnant, it’s effed up and you have a problem.\n\nNTA, but the wife is", "They're right tho.", "[deleted]", "Fentanyl is literally in every street drug these days - doesn’t matter what you THINK you’re doing, powerful opiates are mixed in when they’re shipped in bulk", "Poppy makes opium/heroin, and cocaine is made by cocoa leaf", "You neutered the validity of your comment with your gross negligence on basic facts. \n\nSit quietly, and consider the life decisions that have gotten you to this point.", "Depending on state \n\nThe way he phrased some of his post I’m assuming he’s Italian, maybe they’re in the UK", "No exactly I think this is the exact same issue with gender roles reversed. \n\nHusband leaving when baby needs to go to bed. Bad. Does husband do drugs and party and then try and take care of baby. Does husband bring illegal substances home and keep them in reach of baby. \n\nAll of this would still be the same type of red flag. Op needs to realize that things don’t always work out. Regardless of how much you want them to. And I think he needs to leave her.", "That’s exactly my point.  People make bad decisions because of wishful thinking. It’s human enough to understand why they are being wishful but it’s bad news bears to make such a big decision based on a wish that things will get better. More often then not things get worse. \n\nIt’s like women who marry their abusive partners thinking it will get better when they get married. And typically it gets worse. \n\nEdit: personally I don’t think this makes someone an idiot. I think it makes them human and wishful thinkers. And it’s not a good way of functioning in the world.", "So the same women who’re beaten and raise their kids on their own deserve it too using the same logic?", "Once, this is a one event weekend. \nAnd don’t twist my word. I did not said drugs were harmless. On the subject of is the use of drugs once (alcohol included) during the very beginning impacting the very tiny lump of cells, no. It’s completely different when you use it after, or when you know you are pregnant. \n\n\nAs much as it’s bringing worries to OP considering her past, let not play the part where she is going down the party path. What she do after will be more telling. \n\nRight now OP need to calm down, take a deep breath, and control his spiralling into thinking the woman he want a kids with is screwing their attempts for it by partying too much. \nHe can be disappointed, voice his concern, and have a talk to make sure they still want the same. \n\nHowever accusing his partner of not caring, or going back to a party life after one hard party weekend is unfair. It’s not like she never ever partyed that way so out of everything he knows about her. It doesn’t means at all she will do it again, even less as a mother. It doesn’t make her irresponsible neither. \n\nONCE NOT AN HABIT. \n\nSo yeah declaring she is irresponsible and going back to a party life after one weekend, is quite OP projecting his own fears more than telling anything about her commitment with him.", "Do you have a problem with people drinking too? Drinking ruins more lives than coke does.", "She *wasn't* pregnant, her old friend was visiting and they were just having a nice weekend. \n\n\nDoing it *while* pregnant would be different, obviously.", "They didn’t say it was, they made a comparison. Also, coke has ruined plenty of lives.", "Sure sure. Comment was for the weirdo saying “iTs nOT an OpiAte”. Like yeah ok it’s a stimulant but cmon you know what they meant. People can be so silly.", "can confirm - unfortunately as a public school teacher fentanyl facts are drilled into us. 99% of fentanyl deaths are accidental overdose and it’s because the user was unaware that fentanyl was laced in their drug of choice. for kids/young adults it’s mostly due to experimenting with one drug and getting something cut with fentanyl instead without knowing. some reports think it’ll start getting laced into weed soon, but i don’t know about the accuracy of that. \n\nOP, it is a VERY high chance that if you’re in the US (don’t quote me on other places) and your partner is doing coke or percs (any prescription pills recreationally, really) it has fentanyl in it which is a synthetic opiate 50 times more addictive than other opiates. harder to find too since it’s odorless and tasteless.", "While this does happen, it’s a bit of a stretch to say it’s in “every” street drug. Unadulterated cocaine exists.", "See that was more or less my assumption.", "Thankfully, my state still believes in bodily autonomy, but that’s becoming the minority really quick. \n\nHopefully that’s not an issue they’ll have to confront.", "This is why I say it’s wishful thinking. I can understand why they make the decisions they did. Even though I know and can see that it’s bad decisions.", "Not at all because they're usually victims. I think in some cases there are women that are pretty stupid for staying in abusive relationships and then bringing a child into it. But most of the time this is completely different because abuse victims are often trapped in their relationship both emotionally and financially. Many abusers also hide their tendencies until after marriage or children. The scenario in the post is incomparable to an abusive relationship.", "You keep defending your hardcore drugs, RottingPony. Best of luck to you.", "If we can't pedantically correct people in order to distract people from the important conversation being had then what is the point?!  /s", "It highlights that they don't understand shit about drugs.", "It’s already laced into weed. At least where I’m from. It’s a huge problem", "Paramedic, 10 years \n\nFentanyl isn’t necessarily more addictive to non habitual opiate users….\n\nIt’s stronger by weight \n\nSo in this example, 1 mg of “pure” heroin (dimorphine) / morphine might get you high, adult medical dose would be 4-10 mg\n\n1 mg of fentanyl (which is equivalent to a 100 mg of morphine) would very much kill you 5 times over \n\nFolks that do opiates a long time gain tolerance which is why they want the higher potency because it’s cheaper to do 0.2 mg of fentanyl (which is usually the same price by weight) than it is 20 bags of heroin a day \n\nThe newest problem that we’ve developed is that opiate suppliers cut them with a veterinary chemical called xylazine (“Tranq”, “tranq dope”) which makes both heroin and fentanyl even stronger \n\nTranq makes 2+2= 40 not 4 \n\nAnd unlike fentanyl and heroin it does not have an antidote, causing people to die despite narcan use \n\nGet a CPR card for training to handle those situations", "It does- but in the US it is very much in the minority \n\nWe’ve handed our free tests at festivals and concerts for years and I’ve watched hundreds of blue (positive) tests get swept up out of the parking lots at each event", "Yea I saw a map a few days ago that showed that 38 states have less than 5 locations to get a normal, 1-16 week abortion \n\nInsane", "So that's a no then, making you a hypocrite.", "Exactly.", "If they had one at all**", "Nah, alcohol can be consumed to pair with food tastings to amplify flavors. Not always consumed to get drunk. Cocaine is used to…only get high. Comparing cocaine to alcohol is laughable and the common resort when it comes to people justifying the use of hardcore drugs"]}