{"id": 21346, "submission_id": "14qnyvl", "title": "AITA for being annoyed that my wife doesn't want to come with me to a music festival for my 40th birthday?", "selftext": "I'm 39M and my wife (38) and I have 2 kids. We've been together for nearly 16 years. We went to a good few music festivals together over the years before we had kids, including a couple of visits to Barcelona for Primavera Sound. For those unfamiliar with it, it's a festival held in the city of Barcelona itself - no camping, just hotel/airbnb for the weekend. The previous times we went we always rented an apartment.\n\nI turn 40 next year and I've always said I don't want a big fuss for it. The one thing I've always said though, is that I'd like to go to Primavera. Our kids are old enough now that they can stay with my mother or sister for a weekend - they all love each other big time, they both spoil the kids whenever they stay with them and the kids love going, so that's not an issue.\n\nA couple of years ago one friend mentioned wanting to go to Primavera for his 40th and i loved the idea, so since then it's the only thing I've said I wanted to do.\n\nToday my wife asked me what I want for my birthday next year and I again said no fuss. She mentioned primavera, and I said yes.\n\nShe then tells me that she won't be going, that she's outgrown it and has no interest. I told her I was disappointed, that she's my wife and the only person I'd want to celebrate my 40th with. She repeated her disinterest in the festival and said she'd \"hold me back\".\n\nLater she noticed I was quiet and asked if I was annoyed with her, I said I was because she has basically told me she doesn't want to spend my 40th celebration with me. AITA for expecting her to want to come? It's not as if I drag her along to these things all the time, it's a one off for my 40th.\n\nTl;dr want to go to a festival for my 40th birthday, wife says she doesn't want to come.\n\nEDIT: So to be clear, when I say I don't want \"a big fuss\" I mean I don't want a huge party or big deal with family and friends, I just wanted something for the two of us. I appreciate that what I want to do with just us isn't a minor thing, I just wanted something semi-casual together, a weekend of beers and music. The festival is an urban one, so no mud involved and back to an apartment at the end of the night.\n\nEdit 2: the friend who had the same idea is older than me, his 40th has been and gone. As far as I'm aware he's not planning on going next year. I literally don't know of anyone who is going to this festival next year.", "created_utc": 1688497578, "permalink": "/r/AmItheAsshole/comments/14qnyvl/aita_for_being_annoyed_that_my_wife_doesnt_want/", "score": 502, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I asked my wife to come with me to a music festival for my birthday, people may think I'm the asshole for expecting her to\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NAH. But a multi-day music festival, even if it were in your backyard, is what most people would count as a \"big fuss.\" I know you'd like to spend your 40th with your wife, but do you really want to drag her somewhere she would quickly get tired of?", "NAH. You can be disappointed but you can’t force her.  She doesn’t want to go.  It’s not like sitting through a baseball game or concert.  It’s an all day festival.  It’s a lot to ask an uninterested person.  Take a friend and do something else with your wife.\n\nEven if she goes with you, she’s not gonna be happy and having a great time.", "NAH. I'm definitely not as into festivals as I once was, so I can understand your wife's position. Also, if a trip is involved in celebrating your birthday, even a milestone birthday, I'd say that qualifies as a fuss.", "INFO: How is a multi-day music festival that would require travel and overnight lodging not “a big fuss” for your birthday?  I’m not saying it’s unreasonable to want to go, but own the fact that you do want a big fuss for your birthday instead of downplaying what you’re asking for.", "NAH\n\nGo and enjoy yourself. Why would you want someone there who didn't want to be there? Maybe loud music and people drinking/drunks is no longer a fun past-time for her -  probably more like a headache.", "NTA. Me and husband went to a lot of festivals and such back in the day. We both passed 40 by now, and havent been to one for over 10 years, but if he would want to go to a festival for his birthday, id suck it up and join him, because i love him.\nBonuspoints for a festival where we wouldnt have to sleep in a tent!!", "NTA. We sometimes do things that aren't our style for the ones we love. I found it insulting that she said she 'outgrew' this. She doesn't want to go and indirectly calls you immature. That's gotta hurt.", "NTA   \n\nSometimes the best gift you can give someone is the opportunity to do something they really enjoy with others who enjoy it just as much. (Kind of like my husband’s wilderness fishing trips with his college buddies.) \n\nSo she might be giving you the opp to go but with friends instead. Not everyone enjoys multiday festivals: there’s crowds, lines, heat, rain, mud, lots of standing, overpriced food, gross portapotties, etc so she might be willing to give the event a miss this time around. \n\nIf you want to spend the day with her, is there a compromise activity that would work - another (shorter) concert or event? Can she come for a couple of artists and then go?", "NAH\n\nBut I think you can find a middle ground going to Barcelona together and you spend more time in concerts while she shops ir reads. You two will still have time during the day together", "NTA and it’s weird that your wife would bring up the festival and when you say yes, she then says she wouldn’t be going and to celebrate your birthday without her. I don’t know what to make of that. Sorry your wife is being a stick in the mud.", "NTA\n\nYour wife can't suck up not liking an event for your own birthday? Why did she even suggest the idea if she didn't even want to go.", "NAH \n\nI can see how you are disappointed about her not joining since she is the person that you want to go to the festival with, but I can also see how she really probably does feel she’s doing you a favor if she does feel that she’s outgrown it and my hold you back if she’s just not into all of the walking around and crowds, etc. then you might actually feel more bummed or lonely with her there if she doesn’t want to participate in the same way you do. \n\nIt’s not like she’s just flat out saying that she doesn’t want to go because it’s not her cup of tea, which would be pretty rude since it is your birthday, but it sounds like she’s considering you in the process and thinking that she sees herself bringing you down and doesn’t want that to happen.\n\nMaybe try to keep an open discussion about it between now and when it gets closer.", "NTA.  It sounds like this has been something you've been mentioning for years, and only now is your wife saying it's not for her... You don't suddenly grow out of this sort of thing.  It happens gradually.  Kinda feels like she was stringing you along, hoping you'd lose interest as well.", "NTA, 40 is a major birthday. Your wife actually suggested it and now is backing out... I'd be annoyed too, it's kind of a jerk move on her part.", "NTA", "NAH, if she doesn't want to go she's definitely not going to enhance your experience by being there with you. Just go with a friend and enjoy yourself, you can tell her all about it when you get home.", "NTA and I think saying she's \"grown out of it\" is actually a shitty thing to say and trying to undermine what you want to do.", "YTA … I mean, if she can take her own car and leave when she’s had enough that’s one thing. Not many people are into big crowds of drunk people listening to music being blasted that you can’t stand or don’t like. \n\nAt least she’s letting you know now vs going and having an attitude about it.", "Maybe you needed to rephrase it earlier on that you wanted to go *with her*. Sow the seed early so she was mentally a little more prepared for it. Kinda ESH because you shouldn’t expect her to go if she doesn’t want to (why not go with your friend and have a great time), but it sounds like you clarified that this was meant to be a special thing with her for your 40th so I would’ve thought she would at least say she’ll think about it.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI'm 39M and my wife (38) and I have 2 kids. We've been together for nearly 16 years. We went to a good few music festivals together over the years before we had kids, including a couple of visits to Barcelona for Primavera Sound. For those unfamiliar with it, it's a festival held in the city of Barcelona itself - no camping, just hotel/airbnb for the weekend. The previous times we went we always rented an apartment.\n\nI turn 40 next year and I've always said I don't want a big fuss for it. The one thing I've always said though, is that I'd like to go to Primavera. Our kids are old enough now that they can stay with my mother or sister for a weekend - they all love each other big time, they both spoil the kids whenever they stay with them and the kids love going, so that's not an issue.\n\nA couple of years ago one friend mentioned wanting to go to Primavera for his 40th and i loved the idea, so since then it's the only thing I've said I wanted to do.\n\nToday my wife asked me what I want for my birthday next year and I again said no fuss. She mentioned primavera, and I said yes.\n\nShe then tells me that she won't be going, that she's outgrown it and has no interest. I told her I was disappointed, that she's my wife and the only person I'd want to celebrate my 40th with. She repeated her disinterest in the festival and said she'd \"hold me back\".\n\nLater she noticed I was quiet and asked if I was annoyed with her, I said I was because she has basically told me she doesn't want to spend my 40th celebration with me. AITA for expecting her to want to come? It's not as if I drag her along to these things all the time, it's a one off for my 40th.\n\nTl;dr want to go to a festival for my 40th birthday, wife says she doesn't want to come.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "[removed]", "NAH. Both of you are valid in your feelings about this. At least your wife is upfront about not wanting to go...imagine if she said yes, and then made your birthday miserable by making it obvious that she doesn't want to be there. Because it's a milestone birthday, I completely understand why you'd want her there. \n\nThis may be a good compromise...you bring a friend along who wants to go, then you and your wife can do something together either the day before or after to celebrate. I personally celebrate my birthday for the entire week leading up to it, simply because of scheduling conflicts with friends and family who aren't always available to celebrate or want to do the activities planned on the day.", "NTA. Kinda shitty too IMO. Why even bother asking you.", "NAH although I think she could have been clearer in communicating that Primavera did not include her. \n\nYou could compromise on how much time she spends at the event? Go to Barcelona for the weekend, you do one day together or maybe specific activities dispersed through out the weekend that you really \\*really\\* want her there for and during the rest of the time, she can go enjoy what Barcelona has to offer. Meet up in the evening and compare notes! I imagine there's probably a Primavera reddit and you could see if there's any groups or people who have similar interests to you to pal around with when she's not about.", "For my wife's 40th, I'll endure whatever she wants to do.\n\nEven if I don't want to .\n\nYou only turn 40 once. I'd suck it up, to make that day special for my sig other.", "It's not a Coachella kind of thing. It's really laid back.", "Sorry, I should have been clearer on this; by \"a big fuss\" I mean I don't want a big party or event where loads of people are invited etc, I meant I'd rather just do something together.", "I read big fuss as a lot of people, parties, etc.\nA vacation between you and a loved one for the big 40 is not a big fuss.", "Or she just doesn’t have interest in it anymore? You can grow out of something without thinking it’s childish, you’ve just moved past it and no longer think it’s a fun time. NAH", "Weird take. It’s not rude to grow and change your priorities and interests, nor did she remotely act like she was undermining his interests. She doesn’t wanna go. NAH", "Oh come on… he’s an asshole for wanting his wife to spend his birthday with him? You don’t turn 40 but once.\n\nJesus, people do things they don’t like when they care about others. It’s a sacrifice.", "Awful take. \n\nImagine for her 40th, she's got this wish to celebrate her bday and he replies \"Yeah I don't really want to do that. You can do it by yourself\".", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). If we’ve removed a few of your recent comments, your participation will be reviewed and may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "I turned 40 last month myself. I wouldn’t want my husband to suck it up for a few days to make me happy. We love each other, but we don’t always have the same interests. So I would have no issues doing my own thing with some friends on the side and doing something else with him.\n\nTurning 40 is a milestone, but I don’t want to make my husband uncomfortable and for him not to enjoy himself because it’s my birthday. It’s fine if it’s an evening and maybe a day, but for a full weekend just doesn’t sit right with me.", "There are lots of things I'd love to do for my 50th. I know that my husband would not have a good time skydiving or at a horror convention, so I'm not going to drag him to either of those. We'll do something special together that we'll both enjoy, and I'll bring a friend to do a different bucket list item.", "Is it dinner out or the pottery barn grand championship? Lol. There’s a difference", "I agree with you. Sucking it up is for low-effort, short-duration activities. My husband can suck it up for Dune: Part II. I don't expect him to suck it up for a whole sci-fi convention in another city, even if it is my birthday.", "Well skydiving i can understand...that is risking your life lol. But horror convention? I'd suck it up for my wife. I just have to walk around and follow her right? I could probably handle that.", "There's no difference whatsoever. \n\nPersonally, if it's my wife....I suck it up for her 40th. \n\nWhatever she wants to do, I'll fake a smile and try to enjoy myself. The main goal is that she enjoys herself. \n\nYou only turn 40 once. I'd like to be there by my wife's side while she enjoys herself celebrating it. \n\nNo offense....but I'm guessing you're either really young and/or single.", "I had a panic attack & was partially paralysed for ~15 minutes watching one and only horror movie in a cinema in my life.\n\nSo I *completely* understand why someone don't want to go to a horror convention lol. \n\nBut I would absolutely try skydiving and not afraid of heights/planes.", "None taken, 31 and in a relationship. We don’t go to music, festivals, or any of that highfalutin stuff.", "My family calls me the Queen Ween. \n\nI can *not* do horror movies, houses, rides, WHATEVER. I have a biological response that shuts me completely off and then back on into a full blown panic attack. It’s like a fucked up reboot of my system. \n\nI, too, would not be sucking it up to go to a horror convention bc it would end with a tour of the local ER.", "NTA. I don't think you're asking too much and it genuinely seems fun and like something you and your wife would have both enjoyed at one point. Her reaction sucks and I'm sure it makes you feel undervalued and like she doesn't care about you. \n\nTall to her about your feelings and why her rejection made you feel that way. She is fully in her right to refuse but make sure she hears your side of the story too", "NTA.\n\nPart of being a couple is celebrating each other's milestones *in the way they want*. (Within reason, of course.) This really does not seem like too big a request at all.", "NTA for wanting her to be there but AH for not understanding that she does not want to do this.  To be crammed in a venue with 10s of thousands of people, listening to loud music, standing line for ever for food, drink and restrooms is not what everyone thinks is fun.  May be for a few hours but for a long weekend?  Find a friend or two that would enjoy and have a guys weekend.", "NAH but getting close to YTA. \n\nIt’s okay to be disappointed. I would be. But I also wouldn’t want to drag my partner to a huge event that they wouldn’t like just for me. I would want to do something we’d be enjoy. Asking your wife to be miserable isn’t a good birthday gift. She’s supporting you. I think that’s lovely. She just doesn’t want to go to a huge thing that would bring her down and then bring down your birthday. \n\nAlso I would consider a multi-day music festival, or even a music festival in general a “*big fuss*”.", "NTA - I can understand her changing her mind if it’s JUST about the festival, but if my wife had a landmark birthday coming up and had a specific thing she wanted to do, I’d move heaven and earth to do it whether I liked it or not.", "NTA\n\nI'm going with a full hearted NTA. Your wife will not make an effort to give you a good birthday. She won't stir her stumps and make a compromise (e.g. she attends Saturday and sits out Sunday). It's pretty sad and pathetic. You should make an effort for your loved ones, even if it doesn't look like something you'd like. I will assume for the purposes of this answer that you would do this for her if the roles were reversed (i.e. if she wanted to attend a dachshund convention when you loathe small dogs).\n\nI mean this isn't a dealbreaker, clearly part of the reason she doesn't want to go is because she realises that she would be a massive Debbie Downer, sulking around the place if she went. But that doesn't make it any more palatable. This needs more talk, discussion and you being honest about how devalued and deprioritised you feel about her treating your birthday as a time about herself.\n\nETA: I feel like a lot of the commenters don't understand the vibe of this festival. If you are picturing Burning Man, you're wrong. This is such an enjoyable festival, and one where it would be perfectly feasible to attend very little music at all and probably still have a good time", "YTA. Go to your concert. Have fun. She doesn't want to go. It's okay you do something on your own. You're going to be 40. Id be mad really if I had to go to a concert I couldn't stand.", "YTA \n\nDon't make your wife do something she doesn't want to do, even for a milestone birthday. It's not fair on you or her. And don't say you'd do the same for her. It's a bit cruel. You shouldn't have to manipulate her and put her down by measuring how much more love you have for her.", "Gonna go with NAH.  I used to go to A LOT of music festivals when I was younger, absolutely loved it.  But now that I'm getting older the idea of multiple days of music in the hot ass sun just doesn't sound that appealing.  No hate on the activity, just not something I'm interested in anymore.  I imagine that's how she feels now.\n\nI think it sounds like a great 40th and you should go and have fun even if she's not interested.  Sounds like she doesn't care if that's how you want to spend your 40th.  In the end, how important are birthdays really?  You could still do something to celebrate with just you and her before or after.", "NAH. I would never subject someone I love to 3 days of doing something they hated. Just go with friends and celebrate your birthday another way with your wife.", "NAH\n\nYou want to go to a music festival with 250k people. That is very much not “the two of you” 😆\n\nHowever, the music festival scene is not for everyone. Neither one of you are wrong.  You should go and enjoy yourself. And maybe figure out something that really is just the two of you at a later time.", "NAH as others are saying. I’m only in my early 30s and music festivals are no longer my thing 😂. But my partner still loves them.\n\nI just encourage him to have a go with friends and have a good time, which is sounds like is what your wife is doing.\n\nYou need to just make your decision from there. But yes, you would be an AH if you try to guilt her into going.  This isn’t asking her to go out to dinner at some place she doesn’t like or even a concert of some musician she dislikes - you are asking her to spend a whole weekend doing something she has no interest in and that, quite frankly, takes a lot of energy to get through.", "I'd be more concerned she didn't say, \"I am really not up for two days of a festival right now.  But it is your 40th and i want to be with you.  Is their anything else you would be excited to do?\"", "Going away with your wife for two days on your 40th is not a fuss.  Give me a break.", "Nothing about a festival is laid back. Especially as we age. What's the bathroom situation?  Rest areas? Do you have to camp out? How easy is it to get to and from the hotel? Like it sounds like a lot", "A vacation where Person B will not enjoy most of it, and thinks she is too tired for it, does not sound like a fun vacation with very little fuss.\n\nA lot of people get less tolerant of crowds, noise, heat, etc. as they get more middle-aged.", "Yep. His wife doesn't want to do this. He has a friend who does. Maybe she travels with but I wouldn't make her go.", "Well, glad to see that hasn’t happened to me yet (already hit my big 4-0 a few years back). \n\nAnd you know what? If my wife wanted to do something for her big birthday that I did not like, I’d still do it because it’s my wife. I love her and a little bit of discomfort to see her enjoy herself is worth it.\nHe ain’t asking her to do this every year, it’s clearly for a big reason.", "Which movie was it?? I am a huge horror fan, always love to hear the ones that scared people the most.", "YTA. It's okay to be disappointed, but a huge music festival is something that you have to really want to go to. And she's clearly not in the kind of energy state to leave her kids, take time off, trek to somewhere, then deal with loud screaming people along with loud music for however long it is. She's not telling YOU not to go, you just don't have anyone else you want to go with. And ftr, the fest IS a big fuss. It's a huge time and energy obligation. \n\nLook around your friend/family group and see if someone wants to go with you. But don't be salty at your wife who's a mother now who doesn't have the same energy she had 16 years ago to want to go do things you guys did in your mid 20s. This is something fun for you. This is an obligation to her, and she's not willing to invest in it. That doesn't mean she doesn't love you or that you don't matter. It just means you want something she can't oblige.", "I am about same age and don’t go to concerts anymore- let alone festivals. It’s a mix of anxiety, impact of Covid and me getting used to smaller groups vs crowds but mostly it’s me being older and aware of what I do not WANT to do and comfortable saying it. I do NOT see this as your wife not wanting to celebrate your 40th with you. That is very different. She just doesn’t want to do this one specific thing. And it is a specific thing. An immersive experience and the kind of thing that is either amazing or horrible depending if you feel like being there. I have a hard time understanding why you’d want to ring in your 40th with her, doing something you know she doesn’t want to do. Her love for you isn’t going to make a festival enjoyable. It doesn’t work that way. So spend your bday with her doing something special and then go to this festival without her, to celebrate it a different way", "Yta As we age especially after two kids your wife may find she needs the toilet more, that means waiting in long ques to use dirty amenities.  Plus as you age your hearing and ability to listen to music being blasted by huge speakers decreases.  Perhaps your wife will feel miserable having to either go without fluids to midigate the toilet need, but then go thirsty. Fight to get through large cry of smelly people who need to refresh their deodorants as they’ve been bouncing to to the vibe.  Or feel assaulted by the loud speakers.  S\n\nShe obviously doesn’t want to dampen your enjoyment and has let you know gently she has grown out of the music festivals.  Better you take another like minded person and rock out.  Come back home refreshed and energised", "€450 per person, plus transportation and hotel is a lot of money. She may feel like it’s not worth it to spend so much for someone who isn’t interested in it.", "YTA, it would be exhausting for her", "It's not that she doesn't want to not spend your birthday with you, just it's not something she'd enjoy. If you want to spend it with her, do the music fest with friends another time.", "Nta, in relationships you make sacrifices for your partner which is exactly what your wife should do.", "YTA. I would not expect my spouse to be happy if I dragged her to a *multi-day music festival* if she had not desire to go. 40th birthday or any other birthday. This is extremely self centred.\n\nFind someone else to go with, or go by yourself and meet people. Don't drag an unwilling crutch.", "Which age do we turn more than once?", "It’s a classic Reddit move. Miss everything in the post because they zero in on a detail that was easy to understand with context. Rare for anyone here to read charitably.", "Lol love this!", "Exactly even though he mentions it being in an  urban setting  and having indoor accommodations. There is nothing laid back about travelling, it can be stressful, especially if you don’t even want to go. Plus a music festival in your 20’s with few commitments is easy. These two have kids, and jobs. He should go if he wants. But if he really just wants to spend his 40th with his wife, he needs to think simpler.", "I don't really think it's sucking it up though.  Shouldn't you enjoy seeing your SO having a great time?  Shouldn't that excitement rub off on you?  Sometimes you do things you normally wouldn't just because you want to be with the people doing them.  All she said is she was interested in doing it.  Not that it would make her miserable.", "NTA", "NTA - your wife needs to suck it up and help you celebrate your 40th in the manner you choose. \n\nMy husband and I just discussed this and we both feel the same way about it. \n\nPersonally, I’m like your wife in this situation. I wouldn’t enjoy it.  I’d be physically uncomfortable. The bathroom situation make my skin crawl. \n\nBut for my husbands milestone birthday, I’d suck it up, put on a huge smile and enjoy seeing him get to do the ONE thing he asked for his birthday.   And in the end, we would have created a great memory together.", "NTA. I'm an extrovert. I like to travel and have adventures. My husband is an introvert who is always cautious. The eternal boy scout. We have been happily married for over 20 years. There are trips I take with my best friend, my travel buddy. Her and I go hiking, beer tasting, and to concerts, stuff that my husband isn't interested it. However, every year my hubby and I take a trip together for our anniversary. He puts up with my constant conversations with strangers, finding adventurers, and general silliness. He says he enjoys seeing me happy. This is something that you have been looking forward to. If it was my hubby, he might make a few light-hearted jokes about going kicking and screaming, but he would go. He would probably even pretend to look forward to it. But most of all, he'd enjoy seeing me happy.", "NTA sometimes we endure things we don’t 100% enjoy (that don’t bring physical or emotional harm) for the people we love", "NTA I personally do agree with you that she could join you for your birthday. You do these things to show your partner that you care even if it's something you don't always want to do.", "NAH, I’d do why ever my partner wanted to do. That’s part of being in a relationship sacrifices are made. I’m this case she should suck it up and do what makes her husband happy for his bday", "So reading this, you have a birthday trip planned but nobody is going with you? That sucks. I’m sorry. \n\nNTA for being annoyed at all. What’s worse, if it were me, I don’t know that I would want her to go now. I wouldn’t want someone there after they made it clear they didn’t want to be there with you. Maybe that’s me. \n\nInvite someone else if you can. Try to enjoy. \n\nDid she give a reason besides not being into it?", "As a mom of multiple littles, I have to say that going to a music festival is just about the last thing I’d want to do. I loved music festivals in my 20s. With younger kids, though, it’s constant chaos and sensory overstimulation (crying, fighting, happy squealing), it’s messy, and it’s the opposite of peaceful. To go to a highly stimulating environment like a music festival would probably fry the last few neurons I have left. \n\nNAH.", "Yta and you sound like a big baby pouting that she \"basically\" said she doesn't want to spend your birthday with you when that's not at all what she said or meant. She doesn't want to go to a music festival, she'll still celebrate your birthday.", "How white and privileged are you? I mean NAH, but a multi day festival in another country is \"a fuss.\" Sweaty, crowded, dirty, young, loud, obnoxiously drunk, high, horny strangers...from all over the world packed into a tiny place. Sounds awesome/s...\nYour thing isn't your wife's thing. Should she be MISERABLE for days to entertain your mid-life crisis? She is saying...go...spend exorbitant amounts of money on some frivolous party where your back and knees will kill you after 1/2 day on day one. Where someone will probably puke on your shoes and the people next door in your Airbnb are having a great time on mushrooms and an orgy. Go...with her blessings. \nBut, for the love of all things holy just let her have her murder podcast and skincare routine. She sounds awesome. I am sure someone at the gym or pickleball or golf has always wanted to go to this thing...someone just got divorced and needs some excitement. \nYou are a grown ass man. You don't need someone else to go and validate your interests. Go solo. You are going to a place where LITERALLY THOUSANDS of people like the same things as you. \nWhatever you decide this is a lesson. She's not your mom. She doesn't owe you anything. She has autonomy. Get over yourself. And happy birthday.", "I am in my early 40's, my husband is 50. He wanted to attend a weekend music fest this year and I sucked it up and went, it wasn't enjoyable at all. I dreaded every morning and was miserable the whole day. Please do not do this to your spouse. When I was in my late 20's and early 30's a weekend long fest was fun, it isn't anymore. NAH in this situation.", "ESH. Your wife has clearly known that she is over music festivals for awhile and should have told you that years ago rather than hoping to run out your clock and then disappointing you. \n\nYour emphasis on not raising a fuss is about not having the attention on you and still places the burden on your wife, which means that you have outsourced the fuss. A quiet dinner or a casual party at home would be WAY less fuss overall because it would involve way less work for your wife and would make the whole event super casual, but that fuss would still draw attention to you. Primavera diminishes the focus on you but greatly increases the burden on your wife. It’s not really a reasonable request, even for a milestone birthday, which is why your wife should have been upfront about this situation years ago rather than attempting to run out the clock.", "Soft YTA listen I understand that it’s something you like and it’s your birthday, but forcing someone to do something they already expressed they don’t want to do is just going to ruin the day.", "Your wife said she would not enjoy going to this festival, so would it really be that fun to go to it with her? I used to go to jazz concerts with my husband for years, and although I love him and I tried to be open-minded about it, I have rarely felt anything but boredom and a desire for the sound to stop. I can understand why people enjoy jazz, but I just don't.", "You're NTA, but maybe YBA (You Be Alone). Rock on, birthday dude! 🎉🤘", "NAH. I used to go to festivals all the time. I'm 38 and in the past few years, I have realized that I just *can't* any longer. My body doesn't like it. My mind doesn't like it. It is no longer my idea of a good time. If you want to do it, great. But your wife? Why would you want to make your wife miserable for your birthday?", "Nah go with your friend who wants to go and have a nice dinner when you get home.", "Ideally she would go with you, but I also can’t be too harsh on her since I’d rather be shot than go to a music festival.", "He seems to have made it very clear that this is the one and only thing he wants to do for his birthday.  He decided this was what he wanted to do a couple of years ago and nothing else will do.", "A music festival isn't a \"sacrifice\". She doesn't want to go, simple as that. Either go with other people or find an activity that makes both parties happy - that's how a healthy relationship would work it out.", "I cant believe this reasonable comment is getting downvoted", "Yeah, to make your partner happy on a milestone bday.", "Its his birthday they should do what he wants? I don't know how music festivals work but could she go for one day? Again I don't know how they work", "This is correct.\n\nOP is YTA. Lots of people would love to go to Barcelona. Take one of them. Or go alone. Don't drag someone to a music festival that doesn't want to go. I wouldn't go either.\n\nDo something special with your wife before or after the Barcelona trip that you'll both love.", "It wouldn't be very fun for wife but it still isn't a big fuss", "Happy cake day!!", "> Its his birthday they should do what he wants?\n\nWithin reason. Pick something that you know your partner will enjoy, why expect them to be miserable to satisfy your wants? That's selfish.", "A few days of spending most of the day at a crowded event that OP's wife wouldn't be enjoying is probably more than just a little bit of discomfort. Even if his wife eventually agrees to go, OP would always be reminded by the fact that she's not having a good time like he is. That beats the purpose of celebrating and having fun together don't you think?", "Doing something you don't want to do but doing it anyway is definition of \"sucking it up.\". Is it not?   So the wife going to a festival she isn't interested in visiting is sucking it up.  \n\nI happily suck it up for friends and family all the time because I love putting a smile on people's faces and helping them feel loved and supported....  But make no mistake, I'm definitely sucking it up and have no desire to see to this random ass play my grandmother wants to see.\nAnd I have no desire to watch 7 year olds attempt to play sports but I was there for my little brother.", "> Shouldn't you enjoy seeing your SO having a great time? Shouldn't that excitement rub off on you? \n\nClearly the wife doesn't feel this way since she expressed her disinterest. That's all she should have needed to say. Why is that so hard to understand? OP should be mature enough at 40 to accept this and designate a different activity for them.", "Sorry, there's a limit to that. You have to balance wanting your SO to be happy with your own needs. And that goes both ways -- he shouldn't be forcing her into something she doesn't want. A festival is a big commitment that would be draining and exhausting if you didn't want to be there. If he was asking for a day of it, that would be one thing, but a whole festival is not something you can expect someone to do for you/something you can guilt them over not doing.", "I don’t think you are the asshole. \n\nYour wife should be willing to take one for the team every so often. Especially if it isn’t a crazy festival and something she used to do before.\n\nYou are on Reddit so expect most on here to say she’s right. As most on Reddit seem to be very self centred and only think of themselves", "A horror convention is mostly sweaty crowds & art booths. It’s about as horror as shopping at a market.", "NTA.  I can get not wanting to do something, and I can understand that she doesn't want to spend a weekend at a festival. She's not obligated to do anything, but that's sort of what a wife/husband/SO is supposed to do, so it kind of sucks. It doesn't seem like you're being pushy about anything and it sounds like you don't usually make these requests of her. If all of this is true, then I feel like she's not being a good sport about this. I'm closer to 30 than 40, so maybe it's the youth talking, but genuinely if my SO wanted something special within reason for her birthday I'd put in the work to make sure she has an enjoyable birthday. And I'm sure you'd do the same, no?  \n\nCould you negotiate this?  I don't know the costs of the ticket and event and all of that, but is there a possibility you can meet half way? One day or half the time at the festival, and the other amount of time just chilling at a Cafe and enjoying the city and taking it easy. It doesn't have to be a total slog of 3 days, you can just treat it like a regular vacation where you're at a concert for just one of those days. I'm the same way as you, I wouldn't care to go solo or spend it with anyone besides my SO. She's saying she doesn't want to hold you back but if she doesn't go you're probably not gonna go... effectively holding you back. \n\nI don't know, just my 2c. Maybe you can work something out.", "NTA\n\nGo enjoy yourself.", "You’re NTA but I also understand your wife. A music festival doesn’t just sound like a not fun time, it actually sounds like torture. I’m 34 and just thinking pan out makes my back hurt and gives me a headache. Maybe there’s a compromise you can make with maybe a schedule of how long at the festival and maybe leaving time to see things that both of you would like. I don’t really find to drag my husband somewhere that he finds miserable.", "Nah bro. I told my wife I wouldn't go to music.festiavls with her anymore.when I was around that age. It's tiring bro! I took her to Coachella for her first time when we were about 38 and 39. She thought I was a huge jerk but man! Tired!!", "NAH Don’t let anyone make you feel guilty for wanting to go.  If she wants to stay home, she can but that shouldn’t stop you.  I just went through this with my spouse. He chose to stay home so I went alone. I came home to him having a total melt down and in tears because he didn’t think I would really go without him but after 22 years of doing what he wanted I said to hell with it and did what I wanted for once.", "Just go to Barcelona together, and spend time at the festival, take her with you but let her chill/free to leave. But also spend a few days/activities away from the concert, just together.", "NAH. Look I get it. You want to do something cool and fun for your birthday but I absolutely get where your wife is coming from. I’m 43 and I’m fucking tired man, the idea of spending a day in the sun with THOUSANDS of strangers, standing all day, dancing whatever honestly sounds like a nightmare to me. \n\nShe wants you to go and she wants you to have a great time and she knows that if she goes she probably won’t want to wander around as much as you or see the same bands as you. She knows that she’ll be miserable and uncomfortable and that you’ll pick up on it and make yourself smaller on the day to keep her happy. \n\nIt’s ok for her not to want to go. Even if it’s for your birthday. And it’s ok for you to be disappointed, but you have to accept that she doesn’t want to do it and find someone else to go with you. \n\nMy husband LOVES to surf, I HATE the beach. It’s too hot, I can’t get comfortable, i find it exhausting walking in the sand, I hate salt water on my skin, my eyes get over sensitive in the sun, sand gets everywhere. To him a day at the beach is a wonderful, fantastic, relaxing, rejuvenating thing. To me it is *awful*.. but that doesn’t mean I don’t want him to go and have a FANTASTIC day. I’ll schedule him a day off work, and make sure the kids are taken care of, I’ll pack his favourite snacks and wax his board.. but I don’t want to go with him. It doesn’t mean I don’t love him; quite the contrary.. I know that if I go too he’ll have half his mind on me being uncomfortable instead of just having fun.\n\nGo to Barcelona together, go the festival without her and leave her explore on her own.. take some drugs or have some beers and have an awesome day and then meet up  with your wife afterwards for a late dinner to celebrate your birthday followed by some filthy birthday/hotel sex. You’ll look forward to seeing each other all day, you’ll have so much to talk about over dinner.. Everyone’s happy.", "Ayeee ditch her and mingle\nLife is finite; soak up that festival and expand your horizons. Your wife might be there when your 80, enjoy these moments while you got them", "INFO: Say she came with you to Barcelona. What if your wife doesn't want to see as many performances as you do? Say she's tired, overstimulated, doesn't want to go from stage to stage, or just doesn't feel like it for whatever reason. Would you be OK with her leaving earlier, or staying at the hotel (or whatever), or going to do her own activity? Would you feel the need to leave or stay back with her? Her concern about not wanting to \"hold you back\" makes me curious what the dynamic would be.", "NTA. It's your 40th birthday, man! Rock on and enjoy the festival. Just make sure to plan something special for your wife too.", "NTA :( I understand her not having interest but I would probably still do my least favorite thing if my spouse wanted to do it for a milestone bday.", "NTA. If this was what my husband wanted to do for a special birthday, I would be happy to indulge him even if he wanted to go to hear music that I hated or to a hockey game. It's only for a couple of days and it would be a break from the kids. Alone time with just my husband and I and several thousand strangers.", "NTA and your wife should be ashamed of herself! She’s selfish and doesn’t respect your feelings! If this post was about a woman wanting her husband to do something with her for her 40th and if you refused you would be the biggest creep on earth! Sounds like total disrespect", "NTA your wife should want to spend your birthday with you even it isn’t her favorite activity. She’s being selfish", "You're nta for not wanting to bring your wife for an event on your birthday. But, at the same time. If she isn't interested, don't make her suck it up.\n\nMaybe bring some of your friends for the festival?", "NTA. That’s a major milestone birthday and I don’t understand not being able to put up with an uncomfortable weekend for that for the person you love. You’re right to be disappointed and I think your wife should reconsider her priorities.", "NTA\n\nWould just suck it up and do it for my husband if that’s what he wanted for his 40th. My husband loves it when we travel together, part of his joy is sharing it with me.", "Yta for sure. She has a boundary on something she doesn't want to do and you're forcing her into it. Your birthday you can do what you want, and she's not stopping you. But she's not required to make herself uncomfortable for your sake.", "NTA - but op, I’d look closer into her answer, especially if this isn’t typical behavior of hers. “Hold you back” is an odd statement that could have a deeper reflection she doesn’t want to admit. What did she say when you said you were upset?", "NAH. When I think of a music festival like this I think of 20 somethings sleeping in a tent, not showering for days, only using porta potties, and drugs. Is that the case? If so, I can’t say I blame your wife. If not, it might be good to explain to her that it’s different than she may perceive it.", "ESH you want to go for multiple days. She doesn't. Would you be satisfied with one day? Btw, you are just turning 40, not a big deal. I hate crowds, I hate dirty musical festival people....hate it all. I am going to lala for one day to take my kid because she wants to go and I want her to be safe....I am dreading every fucking moment of it, but I will suck it up for one day. Did you offer one day option? If you offered one day for her to attand she said no, then she wbtha, but it sounds like you demanded the entire festival so YTA.", "So... you know she isn't interested, but you still want her to go?", "NAH i understand being disappointed! However, a music festival is a hot, sweaty, loud, all-day affair. It CAN be fun if that’s your jam - I just went to one this spring and did have a blast. That being said, I’m only 25 and I don’t think I want to go back lol it’s just not my thing. Take a best friend with you! Or maybe go for just one day together as a compromise??", "NAH but what about a compromise? I am with you that Primavera sounds like an awesome way to celebrate a 40th, but what if you do the fest one day (with or without her) and then the rest of the trip y’all enjoy Barcelona? There’s so much good food and the city is perfect for celebrating a birthday, this is one fest you can take advantage of the surroundings!", "Never too old to boogie. I've been to undergrounds in Chicago with 60 somethings!!", "NAH.  Potential compromise; wife accompanies OP to Barcelona but doesn’t attend the festival.  She does something interesting to her while OP enjoys the music.", "NTA. That’s too bad, op. I’ll bet she would have fun if she went! It’s nice to relive old times and see them through a more mature lens. Let her know you aren’t expecting it to be the same party atmosphere that a younger crowd enjoys maybe.", "NTA---but neither is your wife. Not everyone likes festivals. She might be tired of loud music, having to stand, she might not even like the type of music played very much. I looked at the 2023 lineup and while I like a lot of the bands, the idea of going to a music festival just sounds tiring. And I used to go to a lot of concerts. It's a lot of walking around in hot weather, probably getting a headache, getting sunburned, being hot, having sore feet, being stuck in the middle of loads of annoying posers...  It's just a lot less appealing in your late 30s and 40s. I might suck it up if it were the one thing my husband wanted to do (although he's more of an SF convention or classic car convention guy) but I can't say I'd be thrilled at the idea. OP, maybe ask your wife why she doesn't want to go. You might be surprised at how little she enjoys festivals these days.", "I ain’t even going to a multi day festival for my own birthday", "I’m not going to say you’re an AH but your idea of “not a big fuss” is interesting because to me. You can’t force her to go to something she has zero interest in. Just because she may have enjoyed it before doesn’t mean anything now. Let’s say she does go, and when she isn’t enjoying herself you’ll be upset with her for ruining your birthday. Then she’ll tell you that she didn’t want to go in the first place etc. etc. I get being upset but this isn’t dinner and a movie, this is a whole weekend festival that she doesn’t want to go to. I turned 40 in January and spent my birthday at home with my husband and kids. I’ll only turn 41 once as well…pick and choose your battles.", "NTA. It's your 40th birthday, she should support your happiness. Just make sure to plan something special for her too!", "My partner and I have VERY different interests yet we always put up with what the other likes on birthdays. To me it just seems like the kind of thing one does for a loved one. For that reason, I’m going with NTA.", "NAH\n\nWhat about a compromise where she comes to the hotel with you at least? That way you can tell her about it and she can get away from the kids for a bit.", "NAH. I feel like I would be a little perturbed myself, but at the same time I can't think of anything I'd want to do less than one of these festivals (except for one of the ones that require camping).", "NTA. Your wife sounds a bit boring tbh.", "This is a dangerous one because you can quickly go from annoyed to \"I'm 40 and I'm not ready to be someone who doesn't go to music festivals with their SO oh hey a 24yr old who makes no demands of me\". Be careful my friend.", "NTA. I have seen Oasis and Cake an embarrassing number of times. I don’t like either of those bands (no offense to fans). I went because it made my then fiancé happy. I’ve seen a ton of beautiful outdoor amphitheaters. Of all the sometimes lame and/on boring things we do for our partners, music is the least offensive to me. In return I got him to go to ComiCon, a handful of book signings and numerous art house movies he was not interested in. Life is a trade off of random compromises. Choose wisely.", "I don't want to make a big fuss, I just want to drag my wife to Barcelona for a days long music festival that she doesn't want to go to.\n\nYATA.", "If she's not so interested in the music festival, couldn't she find something else to do in the city? She could join him for some of the festival and then do something she's more interested in.", "Primavera is a huge festival. Like walk 30-40 mins between stages. Thousands upon thousands of people. The headliners play at 3AM (Spanish time). It’s not a chill, throw a picnic blanket down and relax type festival. It’s a big time commitment type one.", "Yeah I don't entirely get the \"it's unfair to expect her to go to something she won't enjoy\" comments. \n\n\nITS A MILESTONE BIRTHDAY! \n\n\nI do all sorts of shit I don't enjoy for my friends and family for their birthdays because it's not about me and I love them. Big birthdays are the only times you get to do what YOU want and no one is allowed to moan about it. All he wants for his birthday is to go to this event with his wife and she won't do it. She seriously can't suck it up for a weekend?", "Also it’s not like it’s an out of box experience for her since they used to go. Would be nice for old times sake. It’s cute that he wants to do that. I’d be flattered, get a cute outfit and have fun!", "Yup. And he should go anyway with people who actually want to be there for his milestone birthday. Also she’s totally changed the dynamic of their marriage now, so she will have to live with that the next time she expects him to do something with or for her he doesn’t want to do.", "You only turn 32 once as well. Just saying.", "Yes, plus I know people in their forties and fifties who regularly go to Primavera still, it’s hardly like they’ll be the only older people in a sea of 20-somethings.\n\nI don’t see why the wife can’t do something her husband wants for one weekend. He’s not asking her to go bungee jumping or camp in the jungle eating bugs, just to stay in a nice hotel doing things she used to enjoy a few years ago.\n\nNTA", "And saying you have outgrown something that your partner has said he really wants to do is kinda a D move.  It is both insulting and dismissive.  I would feel hurt and rejected and fundamentally unappreciated. \n\nNTA.  \n\nUnless, of course, you historically get naked and run wildly around the music grounds…in which case I am totally changing my vote and siding w the wife.", "Same here. It's a 50-50 partnership. Hope OP keeps that momentum for his wife's birthday celebration.", "You are an absolute sweetheart 💜 Thank you for being a kind and empathetic partner!", "Put this into more context for us though - is it a big fuss in terms of cost and time commitment, in terms of your own situation? i.e. does this trip translate into sacrificing something else important or being squeezed tighter than normal?", "Or an orgy or a movie marathon. Or a nice hike and picnic or paintball.", "Absolutely not.  You are allowed to outgrow hobbies, whether or not your spouse still enjoys them.  You do not have to like something just because your other half does.  \n\nIt is not disrespectful to have those boundaries.  If she had insulted his hobbies or him for doing them, THAT is disrespectful.", "I was once beaten to within an inch of my life over with an expertly packed parachute so I *completely* understand why someone wouldn't want to go skydiving.\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\nlol.", "\"Think only for themselves\" from someone who thinks the wife should be miserable for an entire weekend", "THE COSPLAY!!! \n\nNope, nope, nope, nope. I can not.", "Coraline to this day is the most terrifying movie I’ve seen. I was in this situationship with a guy and when we were actually getting to know each other he wanted to watch Halloween with me. So I went over to his house and watched Halloween and then because we weren’t serious and I have severe issues with sleeping in bed with someone I walked home at 3 am after that. That was terrifying.", "Hostel and Hereditary (it's not that scary, but at the same time it is idk lol)", "Not the one you’re asking but Kujo did it for me. Never again. \n\nFirst and last horror movie I ever watched- and it wasn’t even super horror-y."]}