{"id": 21349, "submission_id": "14qq3y7", "title": "AITA for not giving my stepson money for college", "selftext": "I 31 F been with my boyfriend 34M for almost 8 years. Him and I have two kids 5M & 1F. He has a child from a previous marriage 12M \n\nI recently got an inheritance of 5 hundred thousand dollars. I put a college fund 25k each away for each of our kids 5m & 1F. But I didn’t put aside for my stepson 12M. My boyfriend isn’t upset due to what my stepson has done. My stepson has told lies about, examples: telling his mom I am calling him names and always cursing at him, I always take away his electronics out of his hands, I keep hitting him, throwing stuff at him. My bf and I would have sex in front of him and make him watch. I make him watch my kids so I can go in my room and sleep. (I am a stay at home mom & bf works full time) my step son has even gone as far and told his teacher I touched him inappropriately. The police got involved. I got arrested and interrogated. Well when he said it happened I wasn’t even in town. And his story kept changing. Thankfully charges got dropped and I got let go. I could prove he was lying. \nWell to my rescue I turned over ALL footage we had to our house. 😂 We have cameras every where, the only place we don’t is in the bathroom. So front of the house, back of the house, in each bedroom, hall, family room, kitchen, garage all have cameras. My bf was telling his friend about the college fund because we were struggling for a while. A family member that heard told off my bf. My bf simply said “it wasn’t his money and I can’t make her do any thing with it. I don’t blame her not wanting to” That family member belittled me, called me every name in the book, screamed bloody murder at me. I simply said “if you have the money you can give him it for college because I am not at all. He doesn’t deserve the money after everything he has put me through.” \n\nThat family member told the whole family and now they are split. AITA for not giving my stepson any money for college?", "created_utc": 1688502674, "permalink": "/r/AmItheAsshole/comments/14qq3y7/aita_for_not_giving_my_stepson_money_for_college/", "score": 258, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I 31 F been with my boyfriend 34M for almost 8 years. Him and I have two kids 5M & 1F. He has a child from a previous marriage 12M \n\nI recently got an inheritance of 5 hundred thousand dollars. I put a college fund 25k each away for each of our kids 5m & 1F. But I didn’t put aside for my stepson 12M. My boyfriend isn’t upset due to what my stepson has done. My stepson has told lies about, examples: telling his mom I am calling him names and always cursing at him, I always take away his electronics out of his hands, I keep hitting him, throwing stuff at him. My bf and I would have sex in front of him and make him watch. I make him watch my kids so I can go in my room and sleep. (I am a stay at home mom & bf works full time) my step son has even gone as far and told his teacher I touched him inappropriately. The police got involved. I got arrested and interrogated. Well when he said it happened I wasn’t even in town. And his story kept changing. Thankfully charges got dropped and I got let go. I could prove he was lying. \nWell to my rescue I turned over ALL footage we had to our house. 😂 We have cameras every where, the only place we don’t is in the bathroom. So front of the house, back of the house, in each bedroom, hall, family room, kitchen, garage all have cameras. My bf was telling his friend about the college fund because we were struggling for a while. A family member that heard told off my bf. My bf simply said “it wasn’t his money and I can’t make her do any thing with it. I don’t blame her not wanting to” That family member belittled me, called me every name in the book, screamed bloody murder at me. I simply said “if you have the money you can give him it for college because I am not at all. He doesn’t deserve the money after everything he has put me through.” \n\nThat family member told the whole family and now they are split. AITA for not giving my stepson any money for college?\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA.\nYour not even married to his father and even If you were, his mother is alive and present, so his parents are solely responsible for his college found.\n\n>if you have the money you can give him it for college because I am not at all. He doesn’t deserve the money after everything he has put me through.” \n\nThis says all. They dont realise the gravity of his accusation. You could have lost your children costudy, have a permanent record as child abuse and face jail time.\nIf I were you I'll never want to be in the same room as him. Even if he is young, he did something horrific.\n\nYour boyfriend seems to have your back for now, but Im worried that he'll change his mind under all that pressure.\nTalk to him to be sure of being on the same page.\nBe sure he can't take money from your children found and keep separate finance.\nSuggest he get therapy for his son, because all this hate towards you is dangerous.\n\nINFO: what is the reason for your bf divorce? There was cheating involved?", "NTA\n\nThe family members who think the boy should have a college fund are welcome to take up a collection to fund it themselves.", "NTA. Even putting aside the horrific behavior of the boyfriend’s son it would be ridiculous for you to be expected to give him money when he isn’t even technically your stepson.", "You're NTA. That kid has been actively trying to ruin your life. \n\n>That family member belittled me, called me every name in the book, screamed bloody murder at me. \n\nIs there any chance that family member is your stepson's mother? Or just one of her minions?", "So he was 4 when you guys got together. How did such vitriol come about?  Did his mom poison him against you?  NTA, either way.  It’s unfortunate if it’s his mom’s doing, but you don’t reward someone for trying to destroy your life.", "OP,\n\nyou're an ANGEL, because anyone who is saying you should do anything for your stepson is fucking batshit crazy. I would cut everyone who even mentions him out of my life because they obviously don't care about you. And for the love of GOD, don't fall for,\"Because, Family\" responses.", "NTA and clearly your stepson needs therapy. I do think it’s intrusive that you have cameras in the bedrooms though", "NTA \n\nI would struggle to want to financially support someone that did all that to me aswell. Does your stepsons mum hate you? Is there anyway your partner could get his son into therapy? It sounds like the child needs serious help, those allegations are traumatising to read and terrifying for a 12 year old to be able to invent.", "NTA.", "NTA", "ESH. You should know this kid has some type of serious sexual trauma and is going through puberty and you put him a bedroom with your baby son. For your own convenience, you videotape him 24/7 instead of giving either of them any space. You just got half a million dollars, so there is absolutely no excuse. Why is this sexually-confused child still in a bed next to your five-year-old son? In no way will surveillance change what he does - just where, possibly with your very vulnerable son.\n\nIn two years when you’re writing a post about your stepson molesting your son in the bathroom where there are no cameras, please don’t pretend to be surprised. If you haven’t yet, get him therapy and get him away from your baby rather than just finding the evidence of his wrongdoing after the fact.", "NTA", "Wow I’m happy you can laugh about it now.  I would tell them the only money I would spend on him would be for psychiatric medication to \nCalm his craziness. NTA", "Nta but I reconsider letting him around the kids", "NTA, part of me is wondering why you are hanging around, I would be gone.  I understand you might love your boyfriend but living with accusations, getting arrested, dealing with people thinking there is no smoke without fire, exposing my kids to this toxic environment  living in a house I had to gave cameras, I mean there is no man or woman on earth  thar I know that's worth living thar life for!", "NTA. I am sorry that happened to you. I’d truly never want to be around that kid again. He is evil. Being 12 doesn’t mean it’s not true. i am glad you have support from your partner. I’d never give him anything. He tried to literally destroy your life he needs therapy.", "NTA", "He's 12 years old. A child. He's either being manipulated by his mother or he has issues that need therapy & medication. What is your BF doing to get him help? Let me guess, nothing. I don't care about your money and college funds and right now you shouldn't either.", "NTA. he’s old enough to know better. But you should probably do a better job of attempting to mend the relationship as it seems you haven’t put in effort in quite a while", "Why is this kid in your life at all.\n\nYou should do a restraining order. \n\nYour problem was having kids with a man who has such a snotty kid.", "YTA... you might have a difficult step son... but he is still ONLY 12, AND YOUR STEP-SON.\n\nYou and his dad have basically given up on him and you two are dispicable for it. I feeñ so bad for the boy to have parwnts like you.\n\n\nEDIT... Sorry not married... but still the ass. Being together for 8 years is like common law marrage. You may not be legally married... but still. The boy is also her childrens brother.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI 31 F been with my boyfriend 34M for almost 8 years. Him and I have two kids 5M & 1F. He has a child from a previous marriage 12M \n\nI recently got an inheritance of 5 hundred thousand dollars. I put a college fund 25k each away for each of our kids 5m & 1F. But I didn’t put aside for my stepson 12M. My boyfriend isn’t upset due to what my stepson has done. My stepson has told lies about, examples: telling his mom I am calling him names and always cursing at him, I always take away his electronics out of his hands, I keep hitting him, throwing stuff at him. My bf and I would have sex in front of him and make him watch. I make him watch my kids so I can go in my room and sleep. (I am a stay at home mom & bf works full time) my step son has even gone as far and told his teacher I touched him inappropriately. The police got involved. I got arrested and interrogated. Well when he said it happened I wasn’t even in town. And his story kept changing. Thankfully charges got dropped and I got let go. I could prove he was lying. \nWell to my rescue I turned over ALL footage we had to our house. 😂 We have cameras every where, the only place we don’t is in the bathroom. So front of the house, back of the house, in each bedroom, hall, family room, kitchen, garage all have cameras. My bf was telling his friend about the college fund because we were struggling for a while. A family member that heard told off my bf. My bf simply said “it wasn’t his money and I can’t make her do any thing with it. I don’t blame her not wanting to” That family member belittled me, called me every name in the book, screamed bloody murder at me. I simply said “if you have the money you can give him it for college because I am not at all. He doesn’t deserve the money after everything he has put me through.” \n\nThat family member told the whole family and now they are split. AITA for not giving my stepson any money for college?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA  all the way", "Nta", "NTA you don’t owe him anything no a penny", "Of course the kid is a demon, why wouldn’t he be? What is the point of this post?", "NTA but your boyfriend is for talking about it to anyone. It’s private family business. \n\nAs for your stepson and his family who are mad at you they seem like gold diggers. They smell money and want to pressure you to give it away. They might not even know a 529 account would never be in their control.", "NTA ..period. No one has a say in this one. And girrlll.....what that kid did to you....I would have walked away.", "That kid should not be allowed in your home or around your children. \n\nAny 12-year old saying these things is a threat to you and your children. You could lose your kids. He could harm your kids. \n\nThat kid needs to be in therapy now. \n\nNTA", "My bf his wife cheated on him and got pregnant by another man. \n\nMy bf doesn’t have access to funds. If I die some one else is the holder of them.", "His mom took him and went in hiding and durning that time. SS WAS physically and mentally abused and saw his mom get her beat so bad she couldn’t talk.", "There was some issues that involved stepson and my son who share a room. So we put it up and we found out what has been happening", "I think if hubby is forcing a relationship then it might be time for OP cut her losses or it will be worst next time", "How much money you to bet his mom was in the one in his ear but NC is warranted either way", "I mean she's talked about how he was mental and physically abused plus he witnessed his mom boyfriends beating her.I definitely think he needs lots of therapy.", "I have tried with him. But he doesn’t want it. Every time I try he said I does something to him.", "There’s a difference between difficult and making false allegations that could put OP in prison for a long time, completely ruin their life and loose custody of their children.", "Did you read this?  They aren't married.  He is not her stepson.  He is her boyfriend's son.  She has not legal or moral obligation to him.", "The boy isn’t the step-son legally, as the OP and her baby-daddy are not married.    \nYou obviously do not realize the gravity of the accusations this young person has made.  The child is broken, and will likely only cause more trauma to the family.", "I've read in one of your comment that your stepson was a victim of abuse....but I can't understand why he is taking it out on you.\nHe wants you and his half siblings to leave and his parents to go back together?\n\nHonestly this is really a thought situation and the college fund is the least of the problems.\nThat boy needs lots of therapy and your bf to talk to his ex or go to court to revisit the costudy of their son.\n\nI dont know if you rent or live in a house owned by you and you bf, but if you still have a good amount of your inheritance left, I'll think about take your children and find another place to live.\nI know this suggestion is not fair because you are the victim, but if nothing is done about your stepson behavior and he still come to your house, you need to think about your and your child's safety.\nI hope his behavior wont escalate in violance towards you or your kids.", "Wow he's definitely been through a lot, i'm not a psychologist but i'm pretty confident that his behaviour towards you is derived from the trauma suffered in the past (mostly because the accusation towards you are very specific and creepy), did his parents ever put him in therapy? If not do it a soon as possible for his sake because in the future the situation could even worsen (maybe with terapy his behaviour towards you can change and you will be able to built a good relationship with him). Btw NTA your money your choice, what he did to you is so serious that any justification or excuse is not enough to be forgiven, at least not immediately and not before having recieved a sincere apology, he doesn't have to like you or consider you as family but at least he must be polite and respectful", "Beat by whom?", "This falls in line with the commented theory that he has suffered sexual abuse himself and needs therapy.", "Put him in therapy lol", "12 is 12...too young to give up on the boy.", "Common law marrage.. I would disageee on the moral part. He is also still her childrens brother.\n\nNo parent has a legal obligation to help thier children goto college...moot point.", "This, I'm just waiting for OP next post in few years.", "Hello!!!! These parents are ridiculous if they think anything EXCEPT that he’s suffered sexual trauma of some kind and that he doesn’t mind hurting people to get his way due to that trauma. For what reason is he living with a five year old boy after all of this!?!?!?", "That’s exactly what I was thinking. I wouldn’t be surprised if he was worried about his parents really splitting and was trying to fix it. Feel bad for everyone here. But OP is not the asshole.", "Beat by his moms boyfriend’s", "i don't know their family dinamics but as OP said he was abused by many of his mother's boyfriends so i suggest that his mother's place is not the safest place in the world for him so that's why he probably lives with them. Obviously his beahviour is really scary and i agree with OP putting cameras in the house to try to prevent any possible bad thing but i think that the most important thing to do t is to put the boy in therapy asap, for his and theirs sake", "Yes more then one", "So that kid’s been through some shit. Sorry he’s taking it out on you.", "He is seeing some one but he isn’t talking so they aren’t getting any where. But we are tying our best to get him help for what he did. We have not given on stepson but we are cautious when he is here.", "Does anyone remember the story of the guy who gf's 13yo daughter did the same thing and now he has PTSD and doesn't trust anyone with kids. That the future I see for OP if she let this continue.\n\n[My girlfriend's daughter falsely accused me of rape](https://www.reddit.com/r/BestofRedditorUpdates/comments/t802ua/my_girlfriends_daughter_falsely_accused_me_of/)", "NTA. Stepson needs to be shipped back to his mom's house. He obviously has mental issues, along with his hating you so much that he'd lie to get you arrested. I'm honestly worried that he would physically attack you. Because it seems to only be a matter of time before he gets violent.", " NTA.  If a college fund is so important to those family members,  why haven't they been contributing to one for the last 12 years. Ask them that\n\nSeriously.  ASK THEM", "NTA. The parents should've grounded him for like 6 months for making false SA accusations. That's messed up.", "NTA, from this story, it sounds like your cash would be more responsibly spent on getting your stepson professional mental health treatment rather than a college fund.\n\nYou can't hold the kid responsible long-term for the stuff he does aged 12. The great thing about kids is that they're mentally flexible and can get better. But hot damn, he sounds like he needs serious help.\n\nIf you see a future with this man, park the college fund conversation and fix the juvenile delinquent living in your house.", "NTA - sounds like this kid needs some serious psychological help, but his actions notwithstanding he’s not your son and it’s your inheritance, it’s your call.", "So NTA! His mom and mom's side of the family can start a college fund for their little dear one 🤮\n\nNTA and I hope you don't have to have that child in your home anymore..... Cuz of you do, and it was me, I'd get a security guard for my own protection!", "NTA\n\ntell them that his college fund got spent on legal fees to CLEAR your name.", "NTA.  First and foremost, he is not your child, and not your responsibility.  Second, I wouldn't let that child into my house again if he got me arrested.  His father can see him outside the home.  \n\nQuit telling people about your inheritance/financial situation.  It's none of their business and you open yourself up to the kind of b.s. you're facing now.  The \"whole family\" can pitch in and start a criminal defense fund for this child.  Let's be honest - a kid who behaves like this is never going to go to college.  He'll be lucky to make it out of high school without a criminal record.", "Considering this kid is only 12 he’s screaming for help. He desperately needs therapy and your husband MUST put him therapy.\n\nAs for you, I don’t know why you had two kids with a man who cannot even help his own kid and can’t protect his partner but NTA I guess. I Hope the kid changes for the better and find some scholarships and go to college debt free though. Because he’s only 12…", "NTA, fuck that kid. He's old enough to know what he did", "Yup stepson would totally make some more lies up.\n\nOp needs to make sure he never step foot in her house.", "Of course he needs to be in therapy its crazy if it isn't already considering she said he was physically and mentally abused and watched his moms boyfriends beat her almost to death.", "A kid who was physically/sexually abused is “snotty?” You don’t sound like a total mutant at all.", "Twenty-five thousand doesn't seem like enough for a college fund.", "The kid sounds like a nightmare but he also sounds like he has lots of trauma with him being physically and mentally abused plus watching his mom get beat by her boyfriends.He needs loads and loads of therapy.", "Why are you talking as if the kids are just hers ? Also why would you ever think it’s acceptable to take a fathers kid from him? You are risking kidnapping charges.\n\n Why would it escalate to violence? Who in this situation would get violent? Why would her kids have violence directed at them when it’s the OP that the kid seems to have issues with. \n\nI completely empathize with her it sounds like that kid is putting her through hell.  But I don’t find comments like yours to be acceptable. You ironically are displaying the same behavior as the kid except you are a adult. There is no reason to assume there will be violence. Nothing OP said would lead any reasonable person to conclude that there will be violence.\n\nA lot of what you said was good advice but these few parts sound crazy.", "That much invested over 15-18 years will be a pretty good nest egg.", "yes but why put yourself and 5yo son at risk.", "Will he still be too young if he hurts the 5yo, people are still are trying to villainize OP but when shit goes sideways and it most likely will, they will be the first to condemn OP.", "12 is old enough to know that he was lying. \n\nHe could have ruined OPs life, cost her access to her own children, her job and her reputation. Sexual abuse allegations DO NOT GO AWAY. Once it’s out in the ether, it’s out. \n\nI would have left the boyfriend over this simply to protect myself and my family. She definitely does not owe him 25K.", "Why the hell does not your bf have full custody?!", "excuses excuses....if i were the dad id look for full custody.", "they are both responsible for not paenting this kud for it to get to that point. He was 4 years old when she started dating the guy.  They both didnt give a shot about him for a very long time, thats what makes thwm AHs,... not witholding monwy for college, thats just more proof at how awefull they are.\n\nKids lash out...sure its super serious... but he is not the first or last to make accusations like that. Did he know he was lying...OF COURSE..you dont throw away a kid because of it.", "It’s not her kid. There is nothing awful about the OP withholding money. “Lashing out” is screaming “I hate you” and slamming doors NOT falsely accusing someone of sexual assault.", "at a certain point it is a stepmom, no matter how much she denies it... 8 years is long enough to be considered his wife... comonlaw...ring or not.  She entered that relationship knowing he had a 4 yr old.\n\nLashing out is lashing out...\"i wish you were dead\"... kids come up with really hatefull vile things to say to huet thier parents. Him accussingand lying of sexual assult speaks  volumns about the parents and less of this kid.", "You’re delusional if you think “I wish you were dead” is anywhere on the same level. This woman is a victim and the kids mother and father have failed him.", "your delusional if you think its not...the woman is in a shitty situation, but its one she is responsible for...way too many details are missing to say if she is a victim or not.", "“I wish you were dead.” A statement without any real would consequences beyond a damaged bond and hurt feelings . \n\n“My dad’s girlfriend is touching me inappropriately.” A statement that could send an innocent woman to jail, have her kids taken away and cost her family, friends and a career. Not to mention the amount of money that a lawyer would cost, plus the trauma of being ARRESTED. There are whole stories of false accusations ruining lives. \n\nThis woman is a victim of false accusations. Hard stop.", "NTA. You don't owe anyone anything. It is YOUR money. I am not even going to comment on people not related to you wanting you to give money to a kid that lied to the cops about you and got you arrested.  NTA at all. I  hope things get better.", "NTA. You're not obligated to help a person who hurt you. Especially not when that harm reached the point of you being arrested. \n\nIf your BF wants your stepson to go to college, then he can pay for it. Same for the in-law who screamed at you.", "NTA.  Therapy is better than helping him with college at this point.  Keep trying to get him help. Its the only thing you can do at this point.", "NTA, even if your step son didn't nothing to you, he is not you kid and not your responsibility. Amazing how some people are so entitled to other peoples money.", "Tell the family member to give the kid money! Or mind his own business", " At first I was like “ehhh…” until I got to like the 6th sentence? wtf kind of demon child? you absolutely don’t owe him anything, even if he wasn’t a gremlin it would be a gray area but considering what he’s put you through he’s lucky he’s allowed in the house. you’re bf is on your side, who cares about his dumb family.", "NTA\nHoly shit! That kid needs to get some sort of therapy!", "NTA.", "NTA\n\nBut I think you and your children need to live separately until SS is out of the house.", "There was also the one mum and stepdaughter", "Yes the stepsons mom hates me. Why? I’m Because I am with my bf. Her ex husband. Mind you she cheated on him which is why they got a divorce. Ss is In Therapy but he isn’t talking.", "Oh, yeah I had forgotten about that one", "To answer your question of why the stepson would take his anger out on OP, it may be because he subconsciously knows she (as his stepmom) is a “safe space,” meaning he can lash out at her and she will not retaliate in kind.", "> I can't understand why he is taking it out on you\n\nMisguided anger.  It’s a lot easier for a kid to blame a stepparent than their actual parents.  If the “replaced” parent is a train wreck, it can get really bad.", ">There was some issues that involved stepson and my son who share a room. So we put it up (cameras) and we found out what has been happening\n  \nThis is one of OP comments. If they had to put cameras around the house, something concerning must have happend or maybe I'm wrong, but OP didnt talk about the issues.\nMaybe I'm crazy to think so drastically, but how can you be so sure in the future he wont shift his anger towards his half siblings?\nAnd I used the word \"I hope\" and not \"I'm sure\" in regard of possibile violance....\n\nI dont know why my comment can be compared to what his stepson did to her. \nSaying that she need to think about her and her children safety is so bad? Or that that boy need therapy and his father need to step up and help him?\n\n>Why are you talking as if the kids are just hers ? Also why would you ever think it’s acceptable to take a fathers kid from him? You are risking kidnapping charges.\n\nAbout this you are partially right.\nThe way I phrased it was really bad and when I wrote it I was thinking only at her side of the problem (and I'm in the wrong for this), but have I ever spoken of kidnapping or to prevent his father to see his children?\n\nLike I've written, for me its that If the bf and his ex dont help his son and he continues to make her life hell, leaving can be a solution. \n\nBut in the end the OP seems to be a tough one and also smart, so I dont think that will ever happen.\n\nAnd you are free to think I'm a bad person for my opinion about the situation, but everyone has their own thought about OP's problem and I'm not here saying I'm right or wrong.\nSo, sorry for the long rant 😅", "Because ss mom made her own claims again my bf. 🤦🏼‍♀️", "It does seem like the mother could be behind what the stepson accused op of there was on a while back where a daughter did it her mums boyfriend and turns it out her dad told her to do it", "What could be worst than this so that the court didn’t give you full custody? What is your custody arrangements? This kid obviously needs protection and help. \n\nAlso I just saw that he doesn’t talked to the person he sees. I was wondering have you ever tried play therapy? That can do wonders.", "NTA.  Even though your stepson is a child, he actually LIED TO THE POLICE and accused you of sexual abuse.  \n\nThat's a deal stopper.  That kid shouldn't get one red cent from you.", "NTA and I'd never ever let him in my house again.\n\nHe doesn't deserve your money, and you don't deserve family that doesn't have your back.", "Nta, is he allowed in the house now.  He shouldn't be", "Does your stepson have to visit you? I think he just wants to make sure to stay at his mom full time. I am kind of sorry for you and also your stepson, cause he is going far for it. As I assume.\n\nNTA BTW.", ">That family member belittled me, called me every name in the book, screamed bloody murder at me. I simply said “if you have the money you can give him it for college because I am not at all. He doesn’t deserve the money after everything he has put me through.”\n\nNTA - You had a wonderful come back for the family member. Of course the answer was they wouldn't fund him either. I agree the SS has burnt a lot of bridges with you and I'd have a hard time doing anything for him. But I would suggest to his father that he get some counseling for his anger. \n\nI don't know what I'd do, but I wouldn't want to live in the same house as the stepson. Getting arrested and interrogated by the police is pretty much a deal breaker for me.", "Could you use some of the money for more expensive avenues of therapy that might not normally be possible? Something like art therapy, for example. Things that might help him open up about what may have happened.", "I wouldn’t spend a penny on that garbage. It’s the parents responsability.", "At a state school, if they are lucky enough to live in commuting distance and at home, it's about two-ish years of schooling right now. But beyond that, OP's kids are 1 and 5 - it has time to grow.", "You do realize only a few US states still recognize common law marriage, right?", "You do realize that laws have nothing to do with morality right? Just because it is legal or illegal does not mean it right or wrong.\n\nThe world as a whole recognizes common law marrage,. The relationship is 8years with 2 kids. You telling me there is a completely different moral standard if they were married? what if they got married by a churge and not legally? different standard of morals?\n\nEdit: In case anyone is interested..11 state recognize common law marriges.", "He tried, but the ex lied to the courts.", "Either way, she has no obligation to a child who tried to put her in jail", "You're money your choice. \nCould you help out them if they needed it sure but not mandatory but after them doing all that absolutely not.", "Does the family member and extended family know what your stepson has done to you? he could’ve landed you in jail and ruined your chance of future work. Do they not realise how that itself is a reason not to cover his education? Also is he getting help? he sounds dangerous and is never trust this kid considering the extremes he’s gone to get you out of his life. I hope your partner is getting him help!", "I wouldn't give him any money and I would never be alone with him at all. You don't want him making another accusation against you. Tell any person that comes at you that they should give him the money since they are so concerned. That money is for your future and retirement. If they curse at you curse right back. Yeah I can curse also, no reason to take any abuse from anyone.", "NTA, but that poor child.", "NTA! They’re insane to think you would give him anything after what he did. Also he’s your stepson, he has his own parents who should do this for him. He’s not family, family doesn’t make vile false accusations at each other. I’m sorry you had to go through this", "NTA\n\n If i were you i wouldn't even let him set foot in my house, never mind take something from my kids and give it to him. Hell no.", "NTA.  He fraudulently caused you to be arrested.  No money for him.", "NTA", "NTA after the malicious things he did to  you, he does not deserve it. You’re under no obligation to give him your money.  Don’t even THINK about it.", "> What could be worst than this so that the court didn’t give you full custody?\n\nThe court system favoring the mother despite Soviet style red flags? Well I'd be shocked! Shocked I tell ya! /s."]}