{"id": 21361, "submission_id": "14qsfpz", "title": "AITA Boyfriend abandoned me over a party.", "selftext": "A month ago I just found out I was pregnant by my boyfriend again. We each have a kid and one together. My boyfriends had a party that I knew in advance about that his family was throwing. It was basically a two day party. I was bringing my two kids to the party. We got there around 9. My boyfriend did not arrive until 12am. By that point I took the kids home. The party had over 200 of his relatives and I only knew one person. The baby fell asleep and my 9 yr old was sleepy before he came so we left around 1130 1145. He texted me all night( we don't live together). After the kids and I went to sleep. The next day he was mad and said his family did not get to meet the kids. We had a party for his christening and met some of his family then. The party was for a different family event. \n      Anyways he called and was yelling about I should have called him. He could have had someone take us around until he got there blah blah. This is not the first event he has had me show up to alone. I met his parents by myself after he said he was coming and then never showed up. So I was expecting he was pulling the same bull when I had the kids. He hung up and refused to talk to me or tell me the location of the other party.\n     Fast forward to this weekend I start to miscarry. He is currently out of town partying. I had to tell him over text what was happening because he still refused to answer the phone. He said well it can't be mines so I'll talk to you when I ready to deal with this. And that's all I want to say to you. \n     I feeling this relationship is over. This situation is ridiculous and hurtful. Am I the asshole for leaving the party with a small baby and child because I thought he was going to do his usual and not show. Also I've been seeing his Facebook posts of partying.", "created_utc": 1688508351, "permalink": "/r/AmItheAsshole/comments/14qsfpz/aita_boyfriend_abandoned_me_over_a_party/", "score": 22, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Aita for leaving a party early even though it was a family function\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA.  He is not your boyfriend.  At best, he is a FWB.  You don't live together yet you have a kid with this guy.  He is completely unreliable, irresponsible, and childish.  Clearly he does not care about you or the children.  If someone else wrote this, what would you tell them?\n\nMove on with your life, good luck getting child support out of him.", "NTA\n\nI have just three words:\n\nLeave. That. Man", "You are YTA to yourself for being in a relationship with a man like this but NTA for needing support. You need to consider why are you even asking why you would be YTA instead exiting this relationship double fast.", "NTA. OP, this guy is an irresponsible, neglectful and total loser. I am sorry that you underwent a miscarriage, but I don't think it's worth bringing in another child in the world with this guy as a father. OP, if you think that this relationship is over, trust you instincts and gut, because you're probably right. You have a lot to think about, and you need to take care of your kids.", "NTA\nAnd also, DUMP HIM.", "Stop having kids.", "NTA but your the AH to yourself for having kids with a man who clearly isn’t ready to be a father. You guys aren’t even living together and he’s going out partying while your at home dealing with everything alone. Do yourself a favor and leave him.", "Y T A kinda to yourself and your existing/future kids. Why are you having another child with this person? You already have one together, don't live together, have each their own and on top of that he is absoutely irresponsible and unreliable, yet you somehow managed to get pregnant again by him ? \n\nI just don't get it sorry, you made your own choices, but you also made the choice for your kids to have an unreliable father who will probably disapoint them many times when he simply does not show up.  I mean you said it yourself that he's always done that and you even met his parents alone", "NTA You deserve a better partner than him!", "NTA. Look in the mirror and say, \"I deserve better,\" and dump him and go get the better you deserve.", "\n\nNo, you are not the asshole. It is clear that your boyfriend was irresponsible and did not take your situation into consideration when he failed to show up on time to the party. His treatment of you is unacceptable, and you have every right to leave the party and to feel hurt. It is his responsibility to ensure that you are taken care of and it is definitely not your fault for leaving the party. You deserve better.", "NTA if a girl I got pregnant in a relationship or not. Was having a miscarriage. I would drop everything and run to be by her side. Dam get a better man.", "Wow. How horrible of him to say that to you. Are you okay?", "ETA - there are specific examples here of you both being awful parents.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nA month ago I just found out I was pregnant by my boyfriend again. We each have a kid and one together. My boyfriends had a party that I knew in advance about that his family was throwing. It was basically a two day party. I was bringing my two kids to the party. We got there around 9. My boyfriend did not arrive until 12am. By that point I took the kids home. The party had over 200 of his relatives and I only knew one person. The baby fell asleep and my 9 yr old was sleepy before he came so we left around 1130 1145. He texted me all night( we don't live together). After the kids and I went to sleep. The next day he was mad and said his family did not get to meet the kids. We had a party for his christening and met some of his family then. The party was for a different family event. \n      Anyways he called and was yelling about I should have called him. He could have had someone take us around until he got there blah blah. This is not the first event he has had me show up to alone. I met his parents by myself after he said he was coming and then never showed up. So I was expecting he was pulling the same bull when I had the kids. He hung up and refused to talk to me or tell me the location of the other party.\n     Fast forward to this weekend I start to miscarry. He is currently out of town partying. I had to tell him over text what was happening because he still refused to answer the phone. He said well it can't be mines so I'll talk to you when I ready to deal with this. And that's all I want to say to you. \n     I feeling this relationship is over. This situation is ridiculous and hurtful. Am I the asshole for leaving the party with a small baby and child because I thought he was going to do his usual and not show. Also I've been seeing his Facebook posts of partying.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "A relationship is something both parties have to work hard on.\n\nDump this piece of \\*\\*\\*\\*, a partner not being there for a miscarriage is really horrible.", "NTA.  He sounds like a winner.  Nothing here tells me he is a caring partner or father.  Why do you want him in your life.  Sorry about your baby.  I say move on as he is clearly an AH.", "Run you deserve better dude has his priorities wrong if party is more important than his young family not to mention your miscarriage which i am sorry u had to deal with alone just be done with him", "NTA I think your relationship is already over. I am sorry for your loss, and sadder that you don't have a partner there for you. I hope your family is caring for you.", "Take a very long break from dating please. You almost brought another baby into this toxic abusive mess. Please focus on your kids and.not getting some dude. Do you have family? You need to file to child support and get a visitation schedule worked out but tbh he sounds like a deadbeat so idk how much he'll see the kids. He's def banging a bunch of other chicks tho. Why you have allowed you and your kids to be treated like a joke is beyond me. Seek out some emotional support to help. Seek out professional help to see why youve allowed you and your children to be abused like this.", "The term man doesn’t apply here IMO.\n\nNTA", "They don’t even live together!"]}