{"id": 21368, "submission_id": "14qwo7z", "title": "AITA for having an outburst at my girlfriend's little sister and banning her from staying with us?", "selftext": "This situation sucks, and I need a third-party perspective. \n\nI've lived with my gf \"Sarah\" for 2 years now. Sarah has a 16-year-old sister \"Tara.\" Tara lives with their parents, but Sarah and Tara have a very rocky relationship with their parents. Nothing too bad, but it's toxic nonetheless. \n\nFor the last 6 months or so, Tara has begun staying over at the apartment that me and Sarah share. I've always been somewhat uncomfortable with this, mainly because it's common for Sarah, who works from home, to let Tara skip school and come spend the day with her. She says it's better than her being on the streets but I digress. My biggest problem is that Tara trashes the place and has no respect for me. Tara does not like me. I don't know why, Sarah does not know why. She is incredibly disrespectful to me and my things, eats my food despite being told not to on a nearly weakly basis, and \"borrows\" this from the apartment with no intent to ever return them. \n\nI've been at my wits end over this for the last month and I feel like Tara is testing my limits more and more. I've talked to both of them and let them know if something doesn't change soon I will lose my cool. But every conversation ends with Sarah committing to things that never happen and Tara being noncommittal or just disinterested in my feelings.\n\nIt came to a head Friday. Sarah had gotten off work early and left Tara alone. I came home to the place absolutely trashed. This I could handle, what I could not be that Tara had pulled out some of my vinyl to listen to, scratched them to shit and just left them out on the table and ground when she got bored. When I confronted her and asked her what happened she just shrugged her shoulders and said nothing. \n\nI absolutely lost it. I told her exactly what I thought of her. How she was selfish, ungrateful, lazy, and downright unpleasant. I made the comment that if this is how she is at home, I now know why her parents don't want her in their house. I could tell she was taken off guard by my yelling, and the parent's comment caused her to start crying. I kicked her out and told her not to come back. \n\nSarah lost it and we fought. We've been pretty cold since then. She's talking about moving out, but at this point, I'm starting to consider that myself. Last night, however, Sarah finally decided to tell me that Tara tried to run away last year, and she made a deal with her that our apartment could be her safe space whenever she needed it so she didn't run away again. I still don't feel like this makes what she did right, but at the same time knowing this, I'm starting to feel bad.", "created_utc": 1688520476, "permalink": "/r/AmItheAsshole/comments/14qwo7z/aita_for_having_an_outburst_at_my_girlfriends/", "score": 71, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Screaming at Tara and banning her from the apartment. \nI feel like I'm the asshole now that i know more context around what has been happening with Tara and her parents. And how Sarah promised her our apartment as a safe space.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nYour GF didn't tell you that she was declaring your home a \"safe space\" and did nothing to encourage tara to behave like a guest rather than a squatter.\n\nTara needs more than just a \"safe space\".\n\n\"safe space\" doesn't mean \"you can trash the place\".", "You are NTA. Sarah promised her sister your apartment as a safe space without asking you, and Tara’s consistent toxicity makes your home an unsafe space for you. Your home has to be a safe space for you and Sarah, first and foremost. Let Sarah move out and take Tara in. Let this relationship go. Sarah makes promises to you she can’t keep, Tara treats you like crap, let it go. You were forced into the role of a surrogate parent to a troubled teenager you can’t set boundaries with. You won’t win this. It’ll never end. Sarah is more committed to her sister than to you. It’s understandable: the kid has no place to go and no one else. But unless you want to be involved in this mess, you need to get out of it. Best of luck to you.", "NTA. Sarah may think she's being a safe space for her sister, but she isn't. She's enabling Tara to skip school, enabling her to be disrespectful to you and your property, enabling her to bail on even the smallest of responsibilities like picking up after herself. In short, Sarah is actively harming her sister by watching her decline and doing nothing to help.", ">Sarah finally decided to tell me that Tara tried to run away last year, and she made a deal with her that our apartment could be her safe space whenever she needed it so she didn't run away again\n\nNTA If your girlfriend wanted to offer your shared apartment to her sister the a \"safe space\" the bare minimum she should have done is discuss it with you and address the minimum requirements for this arrangement. It's sounds like she gave her sister carte blanche and the run of the place without your input or consent.\n\nIt seems this issue has lead to an impasse in your realtionship. Use it as a moment of inflection and evaluate the viability of your realtionship.", "NTA. And Tara isn’t the only one who is. Neither of these gals have any respect for you. Keeping secrets, wrecking your stuff no remorse, no regard… If she wanted to make your home a safe space for Tara, you deserved to be part of that conversation and decision. \n\nWalk away now. It won’t get better. Sarah insists on enabling Tara’s immature, entitled behaviors and sees no need to change. They aren’t worth your headache or heartache.", "NTA. Sarah's inaction over Tara not treating you, your belongings, or your home with respect is a huge problem. She is clearly disregarding and probably excusing Tara's poor house guest behavior, which is not going to help or prepare Tara to be out on her own eventually. Sarah is not treating you as an equal in the home, and if that continues then honestly there's no sense in living together.  Ground rules need to be set and **enforced** if  Tara wants to stay with you, and Sarah needs to commit to that fully.", "NTA \n\nOP - there are two real problems here, neither of which is Tara. \n\nFirst, Sarah offered your shared apartment as a bolt hole without discussing it with you. Even if the discussion was \"I told her she could escape here, make yourself OK with it,\" it still needed to be communicated. \n\nOnce the problems started, she needed to be on board with boundaries. That needed to include consequences, and those needed to be agreed upon beforehand and enforced. \n\nYou and Sarah need to learn to communicate better if you want to stay together. \n\nAlso, Tara needs someone to enforce boundaries, and sometimes losing your temper is a good wake up call. \n\nIf you want to stay with Sarah, after you get on the same page, I recommend sitting down privately with Tara - or with Sarah, but she doesn't get involved - and talk to her about acceptable behavior in your home. It sounds like Sarah and their parents are treating her like a little kid, and someone needs to talk with her more similarly to an adult. Let her help formulate consequences, and even negotiate boundaries within reason - within your idea of what's reasonable. \n\nBasically, tell her you're going to ask her for what you'd ask from an adult. If she wants to be a little kid, she has her parents' house.", "Girlfriend is TAH. She cannot decide safe space without talking to her SO.", "**NTA** \\- You are being taken advantage of.  You are probably better off without Sarah.  Children will recreate their family or origin with all its toxicity.", "NTA. Sarah and Tara are both being manipulative. Sarah should have told you she offered your apartment to her toxic sister. Sarah is doing her no favors by letting her skip school. You would be better off without both of them. Tell Sarah that she is right she should leave. This will let you know what is underneath the manipulation.", "NTA, it's unfortunate that she has an unstable environment at home but she is old enough to know better.\n\nMy concern is more with Sarah. I understand looking out for your sibling and I respect the sentiment of providing that \"safe space\" for Tara rather than running away. However, it appears she never brought that up to you even after the fact.\n\nShe could have at least mentioned that to you since it is both of your guy's apartment. Just my opinion though.", "NTA. Tara's behavior is absolutely unacceptable and I'm surprised (and concerned) that you went this long without making a bigger deal about it. If your girlfriend does not see how this is a huge issue and sides with her sister, I would seriously contemplate this relationship. Just because she ran away and is having a hard time does not give her a free pass to destroy your belongings and treat you horribly. \n\nYou do not have to do this by any means and it sounds like you've already tried something like this numerous times, but if you want to try and make this relationship work, I would suggest sitting down with your girlfriend and saying how you feel. Say that you cannot put up with her sister treating you the way she has, and you want to have a good relationship with her sister (if you still do at this point, I wouldn't balme you if you don't want that anymore). But Tara needs to meet you halfway. There needs to be a group discussion where you all sit down and talk about boundaries and lay some ground rules. Your apartment can be a safe space for her to come to (if you want it to be), but she also needs to be respectful. You also did not sign up for her practically living with you both, and this situation is not fair to you at all. If nothing changes, if I were you, I would end the relationship immediately. Your girlfriend should be prioritizing your feelings when her sister is clearly in the wrong.", "NTA, Tara is a minor that is skipping school and hanging out in your home.  Your home should not be her safe place during school hours.  She more or less is a runaway that stays at your home.  As Sarah is her sister this is a gray area on the legalities'.  first get a indoor climate control locker and mover your personal belongings there so Tara cannot damage any more of them.  Second start to look for a place of your own.  You did not sign up to house a truant and runaway.", "NTA…your apartment can be a safe place but your girlfriend needs to set ground rules with her sister and the first rule is to show respect for you and your things.  Also did your girlfriend unilaterally decide that the home you share together would be her sisters safe place? Were you aware of this arrangement? \n\nThe fact that your girlfriend has not enforced any rules and coddles her sister speaks volumes. Instead of helping her sister, your girlfriend is just an enabler.  You should feel comfortable in your own home. If Sara wants a safe place for her sister, maybe she should get an apartment on her own and give her sister the freedom to come and go as she wants. You shouldn’t have to put up with this disrespect from both Tara and Sarah.", "NTA\n\nYour GF is the AH - she shouldn’t have made that deal without discussing with you or even informing you. She also should have pulled her up on the disrespect to you and belongings. \n\nBeing a safe space doesn’t mean don’t tell them off or rock the boat incase they run away. It means being a safe stable environment which doesn’t necessarily mean bunking off school\n\nWith a bit of luck, this will be the cold wet flannel in life that will help Tara come back and build a better relationship where she doesn’t trash vinyl or other peoples homes. On the other hand, you have a GF problem", "NTA. she has no respect for you or your space. if she viewed your apartment as a safe place she would’ve respected the area more.. it’s not like you didn’t have a talk with her or Sarah before.", "RUN! Tara is going to hit rock bottom and you will be the blame for “taking away her safe space”.", "Nta. Your girlfriend is enabling her behavior. Don’t shit in the hand that feeds you. In what world is it okay to trash a home that isn’t yours and ruin items that belong to someone else? NEVER", "NTA. Sounds like your right to think about distancing yourself from Sarah and her sister. All Sarah is doing is just enabling bad behaviour under the guise of helping. If she wants to help her sister then she needs to communicate with her that behaviour needs to change or get the kid some damn therapy or something. By the Sarah realises that her behaviour is making her life worse it’ll be too late. Tara will be living with her and completely dependent on her for everything. Do you want to be apart of something like that for the rest of your life?", "NTA - I would've lost my cool way sooner then you did. Tara needs to learn how the real world works. Allowing her to be disrespectful to others is just facilitating her bad behaviours, her sister needs to realise this as well. If she doesn't change or doesn't genuinely try to then she should not be allowed to stay.", "Nta-this is a crappy situation. Had you known, you may not have added the kicked out part (which while you’re right, but not consulting with GF before giving sister the boot is what got you in trouble here). While you’re okay for kicking someone out that was continuously disrespectful, it was also GF’s place, and her sister, might’ve been better if GF knew before you told sister she’s out (btw-the lecture sounds warranted, but not consulting GF got you in her bad books)", "Kinda an asshole... I think, for the most part, you had valid reasons for getting mad and kicking her out. However, she is only 16, and the parent comment was really mean.  Your girlfriend is TA for allowing this to go on for so long until it blew up and for not informing you  your house was supposed to be her safe space.", "Nobody's the asshole here. But you need to decide whether you are willing and able to play a parental role to Tara, because that's what she's looking for. \n\nIf you want to let Tara stay with you, I would give her her own space, and put away as much of your own stuff as possible so it doesn't get wrecked. Kids going through bad stuff act out, just what they do. If she's trying to run away from home, likely there will be more destruction \n\nIf you don't want to let Tara stay with you, it's perfectly reasonable to limit your contact with her if she can't respect boundaries. But you and Sarah need to decide what those boundaries are. \n\nBut realizing that she's a child, and you'll be raising her to some extent.  If you don't wanna do that, pull the plug on the relationship. People from bad home environments typically look for a \"savior\" in a relationship until they work through their own personal issues.", "INFO - How intense and audiophile are you. When Tara damaged your vinyl, did she mishandle it while playing it and use or did she lay it out and scratch on it, either unknowing or uncaring that she was damaging it?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nThis situation sucks, and I need a third-party perspective. \n\nI've lived with my gf \"Sarah\" for 2 years now. Sarah has a 16-year-old sister \"Tara.\" Tara lives with their parents, but Sarah and Tara have a very rocky relationship with their parents. Nothing too bad, but it's toxic nonetheless. \n\nFor the last 6 months or so, Tara has begun staying over at the apartment that me and Sarah share. I've always been somewhat uncomfortable with this, mainly because it's common for Sarah, who works from home, to let Tara skip school and come spend the day with her. She says it's better than her being on the streets but I digress. My biggest problem is that Tara trashes the place and has no respect for me. Tara does not like me. I don't know why, Sarah does not know why. She is incredibly disrespectful to me and my things, eats my food despite being told not to on a nearly weakly basis, and \"borrows\" this from the apartment with no intent to ever return them. \n\nI've been at my wits end over this for the last month and I feel like Tara is testing my limits more and more. I've talked to both of them and let them know if something doesn't change soon I will lose my cool. But every conversation ends with Sarah committing to things that never happen and Tara being noncommittal or just disinterested in my feelings.\n\nIt came to a head Friday. Sarah had gotten off work early and left Tara alone. I came home to the place absolutely trashed. This I could handle, what I could not be that Tara had pulled out some of my vinyl to listen to, scratched them to shit and just left them out on the table and ground when she got bored. When I confronted her and asked her what happened she just shrugged her shoulders and said nothing. \n\nI absolutely lost it. I told her exactly what I thought of her. How she was selfish, ungrateful, lazy, and downright unpleasant. I made the comment that if this is how she is at home, I now know why her parents don't want her in their house. I could tell she was taken off guard by my yelling, and the parent's comment caused her to start crying. I kicked her out and told her not to come back. \n\nSarah lost it and we fought. We've been pretty cold since then. She's talking about moving out, but at this point, I'm starting to consider that myself. Last night, however, Sarah finally decided to tell me that Tara tried to run away last year, and she made a deal with her that our apartment could be her safe space whenever she needed it so she didn't run away again. I still don't feel like this makes what she did right, but at the same time knowing this, I'm starting to feel bad.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA.\n\nThat's where the whole \"love me, love my dog\" cliche came from.", "NTA", "You are NTA. Tara clearly has a lot of issues and needs professional help. If Sarah actually wants to help, she needs to step up and take this poor kid to therapy.", "Giving the kid refuge from the storm is fine, but she could at least show her appreciation by not trashing your place. She probably is the same at home.", "NTA. She’s pushing to see what the limits are. Now she knows. You and your gf need to sit down together and make very clear boundaries that Tara will have to stick with to be able to stay there. If she crosses one, she’s out for (insert a week or three). She needs to get a part time job and pay you for the damage if she wants to stay there. \n\nShe doesn’t think she’s worthy of love, so she acts up so you will “prove” to her that she’s unlovable. She needs a lot of help, therapy, etc. This doesn’t excuse her behavior. If she is going to be out in the world in a couple of years she has to  be able to behave so she doesn’t get in trouble elsewhere.", "   Sarah would have told you about the deal with her sister when you confronted them before or from the start of her staying there. She is most likely trying to guilt trip you into taking care of them. This is manipulation at its finest. You might end up being banned from the apartment.", "NTA - your apartment needs to be a safe space FOR YOU.", "NTA Tara needs to understand if she wants to keep her”safe place” she needs to treat it and you with respect.  Sarah is not doing Tara any favors by not having any rules for her.  If Sarah can’t do better (and acknowledge that she Sarah hasn’t been handling Tara well), you need to break off the relationship.  If Sarah commits to doing better for Tara, then y’all need to sit down as a United front to lay out the rules and consequences for breaking the rules for Tara.  Then Sarah need to enforce the consequences if Tara screws up. If that doesn’t happen, end the relationship.", "NTA\n\n\"... she made a deal with her that our apartment could be her safe space whenever she needed it \".  And you were in on this conversation and decision?\n\nFor that kid to be allowed to be so disrespectful to you is horrifying.\n\nThis is what you're facing in this relationship.  Think about it.", "the relationship will not work out by the sounds of it , find a girlfriend where you do not have to deal with a siblings disrespect on a weekly basis NTA sarah and tara can live together while you find a girlfriend where there is no disrespect or chaos win win scenario", "NTA. Your home should be your and your partner's safe space first. She also should have talked about letting her sister make it her safe space. She is enabling her.\n\nPresent Sarah a bill of everything that Tara has ruined. It will either open her eyes and see how much damage her sister caused or cause her to leave. Win-win either way from where I sit. The relationaship isn't worth saving if she can't see how much they are both hurting you.", "NTA. If anything, I think you could have gotten your point across without the whole “I see why your parents don’t love you” thing but I’d probably be very frustrated too", "NTA I'd recommend you start looking for a new place. This is a ridiculous level of enabling and it doesn't sound like it's going to change.", "NTA but your girlfriend sure is. Let her move out and her sister can trash her place. Don’t let the sister back ever.", "NTA - Its time to break the lease and let them have the apartment, since it seems like neither of them want you in it. Sorry bro. It's not okay that your partner promised her sister a safe space and didn't talk to you about it. Her actions consistently show she respects and loves her sister more than you.", "NTA\n\nShe can find a safe place for Tara where she doesn't steal and destroy your stuff.", "NTA. Call CPS. Tara isn’t your problem. You and Sarah are incompatible and she declined to inform you of this safe space situation. I’d be moving on if I were you.", "Yeah, NTA, Sarah doesn't respect you any more than Tara does. Move out", "Run", "Don't feel bad. She's a monster, and you put up with her riot for far too long.\n\nWhy do so many Redditors find a solution to a problem that works and then decide to feel guilty over it?\n\nWhat are you guilty of? Nothing. NTA. Don't let her back in.", "Fuck that! I draw the line with my record! 🤬 NTA", "NTA - while it is admirable that Sarah wanted to provide Tara with a safe place, she needed to include you in that decision. Discussions needed to happen with you and Sarah and Tara about what the expectations would be for Tara if she were to use your home in that manner. Unfortunately Sarah set the wheels in motion for this to blow up because she left you totally out of the loop and didn’t enforce any kind of boundaries for Tara in your home - not just Sarah’s home.", "NTA - Sarah should've told you her agreement with Tara and Tara should be respecting you and your home.  I agree with you as to why her parents don't want her in their house.  Sarah needs to stop enabling Tara and help her grow up to be a responsible adult.", "NTA. The kid obviously has issues with pushing people away and angering them, she needs therapy, not free range to destroy a non-family members life. Sarah needs to get a grip, and if this continues you need to kick her AND the kid out. Not problem, the parents need to deal with both of them.\n\nTbh I would be scared of having such a mentally unstable teenage girl alone in my apartment all the time, she's obviously attention seeking and doesn't like you...what if she starts claiming things? You've walked in on her alone in there. You should tell your girlfriend that this is waaaaay too legally murky to be doing, your life is at risk.", "This. A safe space is where you go to be free of harm, pressure, judgement, unreasonable expectations, not where you go to ruin the peace of others or be completely free of consequences. \n\nIt's not unusual for someone to act out in their safe space. But it is unreasonable for OP's girlfriend to just assume that OP would be okay with it, especially because they SAID it was upsetting them. Tara's \"safe space\" doesn't come before the fact that it's OP's *actual home*.", "NTA if your girlfriend wants to make your shared home a safe space for her little sister she needs to set boundaries and rules to respect the apartment and your property and enforce them! And talk to you about it and get your agreement first. Your girlfriend is the biggest A H here for being so inconsiderate.", "THIS should be the top comment.  Perfectly summarized.", "I believe your assessment to be true. At least to this person. She’s making excuses to “protect” her sister. But such behavior is unacceptable and (maybe) a cry for help. I was a teenage girl myself with a toxic familial relationship. And did stay with several friends for long periods of time just to not be at home (only child) but even though how damaging my home life was I can’t comprehend treating people this way. I was so grateful to the people that tried to help me. And they did help me. I revere these people to this day.", "Uh, did you mean \"introspection\" rather than \"inflection\"?", "Needed . That ship has sailed with this latest trashing of op s home and things Imo.\n\n NTA op both Tara and especially Sarah are huge AH S.", "\"She is only 16\" is not a valid excuse at all. \n\nIt's not ok for her to act like a toddler and trash their apartment over and over again without so much as an apology. She is old enough to know how to respect people's spaces and belongings and take accountability for her actions. There is literally no excuse for her behavior. He even tried to have discussions about her behavior before but nothing changed.\n\nShe needed a reality check and OP gave her that. If she acts the same way at home, I agree, it's no wonder why her parents don't want her around. Op is not an asshole here except to himself. He's put up with this for too long.", "Sara and Tara are AH here.", "Does that detail really matter for you to make a decision? Tara has shown that she does not care about OP's feelings or belongings at all by consistently trashing the place and treating them horribly.", "Thank you. I’ve lived this myself. My partner’s “baby sister” was 30 and hit all the marks of Tara’s behavior in our shared home. Fortunately, she lives across the country, but when she wanted to visit, she demanded to stay with us and treat our home as her free crash pad and me as a nuisance. My partner couldn’t say no to her until after we got married and she crossed all the lines. We sorted it out in marriage counseling. I don’t recommend anyone with only two years invested in a relationship to go through what I went through to get my control over my personal space back. I still refuse to be in the same room with her 23 years later.", "No but thanks for asking.", "I never said it was OK and even said it was valid he got mad and kicked her out. It is valid that she is a child and he is an adult and an adult should know better than to say stuff like that.  No matter if she was a jerk, he still said something that shouldn't have been said to a child struggling.  Also, I said the sister is the asshole.", "It helps me decide how much help Tara needs. If OP is not an overly cautious audiophile, then a 16 year old who casually damages stuff needs more help than you being stern can provide. \n\nSome people might describe leaving a soda can out for two days as \"trashing\" others would use \"messy\". The OP's gf accepting the state of the apartment suggests that the OP might be using extra strong language to describe how destructive(?) or messy(?) the sister is.", "The parent comment was 100% warranted based on her behavior. She isn’t a 4 or 5 year old. She is 16 and knows better.", "She needs help, a lot of it", "16 year old who knows better but is struggling at home, has toxic parents, has an underdeveloped brain, and a sister that enables her...  She is literally set up for failure, and that adult man told her how it's her fault her parents treat her the way they do. He could have said so many other things to get his point across, but he chose to say that. He is supposed to be emotionally mature. She, as a 16 year old is not."]}