{"id": 21383, "submission_id": "14r0pqf", "title": "AITA because even though I try to do right by my 5 year old stepson, I don't even try to love him?", "selftext": "About 2 years ago, I met \"Josh.\" Josh had just been through an extremely traumatic experience where his wife gave birth to their baby \"Emily\" prematurely, Emily almost died, and Josh's wife, Ally, did die. They also had a 3 year old boy, Barrett.  \n\n\nJosh and I met roughly 2 months after this happened, I was 22 and EXTREMELY naive, Josh was 28. I thought we were just madly in love, but now I think it was probably some kind of trauma bond on Josh's part.  \n\n\nLike I said I was naive and I thought my love would save everything. I had NO clue. Josh asked me to marry him about 3 months after we met, and we married 3 months after that. So I became a stepmother to Josh's children just about 8 months after his wife died. So I had a baby and a 3 and a half year old suddenly.   \n\n\nAlly's whole entire world revolved around Barrett and he was her entire reason for living. This was reflected in many things about Barrett. He has always had an amazing confidence and spirit. Also, he had never, ever heard the word \"no\" before, or ever had to consider anyone else's feelings or needs, like his new sister Emily. He had already had issues with hitting and throwing things at other children and being nasty to them before Ally died. Even though Josh and I both work, he put the bulk of the childcare onto me, and although I had babysat and cared for young relatives, I had NO idea what I was doing. Barrett's behavior and attitude kept only getting worse. He has been in child counseling for over a year now. I have no idea of it's helping because I don't know how much worse things would be without it.   \n\n\nWe have no issues with Emily and I do feel bad for her not only because of how her brother treats her, but we spend so much time dealing with Barrett's behavior that she doesn't get her fair share of attention. And has to grow up in an environment with such unpleasant behavior going on all the time.   \n\n\nI have honestly never loved Barrett, but I sure did try hard to love him, and for a very long time I would have never admitted that I didn't love him.  And I do TELL him I love him. But I honestly feel like it's better for all of us that I stop trying to force myself to love Barrett sincerely. If I'm not trying to force myself to love Barrett, I can take a step back and be objective and really try to do what's best for him in every situation. If I try to force myself to love him, then I'm just upset and feel stomach-sick all the time because of his behavior and how awful it is. Honestly he just behaves as a selfish, zero empathy brat 24-7.  It doesn't seem like normal behavior when I'm around other 5 year olds. I still try to do everything possible for him, to help him and the situation but it's very upsetting in how he treats Emily.", "created_utc": 1688533324, "permalink": "/r/AmItheAsshole/comments/14r0pqf/aita_because_even_though_i_try_to_do_right_by_my/", "score": 37, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1. i stopped trying to love Barrett 2. this might make me the asshole because i'm his stepmother.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "You need to get to counselling for yourself. Maybe for your husband too. I don't know if your the asshole. But if you don't try to be a good loving mother to Barrett then you totally are. If you just give up on him so you can have your daughter. Your an asshole. \n\nBarrett was handed a horrible situation. He was old enough to know his mom died. But too young to really be able to communicate his feelings and thoughts. Anyone who looses a parent suddenly is going to have a hard time. A child his age its going to be worse. You should have known this will not be an easy thing. That it will take years if ever for you and him to build a bond. If you weren't willing to do that. You should get out now. \n\nI'm not going to say YTA but if you don't get help, for you! So you can be a good loving Mom. If you stop trying. If you decide that staying in your daughters life at the expense of Barrett is acceptable. THEN YTA.", "Divorce him. While you are sort of the asshole (although I sympathize with you and understand your frustration), your husband is the real problem here. He was pushing 30 and it seems like manipulated someone fresh out of college. \n\nI'm sorry that you are miserable and you clearly love Emily, but this is just going to get worse and it's not good for you or Barrett. Do you really want 15 more years of what sounds like hell? You may lose Emily, and that would be incredibly traumatic. It's going to be even more traumatic if she witnesses you miserable asf for the next 15 years and it's going to be awful for Barrett to grow up with someone who clearly doesn't love him.", "YTA. This is a 5 year old boy. Of course he’s going to have an attitude and he also lost his mom. Tbh, you’d you even marry Josh if you didn’t love his children. You’re cashing more harm to his children showing that you don’t love them and are done trying to love them even when his son is only 5 years old. YTA big time.", "ESH except the kids. Josh the most.\n\nI get that you were young and naive. But you’re not now. You write so clearly about knowing that what you thought was ‘mad love’ was actually trauma bonding.\n\nSo instead of wondering about loving your stepson, perhaps you should be considering if he should even *be* your stepson, and if anything about this relationship and situation is healthy for any of you.\n\nThings that stand out to me as concerning:\n- you met Josh two months after his wife’s passing\n- you were engaged three months later\n- his kids had a ‘new mom’ eight months after their mom died\n- Josh ‘put the bulk of the childcare onto me’ *YIKES YIKES YIKES*\n- you have never loved Barrett \n- you describe him as a “selfish, zero empathy brat” and compare him to other 5yos who have *not* lost a mother at a young age then been handed a ‘replacement mother’ soon after\n\nThings that are conspicuously missing from your post:\n- you *choosing* to take on the majority of the childcare\n- you and Josh jointly discussing Barrett’s behaviour and making decisions together\n- Josh taking any form of responsibility for his two children", "You've signed up for a lot of responsibility here.\n\nYou should consider getting some support for your situation. Some parenting classes for both of you. I'm not suggesting anyone is doing a bad job parenting here, but it's a lot to take on all at once.\n\nAlso, your husband needs to step up and be a full participant here. This is his son, he needs to be more engaged.", "YTA but I’m hoping you just don’t know better. Get your son therapy and get family therapy. It sounds like you all need it", "Honestly? This is so far above Reddits paygrade. You all need A LOT of therapy. If things aren't getting better with Barrett after a year in counseling, *find a new therapist.* My heart hurts so much for him. There are many respectful parenting accounts on Instagram to follow that may help curb some of his behaviours. Mrchazz, biglittlefeelings, sternasuissa, curious.parenting, themompsychologist, parentingwithintention, drbeckyatgoodinside. \n\nSomething that I try to remember when I'm feeling at the end of my very last nerve, is that \"children who need the most love ask for it in the most unloving ways.\" All behaviour is communication and he is *communicating* to you that he has a need that is not being met. Whether its grief/trauma processing, feeling seen, feeling safe within boundaries, etc. Maybe he's acting this way because he gets a big response and he feels like, even bad attention is attention, so I'm going to keep doing this thing that *always gets a big reaction.* There is something he needs that he is not getting right now. Children become what we tell them they are. If he's hearing that he's bad, or he's a biter, or a hitter, that's the role he's going to play. \n\nI realize that this isn't an answer to the question you actually asked, but it's the answer you (and Barrett and Emily) need. It sucks you're in this situation, but you are. And it *really* sucks for Barrett and Emily.", "YTA, look the kid is/was 3 years old and you and Josh got married 8 months after his mother died. To him it’s like his mother left and never came back and he doesn’t know why and here’s this random woman trying to tell him what to do. It’s good that he’s going through counseling but if he was his mothers whole world coupled with Josh not spending a lot of time watching them, it’s very very likely that Barrett’s mother was his whole world as well and she’s just gone. Some kids can’t process death like adults can, they’ll act how they see fit. If you don’t love him and know you won’t be able to, do yourself and that family a favor and just divorce Josh, it’s not fair that Barrett doesn’t have someone with patience and basically only 1 person loves him in that relationship. What happens when you have a kid? Barrett would be put on the back burner cause “he’s not your actual kid” and “you don’t love him”, that’s extremely selfish if you try and stay in that marriage", "You really dated someone that lost their partner less than two months from when he meet you?", "Lol he’s 5 years old not 25. YTA", "YTA. Barrett is 5 years old. He was an only child for 3 years then his Mom goes away, he winds up with a baby sister a depressed grieving Dad and TWO MONTHS LATER you enter the picture. He lost his Mom. His Dad brings you into the picture — how is all of this explained to a 3 year old? You are friggin clueless by your own admission and want to abandon him because he’s acting out. \n\nOf course he’s acting out! HE’S FIVE YEARS OLD AND HIS MOM IS GONE. WTH lady?  Where is Josh in all of this? This kid deserves so much better. Grow up. Act like an adult. Pull your head outta your and get this kid intense help to come to terms with what has happened and to undo the damage YOU and his father have caused. YTA.", "Honestly you need to walk away. This was never a situation you should have put yourself in. That kid needs a lot more than you are able or willing to give and honestly you rushed into a site you are not equipped for.  You do not need to compound the mistake by staying and messing up the kid even more", "YTA. Get a divorce for the sake of Barrett. He doesn’t deserve to be tolerated. He deserves to be loved and you can’t give that to him. Additionally, it doesn’t seem as though you love your husband either. We can’t always control our feelings but we can choose to act honorably. Anything less is abusive!!!!!", "Put him into therapy. He was 3 when he lost his mom. Then was thrust with basically an absentee father and a new baby sister. On top of that, he has a whole new stepmom. He probably sees that Emily is the reason his mom isn’t here anymore even if he doesn’t understand it himself.", "NTA for not loving Barrett right now but Y T A if you don’t try to love him overtime. Personally I think it’s ridiculous how people are crucifying OP for being abusive or a shitty person. Like she said, she was 22 and very naive when she met Josh, I completely believe that she genuinely though her love for him could fix everything and also naturally transfer to the kids. It’s not her fault she was naive enough to not know better. It’s also not her fault that she probably was manipulated into the marriage by Josh to take up a caregiver role that he didn’t want to assume, or that she is struggling with Barrett and doesn’t love him. She did try to love him, and she is also only human after all. I will say, OP you should have more empathy when dealing with Barrett because he’s gone through extremely losses at a young age, but it’s not your fault for being frustrated — no one can expect you to just automatically love a challenging boy who you barely know, in a living situation where you feel used. But as Josh’s wife now, unless you plan on leaving him which would be a completely different problem to deal with, you do have the responsibility to continue treating Barrett well, not make him feel unloved, and then ultimately learn to genuinely love him over time.", "NTA. Lots of people have no clue what they are talking about. I was a foster parent and then adopted a child who had been through extraordinary abuse and neglect. I have several friends who did the same. It is far, far more difficult than outsiders imagine, and in some cases the best you can do is to try to provide stability and care. Despite the fairy tales, love is not always automatic, and some children truly are much more difficult. But I am here to tell you that if you stick with it, and if your husband is more supportive than he seems to be, you will see bits and pieces of your positive influence over time. And those times get longer and more cohesive. Your son may need therapeutic intervention. Mine sure did. \n\nPlease ignore the haters who have never been there. They presume your husband will magically provide emotional support for these kids if you leave. That’s not at all true. Get some counseling and honestly, your husband needs to step it up. It is his responsibility to provide at least half of the physical and emotional support for these kids.", "NTA. Motherhood is hard even when you don’t have all that trauma and you have the opportunity to do it your way from the start - in those early years, we tend to compare a lot and feel like we’re doing it wrong, others are doing it better/more easily, and that we’re going to mess them up. With kids, as with other family members we didn’t choose to share our lives with (they are given to us), we cannot design a perfect kid to start with. You can love a person without loving their behavior. As with toddlers, parents also need to understand “you get what you get and you don’t throw a fit.”  In other words, work with the traits and strengths the child has. Set achievable goals and be consistent with the rules - consistency is everything! Studies show a child needs at least one adult (not even always a parent) who loves them unconditionally and they bond with. It can be difficult to bond with a difficult kid but if you keep the faith and keep trying without pressuring yourself or beating yourself up over it, I promise you can build a better relationship. If the behaviors escalate severely as he gets older, seek additional physiatrist evaluation and rule out issues that may require medication or therapy to overcome. Also, I strongly suggest you find a support group and also invest time in educating yourself (at this age with my 2nd I streamed endless episodes of Supernanny to better understand how to adjust my parenting to improve my kids’ behavior. Good luck! You can do it!", "Oof. Blended families are tough. Based solely on this post, your husband is a huge AH. He checked out and has left you to do all of the heavy lifting in terms of childcare and dealing with his kids' trauma as well.\n\nWhile it absolutely is not the child's fault for how he was raised and how his dad basically abandoned him with a stranger the second his mum died, it is horribly unfortunate that he is the one who will be disliked. \n\nBeing a stepparent seems so hard. I think there's so much expectation to love your bonus kid(s) as your own. Sometimes, that's just not possible. \n\nMaybe the bond will grow over time. Maybe it won't. I wonder if he is in therapy? It seems like he's really struggling, and it's tough to take a step back and look at the situation objectively when you're under a constant barrage. \n\nI think your actions show that you care about him and have been trying to do your best by him in a really shitty situation. I think individual therapy for the kids, yourself, and your husband would be worth looking into. And then family/couples therapy. \n\nYou're NTA. You seem to be doing your best in a horrible situation, dealing with trauma from all angles.  Your husband definitely is, though, for inflicting this situation upon you.", "NTA. He's not your child and it's okay that you don't love him. I don't love him either. Even if he was your child, it's very hard to genuinely love someone who's exhibiting such difficult behavior. Lots of parents will admit that. Or they'll say they love them, but don't like them. Or whatever.", "NTA. You don't have to love him as long as you are looking out for him. But it sounds like you don't really like the relationship you're in anyway, so why stick around?", "NTA - OP this is an awful situation you find yourself in and Josh is practically the biggest AH I've encountered on here and that's saying something. You cannot control your feelings and nor should you feel guilty for them, you sound like a good person doing their best for a responsibility which was never yours to being with (I'd really love 5 minutes with Josh to give him some home truths) in extremely trying circumstances. But there is something I'd like you to think about. I think you do love Barrett. You try to do the best for him, you are obviously very concerned about his future and want what's best for him and forgive me for being blunt, you are what, 24, 25? You're still growing, and haven't reached the point yet where you can even understand how complex love can be. Even for children. So don't be so hard on yourself over defining 'love'. Love is more than just the obvious feelings and I think you are doing yourself a disservice. \n\nI've seen your reluctance to consider divorce so I'll ignore that for now, other than to say that you shouldn't sacrifice yourself because of Josh's selfishness. Your dreams and life are every bit as important as everyone else's here and you need to remember that. \n\nYou need more help. Do you have extended family? What about the children's grandparents, can you reach out to them? Including Ally's family (who if in contact with Josh and Ally  I'm guessing weren't too impressed with you and Josh for marrying so quickly). Josh's family too.\n\nIt's good that Barrett is getting counselling, but, from the sounds of it, it's going to take a long time to tackle the trauma that's been caused. (His world was upended and he was only 3, of course, there is trauma, which, unintentionally I'm sure, your quick marriage to Josh will have contributed to) But have you considered speaking to a counsellor too? Someone impartial who can offer perspective and a sounding board would help you I'm sure). \n\nThis is a horrible situation and you do not deserve to be judged on AITA, this is far more complex than that. But I will say again, love is not a simple feeling and I think you'll understand that one day, so for now, stop labelling your emotions and don't feel guilty if you don't feel what you think you should, and just concentrate on doing what you feel is right.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nAbout 2 years ago, I met \"Josh.\" Josh had just been through an extremely traumatic experience where his wife gave birth to their baby \"Emily\" prematurely, Emily almost died, and Josh's wife, Ally, did die. They also had a 3 year old boy, Barrett.  \n\n\nJosh and I met roughly 2 months after this happened, I was 22 and EXTREMELY naive, Josh was 28. I thought we were just madly in love, but now I think it was probably some kind of trauma bond on Josh's part.  \n\n\nLike I said I was naive and I thought my love would save everything. I had NO clue. Josh asked me to marry him about 3 months after we met, and we married 3 months after that. So I became a stepmother to Josh's children just about 8 months after his wife died. So I had a baby and a 3 and a half year old suddenly.   \n\n\nAlly's whole entire world revolved around Barrett and he was her entire reason for living. This was reflected in many things about Barrett. He has always had an amazing confidence and spirit. Also, he had never, ever heard the word \"no\" before, or ever had to consider anyone else's feelings or needs, like his new sister Emily. He had already had issues with hitting and throwing things at other children and being nasty to them before Ally died. Even though Josh and I both work, he put the bulk of the childcare onto me, and although I had babysat and cared for young relatives, I had NO idea what I was doing. Barrett's behavior and attitude kept only getting worse. He has been in child counseling for over a year now. I have no idea of it's helping because I don't know how much worse things would be without it.   \n\n\nWe have no issues with Emily and I do feel bad for her not only because of how her brother treats her, but we spend so much time dealing with Barrett's behavior that she doesn't get her fair share of attention. And has to grow up in an environment with such unpleasant behavior going on all the time.   \n\n\nI have honestly never loved Barrett, but I sure did try hard to love him, and for a very long time I would have never admitted that I didn't love him.  And I do TELL him I love him. But I honestly feel like it's better for all of us that I stop trying to force myself to love Barrett sincerely. If I'm not trying to force myself to love Barrett, I can take a step back and be objective and really try to do what's best for him in every situation. If I try to force myself to love him, then I'm just upset and feel stomach-sick all the time because of his behavior and how awful it is. Honestly he just behaves as a selfish, zero empathy brat 24-7.  It doesn't seem like normal behavior when I'm around other 5 year olds. I still try to do everything possible for him, to help him and the situation but it's very upsetting in how he treats Emily.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "ESH except the young children.\n\nYou need to find a better therapist for Barett.  He needs at the minimum a CBT (Cognitive Behavioral Therapist), but he most likely needs a trauma based specialist.  \n\nIf he is 5, he is school age.  Get his school involved in getting you help.  They will say it's behavioral and there is nothing they can do - it's a lie.  You need to educate yourself on what help the school can and should be providing.\n\nBarrett isn't able to regulate his emotions.  He needs help identifying them and learning how to cope with them.  He doesn't display empathy because he doesn't understand what it is, and right now he's probably a churning mass of negative emotions all the time.  \n\nDaughter has ADHD.  We were doing social emotional books all the damn time, but until a CBT showed me how to use them, it didn't help.  We did so much work to help her center in her body and learn to self regulate.  It's hard work, for both the kid and the parent, and they don't understand why they are doing it at first, which makes it harder.\n\nBarrett senses you don't love him - he had a mom who did, and now he doesn't, and neither of his caretakers love him like she did.  You do love Emily, he can see that, and it is going to make everything worse.  \n\nLook for a Parent Child Interaction Training program.   Look for a CBT.\n\nIf you have health insurance, call them.  Ask for a navigator or whatever your insurance calls them - they will have someone whose job is to talk you through what benefits you have.  Ask them for help in finding the right kind of professional.\n\nMost therapy at that age is play therapy, and it's not by therapists up to dealing with the level of trauma Barrett is currently experiencing.  As much as you think you are doing your best to give him stability and help, but he is going to be able to tell you favor Emily and between that and losing his mom; it's all trauma.\n\nI can't advise to stay or go, because it sounds like neither is a good choice for him.", "Josh married you because he wanted a nanny who would take the whole responsibility of parenting and probably a bed warmer and you naively thought that was love. \n\nAs for the Barret. He’s 5. FIVE. He’s screaming help with all those behaviors. Maybe he needs to change the person he sees, maybe he needs another method. Talk closely with his therapist and watch them like a hawk preferably with Barrett’s dad. \n\nBtw, Barret probably can see you don’t love him and I hope you get a divorce because he deserves better than being the unwanted kid in his own home.\n\nESH", "YTA. Barrett was three years old when he lost his mother, gained a sibling (difficult for a lot of children) and his father opted to remarry. That's a LOT. His father did not act in his best interests and that is the issue here; a year of counselling won't magically erase what this child has been through. \n\nYou're an adult calling a 5 year old child a 'zero empathy brat'. How ironic, given you don't seem to have much, if any, empathy for Barrlett. I don't think it is in Barrett' best interests to have you as a stepparent, harsh as this sounds. You don't seem emotionally ready for it.", "Aw man.   NtA but Barrett is a human being.  He can't possibly understand what's going on.  I have a 5 yr old and a 6 yr old.  This age is very very demanding and kids this age are really low on impulse control.   \nThink about what's going on here.  Barrett lost his mom.  Then his new baby sister stole the spotlight.   He's probably just super super traumatized and unable to verbalize what is going on inside him.  You are also very young and should be commended for your role in helping them along.  \nMaybe while you pretend to love him, love will grow. One of my kids is much more difficult than the other and I think she just really needs attention and specific one on one time.  Maybe you could try just having talks with him and see if he will open up to you.  Find things he likes and show him that you care.  Don't rule out the possibility of love.  Maybe you're a bit overwhelmed at the moment but the fact that you asked the question shows you love him a little.  Do what you can to let the love grow naturally.", "I have had my two stepsons since they were 1 and 3. They are now 12 and 14. I have never loved them, or professed to. They are not my children and therefore I do not feel maternal love for them. However, I do look after them, feed them and make sure they have everything they need. You are NTA x", "Fuck sake... dear God, what a mess. Not even insulting you. Just, *woof*. You got yourself into a *pickle*. I don't know if you came from a family where you were a people pleaser like I was, but you *might* have gotten yourself into a situation where you thought that, because you felt love (and pity) for someone, that being near them would be a good idea. Like, you could help them that way.\n\nIn general, no three-letter acronym 'ruling' fits here, I don't think. If the kid's out of control, and you don't really love him, that's a reality that is very hard to admit. You don't *really* have to love him; you shouldn't fake it, for starters. But I can tell you that, I don't think this is the ideal situation for you. And kids know when you're faking loving them.", "You and your husband are both the AH.\n\nYou for getting married so quickly and not understanding what you are getting yourself into and him for just ignoring everything and marrying so quickly without helping his son through this first. \n\nNow you have a kid who is acting out for obvious reasons and blaming him (the symptom) instead of working on the real issue.   This was something both of you contractually agreed to. Good Lord.", "You were a young mother to two children that were not yours. Well done on taking on such a huge responsibility. \n\nBarrett is a 5 year old going through his own trauma. His mum was his world, went to have a baby and did not return home. He has a sister and no mum and then you are his new mother - How does he deal with all this? By acting out? That’s the only way he knows. \n\nYes, he would be hard to love, but his behaviour could be a cry out for love from his mother. \n\nHe will need a lot of therapy and love  in order to heal from this pain. \n\nDon’t give up on him, he needs your  maternal love even if it’s fake. \n\nMaybe, your husband should talk about Ally to him at night, etc.", "I have no problem at all loving Emily, she is my daughter, if Josh and I ever split I would retain primary custody of Emily and he knows that (and would be fine with it since he believes children should be cared for by a woman).", "One of the problems is this: if I left, Josh would find a new stepmom before the ink was dry on the divorce. I think it's unlikely that would be better for Barrett than just trying to make the best of the current situation. Sure, it's always possible to win the lottery and whatever stepmom Josh could find quickest could be Mary Poppins of a woman. But I think the odds are against that.", "I have zero desire to have biological kids, I have health conditions that preclude it, and don't feel the urge for it either.", "5 year old can be pretty unbearable esp if you're not bonded", "She was 22. Her brain hadn't even finished developing. Josh manipulated her into becoming the unpaid nanny. She's NTA.", "So who is going to step up. Dad? He’s already bailed. Stop judging the one person who is actually trying.", "Divorce is an option! You can take Emily with you. You don’t have to stay there and torture poor Barrett and give him less than he deserves. You made a mistake by moving into your relationship too fast. You made a mistake by adopting Barrett. You made a mistake because by marrying your husband. You made a mistake by promising to love Barrett when you can’t. How many more mistakes will it take for you to do the right thing? Stop making excuses and making everything about you. My God, do something right for a change!", "Divorce is not an option because of Emily, she's my child through and through and I will raise her. I adopted them both when Josh and I married so they are both legally mine.", "I feel like it's best for Emily, and honestly, also for Barrett. I don't think Barrett's issues will improve with a new revolving carousel of stepmoms.", "She’s not the daughter you claim. If she was then you’d also accept her brother and be patient.", "You have adopted both children or just the one? Even if you did, a judge wouldn't agree to splitting up siblings because you didn't like one of them.", "That is on Josh. You can’t stick around because of things Josh may or may not do in the future. You can’t burn yourself out caring for his children because of the what ifs.\n\nAnd you’ll create your own traumas sticking around. The kids will know. Barrett will know that you don’t love him but that you do love Emily. Emily will know that you do love her but that you don’t love Barrett. They’ll know you martyred yourself.\n\nJosh manipulated you into this situation. Yes, he may manipulate someone else into this situation (how? Do his bits taste like chocolate?). But that would be HIS doing, not yours. You can’t spend your whole life doing things that aren’t healthy for you (or Barrett or Emily or Josh) because you think Josh will do worse without you. He’s an adult.", "\"I shouldn't leave my husband because he sucks\"\n\nDo you see how that looks?", "Don't love Barrett then, long as you act for his best, it could do the trick. I would however go to family therapy and also send Josh to individual therapy. Your husband is a real piece of work, you can blame grief but honestly, I think he is the prototype of the lazy man. If Josh does not want to go to therapy, you could actually make him by telling him you will have him have custody if you split (I know you don't but lying is the least of your problems here). Also do not hesitate to shame him for his lack of involvement to his friends and family, be subtle but clear.\nYou have a husband problem, not a stepson problem. Barrett has lost his whole world, he needs time. He woke up 1 day with a mom that was everything to him and an absent father. A couple of blinks later he has a sister out of nowhere, no mum, a new woman who is not his whole world and an absent father as ever. Imagine how much he's had to adapt already...", "OP talks about the “zero empathy brat” like he’s an abusive ex.  Again, he’s 5 years old (and just lost his mother to top it off).", "Sure, it’s not like you are making judgments. At this point I don’t care what she does. My heart just goes out for that child.", "Everything is about me, lol. Not about my husband who married me long enough to get me into position as the fulltime child caregiver while working and then does everything to avoid providing any care to his children. I surely manipulated him into this when I was a college student and he was turning 30 as a father of 2. Being a 22 year old stepmom to a disturbed child is every girl's dream! IF we split? He would do everything possible to get me to retain primary custody of BOTH of them. Which I'd be find with in Emily's case. If I DID NOT retain primary custody of Barrett? He'd find another stepmother in weeks and believe me it would not be some rigorously selected choice. Lol. But yes, do go on how it's allllll about me and it would be so much better with selfish old me out of the picture. You're surely right, whoever he could find quickest would definitely do a much better job with Barrett. And if that one didn't work out he could find a 3rd one a couple weeks after that. That would be great for Barrett! Glad we had this talk lol you definitely know what would be best in the situation instead of selfish old me who's been destroying my physical and mental health to care for someone else's child the past 2 years.", "She wants nothing more than for her and I to spend time together without Barrett there, she sobs at the sight of him sometimes because of how he treats her.", "Oh yes, what Josh does is all on Josh. That's for sure. But it's not that I'm worried Josh would do worse without me, it's more like not wanting Josh's actions to severely worsen Barrett's trauma and create trauma for Emily when Emily is doing great. Despite some people in these comments portraying me as the wicked witch of the west, I wouldn't have even stuck around this long if I didn't care what happened to Barrett. I do care about him very much, I don't have to love him in order to want the best for him.", "Well sure, but dad isn’t stepping up at all. She is at least trying to provide structure and caring for him. Love is not automatic, despite the fairy tales. It often can develop over time, but if we judge people for being honest? Not fair. I take it you have not been in a situation like this. It is much more difficult than most people understand.", "Girl, im 22 and I would have never made such an stupid decision as marry someone who lost their wife three months ago before we met, 22 year old don't mean you are stupid", "Then you do you. Why did you even bother to post here? What were you looking to achieve? On second thought, it doesn’t really matter.and neither do you! Have a great life.", "Playing victim and making excuses. It’s called accountability. At 22 years of age you’re able to make your own choices as an adult. You’re allowed to smoke, drink, gamble because you’re seen as old enough to make those competent decisions. You can marry at 18 cause it’s seen as you’re able to make that competent decision. Josh is a whole issue on his own and needs to step up as a parent yes, that’s a you and him issue. The issue we all have is that you were considering staying in this marriage and giving Barrett no love which he doesn’t get from his dad either. Is raising a child hard? Yeah but it’s not impossible. This is where Josh needs to step up as a dad. Maybe try presenting Barrett with choices, I’m sure he has things he likes to do and you can encourage good behavior with rewards such as going out for Ice cream or going to the park or getting him a toy, etc. There are ways to get through to him to put him on a better path to happiness and life. Maybe try introducing him to sports. Don’t just blatantly give up on the kid cause odds are he’ll be in jail if you continue life like this with him. Find what he likes and you can find an opening, trust me. Sometimes even a 5 year old can have a heart to heart talk, are you sure Josh talked about what happened to his mother with him?", "Wow. You sure have a mouth on you. And an attitude. And you take advise well, - no wonder your bonding with a stressed kid goes so well as you implement all the good recommendationz you hear. /s\n\nAfter this comment - YES. It's a \"you\" problem, not kid problem.", "Unfortunately the people on Reddit have some very fixed ideas in some areas and simply cannot accept an alternate reality. In this case it is that all children are lovely/ will be lovely if you just try hard enough, and secondly, if you can't give 100% then a divorce is the best thing for the kid.\n\nI think trying hard is more important than what you feel. Actions over thoughts. The child may sense the lack of sincerity but you leaving and dumping him definitely won't be better. You sticking it out is definitely in the child's best interest and if that requires you to give up on trying to love a child that is currently just nasty,  then I think you are doing exactly the right thing for the child. \n\nHowever I am wondering about long term. Maybe this child improves or maybe he turns into a psycho tween and teen. You don't sound like you love your husband and why should you? He seems to have manipulated you nicely. So what do you actually want for your future? Is there a way to take just the little girl? Unlike the other people here I am aware that some kids just stay awful, if you can't help this one, maybe you should help yourself and the little girl. One way or the other, you need a long term plan. \n\nThe rest of you can down vote me into oblivion. I'm fine with that. I won't be replying to the inevitable abusive comments from \"lovely\" people.", "I'm so sorry that you are all going through this it sounds awful.\n\nI recommend marriage counselling. A decent counsellor will tell your husband to get his shit together.", "“I don’t have to love him in order to want the best for him.”\n\nBut you have to love him to truly be his family.\n\nYou’ll create your own traumas for these kids. (Yes, plural - your love for one and not for the other will absolutely impact both kids.)", "Dear Poster as a teacher for over 20 years in a low income community I have nurtured many children who were deemed unlovable because they weren’t the right color, didn’t come from money, had learning disabilities and were just plain angry because no one cared. I understand that you feel that I’m being harsh with the OP but I want the best possible outcome for Barrett and she has admitted that she is not capable of loving him. \n\nI am and always will put the needs of a child over the needs of an adult so I am okay with your judgment of me. I won’t try to make you see my heart. Just know that Barrett needs more love and help than OP is either unwilling or unable to provide and only she is in a position to change it.", "My thoughts exactly. The entire post is filled with this “I am only 22 and I was a clueless child I didn’t know what I was doing” … yes you knew? I’m 22 too and I’m an adult woman, not a baby. This is an incredibly stupid decision she made consciously. She can either divorce this guy or deal with it", "\\>On second thought, it doesn’t really matter.and neither do you!\n\nRead that over and realize something that vile \\*came out of you.\\* You shouldn't be let within 100 feet of a child, much less giving \"advice\" about them on the internet.", "Not judging you. But a simple question: have you adopted a child or fostered a child? Because not only was I a counselor, but also my wife was a school teacher and counselor. Of course we cared about children. That’s why we made the leap. It is very easy to judge if you haven’t actually done it. My point is that love is not automatic. By the way, the child we adopted with lots of problems and many struggles for a decade just texted me about her happiness as a now young adult on a fun adventure sponsored in large part by my wife and me.", "Ha! I am a teacher in a low income neighborhood who have nurtured children your over twenty years. I’ve seen abuse in many forms and the resulting side effects. I have three beautiful, well balanced children. So, before you misspeak once again make sure you know what you are talking about. Btw, you told me that you can’t leave because Josh will take Emily but you told someone else that Josh would gladly give her up. You are contradicting yourself. \n\nOP, I am not going to argue and go around and around with you. As I have indicated earlier, you do you!", "No. I have not adopted a child or fostered a child. That doesn’t mean I can’t empathize with someone who does One or my close friends adopted a child who suffered from drug withdrawals at birth and I watch her maneuver around many challenges. So, I do understand the struggle and I totally understand that love isn’t automatic. My issue is OP has just given up. She doesn’t know if the counseling is working; well, has she informed the counselor of his continuing issues or checked to see if their some other issues like autism, adhd etc? Additionally, she has admitted that Emily is suffering under the strain of Barrett’s abuse. No one is thriving in that home.\n\nThe other thing that really got to me was the discrepancies in OP’s proceeding comments. She wrote me that she couldn’t leave her marriage because her husband would take Emily from her but she then turned around and told another poster that her husband would gladly let her take Emily so he didn’t have to be responsible for her “and” her husband would replace her with another woman within a few months. I feel like she will say whatever suits her needs.\n\nTwo years ago, one of our students committed suicide because his stepfather treated him poorly and acting like he was invisible all due to his sexual orientation. The grief that our students and staff is eternally burned in my head. I don’t want this future for Barrett or Emily. I just don’t see either of these children getting what they need from this toxic environment. \n\nTake care and have a good night."]}