{"id": 21390, "submission_id": "14r4kuf", "title": "AITA for Charging My Friends for My Homemade Meals?", "selftext": "I (29M) have always been passionate about cooking and experimenting with new recipes. Over time, my culinary skills have developed, and I have become quite adept at creating delicious and unique homemade meals. Many of my friends have tasted my creations and have expressed their love for my cooking.\n\n\nLately, my friends have been requesting that I cook for them on a regular basis, as they find my meals to be restaurant-quality and a delightful change from their usual routine. While I enjoy cooking for others and seeing them appreciate my food, it is quite time-consuming and requires a lot of effort on my part.\n\nIn light of this, I started charging my friends a small fee for the meals I prepare for them. I believe that my time, effort, and ingredients should be compensated for, just like any professional service. I am not trying to turn it into a full-fledged business, but charging a reasonable amount helps cover the costs and acknowledges the effort I put in.\n\nHowever, some of my friends are now upset and accusing me of being greedy and taking advantage of our friendship. They argue that since I enjoy cooking, I should be happy to share my food without expecting any compensation. They claim that charging them diminishes the spirit of friendship and turns our gatherings into business transactions.\n\nI am conflicted now, as I feel that my friends are being unfair in their expectations. So, Reddit, AITA for charging my friends for my homemade meals?", "created_utc": 1688546056, "permalink": "/r/AmItheAsshole/comments/14r4kuf/aita_for_charging_my_friends_for_my_homemade_meals/", "score": 803, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > The reason I am wondering if I might be the asshole is because I am asking to be compensasted for the work I have done in the kitchen with the cooking. I can see both sides of it. They are my friends obviously, so ideally I wouldn't need compensation. But the fact that I am again paying for everything and taking the time to cook it, should mean something.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Info: are you inviting them over and cooking for them, or are they inviting you over and asking that you cook for them.", "Info are you cooking using your own ingredients in which you paid for everything or are you cooking using their ingredients?\n\nAre you cooking as a guest in their own place or are you having to prepare everything at home and then seeing your friends?\n\nI feel like there's a few things we're missing here.\n\nMainly asking these because these things and more do play a role in how much you're charging your friends. (as well as your time and effort is important too.)", "Okay, I'm gonna help you out real quick. Check this shit out, you're gonna instantly understand who's being taken advantage of:\n\n>some of my friends are now upset and accusing me of being greedy and taking advantage of our friendship.   \n>  \n>  \n>  \n>They argue that since I enjoy cooking, I should be happy to share my food without expecting any compensation. \n\n*My friends are accusing me of being greedy, and taking advantage of our friendship*\n\nOkay. How are you being greedy?\n\n*Because you're asking for compensation.*\n\nWhy are you asking for compensation?\n\n*Because you're making food for them, for free, which takes time, money, energy, and resources.*\n\nWhat do they think you should be doing?\n\n*Making food for them, without any compensation. Essentially, working for free, taking advantage of your friendship.*\n\n**Friend, these people are narcissists, and they just pulled a bit of projection on you.** They know that **they** are the ones **being greedy** and **taking advantage of your friendship**. So, when faced with this fact, they projected that *onto you*, just to confuse you.\n\nThis is the part where I say **NTA** and I hit the little judge's gavel thing, doink donk, case dismissed. These people are fuckin' *leeches*. Ditch 'em.", "Question - do they ever reciprocate by having you over or take you out to eat?  If it is totally a one way transaction where you are responsible for buying all the ingredients and cooking at your home and all they do is show up and eat, then NTA.", "NTA.\n\nYou're not taking advantage of them. They are taking advantage of you to get free food. You're perfectly within your rights to charge for something that costs you time and resources. If they don't like it, they can have their restaurant quality meals at a restaurant. \n\nYou're right, your friends are being absolutely unfair and they are trying to guilt and manipulate you into agreeing to their, frankly, exploitative requests.", "INFO: the early part of your post reads like you’re meal prepping for them, giving them meals to eat at their leisure. The latter part reads like you’re hosting some meals for the group at ‘gatherings’. Which is it?", "Yeah NTA, just because you enjoy someting doesn't mean people get to take advantage of you.", "NTA (assuming that you're talking about meal prep that your friends have asked you for). Just because you enjoy doing something as a hobby, it doesn't mean that you want to do it every spare, waking moment.", "NTA – Your friends are either bad people, irrational people, or normal people whose kneejerk reaction is subconsciously driven by the fact that they got overly comfortable with a beneficial arrangement that they don’t want to lose.\n\nThey are requesting that you cook regularly, and this has turned what was an enjoyable and affordable hobby into an unaffordable hobby that is beginning to become a chore. That is obviously not okay. Think of it this way: your hobby is cooking, and their hobby is eating; why should you be the only one who pays?\n\nI remember when a friend of mine started getting into cooking as kind of a new hobby, and he wanted to use me as a guinea pig for his meals. We treated it as a mixture of me doing him a favour, and him doing me a favour, so I didn’t bring wine or do him other favours as often as I would if he was already a good chef.\n\nYou are well past the point where your friends are doing you a favour. They are simply taking advantage of you, although it’s possible they don’t realise it.", "NTA\n\n> They argue that since I enjoy cooking, I should be happy to share my food without expecting any compensation\n\nThey're taking advantage of you to get a free nice meal", "If you cook and you invite them - it's expected that you will pay for it. It's your treat.\n\nIf they request you cook for them - they should compensate you for the ingredients, your time, skills, use of space and utensils, as well as the clean up after the meal. It doesn't need to be monetary, they can bring you ingredients and help with prep work and clean up, and you do the rest. \n\nAs long as you agree on the conditions and the cost in advance, NTA", "NTA, you’re providing the food, equipment, labor, etc. they’re providing themselves to eat. It’s 1 thing to invite them over to a meal, it’s a whole different thing for them to ask you to provide meals for them on a daily basis. All you’re doing is costing yourself. Consider cutting them off like they’re trying to cut their grocery bill.", "Ew. Your friends are greedy and taking advantage of you. \n\nNTA for covering your expenses.\n\nThis isn’t a one off. This is regular", "Tell them if they won't pay you then they should purchase the ingredients and give then to you", "INFO:\n\nHow much are you charging?   \nCovering the groceries bill is fair game, a little round up is too. But if you take a profit out of it you are doing business!", "NTA. If I were you, I wouldn't necessarily charge them for my time, but it's perfectly normal to ask them to chip in for the groceries. Maybe you and your friends could have a small fund for events like this? Everybody chips in, and you use the money for your homemade dinners.", "NTA \n\nDo any of your friends help you in any other ways, or are they all just greedy users?", "your “friend” is using you for free food.  NTA", "NTA because it sounds like they are taking advantage of your hospitality, and were hoping to keep doing so. If they aren’t willing to cover the cost of ingredients, then they don’t deserve your meals. Might be best overall just to stop cooking for them at all. A step further would be to find new friends.", "NTA, they are asking you to cook for them on a regular basis. You did not invite them for dinner. They asked you to cook for them. So asking for them to contribute some money is perfectly fine. They are the AH for expecting free food on a regular basis.", "NTA \n\nThey’re asking for a service and need to pay for it. Food ain’t cheap.", "> They claim that charging them diminishes the spirit of friendship and turns our gatherings into business transactions.\n\nINFO: so how much are you charging? And explain gatherings? Like you guys are going to get together and someone requests you make something specific? Are other people bringing food?", "Info\n\nIf you made it clear \\_before\\_ the cooking that you would want to have some money, that is absolutely o.k.\n\nAnd if you cook for them and they don't cook for you on a regular basis.\n\nThen these people took advantage of your friendship and now are upset that you don't want to spend all the money and time without them returning the favour.", "In the correct context, there is nothing wrong with this, but how you go about it is important. There are many things you need to consider. \n\nAre you blindsiding them with the fee or being up front and honest about compensation on the front end? Are you overcharging? How often is this happening? Were your friends taking advantage at all? \n\nMy suggestion would be to actually develop this into a side hustle. Print up menus and fees for 1-2, 3-5, 5+ meals and have your friends help you market this business. Only take orders that you want to take. When you test out new dishes on your friends, only charge for the ingredients but not the labor. In exchange, ask for their help getting the word out that you are taking orders as a personal chef. \n\nPlease follow your community’s health ordinances. \n\nMy extended family finds and hires a personal chef every time we have a family reunion. It’s cost effective and allows for all our dietary adjustments as well.\n\nNo one is the AH here. You and your friends just need to communicate to come to an agreement so that no one feels taken advantage of.", "[deleted]", "Info: In your country are you allowed to sell food that isn't prepared in commercially-accredited kitchens?", "[deleted]", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (29M) have always been passionate about cooking and experimenting with new recipes. Over time, my culinary skills have developed, and I have become quite adept at creating delicious and unique homemade meals. Many of my friends have tasted my creations and have expressed their love for my cooking.\n\n\nLately, my friends have been requesting that I cook for them on a regular basis, as they find my meals to be restaurant-quality and a delightful change from their usual routine. While I enjoy cooking for others and seeing them appreciate my food, it is quite time-consuming and requires a lot of effort on my part.\n\nIn light of this, I started charging my friends a small fee for the meals I prepare for them. I believe that my time, effort, and ingredients should be compensated for, just like any professional service. I am not trying to turn it into a full-fledged business, but charging a reasonable amount helps cover the costs and acknowledges the effort I put in.\n\nHowever, some of my friends are now upset and accusing me of being greedy and taking advantage of our friendship. They argue that since I enjoy cooking, I should be happy to share my food without expecting any compensation. They claim that charging them diminishes the spirit of friendship and turns our gatherings into business transactions.\n\nI am conflicted now, as I feel that my friends are being unfair in their expectations. So, Reddit, AITA for charging my friends for my homemade meals?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA\n\nIngredients cost money. Sorry, these people are not your friends. Don’t cook for them. Problem solved.", "NTA. There is a girl at work who does this- charges like $5-$15 per meal prep based on ingredients/time. Food costs money and you're putting it together. This is just fair.", "*However, some of my friends are now upset and accusing me of being greedy and taking advantage of our friendship.*\n\nThey need to look in the mirror and say that. Especially now that it’s become a common occurrence. \n\nI say NTA.", "NTA - now they need to find somebody who likes laundry , cleaning, minding children and all those tasks they don't want to do and say 'but you enjoy doing my laundry !!!'", "Key word here is “requesting”. If a friend offers you food, it should be free. If you request food from a friend, it’s obvious you should pay. \n\nNTA", "It literally says they started requesting OP cooks for them.", "Yep, this is important info. At first I was thinking N T A because it seemed as though their friends had asked them to meal prep for them but the last paragraph has me doubting.", "Or are they inviting themselves over and expecting OP cook for them", "Yep, this sounds as bad as that AH who enjoyed his girlfriend’s cooking so much that he never once took her out to eat. Then he was surprised when she dumped him.", "Mic. Drop.", "[deleted]", "I understand your point but just because someone enjoys doing something, it doesn't necessarily mean that they want to completely fill their spare time with it. I love growing veggies but I wouldn't want to go around all of my friends' gardens in the weekend and plant veggies and tend to them. I think that you can have a hobby but not want to do it every spare waking moment.", "But have they asked you to meal prep for them or cook at gatherings. I was completely with you until you mentioned in the last paragraph that you were cooking for gatherings. So is it meal prep that they're complaining about paying for?", "NTA. Stop cooking for them. They're treating you like an unpaid personal chef. They are not your friends.", "NTA. \nI have a friend who makes really nice food. I suggested that she sell it. She opened a WhatsApp group to advertise, and guess what? People are supporting her and buying her food. \nYour friends are not good friends.", "NTA how often are you cooking for them. If you are inviting them round for a dinner party don't charge but if they are regularly asking you to cook you should be compensated", "NTA, i often host dinners with friends at my place (once a month) and i dont ask for compensation because i wanna treat them. But whenever we're making plans for BBQs and dinners just for fun they always help (some pay for the ingredients, others bring drinks, and while im focusing on cooking they always help in appropriate manner (firing up the BBQ, preparing and setting the table, cleanup and dishwashing). Your friends are just using you for free food at this point.", "No, your friends are taking advantage of you. But charging them is not going to work out well. \n\nSo tell them you choose to cook only when you want. Then invite who you want and don’t charge them. \n\nThis is the only way you will keep friends. Otherwise you will feel used if you do it for free and it gets weird if you charge them. \n\nNTA but I disagree on how you handled it.", "NTA, it’s really not a gift.  It’s a demand from your friends.  What do they do for you in exchange?", "NTA.  They are conveniently ignoring that the groceries cost.  Why would you be able to afford that?", "NTA. If you were just starting out and trying things and invited friends to sample then I’d say it’s on you. Once friends start requesting meals because they enjoy them so much they should, at minimum, buy the ingredients for you. You get practice, they get a prepared meal.", "Nta. They are asking for a restaurant experience without a price tag. \" Hey guys I appreciate that you enjoy my cooking and I love cooking for you. I'm not asking you to pay me a salary just to help offset the cost of the ingredients and compensate for some of my time. Otherwise I won't be able to host these get gatherings as often. I know you can understand that. Let me know if we can do another dinner and I'll get you a coat breakdown.\"", "The ones bitching aint friends and dont respect you, fuck em off, and just cook for yourself and the ones who are happy to pay.", "Nta as much I like to cook, i wouldnt do it for free sinply bc the price of groceries is insane!", "\n\nNTA\n\nYou've did (or are doing) planning, shopping, cooking, decorating, cleaning and paying out of joy.\n\nNow some of them ask for the meals and you should still pay?\n\nWHO is greedy?!?!\n\nYou could open a kitchen club were everyone has to pay a decent amount of money ecerytime you cook or every month Except you because you have the work to do.\n\nBoah, the audacity of these people!", "They should be paying for the ingredients, etc., but not for the cooking itself unless they offer to do so.", "YTA because I think your request for money lacked tact, and it's a bit entitled to expect friends pay for your time cooking when you are the host of a friendly gathering.  It does make the gathering more transactional. That's annoying. \n\nWhy don't just say \" I'm thinking of cooking ____ next time,  but I need someone to get __ ___ and ____and if everyone could combine money for the meat\" \n\nInstead you are expecting them to pay for your time like a restaurant?", "[deleted]", "NTA\n\nThis aren't friends, this are users who try to take advantage of your kindness. \n\nJust tell them fine, you don't have to compensate me. But since i can't buy any groceries w/o money you either have to bring me the groceries (add a list here) or i can make you no-sausage with no-sauce and a not-there-side using everything you provided to make it - which is nothing. \n\nIf you don't set your foot down, they will soon start to demand you cook for them when they host parties or use you as a la carte chef. Don't let them take advantage of you. Your real friends will not have a problem with a small fee or providing you with the ingridients.\n\nThis so called friends will ruin your hobby for you - don't let them. I have seen this so often that someone has a talent and then \"friends\" start to take advantage of it till they stopped enjoyining it all together, bc the entitled so called friends even went so far to complain about the free stuff they got from them.", "If you're inviting them, then no ,  you shouldn't charge them. \n\nIf they are asking you to cook for them, then yes, they should pay. Why the hell would you just subsidise them? \n\nNTA", "True test to see who is taking advantage of who. Offer that maybe you don’t feel you can financially compensate for the meals anymore. Or start making subpar meals. If they balk indicate less than desirable ingredients. Pricing for food alga’s risen for the most part. There is nothing wrong with asking for a little help.", "NTA", "That would work. But there are other possibilities.\n\nIf you enjoy cooking (as i do, passionately), and their company, then agree, if they bring the ingredients. It’ll be like a Masterchef mystery box. There’s no reason this can’t be worked out in a fun and interesting way.\n\nOr start a pop up restaurant and go semi-professional, then everyone has to pay.", "NTA. Cooking isn’t cheap and asking them to pay for the food is the very least they could do.", "NTA. If anyones greedy it's your friends for expecting to get free food all the time.", "NTA…I sit here laughing out loud at the audacity of your friends entitlement.   They are  darn right it is a business transaction.  When they request that you take your time and effort and cost of food to provide for them, what do they think you should get in return?  Are they not even wanting to compensate you for the cost of your food?   A true friend would have no problem giving you money for providing them your service if a good, home cooked meal.  They do not want to pay for that service you provide?  Okey dokey.  Then they do not get that service.  You are worth what you provide.  Do not ever let anyone make you doubt that.", "NTA, they are taking advantage of OP. Who is buying the food by the way. Stop cooking for them. They ate very ungrateful.", "NTA.  It is one thing if you enjoy cooking and share your passion with your friends.  It is another thing entirely when they start requesting you to cook for them like it is a service.  If they have a problem with that, they aren't your friends and are just taking advantage of you", "NTA. Don't cook for them until they pay for the full cost of the entire meal.", "Info: how much are you charging.\n\nThere's a big difference btw cost of ingredients and \"acknowledging the effort\" you put in..... Where you bill all your time involved too. \n\nIf you can get a meal out for a similar price, yeah that may be pushing it (and I don't mean a nice place with drinks etc but literally a meal that's takeout but not McDonald's) - like I wouldn't really want to spend $30-70 for a meal eating in someone's home on a weekly basis ... \n\nI think you prob cap at kind of $10-20 unless it's like steak or lamb night...", "Nta, you can frame this for any skill. I'm an animator and if my friends asked me to animate something for them on the regular I'd either say no or frame it as a job. It take hrs to animate, on top of doing my own job, without compensation it would be a no from me. \n\nMy bro is a mechanic, if my friends asked him to keep their cars tip top for free he laugh in their faces. \n\nBut my friends wouldnt do that, why? Because they're good people who appreciate hard work. Your friends dont sound like good people.", "NTA but find better friends. These people are not your friends", "NTA.\n\nPlease come make food for me. There will be no issues with payment, I can guarantee that.", "If you invite them to your house for a meal you're cooking, or cooking for fun and choosing to share it, you can't charge. \n\n\nIf they are specifically asking you for food to save themselves time or hassle you absolutely can ask for a contribution to the costs incurred by you. They'd have to pay in a restaurant\n\nNTA", "I’m sorry - *you* are being greedy and taking advantage of your friendship? Uhm no, the choosing beggars who asks, but Won’t compensate, their friend for doing something nice for them *on a regular basis* are the ones taking advantage and being greedy. \n\nNTA, hold your ground, or they *will* start treating you like a free restaurant. Unless you offer or invite them for food, you should not be left with the bill and the workload. That’s how enjoying a hobby turns to be an annoying chore", "NTA. If they're the ones asking you to cook they should absolutely help cover the ingredients. They aren't free!", "NTA. If you're providing the ingredients as well as time and effort they need to give you money.", ">Lately, my friends have been requesting that I cook for them on a regular basis\n\nJust say \"no, ingredients are expensive. I can't afford to give you free meals\"\n\nProblem solved", "NTA- Cooking costs money! Do they buy the ingredients themselves? I bet they don’t! Do they provide/pay for the electricity to keep the food cold and out of the danger zone? Guessing no. Do they pay or provide the gas or electricity to cook the food? Don’t think so. What about cleaning up? Water, soap and sponge to clean up….they pay for that or help out? Another No? \nHow is it that you are being “greedy”? If these people don’t pay you to break even, these are not your friends. Even then, this will get old fast and you will get burnt out. Cooking won’t be fun.", "INFO Are there multiple situations here? As others have said, if you're making them requested  meals and dropping them off, then yes absolutely at this point you are right to ask for compensation. But if this is food you're having at \"gatherings\" then it's more complicated.", "Gifts are meant to be given freely, without obligation, let or lien.\nBut asking for a favor is not the same as receiving a gift. They're trying to take advantage of you and your labour, and that's not okay. I'd stop cooking for them, OP. They don't value your time, your finances, your effort or labour, they definitely shouldn't benefit from it.\nBut if you want a compromise, ask them to at least buy the ingredients ts and drop them of at your place for the meal. If they say no, you'll definitely know they were in it for a free meal.", "NTA. Ask them, \"If I'm greedy, what are you?\"", ">some of my friends are now upset and accusing me of being greedy and taking advantage of our friendship. \n\nYour friends are being greedy and taking advantage of your friendship.  \n\nNTA, OP, but your friends sure are.", "NTA.  Either they buy the food so you can cook or they pay the small fee. \"Lately, my friends have been requesting that I cook for them on a regular basis\" means they like the food and they should be willing to pay for it. \n\nI would block all the ones who are complaining and tell the others what the cost will be  before you start cooking.  They are using you for your skills and food. That is not a friend.", "NTA I have this exact arrangement with my own mother. She's a great cook, and I hate cooking. I'm happy to pay her to cook me up some nice meals, last one was a big batch of spaghetti that lasted me most of the week.", "NTA. Cooking takes time and effort. For years, my grandma would make my parents lunch Monday to Friday (she said they were too tired after work an they shouldn't spend more time cooking, she had free time and could) and they always bought the ingredients she said she needed.\n\nYour friends are trying to take advantage of you; unless you charge them (which will probably be less expensive than takeout), all they're doing is saving up on groceries while you spend that money and time.", "Just sound like your mates expect a free meal...bottom line is you have paid for them ingredients so it's totally exceptible to charge them, I make edibles my self and had similar issue with a few mates...I took some edibles to a party to share out as yiu do at a party , we'll a few from the party enjoyed them and ask If they could put an order I. Yeah sure no problem well they had a tantrum because I'd told them I want £5 each well it didn't go down well they were mad that I gave out for free at a party but won't let them make order for free...we don't talk any more pathetic", "NTA. Can i have you as a friend?", "Nta - your friends are “greedy” because they expect you to buy the food, prepare the food and give them the food.", "Couple questions\n\n1. When your friends come over do they bring anything? Bottle of wine, appetizer, dessert?\n\n2. Do they offer to pick up ingredients or whatever is needed before they come over\n\n3. Do they reciprocate the dinner? Invite you over to theirs or to take you out for a meal if they don’t cook\n\n4. Did they offer to pick up any of the above early on in the cooking and did you tell them not to worry about it/no need?\n\nIf the answer is no to all the above then I think you are in the right to ask for help with the food costs, personally I don’t like the idea of time, these are your friends and you are hanging out with them, if you don’t like the hang say no or let’s do something else\n\nNTA but I would in the future give my pals a list of ingredients and throw in a bottle of wine that way you are sharing the cost of the food you are all eating and the bottle of wine is a nice add on to say thank you for the effort of cooking", "Isn't it funny how people who are absolutely taking advantage of someone, will always accuse that person of taking advantage of THEM, when their target tries to set perfectly reasonable boundaries.  \n\n\nNTA  \nHobby or not, you are not obligated to pay for other peoples food.", "Look at this from a creative's POV - The moment people recognize talent within their friend/family, the people will either demand your talent for free or see your talent as good enough to pay for.\n\nI like chainmail. I've given things like bracelets away to friends when I felt like it.\n\nHowever, when a previous friend asked me to make a piece for a cosplay and said to do it \"as a favor\" without payment, I made sure that they never saw me give out anything to a friend ever again.\n\nEnjoy your talent. Make people pay for it unless *you* want to give them a freebie.\n\nNTA", "NTA. The minimum baseline should be they shop and you cook, they help you clean etc. since it's your home. You ain't running a soup kitchen for the homeless at your house.", "NTA, but if those are my friends, i would only charge for the ingredients, since those are out of your control. Real friends would offer to pay for the whole ingredients, so you can concentrate on just what you like to do: cooking. That should be agreed on before dinner takes place, not after. \n\nIf you actively invite them and charge them later, that would be an A move, though-", "My friends groups has someone like this; an amateur chef who makes amazing meals. He won’t take money, but we all know food is expensive so we all chip in for the ingredients and then we rotate the place so it’s not always at his place.", "I’m with OP. NTA. People that don’t cook elaborate meals don’t always realize the time, effort, and expense that goes into it. I used to have dinner parties at my house. For the less time and financially expensive meals, it wasn’t a big deal. For the ones that were more expensive, I’d let everyone know that if they could afford to pitch in some money, great. If not, they were still welcome. Most people pitched in $10-$20, which was fine.", "NTA and I wish I had a friend who would do this for me !  If they don’t feel they should pay a small amount they are not your friends.  I wouldn’t even be upset if my friend charged me full rate if their food was good", "What? They are literally the ones taking advantage of your friendship, asking for frequent free meals. The least they can do is kick in for ingredients. They are acting really entitled and dumb.", "NTA", "You are not the salvation army, you use your time and your money for it, NTA, definitely.", "Is there any reciprocation on the friends’ part? Do they also contribute things to the group that use an equitable amount time, skill, money, etc. in the “spirit of friendship”? \n\nThe main thing I see is that they ~requested~ more cooking from you. It’s one thing when it’s something you enjoy doing every once in a while on your own accord just to be nice. THAT would be in the spirit of friendship. But the nature of it changed when they requested more of your cooking. That’s when it became a service. How often do you prepare these meals? Do you do it a certain number of days a week? Or by request?\n\nWith the info shared, I’m leaning NTA. But it would be good to know if these friends do anything for the friend group that could be considered reciprocal effort.", "NTA\n\n>They claim that charging them diminishes the spirit of friendship and turns our gatherings into business transactions.\n\nI think it's perfectly reasonable if they always come to eat and treat you as their personal chef that there is some compensation. Specially since it was at their own request. Maybe they think it's too much? Since you aren't sharing how much you are charging it's hard to know. But if it's on a regular basis on their request the absolute minimum is paying for the ingredients and at least your part of the ingredients for the effort you are putting in.", "NTA. whenever one of my friends has cooked for me i’ve always offered payment or to buy sides / pay for ingredients, etc. and on top of that i usually provide some sort of host gift.", "Oh my god they’re not narcissists. Can we please stop using that word for anyone who is being inconsiderate? It’s trivializing.\n\nThey’re just plain ignorant, selfish, and greedy. Doesn’t help that OP is referring to it as a “fee” and referring to their friends finding it “delightful.”\n\nJust be upfront. \n\n“Listen, I love cooking for you guys sometimes, but it’s a lot of work and costs a lot of money. There’s a reason restaurants charge, and why my food more closely resembles what you would find in a restaurant. I wouldn’t expect you to knit me things for free just because you like knitting. I would want to compensate you and support you because I’m your friend. If you knitted me one thing once as a gift, I wouldn’t ask for monthly gifts for free afterwards. I don’t want to “charge” you for my cooking.. but it would be nice if, on evenings you expect me to cook you all a meal, you all pitched in for the cost. I don’t think that’s being unreasonable, and I feel taken advantage of otherwise. If that doesn’t seem reasonable to you, maybe we just do potlucks from here on out, and I’ll bring whatever dish I feel like making, and not feel pressure for it to be fancy or expensive or labour intensive.”\n\nIf they can’t handle that, just stop cooking for them. If they don’t want to hang out with you because of it, they were using you anyways and you need better friends.", "Yes, NTA, and a decent analysis, until the bold text.\n\nThis is the part where a person with experience of real courtrooms would strike your case out without even wasting the court's time on hearing the respondent's evidence, and then award costs to the respondents, on the basis that the burden of proof is on you, and you mistook your reddit post to be of value in assessing whether people have personality disorders.\n\nIt isn't. Expert evidence after in-person diagnosis is required. Not only have you never met these people, you have laughably insufficient material on which to base a diagnosis. And you aren't an expert. If you were an expert, you'd know that **this reddit diagnosis crap is absolutely fucking ridiculous, and it's harmful**.\n\nYeah, it's harmful. Ordinary people often can, and often do, behave poorly. Sending every other OP in this sub away with the impression that the asshole(s) in their AITA have personality disorders can encourage them to give up on relationships that might be relatively normal.\n\nGee, I wonder if there’s any correlation between narcissistic personality disorder and pretending to be an authority on personality disorders on reddit?\n\nLet’s see: “*Grandiose sense of self-importance*”? Check. “*Arrogant, haughty behavior, or attitudes*”? Check. “*Requiring excessive admiration*”? Check, for those just chasing upvotes. “*Being interpersonally exploitative*”? Check (giving advice about real people’s lives on the basis of fake expertise to get upvotes on reddit seems exploitative to me).\n\nThat’s 4 of the 9 diagnostic criteria in the DSM-5 met just from generalised profiling (with 5 required for diagnosis). Wow! I can’t match the other criteria like that, but I’m sure I could pull something out of my arse to ‘match’ at least one more criteria to specific redditors given a few comments to work with.\n\nWait–I’m sorry, I admit I didn’t first address the general criteria for personality disorders. Of course, I probably had to admit it, because I’m guessing you wouldn’t know either way?\n\nOh! Come to think of it, I also admit I should’ve checked whether you were using the Section II or Section III model. Or maybe you’re more of an ICD-11 type of armchair psychologist? Or maybe you’ve never read either?\n\nHmm, this is embarrassing... I quoted from the DSM-5, not the DSM-5-TR. Eh. I think it’s okay, because I’m pretty damn sure they didn’t replace the DSM-5 text with ‘*If you’ve watched some Doctor Ramani videos (or similar) on YouTube, you can diagnose people with narcissistic personality disorder on the basis of a reddit AITA.*’. That would just be stupid. Right?\n\nNo doubt anyone tempted to downvote me for this will know that “*Vulnerability in self-esteem makes individuals with narcissistic personality disorder very sensitive to \"injury\" from criticism or defeat. ... They may react with disdain, rage, or defiant counterattack.*\" So, react away, I guess.\n\nThe above quote is, of course, an associated feature supporting diagnosis, rather than one of the diagnostic criteria. But you don’t know the difference, do you. Or do you? If you don’t know, you shouldn’t be making these reddit diagnoses. But if you DO know… you *still* shouldn’t be making these diagnoses, because it’s the kind of behaviour that psychologists consider unsound and unethical.\n\nJust stop, reddit. Stop upvoting this harmful garbage.\n\n(I credit icze4r for an otherwise stylish comment. Just drop the psychology)", "Lol doink donk is what I’m gonna hear now every time I think of a gavel", "There is literally a children’s story, the red hen, about this", "I agree, I absolutely fucking love bartending, but I would never ever do it for free besides for a friend or two. Not for a bunch. OP is NTA and deserves payment\n\nETA: it’s still fucking stupid and harmful to call them narcissistic. They are just dumb. Let’s stop throwing around words like narcissistic so easily please", "I agree with this except saying they are narcissists not EVERYONE is a narcissist, some people just suck.", "And have any of these so-called friends gone grocery shopping lately and seen the prices of food?! I think the \"delightful change from their usual routine\" is that they don't have to *pay* for dinners out anymore.", "Even if you cook and invite them, you can tell them \"look, I enjoy doing this but it gets expensive. If you could help chip in for ingredients, I'll be able to do it more often.\" Add long as it's communicated up front.", "Does it matter which it is? The friends are requesting that he cook for them. Why does it matter if the friends come to his place to eat?", "> Lately, my friends have been requesting that I cook for them on a regular basis\n\nParagraph 2, sentence 1.", ">So tell them you choose to cook only when you want.\n\nThis. Feeling like an obligated resentful doormat will take the joy out of doing it even if the costs are covered.\n\n OP needs to create boundaries.  Say no to these requests and practice your hobby if and when it works for you and makes you happy.", "Go back and reread the post. The OPs friends were straight up demanding that she cook for them for free ON A REGULAR BASIS - that's not \"inviting people over and then asking for money\"..\n\nIn my world, even if I get an invite for dinner, I always ask if there is something I can make/bring, and even if my host says no, I pick up a gift - a bottle of wine or some flowers, or something else they'd enjoy, as a thank you for the work and expense.\n\nAn old friend of mine used to host a NYE party where everyone brought their own lobster (and whatever booze/drink they liked) and he'd make all the sides and cook the lobsters.\n\nNot one person ever arrived without some additional contribution to the party. \n\nBut I guess we were raised with a different attitude....", "You really need to reread the original post.\n\nThe OPs friends are literally demanding that they cook for them on a regular basis - for free.\n\nThat's not even within a train ride to \"inviting friends over and expecting them to pay\".", "Damn that's wild. How can I find that one?", "Where can I read that one?", "Link please !", "I wish that term wasn’t so freely used, I was in a relationship with a real narcissist, what OP described isn’t it.", "Thank you for showing a bit of sanity. I saw that comment when it had about 7 upvotes. There were a lot of comments before it chronologically, and several with a few more upvotes, but I knew it was gonna get 100s of upvotes and top comment.\n\nreddit AITA just can't get enough of confident-sounding yet utterly ignorant comments about narcissism.\n\n(I still credit icze4r for an otherwise stylish comment)", "100% agree. It's perfectly normal for there to be some friction within a group while transitioning from getting free dinners to having to pay for them. Just let everyone adjust and it'll be fine. I've had the same arrangement with friends who owned restaurants. They can cater paries, but you can't take advantage of them.\n\n\nHowever, I'm curious about how much the \"fee\" is. If it's something simple like $5 per person, then I think this will all blow over with better communication and time. If OP is trying to put together an itemized accounting for every item used to make dinner, plus get paid minimum wage for the labor, then I would be closer to siding with the friends. You shouldn't put a price on friendship. I think it's rude to try to turn a profit in this scenario.", "Maybe I am too Dutch, but I don't understand Americans complaining to pay for food? For our dnd sessions, I but and cook food and the others always pay for their share. And it is but restaurant quality, just comfort food. When we have a BBQ party, everyone brings something of equal value (so not just leaving the host with all the expensive meat while others just being drinks or a side dish) or I will just buy everything and everyone just pays their fair share. And yes,y friends also offer to help with clean up!\n\nAnd if someone doesn't feel like having a BBQ party, that's fine. But a party is not for the host e everyone is enjoying their time! It never is a transaction, we just all have the common sense to pay for our own?\n\nIf I invite someone to go to a cafe, do you pay for your friend's beer?", "It doesn't imply they have demanded anything, it says they requested it", "[Here it is!](https://www.reddit.com/r/AmItheAsshole/comments/achoyx/aita_for_very_rarelyalmost_never_wanting_to_go_to/?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=2)", " the early part of your post reads like you’re meal prepping for them, giving them meals to eat at their leisure. The latter part reads like you’re hosting some meals for the group at ‘gatherings’. Which is it?", "Haha!  Good analogy.", "[Right here!](https://www.reddit.com/r/AmItheAsshole/comments/achoyx/aita_for_very_rarelyalmost_never_wanting_to_go_to/?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=2)", "[Here ya go!](https://www.reddit.com/r/AmItheAsshole/comments/achoyx/aita_for_very_rarelyalmost_never_wanting_to_go_to/?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=2)", "Yep. Same.", "Yeah, reddit AITA is wild for misinformation about narcissism. I guess it's frustrating to see it trivialised if it's something you've lived through with a partner. My take was it's harmful to OPs, and in general, for every other AITA asshole to be labelled like that (see my comment replying to icze4r).", "Spot on. You articulated how I felt but couldn’t sum up. Something about OP’s phrasing made me want more info.", "Funnily enough, I live in the Netherlands and whilst I laugh a lot a Dutchies sending tikkies at the end of the evening for a few euros, I completely understand what you're saying. Americans really do seem to have a culture whereby if you invite someone to eat or drink, that you're expected to pay for everything. It's very strange and I can't imagine expecting other people to just pay for me.", "I'm American and in my friend groups either everyone brings food to share, or one person buys & everyone else contributes money. If it's a group that meets regularly we might rotate the person who hosts & pays rather than having to settle up each time. We work it out depending on the situation and what seems fair. \n\nExpecting the same person to always cook & pay for the food is insane.", "Thanks and holy shit!! I've never wanted to knock some sense into someone more! And dear god I don't want to hear the words Olive Garden or casserole for a very long time. That guy deserves McDonald's cheeseburgers for every meal.", "[removed]", "Right, so disgusting.", "NTA Hand your friends the list of ingredients\n\nthat you will need along with what meats go with it.\n\nLet them know money doesn't grow on trees.", "What do they “enjoy doing” that there happy “to share with friends” to the same extent they believe you should share.", "NTA. I have a friend/coworker who started doing the same thing, only she did treat it like a business. Rotating dinners for a family of 2, or more. This was 15 years ago. Her food was so good and popular that she quit doing nails and started doing that full time. It morphed into catering and now a super popular local restaurant. Groceries don’t buy themselves and your friends are entitled assholes who need to get soup nazied.", "Fake", "NTA \nThere’s no such thing as free lunch", "NTA but you need to stop immediately.  Charging anything for cooked food puts you under health department scrutiny, kitchen inspections, permits, etc. even if you're \"just covering grocery cost\".\n\nIf you want to continue this little endeavor as a favor to your friends, ask your friends to buy enough ingredients for the two of you (or the group), bring the ingredients to your place, and then you cook enough for the group to eat.", "If you all ordered take out, everyone would be expected to chip in for the cost of their food. Why is it suddenly not okay when you make the food at home to have them chip in for the cost of their meal?\n\nSure, if everyone is doing well financially, the host might just pay, but I have friends who all have to budget, and it is normal for us to expect to pay for our own meals at gatherings.\n\nNTA", "Are you a food bank?", "Making the odd meal for a friend to be nice or as a favour for a favour (ie they do something for you in return is fine) expecting you to give up your time and money on a regular basis is not. I may be good at ironing shirts doesn’t mean I want to do it for free for my friends and family", "Absolutely NTA. I do this for my friends and sometimes, especially if the cost of ingredients is lower, I’ll cover it, but if I’m making seafood/steak/sushi, etc, I absolutely ask them to help me cover the cost of the ingredients. They’re mad they’re not getting a free meal… you’re not a soup kitchen", "They’re taking advantage of your friendship. They were the ones who claimed that you’re restaurant quality. Well, restaurant quality food comes with a cost. They can get over themselves. They aren’t obligated by any means in buying/eating your food. You are NTA.", "NTA, typically when being called greedy the person stating it isn't getting what they want and has nothing to do with your character.", "NTA.  Why should you spend your hard earned money and time in these moochers?   Get new friends.", "NTA. Unless you all take turns cooking, they are the ones who want to take advantage of your cooking, not the other way around. They really expect you to do all this for free, just because you like cooking? You’re paying for the ingredients, the electricity and gas costs, and you are investing your time in preparing and cooking.\n\nBefore we had kids, I used to regularly cook for all my single male friends, too. But usually, this was compensated in some way. One of them had dinner with us every Tuesday in exchange for driving my husband to their roleplaying sessions for free afterwards. Others would catsit for free when we were on holiday, or do chores in our house, etc. Or otherwise, they’d bring us a gift.", "NTA in general\n\nOur society makes everybody fucking weird about money, and not always in the same ways. I don't think that means we need to assume your friends are all predatory monsters.\n\nTalk to them about it, explain that you enjoy doing it, but you can't afford to feed them as often they want. If they want to contribute towards the costs, you can do it more often, otherwise they have to just accept it when you feel  up to that generosity", "They are not your friends.  Should you let them all move in so you can support them fully?  They are your FRIENDS and would damage the friendship if you charged them rent and expenses.", "INFO: How much are you charging?", "NTA for setting this boundary. Cooking for a large group of people for free on a regular basis sounds expensive and exhausting. \n\nHopefully you have a good group of friends who will be a little more understanding with some communication. Remind them that while you do enjoy cooking it is costly and you can only do it regularly with some compensation to cover the costs and labour. Doesn’t even have to be money could be something as simple as bringing drinks, dessert, supplying some ingredients, cleaning up after … etc.", "NTA. Tell them that then you can all go to a restaurant and that’s it. You cook for you.", "I'm not sure if TA or not, but one way you can go about this is that if they request for you to cook, give them a shopping list.  They buy the ingredients and you cook seems fair.", "NTA.. and you NEED to find new friends. They just want to use you for free food. They don’t appreciate your time and effort as well as your grocery bill. I am sure when time comes,they will want you to do free catering and will get upset if you say no.. so choose the people who you want to keep close carefully.", "NTA. Your friends are lucky to have delicious homemade meals! They should appreciate your hard work and chip in for ingredients.", "I absolutely love cooking, my friend, not so much… She loves doing laundry, I can’t stand it. I will come over to her house. She will do my laundry, she buys the ingredients and I cook, and she keeps the leftovers. It works out amazingly.", "NTA.", "Am a very good Cook. Homemade french, Italia, mexican and japanese food. But i'm not rich so when i invite my Friends they all pitch in for ingredients or bring good wine or an expensive dessert. My gift to them is choosing and buying, then cooking.", "Your friends that are advising you are the greedy ones, taking advantage of you. NTA", "NTA. Your friends are the ones taking advantage of the friendship. I wish your friends offered to buy ingredients since inflation is crazy!", "NTA: if they are personally *requesting* it, than you deserve to be compensated as you see fit.", "I would charge those complaining double the amount of the rest, just to spite them, if they don't want to pay for your efforts they don't deserve to eat your food, you're not a charity, NTA", "NTA, they want to take advantage of you. Drop them.", "You’re definitely NTA - perhaps they can buy all of the ingredients and you can occasionally cook when you have time, maybe at their places? At least you then get fed for ‘free’, even though you’d still be doing the work. \n\nDo your friends wash up and help in other ways?", "Question: It sounds like these are gatherings where you cook for a bunch of people. Are you doing this only at their request, or are you the one inviting people to share the food you cook? Do they know ahead of time they will be expected to contribute money to the meal?", "So basically you created a small supper club for your friends. It's common sense to pay a small fee in such gatherings - especially if it's always the same person hosting and cooking.\n\nOffer your friends that if they don't like to pay, they could host the next round and cook for everyone else as you do.\n\nNTA.", ">on a regular basis\n\nJust curious what this is- once a week, once a month? And does anyone else cook?\n\nWith this in mind, your \"friends\" still sound like ~~narcissistic~~ asshats. I would just not cook for them anymore.", "Your friends who don't want to pay are TA's.  They sb compensating you at least for the ingredients.  Cooking can be expensive & it's not fair of them to put all of the financial burden on you.  Keep charging for your meals, & if they don't want to pay, then don't do the work. NTA.", "NTA. There are other ways around this though if you do want to keep the friendships. People bring a different ingredient each, some wine to go with the dinner. Is someone particularly good at desserts, could they bring one of those? Like I love cooking and when I do my friends just pitch in with all of the above or something else as well.", "NTA. I would never « charge » my friends for my cooking BUT if I was always the one cooking, I would talk to my friends about either contributing a dish or taking turns or at the very least « let’s share the cost ». \n\nI love to cook and especially for friends, but if I was the only paying for the ingredients, and it was a frequent thing, I’d certainly say something.", "“You’re providing me with a service that you LIKE doing, so you should keep giving me free stuff!” \n\nLOL, NTA. They’re just mad because you won’t let them take advantage of your services anymore. Reminds me of entitled family members who expect a discount because “they’re family”.", "say you'll agree to cook if they bring all the ingredients including the wine. or make a grocery delivery list for one of these meals and show them the bill. \n\nor get better friends", "In the Midwest (USA) this is a fairly common thing to many, I buy plates maybe once every 2-3 weeks from the 3 people I know who sell. A person who enjoys cooking and serving others but doesn’t want to own a business and wants to be able to be completely on their own schedule. So they sell “plates”; they cook up a meal and then post their menus in group texts or socials and people who are interested show up with cash in hand and buy a plate of the meal. Charging for these plates is what allows the person to continue to do this so they can put the money towards the next menu. What your doing, and asking to be paid for it, is common place. Your friends are AHs for not wanting to pay. What they really want is free restaurant quality food and for you to foot the bill. Your NTA, best of luck!", "My general rule is “Sure, I’ll cook if you buy the ingredients and do the dishes,” but your “friends” seem well past that kind of courtesy. Please find better friends.", "NTA\n\nJust as a courtesy, I would make sure you're clear when they request the meal that you'll be charging them, and how much you'll be charging them (rather than waiting until you give them the food), but, other than that, you're totally in the clear.", "Definitely NTA but a small question did the op experiment really badly on the fiends who now think that they were made Guinea pigs and now they can reap the rewards \nEven if that’s the case you should definitely not be taken advantage of but that’s the only defense I see here for the friends to act like that", "NTA\n\nThey want to eat for free. \n\nAt your expense. \n\nNo.", "You need new friends. They are abusing your friendship. They are asking you to make their meals. They are greedy and manipulative. \n\nThey are not friends.\n\nNTA", "NTA... food is expensive, I'd happily compensate costs for meals. If it cost too much, I wouldnt participate. They are taking advantage of you, that's just rude.", "NTA - they are asking you to cook. If you were insisting on them eating your meals and holding them hostage for money afterwards, you'd be the asshole.", "My friends always ask to share grocery cost when I cook for them…", "At first, I thought you invite them to dinner, and then want to charge them.   but - being asked to cook for them while supplying ingredients?   That's catering, and that absolutely warrants a fee.\n\nA friend of mine, excellent cook, basically traded cooking for tutoring/ghost writing when I helped her with her college courses.   Struck me as a good deal.\n\nNTA", "NTA just make sure that you are being very upfront and let everyone know they come to eat.", "NTA.\nMy friend is passionate about baking and is really good at it. I ask her to make cakes for bigger events (baby shower or birthdays). I always offer to pay. Depending on the event it may be her gift to me or I pay for ingredients minimum. They are asking you to cook. You're not just inviting people over on a set day. They need to pay. This sounds like an amazing service I'd pay for", "Don't call it a \"fee\", or \"paying\", or \"charging\". Call it \"chipping in.\" Then they'll realize they don't have a leg to stand on, unless they are complete blind AHs.\n\n(Actually that would have worked if you'd led with it, but now that they've gotten the idea into their heads that you're \"charging\" them, you might have to backtrack and plunk the receipt for the ingredients down in front of them. If the math comes out showing their contributions cover more than just the ingredients, calculate how many hours you spend and divide the leftover money by that, & then your line is \"You're saying $1 \\[or whatever\\] is *taking advantage?*\")\n\nNTA", "NTA. You're not their private chef- unless they're willing to pay for your time, expenses, and labour.", "Damn these AI generated posts. YTA jist for that.", "NTA", "So they want you to be a free personal chef? NTA that’s nuts and so entitled.", "NTA", "I'm going to be honest, the way you've phrased all this seems like you could be on the spectrum. If that's the case, and there is nothing wrong with that, there may be a misunderstanding here.\n\nI can definitely see you inviting them over for dinner and your friends saying \"This is delicious! You should do this more often.\" and if you're not neurotypical, you might view this as a more formal request than they intended. Then when you invite them back over to eat the dinner they \"requested\" they are totally not expecting this to be a financial exchange.\n\nRegardless, NTA. But I don't necessarily think they are either. This all could be a misunderstanding.", "The important question to ask before the verdict is: \n\nHow often are you cooking for them ?\n\nIf it’s once in a while then YTA\n\nIf it’s frequently then you’re NTA and they are TAs", "NTA. Real friends would be lining up to shove money your way to support your hobbies", "NTA\n\nPeople cook for friends because in general it is reciprocated in some way.\n\nThis is not just for cooking but in general, good friends in a functional relationship don't use each other. It is not that a good relationship is \"transactional\" and tit for tat. Once you start wondering and feeling used by people, you should trust your instincts because you ARE being used.\n\nOn the most basic level, most people don't feel used when they split checks with their friends because it works out. When you start feeling like someone is abusing the check splitting it is because they are - either because they order disproportionately OR because they are selective in terms of whether checks should be evenly divided or only pay for own food and drink - depending on which way is better for them.\n\nEven if friends don't cook, they can still take OP out to dinner or in some way express their appreciation.\n\nThe least they can do is actually pay for the ingredients. I used to eat at a friend's house very frequently because they had a great outdoor kitchen. I would always bring dessert because I baked and generally also some kind of side dish that traveled well.\n\nI continue to be surprised that so many people seem to not trust their gut in terms of realizing their friends (or family) are exploiting them. In general if you feel exploited, you are being exploited", "NTA\n\nWhat a load of crap. These freeloaders need to understand your ingredients, time, and equipment aren't free. Your and your life aren't responsible for feeding them.\n\nGet new friends who understand that.", "Definitely NTA. They are the one taking advantage of your friendship by mooching your food.", "NTA. My friend is just like you. We split bills with the groceries, and labor after among friends", "NTA. Someone broke it down perfectly so I won't do the same. But let's see here, why do your friends feel entitled to both your energy and food? If they'd offer to buy the groceries each time because you're cooking for multiple people then that would make this a little more fair. This would the equivalent of you always paying for their meals out because you have the money and enjoy going to nice places. Either they pay for something or don't cook for them at all. How is it greedy to want to be compensated for your time and ingredients? You'd be saving them both time and money. How is that fair?", "NTA. Bear with me here. I cook at a larp. I played that larp before hand, and cooked for my friends at that game. When I shifted over to supporting the whole game, my friends agreed that while us doing meals that I cooked for free was great before, I'm right to start charging. And they're happy to pay, they eat more now than they did before. They still have the option to bring their own food. But you have a right to not go into debt feeding people that say their your friends.", "NTA- i'm not into cooking, but I have had 'friends' in the past try to take advantage of my hobbies. according to them because I enjoy knitting, I should make them a sweater or socks or a bag for free. I'm going to be knitting anyway, I might as well make something for them. these people are no longer a part of my life, and my life is better for it.  Just because you enjoy doing something doesn't mean your 'friends' are entitled to it.", "NTA, and the \"friends\" seem rather entitled selfish leeches.\n\nIt should be without any question that they should AT LEAST chip in for the ingredients. To expect you to feed them with your restaurant-quality food FOR FREE is beyond the pale. I'd stop giving them ANYTHING the very moment they tried to argue with their BS.", "NTA. “I know you enjoy tinkering with cars, so here’s mine for an oil and lube.  Free.” They wouldn’t say that to you; it’s just the same as food. \n\nDon’t give this another thought.  \n\n“Friends, you have inspired me to balance my budget by making me consider what this is costing me. I’m becoming a personal chef! I’m going to handle this responsibly with fairness to everyone. Here’s my price list and order info.”", "If you invite people to a dinner party and aren’t asking them to bring dishes because you’re cooking, I would expect them to bring a bottle or chocolates or some other form of appreciation for your efforts, but wouldn’t expect you to charge them. But I don’t get the impression that’s what’s happening here. \n\nThe appropriate follow up from those guests would then be to offer to host next time and the same would apply.\n\nIf instead those guests say they loved your food so much they’d like you to make more for them to take away or collect later, then you are doing extra cooking for no benefit, using your own time and your own resources. It is entirely appropriate to ask for some level of recompense for the cost of food, the cost of obtaining the food (fuel usage in your car), the cost of cooking the food (gas or electricity) and your time.\n\nIn short it shouldn’t cost you money for them to eat a meal you aren’t sharing and where reciprocal invitations aren’t likely to be forthcoming. NTA.", "NTA. They WANTED you and ASKED you to cook for them more often because they enjoy your cooking. You're not a free soup kitchen and some of your friends just don't want to pay for a restaurant meal in an actual restaurant so they gravitate your way. \n\nIf you were inviting them over constantly then I might see the point of 'some' of them, but they've made a suggestion to make it a regular thing, not you, so basically they invited themselves. That is totally different than you being a willing, occasional hostess that cooks for everyone for free. You agreed, but you weren't the one that brought it up.", "These are users wtf", "They’re *requesting* that you cook for them. Of course it’s fine to ask them to pay. You’re not throwing a party and passing the hat around.", "NTA. \n\nI can see being uncomfortable with paying a friend to cook for a get-together as a straightforward transaction, and even if they agreed it could turn into a bad dynamic, where they feel like you’re their employee now and act even more entitled. \n\nIf you otherwise value the relationships, maybe an alternative is to request that, instead of it all being on you, who hosts the get-togethers needs to rotate, with the host responsible for either cooking or providing carryout for the group. That way, you’re getting a free meal and a night off from every person you’re cooking for, without any money directly changing hands, and you’ll be back to a reasonable level of cooking/hosting that you might find more enjoyable. \n\nI do something similar for game nights, and while the money is never necessarily even, it’s a lot of fun trying other people’s favorites, and a lot easier than calculating what people owe each time.", "They are damaging the \"spirit of friendship\" by mooching off you and expecting you to buy the groceries, do the cooking and serve them. If they were real friends they would at least be chipping in for the groceries and helping out in some way with the meal. NTA", "I'm a decent cook, and all of my friends either offer to pitch in for groceries, or bring something to pitch in. Some bring wine, some being desserts or sides, etc. \n\nI guess I'm just lucky that my friends are a bit more considerate than yours.", "NTA, your friends should pay up and apologize for taking advantage of you. Their behavior is unacceptable", "Nta. They are asking you for free food and free labor. They are the ones trying to take advantage. It’d be different if you were inviting them over for dinners and then trying to charge them but this is not the case.", "What? Do they work on your car for free? Do your hair fir free? \n\nThis is a pretty bs way for your friends to let you know they are using you.", "NTA. Stop cooking for them. Simple fix. \"Sorry, my budget doesn't account for the extra groceries.\"", "NTA.  You've been a lovely friend to them, but unfortunately they're not being lovely back.  They're starting to suck the fun out of your dinners, and they're making what used to be an enjoyable experience for you feel like work.  You are generous with your time and skills, and there's nothing wrong with needing, at minimum, to be compensated with a portion of the monetary costs that you incur every time you invite them over.  \n\nIn lieu of making it into a full-fledged business, you might want to just consider turning it into a more official supper club once or twice a month.  Send out invites, specify a flat fee for attendance, and that way, you'll end up with a group of people who are excited to shell out a bit of cash to compensate you for your time, efforts, and costs of ingredients.", "What we do is whoever cooks, the others bring something else to the occasion like drinks for example. Only a few of us cook, so we alternate and everyone attending pitches in for something.", "NTA. Paying for a coffee run without keeping score is in the spirit of friendship when it's reciprocated. When was the last time any of your friends treated the rest of the group to a meal?", "NTA - my friend is an amazing baker. If I request a cake from her, I pay for it. If she shows up at my doorstep with random cupcakes because she wanted to gift me them, then I don't pay for them.", "Did you tell them ahead of time you would be charging? Is it at cost?", "NTA! \n\nIf they were TRUE friends they would have NO problem with compensating you so you can move up and keep going. They just want free, good food. \n\nDon't let them bully you into resending the request for compensation. If you were my friend I would be paying you for the actual food ingredients and tip you for your time and effort", "NTA\n\nThis argument is on it's head.\n\nYour friends who are complaining are _themselves_ turning your relationship into a business transaction _and_ being greedy.\n\n_They_ want _your_ product here for free, on the basis of just being your friends - so perhaps you need to see what they enjoy and start getting that for free too?\n\nGood god, find new friends.", "When I make a nice seafood alfredo from scratch for my girlfriend the entire meal will cost about $65, and that not including any drinks or anything! That will leave about one portion as a leftover if we're not starving, and about 50% of the ingredients will have about 50% left. \n\nSo yeah, if you have people ASKING you to cook for them they should 100% be pitching in. Even when I had roommates I would sometimes offer to cook for everyone, but you better be damn sure I'd collect money from them first.\n\nNTA.", "If you substitute food for any other product,  it would be insane to leech off your friends.\n\nBut I suppose people do that all the time.\n\nI made my friends go with me to pick out yarn for the blanket they wanted. Mostly because they bitched about Etsy prices... then they saw the yarn they liked being $10/each and it takes like 10 to make a blanket the size they want.\n\nAnd I made a point to only crochet when they were around so then they saw how much time actually goes into it...", "This and from now on instead of charging have them divy up the groceries needed amongst themselves and deliver to you prior to cook day and then everyone can say they all participated.  Also make them rotate out 1 at a time helping you cook.", "This is a great response!\n\nI'd offer the cheap narcissist another option too. You can host, but I need you to stock the kitchen with xxx ingredients. Then they can see what these dinners cost you, but still charge the others for your time too!", "OP, another thing to be careful about is often when you start charging for a product/service, you start getting caught up in related regulations like food safety requirements.", "Do they bring anything to you? Wine? Snacks? Dessert?? Do they do any hosting themselves??", "Not just working for no comp. The friends seem to expect OP to cover the cost of the food as well.", "Especially in today's economy. It is hard enough for most people to afford to feed themselves let alone all their greedy friends. They requested you cook for them, you requested a small fee to do this. They don't want to pay. They expect you to feed them for free. Do they think all the food and ingredients to make these meals just happen to appear in your fridge and cabinets? What about the money and time shopping for the ingredients and the preparation. just wow. NTA", "This post says it all.  NTA.", "I also think it's relevant that the \"friends have been requesting that I cook for them on a regular basis\", as opposed to OP offering to cook. They sound greedy", "Being inconsiderate and selfish and not seeing how your behavior affects others is a far cry from being a narcissist which is a medical term. You're not a doctor. Stop doing this shit on Reddit", "It doesn't matter if there's no reciprocity what so ever. \n \nThe only difference would be between an OP that only ever wants to host themselves and doesn't let other reciprocate, VS an OP that is pressured into always hosting and they never offer to reciprocate or help.", "There is this weird mentality that if you enjoy doing something you shouldn't be properly paid or compensated for it. This is absolutely bizarre to me, by this logic people should only be paid for jobs that they hate. The more you hate it the more money you make, wouldn't that be awful? \n\nIt's one of the big issues artists face. Somehow our time and effort is not valuable because we don't hate doing the thing people want us to do for them for free. \n\nOp, you are NTA. Until joy becomes an accepted method of payment at the grocery store people need to compensate you for you time and money spent.", ">so how much are you charging?\n\nI think this is the biggest factor. Is OP just covering groceries? Coming out a couple dollars on top? Or trying to pay the rent?", "INFO: how did you tell them you were expecting compensation? Did you ask them for money before or after you had already cooked for them? \n\nI think that’s also important too. I bake…a lot. I don’t like charging my friends so we have a barter system of sorts. Makes them feel better and saves me money in the long run.", "Another good idea! \"Yes, I enjoy cooking but I don't like driving to the stores, grocery shopping,  or spending money so just pick these things up and be sure to drop them off by 2:00 if you want dinner.\"", "This is a genuinely good option for OP, if they can afford it and are open to it. Barter can be excellent way for everyone to get something they want. But I gather these friends aren't inclined to agree.", "We usually do \"bring your own meat to grill\" and provide the sides (even with just family) but even so, everyone brings some kind of contribution, even if it's just a personal little gift for our host, something we know they'd enjoy. Flowers, a book, a dvd they've expressed interest in watching....", "What a pointless question that is completely irrelevant to this sub", "That’s nuts. \n\nMy wife can out cook any meal we can afford to buy. She can also out cook me with her eyes closed. I still take my turn cooking, because she shouldn’t have to cook every night. And we still go out occasionally, so someone else can take care of the cooking and cleaning. \n\nAs to the OP, NTA. My wife ends up in a similar space. It takes her a decent amount of time and no small amount of ingredients to cook. It would break the family budget entirely if we took over cooking for anybody else.", "I remember this one 💀", "omg yes, I remember that guy! I hope his ex went on to find someone lovely.", "OP - This is well stated.  \\^\\^\\^\n\nIf they do not want to financially pitch-in (pay) for frequent, expensive, time-consuming meals - then just do a pot luck\" meal.\n\nIf they like to work on cars - will they change your oil for free?  New brakes for free?\n\nThe friendship relationship is unbalanced.  What \"diminishes our friendship\" is them expecting you to bear a heavier burden that you want to bear.", "My bro is a mechanic, if my friends asked him to keep their cars tip top for free he laugh in their faces.", "\"There’s a reason restaurants charge\"\n\nI'd leave this part out, though, as it confuses the picture in ways that may be unhelpful in getting the message across. Restaurants don't just charge to cover ingredient and labour costs; they're businesses, so they're out to provide a livelihood and (potentially) a profit. I assume OP isn't trying to do that.", "My extended family finds and hires a personal chef every time we have a family reunion..", " I can't afford to give you free meals..", "Yeah, if it was a one time thing then fair enough the host would probably pay for groceries as they're the one inviting people round but if it's a regular thing, which it appears to be here, I'd 100% expect to chip in for groceries at a minimum.", "Yep. If OP was inviting people round unprompted that would be one thing (though in my friend group at least we'd definitely reimburse for groceries if it was gonna be a regular thing). But the friends are the ones asking OP to cook for them, they 100% should be compensating OP for their time/effort and expenses.", "I think it’s pretty telling that OP didn’t disclose the “small fee,” won’t answer questions about it, and wrote this in the post:\n\n> I believe that my time, effort, and ingredients should be compensated for, just like any professional service. I am not trying to turn it into a full-fledged business, but charging a reasonable amount helps cover the costs and acknowledges the effort I put in.", "I'm not sure where you find my different attitude. I know it's common courtesy to bring something for the communal meal. Duh ? \n\nOP doesn't seem to think that. \n\nOp is unclear on the arrangement actually. The friends are requesting cooking on a \"regular basis\"--unclear what that is--- while also OP claims he is requesting this at their gatherings. Ie \"gathering more transactional\" \n\nIt doesn't sound like he's preparing take-away weekly meal-prep or short order cooking.  & it's unclear what their current protocol is for communal meal gatherings. However it does sound like they are all invited over to his house for this. \n\nIt seems like he is asking them to be his only customers in an unauthorized home-based restaurant.  Which I don't think they are requesting. \n\nIf the meal has become more expensive than their offerings, OP needs to develop some tact in asking for the stuff he needs  ( like BYOlobster)", "I've a friend who cooks on that level.  And, yeah, it takes her a full day to produce the meal, but -the Keg at home?  sign me up.\n\nThose meals aren't cheap.\n\nI get included,wheeee, because we are friends, and because whenever she needs something important written, I'm always available.   No issues cranking out an essay on Shakespeare or a psych paper if it gets me a steak dinner.", "I'll admit, that I let my betters run the kitchen. My wife felt she wasn't a great cook in the early years, but really enjoys cooking and experimenting in the kitchen now.\n\nI have tried periodically to surprise her with a meal now and then. I used All Recipes and found a meatloaf that she loved. I try and prepare that once a month or so. Not a huge contribution, but I do pay for our meals on the weekends.", "Same. The way it gets thrown around really makes people not take those of us who have had to live with real narcissists seriously. Like no, my ex wasn't just selfish and greedy, he was sucking ny soul dry, violent, an addict, abusive in every way, destroyed me finacially, and made me afraid to go home every day, and was eventually sentenced to a year in jail for what he did to me. \n\nSelfish, greedy, and entitled people suck but narcissism is another level entirely.", "My mum has jumped on that term and now everyone who she disagrees with is a narcissist. And she knows what a narcissist is because she’s been doing her research by watching people on YouTube.", "Yep, this is important info.", " If they have a problem with that..", "Okay but also they’re literally treating OP like a free restaurant. Which was my point there. If you want to come to my place INSTEAD of going out to restaurants… there’s a reason you think you’re getting such a hot deal. And it’s OP that suffers.\n\nBut I agree that if I were talking to these people, they are unlikely to take it well. But it sounds like they’ll be unlikely to take any of it well.", "I think, rather than it being an American thing to not split costs like that, its a Dutch thing TO split costs like that (or so I've gathered from the internet's descriptions of dutch culture). \n\nIn most of the world it would be considered incredibly rude to charge your guests for a home cooked meal. \n\nThis doesn't relate to the situation in the OP at all btw, as that's a completely different situation.", "Well, I’m actually Dutch too. And yes, sometimes I pay for their beer; sometimes they pay for mine. Also with respect to hosting dinners. As far as I know we’re not really counting or comparing unless there is someone who has less to spend so we can help them by chipping in an extra bit. Maybe there’s a difference between friends and acquaintances?", "Wait a damned second. I never really thought about it but apparently the term “going Dutch” is based in culture differences that people view as a negative thing. I mean, I’m not surprised but I never thought of it before.\n\nEdit: Also if I invite somebody somewhere I make sure I have the ability to pay if they cannot. But that’s just due to coming from a poorer background than my friends growing up.", "Agreed. It's the \"acknowledges the effort I put in\" part.", "[removed]", "Oh my god! The most bonkers part is it seems like he learned his lesson and he takes her out to eat, then promptly *proposes*. \n\nAs if taking her out to one meal reverses everything and suddenly their relationship is so strong they should get married. \n\nDude!\n\nI’m so glad she turned him down.", "I forgot for a minute that this wasn't a new post and was about to comment lol. Feel kind of bad for the dude. He was just stupid about his girlfriend's feelings because he loved her cooking so much. But sometimes for those of us that cook, it's not even about the meal out at a restaurant really it's about sitting down and having someone cook and serve you for a change.", "[removed]", "I agree, this is a key point of information.\n\nIf OP is meal prepping for friends and charging them, that seems completely fine.\n\nHowever, if OP is inviting friends over for dinner and then giving them a check for food then OP is overstepping and is an A H.\n\nI think it’s unclear from OPs post what is the case.", "[I'm not sure which update is fake but here's the final one.](https://www.reddit.com/user/GirlFriendRestaurant/comments/zqc01a/this_is_the_last_post_im_planning_on_making_from/)", "Oh thank you. This could be one of those inspirational videos about karma 😭", "Most of the time \"narcissistic\" is used interchangeably with \"self-centred\". I do agree that it's important not to make light of medical diagnoses, but I think we're fighting a losing battle, here. \n\nSimilarly, anyone who tries to say that \"envy\" and \"jealousy\" are not the same is labelled a prescriptivist. It's *literally* gaslighting, but I'm too ADHD to care about it for long.", "Oh, hey sibling. Looks like we share the same mother!\n\nMy mum's done the same, and also with the word \"gaslighting\". Some of the times she uses it seem justified, but sometimes anyone disagreeing with her is gaslighting her. TBH, I think overuse of the term \"gaslighting\" can *in itself* become a bit of a gaslighting behaviour.", "I think the idea is that if you're going to each others somewhat regularly then whoever hosts pays and everyone hosts at some point so you share it around without having to actually exchange money. It's a kind of gift economy which is quite common in a lot of places to some extent", "And also, the part where he mentions “professional service.” \n\nLike he may be a great cook. But that doesn’t make it a professional service. The world is full of Italian grandmas/grandpas who would never dream of cooking for someone and calling it a professional service lol. \n\nHaving said that, I think if he’s just asking for payment to cover the ingredients and an extra couple bucks (like really, less than $10 extra), it’s fine. I just don’t think that’s what he’s doing.", "NTA. I have a friend who makes really nice food. I suggested that she sell it. She opened a WhatsApp group to advertise, and guess what? People are supporting her and buying her food. Your friends are not good friends.", "[removed]", "This seems to be a new bot trend - a huge comment with nothing more than \"10/10\" in the body. I've seen it a few times lately.", "This appears to be a bot that stole a [comment](https://www.reddit.com/r/AmItheAsshole/comments/achoyx/comment/ed84ros/?utm_source=share&utm_medium=web2x&context=3) word for word from the 5 year old post linked above.", "[removed]", "Sure, but there's a big difference between saying a specific *behaviour* seems narcissistic, and AITA psychologist of the year saying a *person* is a narcissist, as 'evidenced' by their rhetorical flourish about projecting.", "And often the host only provides the main food (this varies) while guests will be asked to bring sides/desserts. The work and cost gets spread out enough that everyone kinda pays their way, especially if you take turns hosting.", "Oh my god they’re not narcissists. Can we please stop using that word for anyone who is being inconsiderate? It’s trivializing.", "Huh? Maybe you're responding to the wrong comment.", "Bot\n\ncomment stolen from u/FinalBlackberry below", "Stolen from [here](https://www.reddit.com/r/AmItheAsshole/comments/14r4kuf/comment/jqr560v/?utm_source=share&utm_medium=web2x&context=3) and reworded.", "Oh, yeah I guess so. I was generally agreeing with your comment though - narcissism shouldn't be diagnosed over the internet, and a lot of people who are described as narcissists (or yes, exhibiting narcissistic tendencies which is not quite so bad as outright calling them narcissists) are just being self-centred.", "Which I think is perfectly fine. Me and my friends do the same thing but on here, there always seems to be some sort of resentment or entitlement. But I guess that's why people are posting on here.", "They're a bot. Stole a sentence from a comment lower down & stuck it in somewhere random.", "Thank you! I was very confused."]}