{"id": 2140, "submission_id": "ytdd0o", "title": "AITA for suing my half-siblings over my father's will?", "selftext": "One of the stories I read here reminded me of my own situation, so I though I would share.\n\nMy dad passed on in October and the executor of my (30m) dad's will (my older half-brother) told me that my dad's only beneficiaries would be the \"3 sons who carry his last name\" and his daughter. I ended up getting into a pretty heated argument with him.\n\nTo give some family background -- my dad, a divorced American man with four children, had me with my Irish mum. Their relationship turned sour before my birth and my mother ended up going back to Limerick to give birth to me, and she gave me her own last name.\n\nMy dad had to establish his paternity and work out custody from overseas. At one point, he was flying to and from Ireland to see me three days a week for a six-month period. So there has been a lot of bad blood between my parents and my dad has wanted me to take his last name as an adult, which I did not end up doing for a number of reasons. I don't think my brother is lying about me being disinherited, but I also don't believe my father would disinherit me for that reason. I don't believe he was of sound mind when he made this will.\n\nMy father had stage-3b lung cancer for the last five years of his life. He died of some sort of saprophytic infection in a collapsed lung, which was misdiagnosed as tuberculosis. At the end of his life, he was very confused and did not even remember his own children at times. He was living with another one of my brothers at the time -- who was also managing his multifamily rentals --  and I suspect that they may have been unduly influencing him to disinherit me.\n\nMy father disinheriting me means that each of my 4 siblings receive around 800 thousand dollars *more* in liquid cash than they would have received if I was included, and that's not even counting his properties. My dad also owned a couple of acres in a rural valley in Western Norway, right in between the mountains. We had a cottage and outdoor sauna there that we would go to every summer and winter of my childhood. It's my favorite place in the world. I was supposed to inherit that place, but according to this will, I won't. I honestly don't care as much about the money as I do about the fact that I might never see that place again.\n\nI intend to sue on the basis that my father wasn't of sound mind when he made the will and that my siblings may have been manipulating him. AITA?", "created_utc": 1668274252, "permalink": "/r/AmItheAsshole/comments/ytdd0o/aita_for_suing_my_halfsiblings_over_my_fathers/", "score": 210, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Maybe it isn't the right idea to cause intra-family strife right now, since we are all suffering.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. Do what you have to do when it comes to money and property. If you and your dad had a good relationship prior to his death, gather everything you can to prove it. Phone records, texts, letters, etc. Get ready for a fight and file as soon as possible.", "Info- do you know when the latest will was made?", "INFO: What was your relationship with your father for the 10 years leading up to his death? How frequently did you visit? How often did you speak to one another? For what reasons, other than blood relation do you feel entitled to an inheritance?\n\nEdit to include judgment: NTA.", "INFO: \n\n>I suspect that they may have been unduly influencing him to disinherit me.\n\nHow are we supposed to judge if this is true?", "Info: \n1. When was the will drawn up?\n2. Did you and your father have a good relationship prior to his death or illness?\n3. While the last name thing is contrived, are you sure it’s untrue?\n4. What proof do you have of undue influence? \n5. Is it possible that your father resented you for not taking his name and thus you are disinherited? \n\nI don’t think you are an asshole for contesting a will especially if you believe you’ve been blindsided. But I don’t see what your half siblings have done to warrant the asshole tag either.\n\nNAH", "This isn't an AITA question. If you have grounds to sue, then do it.  If he changed his will when he was more clearly in mostly normal mental capacity (which probably includes most of the 5 years after his cancer diagnosis), you will probably not get anywhere. But if your brothers tricked a confused old man into signing you out of the will, why wouldn't you try to undo it?", "NTA. You should have received a copy of the Will. You need a lawyer yesterday so he can file for an order to stop giving away/selling assets until your issue is resolved.", "You need to consult with a lawyer that specializes in contesting wills.", "NTA - You feel strongly about the circumstance. r/legal may help.", "NTA, and you need to move fast, because probate issues can sometimes have rigid deadlines. Seek legal advice ASAP.", "NTA.\n\nThis could have life-changing consequences for you, and you really don't know what the will says.\n\nOn the other hand, you don't really know what his mental state was at the time.\n\nYou should get a copy of the will, consult with a lawyer who specializes in estate law, and then consider your options.\n\nThe lawyer may tell you you don't have a case, but you should find out before deciding what to do.", "NTA. Sometimes Family sucks post mortem.  I had two siblings decide to abuse a POA and change life insurance beneficiary designations for personal benefit based on facial expressions of a dementia patient who couldn’t remember her birthdate or what day Christmas falls on.  Hope you win OP.", "NTA. The whole last name thing sounds seriously contrived by those who can gain by it. I say hit 'em with all the guns you've got.", "If you didn't have a relationship i would say fuck off but if you had and he promised you then you have a right even though you're brothers won't like it .\nYou can contact a lawyer and tell him that you only want the property if the will was made after your that was lucid and if they still won't agree i would sue for a 1/4th...screw them then", "NTA. \n\nThere's an extensive corner of the law (probate) for such cases. Hire a lawyer who specializes in probate law, and do so quickly (there can be time limits).\n\nYou can't expect to win, of course, but you should seek the full recourse the law allows.", "YTA. Of course he would give more to his children who were actually taking care of him rather than the one who wasn't involved at all.\n\nGet over yourself.", "YTA - you don’t even know when this will was created/last updated, you’re literally just doing this as a money grab. The saddest part is, in all of the comments you are only mentioning money and your last name, not that you wanted something due to the sentimental value it holds. I find it sad you see your dad and what he worked hard for as a payday for yourself, it explains why he may have taken you out of the will when he was of sound mind.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nOne of the stories I read here reminded me of my own situation, so I though I would share.\n\nMy dad passed on in October and the executor of my (30m) dad's will (my older half-brother) told me that my dad's only beneficiaries would be the \"3 sons who carry his last name\" and his daughter. I ended up getting into a pretty heated argument with him.\n\nTo give some family background -- my dad, a divorced American man with four children, had me with my Irish mum. Their relationship turned sour before my birth and my mother ended up going back to Ireland to give birth to me, and she gave me her own last name.\n\nMy dad had to establish his paternity and work out custody from overseas. At one point, he was flying to and from Ireland to see me for three days a week for a six-month period.\n\nSo there has been a lot of bad blood between my parents and my dad has wanted me to take his last name as an adult, which I did not end up doing for a number of reasons. I don't think my brother is lying about me being disinherited, but I also don't believe my father would disinherit me for that reason. I don't believe he was of sound mind when he made this will.\n\nMy father had stage-3b lung cancer for the last five years of his life. He died of some sort of saprophytic infection in a collapsed lung, which was misdiagnosed as tuberculosis. At the end of his life, he was very confused and did not even remember his own children at times. He was living with another one of my brothers at the time -- who was also managing him multifamily rentals --  and I suspect that they may have been unduly influencing him to disinherit me. \n\nMy father disinheriting me means that each of my 4 siblings receive around 800 thousand dollars *more* in liquid cash than they would have received if I was included, and that's not even counting his properties. My dad also owned a couple of acres in a rural valley in Western Norway, right in between the mountains. We had a cottage and outdoor sauna there that we would go to every summer and winter of my childhood. It's my favorite place in the world. I was supposed to inherit that place, but according to this will, I won't. I honestly don't care as much about the money as I do about the fact that I might never see that place again.\n\nI intend to sue on the basis that my father wasn't of sound mind when he made the will and that my siblings may have been manipulating him. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "You’ll have to get a copy of the will. It’s also possible that your father was lying or not sound of mind when he said you would get the land if that was only recently before his death. \n\nTo argue not sound of mind is going to need medical back up and again goes both ways, this will could be years old and he was telling stories not in his own mind or he made a new will even without his other children knowing while not sound of mind. \n\nIt does seem like the whole name thing was something he wanted though if he even asked as an adult for you to change it. \n\nSometimes people do genuinely promise the world knowing damn well they are going to break hearts when their wills are read out.", "Get a good estate planning lawyer who can contest the will and throw it into probate, which will cost your half sibling money. Lawyers love this work they can come out a 100k richer depending on the money due to be inherited. Many of my bonuses came from situations. Also how quickly people change their minds when they realize they end end with much less", "NTA This is impossible to judge. You need to see a lawyer who will look at the will and circumstances to see if you have a case.", "OC your not the AH.  You deserve your share", "NTA", "Nah you have every right to contest the will but if your siblings have every right to go by the will. So you are not wrong but neither are they.  \n\nBut the siblings can’t just force the father to change the will. There has to be an attorney involved and there are very stricken rules to making a will. One being they do a test to see if they are mentally  capable of making choices. So I don’t know how far you will get with contesting it.", "NTA. Your father was clearly an involved father in your life. If his will was written during the last stages of his life then it is entirely feasible he was not of sound mind. Definitely challenge the will. Good luck.", "NTA. You need to get a lawyer who specializes in will contests asap and contest this will for your share. The lawyer will guide you. Good luck.", "NTA and lawyer up. The lawyer after examining the will and getting a time frame will be able to tell you whether you have a strong case or not. It really comes down to when was this Last Will and Testament written. I am not a lawyer but it seems that if it was written before the diagnosis or in the very early stages they will have a strong case however if it was written later in his illness when he was having cognitive issues that were already documented you have a good chance. 800k is definitely something to have a lawyer check into.", "It'll be an uphill battle, but I'm ready to do it. This is insane.", "I don't, but he had told me that the land in Western Norway would be mine. So that leads me to believe that the contradicting will was made recently.", "Read the date of the signature.", "We talked all the time. I actually live in the US now and I was working for the Department of Veterans Affairs. Since it is my first year, I had limited options in terms of taking time off, but I still took a Family Medical Leave to visit my father.\n\nMy dad and I were very close. We had a loving relationship. There's no way he would disinherit me.", "One factor is that my father had already told me I was going to inherit the land in Norway. So that means at some point after he told me that, he \"changed his mind.\"\n\nIs it really that implausible that the people he was living with would pressure him to change his will given how much they stood to gain? Especially given his vulnerable situation.", "I don't know when it was made, but he had told me that the land in Western Norway would be mine, making me believe that the contradicting will was made recently.\n\nMy dad and I were very close. There's no way he would disinherit me.", "I don’t think op is the ass hole and should definitely ask questions. But how would they trick or confuse the dad. Wouldn’t an attorney have to be present to draw up another will? I am truly curious?", "Not necessarily. It's entirely possible that he would reward the children who were actually taking care of him over the one that was uninvolved.", "It absolutely is.", "Excuse you? It's not 10 dollars we are talking about and he has a relationship with is dad so why should dad not give him the property his dad promised him. I think he is in his right to find out if dad was able to make the will of that his brothers are maybe greedy", "The will is most likely already in probate.", "Nobody deserves an inheritance.", "You aren't the asshole, but you should really be talking to a lawyer and not this sub.", "Get ready to fight like your possessed by the Devil. Your NTA", "When did he tell you that? How long before you believe he was no longer in sound mind?", "Or that he changed his mind due to you being uninvolved.", "Then NTA but be prepared for two possibilities:\n\n1. Your dad did remove you from the will at a time when he was of sound mind meaning that your relationship was not as good as you thought. (The most likely time of which being when you didn't take his name)\n2. Your dad removed you when he was under duress which will be difficult to prove as most will changes are done with some process of ensuring competence.", "It seems equally plausible that:\n\n* he was improperly influenced to change his mind because there's so much to gain\n* you're discounting the possibility that he properly changed his mind because there's so much to gain", "When did he tell you that? When you were a kid? Last year? \n\n> my dad has wanted me to take his last name as an adult, which I did not end up doing for a number of reasons. I don't think my brother is lying about me being disinherited, but I also don't believe my father would disinherit me for that reason.\n\nYou might be wrong about this. There was a post on here where a dad asked his kid to change their name to his and then he’d help with something but they refused and didn’t get the help.", "AFAIK you can write a will on the back of a napkin and have it be followed. It is just better to do it with a lawyer, especially if you have a lot of assets. For me, just a single line saying 'everything I own goes to my husband' would suffice, and not even be needed cause I own very little. The kind of estate OP is talking about should def have lawyers involved.", "But you would think the father wouldn't have told that child that he would get the summer cottage in that case.", ">he properly changed his mind because there's so much to gain\n\nI don't know what this means.\n\nMy father was in a confused and vulnerable state at the end of his life.", "I didn’t realize you could write your own will until this post. I actually thought you needed lawyers.\nSo I did learn something today", "Unless that was a non lucid moment.", "Sure, but he could have cut you from the Will years ago. Is it signed and dated by a notary or lawyer? You may never have even actually be a part of his will, you wouldn't know.", "You don't tell us anything about the timing, circumstances, or documentation of his disinheriting of you. You don't tell us if he had lucid periods, or a diagnosis of dementia. \n\nBut it seems like you've entirely made up your mind that this was improper influence, so I'm not sure why you're posting here.", "In the us most attorneys give a mental evaluation. I have a feeling they probably did this. However I don’t think your the ass just a heads up this is going to be a up hill battle. And a very expensive one at that. You also have to take inconsideration when the will was written. If the will was written before or just as he was getting sick then you probably have no grounds. It may honestly come down to the fact your father did disinherited you because you would not change your last name. But us court system is so messed up. Good luck it sounds as though your going to need it.", "For easy wills, you can just download a form which takes you through the steps to make it official. You might need to find someone (who isn't a beneficiary) to countersign.", "The thing is you’re jumping to the end conclusion that only a trier of fact, a judge or jury, can find. His issue is only whether he is an AH for going after what he rightfully thinks is his by way of a law suit. I’m not sure anyone would be able to accurately answer that question, to be fair.", "I’ve never requested that a client have a mental evaluation and wouldn’t unless I had reason to believe that there was a competency issue. With that, many wills do not have to have an atty involved in their preparation. In many states, you can have what’s called a “holographic will” handwritten by the testator. But it seems like OP’s dad is not in the US based on what he’s said in other comments.", "In the us most attorneys give a mental evaluation. I have a feeling they probably did this. However I don’t think your the ass just a heads up this is going to be a up hill battle. And a very expensive one at that. You also have to take inconsideration when the will was written. If the will was written before or just as he was getting sick then you probably have no grounds. It may honestly come down to the fact your father did disinherited you because you would not change your last name. But us court system is so messed up. Good luck it sounds as though your going to need it.\n\n\nI am editing this because I don’t feel like deleting it is right. But I was informed that I was wrong that they only do mental health evaluation if the attorney thinks there is reason to . I was wrong an apologize. I also didn’t realize you can write a will with out an attorney until I was informed. So with this new information I think op should defiantly ask questions and not take his half-siblings word on the will. Death brings out the worst in people.", "Posters to AITA are supposed to present their situation objectively. I’m probing to try and understand if he did, despite a post that reads like a call for affirmation, not an objective request for judgement.", "I know when my husbands grandma had her will write up they tested her. I personally thought that was the norm. I haven’t had a will drawn up(probably should) but I hate talking about dying so avoid the subject.  \n\nThank you for the information. I was just going by that one experience.", "One more question what is a testator?", "A person who has made a will. In this case, OP’s father.", "I didn’t know that was such a thing. Thank you for the information.", "INFO. Not enough to go on here. Did you have equal contact with your father to expect him to treat you equally? You advised that one of your brothers was looking after him at the end, could he not reasonably be expected to be more grateful for the care received in the last few months without any undue influence having been applied? You already advised that he wanted you to change your name and you refused, I'm guessing you thought him in sound mind at that time regardless as to whether you though the request justified. When was the will currently in place written and witnessed?", "NTA based on the fact that you are not worried about the $800 000 US$ is more then enough for that judgement. That a hell of a lot of money!!\n\nYou are only interested in the property - in a different country because of the experiences and memorys you have there. It's all sentimental.", "NTA you would not be an asshole to pursue this given that you have a suspicion that he was improperly influenced. If you were just challenging it because you didn't like the answer that would be something else. But you do think that there is a strong possibility that your half siblings got involved because they would get tremendous financial gain from it.\n\nEven if it goes no farther than you finding out that he changed the will at some point when you all recognize he was still lucid, you're not wrong for asking those questions and trying to find out if your father took you out of his will because he didn't want you in it, or if you're half siblings pressured him to", "NTA Get a lawyer in the state where your father lived/ filed the will, particularly one that has experience in this area. The laws regarding wills vary from state to state.\n\nObtain the older versions of the will. It'll be clearer to determine what his wishes were.\n\nAlso watch out if parts of the estate e.g. jewellery, cars, easily movable items have been taken. \n\nIf the Norwegian cabin is all that you want, it may make sense to negotiate a settlement. i.e. you keep the cabin, property in Ireland, if any, and some money. Based on the amount of cash involved as an indicator of the total estate it may make sense for them but your lawyer will talk you through this.\n\nI wish you luck with this.", "NTA, it's a sucky situation for sure.  Either your dad never got around to adding that in, or for whatever reason it was changed.  I hope it all works out for you and I'm so sorry for your loss.", "NAH(right now) but make sure you have the funds to pursue this even if you were written out. You say he told you the Norway property was yours but not when he told you. Your dad was very wealthy so I’d assume he had a good lawyer who would assess whether he was in right mind to amend his will.", "Rhaenyra Targaryen vibes", "NTA, fellow Irish born person. If you think that your father would have not deliberately and soundly pulled you out of the will, then I would fight for it. Based off the limited info we have, it seems your half siblings may have manipulated him or lied about the will. I would definitely call a lawyer and have a consultation and explain everything. See what they say - if there’s no chance you’d win or a very slim possibility, they’d be able to let you know", "Info you say he told you that nothing was left to you. Did you actually get a copy and read the will? I would think you dad having assets would have gad an irrevocable living trust. That you can't sue over.", "NTA.  When my biological father dies, I will likely be contesting his will if I am not considered at least equally with my half siblings.  (He abandoned me as an infant and went on to marry and have a \"legal\" family.)\n\nReally, you're suing the estate, anyway, and depending on where the will is in probate (USA?  State?  Canada?) you'll have grounds.", "Info: have you actually seen the will?\n\nIs there a chance your brother is lying to prevent you from staking a claim to what actually was left to you?\n\nGet a lawyer to review the will before you do anything else and read it for yourself so you know how to prepare.", "Indeed, you need to stop questioning whether or not you are an asshole and get a lawyer. Because if it bothers you, you need to immediately step in to stop property being distributed", "This right here, even if it goes no farther then just finding out when that will is made, if you have questions you need to pursue this and now. Because if you're half siblings are already going through his stuff and distributing assets, you need to step in.", "I mean the judgment isn't on whether or not the poster should be a beneficiary, the judgment they are looking for is whether or not they are a complete asshole for even questioning it.\n\nIt seems like if they're questioning it, they should pursue it even if it just means finding out when the will was made", "How?", "Look into getting copies of his flight records to establish the effort he put into having a relationship", "Or he just never updated his will. Without knowing the age of the will there's a lot of unknown factors.", "My husband and I just made our wills using a computer website (free through his work, would be $20/person on its own though). We got it witnessed and notarized to be thorough, but didn’t need to do that. \n\nOP needs to see this will. Depending on the state his father lived in will change the way it would need to be written. Like if OP needs to be written out by name, or if just omitting him is enough for him to lose any claim to the inheritance. \n\nPersonally I don’t think there are any AH here. It sounds like dad didn’t like that OP never took his last name, which is a valid choice for OP to make. But it might have hurt dad, who sounds like he tried his best to be present for his child who lived in another country. Also don’t blame the other siblings, they would have had to grow up with their dad missing his other son and might have been hurt too by OP not doing a name change to show he is a part of the same family. \n\nOP will have a lot of work to do to see if he is entitled to any inheritance, and it will cost him a lot of money to fight for it (if needed). It honestly might not be worth the years of hassle (since he says he only cares about the cabin in a country he doesn’t even live in)", "I was not uninvolved.", "I wasn't uninvolved tf", "My grandfather actually had a \"back of a napkin\" will. It is a bigger headache for the executor (in my state at least), so I wouldn't recommend it. Also he didn't have many assets so it was fairly straightforward, but if you did, it would probably get more complicated.", "Info: how do you know he changed it at then end of his life?", "In that case he wouldn't be of sound mind to change his will would he?", "My point was he could of been lucid changed the will and then rather than foul play his non lucid was telling his child they would get that particular property. Op doesn’t know when/if the will was ever changed or if their dad really didn’t want them to get anything.", "It’s impossible to be objective in this situation. It’s OP’s truth. His siblings likely have an opposite view. This is exactly why we have courts to settle disputes. I understand why you asked. I just don’t think that there’s a real answer for you at this time.", "Are you \"probing\" if you haven't asked questions?"]}