{"id": 21436, "submission_id": "14rj0r4", "title": "AITA -community pool edition", "selftext": "So today is my only day off to go to the pool for like two weeks. I get there around 10am and it’s empty.  30 minutes later a guy shows up and starts playing music on his Bluetooth speaker that is loud enough for everyone to hear. It’s country, then like church chorus music. I waited for like 40 minutes until I just had enough. It’s a beautiful day and I just wanted to float in the pool and listen to the birds.  \n\nI waited until a song ended and in the nicest way possible I said “hey would you mind lowering your music a little bit?” And he replied “sure sweetheart, no problem” so I thought- wow that was easy. \n\nThen a moment later he asked if I was offended by his music and I said “no, just trying to enjoy the pool” and I could tell he was getting angry. \n\nSo I turn back around in the pool and he continues to mumble stuff and then said “if I called the cops they would tell me I could\nPlay music as loud as I wanted” so I said “ok dude. I just thought if I asked you nicely- whatever” and he continues to tell me how long he’s been in the neighborhood and all that. So I said “ok, I asked politely- I’m sorry I upset you so much. You look like you’re about to cry” and that’s when he lost it and called me a bitch and left. \n\nI mean. Whatever. The weekend and you have 5 people at the pool play music. But you’re by yourself and you have to blast your crappy music? Use headphones or play it so only you can hear it by your seat. \n\nI was like “I don’t think you’d want to listen to my music and I don’t really want to listen to yours”. AITA?", "created_utc": 1688581603, "permalink": "/r/AmItheAsshole/comments/14rj0r4/aita_community_pool_edition/", "score": 223, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Asked a dude to lower his music at the community pool and he called me a bitch.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. And I'm totally stealing \"you look like you're about to cry\". That's gold!", "NTA. Like nowhere near the asshole. He’s in a shared space. He should be respectful and keep the volume down or wear headphones. We all have wildly different music taste. And some people just want peace and quiet", "NTA - Guy clearly has issues and can’t understand that his enjoyment is coming at the expense of others’ peace.\n\nVery simple for him to get headphones or lower his volume but he was more interested with causing a stir than actually having peace IMO.", "NTA You asked nicely and the guy started being a jerk about it.", "NTA. It is a public space and you asked nicely. The best way to bring a jerk to his knees is to tell him he looks upset. Adding that he looked like he was going to cry is a nice touch.", "NTA. The first response was condescending. The second unprompted response was asking if you were offended. He was purposefully looking to get into an argument and got his panties in a wad when you didn’t engage the way he wanted.", "NTA since you asked nicely. \n\nThis is a touchy subject. I think people should be allowed to chill at the pool, listen to music, BBQ, whatever.  It's kind of what it's there for.", "NTA.\n\nIt sounds like his feelings were hurt.", "Looked like he was about to cry?? Sheesh.\n\nNTA.", "NTA. Playing music out loud in a communal setting is always disrespectful.", "NTA. You asked nicely.\n\nI always think people who blast music in public areas are assholes anyway and he just showed himself over and over again lol.", "I bet he talks on his phone in public while using only the speakerphone, too.  Assholes.", "NTA. Unfortunately some people are just like that.", "NTA dude seems like he has a crazy persecution complex and was out there looking for a fight. he was just pissed you had a reasonable measured response instead of getting offended like he wanted", "Would of you complained if the guy had someone on that you liked? I mean I get it, gospel and country ain’t my thing either. People do it, and yes they get offended when you say something about it. I’m going with NTA because you said you were civil with him, and he was the jerk. You just wanted to enjoy a day at the pool, but unfortunately it’s a “public” setting. The only time it would be a nuisance would be late at night with a noise ordinance. Usually. NTA", "NTA for asking, but he is technically in the right.  Unless the pool rules forbid music (doubtful) then you are ok to ask, and he'd be ok saying no.  I do think he misread something into your request that you were anti-religion or something, though.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSo today is my only day off to go to the pool for like two weeks. I get there around 10am and it’s empty.  30 minutes later a guy shows up and starts playing music on his Bluetooth speaker that is loud enough for everyone to hear. It’s country, then like church chorus music. I waited for like 40 minutes until I just had enough. It’s a beautiful day and I just wanted to float in the pool and listen to the birds.  \n\nI waited until a song ended and in the nicest way possible I said “hey would you mind lowering your music a little bit?” And he replied “sure sweetheart, no problem” so I thought- wow that was easy. \n\nThen a moment later he asked if I was offended by his music and I said “no, just trying to enjoy the pool” and I could tell he was getting angry. \n\nSo I turn back around in the pool and he continues to mumble stuff and then said “if I called the cops they would tell me I could\nPlay music as loud as I wanted” so I said “ok dude. I just thought if I asked you nicely- whatever” and he continues to tell me how long he’s been in the neighborhood and all that. So I said “ok, I asked politely- I’m sorry I upset you so much. You look like you’re about to cry” and that’s when he lost it and called me a bitch and left. \n\nI mean. Whatever. The weekend and you have 5 people at the pool play music. But you’re by yourself and you have to blast your crappy music? Use headphones or play it so only you can hear it by your seat. \n\nI was like “I don’t think you’d want to listen to my music and I don’t really want to listen to yours”. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA\n\nYou were, arguably, overly nice about it.  The fact that he got offended at being asked to consider others and then attacked you for it should tell you who the real AH is.", "I specifically bought an adapter for my (jackless) phone so I wouldn’t *be* this AH,that guy definitely is. I hope a nice long cry after he got home mellowed him out a bit 😂 NTA", "Sounds like the Jesus Jams aren’t working….", "I love that turnabout when someone is getting overly upset.  I'm a big fan of using it at work \"It looks like you are feeling very emotional about this, would you like us to pause the conversation and find someone to mediate for you\n\n  \n\nLove the look on their face when I turn it on them.  Delicious.", "NTA OP.  If I had been in that situation, I’d have been really petty, walked over, and thrown the speaker over the fence.", "Haha. That’s when he got super pissed. Very fragile apparently. Called me a fat bitch before leaving 👍🏼", "That was my favorite part too!  The only thing I might have added would be that he was definitely giving off S.D.E. (Small Dick Energy).  \n\nNTA.", "Listening to music is fine. Forcing others to listen to your music is not. If he was using headphones, he'd be in the clear.", "Playing music loudly for everyone to hear in a public space is rude as hell.", "Just because you can legally do something doesn't mean it's \"right\" technically or not \n\nAnd I'm pretty sure most places have laws against being a public nuisance, so even that point is arguable", "Omg, what a petty little boy, lol. You handled it perfectly.", "Haha, you defo got him then. Bravo 😂", "It's pretty typical, and not rude. Especially during daytime hours.  That's why there are noise ordinances for public spaces. Have you ever been to a beach or swimming pool?  This is normal behavior.", "I manage a lot of properties, some of which have pools.  I am very familiar with what is considered excessive/illegal (Bluetooth speakers aren't loud enough for the legalities to come into question) and what is acceptable.\n\nPools are common areas.  Noise is a biproduct of common spaces, especially those deemed recreational.\n\nAgain, nothing wrong w/ asking but nothing wrong w/ playing, either. OP could've put on her own headphones or gone underwater.", "Uhm, no, it's not? Most people understand that it's incredibly rude to force others to listen to your music.", "It’s very rude.", "And this is why this site is called “am I the asshole” and not the “am I technically right?  and so can I do it anyway?” forum. Where I come from, people who blast music, making everybody around them listen to it as well, are considered assholes. They might have the legal right to do it, but the people around them are also legally entitled to think of them as assholes.   (Kind of like peeing in a pool, or sitting down next to a lady with a baby at a park and smoking a cigarette). There are all kinds of ways to be an asshole that are perfectly legal.", "It depends where you are at, but a public pool is one of those places where it is common (same with beach, park, etc).  It's not on a train.", "Well, quite recently in my country, a law was issued to curtail this very issue on a beach setting. There are now fines for those who \"use sound equipment or other noise generating activities that cause disturbances\" to other beachgoers.", "There are noise ordinances here. It is nothing that a bluetooth speaker would amount to, though.  There are decibel amounts, and it's typically professional speakers and stuff of that nature, that BLARES music, not simply plays music (even if on full volume).  It varies by location, as well.  If this was yesterday in the US, and kids were running and people playing music (as they most certainly were), no one would say anything about the noise.\n\nI'm just saying - OP's desires are out of sync with reality.  She went to a COMMUNITY POOL.  It's a RECREATION AREA.  People play music.  Wanting peace and silence is not something one should reasonably expect.\n\nI am a property manager - I have to tell tenants this shit all the time. The neighbor is acting lawfully and reasonably, and at a reasonable hour.  I've never seen a Bluetooth that can produce the type of sound that would be excessive.  If he had DJ equipment out at 2am, he'd be in the wrong.  Again, NTA for ASKING but he is under no obligation to comply - legally or etiquette-wise.  Don't go to a community pool for peace & quiet.", "NTA. A guy was freaking out at the airport recently because our plane was delayed. He was on the phone with someone, calling the gate agents \"lying sacks of shit,\" among other things.\n\nHe gets off and a lady kindly asks if he's ok, because he seems really fragile. OH MY GOD HE WENT BERSERK. Turns out, he WAS fragile! HAHAHAHAHAHAH!", "40 minutes? I wouldn’t have put up with that crap for 5 minutes. \n\nNTA", "YTA you could have gotten shot. Now a days one has to be extra careful. Next time fine a complain or call the cops!", "NTA, you asked nicely. Also, pissing him off so much he left- seems like a best case scenario for you.", "There is a brain function that includes self-awareness - some have it greatly, some poorly, some not at all. He is in the last group.. NTA", "NTA. When my partner and I go to pool we usually take the Bluetooth speaker. If we are alone we’re good. If someone is there we always ask before playing music. If someone joins after us, we also ask them if it’s cool. That’s the 101 of social rules. The guy op was rude and you were right about how to handle it", "I recently read an article—not gonna lie, it was via FB, lol—that talked about how calling men out when they are being emotional, especially in the workplace, is a great way of making them stop inappropriate behavior, like yelling. I LOVE it. Apparently men like this refuse to acknowledge that anger is an emotion. The author used the phrase, “you’re having some big emotions right now” and suggested they needed some time to calm down. Act like a baby, get treated like a baby. Good for you OP!", "Not gonna lie. I tried to connect to his speaker but it wouldn’t show up on my Bluetooth lol", "Wait. I’m the asshole because he may shoot me? Yeesh. What a time to be alive.", "But like....a pool is not a great place for headphones?? Idk why people keep suggesting this as though headphones are a normal and viable.option for being in the water", "He wasn’t in the water. He was laying by the pool. Alone.", " NTA. This shit drives me insane. If we all played our music, how would that be? It would be awful. This also applies to watching videos, talking on speakerphone, letting your phone ring ad nauseam, etc. in public places. Just don’t. /rant", "NTA! Headphones were invented for a reason.", "NTA\n\nYou were polite and that guy went looking to start a fight for no reason. Clearly had a victim complex by asking if the music was offending you. Probably just really can't understand the concept that other people actually don't want to listen to his crappy music lol", "People that play there music at an obscene level are the look at me people. That should come with a fine. NTA", "NTA you hurt his poor little fee fees ohhh nooo so sad. 😂 the you look like your bout to cry comment has me dead. Your awesome OP lmfao.", "NTA. I would've blasted my music if he hadn't stopped, starting with my favorite bands from the Sahara, then moving on to some 60s Bollywood classics. From there we can move on to some French alternative (a lá Juniore) and if he's still around by then, Cumbia.", "NTA", "How rude! And he was listening to “church” music? \n\nHe’s not very church like in my mind. /s", "reminds me of this\n\nhttps://www.reddit.com/r/AmItheAsshole/comments/vuiviv/aita\\_for\\_calling\\_my\\_hottempered\\_guy\\_coworker/", "Oh shit! It was Reddit all along! Now I feel silly. Promise I wasn’t trying to humble brag that I don’t only read on Reddit.", "That was such a fantastic read!!  So very satisfying.", "NTA.\n\nI automatically seriously dislike anyone who plays music out loud in a public area. People are so self-centered and inconsiderate.", "I hope there is a special hell just for people who force everyone else to listen to their music in public. NTA", "“So I said “ok, I asked politely- I’m sorry I upset you so much. You look like you’re about to cry” and that’s when he lost it and called me a bitch and left.”\n\nThat escalated quickly. \n\nNTA", "Nta. Some men just have big feelings and don't know how to handle them, especially if every woman around doesn't like their shit or has some need of their own.", "I’m really going to pick up a bunch of shitty headphones at Dollar Tree and carry them around for circumstances like this.", "You’d have to press the pair button on his speaker for it to try to search for your phone. Maybe you can ninja your way over and stealth pair next time", "I’d start playing UFO podcasts through his speaker", "Whatever happened to earphones or pods?  I was on the bus last week, and the guy behind me was listening to Kanye at top volume on his phone, which means we were all listening to Kanye.  He finally gets off the bus and the guy sitting next to him cranks up his phone and we all got to listen to his language lessons.  I turned to him as he was starting and said, \"Are you serious?\". He ignored me while I worked on my death glare and the people around me grumbled and sighed.  Earphones, people.  You don't want to listen to our stuff; we don't want to listen to yours.  Life is not a soft drink commercial where we dance together over our shared love of some artist.", "I wouldn't do that, that's stooping to bodyshaming.", "I'm surprised no one else didn't knock that speaker into the pool"]}