{"id": 21466, "submission_id": "14s1ylx", "title": "AITA for being mad at my fiancé for getting me food", "selftext": "OK this is gonna sound like I’m a horrible person but my fiancé and I made plans to get fast food, which since I’m on a diet I can’t have a lot. We had made plans to order when we were both awake because we have opposite sleeping schedules. We made this plan three days ago. Well today I wake up and there’s two cold burgers in the fridge from the place that we said we were going to get food. Now I don’t like reheated food because it causes sensory issues (Which he knows about). Now if the burgers had been like a chicken sandwich or something I would’ve been fine, but they were two big Macs, which I absolutely do not like reheated. I know it’s a stupid thing to be upset about but I feel like he went against the plan got himself hot food and then got me leftovers. Which he wasted his money because I can’t eat cold burgers. (I’m not being picky it’s an autism thing). So now I’m sitting here upset because the thing I was looking forward to for three days is something that I can’t eat. And I just wanna know AITA for it. also, we can’t afford to get it again it was a one time treat.\n\n\n\nUPDATE: We spoke about it and he honestly forgot that I don’t like cold burgers. We both agreed it wasn’t about the burger and we have some other things to work out. He’s also getting me a replacement burger and a coffee. He was trying to be sweet by getting me some food to wake up to and thought it would make me happy.", "created_utc": 1688629959, "permalink": "/r/AmItheAsshole/comments/14s1ylx/aita_for_being_mad_at_my_fiancé_for_getting_me/", "score": 2059, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I feel like I’m being an ahole because my fiancé went out of his way to get me food, and I am being super picky and refusing to eat it\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "I don't think you're the asshole. \n\nIt was something you were supposed to do together, and if you had done it without him, he'd probably be upset, too.\n\nIf this something you've told him about and he keeps doing it, it could be a serious strain in your relationship.\n\nBut if it's not a big deal or problem, just talk about it with him, only communication will help.", "NTA. It's only \"minor\" if you can afford to waste money - which OP can't.\n\nIf he was impatient to eat, he should have just gotten his own order, leaving the rest of the money so she could order later.\n\nIt's so thoughtless. I don't even have sensory issues like the OP, and I wouldn't want to eat cold fast food, like I was just an afterthought.", "NTA.\n\nThat's selfish on his part. Your 100% correct: he ate when he wanted with no real concern for you and left you with gross leftovers.", "NTA and your fiancé is. Everyone knows that fast food goes way downhill when not fresh. He knew this was a treat for both of you. He didn’t wait til you were awake to get your preferred order or let you enjoy it with him. He prioritized his own whims/cravings/impatience.", "NTA \n\nNo one should ever reheat a Big Mac. 🤢", "NTA\n\n\n\nCold McDonalds is disgusting. I don't get the people here who say \"ohh it is so minor\". It is fucking rude and thoughtless. And they are tight on money. Getting op nothing would've been more kind. \n\n\n\nWtf.", "NTA. \nI wouldn't eat it either. \n\nInstall the McDonald's app. They give you a free Big Mac. Order, pick up and enjoy your free and fresh Mac.", "NTA There’s nothing worse than looking forward to something and it not being what you expected. You bf should have known.", "NTA- cold or reheated fast food burgers are never good. He took away your treat, that you were looking forward too.", "go talk to him when you’ve calmed down. if he’s reasonable he’ll see why this upset you. if you’re reasonable, you’ll hear out his side of the issue. if his excuses are kind of bullshit (ie, he says he didn’t know you only like chicken sandwiches when you’ve told him a bunch of times before) then thats a separate issue on why he’s not taking your food preferences seriously. NAH", "i'm so confused. why he did all of this if you made a spesfic plan 3 days before? NTA", "NTA- I think you are justified to feel the way you do. Cold fast food (that’s meant to be hot); is disgusting. The fact he knows you both can’t afford to order you anything else (that you could eat) is selfish.", "INFO: How come you weren't available to go with him when he went to get the food? Were you asleep all day and he got tired of waiting? Did he have something else that he had to do? What was his reason for not taking you?", "NTA but please go get yourself warm mcdd. And have a chat with your ah BF and tell him to eat his big Macs cause you won't.", "INFO: did you ask him why he did this and what did he say?", "NTA but mad isn't the right word. You have every right to be disappointed that your \"dinner out\" was \" leftovers in\" - and on a limited budget,  leftovers you can't even eat. Given you are on opposite schedules, one of you is having dinner for breakfast.   He made a failed attempt at date night. If this actually makes you mad, then you might be the asshole.\n\nAs a side note, if you haven't looked into it, know there are plenty of ways to manage sensory issues and food aversions. I have several friends that had amazing improvements with food therapy to help manage their autism. As an example I suggest you look into food chaining.  You should be actively working on anything that limits your life (and on a strict budget, eating reheated food would count).", "This isn't worth getting angry about.\n\nAnnoying for you, sure. But its just fast food.\n\nJust be really clear about what you want and what you don't want.", "I think it is quite an overreaction, yeah. Let him know he got you the wrong food and he probably should have remembered that, and then go out and get your own fresh from the restaurant and then move on with your life.\n\nAsk yourself: Is this minor inconvenience something worth having a long, drawn out fight over?", "NAH. While it's disappointing, it's important to remember that your fiancé likely had good intentions.", "It’s ok to be disappointed and upset about it. But it’s also not a huge deal, so you probably want to keep your emotions in check as you try to communicate this disappointment to your fiancée. That can be difficult if you don’t feel like you’re being heard. You can try saying out loud “I know it’s a little thing”, to remind yourself and him that you still have a clear perspective, but it’s also really helpful to be clear with him that this is a disappointment.", "Dude are you 13?\n\nIt's food. If you have better food (not junk food) at home eat that and be glad you're making better choices.\n\nBut unless you made it into a huge thing and got upset about it, no need for a fight at all.\n\nSo, YTA. I don't know about the autism thing here, it seems that an entire generation is autistic has anxiety and PTSD so I really can't say anything to that other than it sounds like you're being spoiled and calling it autism.\n\nIf you have no food and only the cold burgers and it really is eating that or starving and you ACTUALLY can't eat them due to a real condition (real like food allergies), Only then are you NTA.", "YTA A bit of an overreaction", "NAH. It's like a fast food plot twist. You had your eyes set on a fresh order, but ended up with leftovers. It's okay to be disappointed, but try communicating your preferences more clearly next time!", "[deleted]", "[deleted]", "YTA just order another burger or go pick one up", "This post sounds like it was written by a 12 year old.\nJust get over it.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nOK this is gonna sound like I’m a horrible person but my fiancé and I made plans to get fast food, which since I’m on a diet I can’t have a lot. We had made plans to order when we were both awake because we have opposite sleeping schedules. We made this plan three days ago. Well today I wake up and there’s two cold burgers in the fridge from the place that we said we were going to get food. Now I don’t like reheated food because it causes sensory issues (Which he knows about). Now if the burgers had been like a chicken sandwich or something I would’ve been fine, but they were two big Macs, which I absolutely do not like reheated. I know it’s a stupid thing to be upset about but I feel like he went against the plan got himself hot food and then got me leftovers. Which he wasted his money because I can’t eat cold burgers. (I’m not being picky it’s an autism thing). So now I’m sitting here upset because the thing I was looking forward to for three days is something that I can’t eat. And I just wanna know AITA for it. also, we can’t afford to get it again it was a one time treat.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA", "NTA and you’re allowed to be picky. BTW I also hate reheated or cold burgers! It’s a hard no for me as well, but I’d still splurge on the extra burgers for yourself! He made the mistake by going against the plan!", "(Shouldn’t reheat a chicken one either though, unless you really nuke it…)", "I got off of work at 7 AM. I stayed up until about 3 PM and then I went to sleep. He got off of work at four, I’m not really sure about why he went to go get food because we had had a plan to order it tomorrow for lunch/dinner. I have the same sleeping schedule every single day so he knew well in advance that I would be asleep.", "Maybe that’s what he wanted in the first place? Maybe he ordered Big Macs so he had something to show, but knew she wouldn’t eat them so he‘d get extra food?", "We can’t afford to get more food. That was the biggest issue that I had was that it was supposed to be a one time treat for both of us and I just feel like he was being super inconsiderate.", "Can you tell me what intentions he may have had?", "It’s not little thing when you don’t have the money to replace the food and you go without", "They can't afford more fast food it was a treat for one and has sensory issues which bf was aware of which while not allergies it's not something you can control \n\n so NTA", "Problem is most people who claim to have some sort of disorder are not diagnosed. Everyone just „claiming“ them and blaming them for every inappropriate behavior, and using that, as a protective shield against any sort of criticism are making it hard for people who actually have them, to get taken seriously.\n\nNot saying that is the case here but browsing through Reddit you get the feeling people without a disorder are the minority.", ">but try communicating your preferences more clearly next time!\n\nShe did. You owe her an apology.", "how? Tell me how she can be any clearer as planning it 3 days ahead specifically at a time?", "Adults don't get credit for abject incompetence while trying to do something nice. No normal people want reheated McDonald's. It doesn't reheat well.", "I’m more upset than mad, we had had a plan to order it for lunch tomorrow so that we could both have hot food. I don’t understand why he decided to get it this evening while I was sleeping when we had a plan. Especially because now I can’t eat my half of the meal.", "I don't see OP asking to be judged for their burger choice?\n\nI am also not a fan of McD but this wasn't the question.", "I’m not quite sure why he got two of them for me. I can barely afford to eat one with my calories.", "The way you wrote it, your vote will be counted as OP being TA.", "Getting fast food was a treat we cannot afford to go get another burger, which is part of the reason why I’m upset", "So he wanted it then and there, didn't want to wait and ordered you something just not to feel guilty. NTA but your bf needs to apologize, it's just not nice. He could have just ordered himself some if he really could not wait, told you when you woke up and you'd have your share left to spend on what you wanted. He wasn't thoughtful so he sucks for that.", "They don't have money for extra treats( she can't buy for herself now) so he sucks big time if he did", "What did he say why he did it as you confronted him?", "I get it that it was a treat but really, being upset at this? There are way harder things in everyday life that you might want to steel yourself to be prepared for.\n\nTo me this still sounds like someone who is sad because they can't have a burger. And again, I assume she has food at home that while not be as tasty as junk food, it isn't junk.   \n\n\nAbout sensory issues, I don't know the person so I can't comment on that with certainty, but everyone has things they don't like to eat and calling it sensory issues might be a way to cover being spoiled.\n\nHow common are sensory issues like those? Because people throughout history just ate what they had or starved and I don't think that a new autism pandemic is a real thing. Seems that a lot of people now define themselves as autistic or neurological divergent and I highly doubt that it's an actual thing.\n\nSo my vote remains.", "[deleted]", "[deleted]", "Your bf is a Huge ah in this case. NTA", "Install the McDs app. You get a free Big Mac just for adding the app.", "Well, of course he sucks, whatever his reasoning!", "He’s asleep right now so I haven’t confronted him. I just wanted to get my head on right before I talk to him about it. I felt like coming on here and getting other peoples outside opinion.", "There is a big difference between not liking something and sensory issues.  \n\nIn autism people quite common you should educate yourself before assuming op is spoiled only.\n\nIt's your judgement so your decision but it's clear you probably didn't ever had to wait and sacrifice for something only to be disappointed or we wouldn't be having this discussion.", "Not that it really matters, but I was diagnosed when I was a kid (I’m 24). It’s not just about the burger. Yes I do have food, I mostly cook at home. We made plans to share a treat, and he decided to go with his own way with it which I’m most upset with.", "OP said they can't afford another so it IS a big deal.", "NTA You are really doing yourself a disservice couching this in terms of being an issue of autistic sensory sensitivity, as if this shouldn't be a problem and only is because of your unreasonable pickiness, when old reheated fast food is just gross across the board. Sure, some people are fine with it, and good for them, but that doesn't matter.\n\nIf I know YOU don't want to eat reheated hamburgers and I create that situation because I am impatient, that is me choosing to be an asshole. You don't have to justify not being happy about it, you being unhappy is something that was done to you ... there is no unreasonable reaction here that we need to blame on autism, you have nothing to apologise for or ask for accommodation over. YOUR reaction here is the sensible one.\n\n(I am autistic and we are constantly made to apologise for how that inconveniences other people, who usually don't care at all how their BS harms us. Sometimes we can be difficult to deal with, but everyone has food preferences and this one here is just SO minor and common.)", "Most people would not eat a reheated Big Mac. This isn’t a peculiar quirk. He wanted his & he didn’t want to wait, so he did what he wanted without consideration for you. That’s rude. He should apologize. NTA", "NTA - even if you didn’t have sensory issues if you are on a diet, you want your fast food hot. No reason to eat extra calories if you don’t like the way it tastes.", "Yeah NTA - you didn’t throw some huge fit, you’re just upset that something you had established a plan for was disregarded and now you can’t enjoy something you were looking forward to. Totally understandable and OK.", "Since this seems like a good place for it (I will gladly take all y’all’s downvotes), there are a couple tricks for reheating cold burgers.\n\n1) Most microwaves have an option of power %, I actually haven’t seen one without it. If yours does have that option, take a microwave safe cup and fill it 1/3-1/2 full of water and nuke it until it is boiling. Then put the burger in the microwave on 10-20% power for 4-5 minutes at room temperature or 10-15 minutes if it is cold (actual duration depends on microwave power, so check it after a few minutes and change times accordingly). It will take a little bit, but the steam will prevent the bun drying out while reheating, and it should get the burger up to a suitable temperature for eating.\n\n2) Disassemble your burger into 3 parts: patties, buns, and toppings. Take out a frying pan, heat it up on low, and toss the patties into it (cheese side up). Toss the buns in the microwave for 10-15 seconds (just enough to warm them up and soften them). Once the patties have been heated up, toss them back on the buns and replace the toppings.\n\nThese methods won’t make them exactly like a fresh burger, but they will be far better than just tossing them in the microwave at full power.", "NTA. I understand how you feel about “complaining” about a gift but it would have been so easy to order it in a way you BOTH could have enjoyed more. No point in fighting about it but like others have suggested, mention the oversight to him and hopefully this won’t happen again.\n\nNow if you still have them in the fridge, have you tried reheating them in the oven instead of a microwave? It will be a bit more work, but since money is tight and it’s this or nothing, maybe it’s worth the effort? Open it up, scrape off the lettuce and condiments and set them aside, then lay out the buns and patties separately and reheat them in the oven, then scrape the lettuce and condiments back onto the reheated burger. Still not the same but maybe better than the soggy mess the microwave will make?\n\nEdit: here’s a vid of someone doing it with a toaster oven https://m.youtube.com/watch?v=NDV6u0BEZ0c", "Cold or reheated McDo? 🤢🤢\nNTA!!", "NTA no one wants reheated Mc Donald’s sensory issues or not", "NTA.\n\nYou can't \"reheat\" lettuce and have still be edible.\n\nBlech.", "Couldn’t pay me to reheat a Big Mac", "NTA, big macs are just gross when they’re heated up lol", "Reheat big macs is disgusting. It complety looses the taste. You are not A....but you just talk to him and order a new big mac", "INFO: Have you spoken with him about it? I wonder if it's possible that these were not meant for you and that he still perhaps plans for you two to go out together. For all you know right now, maybe they were leftover from a Trump rally and he plans to have them for lunch tomorrow. Don't rush to judgment. Communicate. Maybe there's an explanation.", "[removed]", "Trivial shit", "I don't get it, how is every next person is being diagnosed with autism here", "Maybe he thought you would be awake by the time they arrived?", "[deleted]", "NTA You don’t have issues - no one likes cold fast food. And your partner knows that and shouldn’t need to be told what he did was shitty. At this point he owns his mistake and apologizes (and frankly gives you extra $$ to get fast food next time y’all get paid). Or he doesn’t own his mistake and frankly I think that would be a dealbreaker for me personally (it’s not about the fast food - it’s about the disregard for you).", "NTA, he presumably knows about your food aversions so he's well aware that you wouldn't eat two cold big macs. That was a shitty thing to do. I would also be upset because you were looking forward to it for three days! You're disappointed! That's allowed.", "NTA and you’re boyfriend is dick. I would have been raging!! As soon as I saw that cold food I would have then asked him to re order cause that’s just rude, selfish behaviour", "NTA obviously", "NTA\n\nHe is incredibly selfish.", "Nta i mean, just order it yourself.  Nothing is stopping you from getting yourself a fresh Big Mac and he can reheat the ones he got.\n\nThe ap usually has a free big mac, for financial concerns.", "Do you have a dog?\n\nMy dogs like hamburgers.\n\nEdit\n\nIt's not just an autism thing... reheated Big macs are disgusting..  nearly any hamburger would be. Might be able to salvage the patties and use them for something like chopped up in spaghetti sauce.\n\nBut me? I'd give them to the dog.\n\n.", "NTA \n\nGetting someone a melted ice cream is not a treat. Neither is cold fast food.\n\nHe didn't get you food. He got you withered food, and  ruined your treat money. If he only got something for himself, you could get something for yourself too. \n\nHe knew it would wither before you got to it. He is T A H.", "NTA.  Your boyfriend is a selfish AH.  Did you ask why he didn't stick with the plan?", "Nta, but seriously go order yourself some fast food. It’ll be worth it and you deserve it", "NTA but omfg just have a conversation about it. Your partner just sounds like they're a bit senseless. This is so insignificant.", "NTA. Sensory issues or not, you specifically planned to go together and instead he exercised zero self control and selfishness by going by himself and tossing you cold leftovers as if that's somehow fine enough for you. The fact that he KNOWS you wont eat that makes him just a bigger AH.", "I don't have autism and I would not want cold, soggy burgers from the fridge either, ew!\n\nNTA he was selfish", "NTA - You had plans and he didn't follow through. He got you cold food instead which is awful. Especially when you have sensory issues and you guys can't afford more. \n\nHopefully you guys can have a talk about this and work things out. Make things really clear to him", "nat you guys had a plan and he just what he wanted", "NTA. It's like planning to see a new movie together and he watches it alone.", "NTA. reheated Big Mac is grim!", "A. Correct\n\nB. You made plans opie and he dismissed them\n\nC. He knew your sensitivities and didn't bother to care\n\nD. NTA, he is one though", "I would also be upset because you were looking forward to it for three days! You're disappointed! That's allowed.", "Now if you still have them in the fridge, have you tried reheating them in the oven instead of a microwave?", "I don't think you're an A-H, it was an inconsiderate thing for him to do. \n\nBig Macs are, well, big. Were both for you?", "NTA and your fiancé is. Everyone knows that fast food goes way downhill when not fresh. He knew this was a treat for both of you. He didn’t wait til you were awake to get your preferred order or let you enjoy it with him. He prioritized his own whims/cravings/impatience.", "[removed]", "Hot McDonald’s is equally disgusting lol", "yea, sensory issues aside, no one wants a re-heated burger...", "I suggest you look into food chaining. You should be actively working on anything that limits your life", "She said they couldn't afford another one. That it was a one-time treat. She's NTA, but he sure is.", "Those seem like good ideas thank you", "He threw them away", "I haven’t talk to him about it because he is asleep, but there was a note on our little white board fridge saying that they were for me", "I mean, I feel like OP was very clear about what they wanted. They had plans to do this together at a later date.", "Hey. I'm not autistic, ADHD, PTSD, Bipolar, I ain't got sensory issues etc but still I ain't eating no cold-ass Big Mac. NTA", "The reheated shredded lettuce and limp pickles...NOPE.", "Right? I don’t have sensory problems and never ever ever would I eat the soggy mess that is a reheated Big Mac * cringe *\n\nOP is def NTA here.", "opie...", "> You made plans opie\n\nOP means original poster.  It's not a word or name.  It's an acronym.  It's the letters ***O***riginal ***P***oster.\n\n-----\n\nETA\n\nIt's been pointed out that they're likely using talk to text so ignore me.", "[removed]", "what?", "Every time McDonalds comes up on Reddit somebody has to come in and act like a burger connoisseur and point out how sophisticated their palate is by proudly proclaiming that they are above eating at McDonalds. \n\nMcDonalds haters remind me of the pineapple pizza haters - they can’t see a thread where it’s mentioned without making a big deal about it. It’s like they want a gold star for being above eating at McDonalds. McDonalds sells more burgers than anybody in the world so obviously they do something right.", "McDonald’s is scientifically created to be delicious. You can think it’s unhealthy but it’s not disgusting.", "While it's definitely not the best burgers ever, sometimes you just crave something for that specific taste/texture. When I was growing up, McD's was a treat. I'm grown now (I'll be 40 this month), and I definitely prefer Five Guys, but I still sometimes just want a McD's burger and fries because of the *ways* in which it's different from the better burgers and fries I've had--it's like a nostalgia thing.", "Well, in my country the Burgerpatties are 100% meat. I know in the us it is.. something \"like meat\". So it might differ between countries.", "Especially a fast food burger, yuck", "if you thinking \"not wanting food, meant to be warm, cold\" is a \"limit on life\", you should probably be actively seeing a therapist.", "In my experience, reheating fast food makes it soggy and chicken hardens. Neither sounds like a good option", "i use to pull it apart, then just reheat the chicken and bread in a pan, instead of the microwave, then put the sandwich back together, so good! it's the microwave that ruins it.", "Saw this later :(", "Why did he throw them away? You mentioned being in a tight budget and that seems very wasteful", "Oh bummer. Well I'm still holding out hope that he means these as an extra and that he still intends to keep your original plans. If not, he is an AH.", "Yea you're spoiled. You have other better things to eat so you look at a cold burger like you'd look at bread with mold.", "There's next to no chance the BF would have been happy if the roles were reversed.", "You should actually pick off the burger and just heat that, no? You can't heat up lettuce, it will cook. That's disgusting", "I love opie", "That’s my nanny kid’s nickname lmao it really jolted me", "Maybe they were using talk to text or something? XD", "Calm down dude it was probably autocorrect/voice text", "Bot account.  \n\n[They copied this post](https://www.reddit.com/r/AmItheAsshole/comments/14s1ylx/aita_for_being_mad_at_my_fianc%C3%A9_for_getting_me/jqvokgo/).", "US McDonald's patties are 100% beef too, there's just a bunch of awful myths about fast food, especially in America, from some biased and inaccurate documentaries years ago. Sure they're still not the healthiest for you, but McDonald's in the US isn't like serving mystery meat burgers..", ">100% meat\n\nNo country uses 100% meat in anything anymore. Get with the times!", "The air fryer does so much better than a microwave.   For the fries foods though,  not a big mac.", "Historically, yes, this kind of disordered eating was still \"a thing.\" But, as you say, it was a bit \"eat this or starve.\" And plenty of people did. You also have to consider what alternatives people had. It's one thing to avoid certain foods when there are other options, but when people literally had no other options, they either forced themselves to eat it, became malnourished, or starved. It's not some badge of honor to force oneself to eat things you don't like when there are other options.", "I saw some people think it was cute on a thread a while ago. \n\nI personally hate it though\n\nJust checked the users comments, they use it in basically every comment they make. So I assume they think it is cute", "Yeah, you're right I think.  I actually think it's something like that after reading through their comments.  I am very very wary of bots in this sub however they post consistently on topic comments with no copied points.  And they are relatively new to reddit.  \n\nTheir comments seem to be more stream of a conversation so I think they likely are using speech to text.  So my comment before feels kinda dickish now.   There's lots of reasons for people to use talk to text, and they shouldn't need to worry about asshats like me picking apart things we all understood even if there's some extra letters", "Which, if you read the full post, you would have seen I acknowledged.", "I mean you seem able to communicate - talk to him about respecting plans made and not about cold burgers because that's ridiculous.", "It is a badge of honor to only be upset of things that impact your life with enough bad.\n\nLike if they had plans to go out and she finds out he went out with friends isn't a reason to break up (if done one time), but if they had plans to buy a dog tofether and he got a cat it's a much bigger deal.", "I'm not trying to jump on you after you already feel dickish, I just think the evolution of language is super interesting so:\n\nThis is actually a thing that happens sometimes with abbreviations in English. If they get used enough, they can turn into words and get spelled out. Examples include:\n\nMaster of Ceremonies - MC - emcee\n\nJunior Varsity - JV - jayvee\n\nDisc Jockey - DJ - deejay\n\nPersonally, I don't like any of those and I prefer to use the two-letter abbreviations. But the precedent is there for \"Opie\" to be a thing even without text-to-speech.", "Opie sounds cute. What's wrong with ir", "You're fine.", "Yeah I hate all of them, isn't the point of using the abbreviations to make it shorter? Why are we lengthening them again?", "Opie is a cute nickname we use for granddad (opa) in Dutch.", "INFO: Why did he order them without you?", "You're on a diet and he knows this?  And he bought 2 Big Macs for you to heat up?  I can't think of a single fast food option worse than this.  Considering what's available out there, he put zero effort into considering what would be good for you.  He is the AH.", "Y’all made plans and he didn’t stick to them.\n\nNTA.", "NTA\n\nI might be autistic, might not.  I have sufficient cause to suspect I am and will eventually seek an official diagnosis.  But growing up on a very limited budget to the point of sometimes not having access to 3 meals a day, I don’t have issues eating leftovers and am most definitely not picky in any way about food. And even I would not want a reheated McDonalds burger.  I would have eaten one out of necessity in the past, but definitely wouldn’t consider the experience a treat. \n\nLike you pointed out, most chicken leftovers can be reheated without much difference in taste or texture.  But I have yet to have that kind of luck reheating a burger. Maybe one of McD’s skinny burgers would reheat okay. But not a Big Mac. Ugh. Gross. I’m sorry you lost out on your treat.", "Autism aside, your preferences are perfectly valid and completely normal. Autism accounted for, your partner did something incredibly inconsiderate and imo stupid. Id be up the wall on some \"its common sense\" rant tbh, but i have some pretty bad emotional regulation issues haha. He didnt suddenly lose the ability to think, right? NTA.", "NTA.\n\nYou guys made a plan and your fiancée disregarded it. It feels awful to be looking forward to a treat and have it ruined for no good reason", "NTA Why didnt he wait for you??", "NTA\n\nI don't have particular sensory issues regarding reheated foods but I would NEVER willingly eat a reheated burger - let alone a Big Mac because the components can't be successfully reheated.\n\nIn all honestly, I don't even like Big Macs (or other burgers) unless I eat them almost immediately because they degrade almost immediately. The bun gets too soggy and starts collapsing from the burger and any condiments.", "Your fiancé is inconsiderate, self-absorbed, greedy. I guess he is able to enjoy the two leftover burgers, that's why he ordered them. Which makes him manipulative too, pretending to do something for you while actually pursuing his agenda...", "At first I was going to say yes, you’re the AH, but now I think I understand your position. You’re on a diet, so the fast food was something you were looking forward to as a treat after being “good” for however much time you set as a goal. Now you don’t want to waste your calorie “budget” on warmed over hamburgers. A rando on the internet wouldn’t know all of the details, but your partner should.", "He is the Asshole.", "Question, does it make much of a difference if you door dash the thing you want instead of waiting three days to order food together? Of if you went out to get the food you want on your own. \n\nDid he already know you're order beforehand and went against it. Assuming you would have eaten it had it been fresh, it doesn't seem like you're all that opposed to eating a big Mac. Just general question because I am confused about your food ordering process and wonder where the problem is coming from directly. It doesn't seem like you two have much communication if a mishap like this happens because you're asleep", "NAH, you talked about it 3 days ago. You could’ve reaffirmed the plans.", "Yeah, you’re a picky eater. YTA\n\nIt’s not that big a deal, but if you don’t like it just tell him to not order for you next time and get your own food. You’re an adult that can take care of herself.", "YTA. Your fiancé's gesture was sweet. Just eat it and save yourself from becoming a hangry monster!", "YTA. You're being a huge baby. It's incorrect to say you \"can't eat it\", you just don't like it.", "YTA I think it’s something petty and I cannot imagine how you will cope with real world problems", "INFO:\n\nDo you often think of, or said to, your partner, something along the lines of 'you can't get anything right' or 'you always screw up?'", "Cold/reheated Big Macs are grim. You are NTA. You made plans to order food together, he was selfish and ordered knowing you were asleep and knowing you wouldn't eat what he ordered if it went cold", "NTA\n\nEspecially cause you could only afford the one time. Is it that he just forgot about your sensory issues, that he doesn’t know specifically what foods you don’t like reheated, or that he was just being selfish?", "Wow, no, NTA.  That was extremely rude of him, and doubly so given that you can’t afford a do-over.  I’d be hurt and feeling like an afterthought.", "NTA. He disregarded your wishes for what he wanted to do.", "NTA. A reheated Big Mac would be disgusting af. He knew about the plan and still did this. That’s a bit selfish on his part", "NTA \n\nNothing grosser than a soggy Big Mac. He shoulda got you nuggets those I love re heated or cold", "Nta - I understand how you feel", "NTA and I'm not sure what your food issues have to do with it. You planned on fresh (hot) food together and he got his and you got leftovers.", "NTA. Tell him he can eat it. The lesson will be quickly learned.", "NTA\n\nHonestly this is when I would be spiteful and I would dump them into the trash. Because I’d be 100% positive that he knew you wouldn’t eat it, this reserving for himself a second helping “oh I thought you’d be happy… well I guess I’ll just eat it so it doesn’t go to waste.” \n\nI’d waste it. Upend them into the garbage where not even the packaging could save them.", "NTA \n\nI’m not picky about food at all and still wouldn’t eat a microwaved Big Mac..", "NTA\n\nI don't have issues with the texture of reheated food, yet even I wouldn't want a reheated Big Mac!", "NTA... i also have sensory issues with food and certain things reheated are AWFUL. Sensory issues are not something you can just \"get over\" i think you just need to kindly communicate this to him. I have alot of problems with texture of food.", "Warmed up McDonald's is fucking rank regardless whether you're neuro divergent or not. I've never heard anything so weird as saving it for later?\n\nNTA", "Nta but your making a mountain out of a mud hill", "NAH. Next time just tell your fiance your order...", "NTA, who reheats McDonalds", "NTA, but can you not drive?  Go get yourself 2 hot burgers or whatever else you want and throw the cold ones away.  Tell your partner next time don't bother, since they actually didn't really bother to wait this time.", "NTA. It makes sense to be disappointed and upset. You made plans, you were looking forward  to this AND he went and did it without you AND spent the $ to get something you can't eat.\nNot cool of him at all and you really do need to discuss it and express that u are upset and hurt at his actions/choices.", "NTA. Plans were discussed and settled in advance. Your SO broke the deal (for some unknown reason, which may or may not be legit). I know what it's like to look forward to something, even something as trivial as a fast food treat, only to be disappointed. \n\nBTW, cold Big Macs are not appetizing, and reheated Big Macs are solid vomit.", "NTA. I can get that way about food too. I don't like reheated food either (especially Chinese food, sue me. its never as good and always soggy). A big mac reheated with lettuce \\*GAG\\* gross. \n\nSeems like he ignored your sensory issues all together, ignored your plan to go get food all because he was selfish and wanted it when he wanted it.", "NTA. But, can you really not afford to get yourself a $6 Big Mac? I mean, skip the fries and drink since money is tight and you're on a diet, but just because \"we can't afford to get it again\" doesn't mean YOU can't afford to get it for yourself. Just don't get him anything.", "NTA", "YTA, get over yourself and get food you like for yourself and leave the food you don't like for someone who does.", "NTA. Was the plan to have it together? I wouldn't be happy at all if I was supposed to have dinner with someone if they had theirs and told me mine was in the fridge for later.", "Reheated fast food is inedible, NTA", "NTA, I completely understand the reheated food thing. A lot of foods I will just eat cold because at least they keep the same structure. When you reheat it just ruins some things and makes it more mushy. Chikfila keeps fairly well but I disassemble it and reheat everything separately in the oven.", "NAH. Fellow Aspie here! I totally agree, reheated burgers are a sensory nightmare, especially fast-food burgers. But I don’t think he did this maliciously. People don’t think well when they’re hungry. He probably thought it sounded good, so you’d love it, too. Obviously that was not the case. And I get feeling frustrated and angry. (This is so much easier on the outside looking in!) I get hot-headed over “silly” things. But take a moment and try to think like a neurotypical. It helps with perspective.\n\nAbove all, talk to him. Explain that while you appreciate the food, it’s not what you like (sensory issues) and not what you want (on a diet). Ask him to consider that a bit more in the future. Now, if he dismisses your concerns, that’s a red flag. If he knows you, and understands your autism a bit, he’ll be alright and move along. Best of luck, friend!", "NTA he Knows you don’t like reheated burgers, he Knew you had an agreement to order Together and his selfish ass didn’t give a f’ and just did what He wanted when he wanted.", "Was he mad at you for something? He's not very nice. Fiancé? Nah. More like ex friend.", "NTA\n\nHe took a one time treat and turned it into a gross, cold mess, thinking only of what he wanted in the moment.\n\nI don't have any sensory issues. I can literally eat anything at all. But I still wouldn't choose to eat a reheated Big Mac. Are you kidding? That's not acceptable to anyone.\n\nYou have the right to be upset and to explain to him why it's upsetting.", "NTA I don't have autism and I wouldn't eat reheated bigmacs. That was really selfish and inconsiderate of him. I'm sorry.", "NTA that’s not an autism thing, no one likes cold Big Macs. If you guys had a plan he should have stuck to it. You deserve your treat on your terms and it’s really rude to change plans then gaslight you into thinking it’s your fault.", "NTA\n\nPro tip: most things are disgusting microwaved. Pop the burger in the oven at 350 for a couple minutes and it'll be much better.", "What he did wasn’t nice. Also even if you were being picky, it’s still valid. You mentioned it was a once in a while treat and you deserved to enjoy that. Cold Big Macs are gross.", "Yeah who tf would eat reheated burgers? I don't have sensory issues or autism but certainly wouldn't. \n\nNTA", "NTA. If you're going to plan a treat, it should be hot. Especially fast food, reheated is just a desperate waste.", "NTA. I don't have sensory issues and wouldn't want to eat two cold refrigerated Big Macs. It's not really a treat for you!!", "NTA.  Sounds like he got himself some big Macs, and you csn get yourself a treat whatever it may be.", "NTA. Going back in an agreement that doesn’t benefit him as much as it hurt you is the real AH move here. He would have still gotten his food if he had waited. All he did was keep you from enjoying your food. Reconsider the fact that you are marrying someone like this.", "You never mentioned talking to your SO. Did you try that?", "This penny-ante nonsense isn't even worth commenting on, I probably should stop now.", "What's the whole story here?\n\nIs he normally this way?\n\nMy boyfriend and I work opposite schedules too.  I don't expect him to wait for me to wake up if he's hungry. Likewise with him.  If we happen to be hungry at the same time we order together or go out together.", "Nta. Cold big macs are garbage. They taste disgusting reheated. So nasty. He sucks. I would be mad. And I'm bipolar with bpd odd and adhd so I would be super super mad.", "If you have cash app or something similar, I would happily send you $20 to go get new burgers from a fast food place. When you’re on a diet and have been looking forward to something, it can feel especially devastating to not get it. \n\nYou’re NTA. I’m not even sure he’s really the asshole either, it sounds like he may have just not been super tuned in to what you needed in that moment.", "This is currently the top post and IS a problem because it doesn't actually have a judgement. I suggest that you include N-A-H (No Assholes Here) since you don't think it's a big deal. \n\n I absolutely disagree, though, and think that OP's boyfriend was a massive, thoughtless asshole. It's a huge deal. This was something she was looking forward to, and if you know anything about autism, our brains don't \"switch tracks\" easily. Disappointment registers HARD even if we really, genuinely want to be easygoing about stuff. This is going to feel upsetting to her for DAYS now, and I feel awful for her.\n\nAnd the thing is, it's a big deal because it wasn't an accident or a mistake. \n\nHe knew from the start. He knew about her sensory issues (which as she points out, are not \"picky eating\" - sensory issues with food are neurologically based, and have to do with how our brains and bodies perceive texture, taste, etc. There's literally nothing we can do about it.  Eating something \"wrong\" for us would be like if someone made you eat a poop sandwich; it doesn't matter if the food we're given is \"technically fine\" . . . our brain is signalling that it is IS NOT EDIBLE and we can fully feel queasy and sick from eating it). He knew that she had been looking forward to this meal for ages and that it was meant to be a treat. And he knew that they didn't have the money for her to buy something different once he spent it.\n\nAnd he went ahead and selfishly spent HER half of the money on something he KNEW she wouldn't be able to enjoy. \n\nHe just didn't care at all about ruining this for her.\n\nThere is no world in which this wasn't an AH thing to do.", "I don't understand the story. If they in fact went out to get the food, why would the food still be in the fridge anyway?", " For the fries foods thoug.", "I don't mind cold pieces of pizza. When I get take out pizza, I deliberately leave a few pieces that I could eat later or as breakfast the next day. \n\nIf say, my parents and I (we live close to each other and regularly eat dinner together) decided the day before that we are going to order pizzas the next day, I expect to be notified when they order so I can choose what I want and also eat warm pizza. If I were to come to their place and find out that they already had their pizzas and they left me a cold one, I would be hugely disappointed and (h)angry.  \n\n(To be fair, I don't see that happening with my parents either because in cases like ordering take-out, they rely on me)\n\nBut it is indeed very thoughtless and even disrespectful. Especially if you communicated about the plans before hand. And extra especially when it concerns your partner!", "I hate using food apps but the deals on McD's are worth downloading it.", "Maybe there's an explanation..", "Right? This is the level of inconsideration that has actually destroyed multiple relationships of mine. If you cant be bothered then why show up at all. Not saying OPs fiancé is like this on the regular but if its a recurring problem with no solution (even though you know the solution is actually really simple if you just think beyond yourself), its not worth it. Suddenly youre having a meltdown over a burger and then youre the one who looks crazy.", "Thrown that nasty soggy condiment covered lettuce and crap in the garbage! You're reheated burger will much better without them. Put fresh ones if you have but I don't recommend putting the old nasty condiments back on the burger. That's just gross.", "Option 2 is how I do it", "Id say, this isn't about being picky. Not the right word. The boyfriend is just an ass.", "Way to search for a way to blame op on this. too funny. You can always tell the dudes who would selfishly make the same decision by these types of comments.", "We didn’t have the money to order at the time and were planning it out for after we got paid that’s why we waited for three days", "It's literally that there's more awareness now, especially that it effects woman differently than me . Obviously there will be more people realizing they have/may have it when it's pointed out that it isn't always just the stereotype it used to be portrayed as.", "Lots of self diagnosed people out there,  so maybe not even diagnosed.", "Yeah. He intended to break the agreed upon plan where EVERYONE would got a hot, fresh, tasty meal, and instead knowingly got the food early so only HIS was fresh, leaving her cold leftovers.", "My autistic teen can't talk let alone write up stories or have a relationship.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "😂😂😂😂👌🤪", "No I normally try to see it his way and see his intentions rather then actions", "What made you jump right to that? Projecting much?", "NTA. Big Macs reheated are vile.  The bun is mushy and the special sauce (aka thousand island dressing with dehydrated onions) is grass after the heat of the burger and cooking in the fridge.  Plus the lettuce.", "[removed]", "That is why OP is upset. He went alone. Not only did they not get to experience the time together, she didn't get to eat at all.", "Look, I don't like that particular fast-food either. But your comment is not helpful and contributes nothing to what OP asked.", "Especially since it has shredded lettuce on it. Microwaved lettuce grossed me out", "NTA\n\nI have 0 sensory issues and would NEVER reheat a big mac. So gross. I know you are trying to justify your anger but you don't have to. Fast food really needs to be eaten when you get it. No fast food is reheatable if you ask me. I'd be upset and refuse to eat it as well.", " I would not want a reheated McDonalds burger.", "I’m sure she has a lot of things she works on. I have very little sensory issues, I’m not eating cold fast food because it’s disgusting lol most people find it disgusting. No one needs to work on that.", "You must not have the ‘tism, eh?  \n\nSensory issues and picky eating are very common.  I personally have them. There are a lot of foods that have textures my mouth can’t stand. Like I have to spit it out. \n\nI am also a supertaster. Which means along with my autism sensory issues, I also have a very sensitive tongue. For example, alcohol of any kinds all tastes like everclear cause my tongue is really sensitive to alcohol. \n\nSo all this to say food chaining is useless in our case.", "Our of curiosity, what do you hate about food apps? I love them.", "What explanation could there be for purposefully getting his fiancé food they can't eat? It isn't like McDonalds was running out of big macs.", "Yeah, preferably throw on new condiments and lettuce, but if money is tight, the old stuff might be better than buying a whole thing of 1000 islands dressing.", "So… he deliberately went against the agreed upon plan, got himself hot tasty food and left you nasty cold leftovers, then when you mentioned this, he had a tantrum and threw “your food” away? Honey, he’s showing you who he is: a selfish, manipulative AH. \n\nINFO: What else does he do that makes you feel bad when HE behaves selfishly?", "Probably because you weren't going to eat it. If he had known you were going to reheat it, he probably wouldn't have thrown it out.", "Damn.", "Right???? I didn't feel like OP was lacking any clarity. They have opposite sleep schedules. There's a window when they're both awake. They planned this for that window. He decided he didn't want to wait. It's pretty clear.", "That's not how I interpreted it. I read that they had made plans to order food but not agree which food to order.\n\nHowever, I am happy to be corrected on this.", "Having no disorder IS the disorder on reddit🤪", "Please stop doing that. It’s our actions that show who we really are. Intentions are well and good, but if we constantly behave like an AH, we’re an AH.", "What was his reason for not taking you?", "I hate when my husband gives me a limp pickle ☹️", " Your partner just sounds like they're a bit senseless.", "[removed]", "[removed]", "anthony…", "I guess I was just confused by the telling of the story.", "I worked at a McDonalds. I pointed out the maggots in the little holes on the prep table that you pushed the \"debris\" from making sándwiches to a manager. She just said don't worry about it. I quit the next week. That store still stands and I haven't ate McDonald's since 1987.\nDon't get me started on how many hours the nuggets sat lukewarm.\nFast forward 10 years and my best friend was an assistant manager at a different store. Worse issues. She only stayed for the healthcare until she got married.\nYeah, McDonald's is garbage.", "I have honestly never understood anyone loving McDonald. any cheap simple homemade burger will be cheaper and 10 times better tasting. Hell any non chain snackbar will make you a better tasting burger for cheaper.\n\nI firmly believe mcdonalds only succeeds because of marketing, because kids got lured in with toys, and because it's stable across the globe, you know what you're getting.", "I’m going sound like a 🤓, but It’s not that hard to do, just takes some planning.  For example if the burger comes with lettuce, tomato, pickles- take those out immediately and refrigerate- don’t let the heat wilt them.  Ask for the sauce on the side of possible.    \n\nThen you can you can either warm the meat in the microwave or a pan with a little oil, and pan toast or steam the bun. \n\nMcDonald’s cheeseburgers can be simply microwaved for 25 seconds and they come out 95% the same- sometimes even better because it’s actually hot instead of lukewarm from the drive home.\n\nYes it can be inconvenient-  but the point is reheated with some skill and forethought can taste pretty dang good.   I wish I could prove it instead of just writing about it", "I can't stand the stench of even cold lettuce on hot food. I have however come around to shredded cabbage on my Mexican.", "Maybe he's got mental health issues, like ADHD, so he might just forget it?", "In comments, OP has stated that they made plans to order food at a later date and that they cannot afford to order food again. Instead of waiting until that later date, the partner ordered food without them, which was both food they did not want, and meant it was refrigerated as leftovers.", "Please read.", "WTF is wrong with you, nerd? That’s not easy.", "I don't find this to be true at all. Anything that is not still warm, even if not warmed up with the burger patty, still has some indefinable gross \"cold, stale McDonald's\" taste to me. For me, anything that is not eaten immediately is trash.", "Ask for sauce on the side? What? You don't go to Micky D's for a build-a-burger kit, that's what grocery stores are for.", "Yes. I understood that. My point was to make it very clear from the outset what food you do and don't like so that whenever an order is made, the wrong food won't be ordered.\n\nI still think this is too trivial to get really angry about. At the end of the day, it's just fast food. But maybe I'm not appreciating the bigger picture. I understand that in this situation, fast food is a big treat and of course a treat is something the Op wants to enjoy. There may also be an issue here with the partner who has been inconsiderate towards the Op (and maybe this isn't the first time), so perhaps this isn't just about 'fast food'.\n\nThanks for the clarification.", "[removed]", "I guess for someone who cooks all the time and wants my family to enjoy the leftovers - it’s quite easy. \n\nI don’t know why you guys are getting mad about sharing info.   At most it takes 2 minutes to prep the food for saving in the fridge, and then like 8 minutes to reheat.  More if you’re also retoasting the fries.\n\nYou just need more patience in the kitchen instead of hostility towards a tutorial.  It’s straightforward, just takes some time and skill", "That’s a bummer, however I have confidence in my own ability to do it well.  \n\nIf it didn’t taste good, my GF wouldn’t eat it.  I wouldn’t bother if it was a bad result.   \n\nI’d say things like big macs are not good to reheat, but a simple cheeseburger or quarter pounder are easy.   It’s hard to understand if you’ve never actually done it competently before", "If the premise is you know the burger will be eaten later, like the OP- I’m saying you can do things to make it easier to reheat.\n\nDo you understand? The whole point of my comment to give people encouragement that a burger can be reheated if needed.  It’s really basic stuff", "Feeling feelings is not dishonorable. Being disappointed and hurt is not dishonorable.", "This is literally THE worst takes I have seen in so long. I hope you don't have kids. I can just hear the racists and ableist words now \"Kids in Africa are starving and you won't eat my well done brick of steak????? You're out of my house you ungrateful heathens\" - Hazilon probably", "I'm starting to believe you're the boyfriend with all your comments. Or at the very least a dude who would also selfishly get food for himself and leave leftovers in the fridge.", "Bot, down vote & report", "OP didn't buy the burger with plans to eat it later. She wanted it hot and already assembled, but BF went without her and let her burger wilt and soak in the sauces. That's the whole point of the post. She didn't have a chance to save it.", "Someone who has patience and skill in the kitchen does not have a need to get fast food.", "I'm not sure why you are getting so much flak for this, either! This can be a great solution if you have a coupon for buy one/get one or something similar. I often get 2 meals at Schlotzky's because I will have a killer coupon, and now I have 2 meals for the price of one and sometimes for less than it would cost to buy all the ingredients, just to make it for myself. I usually order the second item as something that reheats well or can be eaten cold, but depending on the coupon or special that's not always an option. It's a good hack to be aware of, at least.", "You forget that said feelings influence negatively on OPs relationship with her bf. Some feelings should make you go 'wait, I'm an adult, I should not act on this feeling and remember that I'm better than my impulses'.", "This is how language works. It evolves and changes over time. The word nothing is no longer used to mean vulva.", "Jesus- OK, I’m just trying to let everyone know for the next time - it’s possible to reheat a burger.  I’m not trying to pass judgement on her situation - I’m just saying to possible to reheat a burger in response to the OP I responded to saying no one wants to eat leftover fast food.", "I have patience and skill in the kitchen and my house likes eating fast food because it has a specific taste.    McDonald’s fries are specific.  \n\nSometimes you don’t have all the ingredients to make something - and it’s easier to go out. \n\nI cook all the time and still enjoy fast food.  So don’t make generalizations?  Why are you being so hostile?", "That's what he should have done and waited for her to eat like they had planned.", "I’m aware language evolves! I just think this is a dumb evolution.", "NTA. McDonald's burgers are literally inedible once they get cold.", "YNTA. As for your fiancé, does he acknowledge his wrongdoing and understand that you have every right to be upset? It makes all the difference in pondering if he’s just someone who committed assholery or if he’s a true AH.", "Uh everyone knows McDonald’s is not food once it isn’t hot. You aren’t sensitive. \n\nI don’t think what he did was sweet. I think he wanted it when he wanted it and is spinning it as a mistake lol \n\nNta", "NTA.  big macs have lettuce and it tastes like crap heated or even reheated.", "That's not an autism thing. \nReheated McDonald's tastes absolutely disgusting. That's an everyone with taste buds thing.\n\nNTA", "Nta and I work at McDonald’s I don’t eat anything reheated from there lol it’s either cold or eat it while it’s hot lol", "NAH imo.\n\nMaybe he just wanted McDonalds and was close by but was trying to take you into consideration as well. You guys can still go together. If this was a nice restaurant or sit down situation I'd get that. I wouldn't eat it heated up either.", "Info. Have you spoken to him about this op or are you just stewing over it in silence? This seems like something that could be resolved with a conversation and does not require an amita post. Go talk to your fiance and ask him why he deviated from agreed upon plan. He likely has a solid explanation for his behavior", "Neither is the asshole, you just need to get over it, it's not a big deal, I doubt he meant to upset you, so he's not the asshole either, communicate this to him instead of coming to Reddit for bad advice\nWhen you involve others in your relationship (unless things are rly rly bad) it's usually a good way to drive a wedge between you and your partner\nI see a lot of comments talking crap about your fiancé cuz of this post and we didn't even get to hear his side", "YTA, if you're aware enough of your \"cold burger sensory issues\" then you're also aware enough to acknowledge that it's not a problem for everyone around you. Being so picky (yes picky, again, you are self aware) is just a way to cause some drama and is begging for attention. It comes across like a bratty child. If it's really that big of a deal then make your plans revolve around you making the trip so that you get your food the precise and exact way you want. Being aware of yourself and your issues and still being mad about it are what make you the asshole.", "Sensory issues........... sounds like entitlement issues to me.", "“I’m not picky it’s an autism thing” yeah YTA", "NTA - Is he going to be upset if you don't eat it?  If so, he's the AH.  I wouldn't eat that shit either, and I don't have the sensory issues you do.", "NTA", "NTA - I forgot you don’t like cold burgers? From McDonald’s with sauce and congealed fat? Ew. This is NOT and autism thing and something your boyfriend should understand that most people wouldn’t like!\n\nCold burger or not the other issue is that this was something you were supposed to do together!", "Hi OP,\n\nI don't think you're the asshole for feeling upset over the situation. I think even expressing your disappointment would be fair so you can avoid this happening in the future, as long as you make sure to show appreciation for your fiance's attempts. \n\nI hope you can get your cheat day the way you want to soon! \n\nUltimately this isn't the biggest issue in the world so I wouldn't get too in your head about how it's made you feel and what would be the best solution. it'll work out if you stay kind and patient.\n\nbest of luck!", "NTA. Obviously.\n\nAlso, you don't have to justify your dislikes.", "You NTA, he is for not being patient to order when you were awake too.", "I don’t think it’s just an autism thing, the lettuce is just mushy when reheated. Nta", "NAH just make sure u get your own food next time, problems avoided.", "It's a really annoying situation.\n\nBut it's over, so try to live with it and not let it affect your relationship.", "NTA and neither is your BF (except, if this kind of situation happens repeatedly).", "NTA.\n\nAnd that's so sweet of your fiance to get another burger.\nCommunication always wins.", "NTA - Big Macs are barely edible fresh.", "Grow up", "NTA\nI’m glad he went and got you more, that was sweet. My fiancé also got me food once from Taco Bell, and left it on my night stand thinking I’d be happy to wake up to food. I was so disappointed because I don’t like cold food, and also I would have much preferred to go and get what I like rather than what he chose. The actions are nice in their heads, but to us it’s just a tad annoying. It’s defitnely hard to bring up without sounding like and ungrateful ass when talking to them lol", "Lol", "Is there a No ones the asshole? Seems like not a big deal from both sides. Even if it’s a waste your partner can eat them instead of you and you can just go get some new burgers.", "For what it’s worth OP I totally get it. Sensory issues suck! \n\nGlad you two worked it out :) \n\nI can’t eat reheated burgers either for the same reason!", "Sounds like ARFID.", "i cant believe i’m seeing NTA and that the bf is.\n\nthis is most certainly a NAH jfc.", "[deleted]", "NTA. Burgers like big macs get soggy so fast..imagine having to reheat that lol. I’m generally fine with cold food like pizza or fries but burgers are not it.", "WHO THE FUCK EATS COLD HAMBURGERS???", "OP should just go get themselves something they like and let him eat the cold burgers.\n\nNTA", "I agree.\n\nBut I don't understand why OP says they can't afford to go buy another big Mac. Aren't they less than $5? I think I would make bf buy me another one. He can eat the cost, even if he has to skip a couple of meals of his own. Who plans to eat something together and then goes alone and puts the other's share in the fridge? Especially fast food. I don't have sensory issues and I would be disappointed and angry.", "Pretty sure only morbidly obese Americans don't have an issue with reheated fast food.", "Aw thank you for the offer I appreciate it. I can’t accept your money though", "I think that's partly why OP is so annoyed. She and her fiance had arranged to order the food together when they were both awake, but he didn't bother waiting for her. If he hadn't changed the plan, it would've been fine. OP's NTA for being upset that he didn't do what they agreed to.", "Might want to reread the post since you got the entire issue wrong.", "He was asleep at the time and I wasn’t sure if I had any right to bring it up as an discussion. I wanted to know if it was worth it or if I should just let it go", " The boyfriend is just an ass.", "Yeah, it's not an oddity on OP's part. People who would eat an reheated Big Mac are the odd ones. \n\nThe only hope (and that's a long shot) is to deconstruct the burger entirely, reheat the patties and the bun in an air fryer or toaster over, toss the green bits, and then reconstruct the burger. And because a Big Mac has cheese, you'd probably have to replace the cheese entirely.", "I reckon I've spent too much time on reddit because my mind immediately went \"'C. He figured he'd get a hot meal and a reheated meal with their one-splurge budget\"", "Opie 💀💀💀", "[ Removed by Reddit ]", "I'm not autistic but the thought of a reheated McDonald's burger sounds vile. It's something that needs eaten when it's bought.", "Not the op but also autistic with food issues. The oven doesn't help for me. I can't explain it tho", "big macs have lettuce which is nasty as hell when it's hot.  also, if it was a single piece of lettuce that you could take it off but it's shredded and has sauce sticking it to the rest of the burger.", "OP's situation reminds me of the time my boyfriend wanted to make dinner for me, but he got hungry like an hour before I got off work (with a 30 minute commute). So he made fried chicken (one of his favorite foods, not mine), and it was extra spicy (I'm ok with some spice, but almost never seek it out and I don't like super spicy). So the result was I came home to cold, soggy, too spicy chicken. I think I got through half a tender, but it was so disappointing.", "Yeah, I’d say pizza is like the one thing I don’t mind eating cold or reheated.", "Like man, maybe if he'd had them put all of the parts in separate boxes (used to work there and people did request this) for her to configure at home, it would be less nasty but it still would take away a major part of the treat: not having to make your own damn food!", "What kinda deals are on there? McDonald’s is so expensive", "He threw the burgers away? One: That’s very wasteful. Two: He deliberately got something when there was plan and went against it.\n\nHow long have you guys been engaged? He should know about your issues. He very deliberately did this. If you don't want to break up perhaps a small pause on the engagement or couples counseling? This would be a deal breaker for me.", "So for something you two have to plan out and pitch together, he went and ordered without you, wasting money on food you wouldn't be able to eat? NTA", "Just looking at the other side. She said she was asleep. I don't see why they couldn't just pop the meat patties in the microwave. It is the only warm part of a burger. You don't put the whole burger in the microwave. She talked about textures, bread from the microwave is gross. So it looks like he got them on the way home and seen that she was asleep.  Was she wanting this to be \"date\" night and he just wanted some burgers?", ">Not saying that is the case here\n\nSo what was the point in posting that?", "Why is a legitimate question that you happen to not like 'projecting?'", "You really do have some other stuff to work out then", "I'm trying to write \"'just eat it cold, it's like a meatloaf sandwich and people eat that cold\" but my gag reflex keeps interrupting me hahaha", "The special sauce is actually mayo with ketchup and a mild hot sauce", "bot", "😭😭😭😭", ". . . . .okay . . . . \n\nKinda overreacting though.", "What? Why is being an inconsiderate arse a reason to kill himself?", "McD burgers are nasty in general.", "I wasn’t replying to OP", "Mcdonalds has gone so far downhill they're barely edible when fresh; reheating them is definitely not worth the $16 that 2 bigmacs cost.", "for me I hate needing to download an app for every place I go to lol", "Every food app that offers you free stuff for using it.... Consider what permissions it's asking for on your phone. I looked at the McD app and what it wanted from my phone, I noped away from it hard.\n\n\"Personal Info: Name, Email, User IDs, Address\"\n\n\"Messages: Emails and Other in-app messages\"\n\nRemember, any service that offers you something for nothing, is selling your personal data.", "I'm old enough that I got used to using the internet through web browsers.  If people had to download hundreds of programs, one for each website, there'd have been a user revolt.  \n\n&#x200B;\n\nWhy can't anything work in a browser anymore?  I have to have 100s of accounts, and the info keeps getting leaked/stolen.", "Daily free large fry coupons, some bogo stuff every now and then. \"Buy this meal get a big mac free\" things like that. I *believe* they also do rewards but dont quote me on that i could be thinking of a different fast food place!", "Currently they have a few breakfast biscuits/sandwiches for $2.50. One time they had it half off. 40% off a ten piece, 20% off $10 or more, bundle deals and such.", "I would eat it plain honestly. OR that sauce is SO EASY to make there's a good chance op might even have the sauces on hand to make a small amount. It's mayo, ketchup relish and a couple seasonings like garlic and onion powder. Super easy", ">There are way harder things in everyday life\n\nWhat kind of daily challenges do you experience?", "Didn't you just write:\n\n>If you have better food (not junk food) at home eat that and be glad you're making better choices.\n\nSo now you're pissed off that /u/cadraig would rather eat something else? Which is it?", "I was commenting on the Post above:\n\n„I don't know about the autism thing here, it seems that an entire generation is autistic has anxiety and PTSD so I really can't say anything to that other than it sounds like you're being spoiled and calling it autism.“\n\nThat’s what my answer was directed at.\n\n\nWhat was your point in posting that?", "I don't disagree with this.  The actions are, by and large, the intentions.", "Made me laugh", "You're in love with Sheriff Taylor's son?", "100%", "This is a bot who literally copied the comment they're replying to and just enlarged the text (new obnoxious bot technique)", "I'm not sure why explaining something is over reacting.  \n\nAll I did was show where the letters came from and explain it.", "Careful, the McDonald’s army is out in droves 😂", ">I firmly believe\n\nYou can believe whatever you want, you can believe the earth is flat if you want, you'd still be wrong. The fact is, /u/MPLS_Poppy is 100% correct. [Food Science](https://www.mcgill.ca/foodscience/what-food-science) is a very real thing, even if you aren't educated about it. Fast food is scientifically engineered to be addicting. Stating this fact doesn't make you part of the \"McDonald's army\", that's ridiculous. It's simply stating what is.", "No one says you are wrong but this is something they were supposed to do together. This is way too much for something that was supposed to be a treat", "Entirely too much work for McDonald’s lmao.", "This. I already don't like being so reliant on my phone but to have to have dozens of food related apps is killer.", "Well, yes I understand that. Honestly if you're on tiktoc or basically any app your information was already handed out. \n\n&#x200B;\n\nI guess to me, to believe your personal information isn't already out there totally naive and a little daft. But I work in information, so I know no one is actually safe.", "Oh you’re right. I’ve seen it recreated, now that you mention it.", ">What was your point in posting that?\n\nI was trying to determine if you were on topic. You weren't. Now I know. This has no value for the OP, who was diagnosed as a child.", "Not me! 😜", "please this made me laugh so hard", "for what purpose? I don't get it...", "I thought it was cute the first time I saw it but it got old very fast.", "No it happens when people use voice to text. It's annoying, but not worth the time it takes to correct", "But you're explaining something obvious. It's far more likely that they're phoneticising the acronym (as we do eith 'okay') than that they've heard the acronym outloud (it's an internet thing) and have mistaken how to spell it. \n\nYour post sounds blunt and condescending. It sounds like you're angry at them for saying it in a manner that you don't like.", "Apparently. I know I didn't say anything untrue, and they probably do too.", "created to be addictive is not the same as delicious... you can't posdibly think McDonalds magically created the most delicious burger possible. McDonald has 1 goal and that is money. they have created the cheapest thing that the most people will tolerate. being the most delicious is not something they care about. otherwise premium burger restaurants wouldn't exist. or are you even saying McDonalds tastes better than a burger created by a chef in a good restaurant?", "Let me ask you something: do you door dash or get food delivered?", "I’m not sure I understand your point.  I’m just trying to encourage people that fast food leftovers can taste great with a little effort.   It takes 2 minutes to separate and put the food away, and then 5-10 min to reheat.  \n\nMy tutorial Is not a comment  OP specifically- it’s just sharing how to reheat fast food burgers. I don’t know why it’s so controversial", "Microwaving a double quarter pounder for 30 seconds is too much work?", ">My point was to make it very clear from the outset what food you do and don't like so that whenever an order is made, the wrong food won't be ordered.\n\nShe did, he just forgot:\n\n>We spoke about it and he honestly forgot that I don’t like cold burgers.\n\nThis edit was made less than an hour ago though so you wouldn't have seen it when you made your own comment.\n\n>I still think this is too trivial to get really angry about.\n\nGenerally yes, but if you can't afford to buy more and it's considered a treat, it would be frustrating. Especially if you can't eat it due to sensory issues, rather than just being a little picky. My husband has ordered a few things for me that I was like, \"Ehh...\" but I ate it anyways because while it wasn't my favorite, it wasn't a hard pass. OP has stricter food requirements, is on a diet, and has financial concerns so these moments probably sting more.\n\n>But maybe I'm not appreciating the bigger picture.\n\nYou seem like a kind person so I think it's just a difference in how you view things. I'm guessing that for you and me, buying this stuff is barely an afterthought but they're on a much tighter budget so it hurts more. The diet only adds to the tension because it's hard to lose weight even without other considerations to be mindful of.", "Are you really this dense? The \"cold burgers\" are a symptom of the disrespect.\n\nAnd not just disrespect of plans - disrespect of OP. \n\n\"I know this is a special treat you planned to have on this one occasion, let me go ahead and make it so it would be nasty to a thinking human with *no* sensory issues. Mmmmm, glad I got mine hot out of the oven.\"\n\nOP does seem able to communicate. I'm less sure of you.", "Yes it does not.\n\nWould you enlighten me what your posts have valuable to say to OP? If I‘m off topic so are you 😊", "People do have a habit of running things into the ground here. Marinara flags? Iranian yoghurt? 6 foot sub?", "Also O.K. - okay. I simply love nerdy language facts.", "Just because you assumed a tone doesn't mean it has that tone.  \n\nI explained something to a new redditor (they've said in other posts that they're newer and didn't know some things and have asked questions regarding cake day and such).  \n\nInforming people of things isn't mean. It isn't malicious.  And just because something is obvious to you doesn't mean it is to everyone.  \n\nThere's nothing wrong with providing info.  There is something wrong with making your own assumptions around tone then acting on those assumptions like it's fact.", "Me? Not fast food, no.", "Fuck yes", "Talk to text?", "Not assuming. Reading.", "I heckin appreciate your comment.  I didn’t expect so much pushback on what I wrote.  I guess I’m just really passionate about leftovers and have really dialed in my processes over the years.   Cheers to you", "But you do get food delivery?", "Your loss", "Yes.", "🤷🏽‍♂️", "🎶🎤2 whole beef patties, special sauce, lettuce, cheese, pickles, onions on a sesame seed bun, Microwaved? 🤢 NTA!", "NTA, glad you've spoken about it and things are worked out.  \n\n\n\"I forgot you don't like cold burgers\"    \nWho DOES like cold burgers though?!", "NTA. Who eats cold big macs?  I have ZERO sensory issues and i wouldn't eat a reheated big mac. Your BF didnt \"forget\" you don't like cold/reheated fast food. He is manipulating you and lying if he said he \"forgot\". Buy him a cold big mac and see if he eats it reheated. I guarantee you he won't. Its gross. No one wants to eat that.", "Aw, babe… NTA. NTA all the way.\nI’d be ENRAGED if my partner changed the plans we agreed on days ago without telling me, ruining the one rare opportunity I have to eat fast food. ESPECIALLY if he knows about your sensory issues, like WTF?? You just couldn’t wait?? Cold McDonald’s is NASTY, reheated McDonald’s is even WORSE. What a damn tool your boyfriend is, I can’t believe this.", "NTA\n\nI am not Autistic, but my son is, but still....reheated burgers, even Big Mac's are disgusting! So, I don't blame you! ICK! \n\nGlad y'all worked it out.", " NTA\n\nDon’t have autism or food aversions, and I think cold fast food is disgusting", "> he honestly forgot that I don’t like cold burgers. \n\nYou might consider having him see a neurologist.", "NTA\n\nThe update makes me even more angry\n\n> We spoke about it and he honestly forgot that I don’t like cold burgers.\n\nThis is just so much BS. Nobody likes cold burgers, or reheated ones for that matter.\n\n> He was trying to be sweet by getting me some food to wake up to and thought it would make me happy.\n\nThis is even more BS. He served his own whims, realised he messed up and tries to play the 'I did it for you' card.\n\nWhy is such a tool your fiance? You can do much better.", "NTA\nI don’t know if a Big Mac is different in your country compared to one in Sweden. But I say a reheated Big Mac 🤮 I eat almost everything and I love leftovers but I need to be extremely hungry to eat a could or reheated burger from a fast food chain.", "I really don't think he is being honest with you. No one likes cold or reheated fast-food hamburgers. There's no way to \"forget\" that. Keep your eyes open in the future for other things he may prioritize over your wants and needs. NTA. I would be super upset myself.", "NTA but just curious, is there someone out there who likes cold burgers? There's a reason why McDonald's sells them warm. You may be even more annoyed by it but I assume 90% of the population would absolutely not be happy with stone cold burgers", "Oh, ffs.\n\nJust order something else.\n\nYTA. Grow up and quit whining.", "First world problems. 👎🏼👎🏼👎🏼", "What the hell is this post. I honestly have no idea how you can get upset over the timing of a McDonald's order. Like seriously? Y'all don't have other issues going on haha", "Who organises McDonald three days in advance ?", "That's some strong addiction crying over junk food...", "I just wanna point out that, despite you being autistic, this was handled way more maturely and effectively than how the vast majority of neurotypical couples I know would have dealt with it.", "Nta, but its a autism thing is wied", "NTA but neither is he. No one was being malicious or at least it doesn't seem like it from my point of view.", "My answer to reheating fast food is having a toaster oven. I hate how it comes out of the microwave so the toaster oven makes it tolerable", "Don't think you are the asshole, don't think he is either. Seems like an honest mistake.", "You are being a picky eater, just because you have autism doesn’t mean you can’t eat it, it is ok to be picky but you will not die if you eat it. I would say you are NTA, but you both could have planned better on who was going to go when and know what the other wanted.", "Why wouldn’t you just go get your own when you woke up? Fast food seems like a weird thing to “plan” 🤷🏻‍♀️", "NTA\n\nAlso it's not an autism thing - cold burgers are gross and not even a thing! I could see how maybe a plain burger could be reheated in some way that wouldn't gross me out, but with all the wet stuff on a big mac and the fact that lettuce doesn't keep once it's got the sauce and heat on it...it's just a disgusting mess!! That cannot be reheated. Your boyfriend has no common sense at all. A big mac is not like cold pizza!! Geesh.", "Did he ask himself if HE would love to eat a refrigerated leftover big mac? Maybe he should ask himself that...he's not very bright!", "NTA. \n\nMaccas has a temperature window for their food to which when it passes it ends up going from a good tasting burger to tasking like ass.", "NTA ..heart in the right place so he gets points for it but i dont think most people enjoy reheated food over fresh", "Because its easier to eat it and then just say he \"forgot\" she doesn't love reheated big macs, and then blame her for being an autistic if she isnt happy.", "THANK YOU I totally thought that was BS for the same reason.", "first world problems...", "Why should she have to suffer with less than food because someone didn’t follow the plan.", "That's exactly what her bf did. He bought the food he liked, and left her cold burgers in the fridge, which no one would ever eat.", "We were waiting to get paid", "People who need to budget", "I get that perspective. Like, you appreciate the thought, but at the same time… it’s all wrong and now you’ve the burden of either sucking it up and taking something you didn’t want/ask for or looking ungrateful as you said. \n\nI compare it to someone knowing you’re super into a hobby so they buy you something they think you could use in it. Except since they’re not as deep into the hobby they don’t really know what your preferred materials or equipment is and instead they get something that’s kind of useless to you. \n\n(Talking from experience. I do appreciate that they thought about me, I just feel bad when it ends up going to waste because I have no use for it)", "i didn't say it's not a big deal? i said if it's not a big deal to op, then they should talk to their bf. \n\nif it is a big deal then i think they should break up. \n\nbut i won't just tell people to break up.", "My MIL always says of McDonalds, “the chips don’t travel!!”, which is to say, they are shit reheated", "Bot account", "I find it hard to believe that OP fell for this rubbish. I bet if she looks back on the relationship she'll find more situations where he wheedles himself out of a hole he himself dug out of inconsideration, probably gaslighting her as well.", "Okay so the plan was to order after she wakes up, but he ordered too far in advance and her food was cold. She said it's his money. It's not like he spent her money while she was sleeping. This is more like he said he was going to buy her a warm burger and then he bought her a cold burger. You can't really get mad when someone says they'll buy you something and then they don't do it. Seems like princess behavior to get mad.\n\nEdit: I would also add that nobody is suffering here. She doesn't have less food. It's just cold.", "I have successfully reheated some fries in an air fryer but that’s like *it* for edible reheating I’ve discovered and even then it’s imperfect (source- also some sensory issues)", "Especially two Big Macs? It was probably a mushy mess by the time she woke up.", "People really don't get eating things, they think any and all food restrictions are just the equivalent to a 5 year old throwing a fit because they don't like carrots even though they liked carrots yesterday.\n\nI've been trying to be able to eat ham for years. I can eat bacon, I can eat turkey, I can eat other pork products. But no matter what I do, actual ham just isn't doable for me because there's a part of my brain that it pokes every time that says \"hey this meat is rotten spit it out\". I think it's the slight sweetness to it, it's too similar to the times I've accidentally eaten other meats that were out of date.", "Ahh they changed it.", "Wow. I just paid three bucks for a small fry. I’m def going to download the app. We don’t eat McDonald’s a lot. Maybe once a month. But I hate that it’s so expensive now.", "Thanks! It sounds like the app is definitely worth it. We probably only\nGo once a month on average, but I’ll check it out", "Only reason i thought it might be was i saw a different comment chain where the person saying Opie was called on it & answered saying they use talk to text.\n\nNow some possibly like using Opie because they think it's cute or something, but there's probably one at least using talk to text too.\n\nHey, now you can be \"TIL\"! :P", "Yeah our large fry here went up to $6, almost 7, after tax and thats just ridiculius to me. If you can give them away for free daily in the app why on earth are you charging so much for them without it? 😴", "I guess you are as old as I am.", "It may happen sometimes, but others definitely do it on purpose", "Adding to this, I’ve seen the first and third used spelled out most often when they’re used as verbs- “I’ll be emceeing the event tonight” or “Josh deejayed the party last weekend”. It seems weirder to write them as “I am the emcee” or “He was the deejay” but I guess by the same principle there’s no real reason why not. I haven’t seen JV spelled out like that, but then sports has never really been my thing lol", "Delicious isn’t a binary. You’re a weird dude. You’re basically saying that because caviar is delicious potato chips can’t be. Because beef bourguignon is amazing then Taco Bell never hits the spot. I promise you no one who works in restaurants thinks like this. You’re just a snob.", "I cook all the time too but this is literally just.....making a burger. If I wanted to do that I wouldn't have gotten fast food.", "Yuck! I guess I was projecting, because I use voice to text and it's never on purpose", "sure mate why bother actually engaging in conversation. have a nice day", "You can make a burger in under 10 minutes including prep time?  That’s amazing.  You always have buns, ground meat, Tomatos, lettuce etc on hand ? That’s really cool! \n\n\nPersonally, I like being able to get an extra cheese burger / whatever to eat later - like the taste of McDonald or chik fil a - and being able to reheat that in under 10 min with minimal effort is great for me.\n\nI’m so sorry you can’t see the utility in this.  But I’m dubious of your insinuation that you can make a burger from scratch in the time I can thoughtfully microwave something.", "Because this isn't \"reheating\", this is literally buying a burger, taking it apart, and then remaking the entire thing. As someone who loves cooking it takes away the ability to control portion size and seasoning, and as someone who likes the occasional takeout it eliminates the whole *point* of takeout, which is not cooking at all. It truly only works for the very specific purpose trying to cut down the cost of a meal, which OP clearly wasn't trying to do.", "I mean, you’re a snob with no perspective. There is so much classism in the way you talk about food. As someone who worked in restaurants I find it kinda gross.", "you know that's not true.. if you actually read my comment that is. Because I specifically mentioned cheaper options being better. how the fuck is that classist? I'm saying McDonalds is too expensive. I only brought up more expensive versions because someone stated McDonald was scientifically the most delicious possible, which is insane.\n\ny'all are delusional, good day.", "Gotcha, no issue with enjoying that obviously. But just to prove my point: I don’t get food delivery, ever - because I feel the 30-60 min of the food steaming in a bag makes it  not taste good to me. \n\nThus I think that demonstrates the effectiveness of what I suggested about prepping and reheating burgers myself.    I don’t like stale tasting food either, which is why I’ve perfected my own methods for reheating food I got myself", "What's to work out? He forgot, people do that. I bought my dad a cheeseburger once, despite the fact I've known him for 27 years and knew he jated cheese for about 22 of them.", "Mods - relationship advice, please remove", "I love that you communicated and resolved the issue. It should always work that way", "You either eat mcdonald in first 10 min or you can throw it right into bin.", "\"Reheated food causes sensory issues.\"\n\nWhat? I mean, I get that you don't like something reheated. Not everything reheats well. But this makes it sound like some kind of medical or serious mental health issue.", "Love your Update!  I hope you enjoyed your hot burger!", "NTA and I can't imagine ANYONE (who wasn't very drunk) would want to eat a cold big mac, EW!", "NTA who thinks anyone likes cold burgers? That’s insane logic, default thinking should be no one likes a cold burger", "YTA. Grow up.", "I think you overreacted but communication is key", "Maybe he loves big macs and isn't picky about reheated burgers and those were extras for later, for him.", "NTA. Nice gesture on his part, but this shows you a hard truth about most men. They're truly completely clueless 99% of the time!", "Yea, you were being silly. Glad y’all made up now work on those household finances.", "NTA. Also, it's not an Autisim thing, McDonald tastes terrible reheated.", "NAH", "> No one should ever ~~reh~~eat a Big Mac. 🤢", "He has autism too", "I’m confused remove what", "No Assholes Here - NAH.\n\nEveryone Sucks Here - ESH.", "That all sounds absolutely insufferable.", "Yeah totally. What a trash boyfriend.", "Nothing personal, but similar posts that I tried to post here were removed by mods because I was asking for a \"relationship\" advice. So its kinda like a fight with mods :D have a good one.", "The congealed grease ugh", "You’re having a laugh…", "I’m not understanding your lingo! What do you mean?", "You're right, what you actually described is making a burger but taking away the ability to season and portion to your own liking, which is literally the whole fun of cooking. What you described is a cheap imitation of cooking.", "if you were dying  of starvation would sensory still be an issue and would you die over it? Just want to get a gage on how bad it is", "YTA you made a post over a $4 burger. Go get your own then.", "As someone who has autism, stop using it as a crutch.", "Who likes reheated burgers ?????", "NTA. Even with the edit, Im wondering wtf. If this was like a local burger place that had quality burgers, I can understand thinking that burger in the fridge is a good idea… but MCDONALDS!?!  Those are barely edible “fresh”. I dont have autism but would be upset about a couple mcdonald burgers in the fridge. That should just be common sense, not something to remember about someone.", "Esh. Autism or no, a cold big Mac is a weird hill to die on. And sounds like he has tried to make it up to you.", "FYI you are picky due to autism. You can't say you aren't picky and then go on to describe being picky. You are picky because you have sensory issues because you are autistic. Accept that you are picky.", "NTA\nBut as you stated, he forgot. If this happens all the time, that's another thing but if this was genuinely a mistake then don't be too harsh on him.\n\nI know for a fact some men can be absolute goldfish when it comes to remembering things, especially if they've been busy or stressed.", "NTA. I'm glad you talked it out.", "The fact that you mention sensory issues with cold food tells me everything I need to know about you. YTA.", "Something about this post feels like it's just karma gathering.", "I get this. I really do. It’s that one thing all week your looking forward to. Then BOOM it’s taken from you. It’s almost enough to break you down and make you cry (even if it’s just a Big Mac) lol. \n\nBut I will say. In all things. Try to have grace. Just like he forgot you don’t like reheated food (grant or those things are grooms reheated even if you don’t have autism), if he’s working on just remembering things better, or was having a hard day etc. I’m glad you talked and he’s gonna make it up to you. That’s what relationships are about!", "Lmao I read “inedible” as incredible and was confused 😂", "What an asshole getting her food. Lol", "Baked lettuce and dry bread. Delicious.", "Lmao 🤣", "calm down, not everyone is a diva, there are people who can eat a cold burger without acting like its the worst thing in the world", "he doesnt owe her shit!", "I'm a card-carrying burger snob. I travel miles on quests for the perfect burger. I'll talk at length about burgers that I've had, good and bad. I've iterated on my own technique for homemade burgers until I get it just right.\n\nI also fucking love a McDonald's burger.", "Haha seems like you’re the one making a big deal over one person’s opinion, try not to get so offended when someone doesn’t like eating the most unhealthy food that exists", "I stopped using the McDonald's app when someone on the other side of the US from me was able to use my account to order $50 worth of food. TWICE. Within a week of me downloading the app.", "HAHAHA LMAOOO. Be for real. Imagine breaking up over food 😭😭", "For anyone without an air fryer, the best way to reheat fries is to toss them in a dry frying pan.", "So you’re claiming some sort of superiority for suffering from an addiction?? I don’t think it’s as much of a flex as you think to say your addicted to eating shitty food", "The only people claiming superiority here are the r/iamveryculinary burger snob assholes.\n\nMcDonald's have refined their products over decades to be as delicious as possible, and they've been successful with it. That's not hard to understand.", "I didn’t claim reheating food in the microwave was proper cooking? Did I?\n\nI merely suggested there is a way to reheat your favorite fast food burger and it come out ok.  And it’s faster than making burger from scratch when you don’t have the time or ingredients. \n\nWhat is wrong with you? Why are so hostile to someone sharing how they reheat food?"]}