{"id": 21488, "submission_id": "14sbqld", "title": "AITA FOR VACUUMING IN THE MIDDLE OF THE DAY AND POTENTIALLY WAKINF UP MY NEIGHBOURS KIDS AND HUSBAND?", "selftext": "I 22 F have lived in my apartment complex for 4 years, and I have an 8 year old daughter -I don’t want to hear any comments about my age and my child’s age, I’ve heard all the words under the sun, I don’t need strangers on Reddit giving me the same crap-\n\nMy job allows me to work from home, and as a bonus, when I don’t have a lot of work to do, I can do my household chores like laundry, vacuuming etc. I don’t vacuum everyday, maybe just like every couple of days, usually late mornings early noonish. \n\nThe issue stems from the fact that I can hear everything my neighbours from the side, above and below me do, it doesn’t bother me as such but they can hear anything I do, again, I don’t play loud music, the only thing they’d likely hear is the tv if it’s on very loud or if I’m doing vacuuming, but because I do it in the middle of the day, I never get complaints up until now.\n\nCoral, 34, moved in 3 weeks ago, were cordial, and although cliche and weird for normal standards, a couple of days after she moved in, she came with a batch of cookies to give to me and the other neighbours and introduced herself and she seemed nice, but a couple of days ago, she knocked on my door as I was vacuuming, she was all smiles and happy but told me in the most condescending way possible that her husband had worked a late shift and their 12 month old baby boy was sleeping and was wondering if I could not vacuum right now, and that she would be happy to call back over again when they’re both awake so they could continue on, and I said no.\n\nThe time of day in which I do vacuum is not stupid early or really really late, I chose it because most people are gonna be up so I’m not disturbing a lot of people. \n\nI told her that I’m not gonna change my time to suit her husband and baby, albeit it’s not their fault for working late or you know, being a baby, and that she’s just gonna have to suck it up and deal with it. She started going off at me, calling me a childish whore, hinting at the fact that I was a teenage mother, called me a bitch, and then stormed into her apartment again. I’ve talked to friends and while they say I’m entitled to clean my apartment whenever I want within reason, I could have been a bit nicer, and that how I reacted was an dick move.", "created_utc": 1688655654, "permalink": "/r/AmItheAsshole/comments/14sbqld/aita_for_vacuuming_in_the_middle_of_the_day_and/", "score": 4872, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I feel like the asshole in the way I replied to her. She was being condescending and having a “snobby lady” act to her, and that really pisses me off, so I was just rude back, even though this was the first issue between us.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA, I work the overnight shift and understand others in my building don't.  Instead of expecting them to put their daily lives on hold I bought a white noise machine and got some amazing silicone ear plugs.  You're not vacuuming at an unreasonable time.", "NTA.\n\nIf she didn't want to live in an apartment with paper-thin walls, she shouldn't have moved into an apartment with paper-thin walls. People do shit during the daytime. Her husband might bitch and moan about the noise, but that's not an everyday thing and he can mitigate it with earplugs.  The toddler is not going to fucking notice once he/she has been put down.", "NTA, doing it at night would disturb everyone else and this is a normal time of day to get things done", "NTA \n\nFrom what I've seen her attitude and tone pissed you off and not the request itself. And she quickly showed her real face and opinion about you when you said a simple \"no\" so you know you weren't making up her being condescending at the beginning.", "NTA", "You’re not the asshole. It’s your private space and I don’t think that vacuuming in the middle of the day is disturbing public peace or something. \n\nOfcourse we may never know how the actual interaction went, it may have been a bit better to say that you can’t stop vacuuming right now but you’re open to suggestions on when it would be best to vacuum in the future. \n\nAsking you to stop and wait for her okay is incredibly entitled", "its always smart to maintain the best relationship you can with nieghbors,.. if god forbid an emergency arises, they are the ones who can help and make the difference.\n\nNTA for vacuuming at a very reasonable hour. Your nieghbor is an AH. I would call your landlord and let him know what happened, chances are this is not the last time you will have to deal with this bad nieghbor.", "NTA.  What are you supposed to do?  Check with all your neighbors any time you want to do potentially loud chores?  In my experience if you give an inch they'll take a mile.", "NTA. You’re vacuuming at a normal time. Unfortunately hearing every little thing is part of apartment living. As long as the noise is within reason then don’t give it a second thought.\n\nEdit- to those voting E S H, why do you think it’s a reasonable request to ask someone to stop a basic household task in the middle of the day?", "NTA.\n\nAs a parent of two young children, the world does not revolve around me. As obnoxious as it is, our neighbor loves to cut their grass right at bedtime during the summer months. It's not unreasonable for her to do so. It just happens to coincide with bedtime for our kids.\n\nWe've never said anything to our neighbor because she's not doing anything wrong. It's annoying, sure. And I can see how a parent might think their request was \"reasonable\". But at the end of the day, having a kid doesn't mean everyone around you has to change their behavior. \n\nI do think your friends might be onto something. Sorry if this is too much since this isn't really an advice subreddit. But your post reads as you having a confrontational and abrasive attitude. If that carries into your regular life, that might be part of the reason your neighbor got upset with your interaction together. Obviously she crossed a line by insulting you. Without being there and seeing the exchange, it's impossible to say how things could have gone better. I just think it seems plausible you could be nicer. But we don't know each other, so I might be totally wrong!", "Esh\n\nShe started by asking nicely, *you* are the one that became confrontational, so she decided to lower herself to the level that you brought it to, so neither of you come off good. \n\nYou even began this story confrontationaly with the readers. You started by trying to make yourself the victim. \"My two kids and I live in an apartment\" and \"she hurled unnecessary crude insults at me\" would have sufficed.", "Obviously you can vacuum when you want during the day. But the way she framed her request seems pretty reasonable to me. I can't hear how condescending her tone actually was, but I feel like you could've been a bit more accommodating. Of course, nothing excuses her outburst after you said no. ESH.", "ESH. She asked nicely and you were super rude? Yikes", "It’s hard to say. By your own words, she asked nicely at first, and you didn’t respond nicely. You don’t want to, and you don’t have to, but I do not get the impression that you even considered altering your vacuuming schedule to be neighborly. She should not have turned on you but I’m wondering if that could have been avoided. ESH.", "ESH.\n\nShe came to you with a reasonable request. You didn't have to adhere to that request but if you were going to say no, why be so aggressive about it? \n\nShe's your neighbour. She came to you and your neighbours with cookies. She clearly wanted to make an effort with you all. And there is so much value in getting along with people who live outside of your home.\n\nBut what she said to you in response of your outburst was disgusting.", "YNTA for wanting to clean in the middle of the day in your own apartment. You may be a little inconsiderate for her family's needs and wishes and you could have accommodated her request but your are not obligated to. To blow of on you for simple saying no to her request was out of line especially going on a personal level. You being a young mother has nothing to do with the whole situation. It is not lunch time nor is it late at night nor is it in the early mornings. A baby will be asleep a lot of the days worht and not everyone can schedule according to the needs of one baby. They sleep most of the day like what?", "ESH-\n\nShe asked very politely and you were a dick about it.\n\nStill its your right to vacuum during these hours .", "ESH, In addition to being needlessly rude, you said you do it because it wouldn’t bother most people, and now you know that it does bother a significant portion of the people who actually hear it. (~¼ units next to you) Will you change your timing now?", "ESH.  You’ve admitted it and she was awful.", "YTA. Not for vacuuming,  but for being an ass to a reasonable request.  You could have said no nicely. Or said when you could do it, but no, you had to escalate. I agree with your friends.", "YTA\n\n99% of the responses here are completely missing the point that this sub isn't \"Am I Entitled To\" or \"Is It My Right To\" (as usual). It's called \"Am I The Asshole\" for a reason: because sometimes you're absolutely entitled to do something, but doing it is nonetheless a really obnoxious, asshole-y thing to do. Which is absolutely the case here.\n\nFirst of all, your entire argument is that you choose to vacuum at that time because \"it won't bother most people\". And yet your neighbour is literally telling you that it IS bothering her, which voids your argument, since she's one of the people you're supposedly trying not to bother. Is logic difficult for you?\n\nSecondly, contrary to what another commenter argued, she's not even necessarily asking you to vacuum at night when it might bother people. She's just asking you to give them a few hours so her husband can get some rest. She's asking for basic thoughtfulness, and she even offered to communicate with you and let you know when he was up, which means that you don't have to do any guesswork. And yeah, maybe it wouldn't work for you; but you weren't even willing to give it a try once or twice? Super asshole-y.\n\nThirdly, she came to you with a very reasonable concern as a neighbour, was polite about it, and you came back at her with aggression and rudeness, for *absolutely no reason at all*. You don't want people to judge you for having been a literal child when you had a kid, which is fine (I actually don't judge you, my heart breaks for you), but I'll be damned if I won't judge you for being 22 years old and not having learned a damn thing or grown up at all since then. You're STILL behaving like an aggressive, immature 14-year-old. Sad and worrisome, given that you're raising a child.\n\nAnd finally, a lot of people are judging E-S-H because of the hateful things your neighbour said, and no, she shouldn't have said them. But the reality is that she wouldn't have said a single one of them if you hadn't come at her the way you did. She was reacting, not aggressing. And I'm not going to judge her an asshole for *responding* to you being unbelievably rude to her for no reason at all by matching your energy.\n\nYTA. It doesn't matter what you're \"entitled to do\". The point is that you're thoughtless and an AH of a neighbour.", "And that's why vacuuming and making any kind of noise between 12 and 15 o'clock is forbidden in German apartment buildings.", "YTA\n\nYou escalated the dispute. You could have accommodated her request and all would be well but you \"stood your ground\".", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI 22 F have lived in my apartment complex for 4 years, and I have an 8 year old daughter -I don’t want to hear any comments about my age and my child’s age, I’ve heard all the words under the sun, I don’t need strangers on Reddit giving me the same crap-\n\nMy job allows me to work from home, and as a bonus, when I don’t have a lot of work to do, I can do my household chores like laundry, vacuuming etc. I don’t vacuum everyday, maybe just like every couple of days, usually late mornings early noonish. \n\nThe issue stems from the fact that I can hear everything my neighbours from the side, above and below me do, it doesn’t bother me as such but they can hear anything I do, again, I don’t play loud music, the only thing they’d likely hear is the tv if it’s on very loud or if I’m doing vacuuming, but because I do it in the middle of the day, I never get complaints up until now.\n\nCoral, 34, moved in 3 weeks ago, were cordial, and although cliche and weird for normal standards, a couple of days after she moved in, she came with a batch of cookies to give to me and the other neighbours and introduced herself and she seemed nice, but a couple of days ago, she knocked on my door as I was vacuuming, she was all smiles and happy but told me in the most condescending way possible that her husband had worked a late shift and their 12 month old baby boy was sleeping and was wondering if I could not vacuum right now, and that she would be happy to call back over again when they’re both awake so they could continue on, and I said no.\n\nThe time of day in which I do vacuum is not stupid early or really really late, I chose it because most people are gonna be up so I’m not disturbing a lot of people. \n\nI told her that I’m not gonna change my time to suit her husband and baby, albeit it’s not their fault for working late or you know, being a baby, and that she’s just gonna have to suck it up and deal with it. She started going off at me, calling me a childish whore, hinting at the fact that I was a teenage mother, called me a bitch, and then stormed into her apartment again. I’ve talked to friends and while they say I’m entitled to clean my apartment whenever I want within reason, I could have been a bit nicer, and that how I reacted was an dick move.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "She shouldn’t have to alter her vacuuming schedule to suit the new neighbors. She’s vacuuming at a normal time of day for noise to take place. If the neighbors are on a different schedule, it’s on them to adapt, not OP. They make earplugs and/or headphones and white noise generators for exactly this situation. \n\nNTA", "lol \"reasonable\" she's making noise during the day (not during quiet hours) husband and baby need to adapt to living in apartments or move into a house if it bothers them that much", "What a pathetic response. You’re too busy being an asshole about OP having a kid while she was a kid (when you don’t know her situation at all) to leave an intelligent comment.", "It depends on the rental contract. Where I life this only applies for weekend (or only Sunday I'm not sure in this one). But it's common courtesy to not make loud noises between this times during the week too.", "LOL, absolutely fucking not.\n\nCoral had ample time to check out the apartment and discover that the noises within were not to her liking. She chose to live there anyway. Why should a neighbor have to STOP doing useful things within their own domicile when they have the time to do it?", "I agree she doesn’t have to.", "[removed]", "Your comment has been removed due to a [rule 1](https://www.reddit.com/r/AmItheAsshole/about/rules/) violation. Please note this section of our rules:\r\n\r\n> Don't lecture people about the rules (use reports).\r\n\r\nFurther violations may lead to a ban. **[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "I mean... you're not wrongvfor vacuuming in the middle of the day when it wouldn't bother most people, but it sounds like she asked you nicely and your response was pretty rude. Why couldn't you wait an hour to vacuum? It's really not an unreasonable request.\n\nI live in an apartment, too, and yes, there is a reasonable expectation of noise from neighbors. But we're all courteous of each other and if someone asked me to hold off on vacuuming while their child napped, of course I would do that.", "She came with cookies and asked a simple thing. You could have been nice about it.", "You know how people like to look back fondly on the era when you could knock on your neighbour's door and ask for a cup of sugar? Based on the responses here, a lot of you would react to that kind of request by saying, \"No way! You're not entitled to my sugar! You should've gotten yourself more sugar when you were at the store! Your emergency is not my problem!\"", "You could have used this chance to be an awesome neighbor, say it’s great they let you know they have a atypical schedule and then adjust.  Sounds like your schedule is flexible, so…why not flex?  \n\nDo you have to change?  no.  But expect to be met with the same energy you show them.  If i were them i’d start have doing chores and making noise at hours that bother you if you continue down this path 🤷‍♀️", "ESH.\n\nWhile you are doing nothing wrong by vacuuming your apartment, your own story describes your response as confrontational and frankly somewhat childish. You aren't an asshole for vacuuming, but when a neighbor makes a polite request, you can at least return the politeness, even if your ultimate answer is \"no, I will not change my behavior to be more convenient for you.\"\n\nObviously your neighbor went nuclear and at this point I would not even speak to her; talking to you that way is infinitely way over the line. You may want to consider reporting the interaction to the apartment complex. I say that because sometimes people like this can be petty and if she goes to your complex and makes some shit up, they'll tend to believe her because she got their first.", "NTA vacuuming at a reasonable time is not inconsiderate. We can’t live our lives according to other people’s schedules. When I was night shift I bought blackout blinds and earplugs. When I put my kids to bed I’d pick up the toys and run the hoover round the living room, by that time they were sleeping. You shouldn’t tiptoe round babies and I’ve walked the floor with a colicky baby it’s not general background noise that kept them awake. (I’m not talking about blasting noise).", "ESH She asked nicely and your response seemed kinda rude. And if you work from home, why can’t you just vacuum at like 3pm instead of 11am? Would it be that big of a deal? \n\nBut I also agree with people saying if you work night shift, don’t move into an apt building where you can hear your neighbors.", "ESH\n\n>I told her that I’m not gonna change my time\n\nIt's vacuuming, it's not that time sensitive.", "ESH; her for being rude, you for being unwilling to accommodate them at all. Surely there's a time they're awake that you can vacuum?", "Someone with a boombox that periodically turns on without a reliable on/off switch has no right to complain if someone else makes a little noise.", "YTA. \nI mean she was just asking and offered to tell you when it’s okay again, also just for that day I suppose. It’s not that big of a deal to pause the vacuuming for an hour or two", "NTA - her comments were uncalled for. You're vacuuming not taking a broom to the walls and intentionally making noise to upset her. So she wants you to live your life around her schedule? She's in the real world and she's just going to have to deal with noise, especially living in an apartment complex.", "NTA\n\nYou can vacuum whenever you want, within reason. However, I might have asked if there was a time that would be less inconvenient and if it was reasonable I’d try to accommodate.", "ESH She was rude; your age at the time your child was born is irrelevant. However, apartment living sucks and if it is ever in one’s power to be kind, that’s what you should do. She probably could give you a general idea of a good time to vacuum. Should you *have* to do this? No. Is it a nice thing to do? Yes.", "NTA She has to hoover too, I assume. How do you think she would have reacted if you had gone to her first and asked her to stop hoovering in the middle of the day for the reasons she cited? She would have lost it with you in all likelihood. I may not be the best person for advice on this. My neighbour has complained about the noise my dehumidifier makes at two in the afternoon. I was on your side by the title of your post alone.", "NTA. Ambient noise is part of apartment life, and honestly a lot of parents don’t bother to curb noise during naps because it helps babies learn to sleep through sounds. Maybe don’t tell her that though, probably won’t help you here😅 but I don’t think vacuuming in the middle of the day makes you an asshole. She wasn’t an asshole for the initial ask but BIG yikes on that name calling.", "INFO\n\nWas it a one time situation or did she ask to never do noisy things at this specific time?", "NTA.\n\nEvery time you want to do *anything* that might possibly make noise.   Ask your neighbor if it's a convenient time for *them*.  \n\nEvery single time!\n\n I would like to clean now, is this a convenient time for *you*?\n\n I would like to cook now, is this an acceptable time for you?\n\n I'm having guests over.  What time would be best for you in regards to possible noise?\n\nI'm about to watch a movie, is the time convenient for you?", "NTA.\n\nThis is apartment living it sounds like and she has to adapt.  While you could have said it nicer (I wasn’t there so not sure how you might have sounded) her reaction is over the top.", "ESH \n\n\nYou did nothing wrong, other than using all caps in the title.", "Based on your opening statement, I suspect you might be TAH but there’s not enough info here to make an informed assessment.", "It's a vacuum, not a leaf blower. NTA", "Oh man, NTA. It is totally reasonable to move about your home, watch tv, vacuum, and do all the normal activities of life in your apartment during the day. If it was super early in the morning or late at night then it might be a reasonable request. But if you're between the hours of, say 9am and 7pm there is zero room for argument or requests.\n\nRest assured, you are totally fine. The fact that she brought cookies and seemed nice early on is completely negated by the fact that she threw a temper tantrum on your doorstep when you said \"no\" to her unreasonable request.\n\nIt was ok for her to ask. It was ok for you to say no. Her reaction was not ok. There's nothing more you need to know about this person.", "YTA. Easy to accommodate a simple request", "YTA You have a lot of flexibility when you vacuum. Vacuuming by itself isn't loud; if if you turn up the TV loud enough to be heard ovia vacuum, that is way too loud.", "NTA. Late shift workers are fully aware that their schedule will not line up with people working normal shifts. They usually have ear plugs and blackout curtains/sleep masks.\n\nThe only thing you could have done was to be considerate and ask her what time works for her and see if that fits your schedule too. Telling her to suck it up and deal with it was a bit rude, but not enough to put you in asshole territory.", " It would have been a small nice gesture that cost you nothing especially since you aren't bound by a schedule and your immediate go to response was to be rude. Your neighbours response was also terrible though so ESH.", "INFO: What time of day? You seem to avoid saying what time it is, just saying it's not really early or late.", "NTA.\n\nWhen you live in an apartment, you’re going to hear your neighbors from time to time. My downstairs neighbor can hear my cats run from one end of my apartment to the other when they are playing(albeit one is a bit of a hefty gal lol). My next door neighbors dog barks every single time someone walks past our doors, and of course you hear it. It’s part of it. As long as someone’s not being excessively loud or doing it during typical “quiet hours”, then you just gotta live with it. I had a friend like your neighbor, and it never went her way when she threw fits like that either. Needless to say we are not friends anymore 😂", "NTA but prepare for a lot of night time noises if you piss her off", "Apartments suck and the entitlement is incredibly irritating. If nothing else, it encourages people to prioritize getting financially to the point where you don't have to share walls one way or the other. Man those situations make me feel petty. I would want to just run the vacuum for kicks. Anyways, nta. Live your life. If it's too much for them, they're welcome to do whatever or nothing at all. Who cares. Not your problem.", "NTA let your apartment manager know what happened.", "If this was just a one off thing, then YTA. She asked nicely you say ? He worked a late shift and baby sleeping? Maybe it was a bad day all around and they just needed this one time, ya know? Do you have ocd, just curious if you're vacuuming every other day and you work from home you're not likely tracking dirt in, this I'm really wondering bc I've dealt with it.", "NTA\n\nHer hubby needs a white noise machine, or simple earplugs. Easy fix. I work 13-2300 outside in the heat right now, and my wife snores like a bear! Earplugs and a box fan make ALL the difference.", "YTA for your reaction. It would have hurt nothing to delay your vacuuming by a few hours. It's not like she told you never ever vacuum without her permission again, she's asking you on this specific occasion, and she asked you nicely. You're within your rights to say no, but you could have responded nicely. And frankly as you had no reason not to be helpful, I think it's safe to say you chose to be actively unaccommodating.\n\nShe then reacted really badly, in all fairness. However you'd been pretty rude first.", "NTA. I bet you have to listen to their damn baby at all hours of the night, so they can listen to your vacuum.", "NTA, do your thing!", "I has my 1st daughter at 16 and my second daughter at 20. So long as you're a good mother, fuck what people have to say. \n\nNTA and good on you for shutting that shit down asap.", "I used to work midnight shifts... so I found a building that I knew would be quiet, with walls thick enough to block that kind of noise. I never expected others to change their lives to suit me. NTA.", "Hell no NTA. You can vacuum any damn time you please in your own home. Your neighbors are beyond entitled and delusional.", "NTA.  I'm also convinced we must be neighbors. Politeness is key and while your neighbor had a decent request, her response when you said no was inappropriate. Maybe, in the future, something could be worked out. And just like yours, my neighbors have no qualms with screaming as loud as they want whenever they want, but they get mad when others make any form of noise.", "NTA\n\nShe can chill with her attitude while you clean whenever you want to.", "NTA. When are you supposed to vacuum if not the middle of the day? That is bizarre. Also, I vacuum when my own family is sleeping and it’s fine. It’s not like you’re throwing a party.", "NTA. You're vacuuming during appropriate times of the day and when it's convenient for you. She doesn't know your work schedule, so for all she knows that might be the only break you have in the work day to vacuum. \n\nAlso, apartments aren't exactly the place to live if you don't want to ever hear your neighbors. She has to expect some noise, especially during waking hours.", "Nta you are just follow the building rules", "Nta. She could have got a house, so her husband and child can sleep in peace in the middle of the day, rather than a flat. You live in a flat, you expect to hear noise.", "NTA. Even if it was reasonable of her to ask you to stop vacuuming in the middle of the day (which it wasn’t at all) saying “I’ll tell you when it’s ok to do it” is so stuck up. It’s good you stood firm now because it sounds very much like she would have been quite happy dictating forever when you can and can’t vacuum and who knows what else.", "NTA. You did the right thing. If you had acquiesced, she would have kept asking for dumb stuff.  \n\nNoise is part of apartment life. I lived above a loud dj for two years. In a way, I appreciated it because it gave me a license to be loud as hell.  But, I was SO happy when he left.", "NTA. She’s insane for asking you to change a very simple task and not do her due diligence to mitigate the noise during loud hours. It’s the middle of the day. The privilege of asking people to wait to do things is when you live together :) If you’re in any kind if housing situation where you share a wall, be ready to handle noise and do something about it if you work a non typical schedule. Or move.", "NTA - I literally played vacuum sound videos on YouTube to help my son sleep when he was a baby.", "Oh christ, people like this are exhausting. \nYou're not obligated to be bound by someone else's schedule. \nIf they need silence, they should live in a well acoustically insulated building. They can't expect that on a whim. \nNTA", "NTA. This is a regular daytime noise.", "NTA...Id actually be louder now...🙂", "Depends entirely on how things went down and what/how she actually asked. If I'm vacuuming at midday and someone asks (nicely) for me to wait until later in the afternoon, then I don't see anything wrong with that. Unless it conflicts with some other commitments. But then I'd try and find out what would be a good time. Being a good neighbour can make a huge difference to life in that space. But if someone comes stomping over and talking to me like shit, then I'd be inclined to push back.", "Hm. \n\nTechnically the advice you’re getting is defensible - it’s your space, do what you want -  but I’m of the view that you should try to collect friends rather than enemies whenever practical. \n\nI might go back to that lady and talk about schedules. Maybe you (like me) prefer to set a routine and do the vacuuming at a certain time. Perhaps you can adjust, or explain why you can’t. If you work from home maybe there is some wiggle room.\n\nOf course you do what’s good for you, you don’t have to let night shift neighbors rule you. But they are neighbors. There’s an implicit connection. \n\nSo I think a follow up chat would be nice. It would show that you’re ready to expect and to give courtesy. Even if the vacuuming continues to bother them they cannot accuse you of being disrespectful or inconsiderate.", "It’s hard to make a judgement because I think it really comes down to how you spoke to her. If you politely declined her request you’re not an asshole. If you were rude at all then yeah you’re probably a bit of an asshole.", "Fully TA. It was reasonable request from a new neighbour. A decent person would err on the side of a positive trial, rather than a middle finger outright\n\nBe better", "ESH. I think it’s clear in her reaction to you that your neighbor is an AH. And it’s just vacuuming at normal hours, nothing wrong with that. BUT, you could have maybe delayed just this once but made it clear this is a normal time you vacuum. Neither of you reacted well.", "Nta. If the adult is bothered by noise, he can get earplugs, turn the tv or a fan on, etc. And it's good for a baby to have to learn to sleep through noise, otherwise they'll be a light sleeper their whole life", "I'm sorry, you could have been a bit nicer? NTA", "NTA. I mean, I totally would’ve waited to vacuum bc it’s not a big deal but it’s your space and you’re entitled to do what you want even if I personally think it’s silly or rude", "Yeah how you responded is what got you in this mess.\n\nThat said… she sounds like she’s matched the emotional intelligence and you two are on par.\n\nYou’ve had a kid. You know how hard it is to navigate a baby and a guy working shift. I would have at least asked when he finishes shift work usually and then just changed my schedule.\n\nYou don’t need to vacuum at that exact time", "NTA.", "NTA\nHaving lived in the dorms and in my old apartment you could hear ppl vacuuming but that's just kind of a fact of life. It's too inconsistent for me to fall asleep to so I use a fan. Guess what? I don't hear anything when that's on. My old neighbor had a similar schedule to me as we'd both be up vacuuming at 1am.", "NTA\n\nAs long as your vacuuming falls within the hours deemed acceptable by your municipality, you're golden.", "NTA you weren't doing anything wrong. She can ask, but that doesn't mean you have to agree, and her attack makes her a nasty piece of work.", "Honestly, living in an apartment building, you need to expect that your neighbors are going to be loud regardless of the day or night. While we have a right to ask for silence overnight, there’s not much we can do about it if you have someone living above you below you were across the hall from you. So she has no real expectation to silence at any time of the given day. So no, you are not the asshole.", "It sounds like she was courteous when she asked, but you weren’t obligated to change your plans for her during reasonable hours.  You could probably replied in a nicer way that sounded less combative, but your NTA.  Her response to not getting what she wanted was totally uncalled for and she is the AH and crossed a line.  You don’t need to start a war with this woman, but if she wants a quiet place, then she should ask the landlord to move apartments or move out", "NTA\n\nI've has complaints for worse and I still it's reasonable to play my guitar at 5 in the afternoon.\n\nI feel bad for people working unusual shifts or have children, but it's something you've got to deal with when you share a wall with other people.", "NTA. I live in an apartment and have a 3 month old. I’d never dream of asking a neighbour to not do normal daytime activities in daytime to accommodate her naps. \n\nApartment living by nature requires living around the noises of other people living.\n\nIn your shoes, I’d maybe have asked if the little one has scheduled naptimes and agree to *try* to work around it in future but I likely wouldn’t have made any grand promises.", "NTA you are not doing anything not normal. If she had something like..my husband just finished chemo..that might have been dickie of you. Vacuuming in the middle of the day is when you do that..duh. And sorry for her, living in an apartment complex? Good fucking luck it's gonna be quiet.", "NTA. I, personally, would try to accommodate the neighbors because of the baby, but I’m a self-professed people pleaser.\n\nOP, you should tell her she can come over and vacuum for you 3x a week if she likes, since she knows the schedule best, and see what she says.", "Think I'd be  looking for petty or not so petty revenge...", "NTA\nHearing your neighbors comes with living in an apartment.  Her husband could wear ear plugs and they could run a sound machine to drown out noise while him and their kids are sleeping.", "While I don't work nights, i do struggle with sleep. My only gripe of being woken up is if its stupidly early.\n\nWe've got spubd proofing on our walls, our neighbours are elderly and when we moved in we were told that one neighbour would prefer a quieter neighbour. That and the fact I know i can be impulsively loud at times is partly why we got sound proofing. Its also due to us WFH.\n\nThat said, I am a carer I hoover throughout thr day not constantly though and won't hoover before or after certain times (the exception is spiders)", "NTA…\n\nI’m kinda seeing a trend of people (often with kids) being upset or offended by the fact that the world doesn’t stop when *their* kids or family or self have such whims. No one else’s kids are to be considered and even if someone else’s child is involved, what’s best for their own child—and not the group—is what should be done. If you knocked on her door about vacuuming when she does, she’d be offended bc her husband works nights and she has a toddler and it’s the only time she could vacuum, how dare you try to tell her how to run her home? \n\nYou’re a single mom with a school aged kid. You’re a teen mom, *so what*? Why does that make you and your daughter subservient? You vacuum when best for your family, during the middle of the day, no less. And if you start vacuuming at night, you’d *still* be an AH in Coral’s eyes because Coral seems to think that the whole complex ought to consult her family’s schedule before making any decisions or plans.\n\nAnd yeah imo, people like that *should* be treated with less sensitivity than others. If you don’t care about anyone’s needs but yours and your family’s, why should I politely ask you anything? No I’m not calling you to ask when I can resume vacuuming, tf? Courtesy can be interpreted as compliance and I personally would have been much ruder if I had been condescended to in such a manner. If you did and said as you indicated, I think you had excellent restraint and even considered that her husband and baby *were* affected, but that ultimately *you still had a responsibility to clean your own space*.", "NTA.\n\nFunnily enough, the office lady for my complex (nicest old lady you'll ever meet) recently sent out a mass email to \"remind everyone that, despite popular belief, your neighbors are not magical butterflies\" and asked everyone to quit making daytime noise complaints for people just living their lives.", "NTA\n\nI work nights, and when I was still in an apartment, every Tuesday the mowers would come at about 9am. Twice a month they would pressure wash the outside of the apartment. I even had some people come into my place for an audit of the building while I was still sleeping. All of these things are what happen when you work nights and live in an apartment. You are right to vacuum at a time that is the most convenient for the most people, that lady sounds like a dick.", "NTA. Especially if you're doing it around your work schedule.\n\nI work nights. And while I would *love* to have perfect quiet during the day, that's not a thing. Especially in an apartment complex, and one with such thin walls.\n\nEarplugs and white noise machines exist. You can get noise cancelled (or normal) headphones for babies to wear (I know someone whose baby slept through a very raucous pub night with said headphones). She is entitled to ask, but she doesn't get to get angry at you when you say 'no'", "NTA.  They can't reasonably expect you to alter your daytime routine to suit them. The world doesn't work that way.", "NTA\n\nYour neighbor needs to get used to apartment living.  People do things at all hours that are not listed quiet hours.  \n\nMiddle of the day is a normal time to vacuum, run laundry, run dishwasher, etc.  \n\nIf you are doing that stuff between about 7am and 9pm you are good.  \n\nFor the age thing…. just start thanking people for complimenting you on your youthful appearance.  Your neighbor doesn’t need to know how old you were when your child was born.  She doesn’t need to know your current age.\n\nYou are an adult, with a child.  Period.  \n\nNext time she makes a disparaging remark regarding your age or age you had a child, just smile, say thank you for the compliment on your youthful appearance and walk away with your head high or close the door on her.", "Nta, but unless the time you vacuum is not flexible, you could simply change the time you do it to be nice. Yes it’s their fault they work 3rd shift but someone has to…and I guarantee as neighbors you’ll have a simple favor to ask of them at some point, better to build goodwill when you can.", "NTA  they should try ear plugs and white noise machines.  Vacuums aren't that loud.", "NTA\n\nYou're actually doing her a favor by making noise during the child's naptime. Parents that require complete silence during children's naps, end up with kids that absolutely cannot sleep in anything but perfect silence. Kids should be able to nap with everyday noises happening. Additionally her husband's work schedule is not your problem.", "NTA. My husband did graveyard shift for years. At our last apartment, we were in a unit *right outside* of the very popular basket ball court. You know what my husband did? Popped in some ear plugs.", "NTA", "NTA.\n\nIt's not your problem to deal with. They can find a million ways to sleep through daytime noise like vacuuming.\n\nYou have no obligation to put your responsibilities aside to accommodate them.\n\nYour reaction was not unwarranted. Her request is unreasonable.", "[removed]", "NTA. Why should you adjust your schedule for a virtual stranger? This is apartment living. You can't control when other people vacuum.", "NTA my mom worked night shift and still expected the house to be tidy so she would sleep in the back bedroom with the door closed so I can help her out..this was 25+ years ago when there was no white noise n other stuff so your neighbors need to find a way to adjust they aren't the first family with weird work schedules or babies..", "NTA\n\nEven if you literally said that she needs to suck it up and deal with it, that's blunt but not inappropriate. It's true, they do need to suck it up and deal with it. Sure, you could consider being more flexible about when you vacuum, but I can't say that I'd want to especially after she went from nice to a completely inappropriate meltdown the second she didn't get her way.", "The husband can wear ear plugs and she can put a sound machine in the baby’s room", "Nta... Gotta love it when people expect the world to revolve around them.", "I can understand asking for the sake of the baby as there are days as a new parent that the child will not sleep and then suddenly they decide they want to nap.  So you get them bedded down only for the amazon driver to ring the doorbell and wake the child up (pretty sure I would get off on a murder rap).   Still unless OP is using a commercial vacuum used for sucking up packing peanuts I think the kid can deal.  \n\n\nThen of course there is the husband that works the late shift.  HE can deal regardless\n\n  \nNTA.", "NTA and I am sorry that people try to shame you for being a young mother. No one has that right. That you are working and are independent is a great success. I think that it’s great that you are able to enforce boundaries. Your neighbours have to adjust to their new living arrangement", "NTA - they’re the ones with alternative schedules. Not you. Her entitlement is staggering to think she was going to start running your building like that 3 weeks in.", "Well, you know that you cannot reason with children.  You can reasonably clean your apartment or make noise between 7 am and 10 pm in most states.  Is it polite to vacuum or play loud music at 7:15am or 9:45pm?  No.    You could have asked what time would be better, and then decide if that works for you or not.   Like maybe 3 in the afternoon?   But one never knows when exactly most kids will nap at that age, I had one would just lay on the floor when tired and have at it.  Another who laughed in the face of sleep.  \n\nNeighbor lost all accommodations when she started yelling and name calling.  If it were me after that, I would not open the door if she knocked again and I would turn around if i saw her outside.   If she started yelling, I would just say no and walk away.", "NTA\n\nnow keep vacuuming and put music on during the day, as long as is not quiet hours there is nothing your neighbor can do.\n\nalso there are this things called earplugs that the husband can use.", "ESH-I assume her husband sleeps when everyone else is up and is awake when everyone else is asleep(including you!). Why do you and everyone else(they would be awoken by the chores)have to interrupt your sleep to accommodate one person? It sucks for him yes,but at the same time its not your problem.\n\nEdit-from ntw to esh. If she was rude about it I would say nta,but she tries being cordial and you told her to pound sand which caused the negative reaction. No is a complete answer,but adding extra after is usually not going to invoke a positive reaction.", "NTA tell them to fuck off", "[removed]", "NTA 100%.\n\nMost apartment buildings have a 'Quiet Time' which is generally something like 9pm-7am or something like that (at least that was the hours at my last apartment).  So basically you can do anything you want to outside of those hours.  Since you are doing regular household things that aren't crazy loud, and doing them during the day when a normal person would do those things, your neighbour really has no say at all.  \n\nIt's not your fault that her husband worked a late shift or that she has a baby, you shouldn't have to accommodate that at all.  It's up to her to realize she lives in an apartment, and her neighbours are going to make reasonable noise during the day, and she has find her own way to adjust to that.", "I would have waited since she’d been friendly and asked nicely and it’s really a small thing to ask.  She went crazy, though, and overreacted.", "Nta if you are between 8am and 10pm. People who work night shift have to deal. Like someone else said, add rugs to bare floors, white noise or play music, sound dampening panels on walls of bedroom, earplugs etc.\n\nMy son was a super light napper as a toddler. I played \"easy listening\" radio in his room or I couldn't  even flush the toilet or run the faucet without waking him. The music in his room took care of muting sounds from the other rooms...and mom got his nap break to get chores done.", "My asshole upstairs neighbor vacuums at 12:30 am (yes you read that right) and seems to run sprints daily across his wood floor above my head. It’s just a single young dude, I haven’t addressed it because that’s city living but, still, I weep for any shift workers living under him in the future.", "Do it at 3am then see how feels about it being done", "There is a white noise app for her phone.  It has oceans,fans, birds etc. and it drowns out other noises.  Please tell her so you can continue your life.  You are NTA.", "NTA. You’ve done nothing unreasonable.", "You may not *technically be the asshole, but you don’t seem like a pleasant neighbor.", "NTA. Your vacuuming time was fine, she requested even though quite a reach. I also personally wouldn’t put a hold on my midday clean for her. \n\nBut dude, your tone to us is so damn aggressive lol. Jesus", "NTA. If you tried to work around everyone else's lives you will never get anything done.", "I always trained by kids to sleep through vacuuming and my husband worked nights for years and slept through normal family life", "NTA- I worked nights for 5 years, it’s a tough shit situation. You’re not being disrespectful or being loud at inappropriate times. No different than landscapers pissing people off by starting at 7am.", "Take no notice of your uptight neighbour, and her snide comments. You are working, supporting your daughter, and keeping a clean home. I'd say you're a real winner with a good head on her shoulders. \nThe baby will adjust to noise, as babies do. The husband can invest in ear plugs. It's not your problem, and you're not being inconsiderate by hoovering in the day.", "ESH\n\nNo, you’re not obligated to stop vacuuming, but you could have at least considered it.", "Yup YTA. Is it your \"right\" to vaccum whenever you want? Of course. But she didn't BY YOUR OWN STATEMENT come at you rude or yelling she nicely requested that hey right at this second my baby and my husband are sleeping can u just wait for a little bit. \nBy your own words u didn't have a reason you had to vacuum only at this moment and it would've been minor to say Sure but just to let you know I usually vaccum around this time every couple of days because it's when I have a break. \nNOT being an asshole is more than just being a bare min living being. \nAnd by your own description, you not only said No but did so in a harsh and rude way. (Deal with it and suck it up were your exact words according to ur post) so yea YTA.", "NTA", "NTA", "ESH. And frankly, with the information given, you’re the bigger AH here. \n\nYou don’t list any actual reason why can’t vacuum a little later. In fact you don’t even list a reason why you don’t *want* to switch times. All you’ve told us is “I chose this time and I won’t change it”.\n\nTry to imagine that you had to work nights at a job that probably sucks to support a partner and baby. All you want is some rest but your neighbor refuses to wait a few more hours to vacuum “because I decided to do it at this time”. \n\nWhat the wife said to you was horrible, but you are also a compassionless AH for sticking to a schedule that would cost you nothing to change when you know it’s preventing a working father from resting.", "NTA. I live in an apartment as well and it has pretty thin walls so you can hear what people are going during the day. My general rule of thumb is do things like vacuuming/setting up furniture/etc between 10 am to 4 pm. Most people are usually up and doing their own stuff around this time. \n\nSucks that her husband works a late shift but there are ways they can fix it themselves. Play music or white noise when sleeping. Wear earplugs when sleeping. \n\nI would check your building lease paperwork and check if there are certain \"quiet hours\". My building has them from 10 pm to 6 am to avoid people throwing parties late into the night and disturbing others.", "Yeah, I also work nightshift and don't expect the people around me to cater to my need for sleep just because I choose to work nights.\n\nNTA Op", "I'm looking forward to the neighbor complaining to everyone else in the house for doing normal things during the day, because literally no one will be able to plan their noisier activities according to this one family. That's just life.", "Also, apartments aren't exactly the place to live if you don't want to ever hear your neighbors.", "Yup. Our building's gardener comes every Thursday with a leaf blower. Probably the most obnoxious sound in existence. I put in ear plugs and ignore it until he's gone. \nIt's not my place to stop him from doing his job. \nGod forbid this woman live next door to a construction site.", "I can't recommend a white noise machine enough, it's the best gadget I've ever bought. I just wish I knew about it back in my shitty college apartment days.", "Ya. I basically fortified my room when I was on 3rd shift. Foam on the walls, blackout curtains, a/c was good white noise, etc. I wouldn't get mad at neighbors for going about their normal lives. \n\nI did put a note on my door asking not to knock so I'd only get mad if someone knocked on my door", "I used to, at the weekends during the summer neighbours would cut their grass. Not once did I say anything as it was my problem not theirs. NTA", "My neighbour has complained about the noise my dehumidifier makes at two in the afternoon.", "I hated night shift. I had to race to beat the sun home. If I saw the sun my body was like, “No sleep for you!” So glad I found amazing black out curtains", "Could you share more information about the silicone earplugs? I’d like a replacement for the disposable foam ones.", "You are right to vacuum at a time that is the most convenient for the most people, that lady sounds like a dick.", "agree with you.", "Yes but OP didn't really explain why she had to vacuum at that particular time. I get that it's her apartment and she's doing it at a reasonable time but why not be considerate in that situation? I don't agree with the neighbor's response, she shouldn't have gone off on her like that, but I certainly understand the frustration. Unless there's some reason why OP has to be vacuuming at that moment then I don't see why she couldn't have just waited.", "When someone shows you who they are believe them.", "Get a shared agenda with the whole building to agree on the 10 minute window to vacuum that won't be an inconvenience to anyone. Also add that you agree on these terms on the condition babies will only be allowed to cry between 4pm and 4:30. We allow them half an hour because they are, you know, babies.", "To be fair, housing is rough for a lot of people right now and we can’t pretend like everyone is rolling in options. That being said I totally agree with you. For like six months my apartment complex would do yard work and leafblow directly by my place during my infants nap time. It just is what it is sometimes lol. Nap time is only sacred to the parents hahaha", "I wish it was that easy to choose where to live for most people but it’s not. What do you suggest people do who can’t afford anywhere else to live? Kill themselves? I agree with your point but that first sentence is so obnoxious", "Your entitlement reeks.", "Babies can (and should) learn to sleep through the noise. It isn't like you're vacuuming under his crib, either. Adults can learn to sleep through it. too. I get that they can hear you, but it cannot possibly be loud enough or for a long enough time to truly be disturbing.   \nNTA.", "Because it should always be ok to ask politely? When did we decide that asking a favor was wildly inappropriate? And she didn't ask OP to stop vacuuming altogether, just to do it later in the day. That's a completely reasonable request.", "Why would it be unreasonable? OP can do it at any time. Pausing vacuuming to do it later doesn't hurt OP in any tangible way.", "And vacuuming doesn't even usually take that long. What, 20 minutes max, depending on the size of the apartment? It's not like it's an hours long event. In an apartment there is just really no good time to do noisy activities. One neighbor is an early riser, another is an early sleeper, another takes a nap, another is a night owl, another will be watching their favorite show....there is NO WAY to vacuum when literally every single person will be happy.", "She didn't say wait an hour she said she'd call her when she was \"alloud\" the lady is very entitled.", "The thing is that means the next time this is going to happen too. Before you know it she’ll ask op to text and ask if it’s a good time to vacuum before she starts. That’s an unreasonable expectation in your own home. They’re not roommates and quiet time is generally something like 9 pm - 8 am. \n\nPersonally I would have said sure I’ll wait an hour this time, but then next time I would have proceeded to start vacuuming with ear phones on and not responded to her knocking on my door.", "Honestly yeah I feel so blessed to live in an apartment complex where we’re all kind of a little village that helps each other", "it’s really sad.  Apartments suck, what makes them tolerable is kind neighbors who think of the community.\n\nThis is such an idiotic hill to die on.  How DARE someone ask me to vacuum at a different time of day when i clearly have the flexibility to accommodate that request!  /s", "Right? Like people are calling this woman entitled for ASKING her to vacuum at a different time. If I knew I was doing something that was disturbing my neighbor and I could easily do it at a different time, I would because I'd rather be slightly inconvenienced but courteous!", "Exactly. She can be fully prepared for neighbor to start doing stuff to piss her off now.", "Yes but what if the neighbor on the other side has a different schedule? And the one above and the one below has different schedules too? When you live in an apartment you just have to kind of deal with noise from time to time. You put in earplugs or something.", "“Hey sorry - that must suck; I just don’t get much time to do my chores so I’m just gonna finish up quickly and then it’s done, thanks for the cookies”", "The least OP could have done was ask \"how long do you think they need\". If it's something short, and delaying vacuuming isn't disruptive to OP's schedule for the rest of the afternoon, then it's polite to just pause and wait. If the timing works, then a simple \"sorry, this is the only time I can do it and it needs to get done\" is all it takes. But neighbour was condescending, and OP chose to retaliate. So yeah, ESH.", "Someone who asks you nicely for a favour doesn't call you a whore when they don't get a positive response.\n\nNTA.", "If you start acquiescing once, you’ll have to do it for every unreasonable request. OP Does not have to cater to someone else’s family schedule.", "Even just asking how long until she can start vacuuming, and then either agree to wait or tell them the timing doesn't work out for them.", "I scrolled way too far to find this comment. Your baby is one? Yeah, sorry, you don’t get to complain about any sound anyone else around you makes, none of them are as loud or annoying as a screaming baby", "I really don’t know why you get downvoted. Your argument is logical. \n\nDoes everybody suffer from the „I‘m the main character“ syndrome? You don’t know what your neighbors have going on in their lives. Why not be nice if it’s no big deal for you to vacuum at a later time? And if you really can’t meet their request why not decline politely?\n\nThere may be a day where you need a favor, I wonder if they will help you out after today.\n\nAnd if the new neighbors are petty there are a tons of possibilities for them to annoy you in the future.", "Literally started with ‘dont give me crap, but here’s some details that are irrelevant’ and then went off. Sounds like she’s defensive and rude by nature.", "I usually go for around 11:30, but the latest if I’m busy would be like 2pm", "It’s in the post", "It’s really not reasonable though. You can’t ask your neighbor to live their life on your schedule. It wasn’t even like she asked her to wait for a short specific time. She wanted her to just wait around to vacuum until she came back to give her an all clear bc they were no longer sleeping. She’s not entitled to manage OP’s time like that.", "How is it reasonable to ask a neighbor to stop a basic household task taking place in their home in the middle of the day?", "Uh, how on earth did you get “vacuuming every second day = ocd?”\n\nIf you have the windows open, you’re still getting dirt, dust, pollen etc blown in. \n\nIf you have an 8 year old child, you’re also getting crumbs, and probably dirt from being outside, and sand from the school sandpit. \n\nAnd if you have two human beings in an apartment, you’re still getting dead skin cells and shed hair. \n\nEven without a cat / dog (which we don’t know if she has), or allergies (which we don’t know if she has), doing a quick vacuum every second day is not unreasonable.\n\nEdited to add: Ah, I missed your last line - “this I’m really wondering because I’ve dealt with it”. You’re reading your own situation into hers, and wondering if maybe she’s similar to you. Fair enough.", "Have fun being a doormat. Directly answering a question is not escalation.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "[removed]", "They make earplugs and/or headphones and white noise generators for exactly this situation.", "Same. I bought one when I lived on a busy road in an old house with single glazed windows. They're amazing.", "I wish I liked white noise machines. At my old call center job they had white noise machines on the dividers and for some reason they always made me irrationally annoyed/angry. (They ended up putting them in the ceiling because we all would turn them down/off even when we got emails not to and it was better since I couldn't really hear them)", "You don’t even need a machine. You can use your phone and download it. I use Apple Music and play “Deep Sleeping Brown Noise” by Mister Rumbles every single night. \n\nI usually just connect my phone to whatever Bluetooth speaker, loop the song, and we sleep like babies. Im renovating my entire house and slept through the bathroom demo this morning", "You better specify a PM after that 4:30 because if not hooooo boy!", "Leafblowers! The ban of the tired late shift.", "I live rural and my neighbor has a log splitter. He works early on his farm so you know when he splits logs right near our property line and house ....Naptime. Everyday until he was out of logs. In my head I was cussing him out but like it was 1pm on his own property so I just turned the Hatch a bit louder.", "No, killing themselves is almost certainly not the solution that commenter was suggesting. I would assume that if your living situation doesn’t allow for ideal sound insulation and you can’t change it, then you could do more cost-effective things like get earplugs or noise machines. Or, you know, deal with it. The way we all deal with unpleasant things we can’t afford to change.", "What did he do now?", "12-1pm isn't acceptable to vacuum? Small % who work nightshifts have the right to tell others to stop chores during afternoon???", "I didn't see anything about being \"allowed\" to continue. It sounds like the lady offered to give a heads up when the baby and husband were awake again. I mean there might be reasons to say \"no, I would prefer to do it now,\" but the mere fact that the neighbour comes over to try to negotiate the timing of chores isn't enough of a reason to fly off the handle in a rage.", "People in this sub are unable to parse the difference between ‘asking someone’ and ‘making someone’. People can ask you all kinds of different things and then you can decide within reason how you want to respond. The neighbours original request is so benign but everyone here thinks it’s the biggest imposition in the world.", "Right?\n\nI mean, way to make an impression on the new neighbor.  And as OP has seen - this neighbor *escalates*.  So yeah, buckle up OP, and just remember:  *you started this*", "whataboutism is tiresome.\n\nWhat the other neighbors schedules are doesn’t apply.  and are likely “normal”.  THIS woman asked for something very reasonable and OP was rude. Vacuuming at 4pm instead of 11am when people work night shift is a *neighborly* thing to do!", "Or “I can do this other chore for about half an hour but then I really need to finish the vacuuming.” (Assuming there are other chores to do.) Like you can give a little without letting yourself be walked all over.", "She asked us not to give her crap for being a teen mom because of an unrelated issue. That’s not unreasonable. Especially since she’s just had someone berate her and call her a slut for it. It’s not exactly hard to assume that most of the attitude in this post comes from being a bit upset.", "\"The time of day in which I do vacuum is not stupid early or really really late, I chose it because most people are gonna be up so I’m not disturbing a lot of people.\"\n\nThat's why I asked specific times, you never know when people make posts saying \"It's not a bad time\" oh what time? \"6am\". That's why I was double checking.", "Sometimes neighbours do nice things for each other. Again, I can't speak to the neighbour's condescension, but asking someone to delay a household chore for a couple hours really shouldn't be a big deal.", "How is it reasonable to be so stubborn that you're not willing to vacuum a couple hours later to allow your neighbours to get some sleep?", "The rigid I'm not deviating from my schedule part is why I asked. For a one time thing. It's not just about the cleaning, but the having to do things a certain way with no wiggle room.", "Reasonable due to baby and dad sleeping. Notice I didn't say OP should stop vacuuming.  I said she was TA for how she responded.", "[removed]", "I genuinely have no idea how they went to offing themselves instead of finding a solution...", "Read the last 2 sentences of the paragraph where she talks about her showing up. It says she will call her when they wake up and she \"can\" continue. Idk If you take that differently but it means she will be allowed to do it when she says so. The other woman is extremely entitled.\n\nEdit: also, OP didn't fly off in rage she just told her she wasn't gonna stop because it's not really her problem. She told the lady off after the lady started being rude/disrespectful. Op was fully in the right.", "“I don't vacuum everyday, maybe just like every couple of days, usually late mornings early noonish.”\n\nAgain, it’s in the post.", "So you would pause your schedule to accommodate a neighbor who’s husband may sleep for several hours, especially a neighbor you don’t know?\n\nlmao no you wouldn’t", "Yeah, I can understand your point. It was a small red flag for you. \n\nI can also understand not wanting to give an inch though, because many people will take that inch and then want a mile. The one time request becomes a 4x a week thing, and then an every day thing, and then other demands get added on top, and you end up very much wishing you’d never said that first, “Sure, no problem.”\n\nI didn’t read OP’s “no” as an inability to stop vacuuming, but rather that she wouldn’t stop vacuuming for something unreasonable. And to her, being asked to stop in the middle of the day to accommodate one neighbour for something that’s going to happen regularly (i.e. “the baby is sleeping”) was unreasonable.", "It absolutely is smart, but it's also ridiculous to expect a working single mother (or anyone else) to do her cleaning around your schedule. By saying yes, she opens the door for anything they might hear. Her daughter playing with friends? TV? It's not inconsiderate to have reasonable boundaries.", "that was OPs interpretation of the person's words, but who knows what she actually said.", "Yes, I would. Because unless I'm expecting people over and I want the house to be spotless, the vacuuming can wait. If it became a regular request, then it could get annoying. But as a one time thing? Of course I would.", "I see yours too, the baby is gonna be sleeping, well, a lot. So if it became that reason, unreasonable people would then ask for concessions all the time.", "It’s so weird when people lie for no reason lmao", "It's so weird when people admit to being completely inconsiderate for no reason.", "The first part of this post is completely irrelevant. Why include it, especially if you DON'T want comments about it?", "Call the apartment manager and report the harassment. If it persists or becomes threatening, notify the police. \n\nIf it was something actionable she would have already reported you.", "NTA You reacted just right to a completely unreasonable request. Plus, it is vacuuming. It might actually soothe her baby and keep it asleep longer. If you were doing some kind of construction work or repairs or something loud and unusual, okay. But vacuuming? The whole world does not revolve around this lady.", "NTA.  I'm so sorry she was that rude to you.  On the plus side she won't be asking you to babysit and I guarantee that's what the cookies were leading up to.", "NTA OP this is just the beginning of her stupid entitlement. Can you find out if any of the other neighbours have had any of her ridiculous demands?", "You have a job, maintain a clean home, and you’re raising a child? Sounds like you’re doing everything right to me. My daughter became a mom at 16. It wasn’t what any of us had hoped for but we survived. She is now married to a loving and supportive man, mother of a 10 year old and 3 year old, has a job she loves earning good money, and is very happy. I’m proud of her and adore my grandchildren (even though I’m FAR too young to have them 😉) I imagine there are people proud of you as well. You should certainly be proud of yourself.\n\nMaybe you COULD have been nicer. Maybe she could have too. She didn’t have to get personally nasty and insulting.", "While you are N T A for vacuuming during the day, and you certainly SHOULD vacuum during the day, I suspect that your friend is correct in saying YTA for how you reacted. No one on this thread is gonna tell you not to vacuum during the day! But \"she’s just gonna have to suck it up and deal with it\" rather than saying it in a nicer way, is probably why your friend said YTA.", "NTA\n\nThere's a guy in my building like this, complains when people are just living normal lives during the day. He works Night Shift. He asked me to not open the back garden door during the day... like what?\n\nI said \"This sounds like a you problem. Get some earplugs.\"\n\nHe also annoyed the neighbor across the hall from me with a similar thing so he now makes sure to play music pretty loud during the day while he's getting ready for work.\n\nAnd the people that moved in directly above me have kids and he wants them to keep it down. You don't hear those kids past 10pm, they're fine.", "NTA for vacuuming at noon. \n\nNow I don’t personally hear anything condescending about what she asked you — it seemed neighborly — & friends who know you well said you could’ve been nicer— I probably would’ve said, “sorry but this is the only time that works for me, I hope you can understand” & probably wouldn’t I have ruined the relationship. \n\nBut judging by her calling you a bitch & a whore, I’m sure it’s not a relationship you would want anyway.", "My shitty neighbor vacuums at midnight and still doesn’t think she’s an AH.\n\nYou’re fine.", "NTA. This is just an unfortunate aspect of living in an apartment building. I can hear when my upstairs neighbor opens a drawer, takes a piss, runs his dishwasher, etc. I can hear when my next door neighbors are having conversations. If your neighbor is hearing your vacuum, I’m sure you can hear when the baby cries. If you’re not breaking noise ordinances, you don’t need to change when you vacuum. \n\nSure you could’ve been nicer but I think her response shows that she wasn’t genuinely being nice or open to a conversation.", "*but a couple of days ago, she knocked on my door as I was vacuuming, she was all smiles and happy but told me in the most condescending way possible that her husband had worked a late shift and their 12 month old baby boy was sleeping*\n\nINFO:What was the condescending way? Was she being sarcastic and snarky? Years ago, there  used to be a lot of younger adults in our neighborhood, and we'd often get together to play volleyball, cards, whatever, listen to music and drink. A slightly older neighbor came over and said, in a kind of passive-aggressive, loud, snarky way, \"Do you think you could maybe possibly turn that music down a few decibels?!\" He looked very angry.  Of course we all laughed as he stormed off. Why couldn't he just have nicely asked?", "I'd say YTA just from the way you worded your first couple of paragraphs. There's a lot of weirdness going on here and I don't trust you.", "Nta. Maybe complain to the building manager you have a neighbor asking you to not vaccum during the day then verbally assaulting you. It may not do anything now but good to have paper trail when people are this entitled", "NTA not your problem\n\nif you had said yes, the next time it would have been \"don't walk so loud\" or \"don't shower after 8\" or whatever\n\ncan't give these kind of people an inch", "NTA   \n\n\nIs your neighbour also going to arrange things so that you're never disturbed by noise from her apartment? Will she stop her baby from crying? Will she keep her tv set off whenever you want silence?", "NTA", "Definitely NTA, but I probably wouldn't go as hard as most comments. Next time they complain, I'd just saying sorry for waking you up, but if I vaccummed any other time I'd be disturbing a majority of the apartment complex around me. Honestly, you would definitely be t a h if you did it during the night, which seems to be their demand lol", "This psycho dares to vacuum at siesta time, unforgivable! 😤\nYTA if you live in the Iberian peninsula, NTA anywhere else.\n\nSeriously, NTA, I also WFH and my neighbours vacuum at 8am when I start and my retired parents are still in bed, and no one complains.", "NTA.\nAlso, good for you for buckling down and making a life for yourself and your daughter. That is hard work when you have a kid young and I wish more people would appreciate that instead of making people feel bad about it. You are doing it ☀️ and that’s what matters not what others thing. You’re a superstar 😌", "13… Jesus Christ.", "YTA.  I would love to hear the neighbor's version of this interaction.", "I was gonna say YTA for vacuuming when she asked you, in good faith, to postpone your vacuuming for a little while to let her family sleep, it seemed kind of inconsiderate and petty to not give her a break, however I can see how this might become a regular thing and that would be annoying. I wasn’t there but it seems unlikely if she was asking for such a thing, that she would present ‘all smug’ with a tired baby and husband needing a favour. I don’t buy it and YRA for that.\nAs soon as she started insulting you though, she crossed a line and I would have made it my duty to vacuum every single crevice of the apartment.", "ESH. Here’s the thing, she knocked on your door and asked if you could vacuum at any other time. That was about this one instance. At that point you’re free to keep vacuuming or to stop; you could have easily said “sure, lmk when they’re awake and I’ll vacuum then”. However, responding to a reasonable request with “I’m not gonna change my time to suit your needs” was starting your side at an impasse, on the defensive, and overtly confrontational. If this were a constant issue, then they would be worse, but I think they were probably asking about this particular instance. \n\nShe sucks for escalating after that, for sure. She had no reason to call you all those things nor to start shouting.", "YTA, that was a rude response to a perfectly reasonable request.\n\nI used to work nights and certainly never expected the world to stop just because I had the unusual schedule, and while you're correct that you're well within your rights to vacuum during the day, the mature and gracious thing to do in the interest of forging neighborly relationships would have been to work with your neighbor for a solution that benefits everyone. Alas, that bridge has been burned.", "YTA.  She asked you politely to delay your cleaning and you havent stated any reason why that would be a real burden for you.  Yes, you are entitled to clean during normal work hours, but when someone asks for a reasonable favor that doesnt harm you, you should consider doing it because being a nice person means doing nice things.", "I would have asked if there is a better time I can plan to vacuum. If they both tend to be asleep at noon every day, but everyone is awake by 3, you could easily just plan to vacuum after 3. That's still the middle of the day and not when it would disturb other people. \n\nShe asked you a favor. If you can do a neighbor a favor that doesn't cost you anything, why not do it? It's worth it to have a good relationship with neighbors, and who knows, maybe someday you'll need something from them, and you'll get a lot further if you've done them a favor. \n\nIf they'd come and asked to borrow a cup of sugar would you have done it? It's still a favor. It's something you're doing just to be nice and neighborly, not because you are required to. \n\nIf you neighbor was here, I would tell her she's not an asshole for asking, she's an asshole for blowing up when you said no. Like you said, she was all smiles and happy. You interpreted this as condescending, but maybe she was really just trying to ask nicely. \n\nA neighbor asks for a favor, a neighbor says no? No one there is an asshole. \n\nBoth both of you responded in pretty ridiculous ways. You could have said yes, or said \"Oh, sorry, that's rough, but this is really my own chance to vacuum.\" You know the walls are thin, you know it's not a good apartment to live in. Your immediate response was \"I'm not breaking rules, I don't owe you anything!\" But she didn't come demanding and telling you you were breaking rules. She just asked. \n\nBoth of you will have much more difficult lives than you need if your first reaction to someone asking you a favor is to shut them down harshly. It doesn't take any more energy to say \"I'm sorry, I can't\" than it is to say \"suck it up and deal with it.\" \n\nESH", "NTA. If you had said yes, that would have opened the doors for her to start trying to control everything you do that she can hear. Best to nip that in the bud right away like you did.", "NTA! You are doing DAY time things during the DAY", "YTA. She's not asking you to vacuum only during certain hours or trying to impose a schedule on you. She was requesting that you vacuum later so her household could sleep. It was a simple, straightforward, relatively reasonable request. It would have cost you nothing to vacuum later in the day. It cost their household a good days sleep. Is it an imposition? Yes. Is it an unreasonable imposition?, No, not really. \n\nMoreover, it sounds like your response was pretty hostile. \n\nNow if she wanted you to be totally silent everyday from 9-5, that would be unreasonable.", "ESH you can vacuum whenever you want, but it didn't hurt for her to simply ask. However, your defensive reaction and her reaction to that classifies everyone as an asshole in this situation", "ESH. She shouldn't have asked, and you shouldn't have responded so meanly. You could have told her you would postpone it just that once but not again since it's more convenient for you to vacuum during the day.", "Pp00pp m mm. Me bb", "NTA, why would people be sleeping IN THE AFTERNOON!?  \n\n\nKids, I get it, but 8-year-olds know better, especially when they know you're going to vacuum.\n\nWhy would your husband be sleeping in the afternoon, when he was WORK to DO?", "It was a simple request, you could have easily helped that family out. Having a child you should know how difficult toddlers can be if they don’t get their sleep. It indeed seems very childish of you to not listen to a simple request. For me, YTA coz you clearly overreacted. Also, your neighbour is also TA if she actually went off on you the way you explained here.", "INFO - is there a reason you couldn't have vacuumed later?", "I don’t think YTA… Personally, I would ask when scheduled nap time was and avoid that time to keep the peace. If it’s just some random times whenever they feel like it then I would’t try to accommodate that.", "She handled the situation poorly, but would it be so hard to have a quick chat with her to figure out what time of day would be best for the vacuuming?  Why not just send her a quick text and ask?", "ESH but you could have compromised. So, what happens when you need something next time? Because of how this was handled do you think your neighbor is going to be willing to be nice and accommodate you? I am willing to bet no. What you could have said is, \"Oh gosh...I am sorry, I didn't know. I work from home and I have a young child too. Look, I am not busy right now, so I will go ahead and hold off for the time being so your husband and baby can sleep, but I am going to have to finish in a bit, ok? However, in the future, because I work from home I will be vacuuming usually during the mid-day. I will try to be quick, ok?\" Or, you could just hold off vacuuming till early afternoon. You work from home, there is no reason you can't vacuum around 3 or 4, or even 5 pm.", "I worked graveyard for 14 years. I understood that the entire world operates on the opposite side of the schedule and I use earplugs to sleep.\n\nAsking everyone else to keep quiet throughout the day is like asking for the whole world to be carpeted - they need to put some motherfucking slippers on", "Honestly I feel like a certain level of noise canceling is just necessary to live with other people.\nNoise cancelling headphones were a necessity for me in college dorms.", "Working graveyard, I used earplugs to sleep. Not perfect, but the world does revolve around me.", "Agreed. While I like to be accommodating when I can, it's just not possible to live around someone's unique schedule. And this is going to be an ongoing activity. Does she expect you to check in with her every time you vacuum or do anything that might make noise? If she wants that kind of control, then she needs to live somewhere else.", "And surely keeping a room silent for a kid to sleep is making a rod for your own back. If you teach them they need silence you'll always struggle to get them to sleep. My mum always did the vacuuming when we slept as kids (and until arthritis pain caused insomnia) I never had a problem falling asleep anywhere.", "NTA. When on earth are you supposed to vacuum? That’s part of apartment living. If she knocks again, tell her to kick rocks.", "Also isn't it a good thing to get kids used to noises otherwise they turn in to really light sleepers if you try and silently sneak around when they sleep? I mean I'm not a parent (thank heavens for that!) But that's what I have been told by multiple parents from different age ranges.", "From OPs description the neighbor asked very politely. It obviously escalated from there but I don't understand OPs issue here. Why not just pause your vacuuming for an hour or so to be considerate? What's the downside?", "I mean she was just asking if she could vacuum a bit later. Not necessarily every time to call them and check first, started off with a YTA imo then turned into an ESH.", "Jeez people dont CHOOSE to live in shit apartments..Sometimes you gotta take what you can get.", "I envy people who learned as children to sleep through noise.", "As a person who did live in an apartment with paper thing walls, it’s not something you assume is going to happen. When I viewed it in the middle of the day no one was around it seemed perfectly fine, it wasn’t till moving in that I found out my neighbors sounded like they rolled marbles all night and I could loudly hear the vacuum running in the hallways. Sure knowing what I know now I would have check that but it’s fair to assume that you won’t hear everything your neighbors are doing all day long.", "> If she didn't want to live in an apartment with paper-thin walls, she shouldn't have moved into an apartment with paper-thin walls.\n\nRight, because the housing market right now is absolutely lousy with excess availability... there's almost too many options to choose from in some cases.", "How dare the neighbor not be able to find/afford a better place to live!", ">The toddler is not going to fucking notice once he/she has been put down.\n\nWow. A bit harsh suggestion, even for AITA :)", "Oh yeah, housing crisis is at it's peak but sure, people should rent a villa if they need something quiet, you can't expect your neighbours to show even a little bit of respect towards your existence. /s", "Nah, I think OP is TA. Obviously, you should only vacuum at 3 AM so you don't wake anybody up.....", "OTOH, doing it a few hours later would prevent having an on-going feud (or, at best, tense situation) with the neighbors. OP herself said in a comment (when asked for time specifics): \"I usually go for around 11:30, but the latest if I’m busy would be like 2pm\"", "Yeah and the verbal assault when she has a child nearby is not good. I'd report that forsure", "Call the landlord to tell them that the neighbor asked politely of you could hold off vacuuming for a few hours?", "This is kind of where I landed too. \n\nOP has every right to take care of her apartment when she is able to, but could have had a little more tact with the neighbor without letting herself be walked all over. \n\nSimply explaining her situation and that she has to do these things when she can.  I think for the husband, there are things he can do to block out the noise, a sleep sound machine, ear plugs, insulating the shared wall some with a bookshelf, art, something.  The baby, I likely would have asked, \"Does the baby have a typical nap time and how long,  I can try and adjust a little to that but can't put off my household chores for too long.\" Then I would have left it at that.  THEN if the neighbor verbally attacked, I would have completely disregarded the request. \n\nA noise machine for the baby would probably be a good thing as well. I know from family experience those who had their babies nap with background noise had better sleepers than those who made everything silent for them.", "This subreddit tends to be so by the book literal, aka don't operate within the norms of general unspoken social contracts. Agree 100% that ESH.", "Based on the OP's opening paragraph & how she phrased this, \"I told her that I’m not gonna change my time to suit her husband and baby, albeit it’s not their fault for working late or you know, being a baby, and that she’s just gonna have to suck it up and deal with it\"  The neighbor may have been responding to OP's negative & snarky attitude.  She definitely went nuclear.  But telling someone to \"suck it up\" is 100% an AH response.", "She said her neighbor was being condescending. Taking that at face value means she was not asking politely. Those two words contradict each other", "> your own story describes your response as confrontational and frankly somewhat childish.\n\nI mean her first sentence sets her up as very confrontational. No one cares that you're a single parent or that you were a teen mom, but OP seems determined to be aggressive about it.", "⬆️⬆️⬆️\n\nagreed, ESH. i kinda of expect to be unpopular but OP definitely could have responded more kindly instead of reacting in a way that seemed so defensive. neighbors can support each other in different ways, so who knows, this could have been an opportunity for a much better relationship.", "There's a post every day in r/homeowners about how to politely ask a neighbor to do/no do something, and the sub is always amazed that \"communicate\" was never tried by the OP first.  \n\nWell, this is why.  The neighbor started out polite, asked nicely for something, and gave a reasonable explanation for why.  OP was confrontational for no reason.  Still ESH for the insults though", "Nah I'd let them have some, but I'm still gonna vaccume when it's convenient for me. Just because someone doesn't do one thing doesn't mean they aren't kind in other ways.", "This is the state of this sub. Showing even a crumb of kindness isn't necessary in their lifes so they don't do it. While they all disregard that being an asshole often isn't about who's right.", "For OP, navigating these types of social situations is part of being an adult, and they are still clearly learning that pissing off the neighbor breeds animosity. The neighbor seems unhinged based on OP's description, but if vacuuming at a different time of day is such a chore for OP, then it casts some doubt on the description. \n\nOP, you're not an asshole, but you handled the situation quite poorly.", "I'm glad there's still some people out there like you. Because, yeah this thread was discouraging to read.", "Honestly, this comment section is the epitome of “technically correct, the best kind of correct.”", "Right? OP is so clearly an asshole. It's a kindly made request to vacuum at another time, this one time. That's it. You are an asshole if you won't do one simple favor that costs you $0. \n\nWhy make an enemy out of your neighbor for nothing? I just don't understand.", "HONESTLY. From OP's own admission, she just does chores when she has free time and doesn't do them every day--seems very clear she didn't even need to vacuum that day. I by no means endorse apartment dwellers trying to strong-arm everyone else in the building into changing their lives to revolve around theirs, but you do all have to more or less co-habitate to a degree, and being the stubborn, inconsiderate neighbor is not going to do you any good at all.\n\nThis was such a small, easily reconciled ask, and OP was so unnecessarily rude and inflexible about it that she made a minor situation into a big drama that's probably going to make life very uncomfortable for her and her daughter. Granted, the neighbor's reaction was way too volatile to being told no, but it does kind of sound like she was just matching OP's energy from being told to \"suck it up,\" though the neighbor definitely took it further than warranted. If OP genuinely couldn't have vacuumed at any other time and/or had a mess that really needed to be cleaned up right then, she could just explain that and the neighbor would've had to accept it and not fly off the handle like that for not being accommodated.\n\nThe neighbor was in the wrong for clearly expecting OP to adjust her life for her neighbors' convenience, but it really wasn't an unreasonable ask and OP didn't have to be so rude about it and immediately escalate the situation--that the neighbor then didn't have to escalate even further. This is a clear ESH.", "Apartments tend to have quiet hours. If she’s not vacuuming after hours, the neighbors don’t really don’t have a huge opportunity for vindication. They still can only also make noises during normal hours. If she isn’t vacuuming before 8 am or after 9pm…kinda sounds like a just them problem. That’s the issue with apartment living, not everyone has the same schedules and you can’t expect people to accommodate everyone in their building. That’s absurd. That’s why you have a lease and property management company that set the terms of living there.", "To ask? Yes, that's reasonable. It's asking for a favor. To blow up when someone says no? That's not reasonable. But asking is reasonable.", "Because if they asked me to stop because they had an issue, I would also do it if I could? When you live close enough to each other for basic household tasks to potentially cause trouble, trying to be aware of each other usually helps everyone get along much better.\n\nI mean, I certainly appreciated that my neighbor was willing to pause his lawn work on the day my mom was feeling really crappy from chemo and just wanted a nap. He appreciated that we moved our cars and let him block our driveway when he needed a big truck to come in to make a delivery. 🤷‍♀️", "If she had some reason, or even a preference, on why she had to vacuum at that exact time then fine. She doesn’t have to revolve her schedule around the neighbors.\n\nBut all she’s listed here is “I chose this time and I won’t change it”. She clearly *could*. She just *won’t*. That’s honestly super mean. \n\nYou’re always an AH when you choose to make someone’s life worse over something that would cost you zero to accommodate.", "Because they are also the types of people who would have the audacity to ask.", "But she didn't just say no she said \"Suck it up and deal\"", "If she’s using her lunch break, yeah it is. it’s 20 minutes, the neighbour can suck it up.", "She does also work", "Hell, I felt like knocking politely on her door and asking her to stop shouting as soon as I saw the all-caps SUBJECT LINE.  Maybe she's a little hard-of-hearing from all the vacuuming. \n\nESH", "I had a neighbor who got ready for work at 6 am. Their kitchen was next to our bedroom. That was my alarm clock, lol. That was just fine.  The 18 year old that blasted bass heavy music for hours was another story...", "OP’s “I’m not gonna change my time to suit your husband and your baby” was also uncalled for.\n\nOP could’ve simply just said No.", "Seriously. Why was her age even important to this story? She's got a chip on her shoulder big-time and seems to enjoy inspiring conflict.\n\nUnreliable narrator. I suspect the neighbor's actual response was, \"Well, that's unnecessarily rude\" and OP decided to make it a soap opera confrontation for the purposes of getting some more attention.", "You mean nice like the neighbor calling her a bitch and a whore because for not saying yes?", "She asked nicely for this specific instance.  I'm not sure the OP was being asked to universally adjust their life.", "This", "She said no and got called a whore...", "Nope. Someone who is so clearly putting down someone for something that has absolutely nothing to do with the situation at hand does not have an objective view of the situation. You simply do not get to name call someone just because your request is turned down. It is absolutely not OPs fault that she was name called, nor is it her responsibility to change her life for a single person. Her schedule is set up so she inconveniences the least amount of people, if she changes it for that one person then suddenly she’s affecting a whole lot more people. It doesn’t make sense.", "And it's better if babies learn to sleep with noise. The families who keep their homes silent when the baby naps are in for a lot of trouble when that second baby comes along. Also vacuums are useful white noise.", "when my husband works nights ( swings between shifts every week ) he  passes out on the couch so that he can still \"feel close to the family while sleeping\" he hates it if our daughter is anything other than her loud little self just because he's sleeping. it's kinda funny but adds nothing to this thread. NTA", "I've worked nights and I agree I don't expect everyone to stop daily activities just like I expect them to understand if im cooking late at night. (Had a dude one apartment complain that no one should cook after 9pm because smelling cooking woke him up even thought you couldn't smell it in the hall but he said nose was super sensitive so he could)", "For me it's a power washer. You can hear the thing all the way down the block.", "If you’ve never been in an ice rink while they’re using the edge scraper, you’ve never heard the most obnoxious sound in existence lol. It’s like a combination of the worlds loudest leaf blower, and 10,000 nails on 1,000 chalk boards. The rink my daughter skates at seems to only bring it out when I’m around. So aggravating.", "During the pandemic when all of us were working from home, the apartment next door to me sold to a new owner.  This apartment hadn't been renovated since the 1970's, so of course the new owner did a complete overhaul.\n\nSo from July through November, there were drills, saws, hammering, etc.   during work hours.  And honestly, it wasn't that big of a deal.  At first, I thought it was going to be a nightmare, but I just got used to it.  I still got all my work done, the construction crew were very nice and about as considerate as they could be given the situation.  And on days when it sounded like they were going to tear down our common wall, I just used noise cancelling headphones.", "The Jehovah Witnesses knocked on my door at 11am coming over my third 12.5 night shift last week. I don’t know who was more pissed off, me or my dog.", "> I can't recommend a white noise machine enough,\n\nA fan does a similar job.", "it’s really sad. Apartments suck, what makes them tolerable is kind neighbors who think of the community.", "Not everyone can afford detached housing.  OP is NTA, but lets not pretend that everyone has perfect freedom to live wherever they like in whatever type of housing they like.\n\nOn the subject of OP not being the AH, however, I want to say that subjecting babies to noises is actually a *good* thing.  It teaches them to sleep through noise, so that the whole universe doesn't have to tiptoe around them until they die at age 90.  Neighbor is setting herself and her baby up for failure by insisting that everything be perfectly quiet for baby sleep time.", "The last ones in the link are silicone, similar to cheaper chemist ones I got for my friend who works nights. I found them while travelling o/s with a massive snorer! IMO they’re sanity gold. \n[Best Sleep Earplugs](https://www.sleepfoundation.org/best-earplugs-for-sleep)", "Just a guess but trying to do it not too early, around work and before her child is home from school. That was in my head and makes sense to me", "I work from home, and a lot of the little house chores are based around when I consistently have time. I have time blocked off for lunch, but I don't actually eat for the whole time. I eat, get the dishes put away, sweep, and validate that everything for dinner is good to go. Do I NEED to do those things at that time? No, but it works around my schedule, so that's when they get done. If I don't do it during lunch, then I have to unload the dishwasher and sweep after work, so now dinner will be late. Otherwise, I have to do it after dinner, and that time was already spoken for. It's not catastrophic, but it's a pain in my ass. So no, I'm not changing my process unless I'm given a really good reason to.", "Could you not have just vacuumed a bit later?? That way her husband gets a decent sleep and you get grateful, friendly neighbours.\n\nSure you had every right to clean right then and there, but as you said you can hear everything your neighbours do and they can hear you. Surely a little give and take is in order.\n\nYou now have an ongoing battle with your next door neighbour which will last for as long as you both live there. In an alternative universe you could have been a considerate person and waited an hour or 2...you work from home it wasnt imperative that you cleaned right at that time...", "OP actually said she asked in a condescending way. We just have to take OP's word for it that she can gauge tone better than us, who never heard it.", "A request isn't polite if the response to 'no' is throwing slurs at someone. Then the \"polite request\" is recategorized as a demand. Faking being polite for a few seconds before someone says 'no' isn't actually polite. It's just keeping the mask up for a few seconds in the vain hope that you'll get what you want, when you want it.", "This sub is a strong believer in you don’t owe anybody anything. Including any sort of kindness or consideration, especially if it’s going to cause any sort of mild inconvenience.", "What if it’s the only time for OP to do it. “No” is a perfectly good response. It’s the neighbors reaction to not getting her way that is wrong here", "Hey I would pay extra for an apartment where the babies only cried between 4-430.  Can you schedule the birds for after 7 am too? This 5:45 shit is silly.", "Next, form an HOA, formalise those rules, and set up a disproportionate fine structure. Install a noise monitoring system that can triangulate excessive noise and automatically fine the offending household, plus a fee for the noise monitoring system. Etc.", "I can understand how with the initial request OP might sound rude not to oblige (even though it is well within her rights to say no), but it sounds like she didn’t get good vibes about this woman and was proved right. It’s important to set boundaries with these type of neighbors right off the bat, because as they said if you give an inch they’ll take a mile, and the issues will just get worse.", "This! ESH. They both sound condescending.", "Thank you for saying this. It’s super frustrating when people say things like “if you don’t like it, move” it’s not that simple for most people. Safe, affordable housing that meets people’s specific needs is a huge rarity.", "I used to live in a student apartment for the past 2 years, and i would dread leafblowing days because my room was on the ground floor with my windows facing the courtyard. Even my best headphones couldn't completely block out the noise.", "But it is the same if you live in a house! You will always be able to hear dogs barking. Or even ppl that throw parties till late at night. This world is becoming so entitled.", "Look at you, living in a fancy place where the landlords care to do maintenance!", "My grandmother always made a point to vacuum while her babies were asleep so they could sleep through anything.", "The first few weeks in our new apartment I thought our upstairs neighbor was renovating his floor because it sounded like he was sanding it and ripping stuff out. Nope. Just vacuuming and pushing stuff around to get behind the many many things standing around. Bumping into any corner made me think he was in our apartment. The time it took to adjust to that kind of noise was brutal", "The worst part is how the neighbor tried to be friendly and made a polite request.  The nerve of some people!!!", "I wish it was that easy to not live next to assholes who believe that their comfort necessarily supercedes everyone else's, but here we are.\n\nLike, the sheer fucking audacity to suggest \"my husband is sleeping but I'll let you know when he's awake so you can resume doing the things you need to do in your own apartment\"... LOL.", "Please find me the place on any rental agreement throughout history where it stipulates that \"ability to clean one's house contingent on sleeping schedule of nearby occupants during daytime hours.\"\n\nJust one.\n\nBecause see, I've lived in terrible apartments before, but at no time did I ever have the audacity to believe that I could dictate to my neighbors what they could do in their own homes during the daytime.\n\nEntitlement indeed.", "Nope according to OP neighbor was smiling and just said hey do u mind because last night this happened and right now...  \nOp for whatever reason took this as neighbor being condescending etc and neighbor only exploded AFTER OP responded with \"Deal with it and suck it up\" so...", "Ok, so are we now in a world where you're not an asshole if someone else is an asshole first?\n\nThe entire point of the \"ESH\" vote is that everyone in the story is an asshole.\n\nAnd if the neighbor was \"smiling and happy\", as the story specifically says, then it's a polite request, even if you feel the underlying tone is condescending.", "Given Reddit's habit of fixating on details like that, I don't think it was unfair for OP to want to set a boundary with commenters. And since it came up later, it was a necessary detail.", "This place is insane. If my neighbor asked me to not vacuum for a couple hours I would say of course. There's other quieter things I can do for a bit. Do people really treat their neighbors like shit most places?", "Same. Our first downstairs neighbors had nightshifts and we had a stompy toddler who was still learning how to walk quietly. We covered our beautiful hardwood floors in foam mats with carpets on top and tried to keep our toddler busy in rooms that were not above their bedrooms in the morning. It didn't work perfectly and we weren't on great terms but of course I would make that effort again within reason. The next downstairs neighbors were awesome about it and our entire floor was cool about us playing in the hallway in bad weather and sometimes came to play with my little one. It was really sweet. Our upstairs neighbor became a bonus grandpa. We were really lucky", "Same. In 2020 several of us single women traded numbers just to be able to check on each other\n\nOne is great about occasionally sending me a text to tell me I’ve got a package or looks like my car’s tire is low. I know not everyone gets to live in a kind village but it makes life so much better", "That's a real selective definition of kindness you've got there!", "Yeah Reddit is weird sometimes lol. She’s not an AH for vacuuming during a perfectly reasonable hour, her neighbor isn’t an AH for explaining the situation and asking her to wait. It’s not like she came over and demanded she stop. ESH (although OP less so) for their reactions to each other 🤷🏻‍♀️. The neighbor’s assholery was extreme and uncalled for.", "I used to live in apartments and my upstairs neighbour had a baby (I also had a baby). I used to wait until I heard her baby’s white noise machine stop before I’d start vacuuming lol. She was a great neighbour/friend to me and I just don’t like making peoples lives harder than they need to be for something so minor to me.", "This is the comment thread I’ve been digging for. It sucks that it’s so hard to just be nice to people in this day and age. I will comment that she did say the neighbor was condescending as hell from the outset, which while we are taking her word for it, would be enough to make me not want to do them a favor. However some basic conflict resolution skills would have been nice from OP. Maybe even a very blunt, “You came off very condescending there. If you’d like a favor, would you like to start from the beginning and try again?” could have solved it.", "And not even always just hey lady night he worked a late shift do you mind? Which could easily be sure but just so you know this is when I usually do it because it's my break so maybe for future...", "Missing the fact they called her a whore and other such.", "Thank you! I thought I was going crazy. While OP is *technically* correct, the *kind* thing to do would be to wait before vacuuming again if possible. I don't think the neighbor was out of line in asking nicely (I question how \"condescending\" she really was). Life is much easier when you make the effort to get along with people.", "I believe the issue was not the request but the tone it was asked in, and the resulting slew of insults when told \"no\".\n\nOP doesn't owe her anything, neighbor doesn't know OPs schedule. It's perfectly normal to have noise going on in the middle of the day. Plus I'm sure since the neighbor has a baby that the rest of the apartments are going to be woken up in the middle of the night a few times a month at least.\n\nIt's not hard to be kind when making a request like that, especially when it's inconveniencing someone. Stopping them in the middle of doing something. If you're not kind about it \"like im sorry to bother you and ask this, but would you mind holding off on vacuuming for a couple of hours? My husband worked a late night and is trying to sleep, and my baby just was put down for a nap.\"", "> The neighbor seems unhinged\n\nWorth noting she's a mother with a young baby. Doesn't excuse awful behaviour, but she may not be sleeping/eating well and thus prone to disregulated behaviours", "Thanks! And yeah, it's not the greatest advertisement for humanity.", "And how are you so sure it’s just this one time?", "Because the kind of people that request you to alter your activities are the same people that never stop with \"just this one time\". If you give people like that an inch they will think they can take a mile.\n Why does she have to be the asshole for declining a request? Why can't the neighbor be the asshole for even asking someone to stop vacuuming?", "> It's a kindly made request\n\nExcept...\n\n> told me in the most condescending way possible\n\n¯\\\\\\_(ツ)_/¯", "I feel like we're missing parts of this story. The neighbor's request was perfectly reasonable and then to suddenly escalate like that? Granted I know people can become completely unhinged the moment you say \"no\" but I suspect there was more to OP's response than we're being told (I also question how \"condescending\" the neighbor really was given she seemed perfectly pleasant to OP before).", "YES! I went from NAH to ESH reading this. OP was doing a reasonable thing. The neighbor made a totally reasonable request. You had the grounds for the beginning of a great neighborly relationship and instead they both decided to go nuclear on the situation. It was totally unnecessary.\n\nWe had a neighbor who worked nights for many years. We worked with him to find a time to mow the lawn that worked for both of us. OP admitted she's entirely able to accommodate, but decided to just blow up this relationship entirely for no good reason. Pity - it's so helpful to have a good relationship with the people you share space with.", "I'm sure OP would love it if their neighbour started vacuuming in the middle of the night since that's their awake time. Why can't people try and get along?", "Definitely. But, it does sound like OP might have some flexibility in her schedule. She could have asked about their typical sleep/nap schedules and said she'd try to work around it as her schedule allows and that she appreciates the heads up. I would have set a firm boundary around the \"I'll let you know when it's OK to vacuum\" as that's a step too far and I'd never agree to wait for permission to vacuum during the day.\n\nBut, OP escalated instead of deescalated the situation and didn't do what she could to be \"neighborly\" (accommodate if/when you can, even if you don't have to but within reason). People tend to escalate further when your approach is confrontational. It doesn't really matter if you're right or wrong - a pissed off neighbor is not a neighbor you want (again, obviously within reason and not in all situations).", "\"What if this hypothetical thing that isn't happening and hasn't ever happened starts happening? Pretty soon you'll never be able to vacuum.\" \n\nThis might be the flimsiest slippery slope argument I've ever heard.", "Yeah, am I weird that if a neighbor came by and said \"hey, my husband and kid are both passed out, can you vacuum a bit later?\" that I would actually stop vacuuming and do it later?\n\nJust seems courteous.", "There is a diff between not getting a positive response and getting a straight up rude one. \nI wonder what other words were exchanged when neighbor escalated.\nBut yea the whole etc is uncalled for so EVERYONE is an A makes sense. \nOP was the initial A though. (Not for vacuuming but for her \"Suck it up and deal statement)", "That’s not true. Saying yes once doesn’t mean she’s obliged to say yes to everything.", "and OP will never get help or a favor from this neighbor again. This is such a strange position to take over a couple hours difference in vacumming.\n\nBut, I mean, if there's nothing else in life or the world to take a stand on, okay.", "\"Would you mind waiting an hour or so to vacuum\" is not an unreasonable request.", "I don’t think the request was unreasonable. The neighbor explained the situation and asked if she could wait until later. Unreasonable would’ve been demanding she stop or not vacuum that day at all. Also she doesn’t HAVE to do anything. Waiting this one time to vacuum doesn’t mean she has to wait ever again. It’s ok to take each situation on its own and deal with it at the time. Maybe this time she could’ve waited and tomorrow it wouldn’t fit with her schedule. That’s life, it isn’t so black and white. It’s possible it only delays the neighbor’s assholery but it’s also possible her being considerate now would’ve caused the neighbor to be understanding about a different situation in the future. It’s not healthy to assume the worst of everyone around you. (Not you specifically, people in general)\n\nThere’s no defense for the neighbors reaction. Even if OP is minimizing her response. I’m just saying that being courteous to a neighbor when you’re able to doesn’t mean you have to give in to everything.\n\nEdit: clarification", "She doesn't but she could have declined much more politely and empathetically.", "It’s called being a considerate neighbor and changing when she vacuums wont hurt her, especially if she works from home.", "Eh, to be fair, op has two kids under 8. Imo, not all babies cry and throw tantrums but all kids plày and scream or fight and scream. As someone who lives in between neighbours who have one baby and the other 3 kids under 8 , i dont even remember my neighbour has a baby most of the time, but the kids have woken me up thinking someone is getting murdered.", "This is my thing. Everyone is like “clearly she can wait to vacuum” but that’s not the vibe I’m getting here. She still has to work, she has a kid (who may be out at school), we don’t know the details of the rest of her day. Sure, she could just be inconsiderate but she could also be on her lunch break as you said, she could be getting it in before jumping into meetings, before her kid comes home… like I’m not saying either of their attitudes were great but in the same way the world doesn’t revolve around the OP, the world also doesn’t revolve around the neighbour.", "Based on OP’s other comments, they have plenty of time for chores and dont have a set schedule or anything that requires it at specific times or only for a few minutes here an there.  \n\n\n\nHonestly OP’s comments make it sound like they just dont regularly clean their apartment and will just randomly do a chore here or there when they finally feel up to it.    Plenty of time to do it whenever, but they just dont want to", "Just completely irrelevant to the story and she had to include it lol her daughter doesn't even come up again in the post. what was the point of saying that?", "I don’t think it’s her age that’s relevant, it’s her defensiveness about her age. I agree that she sounds like she’s already…sensitive. And I agree that there not enough info.", "Might be unreliable narrator in this case, because it doesn't make sense", "Yeah I read it as if it was just for this occasion", "Because she may be really struggling with her baby and husband working night shifts, which means she’s probably up all night with the baby and may be utterly exhausted. I personally would try and accommodate her. I don’t have to be vacuuming at that exact time", "I go to sleep at 4-5 am and wake-up during the hours you mentioned doing vacuuming. You are definitely NTA.", "You only read one sentence?", "White noise machines (or apps) make sense to me; earplugs really don't, because they prevent me hearing my alarm, not to mention other things I might need to hear (*e.g.,* a phone call in an emergency, a tornado siren, one of my dogs dry-heaving on my bed or bedroom carpet...). White noise does make it a little harder to hear those things I need to hear, but not so much that I'd miss them. Earplugs, aside from being uncomfortable for me, present much more of an obstacle.", "Yeah earplugs even come in baby sizes /s\n\nOP can vacuum when she wants but she can also be the littlest bit kind and respectful to her new neighbor. It sounds like she can vacuum whenever she wants and it would have been very easy to do so later in the afternoon. Having an enemy as a neighbor is hard and kindness is free.", "Y'know? That would explain why I can and do sleep through most anything... Apparently my mum would put me in a baby carrier and run a cycle on the drier with me ontop...", "I refused to let my home be silent when my kids were napping. The world will continue to turn. I didn't have band practice, but regular life noises went on. I knew someone who demanded no one breathe when her kid was asleep, and he was an awful sleeper.", ">he hates it if our daughter is anything other than her loud little self just because he's sleeping.\n\nI think it's because if she is making noise, he knows she is safe and not getting into anything.  I was the same way when my children were kids.  The minute they stopped making any noise and it wasn't bedtime, it woke me right up and I had to get up and check on them.", "My dad was a swing shift worker and he used to do this with us kids growing up too, I never once felt like he wasn't a part of my life.\n\nMy hubs is a night shift worker, but he won't work weekends so he dedicates Friday to Sunday to our son every week. They'll go on \"boys trips\" and stuff like that as well as basic grocery shopping together.", "That's very sweet and endearing.  What a great guy.", "I love this.\n\n... Sort of thought I was the only one. My husband got in a wild argument with his family once because they thought I was being manipulative in the reasoning. I used to really hate sounds when I slept so kept ear plugs or went in a different area, so I sort of get the disbelief... \n\nThen I grew up, if it was baby or hubby, it was just comforting. Like, yay, baes are alive *snore*\n\nI don't have memory of it, but I'm told of a time I woke up worried about my kid. Was grumpy it was the neighbor kids. Hubby patted me on the head and said the neighbors kids are alive and my response was \"Oh yay. Hope they like them\" *snore*", "Ugh eff that", "I recommend a ten hour loop of rain or storms on YouTube. Usually helps me, especially when I worked midnights.", "I also have the same reaction to white noise and find it really hard to concentrate when it's on, but someone sent me a brown noise video recently and that was actually fine. I don't know what the difference is exactly.", "It's called misophonia. I hate all those kinds of white noises and this time of year having to listen to fans and air conditioners is horrible. I counter it by always having music or tv playing, since actual noise doesn't bother me, just that horrid static whirring.", "It's because you have sucky ones.   Good ones are more expensive but worth every penny.", "If the acoustic isolation is that bad, are those flats even legally habitable??\nIf they are, maybe the owners/inhabitants can work together, make a group purchase of sound dampening ceiling tiles (and its installation) or something?", "Right??? Like does she do nothing and tiptoe around her place when they sleep? My friends with a 2 years old have a house but they keep on talking, watching tv etc at reasonable volume when the baby sleeps. He's used to sleeping with normal noises around the house and also has a white noise machine.", "When I had my first in 2001, I was actually told to vacuum & make noises during her naps. Obviously not vac in same room, but we would close her door, and do regular house cleaning/laundry whatever sounds. They said it would be good for them so that they could get used to noises, because you dont want your baby constantly waking up because a stair tread creaked.\n\nA friend of mines SIL refused to have any noises going when her kids were babies & trying to sleep. Like literally any sounds. They even threw a bday party one time, and when little 2 year old needed a nap, demanded all guests whisper & not move around lol. Effing crazy.", "A friend of mine had a baby a couple months ago and they definitely embrace the \"live and act normally while the kid is sleeping\" and that baby is the chillest little dude. My partner and I went to visit when they were only like two months old and we were being pretty quiet for the most part, and then our friend and another another one of his friends were laughing and almost hollering and making a bunch of noise (like you would with friends around having a good time) and the kid slept right through it. Literally we were there for 6 hours and the only time he cried was at the end of that time when we were already heading out the door. Another friend of ours had a baby some time before that and they were definitely in the \"stay quiet, babys sleeping\" camp and lo and behold! Their kid had much more disturbed sleep and was way more sensitive to noise.", "Lol right, these posts always have people commenting about how if you don't want noise don't live in an apartment. As if they're going to go wow great idea, I've never thought of that before, I'll just go buy a house then thanks.", "We had a cockatoo when my youngest was born. Anyone familiar with that bird knows their screeches reach 100dB easy, my son would sleep through even the worse tantrums thrown from that bird because he was used to noise (cockatoos are like perpetual toddlers that will throw tantrums if they don't get what they want RIGHT NOW). I miss that crazy bird, he could make us laugh constantly,  yet make you wish you were never born the next minute (unfortunately my youngest became extremely allergic to bird dander and Too's produce a LOT of dander, even with several high quality air purifiers my son couldn't breathe well at home).", "My parents were always very quiet after I went to bed. Now at 51 I still need quiet to be able to fall asleep, and it’s so inconvenient at times", "True about the babies! I was told by my pediatrcian to have the kids get used to noise from the start, otherwise it would just get harder as they get older. My kids could fall asleep with jackhammers in the next room. My nephews and nieces whose parents/grandparents tiptoed around them would wake up crying at any little noise.", "My mom told me to vacuum when the baby sleeps, and that was the best advice. We talked without worrying about volume, I'd vacuum during nap time, plus trains would go by. Never had to worry about her being a light sleeper and she's not a heavy sleeper either. Just balanced lol", "A 'good' thing.... hell, one of mine used to go to sleep with the sound of the hoover. It was my 'go to' weapon of choice if she was fighting the sleep lol.  Id say it was a necessity lol", "Please for the love of god BREATHE around ur kids while they are going to sleep, I can sleep through all kinds of next room noises and such but someone else being in the same room so much as audibly breathing will keep me awake for hours.", "The neighbor needs to pull herself up by her bootstraps and get a job then", "Sure, there could be a valid reason why OP needed to vacuum right that moment but since she didn't give us one I'm inclined to believe she just didn't want to. School's over at 3-3:30 and unless she was going to be slammed with work in the afternoon then she could have easily waited. And if that was the case, if she really had to do it right then a simple \"you know what, I really can't wait because I have 'x' happening later but I'll try to get done ASAP\" would have been infinitely better than what OP said.", "And if this was a story about you those would all be valid points. In this story OP went out of her way to stress how flexible her vacuuming schedule was and how her only reason for denying her neighbor's mild request was because she didn't have to.", "> Could you not have just vacuumed a bit later??\n\nFrom an OP  comment elsewhere when asked for time specifics: \"I usually go for around 11:30, but the latest if I’m busy would be like 2pm\"  \n\nSo, there's a 2-3 hour window  (probably a lot more if we're honest). I've seen NO reason OP couldn't have been nice about it and adjusted her vacuuming \"schedule\" (as another responder phrased it). At worst, she could have said \"Sure, but I really need to have it done by X-o'clock, so if they're not up by then I'm afraid I'll have to do it anyway. Hope you understand.\". A simple bit of give-and-take with a sprinkling of courtesy would have resolved the issue.  \n\n@OP: Don't be surprised when they start making noise that is annoying yet \"within their rights\" at times you find inconvenient.", "It sounds like she is cleaning during pauses in her work day. I do the same and my pauses are not exactly predictable because they are based on my meetings for the day which changes constantly.", "I have fucked executive function. If I’ve started Task, I have Momentum, and I need to just finish it or it’ll never get done. I might’ve said that I’d be open to her giving me some times that worked better (now) and I would try (in future) to accommodate them, but I can’t stop Task in the middle for one person.", "Thank fuck somebody finally put in words how I felt about this 💯 you said it perfectly", "While I am strong believer that I don't owe anybody anything interestingly enough most of the people with kids are always strong believers that they're entitled to all kinds of shit from other people. Do them one favor today and they'll come back demanding all kinds of favors playing on kid card as long as possible and call you even a bigger asshole if you decide to refuse being further inconvenienced for their kids after a streak of services and favors you provided. \n\nAlso doing a favor to person that has bad opinion of you based on you being single teen mom, well you gotta be a fool for that. If she did a said favor she would never found out how her dear sweet neighbor really feels about her. So good job OP.", "Apparently", "I'm quite certain that if this was OPs only time to vacuum she would have told us that. In fact, she went out of her way to explain how flexible her schedule was.", "Yep. That's a major loophole.", "So, a couple of years ago, the alarm clock app I use on my phone introduced a \"gentle wake\" option which, when enabled, starts playing soft, occasional bird sounds 30 minutes before an alarm is set to go off, gradually increasing both the volume and frequency of the bird sounds as the deadline approaches. I really liked it, because suddenly I no longer was jolted out of a sound sleep by a sudden, unexpected, loud alarm, but rather gradually brought into consciousness, frequently becoming fully awake just before the alarm went off, so I could avoid hearing it at all. It was great!\n\nExcept...\n\nAs a result, to my brain, \"bird sounds\" now mean \"an alarm is about to go off, so it's time to get up\" – *no matter what time the bird(s) in question decide to make noise.* And did I mention that there is a HUGE tulip poplar tree – with lots of large, leafy branches, just ideal for birds looking to build nests – about 5 feet from my bedroom window? And hey, did you know that some birds like to tweet away in the middle of the night? \n\n<sigh>", "The bane of everyone with ears.", "It is the bane of those who WFH as well. For years I couldn't take calls or meetings between 12-1 on Thursdays. Yelling over a blower 3 feet away with only glass separating us isn't fun.", "Polite does not equal reasonable", "The request maybe started out polite ( though from OP’s description it sounded more passive aggressive to me), but look how the neighbor reacted when OP said no. That is not how a polite or even basically decent person treats someone.", "A request isn't polite if the response to 'no' is throwing slurs at someone. Then the \"polite request\" is recategorized as a demand. Faking being polite for a few seconds before someone says 'no' isn't actually polite. It's just keeping the mask up for a few seconds in the vain hope that you'll get what you want, when you want it.", "Putting down a rug, or hanging a blanket on a wall are inexpensive ways to improve the sound proofing.", "Use comman strips to hang cheap comforters on the walls, windows and doors. Add some cheap throw rugs and throw pillows. Create a lot of \"soft\" in the space you need \"quiet\".", "I clearly wasn't replying to OP. I was referencing the \"paper-thin walls\" response.", "That wasn't my point in the slightest. It was your arrogance about (paraphrasing)\"... if she didn't want to live somewhere like that\", knowing how desperate the housing situation is for so many. She was asking too much, I accept that. That wasn't my point.\n\nAwaits downvotes as people are fixated on their misinterpretation of what I said.", ">Nope according to OP neighbor was smiling and just said hey do u mind because last night this happened and right now...\n\nYeah and op just simply said no she's not gonna stop what she's doing because they have a young child and her husband is sleeping. She shouldn't put her life on hold and stop doing chores when she's already doing it at a convenient time for everyone else. \n\n>Op for whatever reason took this as neighbor being condescending etc and neighbor only exploded AFTER OP responded with \"Deal with it and suck it up\" so...\n\nNot the same post I guess cuz op said she simply said no I'm not gonna stop vacuuming. And the lady blew up calling her a whore and all sorts of other stuff. The other lady was a bitch flat out. If op had said yes then waiting until the lady said it was ok then she would have too anytime if she needed/wanted to vacuum.", ">Nope according to OP neighbor was smiling and just said hey do u mind because last night this happened and right now...\n\nWhat? literally the OP's post: \n\n>she was all smiles and happy **but told me in the most condescending way possible** that her husband had worked a late shift and their 12 month old baby boy was sleeping and was wondering if I could not vacuum right now, and that she would be happy to call back over again when they’re both awake so they could continue on, and I said no.\n\nLike, where are you getting that the neighbor was nice? Just because she was smiling?", "If someone is condescending while asking me a favor, they've guaranteed the answer is no. There are ways to ask for favors and being condescending isn't one of them.\n\nOP isn't the asshole for telling her no because she's within her rights to vacuum when she wants during the day, but she is completely justified in telling a condescending asshole that she won't change her schedule for them.", "If they come over with a condescending tone and act like you owe them whatever they ask for, then yes I would treat my neighbor this way. If they come over and are kind and apologetic about asking, hell yeah I would look out for them and vacuum in a couple hours.\n\nGenerally, calling your neighbors slurs when you're told \"no\" is not the type of attitude that would prompt me to be kind.", "Exactly. It's not like the neighbour was asking OP to forever rearrange her schedule every single day. Sounds like this was a one-off. I would have agreed just to keep the peace. It's very easy for this kind of thing to spiral out of control where the neighbours decide to get petty revenge by retaliating in some way.", "Remember when Reddit forums weren’t full of self absorbed crazy people?\n\nPepperidge Farm remembers.", "I was thinking that I’m the weird one, but glad to find likeminded people. It’s not as if the neighbor asked OP to never vacuum during the day, she asked for OP not to do it this one time. I’m not sure how a person asks that question condescendingly either, and it’s entirely possible that OP just imagined it because she already thought neighbor is “weird and cliche for normal standards”…for giving her cookies? My verdict would be ESH because the ask wasn’t unreasonable but the neighbor’s response wasn’t nice either.", "I can understand how with the initial request OP might sound rude not to oblige (even though it is well within her rights to say no), but it sounds like she didn’t get good vibes about this woman and was proved right. It’s important to set boundaries with these type of neighbors right off the bat, because like someone else said if you give an inch they’ll take a mile, and the issues will just get worse.\n\nI’d love to think of apartments and communities could all be cozy, but I don’t think OP is at fault for that not being the case here. There are some people who act nice but have ulterior motives, and it seems like OP’s neighbor is one of them.", "Me too! I honestly wouldn’t give it a second thought. And if I asked my neighbors for a little favor they would do it for me. It really makes me sad, part of what makes life worth living is connecting with other humans, life is already so difficult I just want to make it even the tiniest bit easier for the people around me", "Then you’d end up a doormat unable to just live your life during regular hours because your entitled neighbor is constantly expecting you to cater to their schedule.", "That is so precious, I love finding little bonus family ❤️ you sound like such considerate cool people I’d love to be your neighbor! That’s how my complex is too, the two little old ladies who live above me have become like grandmas to me, I’ve even taken them to doctors appointments LOL. I spent 4th of July with my neighbor across from me and we had never hung out before that!", "More like your definition is too rigid. You don't have to do everything that people ask even if it would be nice. You can still be kind but say no to a request. So long as you aren't a jerk all the time it's really not that big a deal.", "Your opinion is so reasonable.  You’re such a jerk for asking.  /s", "It wasn’t the request that was entitled, it was the response to being told no.", "No one is saying that was an appropriate response. Also, you're missing the order in which things happened.", "That happened after OP responded rudely to her perfectly reasonable request. Of course it wasn't ok to say that but OP escalated the situation unnecessarily to begin with.", "I'd assume it was condescending considering what the neighbor said after.", "Ok then if it’s a problem in the future just reject them then? \n\nSeriously y’all are ridiculous.", "Why does everything have to be seen as a slippery slope? Why be that cynical? If it becomes a regular thing, then by all means, shut that down. But the very first time it comes up? That seems unnecessary.", "i wrote it in my response, but if OP went into the long justification and ended on \"you'll have to suck it up\" before even giving the neighbor a chance to respond to \"no\".. it was bound to cause problems.", "This of course assumes she’s available to vacuum at 4. Maybe she meal preps then, or it’s kiddos bathtime. The only expectation she can have is to make a request and be heard out.  Neighbor made the request, and she did not acquiesce. End of. It’s unreasonable to expect other people to uproot their established routine.", ">Unreasonable would’ve been demanding she stop or not vacuum that day at all.\n\nI mean, considering she started insulting OP after being told no, then that means she was literally demanding she stop...", "Do they? I only saw mention of the 8-year-old. Either way, I don’t really see how that changes things, since OP isn’t the one complaining about noise. \n\nAnd sure, some babies are usually quiet, but all babies definitely cry sometimes. Not always frequently or for prolonged periods, but you may or may not be able to get them to stop when they do, so if you have one then the smart thing to do is to give your neighbors grace about any noise they may make, because you never know when you might suddenly be the noisy one with no way of making it stop.", "When her neighbor was hurling slurs at her, OP was heavily mocked for the age in which she had her child. It'd be on her mind as a very relevant detail.", "Then you're lucky you never got crazy neighbors who can't take being told no...", "Right! Dam I just watched my neighbors dog for a week. Is it inconvenient, yea a bit but I did it anyway. Once in a while it’s ok to do things that you don’t always want to do to help someone out.", "This is a [comment stealing bot](https://www.reddit.com/r/AmItheAsshole/comments/14sbqld/aita_for_vacuuming_in_the_middle_of_the_day_and/jqwf9bc/?utm_source=share&utm_medium=ios_app&utm_name=ioscss&utm_content=1&utm_term=1&context=3)", "Neighbor probably could have gotten this from her is she hadn’t been condescending…and her replying by calling OP a whore and what not doesn’t bode well for her either. If you want favors, don’t be a dick. It’s a pretty simple rule", "The problem is if you do it once then it's expected. She could have been nicer,but it's not a good precedent to set.", "I can't sleep in any noise or any light, I always think if I have kids, I'll train them to sleep in all conditions and they'll thank me when they're adults.", "I’ve babysat a lot of kids. The moment they get quiet and it’s not bedtime you need to go check what they are doing right then. Once when my littlest brother was a toddler he got really quiet. He had poured all the cheetos on the ground and was eating them and poured all the dog treats on the ground so there in the kitchen was a toddler and a dog just eating their treats off the floor. This happened several times and a 12 year old should not be in charge of a toddler and high energy dog at the same time", "it's because he doesn't want his schedule to interfere with her existing, since it's summer right now she's off school ( 8 years old ) he doesn't want her to feel like she has to walk on eggshells but he's still close enough that she can lay with him on the couch otherwise on nights they wouldn't see each other. \n\nand also probably your thing too 🤣", "so cute! \n\nthat's his thing, he never wants her to feel like she's bugging him or anything and he's a pretty deep sleeper so she can't wake him up only i can.", "My dad worked nights and he was the opposite. How dare we make noise!?!? When he was sleeping on the couch in the living room and note upstairs in his bed away from us.", "i love him so much 😂 \n\nhe's the kind of guy who cannot go anywhere without kids wanting to play with him. it sadly gets annoying sometimes but it's so stinking cute.", "For some reason, it is only THIS specific Brown noise that works for me (although an actual rain storm will knock me out cold) \n\nUp until a few months ago, “Alexa, play brown noise!” would que a specific track. One day it just changed, I couldn’t find the original track, and my insomnia came raging back.\n\nI tried no less than 50 sleep sounds on Apple Music until I came across this one, now it’s the only one I trust 😂", "I think the difference is the frequency.  I use pink noise.  White noise seems like static to me - like a not tuned radio station.  Pink noise is more smooth, like a rainstorm.  For me, the white noise is “wrong” and the radio channel needs to be fixed.  Pink noise is natural and soothing.  I am sure others have different opinions.  The problem is people believing only white noise is an option.", "I use pink noise rather than white noise to help me sleep. Either via a free Android app or using my Echo Dot speaker, I've actually setup a voice command with that skill now to play it.\n\nI read an article several months ago in The Guardian online that said that research studies show that pink and brown noise are much more effective for neurodivergent people and they are very useful as they can help stop the constant flood of intrusive thoughts that runs through your head.\n\nI have now started playing it as soon as I walk in my bedroom. I find it much easier now to concentrate on the books I read before going to sleep.", "I 100% agree. If the weather wasn't so insanely wacky rn, I usually would opt to just sweat it out to not have to hear it.\n\nNow it's just unbearable either way lol", "Oh, is that what it's called?? I can always tell my parents TV is on even when it's black because it always has that sound TVs have when they are on and nothing is playing. I always have to go in and turn it off if it happens because it'll drive me nuts if I don't, I can usually even hear it in the living room with their door closed. Apparently they can't hear it though because they seem surprised when I tell them the TV is on. Luckily this hasn't happened in a few years which I'm glad about 😅 but I am happy to know this has a name and that I'm not the only one", "Can confirm. I have 3 under 6 who can sleep through pretty much anything.", "My sister is doing that with her newborn. She leaves the door open during daytime sleep, or she sleeps in the living space as we talk, watch tv, laugh, whatever. We live in a big city and detached homes are rare/expensive so even if you own you probably share walls/floors/ceilings. That baby can sleep through just about anything, including being moved around now. \n\nIt isn’t other people’s responsibility to tiptoe around their own homes because a neighbor has a baby. I had a neighbor whose crying baby woke me up consistently, so I got a noise machine. Welcome to communal/city living. NTA", "I'm many years old and my parents did normal things when I was an infant. We lived in a trailer park near the college they were attending and I could even sleep through the guy who practiced his pipes. I can sleep through anything that isn't overly disturbing and still love pipes.", "I did this with all of mine.  I'd vacuum all around them, have radio or tv on for noise.  My oldest wouldn't be bothered by literally ANY noise he was so chill lol.  If they get used to noise, then they'll learn to sleep through anything.", "I had my first in 2021 and they told me the same thing. Room doesn't need to be super dark and having regular household noise is good during their naps so they get used to noise around them. It also helps them differentiate naps from nighttime sleep", "I forgot about that but yeah I did that too.  It didn't work but I tried it.  That girl slept through anything during the day and screamed the walls down all night.  :)", "When my kids were babies/toddlers we had a built in dishwasher that sounded like a freight train.  I would wait till nap time to run the dishwasher and it actually was kind of like white noise for them.  It drowned out all the other noises and they slept like - well, babies!", "We live on a busy street so there’s constant noise just outside our window. When we took our bub on his first vacation, he couldn’t sleep because it was too quiet on the 16th floor! We had to run out and buy a white noise generator on our second day so he’d could sleep lol. We won the lottery, our kiddo needs a bit of noise to sleep.", "My niece and her husband are of the  \"act normally while the kids are sleeping\" group.   The kids are older now (*grade school age*), but when they were babies, we never had to tiptoe around and whisper after they put them to bed.  We wouldn't stomp around and yell or anything, but normal walking around, normal conversation, normal television volume was fine with them, and the kids never woke up.", "Even renting a house is more pricey than renting an apartment (more space + better amenities = higher cost, all else being equal).  Everybody needs a place to live, even people who can't afford detached housing.  I'm not giving the neighbor any kind of pass for being unreasonable about noise.  That's the reality of apartment living.  But \"just don't live there if you don't like it\" is an extremely naive take that only a super privileged person would make.", "This is fair & I feel like the better way to word that sentiment so that it's not oozing with class privilege is a reminder that if you live in multifamily housing, having an expectation of a noiseless existence is just setting yourself up for disappointment. You're gonna hear people doing people things & it won't always be at the most convenient times for your schedule.", "Need a /s on the end of that before you get smacked by the \"well actually\" crowd.", "Right?  She was approached politely and responded rudely for no reason.  I hate neighbors like that.", "This. It’s asking for OP not to hoover today, don’t let your child watch tv next week. Things can escalate. But also, the husband needs to invest in ear buds and white noise. It’s during the day and OP shouldn’t have to change their normal routine for what, the next few years?", "I did not expect to read about someone accidentally pavlov'ing themselves into waking up super early because of bird noises today but (sorry for your situation) it sure is funny.", "“What should we do with these leaves? Rake them? Mulch them and let them enrich the soil?”\n\n“…let’s just constantly blow them back and forth across property lines!”", "I have an electric one... So quiet", "Neighbor thought OP would be flexible and was upset when not.", "I stand by what I said. You play the hand you're dealt. If she wanted better accommodations, she should have sought them out. Alternatively, she should learn to live with the situation she has instead of attempting to make her problem everyone else's.", "Nope reread OPs response. Op stated she told her to suck it up and deal and THEN neighbor went off.", "Read this post again. OP absolutely told the neighbour to suck it up and deal with it, which is what makes her an asshole. She could have just said \"Sorry, this is the only free time I get to vacuum.\" Not saying that the way the neighbour reacted was polite either. I've asked neighbours before if they could quiet down and I've been told no. I never resulted in name-calling and swearing. I would walk away annoyed.", "OP told her \"to suck it up and deal with it\" in the last paragraph.\n\n\"I told her that I’m not gonna change my time to suit her husband and baby, albeit it’s not their fault for working late or you know, being a baby, and that she’s just gonna have to suck it up and deal with it. She started going off at me...\"", "> wondering if I could not vacuum right now, and that she would be happy to call back over again when they’re both awake so they could continue on, and I said no.\n\nThat is completely different than saying you are 'allowed' to continue.", "I am not sure OP is the most reliable narrator.", "No honestly I don’t, and I’ve been on this platform for over a decade. I feel like it used to be worse even.", "No one is saying you have to do everything asked of you. But in this specific situation, it would have been very easy to be a decent neighbour.", "The response was bad but so was OP’s. They both suck.", "Ok but from OPs own words she kind of responded in an equally rude way", "Yes she was rude but neighbour went nuclear. Shouting & insults? Being rude about declining is one thing but the neighbour genuinely went overboard especially woman to woman to call the other a whore just due to her age and child.\n\nOP could have been nicer at first, even if letting her down. But i don't see why if someone is being passive aggressive/condescending from the get go, about dictating your schedule based on someone being on night shift compared to others - is like completely normal and or expected?\n\nAnd while some aren't entirely justifying it, there def are people saying the neighbourhood isn't that bad because OP \"set the tone\".", "Responding to someone rudely saying no by shouting and hurling insults, especially when you're older than them, and attacking them for their personal situation w a child is a bit much.\n\nAnd perfectly reasonable? Eh. They were condescending and expected OP to wait on them to allow them to vacuum. It wasn't a \"could you please wait maybe an hour or two/x time\" it was i'll text you when ready request. Just weird.", "Because the people saying this have learned it from experience.", "Good bot", "OP is an unreliable narrator, though, as she’s defensive within the first line of her post. \n\nI doubt the neighbor was actually condescending and instead OP is immature and reactive.", "I thought for a second there was a 12 year old on the floor eating Cheetos and dog treats. 😂 Many of us adults aren't much better at supervising a toddler. I'm sure you're a great older sib. Just be kind and keep them alive and healthy.", "We used to use my dad as a part of our games hahah the moving mountain and stuff like that because was also a deep sleeper hahah", "I HATE when Alexa suddenly forgets what track or playlist a specific command was linked to. I used to be able to tell her to \"play naptime pandora radio\" and get an amazing playlist of instrumental pop/classic/soundtrack songs. Now she responds with \"playing lullabies\" or some crap like that and it's all these lullaby songs WITH words. I have a daycare and the instrumental playlist is the only one I can tolerate for 2 hours at naptime that also doesn't keep kids up trying to sing along! Even when I manually select the correct list in the Alexa app, I'll sometimes get a song in the middle that is the actual pop song, not an instrumental cover. Yelling \"ALEXA THUMBS DOWN!\" is possibly worse than just dealing with the song blasting for 4 minutes.", "All she played was farts...", "I don't know what \"pink noise\" or \"brown noise\" are, but we have our daughter's white noise machine always set to \"ocean.\" If we forget to take the machine on trips with us, I plug in my tablet and play a 12-hour ocean sounds video from YouTube.", "My husband and I used to cycle between ocean and rainstorm until I started having auditory hallucinations with the rain. For a while I would wake up and hear people screaming; once it sounded like an AM radio station; other times I would think it wasn't actually playing rain but insect sounds. So it's just waves crashing on the beach for all time now :)", "TY.. I could never understand White noise, always felt like physical grating to ND me. Not slept yet and it’s 4.45am here, off to Pink noise my ears! Woohoo!", "I always had a radio going, babies are subject to heaps of noise in utero so it made sense to keep that going.", "Well I have to admit it worked for both my kids, maybe a little too well! Oldest slept through the smoke detector going off one night at 2am, it was just the battery being weird but the thing is literally in her room and it woke us up! My youngest can sleep through anything too. So I guess it worked very well!", "1000%. I rent a one bedroom basement apartment in a house and it's $1400. The two bed on the main floor is $3400. I don't know anyone who could afford to rent an entire house in this city, let alone buy one.\n\nMy neighbour has the weirdest most annoying laugh in the world, and seems to watch comedy shows every night ~11pm-1am. But even just white noise at 40% volume on my google nest is enough to block it out. I'm WAY more interested in keeping a peaceful living situation than I am in antagonizing the person who shares a wall with me.", "For sure. I'm actually so grateful that my neighbours don't speak English as their primary language. It's sooooo much easier to tune out, and since I don't have to listen to what they're talking about I don't know if they're giant AHs.", "“And what should we use to blow the leaves back and forth? An efficient machine?”\n\n“Nah, we’re gonna put a diesel engine on your back and use the exhaust to blow em around. Hope you don’t mind cancer!”\n\nSeriously, gas powered blowers might be the least efficient use of a combustion engine. It barely even does any work, it’s just spinning to create exhaust.", "Ah. That is the way!", "Yeah, neighbor is an asshole here. It's one thing to be upset that you don't get what you want. That's something everyone in life deals with. But to call a woman a whore and bitch because she didn't give you want you want when you wanted it? That's unacceptable asshole territory.", "Then you're compounding your arrogance.", "This was addressed a few comments down but yeah your right on the words used. But saying suck it up isn't rude when there's a grown woman telling someone to stop doing there chores because it's around lunchtime and her family is asleep. Sorry they work nights but no one should change there life to pamper to them.", "If your questioning one part of the story you should question all of it. We should go in believing all of it if we are giving advice. Just saying.", "I question the reliability of OP as a narrator, tbh.", "What a sad, mistrusting way of going through life. Also, the stakes are so low here! What's the worst that could happen? So she vacuums a couple hours later. Even if it turns out the neighbours are pushy and entitled, OP hasn't lost anything.", "Lol I would too. Especially a chore I don’t love doing, ok I guess I have an excuse to put this off and not feel bad about it.\nHonestly people are so hostile to their community and neighbors it seems. I go out of my way for my neighbors all the time. If I can’t do a task, I let them know. This lack of community is what’s wrong with America.", "People are often picked apart for personal details on here. I’m sure she *has* heard it all before, and is sick of it. Doesn’t make her an unreliable narrator 🤷‍♀️", "Being defensive makes you unreliable?\n\nSince when,  and how.", "Alexa is the freaking worst! I have Google Home, a HomePod, AND Alexa, and she is the only one who just forgets things, changes things, gives overly long winded  answers for every little thing. I hate her guts", "My sister is like that- I told her to warn any future roommates, just in case, because she’s graduated college and not outgrown it lol", "Sorry, I can’t hear your argument over the sound of my deafeningly loud leaf blower", "You're reinforcing your prior display of a lack of basic common sense.  A pair of earplugs can be purchased for less than 30 cents.", "OP started this very thread with hostility. I completely doubt OPs reliability as a narrator.", "I mean sure, she's (OP) only a year older than me and sometimes I still catch myself in my feelings. But neighbour is just a bit weird. Saying she'll come back later to allow her instead of asking for x time/x hours later? And then when denied, instead of being the older/more mature adult she went nuclear?\n\nIf none of this is true whatsoever and OP was just being rude then that's shitty but supposing what the neighbourhood did is true just... why? Maybe it's the stress of motherhood bc like so uncalled for lol.", "She didn't say she'd come back later to allow her, she said come back later to let her know.  The neighbor's request was not unreasonable, and she offered to follow up out of consideration to OP because apparently she wanted to get her vacuuming done.", "This is probably personal bias but I didn’t see it as “coming back to allow her”. I’d probably say the same thing and it wouldn’t at all be about allowing someone to vacuum in their own home lol. It’s more of like…”I’m likely inconveniencing you with what I’m asking and in order to minimize that as much as possible ima let you know when they get up”. I’d like to think that’d come across in the way I asked but my ADHD brain and mouth connection sometimes makes things come out wrong. So I could totally see someone thinking I felt some entitlement to when they’re allowed to vacuum. But I also wouldn’t respond by calling her a whore if she said no. 🤷🏻‍♀️", "Unfortunately we're only getting one side of the story so I imagine the truth is somewhere in the middle.", "Just be totally understanding when the husband gets home and starts vacuuming at 4am.  We make reasonable accommodations for people around us or we choose to live on an island.", "ESH because your attitude it's all kinds of gross, the whole tone of your post comes across like you have a chip on your shoulder and you're looking for a reason to be confrontational.\n\nYou could have just said you didn't know, for a different chore for a bit and vacuumed later.\n\nIt's like the meme about how someone who's up at night creeps around being silent out of respect for others but the day person is loud, almost on purpose, when us evening/night shift people are sleeping.\n\nCan't wait for her to start vacuuming at 2:30am. After all, no one needs to adjust their schedule for someone else's comfort.", "I'm guessing you didn't say \"Sorry, this is the time that I have to my chores\" and instead said \"No. I am not changing my chore time for your husband. Deal with it.\" \n\nBlowing up still isn't good, but I am also guessing she didn't just snap to 100, so\n\nESH.", "ESH she seemingly asked nicely and you were a dick, so then she exploded and is also a dick, and now you both get to live somewhere with a neighbor you hate and it all could've been avoided", "ESH.\n\nYou're entitled to vacuum your apartment, you don't have to operate by her schedule.\n\nShe asked for a favour (it sounds like her day wasn't exactly going well), you didn't budge and she lost the plot. \n\nBut, if you spoke to her in anywhere near the same tone as you wrote the opening para of your post, you were looking for a fight before she even opened her mouth. You gave us all attitude and told us what you did and didn't want to hear before even explaining, never mind giving someone the actual opportunity to reply. You don't want to be judged for having an 8 year old, but you judged us instantly. I think having a kid at 22, regardless of age, a full time job and an apartment is great. It sounds like you might have had a tough time, but you're in control of the situation. Nice one.\n\nBUT if you opened the door with that level of attitude, well\nI'm really very glad I don't live next door to either of you.", "Is this Lauren Boebert?", "You can vacuum whenever you damn well please, but she asked nicely and you said, \"No, I'm not gonna change my time to suit \\[your\\] husband and baby,\" without providing her (or us) with any reason why you couldn't just finish up when she called back. You are technically not 'wrong' but this is the textbook YTA behavior if you ask me.", "ESH.  Your neighbor for her reaction to your no, and you for not being more flexible.  You're home all day, it's not like that is the only time that you have to vacuum.  I live in an apartment, too, and it's not difficult to make small adjustments that make your neighbors' lives easier.  You never know when you are going to need a return favor.  Were you obligated to stop vacuuming because she asked?  no.  Were you unkind to refuse to put it off a bit?  definitely.", "ESH \n\nYeah YTA, she asked you nicely. Just because it’s not required by law, it doesn’t mean that you can’t be courtious with your neighbors. It doesn’t cost you anything to be nice.\n\nShe was also TA for saying all that crap to you. Obviously that’s rude, uncalled for and a dick move.", "ESH. She came and made a simple request and you became rude about it. I mean I get you can vacuum your place during the day, but does it HAVE to be during that time. It isn't AH of her to ask and not AH of you to say no.", "YTA. But just for how aggressively you responded. Almost noon is reasonable to vacuum.", "YTA. How selfish and unkind of you! You yourself even had a small baby and you know how wacky their sleep schedule is. Why on earth would you be so cold about it? What ever happened to sisterhood? \n\nNeighbors are very important! She has two adults in her household. Those are two people who could help you in a sticky situation. Now they hate you and will never help you. Other neighbors will also start to hate you. You've made a terrible mistake.\n\nAnd I absolutely do not believe OP's account of the whole profane and ranting response from the neighbor. It makes no narrative sense. OP is clearly very insecure about all that and she's made it up to make herself feel better about the scenario because someone (probably older) already told her she was being a jerk. \n\nAnd this thread? My gosh, you guys. You need people to survive. You can't all be islands unto yourselves. Try to help when you can. Postponing a little housework so a new mother gets a break is the least you can do. Trust me - just do it.", "Honestly, ESH. \n\nThe neighbor was absolutely out of line attacking OP for her age and the like, but I don’t think it would’ve killed OP to wait an hour or two to vacuum. It sounds like this is the first time neighbor asked, and OP’s immediate response was no. If it became a repetitive ask by the neighbor, then I can understand, but really? On the first ask?", "You only mentioned your kid's age here to try to bait everyone into talking about whatever and how your neighbor is so mean and slut shamed you, instead of focusing on the point: you had hours left to vacuum later in the day but you came into the conversation with a chip on your shoulder.  You hate this woman for having a nuclear family, baking skills, and a few years on you.  You think she's condescending because you feel defensive around her because she has it together. 🤷‍♀️", "ESH. You need to be more considerate. Your neighbor sucks for getting nasty with you and not sucking it up.", "ESH\n\nYou're perfectly entitled to say no, but what an awful initial response to someone who came in with good faith and asked nicely.", "ESH", "ESH - reasonable request. Rude responses on both parts. She's fine to ask you don't have to accept. Her last comments were not acceptable escalation but I wonder if there's more to this escalation on both of your sides.", "Yikes. OP did she even say what a better time for her might be? You make it sound like it has to be mid day or after midnight disrupting everyone else. \n\nI feel like this could’ve been handled differently on the part of both of you. \n\nESH", "You're not TA for vacuuming while the husband sleeps. He's an adult and can figure out how to sleep during the day. \n\nI do think you're TA for not trying to work something out with the mother for her baby's nap-time. \n\nAnd I think the mother is also TA for two things: thinking any reasonable person would agree to something like \"I'll call you when it's OK for you to do chores during the day,\" and also for losing her temper with you, despite the provocation. \n\nAnd OP? How old is her baby? I know it's been 8 years, but can't you find some kind of empathy for a new - or new-ish - mother trying to get through moving house with a baby? You think maybe she's a little overwhelmed, and just lost it? \n\nYou both suck. ESH", "ESH and here's why:\n\nOP wasn't doing anything wrong by vaccuuming in the middle of the day. However, when requested, putting it off for an hour would have what? Inconvenienced OP how much? We need to learn to be considerate of others and find happy middle ground. If everyone is a stubborn a$$ then we, as a society, break down and get no where. OP admitted to how thin the walls, and being unrelenting when they really could have been, just screams super inconsiderate.\n\nHOWEVER\n\nComing to someone's door and then reacting to the word 'no' in the fashion that the neighbor did just fueled the embers so that the relationship is just burnt. Babies can sleep through noise and shouldn't really be in a quiet environment. I bet the neighbor needed a break.\n\nOP and the neighbor both now have to worry about cross-retaliation when OP AND the neighbor both originally had the power to control the situation, the relationship, and avoid all the unnecessary drama.\n\nBoth parties have a lot to learn here.\n\nedit: typos", "ESH. It sounds like she asked you politely, and your response was really rude. You could’ve been more polite, and she didn’t have to get nasty in return. Also, if you don’t want comments about having a child at 13/14, maybe don’t put your actual ages in Reddit posts.", "YTA.  I'm willing to bet she didn't come across as condescending and you gave her an attitude almost immediately.  The tone of your post suggests you automatically treat people this way.  You literally started out accusing everyone of wanting to talk about you and your daughter when you didn't even need to include the fact that you have a daughter in this post.  She never comes up in the post and has no effect on the story at all.  The only reason you brought her up was so you could tell people not to judge you regarding her.  Hell, even your title is shouting at us.", "I hate when people say “I dont want to hear any comments” lol but you literally made the post.", "Yta because you work from home and could do it at literally any time. Her husband works a late shift so they are on a weird schedule, i wasn't going to go with YTA but she was very nice about it and you already admitted you can basically do it anytime as your job offers you many more time openings than the average person with a job.", "While you're within your rights to say No, she made a reasonable request and it wouldn't have killed you to wait a few hours to Vacuum im sure you had other, quieter, chores you could have done in the mean time. You're going to wish you compromised to keep the peace when her night shift husband starts stomping around while you're sleeping.", "Instead of writing a whole paragraph about how you don't want to hear anything related to your age and your child's you could've just not mention your age or say you are in your late 20s.\n\nWould've saved a lot of drama from going on in the comments", "I really can't imagine a scenario where I just keep vacuuming in this situation. \n\nYTA, I think you might have an irrational hatred of this woman.", "YTA, she gave you a decent time frame and the reason they were sleeping. Although you're not obliged to change your vacuuming time, it's a pretty assholio thing to do and is very inconsiderate. If I were them I would vacuum at 3am.", "YTA - I'm guessing someone else took care of your kids for you because you obviously don't remember having an infant need to nap.   \n\n\nThey need like 30 minutes to an hour. That's it. Or else the entire day is f\\*\\*ed. Someone asking for a small delay is the absolute bare minimum of human decency. Sure, you don't have to. No one *has* to be decent. That's kind of the point of decency.   \n\n\nI'm actually kind of disgusted. At least own that you're an AH. Don't come online looking for absolution. You had the opportunity to do a kind thing and refused. That's *the* definition of an AH.   \n\n\nI'd move out honestly. You're going to have a horrible time and you've no one else to blame. You've got a chip on your shoulder and you've actively chosen to create a hostile living environment for what, a half dozen people? No amount of NTA reddit doots are going to make your life less insufferable.", "YTA she asked if you could not do it right at that moment and said she would call over when.  She didn't say forever stop vacuuming at that moment.  Why was it so important to vacumn that you couldn't wait 1 hour?  Why not just be considerate especially if she has a young child which I'm sure you remember how hard it was in your apartment", "14?!!!!", "The real AH here are the developers that build these cheap ass apartments with no freaking soundproofing and the governments that let them get away with it.  I've gotta go with ESH though. Your neighbors reaction was way out of line, but could you really not have waited an hour or two to vacuum? I mean yeah, technically you didn't have to but life is better for everyone when we make an effort to get along.", "NAH, but I've certainly been desperate enough to not break the sleep to ask a neighbor for a one time accommodation. I would have offered to come back and vacuum myself as a thank you.", "ESH…..you could have changed your routine this once. If she asked regularly, I’d say you can’t change your life for her, but this once? Doesn’t seem completely unreasonable of her.", "ESH - You could've been nicer, she could've been nicer, imo everything could've been better handled", "NTA. Tell the neighbor to buy ear plugs. It sounds like you are being respectful by NOT vacuuming in the early morning hours before work. If the neighbor doesn't want to hear the neighbors, they should rethink living in an apartment.", "ESH. Your friends are absolutely right, while vacuuming on your schedule during the day is absolutely your right, the way you handled her request was terrible. \n\nHer request was not out of line. That doesn’t mean you had to acquiesce to it, but there were far nicer ways you could have turned her down. You could have said something like “I’m sympathetic to your problem, but with my work schedule I have to grab little snippets of time to do chores when I can, and I don’t see how it’s going to work to start syncing that with your husband and sons daytime sleep schedules. I’m really sorry.” Her verbally abusive response was unacceptable, but your rude initial reply to her opened the door for that kind of escalation.", "she gave you cookies before and came over smiling when she asked\n\nhow was anything she said condescending? making a request isn’t condescending \n\nseems like you projected whatever negative feelings you have about yourself at her \n\nESH \n\npeople voting NTA clearly don’t know how to interact with human beings on a neutral level", "YTA You are showing yourself as a bad and inconsiderate neighbor. Do better.", "YTA so hard, look at the way you even started this post. So many other ways this could have been handled.", "A comment about your age and your child's age.", "ESH, when you live in a collective environment you need to be more considerate of others.  Would it have inconvenienced you to stop vacuuming for a short time?  It's also not clichéd or weird to introduce yourself to your new neighbors by giving them cookies.  Sounds like you have had to grow up fast, but you still have a lot to learn about acting like a normal adult.", "YTA for the unnecessarily rude way you responded.  You are within your rights to vacuum at that time,  But you said yourself that before your neighbor was very friendly and brought cookies and then when she asks you politely not to vacuum at that time you assumed she was being condescending. Maybe examine your own attitude a little. You could have had a friend, instead you made an enemy.", "Agreed, NTA.\nHehe, that'd go over well; start knocking on the door before you vacuum. Loudly to make sure you get a response on if it's OK to vacuum.", "My mom used to vacuum on purpose while I was napping so I would learn to sleep even when it wasn’t quiet. Slept like a rock as a kid.", "Put down? Whoa whoa let's not jump to killing the baby here folks! /s", ">If she didn't want to live in an apartment with paper-thin walls, she shouldn't have moved into an apartment with paper-thin walls.\n\nEr, I don't think it's that easy for most people. Like, I don't think families with young kids are actively seeking out these paper-thin walled apartments, I think it's all they can afford.\n\n>The toddler is not going to fucking notice once he/she has been put down.\n\nDepends on the kid, some will be out cold and some will wake up easily.\n\nIMO there's no reason to treat this like an outlandish request, it's totally reasonable to ask your neighbor if they can postpone something loud for half an hour if sleep is tough to come by. The problem was that OP said they weren't going to postpone, which they have every right to do, and neighbor flew off the handle. Nothing wrong with asking though, and, frankly, I think most neighbors would happily try to accommodate that request as long as it was delivered kindly (which was, again, not the case in OP's example).", "Yeah, exactly! Like what's the big deal about holding off vacuuming for a few hours just so the neighbor can get some sleep. It's unbelievable how often people in this group reply with \"you have the right to do it so screw the other person.\"", "I have a big feeling that we're not getting a very truthful story or, the first part of the story sounds relatively believable, but the fact that the lady started calling her all of those names so immediately it makes me up at suspicious without some important missing facts. \n\nIt honestly seems like OP is projecting and her first sentence of this post kind of proves the point that she's insecure about her age and how young she got pregnant. She seems extraordinarily immature.", "I'm glad I don't live next door to 90% of the people in the comments here, who seem to think a kind neighborly request is entitlement and beyond unreasonable.  The notion of community in society is dead, and it's extremely depressing to see that play out in the comments here.", "This right here.", " I don't think the profane response even happened. I think OP just thinks it all. But the neighbor is gonna say all that about her to the other neighbors who enjoyed her cookies. I know I would. OP better move lol", "When I worked from home, I had scheduled meal breaks and did the housework in those scheduled work breaks while my kids were at school. \nFor me it was time sensitive.", "The drama was the point.", "The cookies were on a different day when she first moved in tho, so it was two separate occasions.", "When I was working on 3-shifts schedule, I was living in an apartment on the ground flour, with my windows directly to a busy crossroad (vehicles stopping and starting all the time, plus the pedestrian \"walk\" sound signal).   \nOrdinary living taking place in my neighbours' apartments not to mention.   \nIf you're tired, you're sleeping.   \nIf you absolutely can't, you have to find a solution like earplugs or something like that.", "Yea I work night also and my neighbors mow the lawn at like noon. Is it annoying? Yea, but it’s also a normal chore to do in the middle of the day. They don’t know I work nights nor is it their responsibility to care. Now if my husband started vacuuming while I was sleeping, that’d be different.", "I work nights and have ptsd, loud noises wake me up with panic attacks, even someone walking loudly above. But that and vacuuming is normal things, i have no right to expect them to not do normal things in their house, even loud music is honestly their right (within reason; if my plates are rattling from their music thats a bit much lol). I see no issue with politely bringing it up and asking for someone to maybe be quieter, but they are perfectly within reason to say no, with no explanation or apology needed because it's not really a reasonable request to make. *Attacking* them for it and calling them a slur is just insane.  \n \n\nI also think this stigma against teen mothers is especially disgusting because teens *cannot legally consent*, and most of the time the father is an adult, but somehow its never the man's fault and its the girl/woman getting the hate. This culture of victim blaming is horrific and seeing so many older women feeding into it is honestly quite sad. \n\nOP It sounds like you are doing an amazing job, raising a child is no mean feat and I'm so proud of you!", "I will raise you airhorns and sirens.   \nI live by a hospital and high school. Rookie EMTs forget to turn off their sirens, and sometimes air horn symphonies are performed at the high school.", "Especially life in an apartment building.", "This!! Sound machine is seriously the best thing ever especially in this situation!", "Oh god I’m glad it’s not just my brain that does this. The second the sky starts to get light it’s like “nope, morning time now!”", "Lmao wtf. \n\nThat's a really stupid point. I'm sure every person living in an apartment would rather be in a house.", "She said the whole building has paper thin walls, though. What if other neighbors have babies who have different sleep schedules? How can a mom expect an entire apartment building to be quiet for her baby for a specific time each day?", "My poor second born child can sleep anywhere because of his toddler sister. I often pop him on the floor, once he's been asleep there for 15 mins I can actually hoover around him. I even recorded it because people didn't believe me. I think he was a police horse in a past life.", "NTA. What are you supposed to do? Check with all your neighbors any time you want to do potentially loud chores? In my experience if you give an inch they'll take a mile.", "At my place the water softener backwashes itself every night at like 3 am and it's loud as fuck. It took maybe a couple nights to get used to and sleep through it, and now I'm totally unphased by it.", "We only have OP's account and she says the neighbor talked to her very condescendingly.", "Definitely. Also it doesn't take that long to hoover a flat - in the time the neighbour was talking OP could probably have finished anyway!", "Seriously. \"Someone asked you to do something that you were not obligated to do, and you told them to go fuck themselves, but you're not an asshole because you had no obligation.\"", "Thought I was the only one annoyed by it...", "I would also question the condescending aspect. Was the tone condescending or did OP assume that it was condescending. Since OP seems like an unreliable narrator, we can't rule one way or another one that aspect. That context really indicates what the ruling can be as the exchange can be heavily edited to make OP/neighbor better or worse.", "Exactly. The neighbor made a neighborly request. OP is within her rights to deny the request, but, \"I’m not gonna change my time to suit \\[your\\] husband and baby,\" is absolutely being an AH.", "Do you really believe they went from happy and smiling to raging demon without provocation? Sounds dramatized to me, ESH.", "I lived in a really bad neighborhood in a big city (my apartment complex had our city's first murder of 2023, wahoo) from 2019 to earlier this year, and... people can turn on each other quick.  Being courteous and lending am egg and smiling at people who smile and ignoring people who ignore you will go a really long way.  I was a disabled woman living alone, I didn't *invite* ill will from the people physically closest to me.\n\nedited to add, I shared all that as a way of saying I agree with you, haha", "She commented earlier that she sometimes does it at 2PM if she gets busy.  So no.", "I kept a pack and play in my living room when my babies were new. I'd vacuum right beside them while they snoozed. And never had issues with light sleepers.", "This!  Both my parents are deaf.  In a deaf household, no one says shhhh the baby is sleeping. Deafs are loud AF!  I can sleep through anything now because I was exposed to so much noise!", "My 10 month old granddaughter just slept through the 4th of July celebrations that in my daughter’s neighborhood sounded like a war zone for literally hours (her neighbors seriously like their fireworks). I’m sure it’s because the baby always sleeps with a white noise machine and a 3yo older brother who is not yet completely clear on the whole “inside voice” thing.", "It’s actually very sweet. :)", "Honestly yeah I feel so blessed to live in an apartment complex where we’re all kind of a little village that helps each other", "We were living in an apartment building in Germany, where the laws regarding noise are really really strict. The only time I ever complained, was when our next door neighbors ( one living on the right side to us and the other one on the left side) were talking with their respective entrance doors open through the hallway while one of them was vacuuming at midnight. I really thought I'm going crazy and I'm hallucinating because that's on another level of inconsiderate.. other than that, during the day, you just have to accept that that's where everyone is doing their things..", "I use an Android app called NoiseWall. It gives you white noise, as well a brown, red, and pink noise, or a mix. Love it.", "It’s the worst feeling", "No, not everyone has the options to live where they want, but that certainly isn’t the problem of the existing tenants.\n\nIf they have specific requirements it’s up to them to look for places that meet those requirements or accept that they can’t change their neighbor’s completely reasonable daytime routine to suit them. Nobody thinks that regardless of income anyone can live in a detached home - they just expect the people in the circumstances to understand what living in an apartment complex is like and not expecting to control their neighbor’s to suit their needs. \n\nShe can ask if they can do the activity later like she did, but she needs to respect the answer she gets and roll with it. If the other tenants are going above and beyond to be loud and awful then sure that’s different. But this was pretty normal activities for daytime hours. \n\nBut I agree on the baby thing for sure - it’s going to be a lot harder to sleep normally throughout your lifetime if you’re only conditioned to sleep during specific ideal situations.", "Whether a person can afford to live elsewhere or not doesn’t change the fact that hearing your neighbors is part of living in most apartment complexes. I don’t say that to be unsympathetic because I lived in apartments for years before I was able to buy my (very small) house. But it is something you have to learn to deal with.", "1630 to 1700,  Mingo Mean Time.", "I use bottle rockets to make the 7am crows fuck off", "My wife feeds them. They will peck on the windows at 7ish if she does not go out there and load the feeders.", "Don't forget that fines are indexed on the decibel count of each nuisance, shared amongst the neighbors according to their distance from the source of the offence.", "Guaranteed that same mom would lose her shit if people complained about her baby crying, too. Rules for thee!", "That is so cool! Yep all the women look out for each other here too! Such a blessing. I don’t have a big family so I try to create one wherever I go, and it really does make life easier 💞", "This is it exactly.   \n\n\nIf someone requests something this little, I better have a reason for saying no. Adults have a discussion. Come to a compromise. Children say \"no\". And then they go on the internet to make themselves feel better about it.", "I would agree with OP being less so, if they weren't OP. But you definitely know they're leaving out details here. This is a one-sided retelling. If ESH, let's be honest.", "This sounds like you are saying “don’t help people at all because they’ll probably want help again in the future”. If it’s not what you are saying, please explain, because I can’t read any other summary from it. \n\nPlenty of people only need help once. Plenty of people only need favors once. And even if they want more favors, one is free at any time to approve/deny requests as they see fit and appropriate - so it seems crazy to suggest holding a mentality that the first request should almost always be denied on principle. I am flabbergasted at this line of thought. Sure, there are people who take advantage of kindness, but again one can always recognize a pattern and readjust their response down the road. You aren’t out anything by being nice the first few times before realizing that they are a little unreasonable and you might have to *politely* decline to accommodate all of their requests. This seems to me like advice to “be the bad neighbor first just in case they end up being a bad neighbor!”", "Yes, so many of these are not about the situation, but how it was phrased. A \"OMG, I'm so sorry, but I have people coming over. I'll be done as fast as I can\" or \"I'm so sorry, but this is the only time I have off work for cleaning. I'll be quick\" or something would have had the same result without making everyone mad forever.", "Yeah that’s the problem with this sub, “asshole” is kind of up to interpretation. There’s a difference between “You’re not obligated to be better” and “you’re in the wrong” and “you’re not nice/kind of a dick”. Also it’s usually used here to determine who in the altercation is MORE wrong. \n\nThis is a case of “you’re not nice/kind of a dick” but also the other persons reaction makes them the bigger asshole. I personally wouldn’t have a problem with being considerate to other people living in my thin walled apartment and if someone politely asked me to not vacuum during their babies nap time I would have no issue making that accommodation. So yeah, I personally am not going to tell this person they’re not the asshole because I think they kind of are. But yeah, they have the right to be an asshole I guess.", "This sub is really good at \"you're NTA, you're just an asshole\", or completely ignoring that many times people can be right, but be an asshole about it... and judging those situations is what the sub is supposed to be for.", "Exactly! When I had my child, I immediately would put white noises on for her to get use to it, because tiptoeing around a baby would make you life harder, because you can't do anything when they are sleeping. NTA. OP's your neighbour is the asshole. You can't move into a apartment and expect other people to not live around you.", "lol my parents told me I wouldn’t sleep as a baby UNLESS the vacuum cleaner was running, it was like a requirement for me to nap.", "Babies love the rocking and the white noise sounds. My son needed a white noise machine for years.", "My partner is like that kid. He was the precious “only child” of his father. (He has a half sister by his mom who is 11 years older). The house was silent while he napped. Now he is the worlds lightest sleeper. Apparently, the dog sneezing woke him the other night. But I wouldn’t know because I was sleeping", "If your kid woke up continually from those “little noises” I bet you’d have adjusted what you were doing, just like your friend.\n\nParents who don’t have naturally awful sleepers just can’t understand.", "Lmfao ya REALLY don’t want to miss the dog dry heaving window… you only have so much time to save that situation 😂", "For just those reasons I sleep in Aftershokz headphones.  Bone conduction so they aren’t in/on your ears.  That also makes them almost unnoticeable when sleeping.   I literally have three pair so one is always charging and I never have to sleep without them.  (I also use them for various tasks at work hence the multiple pairs). \n\nWith them being in front of your actual ears they won’t block your alarm/phone/kids from waking you up but there is plenty of sound to dull harsher noises like partner snoring and neighbor music.", "If earplugs are uncomfortable then obviously they won't work for a person, but I can still hear things with mine in, including my alarm. It may depend on the type used but my preference is for shaped foam and I hated the wax ones. I've been using extra soft Moldex spark plugs 7800 for years. (Obviously not the same pair!)", "I always thought that the sound of a dog heaving would be the perfect alarm clock for any dog owner.  Nothing gets me out of bed faster", "Dog dry heave is the fastest I have ever gotten up in my life", "There’s no better way to turn me off from your religion than to knock my door, at anytime. I’m going to do some heathen stuff just to get back at you and your god…", "It has to do with the distribution across the frequency range. White noise is constant (30Hz is the same amplitude as 10kHz). Pink noise lowers the amplitude of the higher frequencies, and brown noise lowers them even more.", "I had an old coworker who did that. Their rooms had to be completely silent and pitch black, and they HAD to be home and in their cribs for naps.\n\nWell, guess what happened when they tried to go on vacations? Kids that have only ever slept in their own room with very specific conditions don’t sleep so well at resorts with bright lights and people walking around. She would come back so exhausted! I felt bad, but not super bad, because it was a problem of her own making.", "Maybe a better way to word it would be, if you live in an apartment, it isn't reasonable to expect zero normal noise in the middle of the day.  Doesn't matter why you have an apartment instead of a house.", "I think the reason op said no was because the neighbor was asking in a condescending tone. Maybe if the neighbor knocked and apologized for having to ask, explained the situation and acknowledged that op was doing nothing wrong and neighbor was asking a favor, the outcome would have been different.", "I have a two stage alarm clock with light, and it is lovely.\n\nIn the winter especially it is so nice to have that light in the morning.", "Depends on the sub.  This sub attracts some of the worst for some reason.", "I guess I was raised in a place where we work with neighbors and are friendly. Everyone here seems to hate them.\n  \nNot saying she should oblige the request but it seems like such a minor thing to get in a rage over. Keep in mind your neighbors can cause you a lot of pain and it's better to be courteous as you will receive it in return.", ">If someone is condescending while asking me a favor, they've guaranteed the answer is no. There are ways to ask for favors and being condescending isn't one of them.\n\nThere are also plenty of ways to say \"No\" without being an asshole and there is plenty of room for more than one asshole in a given interaction.", "No need to give us specific ages though, could have just said she was calling her out for being a teen mom.   \n\n\nPutting the specific ages like that would just get even more people against her because of how young she was when she had her kid.  \n\n\nBy leaving it as just “a teen mom” nobody would know the specific ages and for all they know she could have been 19 and not 14 when she had the kid.   19 is a lot more reasonable and less frowned upon than 14", "[removed]", "Same I hoovered my daughters room as she napped and I hoover round my dog with no reaction and she also usually snores through it. Washing machines and vacuums are essential for a good sleep routine", "Exactly.  The neighbor needs a house if she expects silence. \n\nNTA", "That's how we got our oldest daughter to sleep all the time. She wouldn't stop crying when we laid her down until we started putting the vacuum on in her room. We burned out 3 vacuums over the years between 4 kids doing that.", "Same here with the side effect that as an adult as soon as I get on a plane and the engines start up, I can barely keep my eyes open...", "I live in NYC. I can’t sleep without noise and lights.", "That sounds like torture. I'd be sleeping with headphones if I was that much of a delicate sleeper.\n\nBut seriously, it was to the point you couldn't even open a cabinet door.", "No, I wouldn't have. My kids have gone through phases where they didn't sleep well. I understand the whole mindset of \"I finally got you to sleep, I do NOT want you to wake up.\" because over tired babies are nearly impossible to put to sleep. \n\nI'm also not going to perpetuate that cycle.", "***EXACTLY!!!!*** Especially if they're *on my bed!* Ugh, thats just *the worst!*", "Her husband might bitch and moan about the noise, but that's not an everyday thing and he can mitigate it with earplugs. The toddler is not going to fucking notice once he/she has been put down.", "🤣🤣🤣\n\nKids and dogs are great co-conspirators.", "My ex’s kid used to pour cat food to his bath water if your eyes strayed from him for even a second. It was disgusting 🙈", "I once went to check on my nephews when things got quiet. They had gotten into a car, somehow managed to put it in neutral and the car had started to slowly back out of the driveway onto the street when I got there. Other side of the street there is a long, steep hill straight down to the ocean with some houses scattered along the shoreline.\nI’ve never run as fast in my whole life. The car was faster and was moving further away from me when one of the kids opened a door and jumped out but got stuck in the door and dragged after the car, right next to the wheel. Then the open door hit a rock and it slowed the car down for a second or two before it started speeding up again but it was enough for me to catch up, get in and slam the brakes. The kids were in a shock but unharmed beside a some small bruises on the one who got dragged after the car and disappeared between the wheel and the rock when the door hit it. I can’t even think what would have happened if they had gone down the entire hill (45-60 degree incline and around 300 meters) and either hit a house or gone straight into the Atlantic. \n\nSo yeah. If the kids get quiet, go check on them.", "That's so insane, sometimes my hubs will fall asleep on the couch during the week because he likes to be there in the morning before kiddo goes to school and he'll grump at me if I wake him to put him to bed but even if I leave him he never does more than grumble, and usually at himself because he's the moron who fell asleep in the living spaces where I have to work and live during the day", "Read past this comment your the 3rd person correcting it. If you gonna go all the way to quote at least read the next message please.", ">She started going off at me, calling me a childish whore, hinting at the fact that I was a teenage mother, called me a bitch\n\n🤷‍♂️ this would be a lot to just make up. Gotta give opinions based on the information given", "A lot of subreddits require specific ages in order to post so including the ages didn't stick out to me as offensive or anything.", "This comment was copied verbatim from the one u/bluegrassgazer posted 5 hours ago further down.", "Oof... Some days it's like that in a car for me. Especially when it's getting dark.", "It is for him. But he never makes it my problem. But genuinely I can’t imagine", "It is *truly* an important one. I'm glad I'm a light enough sleeper, that things that should wake me up, do. Even with headphones lol.", "My dog seems to have a bit of a weak stomach and does a very specific sort of pacing right before she shit herself. I've learned to shoot out of bed and rush her outside barely awake but my husband almost never hears her. 100% if I were wearing earplugs I wouldn't be waking up to the sound, but I'm sure the stench would raise the dead! I would much rather have to wait a minute or two by the door for her to do her thing and then maybe clean her up a bit than having to shampoo my rug or strip the bed in the middle of the night.", "When I had a cat NOTHING would get me out of bed faster that cat puke sounds! You are not puking hairballs on my carpet!", "Different babies are different. My younger niece fell asleep as soon as she heard a vacuum running, but my elder niece always woke to the sound. 🤷", "My little brother is still alive and vibing😂 he’s thankfully not eating off the floor anymore. He’s much calmer than he was as a toddler. And the dog is no longer with us. The dog he has now is like his babysitter and they’re a much better team. The previous dog and him were like lil snack villains", "I mean, which one are you going to blame? Either kid or dog could have had the bright idea for today's disaster (narrator: it was both of them...)", "Ewww!", "My parents were nuts. They slept in the living room and not their bedroom. Okay, fine. But then they wanted to sleep the weekend away, not getting up until 11 or 12 or so. But they expected my brother and I, even at the ages of four and six to be silent. We could watch TV, but not laugh too loud or talk too much.", "I wish it was that easy to not live next to assholes who believe that their comfort necessarily supercedes everyone else's, but here we are.\n\nLike, the sheer fucking audacity to suggest \"my husband is sleeping but I'll let you know when he's awake so you can resume doing the things you need to do in your own apartment\"... LOL.", "I've seen them used at grocers stores to get water out of puddles.  As if the water won't be right back in there within a minute because, you know, gravity.", "I never said OP should give in. I merely stated she could have worded her No far better. Now she has to deal with a crazy mad neighbour for as long as they both live there.", "They weren't there before when I first opened to reply. I ended up wasting a bunch of time trying to figure out how to do the indented quote the way you and some other replies do before giving up.", "This was after the neighbor \n\n>came with a batch of cookies to give to me and the other neighbours and introduced herself \n\nand \n\n>she knocked on my door as I was vacuuming, she was all smiles and happy\n\nI honestly don't know what the most condescending way to ask somebody if they might vacuum at a later time on account of a sleeping husband and baby, but I do know what an AH respone would look like: \"No. I’m not gonna change my time to suit your husband and baby.\"", "So, OP's statement right in the first paragraph is defensive.  She did not need to include her age or her daughter's, as they're irrelevant - and yet, they were included.  Why?  So OP could paint herself as the victim right off the bat.  I think OP may have \\*heard\\* what you describe, but I don't think that was actually said.  The alleged comments reek of teenage drama, and I do not think a 33 year-old woman who had previously shown kindness and an effort to build community with her neighbors would have gone off inappropriately and immaturely like that.\n\nOP strikes me as somebody who's been hurt by the world and is looking for a fight, and I think ascribing those words to her neighbor allows her to be seen as the victim and justifies her own behavior.  Therefore, I don't view OP as a reliable narrator.", "Ugh, yes, having to get up in the middle of the night so you can clean up vomit or excrement (especially, of course, the non-solid sort) is just *hell*. On those occasions, I remind myself that I truly love my babies, because, well, it's not going to be the thought uppermost in my mind at that point.", "In my case, as a bonus, the wall-to-wall carpet in my bedroom is beige, so it shows stains and dirt really easily. (I didn't choose it – as someone who intends to have at least two dogs at all times, I would *never* choose beige carpet! It was already there when I bought the house, and I couldn't afford to replace it at the time – and haven't been able to face the upheaval required to replace it since.)", "I mean if that set her off she was not being nice in the first place. That lady was faking it to get her way and when she didn't she showed how she really felt about OP. You don't just in seconds start acting like that it was an act.", "I mean if that set her off she was not being nice in the first place. That lady was faking it to get her way and when she didn't she showed how she really felt about OP. You don't just in seconds start acting like that it was an act.", "I agree completely.", "My alarm now is a cat meowing. Jolts me out of bed every time.", "Yeah the carpet was not my choice. Hardwood floors now but no pets allowed", "Luckily, the rest of my ground floor has hardwood floors, with oriental rugs (which hide dirt and stains much better and are also much easier to clean). And thank goodness for that!"]}