{"id": 21488, "submission_id": "14sbqld", "title": "AITA FOR VACUUMING IN THE MIDDLE OF THE DAY AND POTENTIALLY WAKINF UP MY NEIGHBOURS KIDS AND HUSBAND?", "selftext": "I 22 F have lived in my apartment complex for 4 years, and I have an 8 year old daughter -I don’t want to hear any comments about my age and my child’s age, I’ve heard all the words under the sun, I don’t need strangers on Reddit giving me the same crap-\n\nMy job allows me to work from home, and as a bonus, when I don’t have a lot of work to do, I can do my household chores like laundry, vacuuming etc. I don’t vacuum everyday, maybe just like every couple of days, usually late mornings early noonish. \n\nThe issue stems from the fact that I can hear everything my neighbours from the side, above and below me do, it doesn’t bother me as such but they can hear anything I do, again, I don’t play loud music, the only thing they’d likely hear is the tv if it’s on very loud or if I’m doing vacuuming, but because I do it in the middle of the day, I never get complaints up until now.\n\nCoral, 34, moved in 3 weeks ago, were cordial, and although cliche and weird for normal standards, a couple of days after she moved in, she came with a batch of cookies to give to me and the other neighbours and introduced herself and she seemed nice, but a couple of days ago, she knocked on my door as I was vacuuming, she was all smiles and happy but told me in the most condescending way possible that her husband had worked a late shift and their 12 month old baby boy was sleeping and was wondering if I could not vacuum right now, and that she would be happy to call back over again when they’re both awake so they could continue on, and I said no.\n\nThe time of day in which I do vacuum is not stupid early or really really late, I chose it because most people are gonna be up so I’m not disturbing a lot of people. \n\nI told her that I’m not gonna change my time to suit her husband and baby, albeit it’s not their fault for working late or you know, being a baby, and that she’s just gonna have to suck it up and deal with it. She started going off at me, calling me a childish whore, hinting at the fact that I was a teenage mother, called me a bitch, and then stormed into her apartment again. I’ve talked to friends and while they say I’m entitled to clean my apartment whenever I want within reason, I could have been a bit nicer, and that how I reacted was an dick move.", "created_utc": 1688655654, "permalink": "/r/AmItheAsshole/comments/14sbqld/aita_for_vacuuming_in_the_middle_of_the_day_and/", "score": 865, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I feel like the asshole in the way I replied to her. She was being condescending and having a “snobby lady” act to her, and that really pisses me off, so I was just rude back, even though this was the first issue between us.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA, I work the overnight shift and understand others in my building don't.  Instead of expecting them to put their daily lives on hold I bought a white noise machine and got some amazing silicone ear plugs.  You're not vacuuming at an unreasonable time.", "NTA.\n\nIf she didn't want to live in an apartment with paper-thin walls, she shouldn't have moved into an apartment with paper-thin walls. People do shit during the daytime. Her husband might bitch and moan about the noise, but that's not an everyday thing and he can mitigate it with earplugs.  The toddler is not going to fucking notice once he/she has been put down.", "NTA, doing it at night would disturb everyone else and this is a normal time of day to get things done", "NTA \n\nFrom what I've seen her attitude and tone pissed you off and not the request itself. And she quickly showed her real face and opinion about you when you said a simple \"no\" so you know you weren't making up her being condescending at the beginning.", "NTA", "You’re not the asshole. It’s your private space and I don’t think that vacuuming in the middle of the day is disturbing public peace or something. \n\nOfcourse we may never know how the actual interaction went, it may have been a bit better to say that you can’t stop vacuuming right now but you’re open to suggestions on when it would be best to vacuum in the future. \n\nAsking you to stop and wait for her okay is incredibly entitled", "its always smart to maintain the best relationship you can with nieghbors,.. if god forbid an emergency arises, they are the ones who can help and make the difference.\n\nNTA for vacuuming at a very reasonable hour. Your nieghbor is an AH. I would call your landlord and let him know what happened, chances are this is not the last time you will have to deal with this bad nieghbor.", "NTA.  What are you supposed to do?  Check with all your neighbors any time you want to do potentially loud chores?  In my experience if you give an inch they'll take a mile.", "NTA. You’re vacuuming at a normal time. Unfortunately hearing every little thing is part of apartment living. As long as the noise is within reason then don’t give it a second thought.\n\nEdit- to those voting E S H, why do you think it’s a reasonable request to ask someone to stop a basic household task in the middle of the day?", "NTA.\n\nAs a parent of two young children, the world does not revolve around me. As obnoxious as it is, our neighbor loves to cut their grass right at bedtime during the summer months. It's not unreasonable for her to do so. It just happens to coincide with bedtime for our kids.\n\nWe've never said anything to our neighbor because she's not doing anything wrong. It's annoying, sure. And I can see how a parent might think their request was \"reasonable\". But at the end of the day, having a kid doesn't mean everyone around you has to change their behavior. \n\nI do think your friends might be onto something. Sorry if this is too much since this isn't really an advice subreddit. But your post reads as you having a confrontational and abrasive attitude. If that carries into your regular life, that might be part of the reason your neighbor got upset with your interaction together. Obviously she crossed a line by insulting you. Without being there and seeing the exchange, it's impossible to say how things could have gone better. I just think it seems plausible you could be nicer. But we don't know each other, so I might be totally wrong!", "Esh\n\nShe started by asking nicely, *you* are the one that became confrontational, so she decided to lower herself to the level that you brought it to, so neither of you come off good. \n\nYou even began this story confrontationaly with the readers. You started by trying to make yourself the victim. \"My two kids and I live in an apartment\" and \"she hurled unnecessary crude insults at me\" would have sufficed.", "Obviously you can vacuum when you want during the day. But the way she framed her request seems pretty reasonable to me. I can't hear how condescending her tone actually was, but I feel like you could've been a bit more accommodating. Of course, nothing excuses her outburst after you said no. ESH.", "ESH. She asked nicely and you were super rude? Yikes", "It’s hard to say. By your own words, she asked nicely at first, and you didn’t respond nicely. You don’t want to, and you don’t have to, but I do not get the impression that you even considered altering your vacuuming schedule to be neighborly. She should not have turned on you but I’m wondering if that could have been avoided. ESH.", "ESH.\n\nShe came to you with a reasonable request. You didn't have to adhere to that request but if you were going to say no, why be so aggressive about it? \n\nShe's your neighbour. She came to you and your neighbours with cookies. She clearly wanted to make an effort with you all. And there is so much value in getting along with people who live outside of your home.\n\nBut what she said to you in response of your outburst was disgusting.", "YNTA for wanting to clean in the middle of the day in your own apartment. You may be a little inconsiderate for her family's needs and wishes and you could have accommodated her request but your are not obligated to. To blow of on you for simple saying no to her request was out of line especially going on a personal level. You being a young mother has nothing to do with the whole situation. It is not lunch time nor is it late at night nor is it in the early mornings. A baby will be asleep a lot of the days worht and not everyone can schedule according to the needs of one baby. They sleep most of the day like what?", "ESH-\n\nShe asked very politely and you were a dick about it.\n\nStill its your right to vacuum during these hours .", "ESH, In addition to being needlessly rude, you said you do it because it wouldn’t bother most people, and now you know that it does bother a significant portion of the people who actually hear it. (~¼ units next to you) Will you change your timing now?", "ESH.  You’ve admitted it and she was awful.", "YTA. Not for vacuuming,  but for being an ass to a reasonable request.  You could have said no nicely. Or said when you could do it, but no, you had to escalate. I agree with your friends.", "YTA\n\n99% of the responses here are completely missing the point that this sub isn't \"Am I Entitled To\" or \"Is It My Right To\" (as usual). It's called \"Am I The Asshole\" for a reason: because sometimes you're absolutely entitled to do something, but doing it is nonetheless a really obnoxious, asshole-y thing to do. Which is absolutely the case here.\n\nFirst of all, your entire argument is that you choose to vacuum at that time because \"it won't bother most people\". And yet your neighbour is literally telling you that it IS bothering her, which voids your argument, since she's one of the people you're supposedly trying not to bother. Is logic difficult for you?\n\nSecondly, contrary to what another commenter argued, she's not even necessarily asking you to vacuum at night when it might bother people. She's just asking you to give them a few hours so her husband can get some rest. She's asking for basic thoughtfulness, and she even offered to communicate with you and let you know when he was up, which means that you don't have to do any guesswork. And yeah, maybe it wouldn't work for you; but you weren't even willing to give it a try once or twice? Super asshole-y.\n\nThirdly, she came to you with a very reasonable concern as a neighbour, was polite about it, and you came back at her with aggression and rudeness, for *absolutely no reason at all*. You don't want people to judge you for having been a literal child when you had a kid, which is fine (I actually don't judge you, my heart breaks for you), but I'll be damned if I won't judge you for being 22 years old and not having learned a damn thing or grown up at all since then. You're STILL behaving like an aggressive, immature 14-year-old. Sad and worrisome, given that you're raising a child.\n\nAnd finally, a lot of people are judging E-S-H because of the hateful things your neighbour said, and no, she shouldn't have said them. But the reality is that she wouldn't have said a single one of them if you hadn't come at her the way you did. She was reacting, not aggressing. And I'm not going to judge her an asshole for *responding* to you being unbelievably rude to her for no reason at all by matching your energy.\n\nYTA. It doesn't matter what you're \"entitled to do\". The point is that you're thoughtless and an AH of a neighbour.", "And that's why vacuuming and making any kind of noise between 12 and 15 o'clock is forbidden in German apartment buildings.", "YTA\n\nYou escalated the dispute. You could have accommodated her request and all would be well but you \"stood your ground\".", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI 22 F have lived in my apartment complex for 4 years, and I have an 8 year old daughter -I don’t want to hear any comments about my age and my child’s age, I’ve heard all the words under the sun, I don’t need strangers on Reddit giving me the same crap-\n\nMy job allows me to work from home, and as a bonus, when I don’t have a lot of work to do, I can do my household chores like laundry, vacuuming etc. I don’t vacuum everyday, maybe just like every couple of days, usually late mornings early noonish. \n\nThe issue stems from the fact that I can hear everything my neighbours from the side, above and below me do, it doesn’t bother me as such but they can hear anything I do, again, I don’t play loud music, the only thing they’d likely hear is the tv if it’s on very loud or if I’m doing vacuuming, but because I do it in the middle of the day, I never get complaints up until now.\n\nCoral, 34, moved in 3 weeks ago, were cordial, and although cliche and weird for normal standards, a couple of days after she moved in, she came with a batch of cookies to give to me and the other neighbours and introduced herself and she seemed nice, but a couple of days ago, she knocked on my door as I was vacuuming, she was all smiles and happy but told me in the most condescending way possible that her husband had worked a late shift and their 12 month old baby boy was sleeping and was wondering if I could not vacuum right now, and that she would be happy to call back over again when they’re both awake so they could continue on, and I said no.\n\nThe time of day in which I do vacuum is not stupid early or really really late, I chose it because most people are gonna be up so I’m not disturbing a lot of people. \n\nI told her that I’m not gonna change my time to suit her husband and baby, albeit it’s not their fault for working late or you know, being a baby, and that she’s just gonna have to suck it up and deal with it. She started going off at me, calling me a childish whore, hinting at the fact that I was a teenage mother, called me a bitch, and then stormed into her apartment again. I’ve talked to friends and while they say I’m entitled to clean my apartment whenever I want within reason, I could have been a bit nicer, and that how I reacted was an dick move.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "She shouldn’t have to alter her vacuuming schedule to suit the new neighbors. She’s vacuuming at a normal time of day for noise to take place. If the neighbors are on a different schedule, it’s on them to adapt, not OP. They make earplugs and/or headphones and white noise generators for exactly this situation. \n\nNTA", "lol \"reasonable\" she's making noise during the day (not during quiet hours) husband and baby need to adapt to living in apartments or move into a house if it bothers them that much", "What a pathetic response. You’re too busy being an asshole about OP having a kid while she was a kid (when you don’t know her situation at all) to leave an intelligent comment.", "It depends on the rental contract. Where I life this only applies for weekend (or only Sunday I'm not sure in this one). But it's common courtesy to not make loud noises between this times during the week too.", "LOL, absolutely fucking not.\n\nCoral had ample time to check out the apartment and discover that the noises within were not to her liking. She chose to live there anyway. Why should a neighbor have to STOP doing useful things within their own domicile when they have the time to do it?", "I agree she doesn’t have to.", "[removed]", "Your comment has been removed due to a [rule 1](https://www.reddit.com/r/AmItheAsshole/about/rules/) violation. Please note this section of our rules:\r\n\r\n> Don't lecture people about the rules (use reports).\r\n\r\nFurther violations may lead to a ban. **[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "I mean... you're not wrongvfor vacuuming in the middle of the day when it wouldn't bother most people, but it sounds like she asked you nicely and your response was pretty rude. Why couldn't you wait an hour to vacuum? It's really not an unreasonable request.\n\nI live in an apartment, too, and yes, there is a reasonable expectation of noise from neighbors. But we're all courteous of each other and if someone asked me to hold off on vacuuming while their child napped, of course I would do that.", "She came with cookies and asked a simple thing. You could have been nice about it.", "You know how people like to look back fondly on the era when you could knock on your neighbour's door and ask for a cup of sugar? Based on the responses here, a lot of you would react to that kind of request by saying, \"No way! You're not entitled to my sugar! You should've gotten yourself more sugar when you were at the store! Your emergency is not my problem!\"", "You could have used this chance to be an awesome neighbor, say it’s great they let you know they have a atypical schedule and then adjust.  Sounds like your schedule is flexible, so…why not flex?  \n\nDo you have to change?  no.  But expect to be met with the same energy you show them.  If i were them i’d start have doing chores and making noise at hours that bother you if you continue down this path 🤷‍♀️", "ESH.\n\nWhile you are doing nothing wrong by vacuuming your apartment, your own story describes your response as confrontational and frankly somewhat childish. You aren't an asshole for vacuuming, but when a neighbor makes a polite request, you can at least return the politeness, even if your ultimate answer is \"no, I will not change my behavior to be more convenient for you.\"\n\nObviously your neighbor went nuclear and at this point I would not even speak to her; talking to you that way is infinitely way over the line. You may want to consider reporting the interaction to the apartment complex. I say that because sometimes people like this can be petty and if she goes to your complex and makes some shit up, they'll tend to believe her because she got their first.", "NTA vacuuming at a reasonable time is not inconsiderate. We can’t live our lives according to other people’s schedules. When I was night shift I bought blackout blinds and earplugs. When I put my kids to bed I’d pick up the toys and run the hoover round the living room, by that time they were sleeping. You shouldn’t tiptoe round babies and I’ve walked the floor with a colicky baby it’s not general background noise that kept them awake. (I’m not talking about blasting noise).", "ESH She asked nicely and your response seemed kinda rude. And if you work from home, why can’t you just vacuum at like 3pm instead of 11am? Would it be that big of a deal? \n\nBut I also agree with people saying if you work night shift, don’t move into an apt building where you can hear your neighbors.", "ESH\n\n>I told her that I’m not gonna change my time\n\nIt's vacuuming, it's not that time sensitive.", "ESH; her for being rude, you for being unwilling to accommodate them at all. Surely there's a time they're awake that you can vacuum?", "Someone with a boombox that periodically turns on without a reliable on/off switch has no right to complain if someone else makes a little noise.", "YTA. \nI mean she was just asking and offered to tell you when it’s okay again, also just for that day I suppose. It’s not that big of a deal to pause the vacuuming for an hour or two", "NTA - her comments were uncalled for. You're vacuuming not taking a broom to the walls and intentionally making noise to upset her. So she wants you to live your life around her schedule? She's in the real world and she's just going to have to deal with noise, especially living in an apartment complex.", "NTA\n\nYou can vacuum whenever you want, within reason. However, I might have asked if there was a time that would be less inconvenient and if it was reasonable I’d try to accommodate.", "ESH She was rude; your age at the time your child was born is irrelevant. However, apartment living sucks and if it is ever in one’s power to be kind, that’s what you should do. She probably could give you a general idea of a good time to vacuum. Should you *have* to do this? No. Is it a nice thing to do? Yes.", "NTA She has to hoover too, I assume. How do you think she would have reacted if you had gone to her first and asked her to stop hoovering in the middle of the day for the reasons she cited? She would have lost it with you in all likelihood. I may not be the best person for advice on this. My neighbour has complained about the noise my dehumidifier makes at two in the afternoon. I was on your side by the title of your post alone.", "NTA. Ambient noise is part of apartment life, and honestly a lot of parents don’t bother to curb noise during naps because it helps babies learn to sleep through sounds. Maybe don’t tell her that though, probably won’t help you here😅 but I don’t think vacuuming in the middle of the day makes you an asshole. She wasn’t an asshole for the initial ask but BIG yikes on that name calling.", "INFO\n\nWas it a one time situation or did she ask to never do noisy things at this specific time?", "NTA.\n\nEvery time you want to do *anything* that might possibly make noise.   Ask your neighbor if it's a convenient time for *them*.  \n\nEvery single time!\n\n I would like to clean now, is this a convenient time for *you*?\n\n I would like to cook now, is this an acceptable time for you?\n\n I'm having guests over.  What time would be best for you in regards to possible noise?\n\nI'm about to watch a movie, is the time convenient for you?", "NTA.\n\nThis is apartment living it sounds like and she has to adapt.  While you could have said it nicer (I wasn’t there so not sure how you might have sounded) her reaction is over the top.", "ESH \n\n\nYou did nothing wrong, other than using all caps in the title.", "Based on your opening statement, I suspect you might be TAH but there’s not enough info here to make an informed assessment.", "It's a vacuum, not a leaf blower. NTA", "Oh man, NTA. It is totally reasonable to move about your home, watch tv, vacuum, and do all the normal activities of life in your apartment during the day. If it was super early in the morning or late at night then it might be a reasonable request. But if you're between the hours of, say 9am and 7pm there is zero room for argument or requests.\n\nRest assured, you are totally fine. The fact that she brought cookies and seemed nice early on is completely negated by the fact that she threw a temper tantrum on your doorstep when you said \"no\" to her unreasonable request.\n\nIt was ok for her to ask. It was ok for you to say no. Her reaction was not ok. There's nothing more you need to know about this person.", "YTA. Easy to accommodate a simple request", "YTA You have a lot of flexibility when you vacuum. Vacuuming by itself isn't loud; if if you turn up the TV loud enough to be heard ovia vacuum, that is way too loud.", "NTA. Late shift workers are fully aware that their schedule will not line up with people working normal shifts. They usually have ear plugs and blackout curtains/sleep masks.\n\nThe only thing you could have done was to be considerate and ask her what time works for her and see if that fits your schedule too. Telling her to suck it up and deal with it was a bit rude, but not enough to put you in asshole territory.", " It would have been a small nice gesture that cost you nothing especially since you aren't bound by a schedule and your immediate go to response was to be rude. Your neighbours response was also terrible though so ESH.", "INFO: What time of day? You seem to avoid saying what time it is, just saying it's not really early or late.", "NTA.\n\nWhen you live in an apartment, you’re going to hear your neighbors from time to time. My downstairs neighbor can hear my cats run from one end of my apartment to the other when they are playing(albeit one is a bit of a hefty gal lol). My next door neighbors dog barks every single time someone walks past our doors, and of course you hear it. It’s part of it. As long as someone’s not being excessively loud or doing it during typical “quiet hours”, then you just gotta live with it. I had a friend like your neighbor, and it never went her way when she threw fits like that either. Needless to say we are not friends anymore 😂", "NTA but prepare for a lot of night time noises if you piss her off", "Apartments suck and the entitlement is incredibly irritating. If nothing else, it encourages people to prioritize getting financially to the point where you don't have to share walls one way or the other. Man those situations make me feel petty. I would want to just run the vacuum for kicks. Anyways, nta. Live your life. If it's too much for them, they're welcome to do whatever or nothing at all. Who cares. Not your problem.", "NTA let your apartment manager know what happened.", "If this was just a one off thing, then YTA. She asked nicely you say ? He worked a late shift and baby sleeping? Maybe it was a bad day all around and they just needed this one time, ya know? Do you have ocd, just curious if you're vacuuming every other day and you work from home you're not likely tracking dirt in, this I'm really wondering bc I've dealt with it.", "NTA\n\nHer hubby needs a white noise machine, or simple earplugs. Easy fix. I work 13-2300 outside in the heat right now, and my wife snores like a bear! Earplugs and a box fan make ALL the difference.", "YTA for your reaction. It would have hurt nothing to delay your vacuuming by a few hours. It's not like she told you never ever vacuum without her permission again, she's asking you on this specific occasion, and she asked you nicely. You're within your rights to say no, but you could have responded nicely. And frankly as you had no reason not to be helpful, I think it's safe to say you chose to be actively unaccommodating.\n\nShe then reacted really badly, in all fairness. However you'd been pretty rude first.", "NTA. I bet you have to listen to their damn baby at all hours of the night, so they can listen to your vacuum.", "NTA, do your thing!", "I has my 1st daughter at 16 and my second daughter at 20. So long as you're a good mother, fuck what people have to say. \n\nNTA and good on you for shutting that shit down asap.", "I used to work midnight shifts... so I found a building that I knew would be quiet, with walls thick enough to block that kind of noise. I never expected others to change their lives to suit me. NTA.", "Hell no NTA. You can vacuum any damn time you please in your own home. Your neighbors are beyond entitled and delusional.", "NTA.  I'm also convinced we must be neighbors. Politeness is key and while your neighbor had a decent request, her response when you said no was inappropriate. Maybe, in the future, something could be worked out. And just like yours, my neighbors have no qualms with screaming as loud as they want whenever they want, but they get mad when others make any form of noise.", "NTA\n\nShe can chill with her attitude while you clean whenever you want to.", "NTA. When are you supposed to vacuum if not the middle of the day? That is bizarre. Also, I vacuum when my own family is sleeping and it’s fine. It’s not like you’re throwing a party.", "NTA. You're vacuuming during appropriate times of the day and when it's convenient for you. She doesn't know your work schedule, so for all she knows that might be the only break you have in the work day to vacuum. \n\nAlso, apartments aren't exactly the place to live if you don't want to ever hear your neighbors. She has to expect some noise, especially during waking hours.", "Nta you are just follow the building rules", "Nta. She could have got a house, so her husband and child can sleep in peace in the middle of the day, rather than a flat. You live in a flat, you expect to hear noise.", "NTA. Even if it was reasonable of her to ask you to stop vacuuming in the middle of the day (which it wasn’t at all) saying “I’ll tell you when it’s ok to do it” is so stuck up. It’s good you stood firm now because it sounds very much like she would have been quite happy dictating forever when you can and can’t vacuum and who knows what else.", "NTA. You did the right thing. If you had acquiesced, she would have kept asking for dumb stuff.  \n\nNoise is part of apartment life. I lived above a loud dj for two years. In a way, I appreciated it because it gave me a license to be loud as hell.  But, I was SO happy when he left.", "NTA. She’s insane for asking you to change a very simple task and not do her due diligence to mitigate the noise during loud hours. It’s the middle of the day. The privilege of asking people to wait to do things is when you live together :) If you’re in any kind if housing situation where you share a wall, be ready to handle noise and do something about it if you work a non typical schedule. Or move.", "NTA - I literally played vacuum sound videos on YouTube to help my son sleep when he was a baby.", "Oh christ, people like this are exhausting. \nYou're not obligated to be bound by someone else's schedule. \nIf they need silence, they should live in a well acoustically insulated building. They can't expect that on a whim. \nNTA", "NTA. This is a regular daytime noise.", "NTA...Id actually be louder now...🙂", "Depends entirely on how things went down and what/how she actually asked. If I'm vacuuming at midday and someone asks (nicely) for me to wait until later in the afternoon, then I don't see anything wrong with that. Unless it conflicts with some other commitments. But then I'd try and find out what would be a good time. Being a good neighbour can make a huge difference to life in that space. But if someone comes stomping over and talking to me like shit, then I'd be inclined to push back.", "Hm. \n\nTechnically the advice you’re getting is defensible - it’s your space, do what you want -  but I’m of the view that you should try to collect friends rather than enemies whenever practical. \n\nI might go back to that lady and talk about schedules. Maybe you (like me) prefer to set a routine and do the vacuuming at a certain time. Perhaps you can adjust, or explain why you can’t. If you work from home maybe there is some wiggle room.\n\nOf course you do what’s good for you, you don’t have to let night shift neighbors rule you. But they are neighbors. There’s an implicit connection. \n\nSo I think a follow up chat would be nice. It would show that you’re ready to expect and to give courtesy. Even if the vacuuming continues to bother them they cannot accuse you of being disrespectful or inconsiderate.", "It’s hard to make a judgement because I think it really comes down to how you spoke to her. If you politely declined her request you’re not an asshole. If you were rude at all then yeah you’re probably a bit of an asshole.", "Fully TA. It was reasonable request from a new neighbour. A decent person would err on the side of a positive trial, rather than a middle finger outright\n\nBe better", "ESH. I think it’s clear in her reaction to you that your neighbor is an AH. And it’s just vacuuming at normal hours, nothing wrong with that. BUT, you could have maybe delayed just this once but made it clear this is a normal time you vacuum. Neither of you reacted well.", "Nta. If the adult is bothered by noise, he can get earplugs, turn the tv or a fan on, etc. And it's good for a baby to have to learn to sleep through noise, otherwise they'll be a light sleeper their whole life", "I'm sorry, you could have been a bit nicer? NTA", "NTA. I mean, I totally would’ve waited to vacuum bc it’s not a big deal but it’s your space and you’re entitled to do what you want even if I personally think it’s silly or rude", "Yeah how you responded is what got you in this mess.\n\nThat said… she sounds like she’s matched the emotional intelligence and you two are on par.\n\nYou’ve had a kid. You know how hard it is to navigate a baby and a guy working shift. I would have at least asked when he finishes shift work usually and then just changed my schedule.\n\nYou don’t need to vacuum at that exact time", "NTA.", "NTA\nHaving lived in the dorms and in my old apartment you could hear ppl vacuuming but that's just kind of a fact of life. It's too inconsistent for me to fall asleep to so I use a fan. Guess what? I don't hear anything when that's on. My old neighbor had a similar schedule to me as we'd both be up vacuuming at 1am.", "NTA\n\nAs long as your vacuuming falls within the hours deemed acceptable by your municipality, you're golden.", "NTA you weren't doing anything wrong. She can ask, but that doesn't mean you have to agree, and her attack makes her a nasty piece of work.", "Honestly, living in an apartment building, you need to expect that your neighbors are going to be loud regardless of the day or night. While we have a right to ask for silence overnight, there’s not much we can do about it if you have someone living above you below you were across the hall from you. So she has no real expectation to silence at any time of the given day. So no, you are not the asshole.", "It sounds like she was courteous when she asked, but you weren’t obligated to change your plans for her during reasonable hours.  You could probably replied in a nicer way that sounded less combative, but your NTA.  Her response to not getting what she wanted was totally uncalled for and she is the AH and crossed a line.  You don’t need to start a war with this woman, but if she wants a quiet place, then she should ask the landlord to move apartments or move out", "NTA\n\nI've has complaints for worse and I still it's reasonable to play my guitar at 5 in the afternoon.\n\nI feel bad for people working unusual shifts or have children, but it's something you've got to deal with when you share a wall with other people.", "NTA. I live in an apartment and have a 3 month old. I’d never dream of asking a neighbour to not do normal daytime activities in daytime to accommodate her naps. \n\nApartment living by nature requires living around the noises of other people living.\n\nIn your shoes, I’d maybe have asked if the little one has scheduled naptimes and agree to *try* to work around it in future but I likely wouldn’t have made any grand promises.", "NTA you are not doing anything not normal. If she had something like..my husband just finished chemo..that might have been dickie of you. Vacuuming in the middle of the day is when you do that..duh. And sorry for her, living in an apartment complex? Good fucking luck it's gonna be quiet.", "NTA. I, personally, would try to accommodate the neighbors because of the baby, but I’m a self-professed people pleaser.\n\nOP, you should tell her she can come over and vacuum for you 3x a week if she likes, since she knows the schedule best, and see what she says.", "Think I'd be  looking for petty or not so petty revenge...", "NTA\nHearing your neighbors comes with living in an apartment.  Her husband could wear ear plugs and they could run a sound machine to drown out noise while him and their kids are sleeping.", "While I don't work nights, i do struggle with sleep. My only gripe of being woken up is if its stupidly early.\n\nWe've got spubd proofing on our walls, our neighbours are elderly and when we moved in we were told that one neighbour would prefer a quieter neighbour. That and the fact I know i can be impulsively loud at times is partly why we got sound proofing. Its also due to us WFH.\n\nThat said, I am a carer I hoover throughout thr day not constantly though and won't hoover before or after certain times (the exception is spiders)", "NTA…\n\nI’m kinda seeing a trend of people (often with kids) being upset or offended by the fact that the world doesn’t stop when *their* kids or family or self have such whims. No one else’s kids are to be considered and even if someone else’s child is involved, what’s best for their own child—and not the group—is what should be done. If you knocked on her door about vacuuming when she does, she’d be offended bc her husband works nights and she has a toddler and it’s the only time she could vacuum, how dare you try to tell her how to run her home? \n\nYou’re a single mom with a school aged kid. You’re a teen mom, *so what*? Why does that make you and your daughter subservient? You vacuum when best for your family, during the middle of the day, no less. And if you start vacuuming at night, you’d *still* be an AH in Coral’s eyes because Coral seems to think that the whole complex ought to consult her family’s schedule before making any decisions or plans.\n\nAnd yeah imo, people like that *should* be treated with less sensitivity than others. If you don’t care about anyone’s needs but yours and your family’s, why should I politely ask you anything? No I’m not calling you to ask when I can resume vacuuming, tf? Courtesy can be interpreted as compliance and I personally would have been much ruder if I had been condescended to in such a manner. If you did and said as you indicated, I think you had excellent restraint and even considered that her husband and baby *were* affected, but that ultimately *you still had a responsibility to clean your own space*.", "NTA.\n\nFunnily enough, the office lady for my complex (nicest old lady you'll ever meet) recently sent out a mass email to \"remind everyone that, despite popular belief, your neighbors are not magical butterflies\" and asked everyone to quit making daytime noise complaints for people just living their lives.", "NTA\n\nI work nights, and when I was still in an apartment, every Tuesday the mowers would come at about 9am. Twice a month they would pressure wash the outside of the apartment. I even had some people come into my place for an audit of the building while I was still sleeping. All of these things are what happen when you work nights and live in an apartment. You are right to vacuum at a time that is the most convenient for the most people, that lady sounds like a dick.", "NTA. Especially if you're doing it around your work schedule.\n\nI work nights. And while I would *love* to have perfect quiet during the day, that's not a thing. Especially in an apartment complex, and one with such thin walls.\n\nEarplugs and white noise machines exist. You can get noise cancelled (or normal) headphones for babies to wear (I know someone whose baby slept through a very raucous pub night with said headphones). She is entitled to ask, but she doesn't get to get angry at you when you say 'no'", "NTA.  They can't reasonably expect you to alter your daytime routine to suit them. The world doesn't work that way.", "NTA\n\nYour neighbor needs to get used to apartment living.  People do things at all hours that are not listed quiet hours.  \n\nMiddle of the day is a normal time to vacuum, run laundry, run dishwasher, etc.  \n\nIf you are doing that stuff between about 7am and 9pm you are good.  \n\nFor the age thing…. just start thanking people for complimenting you on your youthful appearance.  Your neighbor doesn’t need to know how old you were when your child was born.  She doesn’t need to know your current age.\n\nYou are an adult, with a child.  Period.  \n\nNext time she makes a disparaging remark regarding your age or age you had a child, just smile, say thank you for the compliment on your youthful appearance and walk away with your head high or close the door on her.", "Nta, but unless the time you vacuum is not flexible, you could simply change the time you do it to be nice. Yes it’s their fault they work 3rd shift but someone has to…and I guarantee as neighbors you’ll have a simple favor to ask of them at some point, better to build goodwill when you can.", "NTA  they should try ear plugs and white noise machines.  Vacuums aren't that loud.", "NTA\n\nYou're actually doing her a favor by making noise during the child's naptime. Parents that require complete silence during children's naps, end up with kids that absolutely cannot sleep in anything but perfect silence. Kids should be able to nap with everyday noises happening. Additionally her husband's work schedule is not your problem.", "NTA. My husband did graveyard shift for years. At our last apartment, we were in a unit *right outside* of the very popular basket ball court. You know what my husband did? Popped in some ear plugs.", "NTA", "NTA.\n\nIt's not your problem to deal with. They can find a million ways to sleep through daytime noise like vacuuming.\n\nYou have no obligation to put your responsibilities aside to accommodate them.\n\nYour reaction was not unwarranted. Her request is unreasonable.", "[removed]", "NTA. Why should you adjust your schedule for a virtual stranger? This is apartment living. You can't control when other people vacuum.", "NTA my mom worked night shift and still expected the house to be tidy so she would sleep in the back bedroom with the door closed so I can help her out..this was 25+ years ago when there was no white noise n other stuff so your neighbors need to find a way to adjust they aren't the first family with weird work schedules or babies..", "NTA\n\nEven if you literally said that she needs to suck it up and deal with it, that's blunt but not inappropriate. It's true, they do need to suck it up and deal with it. Sure, you could consider being more flexible about when you vacuum, but I can't say that I'd want to especially after she went from nice to a completely inappropriate meltdown the second she didn't get her way.", "The husband can wear ear plugs and she can put a sound machine in the baby’s room", "Nta... Gotta love it when people expect the world to revolve around them.", "I can understand asking for the sake of the baby as there are days as a new parent that the child will not sleep and then suddenly they decide they want to nap.  So you get them bedded down only for the amazon driver to ring the doorbell and wake the child up (pretty sure I would get off on a murder rap).   Still unless OP is using a commercial vacuum used for sucking up packing peanuts I think the kid can deal.  \n\n\nThen of course there is the husband that works the late shift.  HE can deal regardless\n\n  \nNTA.", "NTA and I am sorry that people try to shame you for being a young mother. No one has that right. That you are working and are independent is a great success. I think that it’s great that you are able to enforce boundaries. Your neighbours have to adjust to their new living arrangement", "NTA - they’re the ones with alternative schedules. Not you. Her entitlement is staggering to think she was going to start running your building like that 3 weeks in.", "Well, you know that you cannot reason with children.  You can reasonably clean your apartment or make noise between 7 am and 10 pm in most states.  Is it polite to vacuum or play loud music at 7:15am or 9:45pm?  No.    You could have asked what time would be better, and then decide if that works for you or not.   Like maybe 3 in the afternoon?   But one never knows when exactly most kids will nap at that age, I had one would just lay on the floor when tired and have at it.  Another who laughed in the face of sleep.  \n\nNeighbor lost all accommodations when she started yelling and name calling.  If it were me after that, I would not open the door if she knocked again and I would turn around if i saw her outside.   If she started yelling, I would just say no and walk away.", "NTA\n\nnow keep vacuuming and put music on during the day, as long as is not quiet hours there is nothing your neighbor can do.\n\nalso there are this things called earplugs that the husband can use.", "ESH-I assume her husband sleeps when everyone else is up and is awake when everyone else is asleep(including you!). Why do you and everyone else(they would be awoken by the chores)have to interrupt your sleep to accommodate one person? It sucks for him yes,but at the same time its not your problem.\n\nEdit-from ntw to esh. If she was rude about it I would say nta,but she tries being cordial and you told her to pound sand which caused the negative reaction. No is a complete answer,but adding extra after is usually not going to invoke a positive reaction.", "NTA tell them to fuck off", "[removed]", "NTA 100%.\n\nMost apartment buildings have a 'Quiet Time' which is generally something like 9pm-7am or something like that (at least that was the hours at my last apartment).  So basically you can do anything you want to outside of those hours.  Since you are doing regular household things that aren't crazy loud, and doing them during the day when a normal person would do those things, your neighbour really has no say at all.  \n\nIt's not your fault that her husband worked a late shift or that she has a baby, you shouldn't have to accommodate that at all.  It's up to her to realize she lives in an apartment, and her neighbours are going to make reasonable noise during the day, and she has find her own way to adjust to that.", "I would have waited since she’d been friendly and asked nicely and it’s really a small thing to ask.  She went crazy, though, and overreacted.", "Nta if you are between 8am and 10pm. People who work night shift have to deal. Like someone else said, add rugs to bare floors, white noise or play music, sound dampening panels on walls of bedroom, earplugs etc.\n\nMy son was a super light napper as a toddler. I played \"easy listening\" radio in his room or I couldn't  even flush the toilet or run the faucet without waking him. The music in his room took care of muting sounds from the other rooms...and mom got his nap break to get chores done.", "My asshole upstairs neighbor vacuums at 12:30 am (yes you read that right) and seems to run sprints daily across his wood floor above my head. It’s just a single young dude, I haven’t addressed it because that’s city living but, still, I weep for any shift workers living under him in the future.", "Do it at 3am then see how feels about it being done", "There is a white noise app for her phone.  It has oceans,fans, birds etc. and it drowns out other noises.  Please tell her so you can continue your life.  You are NTA.", "NTA. You’ve done nothing unreasonable.", "You may not *technically be the asshole, but you don’t seem like a pleasant neighbor.", "NTA. Your vacuuming time was fine, she requested even though quite a reach. I also personally wouldn’t put a hold on my midday clean for her. \n\nBut dude, your tone to us is so damn aggressive lol. Jesus", "NTA. If you tried to work around everyone else's lives you will never get anything done.", "I always trained by kids to sleep through vacuuming and my husband worked nights for years and slept through normal family life", "NTA- I worked nights for 5 years, it’s a tough shit situation. You’re not being disrespectful or being loud at inappropriate times. No different than landscapers pissing people off by starting at 7am.", "Take no notice of your uptight neighbour, and her snide comments. You are working, supporting your daughter, and keeping a clean home. I'd say you're a real winner with a good head on her shoulders. \nThe baby will adjust to noise, as babies do. The husband can invest in ear plugs. It's not your problem, and you're not being inconsiderate by hoovering in the day.", "ESH\n\nNo, you’re not obligated to stop vacuuming, but you could have at least considered it.", "Yup YTA. Is it your \"right\" to vaccum whenever you want? Of course. But she didn't BY YOUR OWN STATEMENT come at you rude or yelling she nicely requested that hey right at this second my baby and my husband are sleeping can u just wait for a little bit. \nBy your own words u didn't have a reason you had to vacuum only at this moment and it would've been minor to say Sure but just to let you know I usually vaccum around this time every couple of days because it's when I have a break. \nNOT being an asshole is more than just being a bare min living being. \nAnd by your own description, you not only said No but did so in a harsh and rude way. (Deal with it and suck it up were your exact words according to ur post) so yea YTA.", "NTA", "NTA", "ESH. And frankly, with the information given, you’re the bigger AH here. \n\nYou don’t list any actual reason why can’t vacuum a little later. In fact you don’t even list a reason why you don’t *want* to switch times. All you’ve told us is “I chose this time and I won’t change it”.\n\nTry to imagine that you had to work nights at a job that probably sucks to support a partner and baby. All you want is some rest but your neighbor refuses to wait a few more hours to vacuum “because I decided to do it at this time”. \n\nWhat the wife said to you was horrible, but you are also a compassionless AH for sticking to a schedule that would cost you nothing to change when you know it’s preventing a working father from resting.", "NTA. I live in an apartment as well and it has pretty thin walls so you can hear what people are going during the day. My general rule of thumb is do things like vacuuming/setting up furniture/etc between 10 am to 4 pm. Most people are usually up and doing their own stuff around this time. \n\nSucks that her husband works a late shift but there are ways they can fix it themselves. Play music or white noise when sleeping. Wear earplugs when sleeping. \n\nI would check your building lease paperwork and check if there are certain \"quiet hours\". My building has them from 10 pm to 6 am to avoid people throwing parties late into the night and disturbing others.", "Yeah, I also work nightshift and don't expect the people around me to cater to my need for sleep just because I choose to work nights.\n\nNTA Op", "I'm looking forward to the neighbor complaining to everyone else in the house for doing normal things during the day, because literally no one will be able to plan their noisier activities according to this one family. That's just life.", "Also, apartments aren't exactly the place to live if you don't want to ever hear your neighbors.", "Yup. Our building's gardener comes every Thursday with a leaf blower. Probably the most obnoxious sound in existence. I put in ear plugs and ignore it until he's gone. \nIt's not my place to stop him from doing his job. \nGod forbid this woman live next door to a construction site.", "I can't recommend a white noise machine enough, it's the best gadget I've ever bought. I just wish I knew about it back in my shitty college apartment days.", "Ya. I basically fortified my room when I was on 3rd shift. Foam on the walls, blackout curtains, a/c was good white noise, etc. I wouldn't get mad at neighbors for going about their normal lives. \n\nI did put a note on my door asking not to knock so I'd only get mad if someone knocked on my door", "I used to, at the weekends during the summer neighbours would cut their grass. Not once did I say anything as it was my problem not theirs. NTA", "My neighbour has complained about the noise my dehumidifier makes at two in the afternoon.", "I hated night shift. I had to race to beat the sun home. If I saw the sun my body was like, “No sleep for you!” So glad I found amazing black out curtains", "Could you share more information about the silicone earplugs? I’d like a replacement for the disposable foam ones.", "You are right to vacuum at a time that is the most convenient for the most people, that lady sounds like a dick.", "agree with you.", "Yes but OP didn't really explain why she had to vacuum at that particular time. I get that it's her apartment and she's doing it at a reasonable time but why not be considerate in that situation? I don't agree with the neighbor's response, she shouldn't have gone off on her like that, but I certainly understand the frustration. Unless there's some reason why OP has to be vacuuming at that moment then I don't see why she couldn't have just waited.", "When someone shows you who they are believe them.", "Get a shared agenda with the whole building to agree on the 10 minute window to vacuum that won't be an inconvenience to anyone. Also add that you agree on these terms on the condition babies will only be allowed to cry between 4pm and 4:30. We allow them half an hour because they are, you know, babies.", "To be fair, housing is rough for a lot of people right now and we can’t pretend like everyone is rolling in options. That being said I totally agree with you. For like six months my apartment complex would do yard work and leafblow directly by my place during my infants nap time. It just is what it is sometimes lol. Nap time is only sacred to the parents hahaha", "I wish it was that easy to choose where to live for most people but it’s not. What do you suggest people do who can’t afford anywhere else to live? Kill themselves? I agree with your point but that first sentence is so obnoxious", "Your entitlement reeks.", "Babies can (and should) learn to sleep through the noise. It isn't like you're vacuuming under his crib, either. Adults can learn to sleep through it. too. I get that they can hear you, but it cannot possibly be loud enough or for a long enough time to truly be disturbing.   \nNTA.", "Because it should always be ok to ask politely? When did we decide that asking a favor was wildly inappropriate? And she didn't ask OP to stop vacuuming altogether, just to do it later in the day. That's a completely reasonable request.", "Why would it be unreasonable? OP can do it at any time. Pausing vacuuming to do it later doesn't hurt OP in any tangible way.", "And vacuuming doesn't even usually take that long. What, 20 minutes max, depending on the size of the apartment? It's not like it's an hours long event. In an apartment there is just really no good time to do noisy activities. One neighbor is an early riser, another is an early sleeper, another takes a nap, another is a night owl, another will be watching their favorite show....there is NO WAY to vacuum when literally every single person will be happy.", "She didn't say wait an hour she said she'd call her when she was \"alloud\" the lady is very entitled.", "The thing is that means the next time this is going to happen too. Before you know it she’ll ask op to text and ask if it’s a good time to vacuum before she starts. That’s an unreasonable expectation in your own home. They’re not roommates and quiet time is generally something like 9 pm - 8 am. \n\nPersonally I would have said sure I’ll wait an hour this time, but then next time I would have proceeded to start vacuuming with ear phones on and not responded to her knocking on my door.", "Honestly yeah I feel so blessed to live in an apartment complex where we’re all kind of a little village that helps each other", "it’s really sad.  Apartments suck, what makes them tolerable is kind neighbors who think of the community.\n\nThis is such an idiotic hill to die on.  How DARE someone ask me to vacuum at a different time of day when i clearly have the flexibility to accommodate that request!  /s", "Right? Like people are calling this woman entitled for ASKING her to vacuum at a different time. If I knew I was doing something that was disturbing my neighbor and I could easily do it at a different time, I would because I'd rather be slightly inconvenienced but courteous!", "Exactly. She can be fully prepared for neighbor to start doing stuff to piss her off now.", "Yes but what if the neighbor on the other side has a different schedule? And the one above and the one below has different schedules too? When you live in an apartment you just have to kind of deal with noise from time to time. You put in earplugs or something.", "“Hey sorry - that must suck; I just don’t get much time to do my chores so I’m just gonna finish up quickly and then it’s done, thanks for the cookies”", "The least OP could have done was ask \"how long do you think they need\". If it's something short, and delaying vacuuming isn't disruptive to OP's schedule for the rest of the afternoon, then it's polite to just pause and wait. If the timing works, then a simple \"sorry, this is the only time I can do it and it needs to get done\" is all it takes. But neighbour was condescending, and OP chose to retaliate. So yeah, ESH.", "Someone who asks you nicely for a favour doesn't call you a whore when they don't get a positive response.\n\nNTA.", "If you start acquiescing once, you’ll have to do it for every unreasonable request. OP Does not have to cater to someone else’s family schedule.", "Even just asking how long until she can start vacuuming, and then either agree to wait or tell them the timing doesn't work out for them.", "I scrolled way too far to find this comment. Your baby is one? Yeah, sorry, you don’t get to complain about any sound anyone else around you makes, none of them are as loud or annoying as a screaming baby", "I really don’t know why you get downvoted. Your argument is logical. \n\nDoes everybody suffer from the „I‘m the main character“ syndrome? You don’t know what your neighbors have going on in their lives. Why not be nice if it’s no big deal for you to vacuum at a later time? And if you really can’t meet their request why not decline politely?\n\nThere may be a day where you need a favor, I wonder if they will help you out after today.\n\nAnd if the new neighbors are petty there are a tons of possibilities for them to annoy you in the future.", "Literally started with ‘dont give me crap, but here’s some details that are irrelevant’ and then went off. Sounds like she’s defensive and rude by nature.", "I usually go for around 11:30, but the latest if I’m busy would be like 2pm", "It’s in the post", "It’s really not reasonable though. You can’t ask your neighbor to live their life on your schedule. It wasn’t even like she asked her to wait for a short specific time. She wanted her to just wait around to vacuum until she came back to give her an all clear bc they were no longer sleeping. She’s not entitled to manage OP’s time like that.", "How is it reasonable to ask a neighbor to stop a basic household task taking place in their home in the middle of the day?", "Uh, how on earth did you get “vacuuming every second day = ocd?”\n\nIf you have the windows open, you’re still getting dirt, dust, pollen etc blown in. \n\nIf you have an 8 year old child, you’re also getting crumbs, and probably dirt from being outside, and sand from the school sandpit. \n\nAnd if you have two human beings in an apartment, you’re still getting dead skin cells and shed hair. \n\nEven without a cat / dog (which we don’t know if she has), or allergies (which we don’t know if she has), doing a quick vacuum every second day is not unreasonable.\n\nEdited to add: Ah, I missed your last line - “this I’m really wondering because I’ve dealt with it”. You’re reading your own situation into hers, and wondering if maybe she’s similar to you. Fair enough.", "Have fun being a doormat. Directly answering a question is not escalation.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "NTA. You’re vacuuming at a normal time. Unfortunately hearing every little thing is part of apartment living.", "They make earplugs and/or headphones and white noise generators for exactly this situation.", "Same. I bought one when I lived on a busy road in an old house with single glazed windows. They're amazing.", "I wish I liked white noise machines. At my old call center job they had white noise machines on the dividers and for some reason they always made me irrationally annoyed/angry. (They ended up putting them in the ceiling because we all would turn them down/off even when we got emails not to and it was better since I couldn't really hear them)", "You don’t even need a machine. You can use your phone and download it. I use Apple Music and play “Deep Sleeping Brown Noise” by Mister Rumbles every single night. \n\nI usually just connect my phone to whatever Bluetooth speaker, and we sleep like babies. Im renovating my entire house and slept through the bathroom demo this morning", "You better specify a PM after that 4:30 because if not hooooo boy!", "Leafblowers! The ban of the tired late shift.", "I live rural and my neighbor has a log splitter. He works early on his farm so you know when he splits logs right near our property line and house ....Naptime. Everyday until he was out of logs. In my head I was cussing him out but like it was 1pm on his own property so I just turned the Hatch a bit louder.", "No, killing themselves is almost certainly not the solution that commenter was suggesting. I would assume that if your living situation doesn’t allow for ideal sound insulation and you can’t change it, then you could do more cost-effective things like get earplugs or noise machines. Or, you know, deal with it. The way we all deal with unpleasant things we can’t afford to change.", "What did he do now?", "12-1pm isn't acceptable to vacuum? Small % who work nightshifts have the right to tell others to stop chores during afternoon???", "I didn't see anything about being \"allowed\" to continue. It sounds like the lady offered to give a heads up when the baby and husband were awake again. I mean there might be reasons to say \"no, I would prefer to do it now,\" but the mere fact that the neighbour comes over to try to negotiate the timing of chores isn't enough of a reason to fly off the handle in a rage.", "People in this sub are unable to parse the difference between ‘asking someone’ and ‘making someone’. People can ask you all kinds of different things and then you can decide within reason how you want to respond. The neighbours original request is so benign but everyone here thinks it’s the biggest imposition in the world.", "Right?\n\nI mean, way to make an impression on the new neighbor.  And as OP has seen - this neighbor *escalates*.  So yeah, buckle up OP, and just remember:  *you started this*", "whataboutism is tiresome.\n\nWhat the other neighbors schedules are doesn’t apply.  and are likely “normal”.  THIS woman asked for something very reasonable and OP was rude. Vacuuming at 4pm instead of 11am when people work night shift is a *neighborly* thing to do!", "Or “I can do this other chore for about half an hour but then I really need to finish the vacuuming.” (Assuming there are other chores to do.) Like you can give a little without letting yourself be walked all over.", "She asked us not to give her crap for being a teen mom because of an unrelated issue. That’s not unreasonable. Especially since she’s just had someone berate her and call her a slut for it. It’s not exactly hard to assume that most of the attitude in this post comes from being a bit upset.", "\"The time of day in which I do vacuum is not stupid early or really really late, I chose it because most people are gonna be up so I’m not disturbing a lot of people.\"\n\nThat's why I asked specific times, you never know when people make posts saying \"It's not a bad time\" oh what time? \"6am\". That's why I was double checking.", "Sometimes neighbours do nice things for each other. Again, I can't speak to the neighbour's condescension, but asking someone to delay a household chore for a couple hours really shouldn't be a big deal.", "How is it reasonable to be so stubborn that you're not willing to vacuum a couple hours later to allow your neighbours to get some sleep?", "The rigid I'm not deviating from my schedule part is why I asked. For a one time thing. It's not just about the cleaning, but the having to do things a certain way with no wiggle room.", "Reasonable due to baby and dad sleeping. Notice I didn't say OP should stop vacuuming.  I said she was TA for how she responded.", "its always smart to maintain the best relationship you can with nieghbors,.. if god forbid an emergency arises, they are the ones who can help and make the difference.", "I genuinely have no idea how they went to offing themselves instead of finding a solution...", "Read the last 2 sentences of the paragraph where she talks about her showing up. It says she will call her when they wake up and she \"can\" continue. Idk If you take that differently but it means she will be allowed to do it when she says so. The other woman is extremely entitled.\n\nEdit: also, OP didn't fly off in rage she just told her she wasn't gonna stop because it's not really her problem. She told the lady off after the lady started being rude/disrespectful. Op was fully in the right.", "“I don't vacuum everyday, maybe just like every couple of days, usually late mornings early noonish.”\n\nAgain, it’s in the post.", "So you would pause your schedule to accommodate a neighbor who’s husband may sleep for several hours, especially a neighbor you don’t know?\n\nlmao no you wouldn’t", "Yeah, I can understand your point. It was a small red flag for you. \n\nI can also understand not wanting to give an inch though, because many people will take that inch and then want a mile. The one time request becomes a 4x a week thing, and then an every day thing, and then other demands get added on top, and you end up very much wishing you’d never said that first, “Sure, no problem.”\n\nI didn’t read OP’s “no” as an inability to stop vacuuming, but rather that she wouldn’t stop vacuuming for something unreasonable. And to her, being asked to stop in the middle of the day to accommodate one neighbour for something that’s going to happen regularly (i.e. “the baby is sleeping”) was unreasonable.", "It absolutely is smart, but it's also ridiculous to expect a working single mother (or anyone else) to do her cleaning around your schedule. By saying yes, she opens the door for anything they might hear. Her daughter playing with friends? TV? It's not inconsiderate to have reasonable boundaries.", "that was OPs interpretation of the person's words, but who knows what she actually said.", "Yes, I would. Because unless I'm expecting people over and I want the house to be spotless, the vacuuming can wait. If it became a regular request, then it could get annoying. But as a one time thing? Of course I would.", "I see yours too, the baby is gonna be sleeping, well, a lot. So if it became that reason, unreasonable people would then ask for concessions all the time.", "It’s so weird when people lie for no reason lmao", "It's so weird when people admit to being completely inconsiderate for no reason."]}