{"id": 21495, "submission_id": "14salim", "title": "AITA for telling my son that he should probably be more \"low key\" around his boyfriend's friends?", "selftext": "My youngest \"Randy\" 16M  has been dating  a boy \"Zach\" 15M.  I'm a friend of Zach's mom from college and he and Randy have known each other for a while and we've had them over and I know Zach pretty well.  He's a pretty sweet kid  even has his own flower garden.  Now even though Randy does play some sports he's not super masculine or anything and well Zachs more on the more masculine side and takes sports more seriously. Though they bonded over Zachs more less than masculine interest.\n\nZach just recently came out to his parents and school like  not but maybe a few months ago.  I  know his dad is struggling a bit with it and we live out in the country and  not all of Zach's football teammates are being great  about it.  And I know other than his two bestfriend's no one else knows how he likes flowers or any other things he likes that aren't up to par here.\n\nfrom what I heard from his mom I know he's been getting crap from some of his friends/teammates about how Randy  \" treats him like the girl\" with Randy having a car so usually picking him up/driving him around or paying for stuff cause he has a job. Well last Saturday they were supposed to hangout after Zach got done with summer practice. Randy decided to bring him some flowers he might like. Now Randy has brought him flowers before just not infront of his teammates or people that don't know about his other interests. And apparently Zach got embarrassed about it and they had a huge argument about it and how he felt Randy was embarrassing him.\n\nMe and Randy talked about it when I saw him upset and I wondered why he was home so early. I told him while what Zach said wasn't necessarily fair that maybe he should be a bit more low key and chill some around Zach's less than evolved friends. That Zach's kinda having a hard time right now and doesnt need more stress. He got this somber look on his face which i hated but , he understood.  I  talked it over with my wife and she thinks I was being a d***ick basically telling Zach not to be himself  and I should never try to tell him not to be loud and proud. I told I didn't mean it that way but she's still upset with me. AITA here?", "created_utc": 1688653140, "permalink": "/r/AmItheAsshole/comments/14salim/aita_for_telling_my_son_that_he_should_probably/", "score": 95, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Making Randy feel bad about himself. Telling him to tone down.. Not just telling him to keep being himself.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA, as a gay man you need to be careful sometimes, gay bashing still exists. I wish it wasn't that way.", "NTA - as a gay man who has dated guys both before and during the coming out process, it's a very difficult and sensitive time. This is especially true since they are teenagers. From firsthand experience, I can tell you that sometimes being with a man who is emotionally vulnerable because his identity is in flux is not easy. Given that Zach and Randy just got into an argument, I think your advice had both Randy and Zach's best interest at heart. I wish my dad would have been more willing to give me relationship advice when I was struggling with relationship issue, but my parents had huge issues with my sexuality so there wasn't a chance.\n\nConcerning the issue at hand.... gay and bisexual people have been dealing with the stresses of having one partner in the closet or fresh out of the closet for decades. My recommendation is to suggest that your son talk with Zach in private about where Zach's embarrassment is coming from. It can be very easy to conflate 'I'm embarrassed about being gay/bi' or 'I'm embarrassed that my friends are treating me differentely' with 'I'm embarrassed about being with you'. It's important that Randy know the difference. Empathy is key here.", "NTA\n\nAnd the reason you're not TA is because you're following what Zach said. Zach is happy to be brought flowers in private, but doesn't want to be brought flowers in front of his football teammates. That's Zach's choice.\n\nThe degree to which Zach wants to be \"out and proud\" is up to Zach. Nobody else gets to make that choice for him. \n\nSure - his teammates are obvious neanderthal homophobes (no, if two guys are in a relationship, you don't need one of them to be \"the girl\"), but it's Zach's choice as to how he handles that. Everyone else gets to support Zach, not make decisions for him.", "NTA at all!  The horrible reality is that LGBTQ kids attempt suicide at TWICE the national rate for all adolescents.  This is due to the societal and relationship challenges that they have to deal with.  These kids are rejected by their families, bullied by their peers, and stigmatized by society.  They are threatened with violence and subjected to violence.  They suffer from higher rates of depression,  anxiety,  and substance abuse due to self-medication.  \n\nRandy is incredibly lucky to have such loving, accepting,  and supportive parents, but was a little naive.  You gently explained the facts of life to him, and now it's up to him to be compassionate and understanding.", "Nta. No one knows how to deal with these situations and you did your best and the fact that you're accepting of your son's situation is more than enough Don't listen to these Reddit assholes.", "> she thinks I was being a d***ick basically telling Zach not to be himself\n\nThere are many times in life when we are \"not ourselves\" to one degree or another.  At work, I always wear pants, even though I don't like pants.  That's not being myself.  \n\nWe do things that are not \"ourselves\" either to meet other peoples preferences, or to meet societal preferences, all the time.  \n\nYou weren't telling Randy to not be himself.  You were telling Randy to consider Zach's feelings.  Giving someone flowers, when they don't want flowers, is not a gift for them, it's a gift for the giver to feel better.  \n\nNow, Randy does have to make a decision about whether he wants to be with someone who doesn't like accepting random gifts.  And Zach has to make a decision about whether or not he wants to be with someone who gives random gifts like this.  \n\nNTA", "Nta, OP is a straight male who probably doesn’t have much experience with gay men so he’s trying to do his best with his son bc sadly there are still people in this world who bash on you for being anything other than a straight person", "NTA - too many horror stories surrounding Gay athletes, especially in the minor leagues system (including school). Can't blame Zach for his reaction, since he definitely knows his teammates well, and if he hasn't come out to every single teammate, then there's very likely some team mates who could end up bullying him or worse because of it. \n\nLook up Hazing culture especially for homosexuals, I'm not sure how bad it is in football, but it's upsettingly common in Hockey culture which has a very similar hypermasculine culture. Look up Kyle Beech if you're curious about how bad it is even in the top leagues", "NTA\n\nI don’t think randy thought it would embarrass Zach, but now that he knows he won’t do it again. Or at least until the girl jokes stop. Which is really a crappy thing to say. \n\nYou didn’t tell your son to tamp down his out and proud gayness ( I hope that didn’t come out as rude, not meant to). \nYou just told him he should be a bit more mindful of Zach’s feelings. Zach is still feeling out how much and what public displays he is comfortable. \n\nBut if Randy knows that Zach is getting some slack he should have known this wouldn’t go over well. \n\nBut they’re young and will learn, and may need some guidance. Just like any other teen couple. They do, they make mistakes, they learn and grow from it.", "Queer person here. Dad’s NTA. Queer bashing does still exist as a very real danger. Also, if Randy is uncomfortable with his friends seeing parts of their relationship, Zach not toning it down around them could lead to Randy breaking up with him.", "NTA though I would encourage Zach to talk to Randy and they can have a conversation about boundaries so everyone's happy. They're teenagers, the only way they learn to be good partners is to learn how to be good communicators.", "NTA. You gave your kid good advice. He seemed to grasp that the feelings of others (his boyfriend) should also matter, not just his own Pride.", "NTA. all you did was suggest randy not add fuel to the fire zach is already fighting being a gay kid in a traditionally masculine sport with an overwhelmingly straight majority. being loud and proud is great, but it can also be dangerous. or maybe zach just doesn't want all the attention that comes with being different in high school, which is just as valid.", "NTA, maybe just stress to your son that you love him as he is and he should never feel like he has to tone it down around you. not that you implied otherwise, but being a teenager is hard and it doesn't hurt to remind him of your love.", "NTA. You're being a good dad and giving your son the decent advice..nothing about your post sounds like you had ulterior motives in this, you're helping your son by telling him what you think will make his relationship do better. Also, it would be amazing and honestly a true mark of progress if everyone on the football team and in his life was openly supportive of Zach but that's not really how life goes at this time. I think it's more realistic and better for Randy if you teach him realistic expectations and reading a situation than teaching him it's a good idea to push societal boundaries in unsafe situations...be it physically or emotionally.", "NTA. But a follow up conversation where you acknowledge that nothing about this is fair would go a long way.\n\nIt also might be a good chance to just talk relationships in general. He needs to respect his boyfriend’s comfort level. He can leave if those boundaries don’t work for him, but he can’t force someone past those boundaries.", "NTA I think it's a parent's job to help them see things from other's point of view.", "NTA. Zach and Randy are in different places in their Queerness. If Randy can't have empathy and patience for Zach, they aren't compatible right now. Being gay is not the totality of Zach's personality, and he is still learning how to have a foot in both his old life and his new one. Not every gay person WANTS to be loud. Some want to be private about their love lives, and to be able to keep their worlds safe and separate. It is okay if Randy doesn't want to date someone who is not in their same head space. But pushing Zach isn't okay.", "Your wife needs to chill on you guy u js tryna help out u chillin, dalida thinks you chillin too", "I get where you're coming from. You want your kid safe and happy and avoiding confrontation with homophobes isn't inherently a bad idea. \n\nBut I've seen this exact same argument play out with straight teenage couples. Teenagers are trying to figure themselves out while also figuring out how to be in relationships and there isn't really a right way to do either. Couples struggling to decide what they think is and isn't appropriate in front of their friends is pretty normal.\n\nI think your emphasis on masculine vs feminine interests is as much an indication of some internalized homophobia as your willingness to put the opinions of homophobes before your son's desire to be himself. Masculinity (or lack thereof) is not directly related to sexuality and wasn't super relevant here. \n\nI'm going to say YTA but I think you had good intentions. Parenting is hard and parenting a queer kid can be harder. But there are very very few instances where telling your kid to hide or dim parts of themselves won't make you an AH.\n\nEdit: oops hit post too fast", "YTA but only slightly. You should be encouraging your son to have conversations about this with Zach, not deciding what he should or shouldn't do.\n\nRandy seems comfortable being loud and proud and that's great, it's just a question of Zach's comfort level. Randy should talk to him, listen and understand where Zach's coming from and then they can come to a decision together as a couple. If he persuades Zach to not be fearful of his friends' outdated views, great. If Zach needs more time and doesn't want to do certain things around certain people right now, okay.\n\nThere's something to be hashed out here, but you're trying to decide the best course of action and it's not your place.", "YTA.\nYou’re basically telling him to be small, take up less space and put the comfort of others above his own.\nAt that age, woof. That’s damaging.\nAll teens learn and have trial and error about their behaviors in front of others.\nThis is for those 2 boys to figure out between themselves.", "I've read this one here already, why did you re-post ?", "YTA, your wife is right.", "You're a bit of an AH. Zach is kind of being one too but he's young and probably fearful and not ready to be completely open about his relationships in front of people who could potentially be homophobic so give him some grace. You should have told your son that he doesn't have to lessen himself for any relationship. Your son wasn''t being weird, or pushy or anything like that, he did a normal, sweet thing to do in a relationship. It's okay for Zach not to be ready for that kind of openness yet but your son shouldn't be made to feel embarrassed for being a good boyfriend.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy youngest \"Randy\" 16M  has been dating  a boy \"Zach\" 15M.  I'm a friend of Zach's mom from college and he and Randy have known each other for a while and we've had them over and I know Zach pretty well.  He's a pretty sweet kid  even has his own flower garden.  Now even though Randy does play some sports he's not super masculine or anything and well Zachs more on the more masculine side and takes sports more seriously. Though they bonded over Zachs more less than masculine interest.\n\nZach just recently came out to his parents and school like  not but maybe a few months ago.  I  know his dad is struggling a bit with it and we live out in the country and  not all of Zach's football teammates are being great  about it.  And I know other than his two bestfriend's no one else knows how he likes flowers or any other things he likes that aren't up to par here.\n\nfrom what I heard from his mom I know he's been getting crap from some of his friends/teammates about how Randy  \" treats him like the girl\" with Randy having a car so usually picking him up/driving him around or paying for stuff cause he has a job. Well last Saturday they were supposed to hangout after Zach got done with summer practice. Randy decided to bring him some flowers he might like. Now Randy has brought him flowers before just not infront of his teammates or people that don't know about his other interests. And apparently Zach got embarrassed about it and they had a huge argument about it and how he felt Randy was embarrassing him.\n\nMe and Randy talked about it when I saw him upset and I wondered why he was home so early. I told him while what Zach said wasn't necessarily fair that maybe he should be a bit more low key and chill some around Zach's less than evolved friends. That Zach's kinda having a hard time right now and doesnt need more stress. He got this somber look on his face which i hated but , he understood.  I  talked it over with my wife and she thinks I was being a d***ick basically telling Zach not to be himself  and I should never try to tell him not to be loud and proud. I told I didn't mean it that way but she's still upset with me. AITA here?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA, however, if you haven't already, you should make it clear to your son that he shouldn't have to dim his shine or change for anyone, you love him for exactly how he is - that being said, if he does like this boy, he should respect that he has only just come out and needs some time to come to terms with being out, and to have a conversation with him about it and how he feels. \n\nJust make sure your son knows this is coming from a place of love and support and not \"you need to change yourself\". From what you've wrote it doesn't seem like you did, but I remember being that age and how it can be a very touchy subject.", "NTA. Loud and proud can sometimes get you killed, and it's open season on the LGBTQ+ community lately.", "NAH\n\nI think this is something that Randy and Zach should talk about together to outline specific boundaries.\n\nIt takes time to adjust to coming out, and the judgement from others can be extremely hard on a person", "I think it's interesting that the two openly gay men who have posted here so far agree that this dad is not being an AH. I wish my dad tried to give me relationship advice when I was younger. The dad has the kid's best interests in mind from what I can tell.", "Well, it also sounds like his friends would also give him a hard time if a GIRLfriend were bringing him flowers and driving him around and such? I’m not so sure that the issue here is ultimately even their sexuality? Teenagers are a tough crowd across the board. Something along those lines. I need more coffee.", "OP could tell randy to also wait and give Zach the more personal gifts that not everyone knows he likes, like flowers when they’re alone. No embarrassment made from it and a special moment while alone. The coming out of the closet stage sucks to be dating at. Definitely NTA- as bisexual nonbinary person", "Zach SHOULD be fearful of his 'friends' outdated views, at least while they still live in this town. So should Randy. Queer kids get murdered for a lot less than a bunch of flowers. The wife is naive. NTA op.", "They often repost In hopes they get a different crowd and thus the answer they wanna hear", "I guess you don't understand unless you lived it. If I would have came out as a teen I would have been sent to a reform camp in Costa Rica. This dad is amazing.", "I would love to think that a football team of teen boys is not homophobic at all but I don't think that's the case. I would bet money they would not give him such a hard time if he was dating a girl. That and we don't know how the kid feels, maybe he's not comfortable with his sexuality and then you're boyfriend brings you flowers at practice. \n\nEither way the father is only looking out for his son, he's definitely not an asshole. He's trying to prepare him for the world.", "People do that?? Gosh that is so sad", "But if the girl were bringing him flowers at practice? I think most teenage boys would crucify their male friend for receiving flowers like that, regardless of who they’re from. However, I bow to your wisdom here. Either way, OP is NTA and I think his advice was wise and well-meaning.", "Yep. Often you'll see very eerily similar stories but sometimes details are added or removed to make them look better but often we catch it and everyone still thinks they are TA.", "Yeah being called f-g every day for my entire school career may have jaded me but I'd assume not much has changed.", "Homophobia is misogyny’s shitty little brother. They hate the idea that a romantic partner would treat them like the girl. Because that’s the worst thing they can imagine.", "I'm a gay man too. I'd imagine if it was a girl there would be teasing about Zach being \"whipped\" and being called \"the girl\".  But there's definitely less potential for it to turn to violence. It's 2023 and this shouldn't still be happening.", "It's definitely not helping that some people don't even want gay people discussed in school. We have come a long way but never forget there are still plenty of people who hate the lgbt."]}