{"id": 21520, "submission_id": "14slmb4", "title": "AITA for “firing” my coworker’s son from a prestigious internship?", "selftext": "I (34F) work for a well-known company. Every year, my department offers summer internship spots to 5 high school students. They’re considered prestigious and we get hundreds of applications a year. Each student gets assigned a mentor (I usually mentor 1 student). \n\nWhen the students are selected, they’re put on a 3 week probationary period. If their work is good, their mentor will recommend them for the full internship. If their work is poor, their mentor can recommend to let them go and get a replacement intern. The final decision to keep or fire them is up to the selection committee, but they usually adhere to the recommendation. \n\nThis year, my coworker “Chris” mentioned that his son “George” was applying for an internship spot this year. He also said he was going to pull some strings to ensure he was accepted. I’m not a fan of nepotism, but since I’m not on the selection committee, there’s nothing I can do. \n\nLo and behold, George was given one of the internship spots and I was assigned to be his mentor. I looked over his resume and it was alright, but it was nowhere near the level of students I’ve mentored in the past. But I know resumes aren’t everything, so I was willing to give him a chance. \n\nHowever, during George’s internship, he did not perform up to standard. His reports were full of mistakes (which were never fixed), I would catch him on his phone when he was supposed to be working, and he’d “forget” to do his tasks and turn them in very late. \n\nI tried to give him grace because he’s a kid and I know he’s learning, but even after I talked to him about improving several times and walked him through the tasks, his work and work ethic didn’t get better. \n\nAfter the 3 weeks, I wrote up an honest report of George’s work and said I would not recommend him for the full internship. But when Chris caught wind of this, he came up to me and asked me to reconsider. He said that George was trying hard to get better and kids make mistakes. I replied that I understand that, but George’s unwillingness to learn from his mistakes bothered me. And it’s not just about the mistakes, it’s about his slacking off as well. \n\nChris got mad and said George is aiming to get into an Ivy League school and this was supposed to be the crowning achievement of his application. He said if he didn’t complete this internship, he wouldn’t get in and it would be my fault. He said since I’m not a parent, I couldn’t possibly understand the pressure to get your child into an Ivy League and it’s okay to fudge the truth a bit to get a leg up. I replied that if George was truly motivated, his work would’ve improved, and I’m not going to lie on his behalf since it would fall on me to cover for his mistakes. \n\nI later recommended George to be let go and he was, and Chris has been cold to me ever since. Word around the office is that George is devastated and I “destroyed his self-confidence.” So I’m coming here once and for all to know if I’m TA.", "created_utc": 1688677173, "permalink": "/r/AmItheAsshole/comments/14slmb4/aita_for_firing_my_coworkers_son_from_a/", "score": 201, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the asshole because I did not recommend my coworker’s son for a full internship because of his poor quality work, even though he needs it to get into an Ivy League school.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. Because there’s a hard-working kid out there who now has a chance to get that coveted place and succeed in life, and a kid who can get that internship and make something of it. George had a chance he didn’t deserve and blew it. \n\nHis life isn’t ruined. In an ideal world, he’ll take your advice on board and put in the work and do well. In this world, he’ll probably complain that everybody discriminated against entitled men and he should have been given more chances, more slack. \n\nThis is not your problem. Better he finds out NOW what attitude workplaces expect than in a few years’ time.", "NTA.  Don't coddle nepo babies.  It just encourages their entitled behavior and/or allows them to keep taking spots from more qualified candidates.", "So Chris unethically manipulated the selection process to ensure his son got one of those very few places.\n\nGeorge then didn't put in the effort at all. Despite Chris's claim that he was \"trying hard to get better and kids make mistakes\" - well, yeah, kids do - but I'm going to bet that other kids with that internship either sharpened up their act when talked to about improving, or like George didn't make the cut.\n\nIf George was serious about making the achievement to get into an Ivy League school, he had a funny way of showing it, and if he was expecting to simply coast through as part of getting life handed to him on a silver platter, well... time to wake up.\n\nChris is an AH for depriving other genuinely interested and motivated kids of the chance that his son had, his son's a bit of an AH too for squandering the opportunity.\n\nOP, on the other hand, is a good and genuine person. Much respect for your honesty.\n\nNTA.", "NTA.\n\nYou're a hero in my eyes. Nepotism is wrong. Chris is acting like a dick, and because of you, another kid (who will hopefully work their ass off and be incredibly grateful for the opportunity), may get a full internship.\n\nAnd that's how it should work.\n\nGo you.", "NTA.  \n\nGeorge got an unfair advantage based on dad pulling strings.\n\nIf George isn't able to keep up with the work after that, you're not doing anyone any favors by keeping him on.  If Chris wants to cosplay Felicity Huffman and Lori Loughlin to get George into an Ivy, that's his deal, not yours.  You deserve an intern that is going to do the work for which they were hired, and clearly George hasn't gotten the memo.", "**100% NTA**. Chris is using his unethically using his leverage around the office to get his son a leg up on everyone else. If George was Ivy League caliber, Chris wouldn't need to primer everyone that his son was applying, or to reconsider your honest review of George's work. George not getting in (if he doesn't) isn't your fault, and if people disagree they can pound sand.\n  \nHaving nepotistic hires in the office is a liability for everyone, especially those responsible for them.", "If he can't deal with an internship, how is he going to deal with an elite college? Seems like a family that cares too much about their image. They both should've seen this as a wake up call.", "NTA for a number of reasons.\n\nFor one, that kid should not have ever been given that internship to begin with. Especially seeing as his being there meant he took a spot from someone who *actually* deserved to be there. \n\nFor two, he did not meet the standards or expectations required of all interns in that position, and that fact is not even remotely impacted by who his father is. \n\nFor three, it's *your* reputation that's on the line if you recommend him for a permanent internship, despite the fact that he in no way lived up to the standards to maintain said position.\n\nAnd fourthly, if he doesn't get into an Ivy League school, because he didn't live up to the standards, and expectations of this internship, despite being given repeated opportunities to improve based on feedback. Then that is 100% on him, and the people who raised him to believe that nepotism would make up for his complete lack of work ethic, and personal accountability.", "NTA.  Thank you for not giving into that kind of bullshit.  Chris can blame himself for George's work ethic.  More people need to have the guts and integrity to stand up to that kind of nepotism and cronyism.", "NTA. You gave the kid chances to become better but he still did badly. Chris needs to accept that fact.", "NTA, let's face it, the kid didn't even try, his father did. But coz of nepotism, some other kid, whose parents don't have connections wouldn't get in, even if he was busting his ass. You did the right thing and George needs to learn the hard way, so needs his father. Instead of finding ways to motivate his kid, he pulls strings lol.", "NTA. It's better that a kid like this fail in a low-stakes setting than in a high-stakes one.", "NTA- Oprah was fired from one if the first TV jobs she worked on at 24. She became a billionaire labeled Queen of all media. \n\nGeorge can either take the constructive criticism and buck up, or he can suffer through his second choice college.  \n\nTake Chris out to lunch. Tell him you really hope George find something that gets his full attention, but it just wasn’t this place. Let him vent a little about being an insufferable parent.", "NTA.\n\nBut.....honestly, we shouldn't be looking at George as a slack off kid who blew this opportunity. \n\nHis father is pressuring him into getting into a \"prestigious\" education, and he's too busy manipulating people to actually realize his son may want to go down a different path and accomplish goals he actually wants to accomplish. \n\nYou may have done a great thing for both men. George may actually get a chance to evaluate his goals and forge his own path.\n\nAnd you gave Chris what is likely a decades long overdue ego check.", "NTA. Sounds like kiddo has been handed everything in life. If this is enough to destroy his confidence, then it’s a good thing he’s getting this experience early on in life and can choose to act differently next time. Your colleague put you in an unfair situation.", "NTA. They should be thankful he’s getting a dose of reality now and not much later when it will effect his life much more intensely.", "NTA. If the guy doesn’t stop with the cold shoulder bullshit and keeps talking about report HIM to HR. He’s not a good co-worker, and probably not worth the trouble.", "NTA. If George is old enough to be applying for internships and trying to get into a Ivy, he is old enough to be responsible for his own work.", "Nope! NTA at all. Chris however...", "NTA. Bye George, I think he's not it!", "NTA, it’s a good lesson George learned.  FAFO. The lack of an Ivy League education won’t hinder a successful businessman. It might hinder someone used to coasting on privilege.", "NTA. This is one of the possible results of a nepo hire - someone who clearly isn't up to the same standards as other applicants.", "NTA - this has the possibility of being good for George longterm if he handles it correctly. It's important to faceplant and not get saved by your parents. He'll learn more from this than he would have from the internship.", "NTA - It’s most often hardest to do the right thing.", "NTA. I’m reminded of a silly (but awesome) British tv show called red dwarf which had loser character meet his alternative reality counterpart who was a superstar. Turned out the defining moment in dividing them was a school age humiliation, the loser “won” by not being punished and never applied himself, whereas the version that was punished (for not working hard) applied himself afterwards and met success. \n\nThis kid is still young enough that the shock of actions having consequences can be a very valuable lesson but not really in a point in life where his actions will “ruin” his life. Best to learn now that you have to make an effort. Hopefully he learns that lesson, in spite of his father", "NTA\n\nYou reported the kid's performance, That was your job.\nBetter someone capable, hard working and deserving gets the internship than someone whose parents want them to get into an ivy league college while they're relying on \"influence\".", "NTA. It looks like George isn’t going to get into an Ivy League school on his own merits. You gave the kid every chance to improve during his probation period and he let them all slip away. \n\nIt sounds like it is more important to George’s father that he get into an Ivy League school than it is for George. And you did George a favor - he would have been eaten alive in that school with a work ethic like his. \n\nAlso, if you let him stay and continue to make mistakes and miss deadlines it could reflect badly on you. You should not risk your job for an intern that doesn’t want to work.", "NTA. The kid was in over his head. If he didn't work out for the intern position then he wouldn't be a good fit for an Ivy league school.\nChris is TA.", "NTA - good for you. George needed to learn his hard lesson that dad cannot 'fix' everything for him. Maybe next time he will try to improve instead of relying on his father pulling strings.", "100 % NOT TA!  \nYou probably did the kid a favor!   \nI'm inclined to call him a spoiled, entitled brat,  but if he has had everything handed to him over his life then he probably doesn't even know what work ethic is. If anything you might have taught him a life lesson......", "NTA and his acceptance or non acceptance into an IVY school is not due to this one internship. Acceptance is the culmination of all things including grades, legacy (unfortunately), volunteer work, extra curriculars, and more. This internship would no more be the reason than his 9th grade biology teacher giving him a 92 rather than a 97. And if a George is so upset he had the opportunity to work on his known deficiencies in the internship and chose not too. This may be the only time someone has been honest with him about his work and he will need that in life once he flies the nest", ">Word around the office is that George is devastated and I “destroyed his self-confidence.”\n\nSounds like you destroyed something that was only there due to lies in the first place. NTA.", "NTA - Nepotism is, at best, a foot in the door. After that, the child needs to perform at the same level, or higher, than any other candidate for the job. Neither George nor Chris understands this. George is a direct reflection on Chris, and it's not a good one. You didn't \"destroy his self-confidence\", you adjusted it to reality. IF you had continued as Chris wanted and smoothed the way, AND George had actually made it into that Ivy League school, he would have been confronted with people who didn't have parents smoothing the way for them, and \"doing their homework\" so to speak. He would have, for probably the first time in his life, have to pull his own weight. He would get eaten alive, and probably leave school after the first year (if not sooner).", "ESH.\n\nI guess I think that internships for high schoolers are mostly bullshit anyways, and you and Chris are both taking it way too seriously.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (34F) work for a well-known company. Every year, my department offers summer internship spots to 5 high school students. They’re considered prestigious and we get hundreds of applications a year. Each student gets assigned a mentor (I usually mentor 1 student). \n\nWhen the students are selected, they’re put on a 3 week probationary period. If their work is good, their mentor will recommend them for the full internship. If their work is poor, their mentor can recommend to let them go and get a replacement intern. The final decision to keep or fire them is up to the selection committee, but they usually adhere to the recommendation. \n\nThis year, my coworker “Chris” mentioned that his son “George” was applying for an internship spot this year. He also said he was going to pull some strings to ensure he was accepted. I’m not a fan of nepotism, but since I’m not on the selection committee, there’s nothing I can do. \n\nLo and behold, George was given one of the internship spots and I was assigned to be his mentor. I looked over his resume and it was alright, but it was nowhere near the level of students I’ve mentored in the past. But I know resumes aren’t everything, so I was willing to give him a chance. \n\nHowever, during George’s internship, he did not perform up to standard. His reports were full of mistakes (which were never fixed), I would catch him on his phone when he was supposed to be working, and he’d “forget” to do his tasks and turn them in very late. \n\nI tried to give him grace because he’s a kid and I know he’s learning, but even after I talked to him about improving several times and walked him through the tasks, his work and work ethic didn’t get better. \n\nAfter the 3 weeks, I wrote up an honest report of George’s work and said I would not recommend him for the full internship. But when Chris caught wind of this, he came up to me and asked me to reconsider. He said that George was trying hard to get better and kids make mistakes. I replied that I understand that, but George’s unwillingness to learn from his mistakes bothered me. And it’s not just about the mistakes, it’s about his slacking off as well. \n\nChris got mad and said George is aiming to get into an Ivy League school and this was supposed to be the crowning achievement of his application. He said if he didn’t complete this internship, he wouldn’t get in and it would be my fault. He said since I’m not a parent, I couldn’t possibly understand the pressure to get your child into an Ivy League and it’s okay to fudge the truth a bit to get a leg up. I replied that if George was truly motivated, his work would’ve improved, and I’m not going to lie on his behalf since it would fall on me to cover for his mistakes. \n\nI later recommended George to be let go and he was, and Chris has been cold to me ever since. Word around the office is that George is devastated and I “destroyed his self-confidence.” So I’m coming here once and for all to know if I’m TA.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA - You gave him more chances than he would have gotten with a non-nepotism internship. You can’t control the fact that he was never motivated to put any effort in. I’m happy the important internship went to someone deserving instead!", "Ok, let's say it's ok to fudge 'a bit' - not saying it is, but let's play with that.   \n\n\nFudging a bit is 'X had perfect attendance' when X actually missed two days. It's 'X led a project', when X actually CO-led the project. It's NOT 'X did work' when X actually faffed around.   \n\n\nOh, and let me say, as someone who has not only assisted with an insane number of applications as a volunteer tutor and editor, and as a teacher, but who has actually done admissions work - when a kid has a 'prestigious' internship at a company where parent works, that sets off alarm bells. And yes, we know where kid's parent works, it's on the finance forms. That internship wasn't getting George into the Iveys alone - and losing it isn't going to kibosh his application on it's own either - dad's an idiot.", "NTA - his dad ruined him when he did not make the kid WORK for what he wanted. Helicopter parents are part of the reason ppl in their 20's have no clue how to survive on their own. \n\nYou were honest with the kid about how to do better, but if he will not try, then there is nothing more you can do.", "NTA. George doesn't have the drive. His father has big dreams for him, but nepotism hurts everyone except the nepo family", "Nta,  your coworker's son shouldn't be getting special treatment just because his dad works there.", "Nta. Kid has a chance and he blew it.  Not your job to baby a coworker's child or help him lie to get into college.  You did the job you were hired to do.  Ignore them both.  They are not worth your time.", "NTA, fuck that kid. They'll find a way to hand his life to him on a silver platter without your participation", "Oh boo fucking hoo.  Privileged slacker isn't allowed to cheat to get into the ivy league.  Guess Chris is gonna have to endow a building or something.  NTA.", "NTA. It sounds to me like George needed a bit of a kick in the butt, and you have provided it. If he's not doing the work, then maybe he shouldn't be getting into an Ivy League. And with the way Chris seems to be making this about him -talking about the \"pressure\" to get his kid into an Ivy League and all that- then maybe this *should* reflect back on him too.", "An internship is not going to be the reason someone gets into an ivy. Especially if their work ethics suck. NTA.", "nta...", "NTA.\n\nAnd you just taught George a fantastic life lesson, really - actually several of them.\n\nYou have to earn things. Some things aren't meant to be. You can't rely on your parents for everything. It's okay to be devastated about losing something. It's okay to be embarrassed when you didn't do your best work. You have to put in the work. \n\nLife will go on, it will all be okay, and in the big picture, this is just one small blip. \n\nGood on you. :)", "NTA. It’s always better for young people to learn lessons when in a lower stakes situation than when it will truly affect their career. If you wanted to be nice, you could offer to have a candid conversation with George and/or about some changes he needs to make, or the reality of the fact that if he can’t even cut it when using connections, he doesn’t have a snowballs chance of achieving the kind of success he expects.", "NTA.\n\nit's just like the real world! you offer feedback, they don't get better in a certain amount of time, they get fired! he's not gonna last at Harvard w an attitude like that.", "Nope nope nope this isn’t on you. This is on his awful father who expects everyone else to make up for the terrible job he did raising his kid.", "NTA. The best thing to do is document and have him sign recommendations on how to improve his job performance. This avoids the whole \"He said, she said\" run around and the kid will have no one but himself to blame. Tell Chris he is a major reason why many kids today don't have slightest ability to do anything on their own. Chris, YATA.", "NTA - you did your job.  Chris wanted you to not do your job and just let his kid skirt through the process.  Your company didn't become prestigious because of all the rules you bent.  I'm willing to bet it was the exact opposite.  He doesn't get to put his hang ups and short comings on you for his lack of parenting.  Lastly, if Chris was so interested in his son's success, how come he never came to you for an update?  You could have told him everything you told to George and maybe Chris could have pushed his own son.  Not you, Not your job.", "NTA\n\nThis is a very refreshing change-of-pace. Having enough connections can get your foot in the door, but it’s then up to you to put in the work to prove you belong. George fucked around and found out. I can understand Chris wanting the best for his kid, but to abuse his power of having connections to get George a spot is messed up. Like you said, he had an OK resume, but not on the same level as those you’ve mentored in the past and got in legitimately. You know the saying “hard work beats talent when talent doesn’t work hard?” Just replace talent with nepotism and that’s pretty much the jist of what happened.\n\nPart of me has some sympathy for George since I’m sure being let go would be a blow to anyone, but he did it to himself. He tried to coast and you rightly shut him down. Hopefully this serves as a wake-up call for him and he realizes his actions have consequences. \n\nYou did what I’m positive not everyone would do, especially with Chris breathing down your neck and pressuring you, I respect that! You’re NTA, despite what Chris and George may say and think", "NTA\n\nYour coworker is angry for you not allowing his son and him to exercise their privilege.\n\nAnd from his reaction it seems he doesn't contest the fairness of your report. Doesn't that say it all?", "NTA. Look, we’re all against nepotism “in principle” but if it was a kid close to us-even a friend’s kid-99% of us would try to get that kid in. \n\nThe problem here is that Chris needed to have a  talk with George and tell him what was on the line to make sure that his son took it seriously. If it hadn’t been you it might have been someone else that got fed up with him. Chris and George had no control over what the mentor would write no matter who it was. George had a good thing going and he blew it.", "So your co worker was putting pressure on you to lie - that’s a major HR no no.  You assessed objectively and made recommendations based on the potential interns ability.  If the kid couldn’t follow rules and had poor work ability then he is definitely not cut out for Ivy League education.  You are NTA.", "NTA -George crashed and  burned even with your helpful direction. Don't worry about him, his Dad will always be there to pull strings or get him other opportunities to waste.", "NTA. \n\nA friend of mine who worked on intern recruiting always said that when coworker parents corner you to tell you how great their kid is, the kid inevitably turns out to be spectacularly shitty. \n\nThe actually-awesome kids’ parents know that their kid can get through the process on their own, AND that if the parent’s company can’t accommodate them, their kid has plenty of other other internship options out there.", "It's for situations like this that nepotism is seen as (and is) a bad thing.  The person benefiting from you feels like they can slack off.  You were honest about the issues, tried to correct the problem, and then were impartial about the lack of improvement.\n\nNTA.", "NTA sounds like george should actually put in a little effort. also i would report everything to your HR department asap so you have a paper trail if chris attempts to retaliate.", "NTA\nGeorge's connections gave him opportunities. He hasn't made the best use of them. Privilege only goes so far. Asking folks to lie to keep dead weight on board is asking a lot.", "Nta.\n\nTHANK YOU for using his ability to do his job as a means of judgment instead of \"he's the boss's son\" or whatever nepotistic bullshit.\n\nI despise these entitled fucks getting handed their futures on a silver platter and being too stupid and lazy to realize how good they have it. I used to be one of them, so I know very well what it's like. I got my comeuppance and had to claw my way out of a very deep hole. I hope that George's claws are sharp!", "NTA. George obviously figured daddy would make sure everything was ok and that meant he didn’t really have to do much. That may even be what daddy dearest told him.", "NTA - I’d ask chris if he “fudges” any tasks at work, since he’s so blasé about his kid.", "NTA. I had the misfortune of having the boss's daughter as an intern at a prior job, and my God, do I hate nepo babies. That kid either didn't want to be there but Daddy was making him, or he expected Daddy would make sure he got away with anything. No matter how you slice it, he shouldn't have been there. \n\nKudos for sticking to your principles. I hope Chris does not have a position of authority over your career. His type are the kind aren't exactly ethical and 100% hold a grudge.", "Nta. Once again a story of someone needing to accept the consequences of their action. Not only that we hear of a parent who believes his son is entitled without putting in the work.", "NTA - the kid didn’t do the work.  Period.", "NTA. Sucks that you had to even deal with it.\n\nMy new teenage intern started last week.  She’s kind of great.  I think I lucked out.", "NTA, but I hate that this is a thing. \n\nNobody can just let kids be kids and enjoy youth anymore.", "NTA he thought he had it made because daddy pulled strings. He made daddy look bad!!!!", "NTA. I guess now the US Supreme Court has made it so they won't be able to blame affirmative action when George doesn't get into an Ivy, they needed a new excuse, and you're it.", "NTA. Thank you for doing this.", "NTA\n\nThis is why they should just make a rule they cannot hire family of employees. It's silly. The kid couldn't even stay off his phone.", "That’s my opinion as well. I have a replacement intern now and she’s an absolute delight and such a good worker. She’s also aiming for a top college, but she deserves to be there much more than George if her work ethic is anything to go by.", "If (big if unless nepotism/legacy is involved) George gets into an Ivy, he's going to wash out of he can't handle the workload of a high school internship.", "Guessing George figured the internship would be a sure thing since Daddy was pulling the strings. He fucked around and found out. Also, if this is how he behaved when he was trying to impress you, imagine how bad he'd have slacked off once he was past probation. NTA.", "on a side note, god if Rory Gilmore wasn't absolutely fucking insufferable past season 4", "If George were to slide into an Ivy League school , his lack of motivation or willingness to apply himself would have him fail in school inevitably. Not a good outcome either. His parents can’t protect him anymore at that point.", "His father will most likely get him into Ivy like he got him into this internship, by pulling strings.\n\nHe isn’t disciplined or have enough drive to get through an internship. What makes him or his father think he can get through and ivy? On top of that Op already said his resume was meh….   If you want to get into an ivy your resume can’t be meh, especially if you’re a jr in HS \n\nBut thats life , mediocre people with connections get positions they do not deserve, and swear they earned it and work hard \n\nNTA", "This.\n\nRule #1 when you get handed a gift wrapped job is to buckle down and take it seriously. By doing so you prove to the boss that you deserve it. Granted, George clearly didn’t but if he was smart he could have made it look like he did.", "Agreed. Also, I mentioned this in another comment, Chris should have been more concerned about how George came across to people than letting them know George was his son. If he’d done that then he wouldn’t even need to advertise it as the boy’s work would speak for itself.", "More than likely, he thought that he could coast by on “daddy”’s good name.", "I remember that episode!\n\n“Smoke me a kipper, I’ll be back for breakfast.”", "He's taking his job too seriously?", "She also seems vindictive and jealous. For all we know, she was hyper critical of the kid. Everyone has seen a manager and/or mentor who just looks for a reason for fail someone because they don't like the person. Especially failing after three weeks with a HS kid is kind of ridiculous. \n\nThe other thing is, considering she already objected to the kid being selected from the start, an honorable person would have refused to be the mentor because they know they couldn't be fair.\n\nIMO, this is the kind of situation where you need a third party who was there and not involved to get an accurate judgement.", "I think the replacement is all the proof you need.\n\nThat Chris would insist you behave unethically speaks about him a lot more than you.  One of the rare time a ethics hotline might have been interesting to use.", "As a parent of a kid about this age. NTA. Better they learn now. Thank gawd nepo only got him a test phase.", "If George's resume was so lackluster for an internship he sure as hell wasn't getting into an Ivy anyway", "Sounds like the best outcome for all!", "One of our summer interns at my job is the daughter of one of our other engineers. She had a great resume but definitely got a little bit of a bump because we work with her dad. She’s been an absolute delight! She’s motivated and hardworking. I’d say she’s definitely in the top of the intern class. However, I’m not surprised that she’s pleasant and a great worker because her dad is also wonderful. \n\nThe fact his dad is kicking up a tantrum even though George had bad performance and a bad attitude shows that the shit apple doesn’t fall far from the shit tree.", "Yes.", "Chris is projecting hard because he knows his little nepo boy wouldn't have gotten the spot otherwise."]}