{"id": 21577, "submission_id": "14t82ol", "title": "AITA for defending my degree", "selftext": "I’m in my penultimate year of uni and have just finished my final essays. I do an English degree and creative writing degree which I know a lot of people consider to be a pretty easy and stupid degree. \n\nOver the past two weeks I had 8 essays due which totalled up to over 27,000 words. It’s been a pretty stressful time all things considered. \n\nA couple of days ago I was talking with some friends and was saying how relieved I was to be finished as I’ve been incredibly stressed. One of my friends laughed and asked how stressed I could’ve really been. I asked him what he meant and he replied with something along the lines of “it’s not really a difficult degree, you’ve had it so much easier than everyone else here.”\n\nHe does medicine which I completely understand is much harder and more time consuming than my degree yet I don’t believe that that makes my degree easy. I still have to put in time and effort into writing my essays and English can still be difficult and complex. I tried to defend myself and he kept calling me dramatic and essentially stupid for finding my degree hard. I told him he was being a bit of an ah and it’s not necessary to diminish other people’s work. This caused a further argument between us. \n\nI haven’t seen him since but I’ve heard he’s been telling people that I was overdramatic and silly for getting offended at what he said. I think I was in my right but other people told me I should’ve just left it and not caused an agreement.", "created_utc": 1688738289, "permalink": "/r/AmItheAsshole/comments/14t82ol/aita_for_defending_my_degree/", "score": 378, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I got in an argument with a friend over our degrees. He called me overdramatic and stupid for getting upset about it.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA - people who feel the need to demean the achievements of others to make themselves feel better are just in a class of their own. You earned your degree and you have every right to be proud and to tell the person to go shove it.", "NTA. \n\nHe sounds like those mothers that say others can't really be tired because they don't have kids.", "NTA - The future Doctor needs to check himself. Just because he is doing a medical degree doesn't make him an expert at everything and perhaps he should try staying in his lane???", "NTA. \n\nI was an engineering student in college. And so many of fellow engineers were insufferable about how much harder school was for them, how much more work they had, how everyone has it easier, blah blah blah. The reality is every degree has it's unique challenges. Your friend was simply being a dick and he was wrong to belittle your effort.", "NTA, you worked hard for your degree and no one has a right to diminish your accomplishments. Congratulations on your upcoming degree.\n\nHe sounds completely insufferable with narcissistic traits. Ugh, he will be a full fledge AH and narcissist when he has his license.  Lord help all the patients that come in contact with him", "NTA \n\nHe needed to be called out for his better than thou comments and get off his high horse. I hope he's not going to be one of those medical professionals who think they're God just because they went through medical school. (I'm a nurse, btw, and I've seen my share of those entitled AHs!)", "You’re NTA, but this “friend” of yours absolutely is. And he’s also the one being dramatic as he can’t seem to let it go, gossiping to all your other friends. \n\nYou should feel proud of your accomplishments! Hand this wannabe doc an ice pack for his butt hurt.", "NTA You weren't comparing their load vs. your load, you were expressing relief you were done with end of year responsibilities towards this degree. Your friend was the one who made a comparison, diminished your degree and hard work, and then made a mountain out of a molehill. He sounds like an oaf.", "NTA - people always dunk on liberal arts degrees because they don’t immediately lead to career opportunities like other degrees do, but the workforce needs people with skills in liberal arts just as much as they need engineers and businessmen. No one should be made to feel ashamed for engaging in programs that make them happy.", "NTA. The old academic snobbery in full force. Pro tip - when people tell you you are 'overdramatic' and 'silly' and 'leave it,' they are defending a bully. Friend is an AH.", "NTA - just because a medical degree is objectively more difficult to obtain it does not invalidate your accomplishment.", "NTA. As a psych major, I’ve felt the same way. People tend to mark it as an”easy” major. But all degrees take hard work and time. I’m tired of people who discount work just because it’s not STEM.", "NTA\n\nI find it fascinating that people make these assumptions, honestly. As someone who has worked in the publishing industry and in education, and who has struggled with cognitive disability (but to be clear, I have a tested IQ significantly higher than average, so it's not an *intellectual* disability), I have found that the worse my illness gets, when I need to do writing, it's FICTION and creative writing that I find most challenging. Even at the height of my cognitive difficulties, I could write a lengthy research paper relatively easily (and was getting straight A's at a couple of the top universities in Canada) in any number of topics . . . but trying to write creatively was unbelievably difficult.\n\nPeople have this strange idea that creative fields are \"easy\" when all they are is DIFFERENT. The reality is that when \"good\" is not easily measurable and is subjective, it can be a huge challenge. That your friends don't value creative fields doesn't make them objectively lesser. It just makes your friends very limited in their scope of understanding.", "NTA\n\nYour friend is indeed an AH. Pain and hardship are individually felt, i.e., the \"scale\" to measure them is basically unique to each individual.  \n\n\nIt's not because your friend find his degree really hard that it means yours can't be difficult for you.", "NTA\n\nYour friend is TA--sounds like another would-be physician with a god complex.  All degrees have their own challenges that depend on the talents and skills of the student.", "NTA. Your friend's haughty attitude is exactly what makes for the kind of doctor who doesn't actually listen to their patients. Also, knowing how to write is such a valuable skill these days, as just about any email you've ever received will show you.", "NTA\n\nEach degree has their own hardships, him saying your degree was easy was diminishing your accomplishments. You're allowed to stand up for yourself.\n\nHe was probably trying to bait you by saying things like that. He wanted to see if he could get a reaction from being rude to you. I would suggest maybe looking into your relationship with this person a bit more, would a friend really say something like that to you?", "NTA. This friend was looking for validation of his own degree choice. It isn’t a competition and just because your degree is different it doesn’t mean it isn’t without stress.", "NTA.  Your \" friend \" is dismissing all the work you put into your degree.  English may be \"easier\" than being a doctor but it is by no means easy.  More power to you for dealing with all the grammar rules etc", "NTA, the fact you are doing an almost entirely useless degree isn't any business of medicine man.  You stand-up for yourself.\n\nPerhaps you should write him a poem", "You study English and write sentences like the second one in this post? You “do English” and your friend “does medicine”, seriously? Well you still have one year left to do English before you graduate, there is that at least. YTA", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI’m in my penultimate year of uni and have just finished my final essays. I do an English degree and creative writing degree which I know a lot of people consider to be a pretty easy and stupid degree. \n\nOver the past two weeks I had 8 essays due which totalled up to over 27,000 words. It’s been a pretty stressful time all things considered. \n\nA couple of days ago I was talking with some friends and was saying how relieved I was to be finished as I’ve been incredibly stressed. One of my friends laughed and asked how stressed I could’ve really been. I asked him what he meant and he replied with something along the lines of “it’s not really a difficult degree, you’ve had it so much easier than everyone else here.”\n\nHe does medicine which I completely understand is much harder and more time consuming than my degree yet I don’t believe that that makes my degree easy. I still have to put in time and effort into writing my essays and English can still be difficult and complex. I tried to defend myself and he kept calling me dramatic and essentially stupid for finding my degree hard. I told him he was being a bit of an ah and it’s not necessary to diminish other people’s work. This caused a further argument between us. \n\nI haven’t seen him since but I’ve heard he’s been telling people that I was overdramatic and silly for getting offended at what he said. I think I was in my right but other people told me I should’ve just left it and not caused an agreement.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Everybody is walking their own path. Yours doesn't have to be better, worse, or the same as anyone else's for you to be happy to get to the end of it. Him minimizing your experience is just dumb.\n\nNTA", "NTA. Dude's compensating for something. Tell him to write a story people will actually read before he talks out of his ass again.", "NTA\n\nYour friend shouldn't act all superior and dismissing your effort. English can be very hard and time consuming and shouldn't be belittled", "NTA. I got a STEM degree and my girlfriend did history. I saw the insane amount of reading she had to do and papers she had to write and I can honestly say I would rather run off into the woods than than go through what she did. Those types of degrees are NOT easy, they just hone a very different skillset that STEM types don't think about or interact with much. \n\n\nYou're exactly right that any employer worth their salt would value someone who did well in a degree like that, especially if it was for a writing-heavy position. And if it helps you become a professional creative writer down the road, all the better.", "NTA\n\nI have the same degree as you. My final semester before graduation was definitely stressful and there were many nights I stayed up late to finish papers. Some of my classmates barely graduated. Different fields of study present different levels of difficulty to different people. Your friend was rude and condescending.", "I have met a lot of med students and this attitude is common. The funny part is they are so focused on medicine they often know basically nothing about the real world. You're NTA, that's not a good person to consider a friend.", "NTA. Your friend has a chip on his shoulder. How could he possibly know the amount of work, time and commitment you have put into your degree if he’s studying something completely different? \n\nNext time you see him just keep to to a hello and keep it moving.", "You are NTA at all. That is a *lot* of writing no matter what degree it's for. \n\nI am working on my 4th degree in psychology and have had periods of time where I had multiple intensive writing assignments.  It can be incredibly stressful, and I am always so relieved when it's done. \n\nIt sounds like the other person is feeling the need to put you down to make himself sound better because *medical degree*.", "NTA and I REALLY hope he doesn't become a provider with his shit attitude.", "FYI: I spent 4 yrs working at a childrens hospital. The Drs lounge fridge was the most feral, bacteria ridden filthy excuse of a “healthy” food storage device. The Drs were as dumb as all hell when it came to the most basic of human behaviours- like chuck out your mouldy 4 week old sandwich- and many common sense things they just had no frigging clue how to use things, fix things, open things ! I wouldn’t be too phased about Mr Medical genius. Doesn’t mean he is brilliant at everything,  just wait till he has to write a report on how it is things went pear shaped with a patient- and his superiors have to read and pass report to legal! He might recall your skills with envy in future.", "As a student also interested in medicine, I had a harder time in my English classes than in my Organic Chemistry class. Sure medicine is hard, but doing well in English also takes talent that shouldn't be underestimated.", "NTA. If you're still friends with him ten years from now, refer to him as a \"physician\" and only use Dr as a honorific for PhDs.", "NTA\n\nI honestly don’t really think there is an “easy” degree.\nMy brother was an engineering student. I could never solve all his equations or build is schematics. I am a history student. My brother could never hack the research and writing necessary for my degree. They both are difficult, just in different ways.", "NTA. He is though. Is he normally arrogant enough to assume everything exists exactly how he thinks it should?", "NTA. He sounds like a jerk.  I did a science degree and it was hard - but it would've been harder for me to have to write so much. I would take problem sets over so many papers any day.", "NTA\n\nReminds me of this bit. \n\n\"Writing? Pah! I learnt that in school! Fucking aced it! They made me start doing it all in joined-up letters just to give everyone else a chance! And that, Mr. Writer, is why I felt my background in production made me qualified to rewrite all the story copy you did for us to be more like a recent popular film.\" ", "NTA. Doctor-to-be got a taste of his own medicine and didn’t like it. Needs to learn some empathy for treating all his patients-to-be.", "NTA.  Your so called \"friend\" was putting you down in order to bolster his own ego.  Yes, we all know a medical degree is extremely difficult, but every degree has it's own complexity.  \n\nI would challenge him to write 8 knowledgeable, interesting, informative, and grammatically correct essays in the same time frame. I will bet he could not do it.", "his friend was looking for validation of his own degree choice.", "Why is it that the folks who are least likely to be able to write an intelligible sentence are the most likely to malign the folks who can?\n\nI have a degree in computer science (and a reasonably-successful 30-plus year career), but I've never felt the need to make fun of someone else's field of study, as long as they're serious about it.\n\n(Although, I do wonder about why MDs are sometimes so pleased with themselves.  I hang out with a lot of PhDs, who've actually done original research to get that 'Dr.' in front of their name, rather than just an extended apprenticeship.  Arguably, the PhDs do an apprenticeship, too, but hopefully it's not quite as miserable as residencies.)", "All degrees have their own challenges that depend on the talents and skills of the student.", "NTA. The old academic snobbery in full force.", " I wish you well in your studies and career! You sound like a very caring person.", "agree", ">I hope he's not going to be one of those medical professionals who think they're God just because they went through medical school\n\nunfortunately - he probably will turn out exactly like that. medicine is in no way an easy degree, but there is absolutely NO reason to diminish and drag other ppl's efforts w their degrees down. NTA, op.\n\n\\- a tired med student", "I agree nobody should be mocked for their degree, but engineers and doctors are objectively much more important than liberal arts graduates", "An English degree is a degree in critical thinking, which means in theory a good English student can learn and understand anything faster and better than others. Maybe if you took more writing classes you'd know that. Also, it helps when coming up with snark, which is a vital skill in the age of the internet.", "the thing is, i don’t understand why people think it’s a useless degree. do people not realise that the books or the movies they enjoy quite possibly came from people doing this degree", "I don’t understand why you’re so mad about this. Obviously when I’m spending like three minutes writing a post I’m not going to use the same academic standard that I would in an essay", "Just so you know, there should probably be a comma after well and another one before at least", "People can study English and still type like regular idiots on the internet. It's reddit. There are no professional expectations here. Who tf cares? No one likes a grammar Nazi on the shitposting website jfc.", "Wow I found the true asshole", "Oh! I wish you well in your studies and career! You sound like a very caring person. I agree with everything you said. :-)", "Who do you think is teaching general education to generations of future “engineers and doctors”? “Objectively much more important” indeed.", "Say that after a week of no tv, movies, novels, or music. Go on, I dare you.", "I have an English degree buddy ;)", "Because the degree is not required to produce these things.\n\nIt is useless because it is very unlikely to lead to a job or increase your earning potential.", "Amused and Irony are better words, not mad.", "I'm a professional copy editor. Can confirm.", "I’m not the one with the English degree. But if you need a property surveyed, or need to determine property rights, or how to build a transmission line, or file nuclear power plant plans with FERC, or how to grade a street and plan distribution electric conduit for a planned subdivision. I’m your huckleberry.", "The OP doesn’t study English, they “do English”. If you are going to post a rant about how your degree you are trying to get is crapped on, it makes sense that your rant should probably be written properly if that degree is in English.", "Honestly, they want an academic level post in AITA lollll", "I think it is unfair to say that it is unlikely to lead to a job. Many jobs require or at least prefer the candidate applying to have a degree. Sometimes they specify what type of degree, sometimes they don’t. I’m just happy that I got to study something that I enjoy in a country where tuition is free.", "It's actually likely to increase earning potential just by being a degree but also the critical thinking and communication skills are valuable transferable skills", "Yet many people major in English as a stepping stone towards law school.", "also irony shouldn’t be capitalised midway through the sentence. also irony is a noun rather than an adjective so it doesn’t quite work when describing  your emotions", "idk how else to tell you that people write differently depending on the context. reddit post? you're gonna be writing a lot more casually/sloppily than you would in a professional document. and that's ok!!!! you're an AH for fixating on this even though we have no idea what OP's actual, formal/academic/professional writing is like.", "I wasn’t describing my emotions, I was describing what you wrote.", "You can stop trying to tell me anything. It’s fine, really.", "Well…”amused” is a feeling and “irony” is not. So you are wrong and/or confused in that front too.", "What’s easy is my judgment: NTA \n\nEnglish isn’t “easy,” or so many people wouldn’t fail it every semester. People think it’s easy because it’s familiar. We’ve all written papers. We all speak English. The question is do you do it well? Do you speak well? Do you communicate effectively? Anyone can write a paper. Not too many can make a sound argument. \n\nI hope your friend gets enlightened before medical school, even though I doubt they will, but please know a doctor is no better than a screenwriter or poet or professor or novelist. And many of them save lives, too. \n\nAnd in a season where we’re devaluing arts and history, kudos to you for majoring in English. We need so many more of you to join our ranks.", "NTA, his future colleagues are going to hate him. He'll talk down to a nurse one time and whoops, everyone in the hospital knows he's a dick. \n\nMy first degree was English and American lit, second is physiotherapy. Both are challenging in different ways. Medical based stuff is about fact recall and clinical reasoning, lit is about interpreting subjectively and creatively. 8 essays is a loooot to finish up.", "NTA. My wife has a saying: \"Pain is relative.\" Just because he's doing arguably more difficult work doesn't invalidate the stress and difficulty of yours. He needs to get off his high horse before it bucks him off.", "NTA I have a engineering degree, and while yes I believe that some degrees are inherently harder than others, but that does not mean that it still isn’t hard. I found my degree hard, but there are others who it wasn’t as hard for. A lot of it comes down to the person and their level of what is hard and what isn’t. \n\nAlso I would cry if I had that many essays due in the span of two weeks, so don’t put too much thought into what they said.", "NTA, just because your friend is in medicine does not mean he gets to be an asshole about your degree.  And 27000 words is a whole lot, mate, no wonder you were stressed. Besides, writing and writing well are two different things. And a degree in english is a useful one that does take a lot of hard work. I don't think your friend respects you, or anyone who doesn't do medicine, and that's elitist and arrogant of him. Plain and simple. Besides, no matter what you are doing, if you feel stress, then that is what you feel. Someone else's stress does not change that.", "NTA. Personally I don’t get degrees like English, probably humanities in general. I just don’t speak on it because I’d probably sound more arrogant and as ignorant as your friend.", "NTA\n\nAt this point, bashing people's degrees is embarrassing. We as a society and culture need various degrees because no subject is \"useless.\" If you think you're better than other people because of what you studied, you're kinda pathetic.", "NTA. An English degree is very difficult! I should know, I completed one. Your friend is an AH.", "NTA, but med students are frequently AHs who feel it necessary to denigrate anyone not in their field, at least in my experience.  If you aren’t studying to be a doctor, you can’t possibly be as smart or hardworking as they are, in their opinion.  It’s why so many doctors wind up with a God complex.  They started out thinking they’re already better than everyone else.  (Not everyone in the medical profession is a tool, obviously, but the attitude is not uncommon amongst med students.)", "NTA. I’m sorry your friend belittled you. Writing well is a skill I wish I had, and congrats on finishing your essays! When I finished my sociology degree I got crap from people who said it was useless. Turns out, it was highly valuable for my career in research and evaluation. Don’t listen to that chump. You do you.", "From a person whose in the same degree-\n\nTo those who make fun of our degree, stop watching movies, shows, news, plays. Stop reading books, any form of writing art.\nIf you can’t appreciate the people who work hard to master these crafts, you don’t deserve to enjoy the luxuries of literature/theatrics.", "NTA.  Your \"friend\" is an AH for diminishing your hard work & your degree.  Just bc it's not a medical degree, doesn't mean the course work isn't hard.  Congratulations on your hard work & receiving your degree.  Your \"friend\" sucks.", "English is not an easy language. \n\nNTA.", "NTA. Your friend was being a dick and belittling of your degree for no reason.", "NTA. Misery is not a competition, and a future doctor really needs to learn that before he starts treating patients", "Nta. Drop these so called “friends”", "NTA - I was a writing tutor in undergrad and a lot of these STEM people who look down on humanities majors can barely piece together enough sentences to write a passable 2 page essay", "NTA - if you ever see him again - give him a pop quiz and grade it right there in front of him.", "As someone who did research into an archeology degree. A PHD is like ten years. you don't need a phd to get done with medical. Fair neither for archeology, but 10 years. Ten long years. (last I checked. Please correct this someone. Preferably someone with said degree.) Is he going to say \"studying rocks is way easier than medical\" too? Like come on. Different fields different work.  \n\n\nyou're should be ex friend here is frankly just looking down on you. And based on that last segment and I quote from you \"I haven’t seen him since but I’ve heard he’s been telling people that I was overdramatic and silly for getting offended at what he said.\" I wouldn't tolerate that. I have my own backlashes ready for you to use. But no. This is not okay. You have every right to just be mad at him. Because lets be honest here.  \n\n\nEven if he gets his degree, still doesn't mean he will become an actual doctor.", "NTA", "NTA you didn’t cause an argument, he did. Just because his degree is “harder” that doesn’t make yours easy. He shouldn’t be diminishing you accomplishments or disregarding your efforts. Is he the kind of person who’s always putting others down to make themselves feel better? If so I’d limit my time around him for the sake of my own mental health.", "Who wants a doctor, that doesn't have empathy", "Given this sounds like undergrad, and therefor he is in pre-med, the potential that he is a future doctor definitely isn't guaranteed. With that kind of mindset I kind of hope it doesn't work out for him.", "Also I would cry if I had that many essays due in the span of two weeks, so don’t put too much thought into what they said.", "Just bc it's not a medical degree, doesn't mean the course work isn't hard. Congratulations on your hard work & receiving your degree. Your \"friend\" sucks.", "[removed]", "You should feel proud of your accomplishments! Hand this wannabe doc an ice pack for his butt hurt.", "I am not in a Psych degree but oh lord do I feel for you guys. I see the endless tests, midterms, exams, assignments and one look at them makes me think “ah yeah I’m good”\n\nKeep on the path that brings you joy, we need people in psych!", "Medicine man, is that you?", "All of my degrees are in the sciences and I failed English 1020 twice.  That class irritated me more than anything, writing endless essays makes me want to die and I simply do not have the skills for that kind of education.", "NTA. Doctor-to-be got a taste of his own medicine and didn’t like it. Needs to learn some empathy for treating all his patients-to-be.", "hopefully, he'll end up a surgeon", "I like the old joke, \"What do you call a doctor who finished bottom of their class?\n\nDoctor\".", "In the UK you only get an MD if you do a medical doctorate. You graduate with a bachelor's of medicine and of surgery and that's it.", "**BOT ALERT**     \nPlease report as Spam > Harmful Bots.\n\nComment (partially) copied from [here](https://www.reddit.com/r/AmItheAsshole/comments/14t82ol/aita_for_defending_my_degree/jr0yoyt/?utm_source=share&utm_medium=ios_app&utm_name=ioscss&utm_content=1&utm_term=1&context=3)", "thank you, you seem like a very kind and lovely person. i hope you manage to get some rest soon. i’m sure you’re going to be a fantastic doctor", "After the pandemic where we relied on artists... really?", "I’ve met a professor who got his bachelors with a degree in English who went on to get a PhD in Cybersecurity and had a very lucrative job in the field. The type of degree you pursue means nothing so long as you know how to develop valuable skills and market yourself.", "Engineers and doctors get the vast majority of their knowledge and practice from liberal arts majors. \n\nThat new state of the art drug your doctor prescribes was definitely developed and tested by a team of chemists, biochemists, and biologists, who are all liberal arts majors. There may be a pharmacist or MD on staff, but they aren't doing the research, there present strictly for clinical management.\n\nThe new battery chemistries being studied for EV and renewable energy are being designed by chemists. Pure engineers only become involved once they're looking at manufacturing process.\n\nThose quantum computers that are in the news? Those are all being developed by physicists. Engineers may be involved in build, but it's those liberal arts majors driving the bus.\n\nWhere do all of those textbook illustrations and training videos come from that those engineers and doctors use to learn their trade? Oh yeah, also liberal arts people that studied art and graphic design. Where did those doctors and engineers learn how to write so they could share knowledge within their field? More liberal arts majors!\n\nDoctors and engineers don't exist without the support of their liberal arts peers.", "Besides, no matter what you are doing, if you feel stress, then that is what you feel.", "Interesting!\n\nIt feels like the US has gotten itself into a position where we do things in some sub-optimal ways, including med school.  It isn't clear to me that staying up for 24 to 48 hours at a time for a residency necessarily makes a better doctor.  Or that we need to be as fussy about who we let into med school, or at least using the criteria we do (being willing, as far as I can tell, to shiv your mom for an 'A'.).", "thank you :)", "Or after a week of garbage men, who usually do not have a degree at all, striking.\n\nSource; the garbage men in my country went on strike in a few cities. The result was... bad... really bad.", "Say that after a day with no running water.", "You think any of those things would exist without science and technology? \nI'd still easily rather give entertainment than things like medicine, electricity, plumbing, structures, etc. You're either lying if you disagree or need to reevaluate your priorities", "The only reason you can say \"after the pandemic\" is because of doctors", "It’s useful for things like close reading, and reading against a text, which are quite transferable skills.", "No but you are the one with a pipe up their bum about word choice.", ">Besides, no matter what you are doing, if you feel stress, then that is what you feel.\n\nThis whole \"You can't be miserable because someone else has it worse\" rubbish bugs me.  If that's true, then the corollary also has to be true:  You can't be happy because someone else has it better.", ">It isn't clear to me that staying up for 24 to 48 hours at a time for a residency necessarily makes a better doctor. \n\nThis isn't US-exclusive. \\*pained smiling\\*", "When did they say that plumbers, engineers and doctors weren't important? They're arguing against the claim that they're the *only* important people in the world.", "Entertainment such as reading, theatre and music has existed long before technology. If life was solely centred around medicine, plumbing and lightbulbs the world would be a pretty miserable place.", "So you sat in silence the whole time and never watched a show nor listened to any music for 2 years.  Got it.  No movies, no Netflix, no Amazon Prime, no Disney, no Youtube.  Got it. No books.  Nothing.  Just bare walls.", "Lots of degrees require this.\n\nEnglish is one of the least useful degrees you can get.  Admittedly it is a step up from stuff like tourism and journalism, but it is a waste of time from an employment frame of mind.\n\nI have an English degree, as do other people I know.  It is useless unless you want to become an English teacher.", "Ouch. I didn't realize that other countries did it, too.  It would be interesting to see if the scientific consensus backs up the necessity of that sort of training scheme.\n\nI have some strong opinions about medical education, but not much knowledge, it appears.  I should fix that!", ">They're arguing against the claim that they're the only important people in the world.\n\nNobody made this claim.", ">No movies, no Netflix, no Amazon Prime, no Disney, no Youtube.\n\nThat’s a lovely list of things which would certainly not exist without engineers.", "I don’t understand why you chose to do an English degree if you believe it’s inherently useless", "Op wrote ‘amused and irony’? As in, you found what they wrote ‘amused and Irony’? Or your not mad about how they wrote just ‘amused and Irony’ about it? I’m trying to make that sentence make sense. And I have an MA in English.", ">It would be interesting to see if the scientific consensus backs up the necessity of that sort of training scheme.\n\nEh. At least over here we're not trying to delude anyone it's for training. Everyone just admits that it sucks but that's how it's always been done.", "Nobody made the claim that plumbers weren't important either. \n\nStating that one group is 'much more important' than another group does indeed imply that the other group isn't important.", "I was but a child.  I wanted a degree I could sail through as a route out of getting in trouble", "What?", "So when you got your MA in English, we’re you “doing English” or were you studying English?", "I’m amused and Irony that you ask that. I was doing (a postgraduate degree in) English. \n\nAnd spending a lot more time proofreading my work then I do here on this site. \n\nLook, just admit the typo, autocorrect, or brain fart that produced your now legendary ‘amused and Irony’ and concede that people don’t scrutinise and edit their work on forum posts in the way they do for academic submissions. I’ll be very amused and Irony if you don’t. \n\nBTW thanks for not picking up on my using ‘your’ instead of ‘you’re’ in the comment you just responded to, third line.", "You’re welcome", "NTA", "While I firmly believe that a BS with pre-med requirements is, hour for hour, more difficult than English (or my history degree) homeboy should not dish out what he can't take.\n\nIf he doesn't want to get called an asshole, he shouldn't act one.\n\nI personally would not have wasted my time defending my degree. He wants to clown, come back with \"I guess they don't teach you bedside manner, fucker.\"\n\nNTA, of course.", "NTA, drop this phony \"friend\".", "Tell him to work a single summer in agriculture harvesting in Southern California. Does the fact that that kind of back breaking work exists diminish how hard he’s worked on his degree? No, that’d be a silly position to truly take. \n\nNTA, but he really is.", "NTA. He insulted you, laughed at you and belittled you. Eff him. You did nothing wrong, and he was being a prick for no reason.", "NTA I cannot abide people who devalue the humanities like that. Writing requires much more brainstorming and decision-making than medicine. I’m not putting down doctors in the slightest; they work hard, long hours. But a lot of what they do is following memorization and following protocols.", "I took my English degree and had a good career writing and editing marketing and training materials in the medical field - medical textbooks, marketing and training materials for pharmaceutical companies, web-based training for medical equipment, etc. Tell this guy that his colon not the only part of his body that's full of shit. No degree is \"easy\" if you aren't just doing it to get the paper, but actually trying to learn something.", "NTA.\n\nTo me, every degree has its challenges.  They are both hard in their own way in my opinion: actually all of them are hard.\n\nCreative writing and English is hard.  Medicine is hard.\n\nHe is being a bit of a snob sadly.\n\nHe is wrong but it is best to not waste your time arguing with him because when there are people with such a high degree of snobbery, there is no changing their mind until they mature a bit more in time.", "English is an academic discipline.  Medicine is merely carpentry with bodies.\n\nNTA", "NTA - I know people with PhDs that don’t even act like this. He needs to chill.", "NTA -  \n\n\nFirst of all, just because your degree might not be as intense all the time as his, it doesn't make yours not difficult.  \n\n\nSecond, he's just being a jerk.", "NTA\n\nI got my English Lit degree in 2007. Those 4 years were fun, because college, but they were not smooth sailing with the essays and papers (and sometimes group projects) that had to be done. My classes also made it where you had to actually attend class to even think of passing midterms or finals, not just read the assignments on the syllabus and you were golden. Also.....when did English anything become an \"easy\" major? It was considered one of the difficult ones while I attended university, I was constantly given respect and repeatedly told I must REALLY like the subject to do ALL that work. Yes, even med students said that to me", "NTA, even if he’s right about his studies being harder (which to be fair, he is), he’s still rude and condescending. i have a good job but i’m still polite to cashiers, servers, fast food workers because why wouldnt i be? i was there once myself", "Sounds as though your friend is going to do  awesome in the field of medicine.  /s  You are NTA but your friend sure is an arrogant, condescending piece of work.", "NTA. I am in STEM and it's easier to memorize a bunch of facts and synthesize them than it is to read a creative text and synthesize it. I would argue it's harder because the rubric is more subjective. In STEM, there is a best answer then then some answers you can justify, but they're all objective. In the humanities, it's really about making a persuasive argument that others will agree. There is no right answer or even best answer, just your own -- maybe it's because I am in STEM that this seems nebulous and hard.\n\nAlso being in STEM....A LOT of them suck at writing and struggle a lot with English courses. At my university, they essentially circumvent this by offering the writing requirement within STEM courses rather than the old system of having to take an English course to fulfill the writing requirement. It's a sought-after skill in STEM to be a good writer.", "It is an easy degree, you will have a hard time in the future.", "NTA- My friend was an English major and the linguistics portion was intense.", "Mad props to the hard work you put in. I graduated a couple years ago with an engineering degree and let me tell you the relief I felt when I took my last english course before entering the engineering program was massive. Essays were PAINFUL for me to sit down and clunk out. I don't know if it was lack of enthusiam or how they are so open ended and not just solid answers but I couldn't write more then a paragraph without having to take a breather. Congrats on getting through all those papers, it's something I honestly could never do.", "You have no defense. Every degree is more difficult to obtain than the one you chose to pursue.", "NTA\n\nIt sounds like you were venting because you were stressed. He should not have said what he said. He was asking for that reaction", "As someone with an English degree - leaving it to the last week or so to write 27K words is poor time management on your part. I've done it, but I don't whine about anything except my lack of sleep. Also, American Universities as a rule have gen ed requirements - we still have to take science, math, social sciences, and foreign language(s) - that's why US degrees are 4-years as opposed to three years for most other countries.\n\nSTEM degrees you HAVE to do the work for every class or you would be lost and fail. I cannot blame your friend for being derisive.", "As a doctor, I can tell you that a medical degree is no joke. We slave away for hours, year after year studying to just about pass. I endured countless sleepless nights for 6 years. It was hard. \nWriting 8 essays adding up to 27,000 words seems a hell of a lot harder ....\nWell done for defending your hard work. Everyone can be an expert in their own field. Good luck with your degree.\nNTA", "I would challenge him to write 8 knowledgeable, interesting, informative, and grammatically correct essays in the same time frame.", "Yeah I work with STEM kids and they try to avoid writing as much as possible. OP may have hit a nerve with his friend. Ask him if he's read anything recently that isn't a medical text book? (Note: I also encourage the STEM kids to read, even if its just sci fi, fantasy, classics, modernist, whatever. It gives them a dose of empathy and in the future, better bedside manners and something to talk about.)", "Not to mention the whole “I have it harder than you, therefore you don’t have it hard” mindset is pathetic. Just because one person’s suffering is worse doesn’t make the another person’s suffering meaningless", "Most people would be shocked at how many high-ranking professionals lack effective writing skills. You can never have too many strong writers on your staff regardless of the field.\n\n>but the workforce needs people with skills in liberal arts just as much as they need engineers and businessmen\n\nI won't speak to engineering degrees, but the hilariously ironic thing about all the liberal arts slander is that a business degree fits all those same stereotypes. It's essentially a conservative-brained liberal arts program.", "I'm an English major and I would argue that humanities are inherently more forgiving. They tend not to have curved classes or people failing out. But that's not a reason to diss someone else's stress. Everyone has their own challenges.", "Yeah, he should try to write a 1000 word essay. Nobody would be able to read it. Badum tsss", "As a student nurse, i despise harvard refrencing and essay writing in general.\nThe funny thing is i work alongside many fy1's (student doctors), and they say my course is difficult given how much is crammed in over the 3 years of the degree. \nThere are a few though who act like this mighty god in thinking they are superior to everyone yet are the ones begging nurses to help clear up their messes. \n\nNtA OP, i couldn't do 8 essays back to back.", "No. Sounds like they're European. You can go straight into medicine in most countries after high school. It's just 6-7 years of medicine as opposed to four years for a bachelor's and then 4 years in medicine.", "you wouldn't have even been able to read this post or write this comment if it weren't for liberal art graduates.", "English man.", "The reality is every degree has it's unique challenges.", "That's because essay writing is a skill. I learned in high school when I failed honors English and had a tutorial makeup class. The teacher was a former Jesuit and he used concrete examples and then would make an assignment to follow the examples I had read. It was a revelation.\n\nMy Dad was an engineer and basically pointed out to all the newbies - you can have the best ideas in the world, but if you cannot communicate them to others, they are worthless.", "He'll probably end up a pathologist- because no one will be able to stand him except the dead.", "i mean i could live very happily without any of those things. in fact i think most people would live happier lives if they had less screen time for sure (like imagine what i could be doing with my time if i wasnt on reddit right now) but if i got shot or injured or a serious infection i could not live happily or probably at all with that. to be fair.", "some of us did actually work throughout the entire pandemic", "I don’t disagree with your final conclusion but uhh…liberal arts majors are not researching your drugs. The vast majority of researchers in pharma hold PhDs and manage teams of individuals with masters and sometimes bachelors in their respective scientific fields. \n\nSource - have a PhD in biomedical sciences, have worked in industry. We don’t hire people with English degrees, although it’s an amusing thought.", "Try telling that to the doctor hahaha\n\nSeriously though, it's like the med student is saying that just because he gets shocked with the same amount of electricity his is more painful because it comes from a red wire instead of a blue one or something lol", "I know many folks who had anxiety or even panic attacks at the thought of writing a paper for school. \n\nAnd why do I feel that this 'friend' looks down on ANY degree other than a medical degree???", "Maybe. There's a quiet but important move to start moving men out of the field... because a lot of men won't stop fucking the corpses. A lot of funeral homes and mortician offices stopped hiring men. \n\nThere's a reason why a lot of religions require a female or group of female guardians over female bodies between death and burial.", "yeah chemistry, biochem, and biology are not liberal arts degrees…", "Liberal arts majors are the ones making sure the instructions on the drug packages make sense to the rest of the world's population who are not scientists.", "No they’re not. 😂 Medical writers with PhDs write those package inserts and box labels. HOWEVER, our editorial teams make sure our grammar is on point (but they have nothing to do with content).\n\nEdit: Medical writers may also have PharmDs and MDs.", "…and artists.", "Sucks.\n\nKinda like the way that computer science (my field) doesn't seem to be able to graduate and employ women, despite, last time I checked, the fact that nobody programs with their penis.\n\n(Which is to say that we all suck in different ways.)", ">does indeed imply\n\nThis is where I roll my eyes, stop reading, and go on with my life.", "You used the words amused and irony and then said that you are describing what OP wrote and not your feelings. \n\n\"Amused\" is a feeling....YOUR feeling, her writing is not \"amused\"", "Roll your eyes all you want, you're arguing against something that was never stated in the first place.", "Funny, this conversation started with me telling you that exact same thing.", "NTA. I'm a doctor.  I found my degree challenging but enjoyable and I did fairly well. But if you stuck me on an English course, I'd have had a stress induced meltdown within the first few weeks. I can't write essays, never have been able to. Of course, we had to do some, but I struggled to reach the bare minimum word count every single time. \n\nI have so much adoration that people can write long, creative essays. Whenever I try to write creatively, I sound like an 8 year old writing a book report. As you may have ascertained from this comment....", "NTA. As a humanities student, the library is your lab. The two degrees require an equivalent amount of study time; the difference is that most of your study time is spent reading and thinking to enable you to articulate your analysis verbally and in writing, whereas most of his is spent listening to lectures and doing practicals, followed by time-limited exams.\n\nThey're different sets of skills, but equally rigorous in their own way.", "NTA. As someone who studied history and routinely edited essays for people in the sciences, they clearly find writing difficult because all of them struggled with it. \n\nThey're different skills. The world needs doctors, yes, but I wouldn't want to live in a world without literature either.", "NTA, but the future doctor who likely already has a god complex is and will be forever.  Get better friends.", "NTA\n\nI majored in Engineering and minored in English.  Both are difficult in different ways.\n\nI'll bet your ex-buddy can't write a non-scientific work good enough to get published at a reputable place. \nIf it's so easy, he should have at it.  If he's not your ex-buddy yet, fix that. \n\nYes he may save lives some day, but they have to be worth living, and with no art, books, music, movies, etc. it would be too drab to consider.", "NTA  sure his degree is hard but it is also extraordinarily limited. he doesn't make it it really hasn't got other uses. a lot of people miss the fact that liberal degrees teach you to think rather than just parrot back a set of facts. \n\nIf he's going to belittle your work, we've got an idea of what his bed side manner will be.  carppy.", "NTA. There are sooooo many idiots with medical degrees (doctors, nurses, PAs, etc). Being in medicine doesn't automatically make you more intelligent than anyone else.", "The future doctor needs to work on his bedside manner, or he won't have many patients. \n\nNTA.", "NTA.  STEM majors are often incredibly full of themselves and I'm surprised more of them don't have broken arms from patting themselves on the back.", "NTA. I also graduated with an English degree and am now an English teacher. I used to (and still do) receive similar comments. It’s extraordinarily frustrating and invalidating hearing comments like that. It honestly makes my blood boil. \n\nAnyway, in my experience, the best way to handle it isn’t to prove myself/prove how hard it is/prove my workload. The person making the comment is too full of themselves to hear any of that. I usually just say something along the lines of “At least I have enough emotional intelligence and social awareness to realize how much of an asshole I would sound like if I said something like that. Yikes.”", "NTA. Your friendship has probably no future if he dismisses your stress. In addition he has no clue about your degree except from stories of others.", "NTA. Remember this if/when he ever asks you to proofread or edit a journal article.", "NTA. As a medical student myself I understand the stress it takes for any degree, especially one that involves so much reading and writing! Hopefully this guy understands and learns his lesson in the future.", "NTA this used to come up when I was in college. The people doing science degrees would be studying so hard for their exams. Meanwhile I hardly ever had exams.. I had multiple 15-20 page papers due instead. I sometimes WISHED I had more exams so I could just get them over with in one morning. \n\nThey are just very very different disciplines and hard to compare. I mean *i* thought their degree was easy because they barely ever wrote a paper, so. And some of the writing on the lab reports I saw people turn in? WHEW. Let’s just say it was bad.", "NTA. Your “friend” sounds like a total AH. What a load of condescending bullshit.", "Just what the world needs, a future doctor with that kind of attitude.  If this is what he thinks of his friends, just imagine the contempt he's going to have for his patients.\n\nNTA.", "NTA\n\nIf everyone was a doctor or an engineer we’d have a pretty boring world imo. I think folks who do challenging degrees sometimes get it into their heads they are doing something so utilitarian that it overshadows all the good any other field might offer. Folks can argue and quibble over the practical value of any field, but I think it should be somewhat obvious that our world would be a lot less interesting if we completely reject the study of humanities in a broad sense, or even specific fields like writing etc.\n\nI love that someone feels fulfilled working on healing others. I feel fulfilled when I write something that evokes feelings, in myself or others. I dislike that there are people who look down on what others choose to study, and the challenges they may face.", "NTA. \n\nSTRESS IS NOT A COMPETITION. We all fight our own battles, and the best thing we can do is our best.", "Yeah, if I were OP, I'd be tempted to tell him that there are plenty of stupid and/or incompetent doctors out there that must not have studied hard enough, that's why the medical malpractice business is approximately a 9.5 BILLION dollar a year industry.", "Modern medicine models itself around person-centred care, so if you can’t empathise with your friends’ POV, how good will the patient communication and empathy be?", "I started college working towards an English degree.  I quit and went back.  I finished with Business (Computer) and Psychology degrees.  The English work was definitely more time-consuming but I was fortunate that I had a knack for the hardest class.  The three hardest classes I had were History of Non-Western Art (intended for art majors), Behavioral Psychology, and some weird business math class that I still understand nothing about.  After dipping my toes in several ponds, I completely agree that there are challenges in all fields and we each have our strengths and weaknesses to help or hinder us in them.  I'd like to see OP's friend struggle through that art history or psychology class.", "you wrote this comment beautifully :) i’m sure you’re an amazing doctor", "I figure people in physical sciences think it's more rigorous because there's one right answer so you can't get away with subjective opinion but I see how it can be more challenging to find an acceptable answer when it's not clear", "congrats on getting your degree!! one of my close friends is an engineering major and i couldn’t understand his coursework to save my life. i honestly don’t know how you guys understand any of that", "the majority of the essays were take home tests which we were given two weeks in, but as for the other ones I agree, I definitely do need to work on my time management a little more. That being said, I don’t think it is unreasonable to be stressed about having that many deadlines so close together. Where I live, university is four years as well however we only specialise in one area", "why will i have a hard time? i’ve already completed two internships, had two plays that i’ve written performed and have a number of excellent lecturers and professors who are willing to give me recommendations. why do i have less opportunities as an english student?", "Hey now, doctors have to go through a lot to earn that respect too. Residency is really brutal and mentally taxing, so I understand why medical doctors celebrate their achievements. \n\nThat being said, condemning any field is not cool - OP worked super hard for their degree so I have tons of respect!", "Thank you, that's very kind of you to say 😁", "You don’t. These people just don’t get it. A humanities degree qualifies you for basically every job that doesn’t require specific training or a specific degree. Those are the majority of jobs", "Just life experience, like you, I didn't listen.", "My degree is in art, which that doctor-in-training likely considers a blow-off degree.  But I'm glad I did it when I was young, as there's no way now that I could get away with school, working, and sleeping only 30 minutes every-other night for the last few months trying to complete projects.  Plus commuting an hour round-trip 6 days a week. \n\nDoctor needs to understand that every degree has its own challenges, every person has their own challenges, and there isn't a finite amount of \"difficulty\" that they get to claim because of what they're studying.", "True, but doctors don't say, \"Hey, we're super tough, look what we've been through,\"\\[\\*\\] they say \"We're so smart.\"  PhDs have proven, with a thesis, that they are smart, for some value of smart.  Doctors have mostly memorized a bunch of stuff.\n\nI'm impressed with how hard residency is, but, honestly, I hope my life is never depending on someone who hasn't slept in over 24 hours.  There's plenty of science showing the horrible effects of sleep deprivation.\n\nAnd, to be honest, I've met some amazing, brilliant, and often humble doctors.  And I've met some really insufferable PhDs.  It just seems weird that MDs are so often full of themselves.\n\n\\[\\*\\] This seems more like the Marines, except they never have to say it.", "I forget where I heard it but someone explained that some careers make life “possible to live” (meaning doctors, bankers, lawyers) and others make it “worthwhile to live” (arts & liberal studies - which everybody and their grandmother love to shit on, but still consume). Made me feel a bit less shit about my field of study.", "Ooo I can tell he's just going to make a *great* doctor.  :/\n\nWonder if OP is female?", "This is why science communication and interpretation courses are flourishing now, and why science departments hire spokespeople who have more of an education or communications background rather than a straight science background. I've met some insanely smart people with PhDs and are literal experts in their fields , but put them in front of audience of Average Joe's to talk about their research and they crumble because they have No clue how to \"translate\" their jargon into something more easily understood and accessible to the greater population.\n\nNTA OP, any degree is worth all the praise as it is a hard going!", "Not only that, who does this not-yet-doctor think is going to run his D&D games?  English/Classics/Art, these are the degrees from which epic campaigns are devised.", "And I agree - the whole “we are smart” thing is a bunch of bull tbh. And I know lots of humble doctors - it’s unfortunately the stereotype that gets pushed where the bad apples speak for all the apples. And yeah there’s more lobbying for better care for residents where they don’t have to be awake that long at a time haha, it’ll be a long time before there’s ever any progress made though.", "This is a false choice, something you'd know if you took more liberal arts classes like English and Philosophy. If we had to prioritize because we were in a bad sci-fi novel, yeah, I'd want a doctor before a playwright. But we're not, and need both to live and enjoy life. \n\nAll of this as you sit, WRITING, on a forum over moral issues, for entertainment. It's like you're crapping on the cake you're currently eating.", "I was working as a teacher.  I relied heavily on music and books in my down time to keep my sanity.  The arts matter.", "Well the only reason you can say anything at all is because you haven’t starved to death, so I guess farmers beat all of them.\n\nThis is such a stupid argument.  The only way we can have an “objective” ranking of these things is based on what is required to survive. But there are many things not necessary to survival that make life more worthwhile.  Few people would want to live in a world with no music, tv, movies, sports, video games, restaurants that make tasty food, etc.  \n\nSimilarly, non-reconstructive cosmetic surgery isn’t necessary to survive.  Lots of engineers make things that aren’t necessary to survive - they make things that make life easier or more fun.  Do we really want to go through and judge exactly which members of these professions are “worthy”?  Maybe we could just try propping up our egos some other way.", "Ewwwww! Why am I not surprised?", "Most residencies these days do actually have some limits on the length of time a doctor can be on call. \n\nMy parents rented to many residents who worked in Boston.\n\nMMV depending on locale, obviously.", "As a double English and philosophy major…. Yep. 😂", "Hey, wasn't *that* long ago that women weren't allowed to be doctors, and then there were more women in my year of med school than men! It'll happen. Someday.", "I feel like I'm beating a dead horse here, though -- most MDs I know are pretty cool, now that I think about it."]}