{"id": 21665, "submission_id": "14u430s", "title": "AITA for telling my husband to \"Deal with it\"", "selftext": "My (F20s) Husband (M20s) has long life pets from his childhood that moved in when we moved in together a few years ago, (Parrot, Tortoise,).\n\nI do love pets and as these are my husband's I never wanted to say \"Get rid of the pets.\" as I firmly believe a pet it for life, unless extreme circumstances. As these pets are \"indoor\" pets and \"lower care\" than a dog I figured we'd do care 50/50.\n\nIn 2020 I got a WFH job, so I'm around the pets all day, so they're more attached to me and follow my commands a bit more as they know I spoil but to a limit. (bad behavior's means you don't get to hang out with Mom) \n\nMy husband on the other hand has figured I'm going to do the care 24/7. I never get a moment to myself, my days off are normally doing the deep cleaning of everyone in the house or running to get fresh food/ pet care items. He is off Tues/Wed, I'm off Wed/Thu, he's gone all day Tues after waking up at noon and doesn't return home until after midnight. Meanwhile I'm still working but handling everyone at home. I've told him to step up and he kind of brushes it off.\n\nHowever on the rare occasion that I have a doctor's appt (illness that runs in family, appt made months in advance) it's a fight with my husband each time. I don't like taking the pets off their schedule by much since it means they're cranky and potty breaks become harder. I had an appt on Wens at 11 which is normally when the pets day starts, but I'll need to be out the house by 9:30, husband had an interview at 1pm and states that I should just get everyone ready for the day when I get up.\n\n I said no he needs to do it. \n\nHe said that the parrot always bites him and flies away, and the Tortoise just hunkers down when it's time to put them up.\n\nI explain they do it because they're not use to him, and the bird bites me all the time and showed him my hand where the bird recently bit me. (hormones)\n\nHe told me I was being stubborn. \n\nI told him to Deal with it, and after my appt I'm going shopping for myself, and getting lunch since I don't go out much and since I'm downtown I'll enjoy myself. Which I did, first me time in months.\n\nHe's now upset and saying I costed him the interview. \n\nAITA for this?", "created_utc": 1688822305, "permalink": "/r/AmItheAsshole/comments/14u430s/aita_for_telling_my_husband_to_deal_with_it/", "score": 176, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I could have cost my husband a job interview for being stubborn as I took me time after my doctor's appt.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA He took care of them before you married, he can do it now.  They're there because of him anyway.  Is he going to be like this if you have kids?", "NTA.  These are his pets.  It's a glimpse into what life will be like when/if you introduce children into the mix.  Be careful with this one.", "You couldn’t feed his pet turtle so he says you cost him a job offer? Is he 12?", ">My (F20s) Husband (M20s) has long life pets from his childhood that moved in when we moved in together a few years ago, (Parrot, Tortoise,).\n\nThey are, respectfully, his pets. They've been his from his childhood no less. If you weren't in the picture, who the hell would be taking care of them? Telling him to \"Deal with it\" is not being a AH, it's telling him to take care of his pets like he rightfully should. \n\nNTA.", "NTA. Your husband sounds plain ol' lazy and inconsiderate. Is he such a baby about everything or is just the pets?", "It's not a pet thing honey. You have bigger problems between you two than the pets.", "NTA\n\nDo you want to continue living like this? What if there were children in the picture too? I think a break or marriage counseling or something would help a lot. Can you go stay with your parents for a month?", "NTA. So the pets primarily belong to him and now that you are taking care of them he doesn't want to keep up with his basic responsibilities. You should have a serious conversation with your husband about this. He is taking you for granted and treating you as a house help.", "NTA.  They are HIS animals, and he needs to step up.", "NTA.\n\nThey're his pets and you live together, so he should be providing at least equal care (if not more) for them.", "NTA. These are his pets and he should be taking half responsibility for them *at minimum*. You deserve time to yourself every now and then same as him. And that whole “costing him the interview” bs is ridiculous. He’s a grown adult, he should be able to prepare them in time to leave the house for an interview at 1pm. It’s his fault he missed it.", "Honestly, in your position I’d say the same thing.\nNTA", "What did he do before you were married?\n\nNTA - you shouldn’t be 100% responsible for his animals. He needs to step up.", "NTA. Tell him to grow the F up. If he can’t handle taking care of them, then he needs to get rid of them.", "NTA, they are HIS pets, so he should take care of them.", "NTA - You are doing more than your fair share though I am curious as to what he does all day on his day off that he is gone until midnight.", "INFO: He said you cost him the job interview.\nDoes that mean he didn't go to the interview, or was he just whining again?", "NTA, pets are your husband. He sounds like Logan Paul who only gets animals as status symbols. He also had a turtle and a parrot", "NTA, and ~~the Iranian yoghurt~~ the pets aren't the issue here.", "I need some information here. How did this cost him the interview?", "Nta husband is. He is very immature.", "NTA and that's coming from a parrot owner. The parrot bites him and flies away, which basically means, the parrot isn't his anymore. I've never had a tortoise, but it sounds like he's neglected them long enough that they don't really consider him anything. He either needs to start interacting with them a lot more, or figure out something else.", "NTA\n\nSell the pets.", "Nta. You're married at 20. What kind of behavior did you expect from a 20 year old kid? He's not going to take care of his own pets, do you think he'd take care of kids? What if you were sick, would he take care of you? You really need to put your foot down and have a one on one calm talk face to face and let him know that if things don't change, this relationship isn't going to work out", "Have you tried doing those things together? \nLike having a specific day where you can show him, so he doesn't complain? Because what I see is a strong woman doing all by herself, and him taking all the good parts away! I support what you did, because if you don't take care of yourself, how can you take care of others?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy (F20s) Husband (M20s) has long life pets from his childhood that moved in when we moved in together a few years ago, (Parrot, Tortoise,).\n\nI do love pets and as these are my husband's I never wanted to say \"Get rid of the pets.\" as I firmly believe a pet it for life, unless extreme circumstances. As these pets are \"indoor\" pets and \"lower care\" than a dog I figured we'd do care 50/50.\n\nIn 2020 I got a WFH job, so I'm around the pets all day, so they're more attached to me and follow my commands a bit more as they know I spoil but to a limit. (bad behavior's means you don't get to hang out with Mom) \n\nMy husband on the other hand has figured I'm going to do the care 24/7. I never get a moment to myself, my days off are normally doing the deep cleaning of everyone in the house or running to get fresh food/ pet care items. He is off Tues/Wed, I'm off Wed/Thu, he's gone all day Tues after waking up at noon and doesn't return home until after midnight. Meanwhile I'm still working but handling everyone at home. I've told him to step up and he kind of brushes it off.\n\nHowever on the rare occasion that I have a doctor's appt (illness that runs in family, appt made months in advance) it's a fight with my husband each time. I don't like taking the pets off their schedule by much since it means they're cranky and potty breaks become harder. I had an appt on Wens at 11 which is normally when the pets day starts, but I'll need to be out the house by 9:30, husband had an interview at 1pm and states that I should just get everyone ready for the day when I get up.\n\n I said no he needs to do it. \n\nHe said that the parrot always bites him and flies away, and the Tortoise just hunkers down when it's time to put them up.\n\nI explain they do it because they're not use to him, and the bird bites me all the time and showed him my hand where the bird recently bit me. (hormones)\n\nHe told me I was being stubborn. \n\nI told him to Deal with it, and after my appt I'm going shopping for myself, and getting lunch since I don't go out much and since I'm downtown I'll enjoy myself. Which I did, first me time in months.\n\nHe's now upset and saying I costed him the interview. \n\nAITA for this?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA, your husband needs to grow up. His pets, his responsibility.", "NTA. These are his pets?", "NTA, I have 5 parrots and a dog, and I do all of the care because they're MY pets. My husband just pays for their food and medical care (which is a lot of money due to the amount of fresh, organic produce I feed the birds and all the medical appointments for the senior dog). If you took the parrot and left, you would have a happy bird AND less work to do, just saying....", "Nta. Why is he complaining about taking care of HIS pets? I would have told him the exact same thing.", "Nta. They are his pets. Either he needs to take care of them or tell you he just can’t and you can talk about giving them to someone who can. And stop doing everything in the house. You don’t live there by yourself so why do you have to do everything? And why does his mental health matter more than yours? Stop doing his things do your laundry and your laundry only. Cook only for you. He has hands and two days off just like you which means he can cook for himself and do his own laundry. If he doesn’t like it he can hire a service to do it. You work from home your not at home playing and sleeping all day. Stop letting him take advantage of you.", "NTA\n\nHe should know how to care for his pets, he must have done before you came along?\n\nThe assumption the WFH partner therefore looks after everything house related sucks.\n\nDefinitely have a conversation about 50/50 from now.", "IF your doctor appts are set up months in advance, why did he schedule and interview on that day?", "NTA. If he is entitled to him-time, you are entitled to you-time.\n\nDo not have children with this man; it will be worse.", "NTA. But you are being an AH to yourself. He is using you as a bang maid and does not treat you as a partner. Do not have children with this man. In fact, it may be time to take a hard look at your life and decide what you want your future to look like.", "The parrot and tortoise have \"potty breaks\"? 🧐", "NTA please do not have children with him. If he can't even feed his own turtle I don't have great hopes for the rest of adulting", "He spends one of his off days by leaving the house at noon and not returning until after midnight? \n\nSus.", "I wonder if husband actually took care of the pets on his own. \n\nIf he moved from his parents’ home to live with OP, his mother may have been the primary pet caretaker. \n\nNTA", "It really doesn't bode well for the future does it?", "If he can’t handle taking care of them, then he needs to get rid of them.", "I've never had a tortoise, but it sounds like he's neglected them long enough that they don't really consider him anything.", "Right? Especially since his interview was at 1? \n\nIF he cared about their schedule (I doubt it) he still has 2 hours from the start of schedule to interview.\n\nThe hell was he doing that he couldn't stop or have finished beforehand?? Turtles aren't THAT hard to feed, are they??", "Yes.  This.", "His mom probably did all the work.", "If she can manage to act like an adult, so can he.", "Good point. Make his parents do the work while he gets the fun experiences instead.  Either way, he can pull his weight now, haha.", ">He is off Tues/Wed, I'm off Wed/Thu, he's gone all day Tues after waking up at noon and doesn't return home until after midnight.\n\nOh really?!?"]}