{"id": 21689, "submission_id": "14ucqnc", "title": "AITA for giving my SO the silent treatment after she got rid of my cat", "selftext": "I(24male) absolutely adore cats. I mean I love them more than anything but my SO Sophia(21female) hates cats. We have twins together. I had a cat when we started dating but I put him down a month after we moved in together due to multiple health issues. If my cat was young and healthy she wouldn’t have wanted to stay with me but he was old and unhealthy so she had no problem with it.\n\nSophia has a two year old small dog Oli (dachshund). The dog moved in with us a month after my cat passed due to her dog being really uncomfortable around cats. Recently I’ve really really wanted another cat but Sophia would always refuse me.\n\nI got tired of it yesterday because it’s unfair how she has a pet but I can get one. So yesterday I brought home a 3 year old cat. The cat was chill but Oli had a huge overreaction and hid. When I would try to get him out of hiding and to loosen up he would snap and start barking. \n\nOli came out of hiding when Sophia got home and she unleashed hell on me. She told me the “bastard” cat had to be gone tomorrow or else she was getting rid of it herself. I didn’t believe her and today when I came home all of the cat’s things and cat were gone. \n\nI was upset and asked her what she did with my cat. She said she returned it to the shelter. I yelled that returning it to a shelter was stressing it out. She said she didn’t give a fuck and that it wouldn’t have happened had I not got the cat in the first place.\n\nShe ended it off with the fact that this home was Oli’s home not whatever cat I bring in. I’ve since stopped talking to and she said I’m petty.", "created_utc": 1688843763, "permalink": "/r/AmItheAsshole/comments/14ucqnc/aita_for_giving_my_so_the_silent_treatment_after/", "score": 400, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I brought home a cat without permission from Sophia. That may make me TA because I know Sophia’s dog is uncomfortable around cats. And I did the selfish thing of bringing home a cat knowing that.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YTA. She hates cats, so you just randomly bring one home to I guess bully her into accepting a cat? Absolutely wrong to use a shelter animal just to have a pissing contest with your wife. Not to mention is seems there was zero thought into how the animals would be introduced to each other, so extra TA  for a complete lack of regard for how this would affect the animals involved.", "ESH. That poor cat. Maybe you both should see a relationship counselor, the communication between you two is terrible.", "ESH.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI(24male) absolutely adore cats. I mean I love them more than anything but my SO Sophia(21female) hates cats. We have twins together. I had a cat when we started dating but I put him down a month after we moved in together due to multiple health issues. If my cat was young and healthy she wouldn’t have wanted to stay with me but he was old and unhealthy so she had no problem with it.\n\nSophia has a two year old small dog Oli (dachshund). The dog moved in with us a month after my cat passed due to her dog being really uncomfortable around cats. Recently I’ve really really wanted another cat but Sophia would always refuse me.\n\nI got tired of it yesterday because it’s unfair how she has a pet but I can get one. So yesterday I brought home a 3 year old cat. The cat was chill but Oli had a huge overreaction and hid. When I would try to get him out of hiding and to loosen up he would snap and start barking. \n\nOli came out of hiding when Sophia got home and she unleashed hell on me. She told me the “bastard” cat had to be gone tomorrow or else she was getting rid of it herself. I didn’t believe her and today when I came home all of the cat’s things and cat were gone. \n\nI was upset and asked her what she did with my cat. She said she returned it to the shelter. I yelled that returning it to a shelter was stressing it out. She said she didn’t give a fuck and that it wouldn’t have happened had I not got the cat in the first place.\n\nShe ended it off with the fact that this home was Oli’s home not whatever cat I bring in. I’ve since stopped talking to and she said I’m petty.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA\n\nCan you retrieve the poor kitty?\n\nDogs and cats can learn to live together.  My pit bull, long deceased, rarely had any issues with the multiple cats in the household.", "NTA. Send her and the dog to a shelter.", "This relationship isn't going to work out with her.", "YTA. You knew that she was against it, but did it anyway. What makes her giving the cat back without your consent not ok, when you chose to get one without her consent? If it is your shared home, you have to make shared decisions.\n\nThere's ways to go about this that could have worked out better for you. Like hiring a pet trainer to see about exposing Oli to cats to see if the fear can be overcome. Then you would have a stronger (not guaranteed) case to get a cat.", "ESH.\n\nFrankly the moment you learned she hated cats was the moment you should have ended the relationship.\n\nNot saying she’s a bad person just that cat lovers and cat haters shouldn’t be together because of this sort of situation.\n\nHowever you stayed with her. \n\nSo YTA:\n\nYou accepted a dog into your home.\n\nYou made an arbitrary decision to get a cat.\n\nYou didn’t believe her when she said she’d get rid of the cat.\n\nShe’s TA:\n\nShe’s unwilling to compromise,\n\nShe got rid of the cat.", "Q", "YTA \n\n>my SO Sophia(21female) hates cats\n\n>If my cat was young and healthy she wouldn’t have wanted to stay with me\n\nSo... so you figured now that she's been saddled with your twins you felt she wouldn't have any option but to stay with you? Is that it? Because that's the only thing that's changed. She still hates cats and she still doesn't want to live with one. \n\n>it’s unfair how she has a pet but I can get one.\n\n>her dog being really uncomfortable around cats.\n\nSo you think it's unfair that she has a pet, so you got one that you knew would make *her* pet uncomfortable? \n\nDude, get over yourself. Make the choice, it's cat ownership or having your family. Based on how flippantly you disregarded her feelings when you knew damn well how things stood, I'd hazard a guess that you're selfish and thoughtless in other aspects of your relationship too. I wouldn't be surprised if this was the straw that broke things.\n\nETA you figured having a stressed out, snapping dog around your (probably) very young kids was something a caring parent would do? Wtf!?", "ESH.. but specially you. You knew she didnt like (not just like but HATES) cats when you first got together and that a cat would be a deal breaker for her, you knew that her dog also hated cats and couldnt be around them.. knowing this you decided to get in a relationship then have twins and then after she told you no to a cat you still went and got one just not giving a fuck about her.\n\nShe sucks for her hatred towards cats and for returning the one you got to the shelter \n\nYoure the Hugest AH because you knew her boundaries towards cats and ignored it.", "ESH!  You clearly have an irreconcilable difference about pets, and both of you are selfish and self-centered. For the sake of the neighbors, small animals, and (god forbid) any potential future children, break up NOW.", "YTA - she wasn’t perfect about the situation, but surely you can live without picking up a random 3yo cat that you brought home on a whim bc you’re annoyed she doesn’t want a cat in the house.", "YTA. Do not ever get a house pet without the full consent of EVERYONE in the house. She said no and you did it anyway, knowing full well how upsetting it would be for her. If you and her stay together, that means no cats. Deal with it or break up, but violating her boundaries is not a good move.", "YTA\n\nPets fall into the 2 yes, 1 no category. She said no and you went behind her back.", "YTA, you should never bring home a pet without everyone's being ok with it. You said that \"Oli had a huge overreaction\" even if you knew the dog was so uncomfortable around cats that she couldn't even bring him with her when you started to live together.\nShe shouldn't have got rid of the cat like that nor call him a \"bastard\", but she's right: none of this would have happened if you didn't bring that cat home without asking her.\nI would say that you both need to grow up a bit, actually talk to each other and maybe break up if your guys are that incompatible (cat lover and cat hater) but if you stay with each other no one else will have to deal with this bullshit.", "ESH. Both of you sound self-absorbed. Talk to each other.", "ESH. your relationship will not be healthy if you both continue to handle conflict like this. first things first, it’s not a fair comparison to say “she has a dog, so i should get a pet, too,” because it doesn’t sound like you hate dogs. a better comparison for this situation is if you had something you hated that your partner ignored, i.e. i hate loud music and my partner never turns it down, i hate fish and it’s all my partner makes for dinner, etc. the main obvious difference here is that the above are not living beings. this cat would not have been living in a happy home if one of its caregivers literally hated and resented it for its whole life. that’s not fair to the cat either. you and your partner both need to compromise, but that compromise is not “i want a cat and you hate them so i’m going to go behind your back.” very childish and in the end it’s both of your fault that that kitty is going through the undue stress of being adopted and sent back to the shelter.", "ESH. Why do people who don’t want to live without x (where x=cat, dog, lizard, parrot, whatever) think mating with a person who despises x is a good idea.", "ESH Just break up and find someone who likes cats.", "YTA. \n\nIf you get to make a unilateral decision to get a cat, she gets to make a unilateral decision to get rid of it.  And at least she gave you a heads up.", "YTA\n\nYou knew she hated cats and has a dog that doesn’t like cats. For some reason you still thought it was a bright idea to bring a cat home WITHOUT ASKING knowing she was going to hate it. Now you’re surprised she took it to a shelter? What did you think would happen?", "ESH. You’re not compatible and you’re making each other miserable because you have different expectations for what living together should look like, and it’s not going to improve because you both think that your own desires matter so much more than the other person’s that you can make major unilateral decisions.\n\nIt wouldn’t be so bad if it was a disagreement over furniture, but you’re both making innocent animals lives worse.", "I mean if you’re living with someone I feel like y’all both have to agree on what pets you want at in the house. I don’t know why you went out and got a cat knowing she ain’t like em. YTA", "ESH but especially you. You don’t want to stress out the cat but you have no problem stressing out the dog. Just break up already, you don’t sound like a good couple.", "Why did you continue a relationship with her if you knew she hated cats and you love them? Did you think you could change her mind? \n\nLook I love cats, I have cats myself, but your partner clearly stated that she did not want a cat. \n\nYou clearly knew what you were doing going behind her back. YOU are the reason the cat got sent back to the shelter. If you actually cared about the cat’s well-being you wouldn’t have put it through that. You only cared that it was unfair you don’t have a pet. \n\nIf you really want a cat consider living separately from your SO.\n\nEdit: YTA in this situation", "YTA. If cats were a deal breaker for winter if you, getting a cat violated that agreement. You chose to be with a woman who does not want cats. She was upfront & honest. You sound petty “she has a pet”.. what? You thought, “I’ll get a cat & she won’t really do anything”. You found out…. Also, did you ever stop to think about why she kept her dog somewhere else while your cat was alive? Perhaps the dog had horrible life experiences with cats. You need to stop being petty and realize how to have adult conversations.", "ESH\n\nYou can't just bring a cat if other people are uncomfortable with it (even worse since SO has stated previously that she didn't want cats)\n\nSophia can't just get rid of the cat and send it to a shelter just because she doesn't like it. Why did she even get incredibly mad? She could have searched for a reasonable solution.\n\n&#x200B;\n\nThe worst thing is that all this mess is dragging the two animals with it...", "INFO: Why did you decide to pursue a relationship with someone who hates cats, if having a pet cat was extremely important to you?", "ESH. seems like neither of you can set a proper boundary and it’s just making both of you upset. each of you counteracting the others requests isn’t going to magically help you come to an agreement it’s just going to make you both miserable.", "ESH. You shouldn't bring an animal into a home you and your SO share without asking, you were wrong, you need to communicate with them first. But going ballistic on someone and sending a cat back to the shelter because a dog can't handle it? Sounds like your SO never liked cats and was glad when yours passed away, and isn't fine with another one. The dog should just get over it, the cat did nothing. If I had to say, slightly NTA in your favor. You didn't do much wrong, your SO did way too much.", "Just seperate. ESH.", "ESH \n\nIf cats were a deal breaker then consider the deal broken on both sides. You guys are a bad couple", "You're  seriously  asking if you're an asshole?\n\nYou bring home a cat without SO's ok.\nYou know her dog doesn't  like cats.\n\nIt's unfair she has a pet but you don't...are you 5 ??\n\nNow your  having a tantrum by giving her the silent treatment \n\nGrow up   YTA", "YTA for:\n\n1. Getting a pet without consent from your partner\n2. Intentionally buying a pet that you know your partner doesn't like\n3. Introducing that pet to your partner's dog, which you know doesn't react well to cats\n4. Giving your partner the silent treatment and refusing to communicate to come to a compromise\n\nYou are a terrible communicator and an inconsiderate partner, and it will continue to chip away at your relationship if you don't step up.", "ESH  Did you all miss that they have twins together? So it isn’t just a question of breaking up with the so or asking her to leave with her dog. They have to coparent together and this is how he communicates and how she responds", "What do you mean NTA. They have a dog in the house already that doesn't get along with cats. If one person wants a cat and the other doesn't, then you don't get a cat. It sucks but that's the way the cookie crumbles. OP YTA.", "Yeah, it was a pretty AH to just bring in a cat without both parties consenting to it, jackass.", "It’s not a great idea to force animals into a living situation together. Especially since both animals are adults.", "Your saying to send the mother of his children to a shelter after she had told him she wouldn’t have moved in with him if he had his cat. She’s made it pretty clear she doesn’t like cats but he okay with stressing the dog out but doesn’t want to stress the cat that only he wanted when he brought it home without even consulting her", "He says they have twins together, so too late.", "this", "They have twins already.", "The dog is uncomfortable around cats. I think it has anxiety so I don’t know if it would get over it.", "I respectfully disagree.  There was an elderly cat in the household FIRST.  Then the dog was brought in without apparent complaints by the OP.  (OP, confirm!)  If the OP is an ailurophile then he should have the right to have a cat.  Maybe it will be a little awkward, at least at first, to keep them separated.  \n\nAs my outside door mat pontificates: \"A house without a cat is not a home.\"", "I'm a major cat enthusiast. I will white knight for them. He needs to find a cat lady.", "the elder cat passed away before they brought the dog in.", "So you want him to leave his girlfriend with their children just so he can find a someone else who likes cats??", "I love cats. I will and have done ridiculous things for cats. But I don't treat people I supposedly love like shit because of cats.", "I can't imagine the types of conflict these parents are going to have when raising these kids.", "Sure.", "Her love was conditional therefore they are incompatible. She doesn't care about his happiness. She cares more about how the dog feels.\n\nBoom. Mic drop.", "Yes but it’s for OP and his partner to sort out but just saying someone should leave over a cat is a bit extreme when they had already discussed cats in the past and he knew she didn’t like them but also that the dog can’t be around cats. \n\nETA: he also chose to have kids with her knowing how she felt", "That’s a bit extreme don’t you think?", "It sounds like there was an agreement that she would wait to bring her dog with the understanding your cat was in poor health. She waited so her dog would have a good home situation where it wasn’t constantly stressed. Then you decided without getting agreement from the person you live with to get a cat. YTA: pets who are adopted into homes where one person doesn’t want it are more likely to be rehomed. Even your partner aside, do you have so little regard for animals you’d bring a cat in a home where both pets would be very stressed and one of the humans didn’t want it?", "YTA. You can’t get a pet without consulting with your partner/the rest of your household. You knew she wouldn’t be okay with it because she doesn’t like cats and her dog is afraid of cats, so you went behind her back. She told you she would get rid of it if you didn’t and you didn’t believe her? Even though you knew she was not okay with you getting a cat? And then you have the nerve to complain that bringing it back to the shelter would stress it out, even though you knew bringing the cat into your house would stress out her dog but you did it anyway? And you give her the silent treatment like a child for a situation that was entirely your doing? And you’re seriously asking if you’re in the wrong?", "BREAK UP!!!! I hope your kids don’t have to grow up with this nonsense. You both will hopefully be better people/parents if you are separated.", "You two are not compatiable.", "YTA, what did you expect suddenly bringing in this animal? Like you said if your previous cat had been young she'd have broken up, she would've left. Now that she's all set and can't leave easily you get a cat?\n\n>it wouldn’t have happened had I not got the cat in the first place\n\nI agree with her. \n\nPlus Oli didn't have a huge overreaction, Oli is a DOG. Has he had any communication with cats before? Lived with them? Why tf would you suddenly bring a cat home to a dog? After she's said no, too?\n\nSure, her sending cat back wasn't nice but what she said. She warned you. Why didn't you believe her lol, \"oh she's not serious\"? You're petty in this.", "YTA. A pet, any pet, is a \"two yes-es required\" kind of thing. You do not, you cannot, bring home a pet without your SO's permission. You both need to be on board for that decision; she clearly isn't. And you knew her dog couldn't be around cats, yet brought one home anyway, and you call it a \"huge overreaction\" when he, very understandably, hid?\n\nThere is no world in which your relationship with a cat you'd had for literally one day is even remotely comparable with your SO's dog. The only one with a \"huge overreaction\" here is you, OP.", "YTA you should have discussed it and not try to loophole your SO. The cat wouldn't have needed to be returned if you didn't go behind her back in the first place", "YTA.... you cant bring home a cat after she expressed that she is dead set against it. If having a cat means that much to you, breakup with her, movve out, and get yourself a cat.", "YTA for giving the silent treatment that’s emotional abuse and simply never ok.", "YTA. I totally disagree with the ESH, and I love cats. You knew her condition for being with you and accepted it. You have kids. There is a dog that cannot live with the cat. You sprung a pet on her against her express wishes.\n\nPets, children, and other large life changes require two Yes answers. One No blocks it. If you can't live without a cat, you need to discuss it with her and figure out how to divide your lives. Then you get a cat in your own space. You're a huge AH.", "YTA to the cat for trying to make it live with someone who hates cats.", "YTA as much as I love cats you needed to discuss this with your partner especially since her dog hates cats. Next time have a conversation about your feelings and if her dog passes then it's time for the pet discussion. But if having a cat is that important to you then you need to decide if this relationship is going to work. Yes you have kids but staying together when you both can't stand each other isn't good for them either.", "ESH\n\nYou two suck at communication big time. Make a point that you understand her distaste for cats, but you want a cat for your own needs and happiness. But also expect to take care of that cat basically by yourself for the rest of its life. Same goes for her dog, she gets to keep it, but she cares for it herself.\n\nYOU suck for getting a cat without previous discussion, which then \"forces her hand\" to get you to get rid of it, and when you didnt, you risked that cat being taken to a place you wouldnt know of. That is 100% on both of you, but mainly you because you cant expect her to just accept it living there without discussion and agreement.\n\nYou two are highly incompatible, and while I understand you two have twins together... this relationship is not healthy at all. Resentment is only going to build from here, so you guys better start marriage counseling NOW, or divorce/breakup and get half/half custody.", "YTA", "YTA. I’m assuming you agreed to her dog moving in and she warned you? And you have babies! You don’t bring a strange cat into a house with babies, Jesus Christ", "YTA for bringing home a pet without discussing it with your partner AND knowing she hates cats. \n\nShe is the AH for getting rid of the cat without discussing it with you. \n\nYou don't seem well matched.", "Yes YTA. If you knew you would want to own cats, you should never have started a serious relationship with someone who can’t stand cats. Now you’ve brought another living being into a home with a woman who will hate them and a dog who is seemingly terrified of them. How much can you actually love cats if you put your wants over their needs?", "Having a pet should always be something everyone in the household agrees to. I'm also a huge cat lover, but when my ex gf brought a kitten home without discussing it with me first, I was pissed. We already had two, which was plenty of responsibility, and I didn't think it was a good idea to add any more. \n\nWhat that action showed me is that she felt comfortable making decisions, that would affect both of us, without my input. It's incredibly disrespectful to your partner, who, I should add, already made a compromise for you. She agreed to let your elderly cat live with the two of you despite her negative feelings toward cats.\n\nIs it fair that she has the pet she wants, but you don't? No, it's not fair. Tough. That's how it goes when you get into a romantic relationship. You're not always going to get what you want. Trying to get your way through dishonest means is never the answer. You're only going to cause more conflict than if you had continued to argue over the original disagreement. \n\nMy opinion: YTA", "Bringing home a pet that was not discussed or agreed to into a household is NEVER acceptable.  So YTA.", "YTA, you knew her feelings, she was exceedingly clear that she wanted NO cats, you stayed with her, moved in together knowing she says No cats period. Then you think it’s ok to bring in a cat? WTF are you smoking? Did you think this was a “Well, she doesn’t really know cats” or “I’ll ask forgiveness later” situation? \n\nIf you want cats, don’t be with her. If you want to be with her then don’t have cats. It is not hard at all to understand, and her having her pet doesn’t give you permission to bring a cat into the house. YOU caused the situation, YOU gave the cat a false impression of having a forever home, YOU caused your SO undue stress and anxiety by bringing the cat into HER home(it may be yours but it’s hers too), and YOU caused the cat stress from having to return the shelter.\n\nYour SO was clear, and by staying with her you agreed to her conditions expressed re: no cats other than your current, period. You broke that agreement and are now being pissy about not having gotten your way. YTA, and now tell me where that poor cat is so I can adopt it. (Kidding, I can’t deal with another cat right now. But if I could I would in a heartbeat)", "YTA.\n\nListen, I love both dogs and cats. But you permanently started a life with someone who hates cats. That on *you*, not her.\n\nVolunteer at a kitteh shelter for your fix; they always need help!", "YTA\n\nCats are not objects. You should have NEVER brought one home without her also wanting a cat. Do not take your toxic bullshit out on any animal again.\n\nShe doesn’t like cats which means you can NEVER have a cat. It’s not about her dog, it’s not about her being spiteful. You chose to live together knowing she didn’t like cats - which makes all of this a you problem not a her problem.\n\nThe silent treatment is abusive, cut that shit out too.", "YTA, your partner made it clear multiple times how much she hates cats (can't relate) and doesn't want to share her home with one. You were selfish and irresponsible to her and also to the cat, for not making sure it was ok before getting it and exposing it to this ordeal. \n\nSo right now you're not a good partner or a good pet owner. Maybe she will change her mind in the future, but most probably not, so if you love her you'll have to make peace with the fact that you will never have a cat.", "YTA. You do not get a pet without discussing it with your partner and with everyone who lives in the home first.", "YTA\n\nBut only because you haven't broken up with her yet. You deserve better, go find it.", "YTA \n\n\nWhat's the point in discussing a big change with your girlfriend if you're then going to go behind her back and completely disregard her opinion?", "ESH but mainly you. Its clearly a deal breaker for you to not have a cat. The moment you learned that she HATED CATS and her dog was scared of them, the relationship should have ended right there. But no, you decided to think with your lower half i guess to stay with her and bring a cat into an environment where it would have been unwelcome and lower the QOL of the dog already living there. Break up and maybe don't do something like this again.", "Never trust people who don’t like cats", "YTA, but go get your cat quick if it's  kill shelter. Right now, you should be able to get him back when you explain that your ex brought him it. At least I hope she's your ex because there's no way you can move on from this. You're also completely incompatible. That being said, you should have talked to your GF first and you told her this was a deal breaker, since it obviously is. You were an asshole for not doing that. Either you had to have her agreement or choose to break up so you could have a pet. Important thing, you can't just throw animals together like that. You have to keep them separated and it can take up to 6 months of slow, safe introduction to get them to be comfortable. They can become good friends, but it can also be a slow process. With one of my cats, it took a year.  \nEdit: missed the part about the twins. Well shit. That's not good.... I...uh...wow.", "You're arguing over pets to the point where a cat has suffered unnecessarily, and you have twins together?\n\nESH: except your twins, the dog, and the poor cat.", "ESH and you two are having kids together?", "ESH - Why are you two even together?  Don't say for the twins.  Y'all are going to make them just as miserable as you and your animals are.", "Dear god, you two have twins together?! You're far too immature to communicate properly about pets, but you have *kids*? Damn.\n\nESH. You're clearly incompatible and neither of you wants to see it. First of all, break up. Second of all, try to do some growing up, you have entire human beings to raise somehow...", "ESH. The silent treatment is abusive and childish. Whoever taught you that you could do that as a grown man was wrong. \n\nShe should not have returned the cat without consulting you.\n\nFrankly, you both seem terrible at communication. Work on that.", "You two are way too immature to be together. You don't want a dog, she doesn't want a cat and you're both too stubborn to compromise. Call it quits before you get more children involved.\n\nESH", "ESH. You shouldn't have brought in a cat when she said she didn't want one in the house. And Sophia sounds hateful.\n\nYou would both be better off by breaking up. Then you can each have the pets you want.", "ESH you’re not compatible people and need to accept that", "ESH. Her for being so unilateral. You for doing something you knew she didn’t want. \n\nAnd btw the cat is likely dead, because animals turned in by their owners are the first ones put down when the shelter is too crowded.", "ESH - Getting a pet of any kind is an all-parties-involved decision. You should have gotten her to agree, although she doesn't sound like the type to do so.", "Yta\n\n\"it's unfair\" is not a good reason to go add a pet to the household without the consent of your partner. The dog was already there, and _you were told_ a cat would cause a problem. You thought, what? She was making that up? Now, maybe returning it to the shelter stressed it out. I believe moving it _from_ the shelter to a home that could not welcome it was more stressful. You're responsible for both things happening.\n\nStop living with this anti-cat woman and her anti-cat dog if you want one that badly. You can't have a cat there, that's it.", "ESH.\n\nYou two are way too incompatible to stay together, and terrible at communicating. Save your poor twins the trauma of hearing you fight constantly, and break up.", "ESH\n\nYTA because If cats were a deal breaker and you knew it from the start then you should never have moved her in and had kids with her. You also unilaterally decided to get a cat knowing how she would react and put the cat in a hostile environment for your own selfish desire.\n\nShe’s TA because she knew you were a cat person and stuck around knowing that one day this issue was going to come up again, and unilaterally decided to return the cat to the shelter and cause it even more stress.\n\nYou are not compatible with each other. And instead of figuring that out before you had kids, you had kids together and now they will also be collateral damage in this battle of the wills for who can have what pet.\n\nYou are both immature, childish, shellfish, and petty!\n\nBoth of yous need to grow up!", "I am going against the current here. NTA. Why? A relationship is a 2 way street, if you can't have a cat she shouldn't have a dog either. However, you should have addressed this before going home with a cat, she is way out of her limits my returning YOUR cat. I am dad by your twins but there's no way that relationship has a future", "ESH. You are both deeply incompatible and i pity the kids already. Break up.now so you can at least coparent well instead of building resentment.", "ESH, you are not on the same page about pets and have no respect for each other.", "You are both insane. I don't understand today's pet culture. ESH but you started it and provoked your partner on purpose", "Damp her", "fellow catman here, dude run, that would wreck any trust", "NTA - She can have an annoying dog you have to put up with AND she got rid of your cat? Why did her procreate with her? You’re screwed now.", "Haven't read the whole thing. ESH.\n\nYour SO got rid of your pet, AH\n\nUsing the silent treatment as a punishment is childish and shows a lack of communication skills, AH\n\nCongrats you both suck", "NTA\n\nThis relationship was never going to work, and it seems like you're both pretty terrible to each other. Obviously, you should dump her. Dump her and get your cat back.", "NTA.   \nRun.", "I don’t know how to feel about this because you shouldn’t have gotten a cat without asking her and having a conversation about it. But I also think that people who have hatred toward cats or dogs is a massive red flag. Also returning the cat without asking, especially since it was an older cat, not just a kitten, it’s really really heartless.\n\nMaybe you both just suck?", "Why would you be with such a miserable cruel person? Why would you think you’d be compatible with someone that hates cats? Don’t put an innocent cat in such a dangerous situation again. You should leave her and her mutt behind.", "NTA.  Time to get rid of the gf.", "ESH. You two are obviously not compatible, and things probably should have never gotten this far. You should not have brought a cat into the family home without your partner being okay with it, doing this to the cat is so unfair and irresponsible (to the cat).\nYou both should be aware of how your behaviour affects your twins, they are going to be learning problem solving and conflict resolution from you, they are learning about relationships from you.", "NTA\n\nSHe claims \"it was Oli's home\" but literally no.\n\nShe can't claim the dog belongs but not a pet of your choosing.\n\nIt's either no pet does or both pets do.\n\nYou got the cat, you had the ownership of the cat and she went out of the way to get rid of your property, that's literally one of the shittiest things someone can do.\n\nI would dump her and get as far away from her as possible without being out of your twins' lives, this is a clearly toxic enviroment and the main cause of it is her based on the fact you respected her choice to bring a dog in after the passing of your cat and tried to encourage the dog to get along with the new cat.\n\nGet a new house and go back to the shelter to get one of the cats, the two of you are clearly not compatiable at all.", "I *love* cats. So as a cat mom, I wouldn’t date someone who hates cats. That’s my deal breaker. And I sure as hell wouldn’t move in with someone who hates cats because even if I hypothetically didn’t have one, I would want that option available down the line without someone being an asshole about it. \n\nWith that being said, ESH. You guys don’t seem compatible. I feel terrible for the cat who had been put back into the shelter 💔", "NTA and you should #1 bring the mutt ro the pound, #2 dump her, #3 get the cat back.\n\nFuck her and her mongrel.", "ESH. I'd be a bigger AH and re-home her dog though. Fairs fair. Then I'd break up with her.", "ESH. Honestly I don't think you two should be together. This should have been discussed before you moved in together, especially having kids.  What she did was wrong and I would be angry, but clearly her dog has some problems with cats. It sounds like he isn't the type that works well with other animals.  Yelling back and forth isn't solving anything. Your twins are learning that it's ok to accept unhealthy relationships like this. I doubt that's what you want.", "ESH. If you love cats, why would you be with an SO who hates them?  You had to know this was going to be an issue.  Furthermore, if the dog reacts badly to cats, then you CAN'T bring a cat into that environment, period.  It's not about what you want, it's about what's best for the dog and cat, respectively!  The dog doesn't have a choice about it's home environment, just like your kids don't have a choice. You don't bring unnecessary stress to a creature that can't tell you \"no\" out of your own selfishness.  If you want \"your own pet\", it has to be one both you and SO agree on, and that is compatible with the dog you already have.   \n\n\nYou both sound too immature to be in a relationship, let alone to be parents of twins. God help those poor children.", "NTA. Take the dog to the shelter. Fair is fair. Besides, you already have twins, so you don't need any other pets.", "ESH. Pets require everyone in the household to be on board.", "ESH, can’t trust people that don’t like both cats and dogs.", "Dump the girl, get the cat NTA", "NTA. I’m not kidding, I would end the relationship over this.", "NTA. Imso sorry this happened to you. It's unfair and your gf was well out of line. You should be allowed to have a cat if you want.", "Well, it seems like Sophia doesn't give a fuck about you! Congrats on letting a very controlling, unnegotiable person move in. This is your like life now so either suck it up or make other plans. \n\nESH\n\nedit to change vote after reading comments.", "ESH", "ESH. You love cats but she hates them? Sometimes I think people are so desperate to be in a relationship, they don't stop to think: are we compatible? Why would you bring home a cat, which she hates and you know the dog is uncomfortable with, without consulting her? A new pet is a big decision.\n\nAnd then all the above applies to her, too. Why is her dog more important than your cat? JFC. Get a hamster and call it a day. This was so petty and childish, I completely forgot you two have TWINS. Considering your young ages, I assume they are young, too. How about taking them to the park and investing this time fighting about what's already been settled in them?", "ESH", "Send the dog to a shelter", "ESH. \n\nYou bringing home a cat unilaterally, because it’s “unfair,” *(which is kinda bullshit, you knew she absolutely did not like cats, it seems you do not feel the same way about dogs).* makes you the ultimate asshole. You knew she didn’t want a cat. And I really don’t know why you were foolish enough to think bringing home a cat were force her into dealing with it. \n\nShe’s an asshole for taking the cat to a shelter. But significantly less so. You knew upfront she didn’t like cats. You accepted that when you got into this relationship. If you feel so strongly about cats, you shouldn’t have gotten with someone that dislikes them. \n\nAnd yes, you’re an asshole for giving her the silent treatment. \n\nI’m saying this as a reptile, and dog lover. I had 1 snake and 1 dog before I got into my relationship, and I made sure my partner was okay with both, and okay with me getting more. “I” (really we) now have two dogs, and plan on getting another snake, some frogs, or some lizards, soon. Reptiles are important to me, and **that’s why I refuse to be with anyone that hates them.** You should have never dated her if you knew she felt so strongly about cats.", "ESH you guys don't sound compatible. It doesn't sound like the dog can safely live with cats. The only compromise I can think of is that after the dog passes away you guys get a cat instead of another dog. Ultimately though, I don't see your relationship lasting.", "You’re both immature and don’t need to be in a relationship you clear,y don’t respect each other ESH", "ESH. Why are you two even together?", "You are obviously a cat person. Why are you with an obvious dog person who hates cats? Yeah, ESH applies because you shouldn't have gotten the cat without her agreement, and she traumatized the poor cat by taking it back to the shelter.", "She’s the AH.  When she goes out take her dog to the shelter like she did your cat.  Then tell her no pets for anyone.", "Remove her dog and give her the same treatment then show her the door.", "ESH - She’s not listening to you and being selfish, however the silent treatment is not cool, it’s actually a form of emotional abuse and manipulation, smarten up and don’t do this in future relationships.", "NTA. Your GF is being selfish and mean. Yes, cats and dogs take some time to get used to each other but it does happen. My miniature dachshund was scared of our kitty initially but now they are buddies! They just need time. I’m sorry about your kitty.", "NTA and you should dump your SO. Dogs and cats can coexist, but they need more than 5 minutes to adjust. You are not a compatible couple.", "Everyone is an asshole.  \n\nYour SO is an asshole for hating cats (hating any type of animal is always a huge red flag imo), getting to have a pet she wants but not allowing you to have one you want and returning a poor animal to a shelter without discussing it with you. She sounds like a controlling, mean person.\n\nYou're an asshole for continuing a relationship and having children with a person who has very different beliefs and desires when it comes to pets, which is obviously an important part of your life.  You're also an asshole for bringing an animal into a home with a person who \"hates\" that type of animal and told you they'd get rid of it.  The stress and anxiety that poor cat from the shelter went through is horrible.  I hope she actually took it back to the shelter and didn't hurt or dump it somewhere.  Same thing with your original cat, I hope it wasn't put down early due to pressure from her or from being old .\n\nNeither of you sound good at communicating, respecting each other or compromising.  If you didn't already have kids with her I'd recommend leaving as it doesn't sound at all like a healthy or happy relationship, or one that is going to last.", "So you're just not going to talk to the mother of your kids for how long...?", "Why in the fuck are people like you breeding?", "I think this goes beyond the animals. Yall are fighting like cats and dogs. Are you sure you're happy, OP?", "what a miserable life. how unfortunate", "Break up.", "I would introduce your SO & Oli to their luggage & then change the locks.", "NTA, you deserve to be happy, and I would honestly do the same with her dog !", "Nah, break up with her and kick her the fuck out. I love cats and if someone give mine up?! That person would be deceased to me.\n\nEdit: NTA", "ESH.  Do you seriously have two children together?  Because you both (you especially) behave like petulant children with each other.", "Get rid of her dog.", "Of course YTA. You can’t force her to live with a cat. She said no and you ignored her.", "ESH, but you in particular. You should not be allowed pets, or children, or a partner.", "Why are you with this raving biatch? Move out and get a kitty!", "NTA. Excuse me but why the fuck are you still with that woman? She's a monster.", "She’s awful", "Honestly I would break up", "NTA. I don’t understand why you’re giving her the silent treatment instead of the boot. Why would you be with anybody who could be so cruel and lacking in compassion, not to mention controlling? Get away from her, and take the kids with you.", "ESH. You cannot just bring home an animal when your partner has no say in it. It's a two yes situation. That's utterly baffling behavior. Simultaneously, your partner getting rid of your cat is lunatic behavior.\n\nAll that being said - she has a dachshund. Why, why, *why* would you bring a cat into the house with that dog and just throw them together??? One of my neighbors has 3 dachshunds and they ATE his cat. Those dogs were bred to hunt *badgers*. You put a perfectly innocent cat in harm's way.\n\nStop it. Just stop. The both of you.", "I frankly do not understand ESH comments, **YTA**. The entire reason that you got this cat behind her back as opposed to talking to her was because you knew she would say no, and are now giving her the silent treatment because she didn't roll over and let you do whatever you want? Extremely manipulative and horrible communication. Not to mention a dog that is afraid can be vicious, and you have twins with this woman?! I struggle to see this relationship lasting if you continue to act like this.", "ESH you are both acting like children playing house.  \"I got tired of it yesterday because it’s unfair how she has a pet but I can get one.\"  This legit sounds like something my kids would say.  This is why we had toads and fish and cats and iguanas because \"everyone had to have one of their own.\"  But one thing they couldn't have, is BABIES.  You both need to grow up.  You got a free pass straight to adulthood, do not pass go.  do not collect $200.  This is what you are both doing now.", "NTA. \n\nCats are absolutely everything. \n\nIf she’s allowed to her have pesky dog, you should be able to have a cat, in which you love dearly. \n\nIt sounds like you’re not compatible and maybe should breakup up. \n\nTry coparenting.", "You love cats more than your twins…? Ok bro\n\nYTA", "YTA pets are always a joint decision, it's not a two nos situation but a one yes one no situation, so long as there's one no you do not get a pet without your partner's consent.", "ESH\n\nyou really thought it would be a great idea to get a cat even tho you live with:\n\na) a person that doesn’t like cats\nb) dog that doesn’t like them either and gets really stressed and reactive about it \nc) two kids \n\nso not only you disturbed the dogs health, but the poor cats too, not only because he could have gotten hurt but because he also could get really stressed about the dog’s response\n\nworse, you knew the person you live with doesn’t like them and there was a risk of them unleashing it at the cat, and the poor animal got adopted just to get returned the next day, what is also really stressful and potentially traumatizing \n\nall this stress combined could have been harmful to your kids also\n\nthe poor animals are the victims here, and you two make a terrible and immature couple", "Not only pursue a relationship, but have kids with them!", "They have twins. Having kids solves everything, right? 🙄", "These unilateral decisions are a big deal. No healthy couple forces their \"law\" on each other. Big yikes all around", "What did the wife do to deserve because called an AH? Returning an animal brought to your house without your knowledge is the only sane thing to do. Her dog is uncomfortable with cats and OP knew it. \n\nHe should never have stayed with her if having a cat was a deal breaker. His partner doesn't seem to have lied to him or led him on regarding the possibility to ever get a cat with her. That's a full YTA.", "The deal should have been broken before they moved in and had kids. Op agreed to start a life together knowing they wouldn't have a cat, now he thinks he has leverage to trample over that agreement, he is the only one breaking the deal here. Saying this as a cat lover op is an ah purely for putting a cat in that situation.", "What did the partner do you to break any deal though. She was always honest about not wanting a cat. And she already has a dog who is unhappy with cats. OP is a full AH for putting the poor cat and dog through this. He shouldn't have stayed and have kids with that woman if cats were so important to him.", "How was she supposed to respond? Bringing back a cat that had been brought without her knowledge to her house, upsetting her dog, was the only thing to do. It's completely OP's fault for putting the poor cat through this.", "Happy cake day", ">Why did you continue a relationship with her if you knew she hated cats and you love them? Did you think you could change her mind?\n\nThey have kids.", "Did everyone else miss how he casually throws in that they have twins? Did I have a stroke reading that or was that real life? I refuse to believe two people with kids would be this petty and disrespectful over animals without some kind of underlying issue at play.", "How is she supposed to compromise exactly? Either you have a cat or you don't. She was always very clear about not wanting cats. \n\nAs for returning it, what was she supposed to do? Keep it and suck it up? It's entirely OP's fault that the poor kitty was put through this whole thing.", "She’s not the asshole for getting rid of the cat.", "I disagree with what you're saying about her. She's not unwilling to compromise; she had been compromising all along by prioritising OP's pet over her own. When it was \"her turn\" to have her pet in their home, OP immediately made a major, life defining decision on both their behalfs, a decision he knew she didn't agree with, without consulting her.\n\nYes, she did get rid of the cat - but that is specifically because of OP's unwillingness to compromise, not hers.", "she's not an asshole for returning a cat she never consented to having in her house in the first place. she UNDERSTANDABLY refused to get one because of the fact that her dog is terrified of them and she was looking out for her dog. it is entirely OPs fault for bringing one into the house in the first place even though she made it clear that they weren't allowed in the house at all.", "Also she hates cats, that’s a giant red flag. Never met a person who hates cats that’s a good person.", "This seems to me a sensible take on the situation. It addresses all the facts, unlike other commenters. It espouses the welfare of the animals and the children. It points out an issue with the central relationship.\n\nUnfortunately, OP has breeched trust with the mother of his children, is directly responsible for traumatizing a little dog, and caused some further upset in a shelter cat's life.\n\nYou got some manning up to do, my dude, some true responsibility and leadership to develop.\n\nCount your blessings where you are in your life.\nGo cuddle your twins. \nSay you're sorry to the woman you protect and support.\nGet marital counseling that works for both of you. Yes, shop around and stick, or you'll lose it all.", "Thank you! He fully admits that they *wouldn’t be together* if she was forced to live with a cat, but she’s the asshole? Come on people.", "Also since when are cats the only pet to exist, OP could’ve had a discussion about getting something different but nope", "SO needs to get over herself as well. If OP puts up with her dog she could at least have indulged him at some point and at least *tried* to figure out how to incorporate the cat effectively. That would also mean she could put in some work and train her dog. It’s work but entirely doable in most cases. A big part of any relationship is also compromise. OP may have acted selfishly but I wouldn’t be surprised if his SO is controlling and uncooperative in other aspects of their lives too.", "Overreaction implies the dog should have thought through his response first lol. Dogs can't overreact unless they're K9 or service animals trained to react a certain way and their instinct causes them to break training. If an animal is reacting poorly, the owner is at fault. I'm not even an expert and even I know this isn't how you introduce new animals to each other.", "The cat will be stressed out by the dog too. Pet introductions need to be done slowly over time, not just throw them together and hope they get along.", "As a cat lover myself I think op is fully yta. It sucks that so is this against cats, but she set that boundary before they were together, if this is a difference so irreconcilable that op will brute force bringing a cat into the home and act like a child when, surprise, the so is unhappy about it, then op should have broken things off then and there. But op was apparently fine with not having a cat and starting a life, including kids, with this woman. That is not her fault at all. \n\nTaking a cat back to the shelter sounds cruel but the fact is it only lived in that house for a day, it's like like it settled in and then was ripped from its home. A place where one of your main carers hates you and a dog with anxiety is constantly going nuts at your presence is not a healthy forever home for a cat, not to mention could become dangerous for the children. Even chill cats can become violent under long term stress, and it's so much harder to get them adopted once they've been taught an extreme aversion to kids or dogs. For some cats all it takes is one toddler tail pull to completely reverse their personality. Bringing the cat back to the shelter was a kindness for everyone but op. This WAS the most reasonable solution. Op was unreasonable for putting a living creature in that position like a bargaining chip.\n\nMeanwhile OP broke a promise they made when moving in together (spoken or unspoken), and is now throwing a hissy fit that he can't trample over those explicitly stated boundaries. Op can have that cat when so dumps him.", "I disagree specifically because she was very up front about this and communicated it clearly from the very start. He chose to assume he could change her mind despite her clear communication just by forcing a cat on the family without her consent.", "The cat was in a shelter to begin with, and while I feel bad for it, it is better off there than in ops care. I have seen too many lovely cats become basically unadoptable after being subjected to that kind of stress. Any home does not equal good home.\n\nOp agreed to partner and have kids with this woman at the cost of not having cats in the future. He saddled her with kids and thought that was enough leverage to go against her wishes and bring a cat into their mess. Yes, that poor kitty being subjected to ops childish game. But your sympathy is misdirected if you want an animal to be put in that situation, where one of the carers hates it, a dog with anxiety (according to op) is constantly freaking out at its presence, and there's two young kids to top it off. It just takes one tail pull to completely change a cats personality, let alone the prolonged stress, and if you send an adult cat back to the shelter after it has learned to defend itself by scratching a child, you might as well be sending it for execution.", "They're supposed to be partners. She should have discussed it with him and insisting that he accept her dog but being nuclear about having cats around isn't a good take either. They're both handling this poorly and should just break up because they're not compatible.", "Yeah, I originally agreed with the first commenter but I think this is YTA. They have (presumably, baby) TWINS as well as a dog who doesn’t like cats, and he brought a whole other animal into the house without any discussion, warning or planning. If he’s this impulsive and thoughtless with the life of a whole animal, I can only imagine what kind of partner or parent he is. Was he going to be the one to take care of it? It sounds like he works during the day. The only responsible thing was to rehome the cat immediately.\n\nYTA and a big baby for the ‘but it’s not FAIR’ business. You’re a father, grow up.", "As both a cat and dog mom over the years, I completely agree. That cat should NEVER have come into the house!", "OP was clueless no doubt but at the same time compromise is key in any relationship, his SO could’ve at least tried to get on with the cat, dogs can also be trained, it just takes work. Furthermore how’s his SO going to react in the future if ever she has to potentially compromise on something much more serious than a cat?", "I don’t think she’s an AH  for bringing the cat back. The OP is the major one for getting a cat without discussing it further and everyone agreeing. However, for her to call it a bastard cat and not even discuss any other options for what he could do with the cat short of bringing it back for the shelter makes her one as well. But much less of one. It will always at least often take cats and dogs bit of time to get told like each other, and if she was on board, they certainly could’ve taken steps to help them get along. But I understand she was not on board and the OP had no right to get a cat without her permission.", "I was talking pre-kids", ">Did everyone else miss how he casually throws in that they have twins?\n\nThere are people who should have kids, and people who have kids. The overlap is uncomfortably lower than it should be.", "Pray for these kids", "Want to know the worst part? Take OP and SO here, and multiply that by.... probably 1 billion at this point. There are a ton of people like them, and are equally bad parents (believe it or not).", "I did wonder where the hell she found time to get rid of the cat.\n\nBut the underlying issue could actually be the twins. Stress and lack of sleep makes a lot of people stupid.", "She could’ve gotten rid of her dog and made it a no animal household. That’s really the only correct compromise for both of them.\n\nI said he was TA for getting the cat.", "I ditched a guy I was dating when the first time he came to my place my cat hissed at him. He did not normally hiss at anyone.", "I'm not a dog person, but I'm still on SO'S side - OP didn't discuss getting a cat, or determine what extra workload it would add to the household. SO would need to organise training for the dog, assuming shes the primary caregiver to their kids, she'd have to spend time cat-proofing the house and watching the cat around the toddlers - either the stressed dog or stressed cat will likely attack one of the kids. An animal, much like a baby is a two yes only option.", "So why would you force the dog to have anxiety and the cat to have to deal with an anxious dog? How was this fair to the cat at all?", "YTA.\n\n>Oli had a huge overreaction and hid.\n\nThat's not an overreaction. That's the expected response from an animal with a *known* fear response. Why would you force this uncomfortable situation on a pet in your home? Do you not care about his needs being met too? That's like saying \"my SO's dog has a fear of loud noises, but I really like Heavy Metal music and miss my subwoofers. I figured he'd just get over it.\"\n\nJust because Oli's circumstance is inconvenient to you doesn't mean it'll magically go away if you do w/e you want anyway. \n\n>I was upset and asked her what she did with my cat. She said she returned it to the shelter. I yelled that returning it to a shelter was stressing it out. She said she didn’t give a fuck and that it wouldn’t have happened had I not got the cat in the first place.\n\nShe's 100% right. Even if she was shitty about it.\n\nYOU bringing the cat home, without a guarantee of safety and acceptance, ultimately are responsible for it's stressful journey to your home and back to the shelter. Any stress that cat is feeling, and the frustration from the people involved is on *you* for not doing your due diligence  before bringing another living thing into your home.\n\nYour SO was looking out for the best interests of the animal already in her care. Her opinion of cats is suspect at best, but it doesn't change the fact that you already knew she didn't like cats, didn't want one, and that you would be forcing the situation. You've even already admitted to knowing this was a selfish decision.\n\nThe silent treatment you're giving her is childish at best, a new pet in the home is a huge decision and requires a serious discussion with all parties affected by and responsible for new pet.\n\nAt the very least while Oli is a part of your home, You have to accept the fact that you can't have a cat. Look at different pet options, or let it go.\n\nI hope you two are better at discussing parenting decisions, for the sake of your kids.\n\nedit: formatting", "Ok. I still think they should break up instead of raising their kids in this toxic household.", "I agree with the bringing the cat home without talking to her was AH move. However the part of the house being Oli's only is a very ah reaction too", "He chose to hook up with someone who hates cats. He is the one that broke the verbal contract, not her.", "No, she literally has the right to hate cats and refuse to have one in her house. Especially if they make her dog upset. She was upfront about this when they began dating. OP should have broken up then. She expressed her boundaries and he decided to stay with her and disregard them.", "His S/O needs to grow up too. Says just as much about her if she’s unwilling to compromise in any way and she just flat out gets rid of something the second she doesn’t like it.", "But it’s not fair. Why should she get the only day in what animals are in the house? Because you can guarantee she wouldn’t allow him a cat even if her dog passed.", "They have children together. It’s already more serious. Compromise without communication isn’t a compromise. Dude just brought home a cat.", "However, it's not fair at all for her to have pets and say no to OP, also she only got together with OP bc his cat was dying, really tells you about some ppl.\n\nESH", "Fair question and I'd love to see his response. Wondering if they got pregnant super quick. Not that it's a good reason.", "Also I feel like the kind of guy to do this isn't the kind to communicate well or divide responsibilities equally.", "Getting rid of an established pet that OP never said he had a problem with other than \"it's not fair!!!111” is not a compromise. The dog is her family and deserves happiness too. If never having a cat was going to be a deal breaker, it sounds like she never would have moved in or been with him. OP, YTA.", "Ooooor... maybe they could be a pair of grown-ups and try some couple's counselling. Arguing like this over effing pets and risking their relationship over it is beyond pathetic and immature.", "You've misquoted - specifically per OP \"this home was Oli’s home not whatever cat I bring in\" aka they are both aware the family dog is uncomfortable around cats yet he deliberately and knowingly brought in cat thereby making multiple existing family members (OP's partner and the family dog) extremely uncomfortable.\n\nWhen bringing new family members into the home it needs to be done in a way that doesn't harm the existing family members residing there.", "You are white knighting for an abusive guy to get a cat. Cats aren’t objects, they belong in a home where someone did not get one impulsively out of spite over things he openly agreed to years before.", "He knew a cat would be a dealbreaker for her and the cat was gone when the dog moved in thats why he moved in", "He doesn't have the right to have a cat and also a partner who hates cats. Poor kitty is better off finding a good home than with OP who will make it live with someone who hates it. OP is not a friend to cats here.", "Wierd crazy cat lady perspective😅", "He doesn't have that right if he lives with someone who is not, well, ailurophile, just because he loves cats. It's a joint decision at that point because they live together. He doesn't live alone.", ">I had a cat when we started dating\n\nShe chose to hook up with someone who *owned* a cat even though it's apparently something she's willing to take nuclear action over. \n\nESH.", "Does she literally have the right? You assumed they’re married, but OP refers to her as his SO, not his wife. If they’re not legally married or in a partnership, then she stole her roommate’s cat.\n\nRegardless, he literally has the right to love cats and have one in his house, even if she did have the right to remove it. They both also have the right to take a shit on the kitchen floor and refuse to clean it up, but having the right to do something doesn’t mean you’re not an asshole for doing it", "~Having the right~ doesn't actually equate to not being an asshole. It's an asshole move to not even discuss things with your partner (and this goes both ways, which is why ESH).", "So, she’s allowed to have a pet she loves to death, but he’s not? This is what gets me. She’s being very selfish in this case. It seems it’s her way or the high way. If she truly loved him, she’d find a compromise on the cat issue. She very clearly values the dog more than him (which is her prerogative) but she’s still denying him something that brings him joy. Nowhere did he say he expected her to help care for it.", "He should not have brought it home to begin with. Pets are two yeses and one no for a marriage or partnership, and breaking that rule of thumb can lead to significant stress.\n\nI love cats, but my husband bringing one home caused significant distress in our home because we had already agreed no more cats until our oldest current cat passes. She is stressed out by other cats and she’s elderly. But he made it clear he intended to keep the cat, which resulted in lots of literal catfights and some injuries to our cats. Now our eldest cat lives separated from the rest of the house and it’s not fair to her at all, but she’s the one who has anxiety.\n\nI was mad for AWHILE and he knew he should not have brought her home but he did and expected me just to deal with it. I did… but also it strained our relationship for a time and I feel like he regrets it.", "She didn't bring her dog in until his cat died, and he straight up said that she would not have stayed with him if he owned a young cat. She established her boundaries early in the relationship. He knew that the cat issue is a deal breaker, so he probably thought that he can sneak a new cat in and she would have to just put up with it since she's in too deep in the relationship. Low key manipulative.", "Getting a pet is a two yes, one no situation.\n\nOP agreed to the dog moving in years ago.\n\nThen he threw a childish fit about \"fairness\" and brought an unwanted animal into a home with four people and a dog.\n\nMy only hope is that this story is fake, as any decent shelter does home visits and won't let you impulse adopt like this.", "you’re likely right.", "Yeah I don’t see that happening given OP’s maturity level here", "And I agree with you in that he should have told her he was getting a cat and just not force it to her. However OP is in his right to want another pet", "Only because she knew that the cat was on its way out was she okay living with a cat - but she *also refused to bring her dog* while the cat was alive. She’s been crystal clear about her feelings - she would not live with a cat.", "Significant other is a relationship and they have kids together.", "Shelters don’t do home visits. They ain’t got the resources or time for that. Rescues sometimes do home visits, but since Covid have mostly moved to a FaceTime review of said space. At least in my state and the rescues out of state that I looked at last year.", "My biggest issue is not the fact that she’s still a selfish person. Which is why I think she sucks. He obviously sucks for going behind her back. But that whole thing is completely one sided. And they really should end it somehow or neither have a pet.", "Both are immature af", "Wanting a pet: yes everyone is entitled to want things\n\nGetting a pet in this circumstance: unfair to SO, family dog, and the cat he selected for his doomed experiment.", "He cares more about getting a new cat than he cares about the feelings of his partner, children, and the dog that already lives there. OP was an asshole to bring a cat into an environment with someone who hates cats. It was cruel to the cat and yet here you are defending it. Be a better white knight for cats.", "We didn’t have a home visit for our one dog.", "SO should be willing to accommodate OP wishes as OP did with her dog. It is a 2 way street. Her dog will eventually get used to the cat", "What do you bet he's got two babies he doesn't do anything for and is leaving out the fact that she can't handle more right now? I want the wife's side so bad. This reeks of \"only telling what makes me look good.\"", "Well she started the relationship under false pretenses so off to the dog pound with her.", "No, as I stated in another reply the wife is more worried about the dog's happiness than his. It's all downhill from there. Let her go be with the dog at the pound.", "\"Two way street\" only applies in certain circumstances\n\nOne-party no also applies in many circumstances\n\n\\- sex  \n\\- parenting  \n\\- housing  \n\\- people/animals entitled to live in the family home  \n\\- etc", "You can go get her story at the dog pound.", "What false pretenses? She never lied about not wanting a cat.", "That’s a bit messed up especially as he chose to be with her knowing:\n\n1 - she didn’t like cats and her dog couldn’t be around cats\n\n2 - let her and the dog move in with him after his elder cat had died \n\nI think that he should have thought things through if he is dead set on having a cat, so no one would get hurt but now he also needs to think about the children he has had with his partner because this also effects them most importantly.", "It does not really. It's a 2 way street it just depends if both people in the relationship are willing to cross either direction. How is parenting a one party thing?", "The relationship began under false pretenses. If she had been honest about her plan of actions then he wouldn't have been baby trapped.", "For example the child going away to an over night camp - both parties have to agree to it, if on parent says no its a no. Same as traveling outside the province/state and especially country. If one parent says no its a no.", "He knew she didnt like cats at all before they had children, tell me how she’s baby trapped him???"]}