{"id": 21717, "submission_id": "14ulw8k", "title": "AITA for telling my boyfriend I am going to write my novel, whether he agrees with its content or not?", "selftext": "My boyfriend and I have been dating for a short period of time. (Approximately 6 months). when we met, I told him I am a part time author. I’ve always had a passion for writing, and my ex encouraged me to keep up my hobby. Eventually, I got good enough to feel confident in publishing. Although I am not some big known writer like Stephen king, or Charles Dickens, I make a decent amount of money off it between writing, and my full time job. \nI am currently 100 pages into my newest book, and my bf asked to see a preview. I allowed it and he said there is way too much sex involved. I reminded him the genre I write. (Romance) and he says I have so much talent, but doesn’t see why I need to put porn on paper. I brush this off as not everyone has a liking to romance novels for their own personal reason. \nA week goes by and he sees me working on my novel, and argued that I should change the plot to make it “better”. I told him in the nicest way possible I am not looking for feedback. He signed frustrated. I turn around in my chair and say “is there something you’d like to communicate to me?” And his reasoning left me speechless. He goes on to say, he doesn’t like how I am keeping up with this hobby all because my ex was nice enough to encourage it. He believes I secretly write my romance novels as him and I as the main characters and it’s my “perfect little fantasy world” where our relationship would have worked out. I told him how ridiculous he sounds, as this has always been my content, even in that relationship and reminded him that relationship has ended on mutual terms due to myself wanting children someday, and he being very adamant on not having children. (In none of my previous books, or current one have I made a plot where the main characters even have a baby). He is refusing to believe me and thinks it’s something I am choosing not to admit too, and won’t be satisfied until I change my entire book to the plot he has suggested. I told him no, and if this is going to be a problem for him, he needs to figure out if me writing romance is a deal breaker or not. He says my writing isn’t the problem, it’s what and “who” I’m writing about. I again argue, my books are fiction, and this is a passion of mine I finally put together for myself. I am fed up with the argument and told him if he feels insecure he can either talk to me about it with out projection, or deal with it himself. He argues back that I am not being empathetic on his feelings and I say “you’ll get my empathy when you realize my work, and personal life are separate.” Now he is choosing not to speak to me. So, AITA?\n\nTLDR; I write romance novels and my bf of 6 months says the genre is not within his comfort zone and thinks they’re all secretly about my ex who I’ve mutually broke up with due to the difference on how we felt about having children. He says I am not considering how he feels, to which I said I’ll consider how he feels when he realizes my work and personal romance life are different.", "created_utc": 1688867685, "permalink": "/r/AmItheAsshole/comments/14ulw8k/aita_for_telling_my_boyfriend_i_am_going_to_write/", "score": 482, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) defensive as this is something I do career wise and can’t possibly understand how someone can’t see work and personal romance in life differently \n\n2) not taking any suggestions to alter the book, hearing him out more on why this is uncomfortable and refusing to reason with him outside of the mindset “this is what I do for a job”\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. If a man is critical of one of your jobs and you've only out six months into the relationship, it's time to drop him.", "NTA and at least you only wasted 6 months on someone so insecure they need to compete with a fictional character and call it your ex. Good grief, woman, kick him to the curb and enjoy your writing without distraction. Now you've got some new ideas for antagonist characteristics to work with too.", "NTA\n\nI don't think he's going to believe you no matter what. The author in his head has made up a very unkind story about you and I'm not sure I'd stay with someone who chooses cruel thoughts without evidence. Maybe it should be a dealbreaker for you, too.", "NTA also pretend to write a novel about an author killing her boyfriend and getting away with it", "NTA. He sounds really insecure and jealous, imo. I have no idea why he would have an issue with writing romance novels. That’s a really cool job!", "I’ve written a couple of books myself. I tend toward the dark fantasy/horror genre, and there is no way in HELL that my personal life overlaps some of the shit I write. He just doesn’t seem to realize that art is INSPIRED by real life. It doesn’t literally catalog it.\n\nNTA", "NTA but dump this dude he is controlling and it will only get worse", "NTA. He's being ridiculous.", "NTA and I only read about 1/3 of your post. You need to get a new boyfriend — this one is not a keeper.", "nta - first off good for you writing those books and making money of it!  and 2nd you have only invested six mth into that relationship so he obviously has severe insecurity issues and doesnt see u make a decent living off of it.   its his issue not yours.", "NTA\n\nBf is indeed doing massive projection, and seems to be particularly insecure about your ex. That needs to be addressed, but for that, he has to recognize it... Which is unlikely to happen at the moment, seeing how adamant he is at putting the blame on you.\n\nAlso, even if your novel was about you and your ex... It is still a novel, a fiction. It's like a kink/sexual fantasy: not all of them are to be played out in reality, but it is still fine to fantasize about it.\n\nWhich gets me thinking... how do you think your bf would react if he learned you watch porn with male actors that have nothing to do with him physical/in appearance? Would he still try to blame you/try to control you?", "Keep on writing. You bring joy and agency to your readers. It’s a gift. This guy can give you nothing so good. You do not need his resentment, insecurity, and self righteous attempts at control.", "NTA. It's important to have a partner that supports you and wants the same things you do (hence the ending of your previous relationship). Clearly the guy you're dating believes that he has the right to interfere with your work and your passion. He does not. \n\nYou said you've been dating for just six months, and he's doing this? It's going to get worse if you stay, believe me. He'll start telling you where you can go, who you can see, etc. Cut this insecure child loose and save your time and energy for a real man who will add to your life, not take away from it.", "NTA and this is a hill to die on.  He is being this controlling after 6 months?  About fiction that you actually make part of your living on?\n\nAnyone who can actually write and get published deserves kudos, not the disrespect and BS he is giving you.  (I wouldn't even care if it WAS porn myself.  If my partner could make ANY money writing ANYTHING I'd be ecstatic).\n\nThere is no point in arguing.  Just tell him this is how it is and if he doesn't drop it IMMEDIATELY AND FOREVER you are done.\n\nPersonally I think if you go down this slippery slope you'll be barefoot and pregnant OR constantly arguing and likely abused.  This is so controlling.\n\nMyself I'd just drop him.", "NTA. I'm reminded of that Toby Flenderson quote:\n\n[Write your own damn novel](https://www.reddit.com/r/DunderMifflin/comments/ar3kuu/write_your_own_damn_novel/)", "Once he sees the money rolling into your bank account, he'll beg you to come back to him, and apologize for ever judging you.\n\nNTA.", "NTA. He is still bitching about this after a week. I wouldn't expect any improvement on his part. I am hoping for an improvement on your part (getting a better boyfriend).", "NTA.  I'm a writer (poet).  NO ONE gets to censor what I write.  Your bf is incredibly insecure if he thinks your novels are about your ex.  Your writing contributes to your financial success.  If you change the way you write, it could directly affect your financial independence.  Bf isn't worth the risk.", "Easy NTA.", "NTA and thank you for writing romance cause p**n doesn’t do it for me but romance absolutely does", "Nta - it's only 6 months and already he's being ridiculous. Break up now and find someone who understands fact vs fiction.", "NTA does he also believe that fiction mystery novels are also the author playing out their fantasy on paper? \n\nI don't usually make this recommendation but dump him for being a controlling piece of work.", "NTA\n\nHe's insecure and controlling and he doesn't understand how fiction works. You can do so much better.", "NTA. From a fellow romance author: throw the whole man out, then use his name as some cringey secondary character in your next book so it comes up whenever someone googles him.", "[deleted]", "N T A in the story, YTA for pretending to be a writer.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy boyfriend and I have been dating for a short period of time. (Approximately 6 months). when we met, I told him I am a part time author. I’ve always had a passion for writing, and my ex encouraged me to keep up my hobby. Eventually, I got good enough to feel confident in publishing. Although I am not some big known writer like Stephen king, or Charles Dickens, I make a decent amount of money off it between writing, and my full time job. \nI am currently 100 pages into my newest book, and my bf asked to see a preview. I allowed it and he said there is way too much sex involved. I reminded him the genre I write. (Romance) and he says I have so much talent, but doesn’t see why I need to put porn on paper. I brush this off as not everyone has a liking to romance novels for their own personal reason. \nA week goes by and he sees me working on my novel, and argued that I should change the plot to make it “better”. I told him in the nicest way possible I am not looking for feedback. He signed frustrated. I turn around in my chair and say “is there something you’d like to communicate to me?” And his reasoning left me speechless. He goes on to say, he doesn’t like how I am keeping up with this hobby all because my ex was nice enough to encourage it. He believes I secretly write my romance novels as him and I as the main characters and it’s my “perfect little fantasy world” where our relationship would have worked out. I told him how ridiculous he sounds, as this has always been my content, even in that relationship and reminded him that relationship has ended on mutual terms due to myself wanting children someday, and he being very adamant on not having children. (In none of my previous books, or current one have I made a plot where the main characters even have a baby). He is refusing to believe me and thinks it’s something I am choosing not to admit too, and won’t be satisfied until I change my entire book to the plot he has suggested. I told him no, and if this is going to be a problem for him, he needs to figure out if me writing romance is a deal breaker or not. He says my writing isn’t the problem, it’s what and “who” I’m writing about. I again argue, my books are fiction, and this is a passion of mine I finally put together for myself. I am fed up with the argument and told him if he feels insecure he can either talk to me about it with out projection, or deal with it himself. He argues back that I am not being empathetic on his feelings and I say “you’ll get my empathy when you realize my work, and personal life are separate.” Now he is choosing not to speak to me. So, AITA?\n\nTLDR; I write romance novels and my bf of 6 months says the genre is not within his comfort zone and thinks they’re all secretly about my ex who I’ve mutually broke up with due to the difference on how we felt about having children. He says I am not considering how he feels, to which I said I’ll consider how he feels when he realizes my work and personal romance life are different.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "[removed]", "NTA. He's sending you signals about which you really need to make some hard decisions. And those decisions don't pertain to your writing, the subject matter, or the genre. I used to write quite a bit, and I am thrilled for you that you make money with yours! Kudos!", "My SIL probably read your first lol", "NTA this man is an idiot who doesn't understand non-fiction and refusing to drop the bone, I'd dump him now to spare the headache cause he isn't getting it and instead attacking you due to his ridiculous insecurities.", "A part time author should know what paragraph breaks are", "NTA\nHe is not stable. Get out now.", "NTA - guurrrrllll who the fuck cares what your boyfriend of six months thinks. If he doesn’t like it he can go, do you and keep writing. Don’t change for no man especially after only 6 months", "NTA\nSounds like he isn't even worth it to be a book boyfriend", "NTA. Does he think all authors write based on their personal lives? Someone should alert Stephen King's friends and family!", "NTA\n\nThis person should be your ex boyfriend too. He likely has never read a quality romance novel, be they Regency or Modern or other. If who / what you write about is an issue, he needs to go. Cut your losses.\n\nMy ex-husband was supportive when I'd sign up for continuing education for my job or new skills training. He was also supportive (nay, aggressively pushy towards me doing it...) of my making homemade tortillas and salsa. Shall I never take a class again or make tortillas because an ex was supportive on that?", "NTA. To me this comes across as him trying to establish manipulation and control over you.", "Time to write yourself a new future, one without this controlling jerk with low self-esteem. Nta. Girl wtf", "Yes! Because he wouldn’t stop criticizing her work, lol!", "Good luck on ur books! It’s important to enjoy what you do! Those are also great genres! Keep it up (:", "Wait until you find out writing in character is different than writing on reddit where I am not paid to use grammar software, editing, and other tools to finalize my content. Although ur comment is unhelpful to the post, I hope you feel better saying something, since you needed to get that off ur chest", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "NTA.  Men don't fuck with my money.  I've made it very clear to any man I've dated that if they in any way, shape or form compromised my job, I would dump them so fast their head would spin.  What I do for my work is my business (and don't worry, my jobs are both legal and moral).  Don't come to my work.  Don't call my work.  Don't give me unsolicited career advice.", "NTA and make sure he doesn't have access to your computer. He sounds like the kind of guy who would delete your book. If you want to stay with him that is.", "NTA!\n\nThis man is trying to control you to assuage his own insecurities.  If you stay with him it'll never stop. 🚩🚩🚩🚩🚩🚩🚩🚩", "NTA..and your writing is not a “hobby.” He’s a disrespectful a** and he’s showing you who he is. I’d drop him, move on and keep writing. You can always acknowledge his “support” in your next book. 😂", "Hey, as a woman who is a member of the \"I don't watch porn, I read it like a lady\" squad, I thank you.\n\nAnd I hope I've read a couple of your books.  If not, you can freely message me a book title and I'll happily check it out LOL\n\nAs for your post, NTA and you need to dump this dude.  Right now.   He's got to many red flags showing and probably more waiting to show you", "NYA. Girl I see huge red flags all over the pace here.\nYou boyfriend is a control freak who cannot discriminate fact from fiction.", "NTA and why is he attempting to control what you write? So he is jealous and insecure about fictional people in your book and is projecting that into the real world and how you are pining for your ex?\n\nHe is way too immature for a real relationship with an adult woman. What puts it over the top is that you are published and therefore successful in your style of writing, so him not getting the way your genre is written is still his issue. Time to seriously reevaluate if him needing you to alter what you do is something you can live with.", "It is better to walk alone than w a fool", "NTA. Congrats on finding your passion and pursuing it! Writing books can be challenging and to be able to succeed in finishing a book is awesome! \n\nIf this was the plot of one of your romance novels what do you think your protagonist would do? They would probably realize this “partner” was not much of a supportive partner and they would find someone else than could help lift them up and encourage them. \n\nI wish you well and hope you realize this is not healthy from him and you deserve better! Good luck on your new book and I hope it’s extra spicy! 😆", "Time to write about an author whose lame ass bf tried to get her to give up her writing and she laughed him out of her life. \n\nNTA", "NTA and return the boyfriend. Also, kudos on being published!", "NTA and I would dump him. Don't let him dull your shine.", "6 months and he's throwing up all these red flags? Don't waste any more time on him. NTA.", "NTA this man is not very bright and thankfully not very good at manipulating people even though he’s obviously trying really hard. Just ghost him. The more you explain to him how ridiculous his behavior is, the more dangerous you might make him for his next target. Let’s keeps these kinds of dudes ignorant. It’s a public safety measure.", "Say goodbye to this guy. He's clearly too insecure about this, and his reasons continue to change. What else is he likely to try controlling in the future.", "NTA. Romance (and it’s spicy cousin) are legitimate genres. Your boyfriend should be your next ex.", "NTA. Dump him. He sucks. Your life is way better off without his dumb ass.", "It's absolutely bonkers to me how many time I see people in this sub in relationships with huge red flags showing that they should not be together, and all they're focused on is who the asshole of the moment is.", "One of my criteria for a keeper is unconditional acceptance of me as I am and am becoming. My guess is this isn't the only thing he's giving you grief about. Even if it is, his objections are not compatible with who you are.", "NTA omg…. He has issues and is definitely capable of being in a healthy relationship. He’s being jealous(?) and illogical", "Nta id break up", "Tell ‘em boy bye.", "Final Cut should be dumping the bf he sounds fairly imaginative but a terrible writer. Rip those bodices hun", "NTA. Make no mistake, he wants you to stop writing things he doesn’t approve of. That stuff about the ex is made-up bs intended to make you doubt yourself and feel like maybe you should comply.", "NTA but this relationship isn’t meant to be I’m sorry to say. Support means a lot and this guy isn’t giving it to you. You deserve more.", "NTA!!\n\nAnd dump him! He thinks he can control you and what you write? Like seriously??? You don’t need a scrub, send him on his way. \n\nLOL, I’d probably scare the poop out of him since I write crime meets urban fantasy — murder, monsters, mayhem.", "NTA, and as a frequent reader of romance novels, I'd like to thank you for your contributions and encourage you to continue! As for the bf, anyone acting like that only six months in is far too insecure to even consider keeping around", "DUMP", "He’s got jealousy issues. NTA", "You need to rethink this relationship. He's trying to control your self-expression and punishing you for creating what you want.", "NTA, this is unhinged.", "Keep writing and best of luck.  Dump the guy", "NTA I promise if you stay with this person you will regret it", "NTA.  Look at it this way.  Six months, still a honeymoon period of really good behaviors in a relationship.  And he is already trying to control you and gaslight you about what you are 'really' writing about.  It will get worse.", "NTA.\n\nIf you stay with this guy, he will do this with all your writing. \n\nI am glad you are doing something you enjoy, and it brings financial benefit to you. I can write well but it is not enjoyable to me. I admire and respect people who enjoy creating stories.", "NTA....and get a new BF. He's not going to change the way he thinks. Who need's that kind of grief ?", "NTA. Frankly he sounds immature, insecure, and paranoid.", "NTA. Drop the Tamlin and get a Rhysand, girlie. You do not yield.", "NTA. I'm an aspiring romance author. My husband proofreads my work when I write. Guess what he does? Skips the naughty parts and praises me and gives me ideas.\n\nETA: my husband jokingly tries to \"figure out\" which character is based off him. Spoiler alert: It's the goofy prince. He still hasn't figured it out.", "NTA, if that’s the plot he so desperately wants he can go write it himself. It’s honestly troubling how he’s behaving, it’s childish, insecure and controlling. Also as avid romance reader I thank you! I’m not sure if you’d be comfortable sharing your work on here (or even in dms) but if you are I’m always looking for new books to read!", "of course you're NTA !", "Not here to judge the content of this post, but I hope you use paragraphs in your novel.", "NAH, you need a grownup who respects your art. He might not be the right one. Not bad on him, you’re writing sexual scenes about imaginary dudes, dudes don’t understand women like written scenarios, since they like videos.", "NTA", "NTA", "NTA by any stretch of the imagination.\n\nYour boyfriend sounds awfully insecure, though. Unless and until he gets a job and manages to become your publisher, his opinion of your writing is irrelevant.", "nta", "NTA - you can cut your losses.", "What.", "NTA - tell him sex sells", "Nta\n\nBut i really like the idea of you adding à second male character abd then killing him off violently", "Why do you even keep a guy around who doesn't respect your entire career? He also feels he has a say in what you write, and is considering calling it a deal breaker.\n\nBreak the deal, dump him. NTA.", "NTA\n\nand sorry if this is a rude, but 6 months isn't a long time... you could find someone better", "NTA: Who is he to say wether its good or not. It's not a genre he reads, and he's not a publisher. If he can't support something you do well, better to fond out early and move on.", "Please, as someone who spent too many years trying to \"prove myself\", RUN! It's a first sign of control AND insecurity, and that you will spend a lifetime trying to \"explain\" yet trust will never grow", "NTA. Dump his ass. He sounds controlling and exhausting.", "Lol, NTA. He’s an insecure weenie who is alienating a super cool chick who has the gall to do something she enjoys. Sounds like a real winner you got there, haha.", "You are not a match as well as NTA", "NTA. \n\nDrop him, and base your next novel on a romance gone wrong because the man was actually an insecure child.", "NTA- even if you were in the relationship longer than 6 months it would still be ridiculous.  I write fantasy romance as a hobby and my husband was never once like this insecure doofus. Drop him like the weak salsa chip he is and carry on strong!", "Based on your poor grammar, I’d be hard pressed to believe you are a writer, and a paid one at that. Sounds like this post is fiction.", "NTA. however, can i know the title of your books? i’m a massive romance reader and always looking to find more books!", "Back up your work.", "NTA but OP you need to immediately back up your work in like three different password-protected places before your BF tries to delete it", "NTA. Dump him, he is trying to control you and showing who he really is. He is gross.", "NTA Dump him.", "Why is he still your boyfriend? Ditch the guy, keep writing. There will be another guy.\n\nIt’s incredible that you make money from your writing. Don’t let anyone take this away from you.", "Off topic to the post, I've been trying to find good romance books, them being more spicy. I was wondering if you could share some of your works that have that theme🥺 \nBut NTA and I'm worried about him doing something to your books if left unattended, he projecting and it's worry some.", "My controlling, abusive asshole of an ex had similar issues with my writing. \n\nNTA and please take this red flag for what it is. Best of luck, and congrats on making your passion work for you! I'm mad jealous lol", "NTA", "NTA\n\nYou set boundaries either he can figure it out or it hasn't been that long of a relationship. Even if you were to write about what he's concerned about it's still fictional it's still up to you to write whatever you want", "NTA\n\nIt's always the ones with a stick up their ass that have a problem with sex.  Go figure.", "Welp, looks like you've got another ex on your hands. He's out of line criticizing your work like that, and his insecurities (and plain wrong-thinking) are his own problem.\n\nI'm a happily married heterosexual lady who writes stories about lesbian ladies who live in giant trees (solarpunk--science fiction-y things) and old men janitors on space stations, what kind of fantasy am I working through? LOL (Only the tree folk have sexy times, though, the janitor has a revolution to manage)\n\nAnyway, it looks like the trash is taking itself out. Keep writing your sexy stories! You'll find a partner to support you, you seem like a nice person with excellent work ethic and that's sexy as hell!", "NTA, you can do as you please. If he tries to control what you write at this point, think about what he's going to try to control in 2 years, 5 years, 10 years.", "NTA by any means. I’m a storyteller in any format and in any kind of relationship, it’s possible to get that attitude that you’re writing your own fantasy or something. Or suggestions that you should write this plot line or that one because you can write but *this* is the magic idea. And when you get that, it’s either “no, also get over your own shit” or end that relationship. The third “option” is to drive yourself crazy but nobody should ever pick that one. I have a master’s degree and experience in so many things and still get like “oh but did you ever think of this basic thing that you’ve already done or are already specifically doing.” This isn’t good partner behavior, you definitely know it, and don’t waste anymore time on this guy. *He* is the one with the fantasy.", "NTA time to write this guy out of your life.  I’m an avid reader - romance and other - and I know not every book is to everyone’s taste, but that doesn’t make it bad.  r/RomanceBooks is really good about not yucking someone else’s yum. Write what you want.  He could have gotten some spicy tips 🌶, but instead he’s cockblocking your work because of insecurity.", "What an absolute insecure child.", "NTA.... and tell him that it's not your fault that the majority of women who read your stuff probably have asswipe partners who wouldn't know how to even find that little bit with directions from Google maps.\n\nIf he wants you to stop writing, tell him to start educating his homies on how to make more than just bacon sizzle.", "NTA. He’s way too insecure.", "NTA, that would be your current fling demanding either you make him the star or change the plot line or not write.  Next, you have to ask yourself if the relationship is worth keeping because he wants you to not do this hobby so he's going to nitpick at you about anything and everything from past flames to your current story.", "Man is scared of your imagination. Get outta there!", "Ugh babe that sucks. NTA. \n\nAlso, I totally want to read your book when you get published. All I want to read is porn. He sounds like bad news 🙁👿", "Don’t stay with someone that doesn’t support your creative work. It will destroy you long term.", "NTA. If you were in fact reliving your past relationship with an ex through novel form, then I would have probably voted YTA. Since that would be difficult for your current partner to navigate but it doesn't seem like that's the case here.\n\nIt sounds like your current bf is pretty damn insecure. You might want to really evaluate whether you can put up with that level of insecurity. It usually gets worse rather than better.", "NTA. And he deserves to never be in any real-life hot sex scenes again. DTMFA", "NTA. If you want to stay in a relationship with him you’ll need to sort this out. People who don’t write don’t understand the writing process and imagine lots of incorrect things. \n\nYour bf is insecure. We all are insecure about something. He needs reassurance. Don’t we all? The question is is he willing to try to let it go and are you willing to help. Help -not coddle. \nI always recommend therapy bc a third party with expert knowledge is helpful. \n\nYou could also find examples of other authors whose work is not their life.", "So he's not talking to you anymore? Good! He isn't worth it...at all. NTA You are much more valuable than to waste your energy on an insecure person that wants to control you. Best wishes :-)", "NTA. Drop him, more time to finish your novel!", "NTA. \n\nYour bf is incredibly immature.  None of what he's doing are earmarks of mature, adult relationships.  Insisting that he knows your true intent is essentially calling you a liar. Demanding that you change your novel to assuage his insecurities is irrational and giving you the silent treatment because you won't is childish.\nI don't even have any useful advice or middle ground to suggest. Unless he changes his behavior, there's not much room for resolution.", "NTA romance is the biggest selling genre keep the writing going and ditch the guy", "NTA. Please take everything in that he is says to you. Something that you have been passionate about for long period of time (certainly longer than he’s been around), he largely dislikes if not hates. There is NOTHING that you can do to change his mind. Your writing is part of who you are, and has more staying power in your life then he does. Take a step back from the relationship at the very least (or end it). \n\nDo not consider changing who you fundamentally are to make him “happy” for now. Keep living your life on your terms. Making any concessions are only going to hurt you and strengthen what he would say is your relationship, but is really his control on your life.\nNever give up securing a bag for anyone, especially if you love what you do. \n\nGood luck and keep writing!", "NTA. Boyfriend sounds insecure on lot of levels. Honesty worst kind of partner who rains on other’s parade. And childish to fret over an ex. And to stifle your content because of sexuality. Mildly possessive imo. Keep writing and living your best steamiest written life. Now I’m the ahole here to say this: but for the love of all that’s good plz stop abusing them commas, holy run ons Batman. I say this with great compassion as this was my primary critique I received in my early writing classes. But take it or leave it as you said to your boyfriend, you’re not looking for feedback. If you consider it, try to break those four line long ones down into multiple sentences. As they are, it’s hard to follow the train of thought with the stream of consciousness style ramble. Not grading your novel writing abilities though, surely you’re frustrated venting here. I had to reread handful few times, so bit confusing.", "NTA I suggest you edit the boyfriend out of your life.", "Imagine someone saying you don’t have empathy for them because you won’t completely drop a hobby and change everything about it. This guys nuts", "NTA.  Time to write the boyfriend out of your life.", "NTA", "Your BF is not a partner, he's a road block and a very immature one too!!\nNTA", "NTA\n\nThe right partner will help you excel in life, the wrong one will hold you back. He’s made it obvious which one he is. \n\nPlease stop wasting anymore time on this fool and his stupid arguments.", "NTA- run girl, run for the freaking hills. This is a major red flag 🚩 so not pass go, do not collect $200", "This post makes me so livid and fired up from personal experiences similar to yours. I am also a romance writer who got herself published but works at it as a hobby. It's astounding how many people freak out about the sex in romance books. Hello! I told you the genre was romance! It's not my fault if you don't read and didn't know what it meant. I've had people tell me a lot of the things you're saying your bf said. Fuck him. And anyone that treats your hard worked for books like anything less than deserving. You are not the asshole, get him out of your life, don't wait for him to decide if he can handle it because it'll always be a problem for him. Keep writing!", "NYA", "NTA. He’s pushing boundaries to see how controlling he can get away with being in the future. He’s also trying to chip away at your confidence by criticizing your work and implying it’s a waste of time to pursue your “hobby” that’s actually a career.", "NTA. Its your hobby and passion, and if he tries to control how you practice that, he can fuck right off.", "NTA. Drop this guy OP, he’s definitely not worth the headache.", "NTA, imagine being so insecure that you feel the need to compete with a fictional story. Chase your dreams girl, write that novel!", "Oh well, the relationship only existing for 6 months should make kicking this loser out of your life a whole lot easier.\n\nNTA.", "NTA - please make sure he has no access to your book.        \nIf it’s on a computer make its password protected.       \nThe computer AND the book.       \nDo NOT under any circumstances let him use your computer unless you are watching everything he’s doing.       \nBack everything up where even if he manages to delete you can get it back.       \nNever let him read it again.        \nTho an easier thing to do would be to dump him", "NTA and this relationship is doomed imo", "Fellow author here.\n\nIf he can't at least support you, while keeping his mouth shut until you ask for feedback, one of two things will happen:\nYou'll end up splitting up because you get sick of his nonsense \n\nOr\n\nYou'll stop writing and secretly resent him\n\nNta for keeping up with what you love. \n\nWrite those books! The world needs your words!", "NTA, geez I'm sick and tired of men thinking that they can dictate your life and making sure it revolves around them. \nGood on you OP for not backing down because if you had, it will graduate into other things, what you say, how you dress, who you are friends with, completely eroding your boundaries till you cannot recognise yourself anymore.", "NTA. I’m a novelist myself, so I know all too well when I say non-writers are never gonna properly understand how character creation and development works. While all characters you write are always gonna be an extension of yourself and you’re gonna subconsciously put pieces of yourself in there whether you realize it or not, they also have a mind of their own after a while, and that’s where they no longer are a reflection of you and your fantasies. You’ll have plans for them and they’ll veer hard left instead sometimes. And more often than not, the things that characters do aren’t even things you would choose or support in real life… cuz it’s not supposed to reflect your real life, it’s escapism…", "He’s the boyfriends of 6 months trying to tell you what to do when it comes to your passion. He’s insecure over your fiction novel but he’s making up his own in his head. Leave his ass.", "NTA. It sounds like it's time to write him out of your story.", "NTA. Please read this again, \" he doesn’t like how I am keeping up with this hobby all because my ex was nice enough to encourage it.\" He's belittling you and your hard work, and suggesting that it's only allowable when tolerated by the male partner. He will allow it only if you change the plot to suit his ego.\n\nPlease don't give up writing and publishing for any man, but especially not one like this. Ask yourself, is he worth giving up your dreams and creative outlet? Absolutely not. My advice is to dump him.", "You know full well that he is the asshole here. If you don't act accordingly, I think you also have an inkling of how that's likely to turn out for you. good luck.", "He is not the man for you. He is jealous and insecure, and allows those feelings to interfere with his treatment of you and it keeps him from supporting your dreams.  They are YOUR dreams and passions. He doesn't get to dictate your dreams.  Kick him to the curb. Jealousy manifests in multiple ways, and this is just the beginning.  Never let anyone cast clouds on your sparkle!", "It's time to get yourself a new boyfriend and keep writing your novel. When someone is sulking about a passion of yours because their values don't align with yours, it is a him problem. My wife loves writing poetry, and I would never tell her how or what she should write. It is her passion, not mine. All I can do is support her and appreciate her work. Good luck with the novel.", "NTA. Throw out the man and keep writing whatever you want", "NTA. He needs to grow up or move on. \n\nIf he thinks you are cheating on paper, you need to move on (people who accuse others of cheating, are often projecting. ...)", "NTA, but for a writer, your lack of paragraphs is surprising...", "NTA. I'm speechless at the entitlement of him thinking he gets a say in your book that you are writing. He's got some serious problems. I'm not sure this is the guy for you rbh", "NTA. He's trying to cut down your self esteem so he can control you later.", "NTA leave him asap. Narcissist detected", "NTA. He’s either okay with it or he isn’t. He’s deluding himself if he thinks he can change the genre of an established author just because it makes him squeamish. It absolutely doesn’t work that way for 99% of writers. \n\nGet it while you can. He’s not going to get better about it if he’s dreaming up entire plot lines for you.", "She's lucky she found out so quickly!", "Also, if he’s this insecure and insane about a past relationship, it’s going to get soooo bad. OP please run away. I dated someone that sounds exactly like this and it ended with a call to the police because he was crying very loudly on my doorstep begging me to let him come inside to “just hold hands, so I can feel like you love only me”. A grown ass man. \n\n\nI wish I would have paid attention to these types of red flags.", "Holy insecurity batman, she caught a live one!", "For real, why would you want to be with someone who doesn’t support you… and has these ridiculous and rude ideas. Easy to step away at this point.", "I agree with you. I just don't like how easy man can be replaced with woman. It goes both ways. If my future (he he, what an unlikely one that is) girlfriend hates the fact that something I enjoy doing is not within her realm of comfort, we probably aren't compatible. Although, however exceptions are always there. I.e Potato chips, alcohol, and many more unhealthy habits.", "This. Seriously. Holy Insecurity Batman! He needs to get a grip or bounce. NTA", "Based on this knuckleheads assumptions, and my own books I am, in no particular order,\n\nA Rockstar who wants his first love back and witnessed horrible abuse of his mother at the hands of his drunk father\n\n\nThe first love who becomes a professional band photographer.\n\n\nA  gay man who's mother is a diehard religious nut who thinks she can pray the gay out of her son\n\nA black man who struggles with racism during segregation in the deep south\n\nA heroin addict with poor little rich boy syndrome \n\nAnnnnnd a BMX racer who turns to drugs and then music \n\n\nSpoiler: I am zero of those things", "Based on this knuckleheads assumptions, and my own books I am, in no particular order,\n\nA Rockstar who wants his first love back and witnessed horrible abuse of his mother at the hands of his drunk father\n\n\nThe first love who becomes a professional band photographer.\n\n\nA  gay man who's mother is a diehard religious nut who thinks she can pray the gay out of her son\n\nA black man who struggles with racism during segregation in the deep south\n\nA heroin addict with poor little rich boy syndrome \n\nAnnnnnd a BMX racer who turns to drugs and then music \n\n\nSpoiler: I am zero of those things", "I’m also a dark fantasy/horror writer and it’s very much a morbid fascination/catharsis thing for me. I’m like the most normal, well adjusted person IRL, lmao.", "This!  The main character gets so fed up with her controlling, insecure boyfriend that one day she loses it and beats him to death with a dictionary.  Or feel free to end it however you want.", "This was partially a plot in a book I loved - The Fireman by Joe Hill.  It’s soft horror/sci fi about a fungal infection that makes people explode (lol) but one of the major plot points is that the protagonist finally sneaks in to read her partners writing and it’s essentially their life story, except he’s so condescending and hates her but nobody can live up to his brilliance, and how he pities her etc etc etc \n\nHonestly such a good book.  Highly reccomend.", "Nah, add him as an annoying side character and have him die in the most embarrassing way possible 🤣", "LMAO", "This!!!!", "This was also the plot of Basic Instinct starring Michael Douglas and Sharon Stone.", "Yes!", "Lol but don’t forget the disclaimer that all characters are fictional and any resemblance to a real person is coincidence", "I love the pettiness of this.", "Maybe. But I'm not so sure. Something gives me the sense that he may feel threatened by her success.", "I had never before seen or known about that squad, and I definitely need another merch on it asap.\n\n\nNTA", "How do you know they aren’t a writer? Is it too much for you to give someone the benefit of the doubt?", "Write consistently. Your readers benefit from your excitement and agency. It's a present. Nothing as amazing as this guy can offer you. His bitterness, insecurity, and self-righteous attempts to exert control are not necessary for you.", "And if he's so insecure OP needs to make sure she has secure backups and that her computer is always locked and password protected! NTA", "I think a thesaurus would work better. Beat him while hollering out synonyms to “CONTROL FREAK!”", "And make him eat the pages like the movie Misery.", "Plot twist... OP is really Joe Hill...", "LOL, that's hilarious!  If she hits him with the thesaurus or dictionary open, maybe some of the words would be imprinted on his forehead.   Sorry, writer's embellishment.", "Im starting to think that 'narcissist' might not be too far off the mark...."]}