{"id": 2172, "submission_id": "ytqc8l", "title": "AITA for not buying a wedding gift or chipping in for a wedding gift?", "selftext": "At my workplace, one of my colleagues is getting married. We're not friends at all. In fact, she's actually part of this really cliquey group in the company that basically made my life miserable. She was never directly responsible for bullying me, but she was part of that awful clique. Anyways, that colleague has a wedding coming up, and she invited everyone in the workplace except the boss and me.\n\nOne of my coworkers (who is part of that same clique) decided to organise a staff luncheon to celebrate the other colleague's wedding. That coworker asked everyone to chip in for a wedding gift for the colleague who is getting married. When she asked me, I said I don't want to chip in anything. She looked at me judgingly and said \"Oh, you don't want to chip in for the gift but you're happy to attend the luncheon\".\n\nI said, \"Yes, because I've actually paid for the luncheon\".\n\nAnyways, she then said \"Oh, you're being very petty, \\_\\_\\_\\_\\_\\_. Don't be a loser because she didn't invite you the wedding\".\n\nI was annoyed when she said that because:\n\n1. I never said that me not being invited to the wedding is the reason why I'm not paying, and how the hell does she know I wasn't invited? They're obviously talked about me behind my back.\n2. Calling me a loser.\n\nAnyways, I debriefed with a few people. Some said I wasn't in the wrong. Others said I should've just chipped in for something.", "created_utc": 1668309235, "permalink": "/r/AmItheAsshole/comments/ytqc8l/aita_for_not_buying_a_wedding_gift_or_chipping_in/", "score": 180, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1. I didn't chip in for a colleague's wedding gift.\n2. People petty and stingy for a once in a lifetime event.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. Do you have HR in your company? She called you names and tried to pressure you to spend money you didn't want to spend. That's a pretty damn hostile workplace. For the exact same reason she didn't have to invite you to the wedding, you don't have to contribute to her gift.", "You're NTA. Basic rule is you don't have to buy a bride a gift for a wedding you are not invited to attend.", "Throw her a dime and walk away. NTA", "Nta. You aren't friends or even particularly friendly due to the way the clique treats you. And you are literally one of only 2 people in the workplace not invited to the wedding so you were expressly uninvited and gossiped about and now they want to bully and name-call you into contributing to a gift as well which could be legally actionable as creating a hostile work environment.", "NTA. \n1. You guys are just coworkers\n2. You aren't friends\n3. You weren't even INVITED. \nMaybe I've been living under a rock but I've never heard of people being obligated to pay for weddings gifts for weddings that they aren't invited to. \nHas this coworker ever done anything for you? Would they buy you a wedding gift if? Probably not.", "NTA\n\nYou were specifically not invited, so why are you obligated to get them a gift?  They clearly didn’t want you celebrating their marriage with them, and giving gifts is part of that celebration.\n\nETA: of course her little clique friend thinks you suck for not giving a gift to the queen.  They’re literally trying to bully you into giving them money while also specifically excluding you.", "NTA \n\nReport her to your boss for calling you a loser. \n\nIt’s tacky to expect a present or contribution but not invite the person.", "NTA. Like, at all. \n\nI’d also probably go to HR or the equivalent in your workplace and let them know that you feel uncomfortable being pressured into giving money toward a wedding gift to a colleagues wedding that only you and your boss are not invited to. I’d also make sure to bring up the name calling. None of that is cool in a workplace.", "NTA. You never owe anyone anything for a wedding. I'd be tempted to give a bouquet of poison ivy myself. Go speak with HR about the work environment and coercing you into giving money, and then decide if you will stay there based on the response you get.", "NTA - No invite, no gift.", "NTA she has a gift registry that people actually invited to the wedding can review. You chipped in for the luncheon, you are entitled for the luncheon. Her confronting and name calling are grounds for her to be reported to HR", "NTA. Do NOT chip in. Fuck them.", "NTA\n\nYou don’t really know the bride, nor are you attending the wedding. Also, one shouldn’t contribute to extracurricular activities if one doesn’t want to contribute to extracurricular activities.", "**NTA** \n\nYou are not required to chip on for an gift to a wedding you are not going to.", "NTA. I wouldn't contribute either.", "NTA \n\nDon't EVER feel like you could be TA in this situation! I hate stuff like that, feeling obligated to \"chip in\" as part of a work group. It's often against company policy in many work places. \n\nAll you need to say is \"No thank you\" and keep walking. You don't owe ANYONE an explanation for anything.", " Ta, I would given her a penny.  Fuck that noise.", "NTA.  You do not have to contribute, period.\n\n  \nAnd as for the coworker calling you a \"loser,\" I'd make it very clear that her behavior is unacceptable.", "NTA coworkers are NOT FRIENDS", "NTA\n\nYou should be obligated to buy a gift for anybody's wedding. It's kind of a curtesy in a way. And especially if you're not invited. Even more especially, you're not friends with the couple. \n\nWhat you really should've done is throw down some pocket change and say, \"here's my contribution\".", "NTA", "NTA.  \"Oh, YOU are being petty!  Don't be a loser because I don't HAVE to chip in for the gift.\"", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nAt my workplace, one of my colleagues is getting married. We're not friends at all. In fact, she's actually part of this really cliquey group in the company that basically made my life miserable. She was never directly responsible, but she was part of that awful clique. Anyways, That colleague has a wedding coming up, and she invited everyone in the workplace except the boss and me. \n\nOne of my coworkers (who is part of that same clique) decided to organise a staff luncheon to celebrate the other colleague's wedding. That coworker asked everyone to chip in for a wedding gift for the colleague who is getting married. When she asked me, I said I don't want to chip in anything. She looked at me judgingly and said \"Oh, you don't want to chip in for the gift but you're happy to attend the luncheon\". \n\nI said, \"Yes, because I've actually paid for the luncheon\". \n\nAnyways, she then said \"Oh, you're being very petty, \\_\\_\\_\\_\\_\\_. Don't be a loser because she didn't invite you the wedding\". \n\nI was annoyed when she said that because:\n\n1. I never said that me not being invited to the wedding is the reason why I'm not paying, and how the hell does she know I wasn't invited? They're obviously talked about me behind my back.\n2. Calling me a loser.\n\nAnyways, I debriefed with a few people. Some said I wasn't in the wrong. Others said I should've just chipped in for something.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA", "NTA.  Collections for work colleagues are always difficult to navigate. It really sucks to contribute to someone you don't like, and  you're never obliged to contribute, but sometimes it makes sense to be seen to be contributing rather than deal with the bullshit that follows from being seen not to be.   \n\nBut in this case if literally everyone else is going other than you it is totally fine not to contribute. She's the one that's made it a thing.  A lunch that you're paying for is completely different.  Ignore the judgy co-worker.", "NTA.  A gift is just that.  It's not an obligation.", "NTA \n\nAnd this is something that you need to take to HR, if only to get it on the record in case this clique isn’t done with you over this issue.", "NTA this is incredibly bizarre, not even going to try to understand the office politics here but you are very clearly not in the wrong here.", "NTA. I used to be one of the office workers delegated to take up collections for weddings, babies, etc. Sometimes people didn't want to donate for their own reasons. I would just say okay, I figured it was none of my business.", "A friend of mine worked for Chase Bank before and after merger. He does not do birthdays or weddings or any pot luck type of stuff. Not there or at any job. He is one of those people who thinks of his co-workers as just that and not friends. He would not attend any party or pot luck and would often be out \"sick\" on his birthday just to be safe. He would pitch in a buck if the hat was passed around, but only to make it go away. For potlucks he kept a large can of baked beans in his desk drawer. When asked what he was bringing he would pull it out and wave it around until they told him not to worry, he was good. He kept that can in there for 5 years!\nHe never partook of any food or accepted any gifts other than communal card. So he was not a hypocrite at all, just an antisocial hermit.\n\nSorry for off topic, just wanted to relate how my friend deals with work stuff.\nNTA... I would have declined as well and probably told off her friend for even having the nerve to ask me knowing I was snubbed.", "NTA. Fuck them.", "NTA.  Don't let those assholes bully you into chipping in if you don't want to.  Tell the coworker to fuck off.  How big is this company?  Is there a Human Resources department?  If so then report her for harassing you.", "NTA. And I wouldn't have gone to the luncheon or paid anything towards it either. Let them think you're a loser, they're the ones begging for money to buy a gift.", "Go to HR and report this NTA", "NTA - You have no obligation to give a gift for a wedding you aren't invited to.", "Nta.  Some people peek in high school and never leave that mindset.  They will forever be trying to be part of the in-crowd.", "How much money are we talking?", "Thanks. Yeah, I'm planning to call HR tomorrow.", "THIS RIGHT HERE. You said NO and colleague should've dropped it. The fact that she took this further AND insulted you is completely unacceptable. Please do inform HR, because this may continue now that the clique knows that you didn't contribute to a wedding present for a wedding you werent invited to. SMH. NTA AT ALL.", "This!  And is the luncheon on company time?", "I have thought of just contributing 5 cent, but decided not to lol", "LOL - that'd have the clique talking!", "The behavior is unacceptable and they are within their right to report the bullying to HR. But, this is not what a hostile work environment means. That term is exclusive to illegal discrimination based on race, gender, disability, etc.", "Thanks. I didn't know that. I'll call HR.", "THIS, but it depends on where OP is located as to whether she can file a claim for hostile work environment. In the USA anyway, unless they treated OP negatively because she's a member of a protected class, hostile work environment wouldn't apply. But harassment and bullying certainly would. Either way, notifying HR is absolutely the right thing to do.  NTA", "100% right. The audacity of OP's colleagues is impressive. SMH. NTA", "Doesn't matter. Not invited, no gift.", "Keep us updated if possible", "“You want petty?  I’ll show you petty”", "Thats hilarious lol, but yeah probably for the best that you didn't actually do that...", "Five cents seems like way too much for these assholes", "If they call you petty, show them petty LOL", "Yup. This is accurate in the USA.", "Maybe where you are the definition is that narrow. However in many places a hostile workplace can also be defined as including bullying,harassment and conduct which can be construed as abusive, intimidating or unwelcome. Also sometimes referred to as a toxic workplace in those instances.", "That’s not always the office etiquette but they don’t have to give a gift if they don’t want to", "Update: literally nothing happened.", "Are you in the US, then no that’s not correct. You have to be a minority for it to apply. Harassment alone does not meet the definition of a hostile work environment. It’s a very specific legal term.", "Couldn't give a hoot about office etiquette tbh. Especially for someone I don't like.", "Maybe instead of trying to be the  reddit know it all and berating people about what the specific \" law\" is you should read my post again...because I am aware it's the worldwide web not the USA web...my original comment said \"COULD BE\" 🙄", "I’m just saying that “no invite, no gift” is not universal in any way, shape or form.", "I think you just don’t know what a hostile work environment is…. But you do you, I guess", "And the woman COULD BE up for a promotion or unicorns COULD BE flying out of my butt as we speak. Pretending you know something but giving yourself the out of \"I said could\" is beyond comical/moronic.", "Did I say universal? I'm discussing OP situation.      \nShe didn't get invited, she sends no gift.       \nI think more people than not would think the same way though.", "Actually pretending the laws of your country apply the same to the entire world is beyond comical and moronic.  But...you two do you too🙄", "Chipping in?? Hello NO! \nYou're not good enough to be there. \nThey pick ok you and even bully you, yet your money is good enough?\n\nF*CK off! \n\nYou're not a loser and you don't owe them anything.\nI'm a petty as*hole and the only thing I'd do is anonymously send her elephant dung as a gift. \nIn Germany there's a website where you can send a gift box full of elephant dung to someone. Anonymously of course. The money you pay pays for the elephants food and vet bills. \n\nNTA \n\nThe audacity... Seriously", "I think your coworker was an asshole. It might have surprised her that you said no but that didn't give her the right to pummel you with an insult. Separately, it is strange to go to a luncheon to celebrate the bride where a gift from everyone will be presented, I assume. I would have kicked in even if I didn't like her. Why else would you be at the luncheon?  \n\nFind a new job. Nobody deserves to be kicked around everyday at work.", "NTA. I wouldn’t have gone to the luncheon either.", "NTA.\n\nWhy would you chip in for a gift if you aren't invited to the wedding?", "NTA take this to HR", "NTA. You are not required to cater to AHs. \"No\" is a complete sentence.", "NTA, she didn't invite you to the wedding, very specifically. That means, you aren't expected to be any part of the wedding. Bring it up to her, one of your coworkers is pressuring you to spend your money on something for them, and it is making you uncomfortable, and they way that they're doing it makes it very clear that they're talking badly of you behind your back.", "My work tends to do a card and collection for weddings, births etc. Big company so don't know everyone well. But it is £1-£2 donation and maybe £5-£10 if close colleague. Management tend to put in more. And no expectation of going to wedding.\n\nBut this sounds like a small company and the dynamic is isolating you. And a wedding meal at work sounds weird. That's usually what friends set up. Did the groom to be come? I feel sorry for bride if all her friends are colleagues and her life is her work.\n\nSo given the fact that you aren't invited, everyone else is and they are giving a communal present, I think fair to not give.\n\nNTA", "Please notify hr of her actions. I would not give her anything either. Maybe notify the boss who also wasn’t invited that your being hassled by her little friends.", ">  Others said I should've just chipped in for something\n\nHell, no! \n\nNTA", "NTA. Go to HR with this", "A gift isn't ever an expectation. C'mon? What is it with people being ridiculous about gifting? You paid for your own lunch. No one gave it to you. And who buys a gift for someone they can't stand. She's lucky you didn't tape two cents in a card and let her know how you really feel about her friend.\n\nNTA", "NTA.", "I wonder if the “boss” was asked to contribute seeing as s/he wasn’t invited either…?", "a convenient penny on the ground would’ve added that little extra.\n\n“Here you go.”", "[removed]", "Your an adult. That means you dont have to buy into this highschool BS.", "Why are you repeating exactly what I said in my comment 2 hours ago???", "Probably yeah", "Report for stealing your comment.", "Americans…"]}