{"id": 2174, "submission_id": "ytszf9", "title": "WIBTAH if I take my brother to court, even if it’ll end in him possibly serving time?", "selftext": "Background: My dad passed away when I (20m) was 6. He has three older kids from his ex-wife, RJ(45m), Rain(47f) and Rose(49f). He was separated but not divorced from his wife when he and my mother (58f) got together. They had their own trust funds and when I was born he made me his sole beneficiary to anything and everything that was in his name (besides their trust funds ofc) and most specifically his house since his kids had their moms house. In my dads final days he made sure that all his assets were in order and that I’d get everything I’d need in life. He passed 7 days later. His ex-wife came to the property and kicked us out since they were still legally married. \n\nNow onto the problem: I’m now of age and because of the housing market I want my house so I went to visit the area, for memories and to see if there way any damage since I haven’t seen it since I was 6, but to my surprise, I found my brother on the property with his wife and family. \n\nI said hi and wanted to catch up because I do love my brother although he’s never taken an interest in me, and instead of replying, told me to get off his property. Confused, I asked what he meant and he told me to screw off and he knows I’m here for the house and that he and his family made it their home this year because his mother passed and unfortunately lost the house due to her gambling addiction (??) I asked if we could work out something but he again told me to leave. I don’t know how he got the house. \n\nHe blocked my number, as did his wife, and refused to talk at ALL. I have it in writing that it belongs to me and only me, and my dads lawyer has been contacted and informed me that my brother has warrants and has a very bad criminal history, if I did take him to court he would serve a few years at least. He has a new baby and two kids under 6, his wife also has a criminal record, so I wouldn’t want to do anything that would put his babies in danger or tear apart their family, but he won’t reason with me and my other siblings don’t like me so I have no one to talk to. WIBTAH?\n\nEDIT: hey! I know this post hasn’t been up long but as many of you has suggested, I’m gonna talk to my dads lawyer about everything, the possibility of squatting, the rightful ownership, my mother’s involvement, everything, thank you so much, I’m trying my best for someone who knows little to nothing and I really do appreciate every one of you especially those who’ve raised concerns.", "created_utc": 1668317909, "permalink": "/r/AmItheAsshole/comments/ytszf9/wibtah_if_i_take_my_brother_to_court_even_if_itll/", "score": 58, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I feel like I WBTAH because I’d be taking their home from them out from under their feet and possibly causing him to serve time, on the other hand, it’s my house and he’s not even up to negotiating.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA if that is your house I say go after it. Your dad had his reasons for what he did. You have to think of your future because I dare say your brother isn’t.", "Your brother stole your house; that is what will land him in prison. You are not an arsehole for seeking your inheritance.", "So you’re clear, you suing your brother will not send him to prison. That is not a possibility. The government would have to charge him with a crime. If you mean you making him come to the courthouse will get him arrested on his warrants, that is not your problem nor responsibility. You need to get a lawyer and sue him asap\n\nETA: NTA", "NTA - He's a squatter and a loser, do what it takes to take back your property. He's not your brother", "NTA your dad explicitly thought of you and probably his wife getting the house. There is only one way, get your lawyer on it.", "NTA, kick him out.", "NTA sounds like good ol brother should've made sure his house was in order before trying to steal yours. I feel bad for the kids but that's on him and his wife.", "NTA. You're house. You owe him nothing.", "Evict him. If he doesn’t leave and you have to take him to court then it really isn’t of your doing if he ends up in jail, it’s his. There is absolutely no reason for you to set yourself on fire to keep his thieving arse warm.\n\nETA: NTA", "INFO: how can the mom kick you out if it is under you name.\n\nOne last thing, you can do it to go down physically to the house and say it is under your name and what will happen if you take it to court. Of course, your brother will spew some vulgar words. But if he refuses to leave, you can take him to court and let him face his mistakes.", "This whole thing is a hot mess. \n\nINFO: How did your dad's widow sell the home if it is legally yours? It sounds like she inherited the home, not you and then sold it to her son. You may have a letter or such that gives you the home but without a probated will his legal wife would get the majority of the property. She wasn't an ex wife at the time of his death.", "You are NTA. Your father made sure that you would get the house, and your brother was provided for in a different way.\n\nAlso, if both your brother and his wife have a criminal history, chances are that their kids aren't too safe to begin with. I get that you feel responsible if either of them get locked up, but your brother knew the deal, and chose to go to war with you, instead of protecting his children.", "NTA. It sucks that the kids might suffer, but he messed up getting those warrants. You getting your house back won't send him to jail and had they just been reasonable all of this could have been avoided. He messed around, let him find out.", "NTA.\n\nHis prior criminal acts and warrants are not your problem.   He stole your house and you can and should take legal action to address that.", "INFO -- it is possible that the ex lost the house and had no assets for your brother to inherit.  It is possible that he took over multiple mortgages or had to outright re-buy the house.  We don't know. \n\n\nIt may have been yours when you were 6, but it sounds like no one actually put it in your name and never went after the ex to evict her, then it is very possible it STOPPED being yours long ago.  IT is more probable that the wife was joint-owner  (otherwise, I doubt your mom would have left).  Now that the ex is dead, it makes sense to sue her estate, but is that really your brother?  Did he actually get anything from her estate or was it all consumed in debt?   Again, we don't know.\n\nTo me, it sounds like he's being an asshole, but we also don't know what lies the ex told him about you, your dad and your mom.  He might think you are the problem.  \n\nSo here we are without enough information.  As far as you can see, he's being a grade A jerk ... if (and it is a big IF) it turns out that he paid for the house he grew up in, do you really want to take that away?  Would that change the equation for you?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nBackground: My dad passed away when I (20m) was 6. He has three older kids from his ex-wife, RJ(45m), Rain(47f) and Rose(49f). He was separated but not divorced from his wife when he and my mother (58f) got together. They had their own trust funds and when I was born he made me his sole beneficiary to anything and everything that was in his name (besides their trust funds ofc) and most specifically his house since his kids had their moms house. In my dads final days he made sure that all his assets were in order and that I’d get everything I’d need in life. He passed 7 days later. His ex-wife came to the property and kicked us out since they were still legally married. \n\nNow onto the problem: I’m now of age and because of the housing market I want my house so I went to visit the area, for memories and to see if there way any damage since I haven’t seen it since I was 6, but to my surprise, I found my brother on the property with his wife and family. \n\nI said hi and wanted to catch up because I do love my brother although he’s never taken an interest in me, and instead of replying, told me to get off his property. Confused, I asked what he meant and he told me to screw off and he knows I’m here for the house and that he and his family made it their home this year because his mother passed and unfortunately lost the house due to her gambling addiction (??) I asked if we could work out something but he again told me to leave. I don’t know how he got the house. \n\nHe blocked my number, as did his wife, and refused to talk at ALL. I have it in writing that it belongs to me and only me, and my dads lawyer has been contacted and informed me that my brother has warrants and has a very bad criminal history, if I did take him to court he would serve a few years at least. He has a new baby and two kids under 6, his wife also has a criminal record, so I wouldn’t want to do anything that would put his babies in danger or tear apart their family, but he won’t reason with me and my other siblings don’t like me so I have no one to talk to. WIBTAH?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA,  I would follow your attorney's advice regarding securing your property.", "NTA seek assistance from a lawyer, and your Dad's lawyer. You did the right thing by trying to talk, but he isn't being reasonable. \nMost likely your lawyer will send a letter or two explaining that it's your house from your Dad's will and if they don't vacate you'll take them to court. It'll then be his choice if he wants to fold or fight.", "NTA - start this tomorrow.", "NTA.\n\nIf it’s yours, it’s yours. \n\nSpeak to a lawyer and get the ball rolling to get it back. \n\nIf he’s arrested for outstanding things, not your problem. He’s made it clear you’re nothing to him and he’s stolen what’s legally yours.", "NTA. You’re doing all of them no favors by not making them accountable for their actions.", "NTA\n\nBut you can give him the option of being able to vacate before you go to court. Sometimes the threat is enough to get things done. Let him know what the consequences will be if he doesn't turn the house back over to you. Then it's completely on him!", "NTA. It’s your house legally, take him to court", "Take him to court. If he didn't want to go to jail, he wouldn't have committed crimes, and that is your house. NTA", "Nta. It’s not your fault he’s a criminal", "NTA\n\nHe’s attempting to steal your house from right under you. It sounds like all official documentation is in order and clearly states that the property was left to you. Sounds like he caught wind of that and decided to squat his entire family in a house he knew wasn’t left to him.\n\nHis criminal background, his wife’s, warrants, the children. . None of that has anything to do with what he’s doing to you right now. So because he’s already a criminal you should continue to let him be one by stealing what is rightfully yours? \n\nNah. Lawyer up. It might take awhile but eventually they’ll be forced out and you can enjoy your home.", "NTA, dont let the AH win", "Really, the sooner you get him out, the better.  Your dad wanted you to have.  Go to court. NTA. He sounds like trouble.  Heartless though it sounds, his family is his responsibility not yours.", "NTA. Work with the lawyers, get rid of the squatters and let the cops deal with them. And do it ASAP.  The longer they squat, the harder they are to get rid of.\n\nI understand you being ambivalent due to the children. But that is not your circus, not your monkeys. These people made their own choices.", "if he has warrants he’s gonna go anyways", "NTA!! Take him to damn court- he is disgusting and if he will do this to you I highly doubt he would think twice about getting you thrown in jail if it served his greed.", "NTA. If it goes badly for him, so be it. He who fucketh around findeth out.", "NTA Exactly this point. He broke the law and knows he did so. A house isn't like a candy bar you can ignore. Take him to court.\n\nEvict him, change all the locks also. Do so as quickly as possible before the house is trashed. Also check title situation make sure it wasn't tampered with.", "Exactly. It's disrespectful to their dad's memory. OP's father made his wishes explicitly clear.", "She ended up bringing his entire family who only referred to me as the bastard child, there was no adultery, nothing like it, they were separated for over 6 years before he even met my mother, they took all of our stuff and threw it out, we couldn’t do anything because my mother was overcome with grief, when she eventually called the cops, all they said was that since she’s still his wife, she gets it? The cops aren’t reliable here. Sorry if it’s confusing! I was kept in the dark for majority of this.", "That's where the OP loses me. That and not checking on the home or his guardian checking on the home in 14 years. If it really is the OP's home then it wouldn't have been under the wife's control for all this time.", "Ah, that might explain it, I was kept in the dark for majority of it seeing as my mother saw me as just a child being nosy, but from what my dads siblings told me, I was too young to inherit it and his wife ended up living in it for a bit, but moved out as she had her own house, I’m not entirely sure of the situation and that’s why I contacted my dad lawyer.", "Honestly, that’s where I’m considering dropping it, I need to know more things and that’s why I want to talk to him, all I know is my father owned the house, it was fully paid off, it went to me. If it truly did stop being mine long ago why did he put up such a fight? I’d drop if the case was he bought the house and it’s rightfully his legally, but I’m still talking to my dads lawyer to figure it out.", "Op ask your lawyer about squatters law in your country. Anyways your lawyer said it is under your name, if they will refer to you as a bastard child, they are not worthy of any compassion. Just evict them.", "My mother never allowed me back, after years and years of asking and begging to see the house she always put it off, I had a feeling she was hiding something but where I’m from you never really question your parents, I’m going to have a true conversation with her soon", "If your mom didn't protect the property and didn't have the lawyer act as a trustee or maintain it for you I am not sure it is really yours. Your mom had a long time (as did your dad's lawyer) to protect this asset. And if it were yours and your brother did buy it from his mom they would have needed you to sign off on the sale and they didn't.", "Whatever you do, do not just drop it. A house is a very valuable asset to have especially in our current climate.", "Thank you! I totally forgot about the possibility of squatters, I thought he had taken it somehow. I’m not well informed of many things regarding this situation so I’m trying my best, but thank you again and I’ll definitely bring that up!", "I think you need to. The fact that she wouldn’t let you go there suggests she may have signed it over to your father’s wife against your interests for some reason. She needs to start talking about what is going on with this.", "I’ve found some of the paperwork a bit ago but it only stated that I was the beneficiary, hopefully I’ll be able to update this, I apologize for all the confusion, I’m just so lost, if it did stop being mine why did he instantly put up a fight?", "Yeah mom’s actions here sound really suspicious. She might have fucked over OP and is embarrassed to admit it."]}