{"id": 21755, "submission_id": "14uykpf", "title": "AITA for charging my EV at my AirBNB?", "selftext": "Me & the wife are renting an AirBNB in Halifax for two weeks; we drove up here from Ontario in our Model 3.\n\nBeing an EV, we plug it in to charge every night off a standard wall outlet here. \n\nNow, there were no stipulations about electric cars or power use at all in the listing.\n\nWe got a message from our Host today saying \"he noticed us charging our electric car, which will negatively impact his utility bill, and filed through [the service we used to book] to bill us for it.\"\n\nI did the math. Even charging at peak rates, 12h a night for the 12 nights we're here, that's $33. But since we're charging overnight at off-peak rates, it's more like $22.\n\nWe told him the cost, and he said he thinks it will be way more, clearly not doing some basic math.\n\nIf he had approached us about it differently, like \"hey, I noticed you guys were charging your EV and I wasn't expecting that, any chance you could cover that cost?\" I would have happily paid the amount extra and talked over EV stuff with him so he's better informed. But going scorched earth right off the bat made me dig my heels in.\n\nThis is our first AirBNB so I need a reality check. AITA for charging my EV at my AirBNB for an absolute worst-case cost of $33 in power usage?\n\nEdit: Seems clear, I'll send him $30 to cover all the charging", "created_utc": 1688909243, "permalink": "/r/AmItheAsshole/comments/14uykpf/aita_for_charging_my_ev_at_my_airbnb/", "score": 103, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I am charging my EV every night at an AirBNB. I might be the asshole because I did not inform my host we would be charging an electric car nightly during our stay\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "People pay for gas. You can / should be expected to pay for energy for your car. YTA. The way he went about it was fine", "EVs are still relatively rare vs gas cars, and as an EV owner your presumption should always be that people don't expect you to plug in an entire appliance and use their electricity for it. That would be like bringing a bunch of portable ACs or a ton of heaters and plugging them all in. People don't stipulate each and every condition into the terms, and this kinda goes way beyond reasonable use.\n\nMild YTA, and turning into a stronger YTA if you outright refuse to pay.", "YTA\n1. The host did not go “scorched earth” off the bat. He doesn’t know you and can’t be assured you would pay for the extra usage. He’s covering himself financially, whether it’s $1 or $2,000,000.\n\n2. As someone else pointed out already, you’d pay for gas for your car if it were gas powered. You should expect to pay for the utility usage.\n\n3. You are one condescending person talking about, “iF He hAD doNe BAsIc maTh…”. That’s not the point. Not everyone drives electric cars right now, so additional fees aren’t a normal thing for charging your vehicle at an AirBnB or anything else  of that type. Until it is, expect some places to react this way. Again, this is the host covering himself. Much like anywhere else.", "Light YTA. If the guy had a gasoline drum on the property, you would not assume it is free for you to fill up your car. You should have asked.", "Are you in downtown Halifax? There are quite a few places to charge EVs. YTA for supporting air bnbs when there is a huge issue of rental shortage and mass air bnb industry specifically in Halifax.", "Gentle YTA. You're perhaps his first EV and he'll need to figure out an ad change. It's up to you to pay for energy for your car though. The ad also didn't say \"free electricity for your EV\" so there's that.", "I would have asked first, so a gentle YTA and you should pay it.", "YTA. Just because you didn’t like his approach doesn’t make him any less right in the situation. If you drove a gas powered vehicle and he had a can of gas in the garage and you used it, shouldn’t you pay for the gas? Same thing.", "YTA like others have stated if you has a gas powered car you’d have to pay for gas and if you took gas from the host without permission it would be considered stealing. Your attitude seems quite entitled and reactionary. I’m sure you can find a mutually agreeable payment to the host.", "Your real mistake was using AirBnB in the first place. Just a garbage company filled with places owned by garbage people contributing to a housing crisis to be shittier than the average hotel.", "Slightly YTA.  Perhaps tell the host ahead of time?  Negotiate upfront.", "YTA.   This is an extra cost that most do not just assume others will foot the bill for regardless of how little it costs.   He didn't go scorched earth btw, stop being so sensitive.   Him saying he expects you to pay for an unexpected cost is normal....get over yourself.", "YTA and  you need to ask if it's okay to charge your vehicle. Just becuase you think it's fine and dandy to do so. Doesn't make it so.\n\nThey are running that airB&B as a business and that buisness needs to run within a budget.\nPay them for charging your Model 3. You filled your so called tank on thier dime.", "Dude, don't be that guy that gives us Ontarians a bad name in the rest of the country! EV's aren't super popular here yet, and most of them have to have a special port installed by the energy company to charge the vehicle. The guy may not even be aware there were cars that COULD be just plugged into a random outlet to charge, or he may have expected you to charge at an actual charging station, like how people are expected to go to a gas station to fill the car, not use \"free gas\" they come across in the airbnb's garage. $22-$33 dollars extra cost is not an insubstantial amount. Especially these days when every dollar matters. You should have asked ahead of time about charging your car. And I say this as someone who hates the entire business model of airbnb's and what it's doing to the housing market!", "NTA. I manage a vacation rental and we have dedicated chargers. Your host is a cheapskate", "YTA - go to a public charger. It’d be no different if you had a gas vehicle.", "YTA \n\nWhen the cost of utilities is included in a rental it's understood to be referring to hung utilities used within the property you're renting - heating, aircon, hot water, lighting etc . \n\nUnless the landlord stated in their Airbnb listing that EV charging is available / and is included in the fee then you are stealing something that isn't part of what you've paid for.", "You are incurring a nightly cost that probably amounts to 5 or 10% of his profit on the night, so it's not unreasonable for him to be concerned.  He didn't handle it very well.  Seems to me this should be something that can be solved amicably.  And you can reflect whatever happens in your review.  NTA.", "Good grief, YTA. Electricity isn't free!!! His approach wasn't wrong. You also didn't ASK, which would have been reasonable.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMe & the wife are renting an AirBNB in Halifax for two weeks; we drove up here from Ontario in our Model 3.\n\nBeing an EV, we plug it in to charge every night off a standard wall outlet here. \n\nNow, there were no stipulations about electric cars or power use at all in the listing.\n\nWe got a message from our Host today saying \"he noticed us charging our electric car, which will negatively impact his utility bill, and filed through [the service we used to book] to bill us for it.\"\n\nI did the math. Even charging at peak rates, 12h a night for the 12 nights we're here, that's $33. But since we're charging overnight at off-peak rates, it's more like $22.\n\nWe told him the cost, and he said he thinks it will be way more, clearly not doing some basic math.\n\nIf he had approached us about it differently, like \"hey, I noticed you guys were charging your EV and I wasn't expecting that, any chance you could cover that cost?\" I would have happily paid the amount extra and talked over EV stuff with him so he's better informed. But going scorched earth right off the bat made me dig my heels in.\n\nThis is our first AirBNB so I need a reality check. AITA for charging my EV at my AirBNB for an absolute worst-case cost of $33 in power usage?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA, but maybe location dependent. I know a lot of people with EVs and they don't feel they have to ask before plugging them in at an AirBnB. I've even reserved the place and had 2 cars that were other people's plugged in there. It never occurred to me it would be a problem. You can plug in your coffee maker that you love or your white noise machine. I'm sure you can plug in a pump for an air mattress you brought. If EVs are different, it's on the host to make that clear in the listing.", "NTA. AirBnB hosts will leech as much from their guests as they legally can. If they didn’t lay out the terms, it’s their fault. I’m sure they’re having you do chores and charging you an unreasonable cleaning fee!", "if he's going to bill you via the service, then it might be in the usage agreement, which is suggest you check. NAH because it's literally just a business transaction.", "NTA, and i can't believe people think you're an asshole for plugging a fucking car in", "NTA. Fuck everyone involved with Airbnb.", "YTA for using Airbnb at all", "Open up a dialogue with Airbnb support staff for clarification.", "NTA.\n\nAirbnb hosts put things up that they do not want used. They also label things that cannot be moved, but are not to be used. \n\nHost should have made it clear this would be an extra charge ahead of time. \n\nHost also should've at least used the EV once to see how it would affect his bill. \n\nHost knew they had an EV, yet didn't inquire or request advance mention that there would be an electric car. \n\nHost did not do their due diligence, and you should not be held financially responsible for his lack of preparation.", "NTA if the rental details did not specify any restrictions. A lot of AirBnB hosts will do stuff like this and add additional fees for petty things to squeeze more money out of their guests.", "Does it say thst you cant do that? If not then why not? Just do it", "Pay the $33 out of the kindness of your heart.\n\nGive them a 1 star review for \"hidden costs\"\n\nNAH", "NTA\n\n\nFuck Airbnb hosts.", "Just get a real car lol EV are worse for environment yata", "Nta, if they want to bill extra for use of plug sockets, then that should be specified in the contract.", "Electricity is way cheaper than people think.\n\nIf you calculated $22, and can explain it to the owner, then that is what you should have to pay.\n\nHowever, lots of people are almost brain dead with respect to math, so good luck explaining it.\n\nNext time, it should be brought up beforehand though.\n\nSo you suck a tiny bit, for not informing the house owner.  \n\nNTA OP.", ">People pay for gas.\n\nDo you often pay extra at AirB&Bs if you use the gas stove?", "Very well said", "I bet if OP had approached the host pre-stay to say he has an EV, would need to charge it and explained how much it would've cost I'm sure the host would've been much more receptive about it", "Spryfield\n\nAll the hotels & motels were double the cost at least, but I'll avoid AirBNB in the future. You're right, I don't want to contribute to the problem", "Not all Airbnbs are garbage", "Very minimal cost to doing business.", "I’m all for paying for the charging but wow is air b and b profit so small? it seems like it was $2 per night, maybe 3.", "...but he uses airbnb", "That was my thought, but with the general consensus here and the fact that EVs don't seem to be super common in the Maritimes yet, I decided to swallow my ego and pay him the $30. My only issue was the way he handled it", "Nothing about it at all. We screenshotted the ad to make sure he doesn't edit it", "They meant gas as in petrol.", "Using a gas stove and charging a car are\nNot at all the same thing.", "Gasoline for the car-gas\n\nNot gas stove gas.", "I'm clearly talking about paying for gas for a car. Using a stove is included when at an Airbnb. If car charging is not part of the amenities included on their Airbnb listing then that is absolutely an extra fee.", "When I stayed at an Air BnB for 6 weeks they said I'd need to pay extra for heating if I used a lot of it", "There are EV chargers at the Petrocan in Spryfield!", "Yes, they are. They’re housing rapists", "To be fair it wasn't entirely clear unless you're from the US. Other places call it \"petrol\", not gas; gas in those countries refers purely to gas utilities like a gas stove or heating system.", "CCS, incompatible with my Tesla without an adapter", "Housing rapists lol. I'm sure that isn't devaluing the word or anything.", "Depends, tbh. I was out in the country last week and I saw quite a few historical large farmhouses that had partially been turned into b&b's. The owners lived there and they rented out the spare rooms in these massive old buildings, which obviously cost a ton to maintain. If turning them into b&b's ensures these buildings are maintained and used, that's fine.  \n\n\nIt's another thing if people are buying scarce inner city homes and turning them into what basically amounts to a hotel, minus all the regulations that come with hotels.", "I'm from a country that calls it petrol, they were clearly talking about car fuel, let's be real.", "Gotcha, I appreciate you letting me know. Sorry for that confusion!", "Time to get an adapter?", "I’ve been raped and homeless, it feels the same.", "Maybe it's because it's 2am here but it wasn't clear for me when I first read it; I initially assumed he meant a gas stove or grill or something.", "No worries, it wasn't intentional or anything", "lol", "Go to bed... Lol", "Insomnia."]}