{"id": 21768, "submission_id": "14v26eh", "title": "AITA FOR TELING MY DAD HE WILL NEVER SEE ME OR MY FUTURE KIDS?", "selftext": "i (22f) have had 5-6 years of drama between me and my dad (44 years old)so this was long overdue \n\nit all started when my dad told me he was dating his own cousin and was planning to have more children with her, i had my own opinion about it cos in my eyes family dont date family its frowned upon, so he got angry and told me that its his life he can do what he wants with it, i agree its ur life to do whatever you wish with it but theres boundries on who you can and cant really date, cousins for me are one of them, but i let him get on with it, when he got a call from his brother to discuss why he thought it was acceptable to date family members my dad came straight to me to have a full blown arguement \n\nmy dad has the tendancy to cause trouble with multiple family members but recently he took it to a whole new level, and decided to say hurt ful things to me which i cant type in this explainattion due to the rules of this app so ill leave it to you to figure out what he has said but i wouldnt ever dream of teling my children to do this to themselves.\n\ni proceeded to tell him that i do not want him to be a part of my life or my future childrens lives, and told him he would never see me or my future kids \n\n\nAITA? or is he just over reacting", "created_utc": 1688918459, "permalink": "/r/AmItheAsshole/comments/14v26eh/aita_for_teling_my_dad_he_will_never_see_me_or_my/", "score": 21, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > banning my dad from seeing his future grandkids\n\nevery father should be able to meet hos grandkids\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA your dad clearly has social issues if the only person willing to date him is a family member. Enjoy your peace.", "NTA. Why in the hell is your dad dating his cousin? Unless your last name is Clampett or Lannister, there is no way this is a good thing.", "INFO, I can't make a judgement without knowing what he said but I think more so NTA because at the end of the day, you get to decide who sees you and who sees your kids, and an explanation isn't even necessary.", "NTA\n\nYeah, that’s some gross stuff…", "NTA- for him to even remotely think it’s ok to date and procreate with a family member is disgusting. Sounds like he has some real issues and I wouldn’t want that around my kids either.", "NTA at all dude. your dad is seriously messed up for dating his own cousin and then proceeding to have an argument with you about it and shame you for having a different opinion here. you took the high road and let him deal with his life even though he is committing incest but he came after you for no reason. i suggest just get away from him and leave him with his problems because nobody needs that negative energy in their life :)", "NTA. If you feel uncomfortable with the way your father, or anyone else, conducts their life you have every right to limit you contact with them and by extension, your children’s contact with them. Just out of curiosity is this a first or second cousin and how old is she? Most states have laws regarding marriage to relatives, primarily to prevent potential health issues the children of such unions may suffer from.", "NTA - idk what country you are in , but is incest not illegal ???", "\"If parents are blood relatives, for example, first cousins, the risk of having children with diseases and birth defects is twice as high as when the parents are not related.\"\n\nFrom https://www.google.com/url?sa=t&source=web&rct=j&opi=89978449&url=https://www.helsenorge.no/492f28/globalassets/dokumenter/having-children-when-the-parents-are-blood-relatives.pdf&ved=2ahUKEwiZ1o3Tj4KAAxUgGTQIHUSMAikQFnoECBEQBg&usg=AOvVaw22E4M6VqPsAsuWCtsVSB05\n\nNTA, you don't say where you live or if they plan to marry. I know laws against 1st cousins marrying are not uncommon. I would send them *both* articles such as this one about the increased risk of miscarriage, stillbirth, and genetic defects if the parents are first cousins. This is just in case she isn't aware of the risks she would be taking with her potential children's lives. After that, I'd simply wash my hands of the whole thing. Sounds like your father isn't worth staying in contact with anyway.", "In all honesty nta if you feel the need to go no contact. That’s your choice. A lot of people don’t understand why someone goes no contact in a family unless they have the full info. But seriously dad dating a cousin when they won’t be having kids at 55-60 yo isn’t a huge deal. Morally questionable? Sure. But if they aren’t having kids it literally only affects them. So I’m not even sure what this post is about lol.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\ni (22f) have had 5-6 years of drama between me and my dad (44 years old)so this was long overdue \n\nit all started when my dad told me he was dating his own cousin, i had my own opinion about it cos in my eyes family dont date family its frowned upon, so he got angry and told me that its his life he can do what he wants with it, i agree its ur life to do whatever you wish with it but theres boundries on who you can ans cant really date, cousins for me are one of them, but i let him get on with it, when he got a call from his brother to discuss why he thought it was acceptable to date family members my dad came straight to me to have a full blown arguement \n\nmy dad has the tendancy to cause trouble with multiple family members but recently he took it to a whole new level, and decided to say hurt ful things to me which i cant type in this explainattion due to the rules of this app so ill leave it to you to figure out what he has said but i wouldnt ever dream of teling my children to do this to themselves.\n\ni proceeded to tell him that i do not want him to be a part of my life or my future childrens lives, and told him he would never see me or my future kids \n\n\nAITA? or is he just over reacting\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "thankyou x", "he told me to unalive myself", "first cousin n shes in her 50/60", "it is, ive already been to police about it but they havent done anything", "i warned them both about the consequences and they dont care as sad as what im about to say is but i have to let them do what they want", "The father is only 44, not 55/60. Also, technically, men can have a child at any age, but 44 is still a young enough age to have children. Look at the dirty dog Al Pacino having a baby at 83 with a 29 year old.\n\nThere's a high risk that any children they have may be born with health problems, particularly intellectual disabilities, due to the fact that they both share a large percentage of DNA.", "the fact that he told me to unalive myself and wants to see my kids, hes planning on having kids with her", "Did you even read the post??????", "If he said what I think he said to you, that's a pretty horrendous thing to say to a child.\n\nThings are very heated at present. I don't think your reaction is wrong. I do think that you might not always feel this way. Currently you're 22. You might feel differently at 30. The best thing to do is just see how it plays out, but if you don't want any contact with your father, that's perfectly within your rights.\n\nI'm curious as to what level of cousin we're talking about here? Is it first cousin or is it something like a cousin by marriage?", "If my father had ever said that to me I would be devastated and I would never forgive him. Live your best life op. NTA", "I'm sorry you had to even go through that. Definitely time to go NC, and try to heal from all that he's done!", "Sorry but he plans to have kids with her if she is most likely in a her menopause stage?", "My sympathies. I hope they don't have children, but if they do, that they are healthy for the child's sake. Good luck. You sound like you have a good head on your shoulders.", "Actually that’s only true for immediate cousins. I think the current science is 2nd cousins and our are “fine”. Not something I’d be testing but yeah", "first cousin", "im trying to heal but trauma is making it difficult x", "They're first cousins. OP confirmed this in a reply to me.", "It gets worse.\n\nI'm sorry to hear that your Dad said this to you. It's so incredibly hurtful.\n\nYou hold your head up high💪"]}