{"id": 21762, "submission_id": "14v19ju", "title": "AITA for not giving my friend more money than he lent me", "selftext": "Yesterday I (20M) was hanging out with my friend B (23 M) when we were invited to a poker tournament organized last minute by some other friends of mine. Unfortunately i didn’t have any money on me so I asked him if he could lend me seven bucks (which was the entry fee) so that I could participate and that I would give him his money back as soon as we hit home. \n\nI ended up winning the whole thing and earned a cash prize of 85 dollars and now B wants a commission on the money I made, saying that If I don’t give him more than the 7 bucks he gave me, it means I abused his trust, and that he deserves more because I wouldn’t even have been able to play without the money he gave me. \n\nI don’t see in what world I owe him more money because I’ve won, we’ve never agreed to that, so I only gave him back the money he lent me, nothing more nothing less. He told the story to a lot of our common friends and now a half of ‘‘em is saying Im an asshole and a stingy bastard for not giving him more while the other half is defending me.\npersonally, I think his points make no sense and I don’t see why people would agree with him, but maybe I’m just biased so that’s why I’m asking here. \nSo, AITA ?", "created_utc": 1688916183, "permalink": "/r/AmItheAsshole/comments/14v19ju/aita_for_not_giving_my_friend_more_money_than_he/", "score": 3176, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > My friend is calling me an asshole because he lent me money to gamble and I won but I didn’t give him more money than he lent me originally\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA.  If this guy is this greedy and pushy over 85 bucks I can’t imagine what he’d do if someone won the lottery or otherwise got real money around him.  He’s shown his hand and I would not give this guy an inch. Also never borrow anything from him again.", "If that wasn't the arrangement you made, then NTA.", "Nta\n\nHe's only entitled to what you borrowed", "NTA, what kind of friend is that ffs ?? Dude thinks his 7$ are some type of investment lol. \nHonestly if I give my friends 7$ I’d be like forget about it dude don’t even give it back it’s literally 7$ smh.", "NTA. It's not like you won millions of dollars... And even if you did, YOU won that money, it's not a group effort! He is being greedy.", "Your friend isn’t entitled to the money you won except the $7 entry fee that you borrowed. NTA", "NTA. You did not agree on the caveat that you’d have to pay more if you win.", "IF the agreement had been that you don’t pay him back and that he paid your admission as an investment, then you should’ve given him a cut of the winnings, because that way he would’ve run the risk of loosing all of his money. That’s how investments work. \n\nBut you didn’t do that, you simply got a loan of seven dollars that he always expected you to pay him back. With that arrangement the mist he could technically do is charge you “interest”, but even that would have to have been agreed upon when he gave you the money, not after the fact.\n\nI don’t see your friend’s logic and I don’t understand why half your friends are agreeing with him. What I could see is the merit in making a small gesture, like buying your friend a drink or something to that affect. But that’s only because you guys aren’t actually business partners, but friends. As such your friend shouldn’t be treating you like someone to make money off of anyways.\n\nNTA", "NTA you're friend is a d*ck and I'd evaluate the friendship. I'd probably give them more ($15) because I would be happy I won but they're not entitled to it. Smh for him to involve your other friends is a crappy move.", "NTA- $7 and no more", "NTA. You do not discuss sharing winnings with each other. I am a 29F and I gamble, and my friends know (Poker, Casino, Online Bingo, etc) , and they do lend me money, not because I have none, but because I often win, and  OUR discussion is IF I win, they get twice the amount  of what they gave me if I win more than 4x that amount. If it was less than that, I would add 10%. If I lost, they would NOT ask for their money back, since they know I was gount to use it to gamble. \n\n&#x200B;\n\nYou guys did not discuss it beforehand. He is not a good friend (just in this sense I hope), since he is making it your obligation to add more. He did not help you win the game, he just helped you enter. He just wants money because he lost.", "NTA\n\nYou borrowed $7 and you paid back the $7. Your “friend” is being greedy.", "NTA\n\nDrop him as a friend. It should have been established when he handed you the money. Furthermore, that was the cover charge, fuck that mooch.", "NTA. That's not how lending money works.\n\nEven if you earned a lot of money, if he gave you $7 so that you could play, then you should give him those $7 back after the game. If you want to give him more, that's up to you.", "NTA.. you only owe him 7 bucks", "NTA. If you had lost, would he be ok with you paying back less?", "NTA what he is asking for is not in the agreement you made", "NTA, if he doesn't get pleasure from seeing you win, then he ain't really your friend.", "NTA but I would have slipped him $20. Or at least $10.  You're still going home with more than you started with.", "NTA---You gave him back what he let you borrow.  He should have played the game better to win for himself!", "NTA you paid him back what you owed it’s not like days went by and you owed interest", "NTA\n\nYou don't OWE him anything extra. \n\nMe personally, IF HE WASN'T DEMANDING IT.... I would've shared my winnings just because. Not half but something. Not once you feel entitled tho.", "NTA. You stated you were paying him when you got back home and he said fine. He loaned you 7$ he got it back sooner rather than later and should be happy. But you have yourself a greedy friend.", "NTA\n\nI'm assuming he never made this caveat before lending you the money. He can't decide after the fact that you owe him interest or a commission because you walked away with more than he lent you.", "You owe him nothing, but giving him $7 and a 6-pack would have been nice.  It's just basic bro manners.", "If he said he was staking you the entry fee, that would entitle him to a share of both the winnings and the loss. Otherwise it’s a loan.", "NTA, if you had won thousands maybe giving him a bit extra would be nice but in this situation that’s all you owe him.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nYesterday I (20M) was hanging out with my friend B (23 M) when we were invited to a poker tournament organized last minute by some other friends of mine. Unfortunately i didn’t have any money on me so I asked him if he could lend me seven bucks (which was the entry fee) so that I could participate and that I would give him his money back as soon as we hit home. \n\nI ended up winning the whole thing and earned a cash prize of 85 dollars and now B wants a commission on the money I made, saying that If I don’t give him more than the 7 bucks he gave me, it means I abused his trust, and that he deserves more because I wouldn’t even have been able to play without the money he gave me. \n\nI don’t see in what world I owe him more money because I’ve won, we’ve never agreed to that, so I only gave him back the money he lent me, nothing more nothing less. He told the story to a lot of our common friends and now a half of ‘‘em is saying Im an asshole and a stingy bastard for not giving him more while the other half is defending me.\npersonally, I think his points make no sense and I don’t see why people would agree with him, but maybe I’m just biased so that’s why I’m asking here. \nSo, AITA ?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Staking or buying a piece of someone in a tournament is a common thing in poker, but that's an agreement you make before the results, not after. Your friend is a snake. NTA", "NTA because he’s obviously being greedy. But personally, I would’ve broken him off a piece since he was kinda the one who even enabled you to make that money to begin with.", "NTA. But burn that courtesy bridge at your own risk.  Don’t ever expect him to give you any help in the future.", "Key word is “friend.” He is not entitled to more than $7, but most people are more generous with their friends.", "NTA", "“You wouldn’t have played/won without my help..” That’s a guilt trip they want to throw at you.\n\nWhat if you didn’t win anything? You still would have to pay him back. \n\nLook at all possible scenarios and then you decide. \n\nAlso, let’s get this in order. \n\nThe agreement was to pay back even if you didn’t get anything. \n\nSo was your friend going to expect more money from you afterwards anyway?\n\nOr did they expect to get something from you just because he lend some money to the person that won a good amount?\n\nIf you won $10, did he expect those $10 from you? \n\n\nCheck all angles next time\n\nNext time though, realize that there’s people who will want something in return when you ask for something. \n\nOthers, would have congratulated you and never ask for anything more and probably wouldn’t have asked for the 7 dollars back. \n\nThe agreement has nothing to do with generosity and greed. \n\n\nIt has to do with these two “friends”.\n\nYou may just be both AH but without realizing it.", "NTA, but if it was me I would have thrown him some cash. You wouldn’t have been able to play and win if it wasn’t for him. It doesn’t have to be much, I would have gave him $15 back.", "Well, this is a difficult one. It would have been nice to give him a „tip” like 5 dollars, but absolutey you are not obliged to. I would say you are quite selfish but he is entitled.", "NTA but I’d have probably bought him a drink or something. He isn’t entitled to any of it, however, which makes him the AH for being demanding.", "Sorry, what? This was lending a friend 7 bucks, not an investment. He'd have a case if he would've been willing to lose the money if you fail AND if you both had agreed BEFOREHAND. Doubt any of that is likely.\n\nNTA", "INFO:\nIf you’d lost the money gambling, would he have expected you to have given him zero?", "NTA \n\nIf the positions were reversed, there’s no way he’d pay you a “commission”.", "Average interest rate on a loan is around 10%. Be fair man, give him the $7.70. NTA.", "I would have said ok and gave him 10. That’s it. But you didn’t agree to pay him more if you won. So NTAH.", "I mean, I would have rounded up to $10 as a courtesy, but it was rude of him to be demanding. I'm gonna go with ESH.", "YTA\n\nWe go to the casino with family. If I drive and there is a winner we all go out to party on the winnings. If the winnings are modest they pay for gas. I'd say that kicking down a $20 isn't a bad idea in this situation, but I'm not a cheapo. Your friend could have said, sorry, next time, but they were cool. Did you reciprocate, nope, \"not my problem........\" You're a selfish AH.", "Well in poker circles it's considered good form if someone spots you all or part of an entry fee then they should get to enjoy a split of the spoils above the repayment of what they gave you.\n\nIf you were aware of this convention then YTA, if not you're NTA.", "ESH here.\n\n\nGeneral rule of thumb is, if someone sponsors you in any sort of cash tournament, if you win, you give them a little extra. Perhaps it was your first time and you didn't know, but it's good etiquette.\n\n\nIf amount is low you normally offer a little extra, here for example 15$, and a real friend/a nice person declines and congratulates you on your win. If you didn't talk about it before, trying to force you is also considered rude.\n\n\nTherefore, ESH", "ESH. \n\nI’d have paid back the $7 and bought my friend lunch or a drink or something as a thanks.", "NTA, but honestly you should have given him a few extra bucks. When I lend people money I expect to never get it back, when I do get it back I appreciate it but I never expect more. When I borrow money from people, I always pay back AT LEAST the amount I borrowed, and I typically throw in extra especially if it took a while.\n\nIf you only pay him back the amount you borrowed, you're not in the wrong, but it's everyone's actions that determine how a friendship goes.", "Info:  if you had lost would you have paid him back?\n\nI would have given him $20 if he was my friend though.", "INFO: what is the law in your country regarding that? Because in some places, when you win something with the Money of someone else, you are obligated by law to share the prize to an extent with the person you got the money from to participate. \n\nNot saying if its morally right or not, but that could be a factor", "YTA... This is how gamblers do. If you don't like it don't play. There's always a vig.", "Wait... you didn’t have $7 but decided it was a good idea to gamble with what money? Your friend’s money. What do you think happens if you gamble with other people’s money? \n\nYTA\n\nTip your friend. You wouldn’t have won without his $7 bucks. Throw him $10 or $15.", "ESH- you couldn’t have played without the loan.   You should have given him part of your winnings.  That was the right thing to do.  He in the other hand is a jerk for asking, making a stink and complaining about the situation to your mutual friends.  So, he’s a whiny B and you’re kind of a scammer.  Neither one of you is a very good friend; you’re lucky to have each other.  I can’t imagine too many people enjoy spending time with either one of you.", "YTA you don’t have to pay him something but you should. It’s like refilling a car with gas after using it as a courtesy.", "At least pay him back what you owed him plus a bit for the convenience.   Money isn't free.   A bank would charge you interest, so he was kind enough to lend you when you needed it ,be kind enough to show some gratitude.", "YTA the only reason you were able to play/win really is because he was a good friend and lent you some money, personally I would have given him $14 back that way he hads doubled his money and you are still quids in - everybody is happy, I USED to have a friend just like you but I threw him to the curb years ago", "NTA.  But as they say, never a borrower nor a lender be.  You borrow money, people have expectations.  He wants a commission on the profit, but that only works if he wasn't expecting you to repay him if you lost.  Next time, just hit an ATM, or actually have more than $7 to your name when you go out.", "NTA \n\nDoes that mean if you lost a lot of money he’d forgive the debt because HE knew the risk of lending you money?\n\nI doubt it \n\nHe’s being greedy", "NTA and this guy is not a friend", "NTA 😆 🤣 that guys a true loser", "was he going to forget your debt if you lost? \nif he wanted to make into a investment, he should have said so from the start. NTA", "Homie lent you $7. You paid homie $7. \n\nHomie didn’t lend on the condition of paying more than the $7 if you won. \n\nHomie gets $7.", "NTA.  He's just mad/jealous because you won and he lost.", "NTA. If you had lost money, you would have still paid him back the full 7$. He doesn’t get to benefit from upside because he had no risk to the downside.", "Oh FFS…", "Would he have accepted less that $7 if you’d lost?", "Your friend is an asshole.  \n\n\nAsk him - had you lost, would you be off the hook for the $7 you borrowed? Of course you wouldn't, because what you owe him isn't dependent on how much you made out in poker. Give him the $7 and find yourself better friends.", "He only gets a share of the upside if he shares in the downside. So you paying him back whether you won or lost means it was just a loan, nothing more. If he wanted to buy some of your action, he should have said at the start.", "NTA if you would have lost at the game, would he only ask for half of the $7 too?", "NTA not to mention that this is a friend lol. Who demands “commission” from a friend?? But also, let’s pretend you went and got a loan from the bank and then used that money to win the lottery. At MOST the bank would only charge for the loan plus interest. So calculate a 5% interest on that 7 dollars and give him 7.35. Ass in an extra dollar for a tip to really piss him off.", "You have to state pooled winnings before hand - if he’d won would he have given you half?", "NTA and you only owe him the $7. All these y-t-a votes are stupid. If you were to go to the casino and gamble, he effectively put $7 in your hands and it’s yours now. They are extremely strict on who’s hands put the money on the table. If he had tried to claim any of your winnings he would’ve been removed from a casino. Lose the “friend”.", "Uh, your “friend” sounds manipulative, shady, and petty! If you wanted to buy him a drink or some other little thing to share your winnings, that would be nice. “Friend” is acting like a loan shark or something. Enjoy your winnings and question your “friends” character!", "The agreement was \"you give me $7 now, I give you $7 later\" so strictly speaking the agreement was kept.\n\nI think if a friend had covered my buy-in and I won, I'd throw him a portion of my winnings, say 10%, as a goodwill gesture.\n\nAll your friend has learned is never to lend you money again.", "YTA\n\nit’s kinda shitty for you to not throw him at least 20$. \n\nYour buddy lent you the cash that enabled you to win $85. \n\nBuy the man a six pk of beer fucking something. \n\nA good friend would have preemptively said something like I got you on dinner. You left him hanging in the breeze. \n\nThis sounds like the result of repeated stingy moments.", "INFO:  How much was he going to give you if you lost?  Share in the profits/share in the losses.", "Soooo. You are NTA but if he hadnt asked i would personally given him some because he kinda saved you", "NTA\n\nIf this is a first world country and you guys are above 14 idk what to say to this situation", "NTA\n\nBut if not for him you would not have won. Honestly I would have been like I won lets grab food.", "You don't owe your friend more than the $7, but you're destroying your friendship.  Hit the big jackpot? Who doesn't pick up a round of drinks or some food? Paying back 10 at a cost of 3 to you just shows appreciation.  If you ever need to borrow a few bucks again, need help moving, get a ride to the airport, do you think you can ask this friend?", "Soft YTA.\n\nDo you owe it to him legally? Absolutely not.\n\nOn a moral basis if I’d had a win like that I’d want to share it a little. Buy my friends a drink maybe. \n\nIf one has lent me money to get in I’d give a little more back as a thank you. Maybe £10-15 total.\n\nSaying that, if he’d immediately attacked you and demanded it I’d tell him to piss off.", "NTA at all but personally I would have given him a little more as a thanks. That said I wouldn't have done it if he demanded it like in this case. Yuck.", "Your friend is an idiot. So if you had lost, would you not need to pay back your friend? NTA.", "NTA he acts like you won a million bucks it was only $85🙄and if he wanted more if you won then he should have said that in the 1st place.", "NTA - years ago, my Dad would give us each $50. to play the horses. If we had more than that at the end of he day, he would get his \"loan\" back. (Not that any of us ever did.)", "He thinks he staked you, you said it was a loan. If it was a loan NTA. If it was a stake than he wouldn’t expect to be paid back if you lost but would expect a cut of the winnings", "NTA. Don’t fall for his whining. He didn’t expect you to win more money and now he’s just guilting you into giving him more. You don’t owe him that. You followed through on your promise and that’s good enough. I could understand if you two won that money together, then I’d probably tell you that it would be curtesy’ to give him a cut of the money but that’s not the case. \n\nHad a friend who was similar.  When I still lived with my parents and family, I was 19 and still trying to adjust to life as a college student. I had bills I was required to help out with at home and my parents would only help out with college If I chipped in too- which is fair. The thing that said friend held onto though, was despite me still having my own financial responsibilities, I didn’t have a rent payment. My friend, however, had moved out of his families home the year before, found a dirt cheap apartment on the scuzzy side of town and already lost it after 6 months of not managing his money and his time properly. He had already had two jobs that he quit for one excuse or another. Me and him, we’re best friends. We’ve been close since we were in the third grade. I love the guy. I’m aware though that he’s the type of person that just doesn’t make all the right decisions the first time around. Not that I’m the perfect person for advice on how to live responsibly ( I’ve made a few unsatisfactory decisions as well and I don’t hold myself to be perfect or better than my friend). He’s been this way for years at this point so when he called me one day, desperate, because he was about to lose his apartment because he was short on rent, I decided because he was my friend and I didn’t want him to end up on the streets, I helped him. I gave him 200 dollars to help him out, and I even told him that he didn’t have to worry about paying me back right away until he had the money to pay me back. \n\nBoy, was that the wrong way to go about that. The next time he contacted me it was a speeding ticket he couldn’t afford to pay. Me being generous, again, I was like, ok sure but just this once more and after that I have to focus on me. Radio silence from him after I gave him the money for that. A month later, he texts me in a panic telling me that he quit his job because he hated his manager and was behind on rent and that if I didn’t give it to him in the next five minutes he was going to be homeless. It was right about then that I started to see the pattern and decided that I wouldn’t help him anymore ( and I should add that at no point did he ever make an attempt to start paying me back. I would have even taken 50 a month if that’s all he could manage but nope, nothing). Roughly my “help” lost me almost a thousand dollars I couldn’t afford to lose at the time. He was pissed at me for months, but it did force him to figure out how to better his own situation without manipulating me into basically paying for all his bills. He and I are still loose friends, we talk occasionally but aren’t as close as we used to be. I haven’t talked to him in a while as of now, so I have no idea if he’s doing better or worse. This isn’t the exact same situation, I know, but you said that your friend wanted more money once he realized you had more and got greedy and I couldn’t help but think about how, if I hadn’t seen what he was doing and put a stop to it then i would have put myself in a bad spot.", "There was no sponsorship deal in place. He wasn’t covering you, he was loaning you cash. If you lost you still owed him $7. \n\nI *might* buy him a drink to say thank you but once he demanded more, he became the asshole. \n\nHe should have congratulated you and celebrated your victory like a friend. Instead he’s playing stupid ass games. \n\nHand him $10 and tell him to buy himself the friend he deserves.", "If he wanted more than $7 back, that should have been part of the original agreement. \n\nNTA", "I feel this sort of argument happens every time this thing happens. There is never a world where the lender won't be upset at only getting their lend back, and never a time where the lendee would be equally generous and reward their friend for their faith.\n\nESH. You shouldn't be obligated to pay him back beyond the seven bucks lent, but you are rather an ass to not pay something back beyond that as you wouldn't have had the opportunity without your friend's generosity. Does that mean 50/50? No way. But with the size of the pot giving something in appreciation wouldn't kill you to maintain good relations.", "NTA. It would be one thing if he established such a thing BEFORE the game. As far as I'm concerned you did nothing wrong and owe him only 7 bucks but he's being weird and greedy over a small sum of money.", "NTA, in business terms he sponsored your administration into the tournament and your repayment is reasonable in terms of a commission right there.\n\nIf you went home broke, would he have asked for the money back?\n\nI would find better friends in the future if I were you", "NTA if he wanted to “back” you rather than loan you the money that should have been made clear up front.", "Give him the $7 back & buy him a drink next time you're out.", "Winning $85 is a low amount nowadays. What kind of friends do you have who even think $85 is so much money that they should take part of it away from you? Its like wanting his share of a nickle...NTA", "So, if you lost the $7, he would have let you get away without paying him back?\n\nNTA", "NTA, but if my friend lent me the money I'd won on, I'd give them a little extra because I'd want to. I wouldn't if they were shirty about it, though. My Grandma and her pals would always go to bingo and split their winnings, that meant they could all go the next time. It really isn't something anyone is entitled to, but even slinging him 10 rather than 7 wouldn't exactly break the bank.", "I would give him back the $7 he lent me. Then, if I still wanted him as a friend, I’d give him the $7 he lost as well. Buddy did me a favour. I still come out ahead, and my friend got to play for free. Win win. \n\nOf course, you don’t owe him anything. But he didn’t owe you anything either. I think everyone’s a bit of an A H here, but if I have to pick the biggest, I’d say YTA.", "I'd give him $7.50 just to be snarky lol", "I'd maybe understand it he spotted you for the WSOP main event. But a 7$ tournament? Please that's ridiculous. NTA", "ESH. He's greedy and you're stingy.", "Ask him would he still want back his 7 $ if you lost?", "NTA. You didn’t agree to share any winning. He didn’t agree to cover any losses.", "NTA, he's not entitled to anything if it wasn't discussed previously, but is your friend a frequent gambler? Because this is \"good gambler's edicate,\" if that's such a thing. The fact is you wouldn't have won anything without his help, so cutting him 10% would be nice and \"good karma\" if you believe in that, and a lot of gamblers are superstitious which is why i ask about your friend. It's not owed, but don't expect him to loan you anymore money either, lol.", "NTA. Heck if he didn’t make that comment maybe you would have given him $20 as a thanks man (that’s what I would have done), but the entitlement is wild.. I also don’t gamble so maybe I don’t know the etiquette. If I was friend who gave you the cash and lost myself, I’d make some comment asking if anyone knows other good stocks to invest in or something as a joke, not ask you for a payout.", "Meh, Kinda ESH.\n\nStrictly speaking you don't owe him anything, so you're NTA for that, but he is TA for demanding some and trying to guilt you into it. With that being said, common decency suggests you should have gladly given him a bit extra without it being brought up, or at the very least bought him a couple of drinks and a pizza as way of thanks.", "NTA.  Wow.  He is willing to bring this negativity to your friendship over $85.", "NTA lmao I don't know what I expected when I read that you \"won the whole thing\", but it was definitely more than 85$ if he was clamoring for a piece. Had he made you aware of this expectation prior to loaning you the 7$ I'd agree, but he didn't. \n\nIf you want to be petty maybe give him 8$. :\\^)", "NAH. You don’t technically owe him more than the $7 he lent you. However, he’s right—you wouldn’t have been able to participate and win without him. Rounding up to $15-$20 would have been a nice gesture. He can’t demand you give him more than $7 but you also can’t blame him if he holds a grudge.", "NTA, you didn't agree to share the winnings at the beginning. you asked for a loan of 7 dollars, and you paid it back.   \n\n\nThat being said I'd have treated him to dinner, drink, or coffee whatever was time appropriate as a thank you. And if we were going in separate vehicles to separate locations.  I'd have probably given him a 10$  in that case instead as the thank you.   \n\n\nyour still NTA, but walking a fine line.", "NTA. Had you loss, would you have owed him more? Had you bought a sandwich with the money and gotten sick, would he be responsible for your medicine? What a crazy concept your friend created to benefit himself.", "Esh. Be generous to your friends (round up to 10) but don't ever loan anything expecting to get interest, just be happily surprised when you do.", "Give him $8 and then politely tell him to F-off.", "Fuck that dude, give him his 7 bucks back in Pennies!!", "NTA. He could have made that a condition of you winning before you won. That wouldn't be unreasonable. But if he didn't then you just owe him the 7.", "In what kind of world are you the greedy one in this situation? He gave you 7 bucks, you give back 7 bucks. He never mentioned \"i expect a commission if you win\". Isn't he asking about it now also \"breaking your trust\"? \n\nNTA. Tell your friend to get a grip, and consider keeping someone so shitty in your life.", "NTA.  It was clear from the get go that it was a loan, not a stake in the game.  If you GIVE someone money play poker, that’s a stake and you’d be entitled to a percentage of the proceeds.  However, it was clear to both parties that it was a loan.  According to the friend’s logic, if OP had lost money, then OP could have been justified in saying that he didn’t need to repay the money.", "Former pro poker player here (I played during the internet days, and quit when the USDOJ confiscated my $30k bankroll online).\n\nYou do not owe him a part of the winnings unless you guys agreed to it before hand. In that situation it's called a \"stake,\" and you'd agree to the % cut before hand.\n\nIf he just lent you $7, and you made no such agreentb beforehand, you pay him the $7 back - that's all.", "Once he handed the money to you, it was no longer his money. It was yours to gamble with. His claim is moot. Had he won, which would have included the $7 he loaned you, would he have negated the loan or still expected the repayment? You paid him, end of transaction!", "YTA. He’s got a point in that he placed your stake in the money, so you probably should have given him some of your winnings - it seems reasonable for you to at least chuck him a 20, if not splitting the lot between you evenly. I strongly suspect that next time they do a poker tournament, you won’t get an invite.", "Nta and time to find new friends.", "YTA. I don't think you should have split it 50/50 but 10-15 percent would have been reasonable.", "ESH. If I borrowed money off someone for gambling and won big. I'd be like, hey dude, here's a bit extra cheers for the help man. Even giving him 10 would have been gracious enough. He shouldn't have expected it though. I wouldn't expect it, in the sense of I'd expect my money back but it all depends on the friendship.", "What if you lost $100, would be be liable to pay some of it since it was his $7 that got you into the game?", " I usually give people back whatever they lent me, that being said, it’s only 7 and I don’t think Any friend should react like that over $7. Id say give him $8 since he wants more than 7 😂. NTA though", "If you lost would have he wanted the full money back, or less?there is your answer. NTA>", "Oh give the guy $10", "NTA", "NTA. You had an agreement, your 'friend\" just got greedy and showed their true colours", "Former professional poker player here, this is hard to pass judgement on anything without more info, so I’ll just lay out scenarios. ( I am aware this is a home game fuck around tourney ) Independent of the amount, if anything was made clear or insinuated along the lines of he is staking/backing you, then without a % amount talked out I’d be giving him minimum 40%. If it was clearly stated it’s just a loan, should give him like an extra couple % back ( normally we’d just do like dinner or drinks along that line, but with $7 that seems excessive, just buy him ice cream or a beer).", "NTA, if that was part of the arrangement it should have been talked about before he lent your the entrance money. It’s not like you won a bunch of money, it was $85 (better then nothing obvs).", "Ironic considering he’s the one abusing your trust", "You're not an asshole but your friendship sounds sort of transactional and your story makes it seem as though you both may lack emotional intelligence. You're under no obligation to do anything more than pay the friend back, but in maintaining rapport and relationships, when you come into a win with the assistance of your friend, you could voluntarily share a little of the success as a gesture of appreciation and goodwill. That said, it's pretty tacky of your friend to even say anything about it or imply that they are owed something.", "As someone who goes to the casino, I have friends that ask me for money while there all the time...but I have a rule...if you use my money and win, I get half of what you win.  If you lose, you don't have to worry about paying me back.   These rules are established upfront.   I gave a friend $200 the other day, and he won $1500.  I got $750, and he got $750.   (Actually I won $550 because $200 was what I gave him.)\nYou have to establish the rules upfront.  NTA", "NTA you borrowed money and paid it back, however he did loan you money that in turn let you win the tournament so you do look kinda cheap and thankless not giving him a bit extra( I would say give back 10-15). But he is kinda wrong for expecting it and making a big deal out of it because you didn’t.", "NTA.\n\n  \nIf your \"friend\" wanted a piece of your action he had to ask and you had to agree to the cut before the cards were in the air.  Waiting until you win is low class and everyone here even suggesting you owe him anything are wrong.", "NTA\n\nHowever, he gave you the money because you guys are friends, and you wouldn’t have been able to play and win if your friend didn’t step up and help you out.  \n\nYour friend was under no obligation to lend you money, even if you said you would pay him back immediately afterwards.  What would have happened if he said no?  Would someone else have lent you the money? Or, would you have missed out entirely and been unable to play?  And last thought - Would you be upset with him, even though he didn’t HAVE to lend you the money?\n\nYou’re under no obligation to share your winnings with him, but you would have strengthened your relationship by throwing a few bucks his way or by offering to buy his next drink or meal as a show of appreciation for him willing to invest in you.", "You're not an asshole but the nice thing to do to a friend would be to like give then a tenner in stead of 7 bucks.   Just a little thank you.", "Yta he did a nice thing by lending you 7 bucks, if you won 85 dollars the nice thing to do would be to show you appreciate his kindness and give him like 20 in total or something. I would consider it rude to just give back the 7 dollars and I would remember it the next time you need a favour.", "I’d give him some extra. You just made a decent profit and you wouldn’t have if he hadn’t loaned you the money. At the very least buy him dinner and drinks.", "My question is if we turn the tables then will this friend given OP the same amount of money he's asking ?\n\n Ofcourse he won't. \n\nNTA OP", "[removed]", " I typically throw in extra especially if it took a while.", "[removed]", "Yeah he would only be right if there was no explanation to pay back the $7 if OP lost it.", "Meh it's a little bit of both. There is nothing wrong with what OP did. But I personally would never borrow money from a friend to go gamble, win 12x the amount I borrowed, then count out exactly $7 to give back. At minimum I'd throw back atleast $10 or possibly a but more. Dudes a jerk for saying anything about deserving more, and acting entitled about it. But I just couldn't imagine a world where I borrow money from a friend to go gamble, win back over 10x the money, and don't pay them back a few extra bucks as a thanks.", "You guys did not discuss it beforehand.", "Or, you might go \"hey dude buy me a sandwich\".", "To be fair, I think I would be miffed if I lent someone a 7 $ entry fee and they won a million dollars with it, only to give me back exactly 7 $. I wouldn't demand it but I would see the friendship in a different light. I'd give my friend more if they lent me an entry fee.", "I vote for the $20 as a good sport winner. If he did not loan you the entry fee would would have nothing. You are still ahead. He is a AH for bitching about it.", "Pretty much", "I agree. If it were me I would’ve threw him an extra 10 bucks or given him a 20 back instead of 7 but that’s just me - and the people who are on his friend’s side. However, you were not obligated to do so and it’s your money to do what you want. For the sake of your friendship you could buy him a drink or a burger next time you hang but again you are not obligated.", "Among actual gamblers, it's considered etiquette to give half of the winnings if someone paid for you to participate in gambling. If you get a lottery ticket as a gift you should share the winnings with the person who gifted it to you. \nBut I'm not sure how it works if someone *lends* you the money to participate.", "You’re my kind of petty lol", "This exactly. \n\nEvery one in this sub is turning a friendship into a contractual agreement. \n\nPretty sure if this dude won 300 million in the lotto he wouldn’t give his buddies a cent..", "Of course I would’ve paid him back, it wouldve just been a few hours later than if I had won.", "This doesn’t apply. He just loaned him money and was going to pay him back regardless", " I was my understanding he just didn't' have cash on him (I could be wrong). I probably would've tossed my friend a $10 being like your share but I don't think he's entitled to it and OP is abusing his trust?", "yeah, no. if you borrow something, unless otherwise specified, you give back what you borrowed. if you expect more when you loan it out, you MUST say as much", "Perfect analogy. If I borrow my friend’s car, I’m bringing it back with at least more gas than it had, if not a full tank. If I use the car to go get something fun (food, games, alcohol), I’m offering some to my friend. \n\nThese aren’t required acts by any means but I’m shocked most people in this post don’t think it’s a social taboo to NOT make these gestures for your friends.", "But when was that discussed? They both agreed that OP would give him back HIS money… not earnings.", "just because YOU would have given him back double does not mean that is what the standard is. what is borrowed is what is returned, unless otherwise discussed. you sound like the entitled friend", "If you lent me $3 for a bingo ticket and I won that $3 back, and paid you that $3, are you still expecting another $1.50?\n\nIf so, sounds like your friend was lucky you “threw him to the curb”", " It should have been established when he handed you the money.", "Comment stealing bot.", "Yeah, I’d just give a little extra as a thank you. You got me, I got you. Nothing serious.", "It's just being a good friend. Who bums 7 bucks off someone, wins 85, and then just gives back 7. That's a 5 and 2 ones. Didn't even round up to a 10.", "Comment stealing bot.", "Is probably give them a $10 as well, maybe buy them a drink too.  Regardless, nothing is owed.  If OP lost, friend wouldn’t accept $3 as repayment.", "Idk I don’t really consider why my friend borrowed money and wether or not they made more money out of it, not only that, if they tried to pay me more than 7$ I’d laugh and tell them to fuck off. \n\n\nMaybe it’s just me but wether it’s for a sandwich or an entree fee for gambling, i really really don’t see myself getting pressed about what my friends did with 7$ nor will I accept „tips“ if they won or whatever people in the comments are talking about. But hey! To each their own. \n\n\nPs: also, in ops place I’d give the „friend“ the entire 85 bucks since they desperately want it and cut them out of my life forever, ✨I guess I’m dramatic like that✨", "Yeah, this seems more of an ESH. Friend is absolutely out of line for demanding a share, but OP at the very least could have returned $10 or $20. We're not talking high stakes numbers, here, lame reason to tank a friendship.", "Yeah, I guess it might just be where I'm from, but I thought it was kind of a standard that if you're gambling with someone else's money and you win, they get half the pot. \n\nThat's how my friends have always done it anyway.", "With that being said, common decency suggests you should have gladly given him a bit extra without it being brought up, or at the very least bought him a couple of drinks and a pizza as way of thanks.", "Yea exactly I would appreciate a sandwich in return ngl.", "There are collectible card games, where lending cards so one can participate is pretty common.\n\n\nIn such cases a 10% cut of winnings up to a certain amount, let's say 1k $, is considered good etiquette. I would have used the same amount here.", "Okay you aren’t the asshole but I think it would have been nice to give him $20", "It’s very bad karma to not pay out accordingly on a win.\n\nFriend throws $5 on a March Madness square you win $100. Friend gets a $20. Friend pays for a golf tournament, team wins cash prize, friend gets the biggest cut. It’s just the way it works. Without friend’s money no one wins anything. \n\nSo either pay your own way or don’t play. Or just be a cheap friend....", "Of course if you borrow 20 you only owe me 20. Winning money with borrowed money and not giving them anything seems unappreciative. \n\nI’d never dare ask like OPs friend bc I have no right, but everyone I know would definitely spread the wealth", "For crying out loud. Can’t upvote or interact with anything anymore without it being a fucking bot", "On the other hand [pun!], would the 'friend ' accept less than $7 had OP lost?", "That's all that was owed\n\nIf OP had found $80 on the ground, would they be obligated to give more to the lender, since they wouldn't have found it if they didn't get into the building? No, because gaining more money after a loan is given does not make the loan go higher, just for the sake of it.\n\nIf OP had lost, gone home, and found $80 on the ground, would they be obligated to give more than $7 to the lender just cause they have more in their pocket now than they did before?", "That's called staking, and it means if you lose you don't have to pay them back, this was a loan.", "My mom and I were just discussing this and she completely agrees with you. As for me, both have positive points. But if I were in his shoes then I would have given him more that what I've borrowed.", "10% of $85 would have only been an extra $1.50 for his friend though, and I feel like counting out those coins would seem a lot stingier.", "i would compare it to tipping, except the tipping culture in america (the only one i know) is absolutely off the rails. you're right that if he gave more, it would be very appreciative of him, and a generous offer. doesn't make it the required act, however. personally, i would do the same, giving probably double, if not half of the winnings. but that's because anyone i'm comfortable borrowing money from i'd be close enough to that i would consider them family", "This one did two on the same post.", "IDGAF. Edit to add that borrowing money to gamble is stupid. I don't care if OP is good for it.", "I meant 10% on top, I hope you would also return any cards you borrowed. 😂 So about 15$ in total in this case.", "I agree. I’m wondering if a lot of these situations is people realizing their “friends” don’t really care about them.", "Gambling, loans, etc.\n\nIf you pay on time and there are no interest fees added, you pay what you took.\n\nIt was lent money that was paid back ASAP. OP winning extra money has nothing to do with the initial agreement. Period.", "Hmmm, well then I guess you wouldn't buy stocks on margin.", "to be honest, it's a weak friend that doesn't offer. and it's a tool who demands more than was loaned.", "I gamble 2 or 3 times a month. You can drop the pretension", "NTA but thats being cheap. Bros share winnings. Should’ve given him at least $10, but $20 sounds better. Half is too much unless you agreed beforehand you were partners. \n\nOr next time you go out, his drinks are on you. \n\nFor decades I’ve gone on gambling weekends with my best friends from college and big winners always pick up an extra tab or two. We also don’t loan money to each other, not for gambling. Maybe if someone didnt have cash at a particular moment for cover or taxi or whatever, but not to play more.", "NTA. I'd ask what he expects. If he says half give him 10.50 and tell him he got a 50% return on his investment just to piss him off.", "NTA, the deal of the loan was you would pay it back in full when you get home with no interest. That's it, no other terms. \n\nDoes the bank demand more money back when you use their loan to start a successful business? No. They want the money they lent you plus the agreed upon interest.", "Give him back his 7 dollars and call it a day", "NTA.", "“Abused his trust”? He trusted you to pay him back the $7 and you did.\n\nNTA", "He'd want $7 if you lost in the first round. NTA", "YNTA- This is poker. If you and your friend didn't have an agreement to split any potential winnings, or to pay a small amount for him lending you the buy in, then you only owe him the $7. Sure you could have given him $10 as a thanks, but I wouldn't now that he's demanding, and bad mouthing you to mutual friends. It's $7, not $7000, your buddy needs to get over himself. Jealous, sore loser.", "You’re both petty beyond belief. You borrowed $7. He’s arguing over less than the cost of a McDonald’s meal. You won over $80, and you’re still too stingy to throw even $3 extra his way. You’re the type of people who bring out the calculators when the check comes for dinner.", "ESH\n\nI think generally good manners means when someone does you a favor, you can return it plus some for their trouble. If I borrow someone’s car I return it with a full tank of gas, if I borrow money I pay it back with interest, if someone pays for my lunch I venmo them rounded up the next dollar. I think that’s good manners, he didn’t have to give you money so you could show your appreciation by give the $7 plus a little extra for the trouble of him giving you money.\n\nThat being said I wouldn’t call someone out for doing something like that. \n\nSo everyone is the AH here.", "So morally sure you’re in the clear but are you an AH? Kind of. Most social conventions would suggest you give someone a cut for buying you in. I’d honestly have given him $15 since $14 is double the entry and I like round numbers. You don’t have to but expect people to think you’re rude.", "Come on man, you could have broke off $20 for him.", "Abused his trust is a bit dramatic way of saying it.\n\nI do think you owe him a tip though, be it money or a nice gesture.  If you don't then you're TA.", "You don’t “owe” them, but winners in Vegas often tip their dealers and servers a little extra, and he’s your bro, so throw him a bone.\n\nOr a gesture like giving him the $7 and saying “I owe you a beer next time we go out” or something like that, would have been nice and gracious at the time (but would feel forced at this point)", "ESH. You’re a cheap bastard. I’m a cheap bastard btw. If you’re considered “good” at poker and he staked you, then you should have expected up to half. But possibly with no return if you lost. I’d probably have given him a ten. Maybe a twenty tops depending on life circumstances for both of us at the time.  But to actually say anything about it to you makes anyone more of an asshole imo", "ESH. He could have waited for you to offer to buy him a drink or throw him a twenty dollar bill. You could have given him a little extra as a token of your generosity.", "ESH you don't owe him more than the $7 but your good fortune was enabled by him lending you the money. It would have been a decent thing to show appreciation with like a 6 pack or paying for food on the way home after the tournament or whatever and appropriate gesture is for you friend group. He's being super petty and entitled to expect a cut though.", "YTA he's your friend isn't he? He spotted you some money so you could play and you won it all. You don't have to split it 50/50 but at least buy the dude dinner or something. Stingy is right", "ESH  \nThere's a reason paying interest in a loan is a thing. He did you a favor and you acted pretty selfish and stingy after you won. He's getting insistent on it and it was $7 so boy a huge deal.  But still. You guys both lack friendly etiquette. Good luck getting a favor out of him next time.", "Yta, I would have given them 20$ and called it day. They scratched your back you scratch theirs", "Yeah honestly you should have given him like $10 because he spotted you and that would have been the cool thing to do. Doesn’t make you TA but doesn’t make you awesome either.", "YTA I think if your friend covers your entry fee they deserve a share even if it wasn't agreed before. The argument that they would have been paid back even in the loss is overridden by the fact they didn't have to lend the money in the first place. It shouldn't be 1/2, unless that was the agreement, since your skill and luck were involved, but I would have given back at least $15. That's what a friend should do, share their good fortune.", "ESH, but your friend sucks more. It's considered polite to split the winnings in this situation, at least where I'm from. I'd have given him $20, since you wouldn't have won anything without him. Your friend sucks more for demanding it, and bringing your other friends into it. Sure, it may be the polite thing for you to do, but he sure isn't legally entitled to anything! He isn't much of a friend if he's badmouthing you in your group over a portion of $85...", "Give him 15 but no NTA", "My friend did this. He gave me 10 bucks, I won the jackpot. He made everyone split it I was so pissed.", "ESH, but lighter on you. If he immediately demanded more money, that's a gross move, the only reason I think you're not in the right is because if you're really friends, you'd recognize that without him you wouldn't have made the 85 and you should use some of the money for something to celebrate (you're under 20 so I guess you can't buy him a beer but something along those lines). You could've even deflected with that, saying yeah here's the $7 and let's grab some late night food with my winnings, or something similar.", "ESH — but him a lot more than you. \n\nLook, I used to play magic the gathering a local shop every week. Sometimes I lent a spare legacy deck to another player who had forgotten theirs at home or who was just interested in mine. I also once showed up and had the wrong bag with me and borrowed a deck from someone else. Three times the person with the borrowed deck won around $100 or similar in prizes (once I won with the borrowed deck, twice they won with mine). Every time people made sure to give something like 20% of that winnings as a gift to the person from whom the deck was borrowed. \n\nI think demanding that kind of consideration and making an issue out of you just returning the lent money is WAY WAY worse than not offering something to your friend in thanks, but I’d also be much less likely to lend you the $7 next time if you don’t want to share your success with a friend who helped to make it happen.", "YTA. You used his money to play. Technically you only owe him what he lent you but the kind and friendly thing would be to give him a $20 or buy him dinner or something", "YTA.  You wouldn’t have anything without that $7.  The right thing to do is share some of your winnings.  I \nthink it’s just assumed that a friend would share their good fortune.  Now go argue over how much is enough.", "YTA for being cheap. You could have easily gave him $15 back and profited $70", "If it wasn’t for his 7, you’d never would have made 85, cheap skate! I’d double his money and call it a day.", "YTA— I would never lend you a dollar again", "NTA personally, I’d give him like $10 but you no longer owe him anything.", "NTA. I went to the casino with some friends and didn’t want to pay the atm fee. When I go gambling, I like to start with more than any of my friends, usually $100 or $200 more because I like making bigger bets. My friend spotted me $400 and the group hit the craps table. After a bit of bad luck, the table luck turned around and we all made out great. I was up $600 after paying my friend back the $400. He did not ask for or expect a dime over the original $400. I would have sent a venmo to him had I lost it all. You could round up to $10 to pay him back for convenience if you didn’t have 1s, but that would just be a courtesy move really. Your friend sounds like he kind of sucks.", "[ Removed by Reddit ]", "NTA unless he was willing to forgive the debt if you lost everything then he is not entitled to the winnings on the loan that was given. you paid him back the amount loaned thats all you owe. now if he had said when he loaned you the money that if you win then you owe me a percentage then thats different then you would have had the choice to agree to that or disagree and not borrow. you can't change the terms of the loan after the fact.", "Personally, I’d probably give him a 10 just to round it up as I hate “broken” numbers (anything that ends in anything other than 5 and 0).\nBut that would be me and because I wanted to, not because someone guilt tripped me into it", "$7 + a beer would be the appropriate payment back for a mate.", "You owe that dude exactly $7. Asking for more than that is him fucking with your money. People that fuck with your money need to be purged from your life with a vengeance.", "NTA but a bad friend is all. No worries!", "I'm sure if you lost her would have forgiven the loan. /s NTA", "Technically NTA because you repaid what you borrowed and did not agree to share your winnings. The decent thing to do would be to give your friend a tip, but him being an entitled dick about the 'commission' is gross so screw him.", "Technically you're NTA, but you're stingy AF with your friends. I mean damn at least drop him 10 as appreciation for helping you out. You're treating him like some random and not your bud that spotted you some cash when you asked.", "Id round it up to a simple 10$ and call it a day NTA. Friend just sounds kinda greedy? Like if u borrowed the 7$ to order a coffee would he be mad that u just paid him back? Why do you owe him commission? No contract was signed about this loan lol", "NTA.  You told him you would pay him back the 7 dollars.  That was the agreement.", "NTA give him the $7 and not another penny and seriously reconsider hanging with him anymore.", "NTA.\n\nIf I had lent the money, I wouldn't expect anything beyond the $7 back.\n\nIf I had won and my friend said nothing, I'd probably give them $7 and also buy them a drink. But if they insisted on more would only give them the $7.", "If he was staking you in exchange for a percent of your winnings (which is a common arrangement) that should have been agreed in advance. Otherwise NTA and you only owe him the $7 that you would have owed him win or lose.", "NTA if it wasn't agreed to when he handed you the cash, you only owe him what he gave you initially.  That being said.  I personally would have thrown my buddy a 20.", "NTA, you don't anyone mora money than what you asked for. That way, I do believe you should have given him 10 bucks instead. Just so he would shut up and don't make a fuss.", "Give him $8", "NTA - you borrowed money, you owe what was borrowed either way.  He is acting like he staked you in which case if you would have lost you would have owed nothing.  Cant have the best of both worlds.", "I've seen literal strangers at casinos give up a couple bucks to let their neighbor double down or split when playing blackjack. None of them ever asked for more than their \"loan\" back if that person wins. Trying to pull that on a friend is just shitty. NTA", "NTA if he is being that greedy over 85 bucks I can't imagine. Dude is upset you won some money and wanted more. Your friends are just as dumb as he is.", "Not your friend.   Block.  Enjoy your winnings.  NTA", "NTA but I think I'd give him 10 instead? Just as a thanks", "NTA, tell B to suck a fat dick.", "NTA, and you just found out which people are your friends.", "NTA. Was friend going to cover your losses as well? If not, there’s no reason he should be entitled to your gain. It was a loan. You paid him back.", "Was he going to cover part of your losses if you didn’t win?  Because otherwise he was not an investor, just a lender.  NTA", "Give him 1 extra dollar and cut him out of your life. Nta", "NTA. He didn’t stake you to the tournament, he lent you $7. Buy him a beer if you’d like, but you’re not obligated to repay more than you borrowed.", "Give him one (1) extra dollar.", "Nope NTA your “friend” though 🤔", "NTA your friend is just being greedy.", "Your friend is stupid.\nUnless you agreed to pay him back with interest, you didn't do anything wrong.", "NTA. The classic “I gave you a lottery ticket that won, now I’m entitled to half as you’d have nothing if I didn’t give it to you” scenario. He’s not entitled to more than the $7 he “staked” you.", "Personally I think this one’s a bit tricky. \n\nThe fact he’s asked I think makes him a bit of a dick….but if it had been me I’d have definitely given him a little bit extra when I paid him back. \nCover his stake too or something. \n\nYou wouldn’t be up if it wasn’t for him, the least you could do would be to make sure he wasn’t walking away down.  We’re not talking big money here!\n\n\nSo my verdict…..you’re both as bad as each other. You’re supposed to be mates. Go for a beer and forget about it.", "NTA but give him $14 at least he doubled his money. You guys are really arguing over $85 prize it’s not like you really won any money", "NTA. But if he’s a friend and made a big deal of it I’d prob give him and extra $3 so $10 in total. I might even have just gave him a $10 and said thanks for the entry fee straight away. But you are certainly not obligated to do it and he is quite audacious to ask for it. So I think it would be a nice thing to do but definitely not required. And depending on how much of rude he is being about it I might not give him the extra $3", "What? NTA, geez.\n\nYou borrowed money. You paid it back in a timely manner.  There is no other obligation to borrowing money unless there's interest involved.", "NTA,  because you two had already agreed to pay him back exactly what he lent you.\n\nIt does happen, usually  with professional poker players, that someone will sponsor them.  Meaning they cover the entry fee for a tournament; in exchange for a percentage of their winnings, however, if the player loses, they don't have to repay the entry fee.\n\nThe key to all of this is that everything is agreed upon beforehand.  You never agreed to give your friend a portion of your winnings.  Would your friend be happy to get nothing if you lost?  Because that is the risk that a sponsor takes.", "I would have gave him 8$ and said done.\n\nNTA.", "NTA but I’d probably have given him $14 bucks back. $7 for the entry $7 for a thank you. He could say he doubled his money and you still leave with $71. Win- win IMO.", "And now you have learned not to lend or borrow money from friends", "NTA, but it sounds like you've learned a valuable lesson about friends, money and clear communication.", "I also deserve a commission from your poker winnings because without me you wouldn’t know that you’re NTA", "NTA as he only borrowed you the $7 so you only owed him $7 back and he should've been clear that if you win anything in the game because of the money he lent you then he'd except a cut of the winnings but me personally I'd have still given him a cut of the winnings anyway out of courtesy and manners as without him lending you the money you wouldn't have been able to play and win that money to begin with so...", "It’s not like you guys were gambling, you busted, and he helped you get back in, it was a straight up loan because you just happened to not have cash on you for an impromptu game. If I’m him, I’m loaning you the money because I want to get to play with you. Sounds like he’s just salty he lost.\n\nNTA", "It sounds like you have only about half the friends you thought you did. Sorry for your loss OP. NTA", "Is he that good of a friend if he is willing to sell you out for seven bucks?", "NTA technically since there wasn’t an agreement \n\n**BUT** Ive been in that scenario and would always throw the lender & dealer $10-$20 if I won, that seems like common courtesy atleast with the people I play with.\n\nIf I spotted someones buy in and they didn’t slide me a couple bucks I wouldn’t care I would just assume the person is a cheapass. Gambling with people who are stingy usually isn’t that enjoyable.", "ESH", "It would be one thing if you guys negotiated a stake or he was just buying you in.  But the fact that it was specifically a loan means you're not really obligated.  But if he played and didn't cash and I were you, I would still prob toss him his buyin back.", "Dude go half is 85 dollars really worth losing a friend, also yea you are a tight wad", "Nta. It was 7$ and you only won 85$ (which is way better than not winning dont get me wrong) it’s hardly enough money to worry about. Would it have been nice if you tossed him and extra 5$ or whatever as a “couldn’t have done this with out you” gesture ? Sure, but it was in no way an obligation or necessary on your part. Especially after he asked like. I would have wanted nothing less the second the question came about if it happened to me lol you paid him back as you said you would no harm done.", "NTA\n\nUnless he took 2nd place (which is unlikely given how you phrased the story) you entering had no bearing on what he recived from that contest. You borrowed money, you repaid the money, that's all there was to it. Ask your friends if a bank should take a cut of a jackpot that someone bought a ticket for using a loan from them. Or just say that you thought he was joking because it's so ridiculous, but apparently he took it very seriously since he's asked all of them to ruin their friendships with you over less than 100 bucks.\n\nAlso, if you want to talk about stingy, what kind of friend asks that in the first place? It would make sense as a joke, but damn. \"I gave you a loan that only lasted a couple of hours, gimme several times that loan amount\" is what loansharks say, not friends", "NTA. If he wanted a share of your winnings that should have been agreed upon upfront.", "NTA\n\nYou never agreed to give them part of your winnings if you won, and you didn't agree to pay interest on the money either.\n\nYour friend is just salty that they didn't win, and is now trying to manipulate you. Honestly if any of your friends are agreeing with them, I'd say it may be time to find some new ones.", "NTA. since there was no agreement before hand that you would give him some more money if you won then no you don't need to give him more money. also you didn't even have the $7 you borrowed for 24 hours and it is not like you borrowed a large sum of money either. and its not like you won thousands of dollars it wasn't even $100.", "NTA, give him $10 as $3 will be his commission. Or look at it as a tip.", "In poker usually when someone stakes you they get their original stake back plus a percentage of the winnings, but you would’ve had to agree on that before hand. If y ok didn’t then 🤷‍♂️", "NTA. This guy is showing controlling behavior. Dump him.", "NTA.  If I lent my friend 7 bucks and they won 85 bucks I'd be happy for them.  7 bucks is also nothing and if they offered to give me the 7 bucks, I'd be fine with that.  Trying to get a percentage of 85 is really shady.", "NTA", "ESH. \n\nTo recap: He did a nice thing for you, by lending the money. But followed that with a dick move by asking for more than he lent out. \n\nYou are returning his money, but not are doing anything nice/on-top in return. \n\nYou're an asshole for not doing something nice back to him with the money, like giving him an extra tenner or buying a meal/round of drinks for him. \n\nBottom-line: You are absolutely correct that by the letter of the law you don't owe him more but in polite society if someone does something nice for you then you do something nice for them in return.", "YTA.\nMy reasoning is if it weren’t for his 7 you would have played. But I would have given hi. 10 back. A little extra. Nothing like half your winnings. But his demanding it is weird.", "Is he a loan shark or something?? 😂😂 NTA", "NTA. If you lost at the tournament would you have been able to give him less? No. It doesn’t work that way and he just can’t ask for extra money after the fact. If he had said to you at the time I will give you the money but you need to give me X% of your winnings then he would have a point but you had no such agreement.", "ESH\n\nHe lent you seven dollars, so you are only obliged to pay him seven dollars. If I was in your situation, though, I would have paid him a little more because he’s a friend. Not something crazy, just like ten dollars. He’s right that you never would have won anything if he hadn’t lent you the money, but he was being greedy and rude by demanding you give him more than seven dollars. I wouldn’t have even asked for the money back if I was him because friends are supposed to do favors for each other.", "NTA. But I would have tossed him a few bucks anyway.", "If it involves gambling and a win, I will absolutely pay back more.  I wouldn't have won if it wasn't for them loaning me the money in the first place.", "My ex (at the 22) and I (20 at the time) went to play Bingo one night and he paid for the card and then promptly left me with his mother and grandmother to play. That was fine, we had a great time until...I won the $500 jackpot! He was PISSED and wanted ALL \"his\" money. I gave him the card fee plus a 10% tip and told him to shove it, I did the work. His mother and grandmother agreed with me and took me home. He later apologized profusely after his mom and grandma got a hold of him. Issue resolved. However, the fit he pitched was epic. Hence, ex. He showed me his true colors and I was done. Stand your ground. You won it, he's jealous. He can shove it. I'm much older now and I'm still the same way. Don't back down. I did the right thing then, you did the right thing now. Your friend is just showing you who he really is. The question for you is, is it worth it keeping him in your life? So NTA!", "To make this kind of claim, the guy would have needed to SPONSOR you. \n\nIf you won, you divvy up the winnings according to the prior agreement. If you lose, he takes on the loss.  It doesnt sound there was that type of agreement in place.\n\nAccording to you, he LENT you the money.  You won.  Congrats.  You paid him back what he was owed.\n\nNext time (and there shouldn't be a next time the way he badmouthed you) he should offer to sponsor you.  I would consider sponsoring you.\n\nNTA", "NTA He sounds greedy. If I had been the lender in that situation I'd just get my money back. If there was an agreement made at the start to go ebzome great, but he didn't because he didn't expect you to win in the first place. Either way he sounds scummy and not really your friend", "ESH but mostly your friend is TA in my opinion, yeah he's not entitled to anything as that wasn't the agreement. But him loaning you that money gave you the opportunity to win that money. As others have said, I'd throw a little extra their way out of high spirits and because like I said he enabled you to win that money.  \n\n\nThat said if the shoe was on the other foot, I wouldn't be mad at the friend I loaned money to for getting the exact amount back. I might rib on them a bit for it in good jest, but I'd just be happy for them", "NTA. Give him 10 and tell him to keep the top. Drop him. He’s not a friend. Neither are the other half.", "Maybe it’s just me but if someone lends me money for something then u pay it back by giving half the winnings. At least that’s what I was taught. Everyone is an AH at this point with this group", "\"Neither a borrower or lender be.\" --  Some smart guy", "NTA- but you both suck here. Him for asking for more money after you won $85 and you for just giving him his $7 without offering or even thinking of a way to thank him for helping you join the game. If I were you I would have gave him his money and offered to buy lunch. “Hey thanks for lending me the cash, lunch is on me bud”!", "NTA.  But give him $10 and then block him.", "NTA. Your friend sounds like he sucks.", "NTA. It would have been a classy move to share a small amount of the winnings with him, but you were playing as you, not as your friend's proxy, so the only thing you owe him is the money he lent you.\nDon't borrow money for a scratch card off this guy.", "I mean I'd just throw him a ten dollar bill and be done with it", "I used to throw big bday parties at places and pay for an hr or 2 of open bar. I’d ask my friends to just bring me scratch off tixs. I was obsessed w/them but didn’t actually wanna pay for em lol. \n\nAnyway, one friend brought me abt $20 of $1 scratch offs and (i thought) joked abt how whatever i win, i owe her half. I laughed it off until she kept insisting and i realized she was serious. \n\nI won $1 from one of her tickets. I remember because she called me and asked if I’d scratched them yet. \n\nI stopped inviting her to my parties. \n\n\nNTA.", "If he is actually mad about whatever amount he wants out of $85 then I would just give it all to him and consider it a pay off to never speak to me again. If money at all makes you mad bc someone else has it and you think you have a claim to it for some outlandish greedy reason then I want 0 to do with you...Im 34m I own my home and all my cars.(no payments at ALL) and people think just bc I have no bills that I should be able to loan them money whenever they ask...of coarse I have money but why would I loan it every single time someone asks...im not a bank. And neither are you so I wouldn't pay any interest what so ever. When I do loan people money. I don't ask them what they are doing with it...none of my business..I just want what I gave them back when they say they will return it. No more, no less. Greed is a helluva thing...when someone else is doing better than you don't be jealous, be happy that someone you know made it. People are so self centered they can't even be happy for others anymore without thinking about how they don't deserve somthing or whatever...kills me...its why I bought my house so far out that if I see you your not supposed to be there...its beautiful with no people and just my dog...best company ever...", "I've been around gambling quite some time. The gentleman's rule to this is that if someone lends you money for a wager and you win half of the money goes back to the lender.", "NTA but yeah, I probably would have given him a 20 instead of just 7. This guy is not a friend -- friends are happy for you when you succeed.", "NTA\n\nHe only wants more money because you won. Had you lost would he expect more money?", "NTA", "If I was OP, I’d have given back the money I owed and maybe bought a gift or treated my friend to something nice. But if they acted entitled about it, I would’ve given my friend $7 in change. Pennies and nickels. Happy counting, pal.", "I’m torn between ESH and lightly YTA. I went to Vegas with a friend and we r TERRIBLE gamblers but we were having fun. If one of us was down, we lent money so we could keep playing together. If that person won money off the lent cash, we spilt it at the cashier. We didn’t talk about it before hand, we just both did it bc we’re friends and having fun being stupid with our money together lmao\nIt’s rude of your friend to demand the money, but rude of you to not even consider giving your friend some thank money/interest. They lent you money so you could have fun together > you had fun together and you came out on top > rounding up to $10 or like even giving a round $20 would be super nice & a good friend thing to do", "He’s a prick", "NTA but your friend is\n\nYou paid back what he loaned you. He’s showing what kind of a person he is. I can see where it would’ve been nice to say give him a $10 if you didn’t have $7 exactly. He doesn’t deserve anything else except for the loan to be repaid. If he expected a commission or interest then he should have declared that before loaning you the $7. And it’s $7! Not a huge amount or like he had to wait months to be repaid.", "NTA……. But courtesy dictates you give him back double his investment so $14.  Go $15 to make it a easy payout.", "I put $20 of my own money in a poker machine. My friend was helping me play. She loves to double up, me not so much. We won $150. I split it with her (minus $10) since she really did help me win more. \n\nI also borrowed $20 from a friend to play a poker machine. I won $600. I gave him back his $20. He thought I should split the winnings with him however I was the one who played, by myself. I think if someone gives you money to gamble THEY should be the one to bring up what to do if you win. If it’s not agreed upon before hand then they get their money back and that’s it.\n\nEdit: NTA", "He wasn’t expecting you to pay back more than $7 until after you won. NTA but you might wanna find better friends", "NTA although I feel like you should have given him a $20 without him having to ask.", "NTA - in the poker world if someone agrees to give a percentage of their winnings to whoever has lent them the money for buy in, this is decided and agreed upon before the person is bought in.\n\nIf he was going to expect some of the winnings, he should have made it clear when he bought you in.", "NTA, eventhough I would've just slammed a ten to his hands and call it a day, maybe saying _Keep the change_ like in that Home Alone scene.", "Find some new friends .", "NTA but giving him $10 wouldn't have hurt. If he complained about that, he can piss off.", "NTA but yikes I would never ask that \"friend\" for anything.", "NTA, if \"rights\" to winnings were on the table he should have stated that in the agreement. At most you would owe him a courtesy drink, but that's not required.", "NTA  F\\*ck him. He loaned you $7 that's it", "I'd give him 14 and then never speak to him again.", "NTa", "NTA. Moving on", "NTA. You won. He didn’t. When he lent you the money it became yours. You are required to return the exact amount. No interest is required.", "Nta. But it's not as uncommon as you think, most ppl have the decency to lay out their conditions b4. But would he have split the loss with you? If not, why should he gain?", "NTA. You didn't agree to sit the winnings. You whi him nothing else. Be it 85  or a million dollars in prize.", "If there was no previous agreement, give him his money back and nothing more.", "NTA.\n\nYour friend lent you $7 and you repaid $7. Whatever else happened in between is irrelevant.", "Kicking him an extra 10 or whatever would be classy but don't feel obligated it's not like there was a 10k buy in and honestly if you're friend if crying about a commission on 85 bucks you need new friends", "Your friend is an AH for demanding, but I would have tossed my friend some extra since I wouldn't have been able to play without their loan. So your kinda an AH for not having considering giving them some extra.", "NTA.  Etiquette/ bro code would suggest you give him the entry he paid you and his own entry back since he paid to have you take his money.   \n\nIs it an official or hard set rule,  no, but it's what I would have offered.   \n\nIf they gave me any beef I'd have dropped the 7 at their feet and told em to F/O.", "Would he have accepted less money if you lost? \n\nYou borrowed a fixed amount and owed him a fixed amount. That was the agreement. Whether you won or lost, you owed him 7 bucks. \n\nIt's not like I sponsored you for a % of your performance. He knew what the money was for and never negotiated an agreement to get some in the potential case of earning. \n\nI might have wanted to knock that up to $10 out of goodwill and gesture, but the moment he made a demand, he'd never get more than what I borrowed. What a dick", "NTA. I wouldn’t say drop him as a friend for this because he did lend you that money. I think his expectations just need to be drawn back.", "There are two kinds of people in the world:\n\n•The ones who value friendship over material things\n\n•The greedy rats who pinch pennies and expect more than they deserve.\n\nYour \"friend\" (and I use that term *very* loosely) is the second. Drop him from your life and don't look back.\n\nNTA.", "NTA! By the friend’s logic, if OP had lost all the money then he should forgive the debt because of the estimated loss OP took!", "NTA.  A real friend wouldn't even ask for the $7 back...\n\nThis is how it should have went down...\n\nCan you lend me $7\n\nSure\n\nI'll get you back when we get home later\n\nNah bruh don't worry about\n\nCool (buy the guy a beer or whatever)\n\nIf I give a friend anything under $50 I don't expect it back and most of the time tell them not to worry about it...I may need the favor another time. If it's a close friend anything under $200 I'm.not worried about, we've spent more than that on each other between, drinks, food, activities or whatever.", "That man is not your friend", "Eeeh NTA, but I’d have given them a $20 back", "10%to your bankroll is normal but that's usually for buying you into thousand dollar tournaments and whatnot lol", "NTA  but a little bit of an SB (stingy bastard). You don't *owe* the guy anything more than the $7 you borrowed, and he has no right to *demand* anything, but it would have been a cool/nice gesture to thank him for staking your good luck by paying him back a little extra.", "Personally I’d give him a little tip but he’s 100% the asshole", "Sometimes friends do this, for instance my friends and I would do this. But the deals and the percentages were clearly worked out and talked about and agreed upon by all wanting to be involved before starting each event or each gambling venue... We gambled on poker, pool, and sports.", "NTA, if you lost he'd still want his money back. He lent you 7 dollars, he didn't stake you for a share of the winnings.\n\nIf he hadn't asked I'd say buy him a drink, but fuck him.", "Would I likely give my friend a little extra for covering me? Yes. Would I do it if this is how he approached it? Absolutely not. NTA", "NTA-would he have split part of the lost with you Should you have lost money gambling?", "NTA. Toss him $7 and tell him to kick rocks", "NTA and this is a great story, I love the weird shit humans get into quibbles over. It's like Curb your Enthusiasm.", "Technically NTA... It woulda been pretty cool to just slip him a $20 to thank him for loaning you the money", "NTA. Just say \"i give you 10$ to fuck off\"", "Anyone who gambles is TA imo", "NTA I probably would have rounded up to $10 until he demanded it. I mean 42% interest in a few hours is pretty good, no?", "I always thought standard for a financed player was principal plus 15% of winnings?", "Nta, you can never satisfy a friend like that they'll always complain no matter the situation.", "Your skill in playing the table is what won you $85 - not his $7. \n\nNTA what a fucking joke and one hell of a look at the poker table. \n\nTell him his parents owe him the money since it was their birthing him that allowed this to happen.  He couldn’t have lent you that money otherwise.", "NTA, that wasnt the deal. I once needed £1 for a raffle and didn't the cash on me so my friend lent me the money, I won the raffle and gave the £1 back but my friend wanted the biggest prize out of my prize box.. I was like um no, I gave her a smaller prize but people will be cheeky. Don't give in, it's your winnings and if they wanted extra they should have said that at the time", "Gambling has a tipping culture. Your friend fronted your buy in. $7 to $85 is $78 profit. You could give him $7+ 3, 13, 23. \n\nPersonally, I would have given him $20 since it seems offensive to give less. Its pitiful to not give your \"friend\" anything \n\nYTA.", "NTA. If he helped actually winning the money, the sure. But there is no teamplay in poker so he can go eff himself.", "This guy is trying to hustle you…he gets $7. That’s what he’s owed and not a penny more.", "Personally I would feel like I should give him more than $7, not because he is entitled to it, but because I would want to be generous and appreciative.  \n\nI hold myself to a higher standard than I would hold someone else to in the reverse case, if I lent him money.", "So, by his logic, if you had lost everything then you wouldn't have to pay him anything back???\n\nNTA. He loaned you $7 and once he loans it to you, it is yours.", "Absolutely 100% NTA. You’re better off without this “friend” in your life. Should your group this post so they can see how much of an ass this “friend” is.", "You’re not an asshole for it. But it woulda been some real shit if you had thrown him like $20 instead of exactly $7 just to acknowledge that you appreciated him loaning you the money. You still woulda walked away with $65 and you wouldn’t have everyone breathing down your neck. Obviously you’re not required to do anything like that but I probably would have. Like I said you aren’t wrong though.", "It depends on the agreement, in Mexican culture when someone lends you money to gamble, it's called a \"Vaca\" or \"cow\". If you win, you have to split the winnings 50%.", "Ultimately NTA.  You didn't do anything wrong. \n\nYou are also not impressing people or giving them reason to loan you money in the first place.  You are not coming off as a gracious winner or a generous friend.  Don't be surprised if next time nobody is around to loan you a few bucks.", "Give him a penny. $7.01, that's more than he gave you.\n\nNTA.", "I’m going with YTA. \n\nHe is right that you wouldn’t have won anything without him loaning you that money. I’m not saying give him half or anything, but you easily could have given him like $10-$15 as a “thank you”. You don’t have to give him more than the $7, but it’s just common courtesy since he was being a good sport about lending you the money in the first place. Or maybe buy him a drink or something as a thank you instead.", "You are definitely in the right, buy maybe a bit of an ahole.  My buddy knew I was at the track and asked me to place a $10 win bet on a long shot.  It went off at 70 to 1 and won the race.  So I take the 10 bucks out of the $710 and give him $700.  He thanked me profusely and handed me one of the $100 bills.  He didn't have to, I was already there, I was already walking to the betting window, it was no big deal.  But he was grateful.  I would have given your buddy a $20 bill (his 7 + 13 grateful dollars) and thanked him.  But that is more etiquette, than rule.  You are NTA.", "NTA. If he wanted to sponsor you in exchange for some chunk of your expected winnings, that would be something to negotiate beforehand, not try to guilt you in to afterwards. People buy part of other players' action sometimes ... and he didn't do that, he just loaned you the money.", "As someone who plays poker, there is a distinct difference between someone loaning you money and staking you in a game. \n\nA loan requires that the precise amount be paid back in full, no more and no less. \n\nGetting staked means that if you lose, you don’t owe anything, but if you win, you owe a percentage of the winnings to the person who stakes you. \n\nYour friend loaned you money and changed it to staking you once he saw a chance to get more out of it. He’s scamming you. You are NTA.", "NTA\n\nHowever, people do \"invest\" or stake other players for a portion of their winnings poker.  Obviously. a small home game is far from high roller games or major tournaments.", "NTA. If you’re staked for a game then you owe the stake only, unless agreed upon otherwise beforehand.", "NTA. You reasoning makes sense.", "NTA. Your friend is TA for responding the way he did. After seeing his response, you have a decision to make regarding keeping him as a friend.", "He’s more of the AH for being upset and saying anything, but you should have given him something since you wouldn’t have been able to get in the tournament without his money. You obviously had no obligation to since you didn’t stipulate that, but it’s just the decent thing to do.", "If he expected the $7 back as repayment,  whether you won or lost, then he only gets the $7 back.\n\nIf he was investing in you, meaning his $7 was included in your gambling, so if you won, he gets a percentage but if you lost, he gets nothing, then he should have given you these terms at the beginning along with the percentage he wanted.\n\nDemanding a percentage after sounds greedy.  He sounds like the type of guy that gives lottery tickets as presents and if one hits, demands a percentage.\n\nNTA", "NTA but why not just kick him a $20 as a thank you?", "Imo, you would not have won the tournament without him fronting you the money. So, yeah, I’d offer him as a gesture of thanks maybe $20-25. But again, that’s just my opinion. If he was a good friend, he’d refuse to accept it. He’s probably just butt-hurt you won the thing. Whatever the case, there’s 2 takeaways here:\n1) he sounds like a fucking asshole and I’d rethink your friendship; and, 2) don’t ever borrow money from him again.", "NTA, but your “friend” is.", "NTA but it would have good form to round up.", "It is the same mindset of the servers (yes plural) and bartender believe they are entitled to a share of your winnings when you win at pull tabs/ video poker in bars (states where legal). Say I just won $1000 and there are 2 servers and 1 bartender and they each expect $100+ what the hell for?  Opening a bottle of beer and putting it on a coaster or being able to count so the money. I gave you matches the tabs you gave me. Really, and to not have anything to do with either me winning or with me at all and your hand is out?  What is up with that??\n\nNTA give him the $7 and this experience was your jackpot, your not-friend just folded", "He lent you 7, pay him back 7\n\nIf he wanted ROI he should've asked to stake you.  Work out the terms beforehand.", "ESH. Neither of you is an “asshole” per se, but you sound selfish, and he sounds entitled. \n\nA good friend would’ve paid a little extra just because, and the other good friend wouldn’t demand that he do so. Just kind of an unspoken friendship code I guess.", "NTA you are completely right but don’t right off your friend. A “commission” is a regional custom to give part of the part to the person who funds your bet in a pinch. There’s the part you owe and then a friendly acknowledgment in part of the win. Where I’m from it is both regional and generational. It’s 100% a “from the hood” or “from the neighborhood” thing with Gen Xand Boomers. So he if that’s how he came up, he’s not being greedy. It isn’t about the money he is feeling under appreciated. According to him, he helped you and you left him hanging. He just has to realize it isn’t universal.", "Unless he cited up front, hey I would like to have a percent of the winnings for fronting you, then all you owe him back is the entry fee\n\nIt was your luck and skills that won the money\n\nNow that is out of the way. What is the value of your friendship with him? Is it worth continuing based on what you know about him or is it best to let it go?\n\nIf you feel this is a minor sticking point, remember you are $78 richer than before. If your friendship is worth it, I would give $20-$25 on top of the $7 and you still have a $53 -$58 profit\n\nGood luck on your decision", "NTA. It was not asked or agreed on prior to the loan so no no I wouldn’t pay more. I were to say hey man I can borrow $7 and if I win I’ll throw ya 15 then then absolutely but if not then hell no", "Yeah, nta. Would it have been nice to buy him a drink to celebrate the win? Yes but borrowing some money you intended to pay back there's nothing to be owed.  \n\nThe only exception is if it was agreed upon BEFORE entering that he was staking you in exchange for a portion of the winnings. And if that was the case, you wouldn't owe him anything regardless of results. Paying the entry fee for you would have been the risk. That's how that works for someone covering tournament entry fees. Either a flat loan or in exchange for a percentage of all winnings.", "Honestly, with gambling, I think it's good manners to share your winnings with someone if they put money into your win. If someone gave me 7 and I won 84, I'd at least drop em a 20.", "Agreed.  But there goes the friendship.  As long as OP is ok with this.", "Winning the lottery I could see giving the other person some dough as a thank you, but poker is a game of skill. Dude earned that money. Buy me a beer, but not split the pot.", "\"He showed his hand.\" I see what you did there. Lol.", "If op had left with say 500 or more, it would be kind to give a friend a cut for helping you out. But 85? That's \"here's your 7 and I'll buy you a drink for the favour\" level of money. \n\nYou don't have to give more than 7, but showing some gratitude does make for a stronger friendship.", "He lent the money specially for gambling. I think he had a reasonable assumption that he would get more back if he won", "Pretty customary to tip the dealer on a big win, this feels similar. NTA but also not a generous friend", "It's not required, but it is a dick move. They are supposed to be friends, I would give at least $20 to show appreciation. Everyone's acting like this is some contract loan, it isn't. Without the friend spotting him he wouldn't have won anything.", "Exactly! Of course he’s not required to give him more but generally when a friend does me a favor I wanna return it plus more. If my friend pays for my lunch and I venmo him back I’ll round up a bit, if I borrow their car I return it with a full tank, if they lent me $7 I’d definitely at least throw them a 10 back if not more. That’s what friends do.", "The thing is it’s just $7. When I lend that much to my friends I generally don’t have them pay me back because we do those kinds of favors with each other often. In OP’s situation I would probably have asked for my $7 and left it at that.", "Yea that's just common courtesy.", "It's kind of the unwritten rule, if you win you give back a little more than what you borrowed, I usually do 20% of the win rounded up. To me that just shows appreciation and thanks.", "Thank you! Again people on AITA are confused and this they’re on a Legal Advice sub. Of course he doesn’t HAVE TO give the guy anything, the questions is whether or not he’s an AH.", "It was 7$. Asking for more than you lent is selfish.", "Or better still. Would be have given (not lent) OP more money if he had lost it all because it was his money that was lost, so he has a responsibility to make good on that loss?  If this logic doesn't make sense, then the other one doesn't either where the friend has any claim on the winnings.\nBut OP buying this friends a round of drinks wouldn't be amiss since a friend's generosity led to some good luck, however much of an AH he turned out to be later.", ">My question is if we turn the tables then will this friend given OP the same amount of money he's asking ?\n\nYou're asking if the friend won the tournament, would the friend have given OP the same amount of money even though OP had absolutely nothing to do with helping the friend enter the tournament? How is that a relevant question? The context is that the friend helped OP enter but not vice versa, so 'turning the tables' doesn't make sense to do here unless you're incorrectly assuming the friend thinks he should get money simply because they're friends. \n\nUltimately, the friend is still an AH for saying something as ridiculous as \n\n>it means I abused his trust\n\nsince that has nothing to do with the situation either. However, if I were OP I would probably throw a little extra money the friend's way (maybe double the buy-in) since OP did need his help to enter, but it's entirely up to OP and by no means an obligation to do so as the friend is ridiculously trying to imply.", "I would look at it like this: You wouldn't have won the $85 if he hadn't loaned you $7. If it were me, I'd've given him $14 dollars, a 100% return on his loan. That's generous.", "Me too. About 10% goes to the person who sold card when I win at lottery.", "It didn't take a while, though.", "But he didn’t give him $7, he lent it to him for a couple hours", "This only makes sense if OP lost the tournament and went away with nothing, this means he shouldn’t pay back the $7 right?", "That's what I've been saying and getting down voted for.", "I would as well but if my friend threw a hissy fit about just, they can get bent.", "This. Technically OP is in the clear, but, I'd give his bud a twenty or whatever as a thanks, because ultimately we're dealing with very small amounts of cash here.   \n\n\nWhy sour a relationship over the price of a cheap meal?  \n\n\nNow that might recontextualise OP's friend's relationship with money going forward, but it seems like the smarter tactical choice is to sling a few bucks and smooth things over.", "100%.\n\nOp is NTA....and the friend is for acting entitled...\n\nBut damn, treat the dude to a beer or something at least.", "Exactly! I think about it like if I borrowed someone’s car, a general rule of thumb for good manners is to return it with a full tank as a thank you for the lending of their car. On a smaller scale like borrowing $7 I would at least give them a 10 back, or a bit more depending on the denomination of bills I had.", "If I gave you $7 for a sandwich, am I getting any of that? If he lost everything, do you forgive the debt? That he paid his debt, is better than some friends I know.", "So if OP had gambled and lost, would it be reasonable for him to demand more money from the friend who'd lent him 7 bucks because after all, OP wouldn't have lost that money gambling if his friend hadn't fronted him the entry fee? Hell no. So why is it ok for friend to demand a share of the good luck if he would've had no obligation to share the bad?", "I may have given 10 back, but the moment the friend became entitled to more than what I borrowed, then nah. No way. He wouldn't have asked for less money in the likely event I lost.", "Only if it’s discussed beforehand and only if it is reasonable not to get paid back if he lost the 7$. \n\nBoth don’t apply to this situation tho.", "Would the friend have eaten some of the $7 if the OP had lost it all? Probably not. \n\nCould the OP show some extra appreciation, sure that would be a good thing to do. Is it required to not be \"a dick move\"? Absolutely not. It's $7. Unless the friend was 5 years old, it's an insignificant amount of money.", "I also wouldn't lend OP an entrance fee again", "True, but I feel like winning a million, as opposed to the 85 from OP's story, would change things a bit", "That’s how we roll!", "> Among actual gamblers, it's considered etiquette to give half of the winnings if someone paid for you to participate in gambling.\n\nThat's because, very often, there are actual agreements among \"actual gamblers\" for this.  IE-person A stakes/partially stakes person B in a World Series of Poker event with the understanding/agreement/contract that if person B makes it into the money, person A will get X amount/percent.  \n\nIn small time, amateur, home game poker?  Friend left with exactly what he would have left with if he hadn't given OP $7.", "He didn’t pay for him to participate. He loaned him the money.", "His buddy is the one who tried turned into some contractual investment agreement after the fact to guilt his friend into paying him money of his winnings", "That’s why I said everyone sucks?? Calling someone out for that is a dick move, but I also think counting out $7 instead of tossing your friend a $10 which he very likely had is also a dick move. That’s my view, I would never do that to a friend. If they lend me money they’ll get their money plus some extra. \n\n\nNot to mention in gambling there is certain etiquette rules which involves giving someone a cut if you win with money they lent you. That’s a separate thing about etiquette within specific activities.", "This isn't a bank loan, they are supposed to be friends. He was given money to play, money he didn't have. Without that money no winnings. He won, a friend would have given back more to show appreciation, I would have given him $20-30. Everyone in this thread is a bunch of cheap asses.", "I'd give him all of it and tell the group. Be like, he can have all of it.  Im too old for this petty shit.  \n\nThen just grey rock him from now on and let him experience what $85 really means to him.\n\nThis is all assuming it's doable.  Early 20s people aren't exactly swimming in cash but you never know .\n\nIt's not necessarily taking the high road, it just makes B look petulant, while OP appears above it all and it stops all the ~~downloadin'~~ drama.", ">Would be have given (not lent) OP more money if he had lost it all because it was his money that was lost, so he has a responsibility to make good on that loss? If this logic doesn't make sense, then the other one doesn't either where the friend has any claim on the winnings. \n\nI don't understand that logic because there's no reason anyone needs to make good on a loss. Or can you explain that further?  \n\n>But OP buying this friends a round of drinks wouldn't be amiss since a friend's generosity led to some good luck\n\nThat answers your own question as to why the friend thinks he has a claim on the winnings. Well, I wouldn't have called it generosity (he expected to be repaid) and I wouldn't call it leading to good luck (I don't believe luck exists), however I do think the friend was critical in helping OP enter the tournament and helped create the opportunity for OP to win. He doesn't actually have any claim on the winnings however, but if I were in OP's shoes I'd probably have thrown him a bone to show at least some appreciation. Still an AH move for friend to feel entitled however.", "NTA. Seems like the friend demanded extra cash before OP could even make that decision.", "This was my reasoning as well ... give him 10bucks and say thx.", "Yeah, counting out the change rather than rounding up seems really miserly. Asking for a commission also weird AF. I'm glad I don't know these cheapos.", "but it’s also the principle, who straight demands more? usually people are given more bc they don’t demand it", "Not at all how gamblers view the world.  He gave OP 7.  OP won 85.  OP would have won ZERO.  MOST gamblers would comp their buddy a 'few' bucks.  I'm not saying her should split it, he shouldn't.  I would've said thanks pal, and threw him a $20.  I'm still up $65 and actually risked NOTHING.  I may have owed the $7, but without it, I wouldn't have been able to play.  Still nta, but would never see a penny from me again.  Not for a beer, not because he forgot his wallet, not for anything.", "No because usually people are just nice to their friends. I would have thrown the friend a 20 too.", "Lmao, I love you you seem like a dope friend to have", "I love your energy!", "This. Like, sure I would have no problem paying back a friend with interest without being asked, but the second that \"friend\" suddenly needed a commission before I even offered to pay him back?? Nah.", "The way prices have been lately, \"a couple drinks and a pizza\" would be about half what OP won, unless we're talking about Little Caesar's or something.", "Yea but what if friend demanded before OP even had the chance to give more. I'd absolutely give more, up until the point it becomes a demand/entitlement", "I also thought that. Like if I won, I would probably give my friend at least 20. Or took that 85 and spent it on some time with my friend, like some takeout or something. Trip to the movies.\n\nBut then also, the way that friend reacted rubs me the wrong way. It’s a common courtesy where I am, but demanding common courtesy can still come out as entitled 🫣", "That's standard around these parts too.", "That would be an agreement not a reasonable assumption", "You're right, it is an insignificant amount of money. I find them both to be cheapskates and both assholes in how they handled the situation. I wouldn't worry about getting the $7 back if they lost and I would give back more if I won. But that is the difference between my relationship with my friends and his.", "I dont understand how this is even relevant, OP didn't win a million dollar, more like he won a nice meal in a nice restaurant", "No it's etiquette so there doesn't need to be an explicit agreement", "I guess you didn't notice the italics", "Not offering to buy the guy dinner or a 6 pack is an AH thing to do. \n\nDoes he have to give his buddy a small bonus for the loan \n\nNo.\n\nDoes it make him kind of a shitty friend and an AH \n\nYes. \n\nIs this sub called am I the AH \n\nYep.", "Hope you’re not taking this advice? I would consider dropping him as a friend and moving on with your winnings.", "I think age and how well of friends they are should play into it too.  Are they new friends or friends that have known each other all their lives? I have two friends that I have known since grade school and going on 30+ years. We treat each other very differently than we do other friends. An example would be when we all go out to eat, we get what we want and we split the bill even 3 ways. Doesn't matter if someone had a few drinks and someone else had an appetizer. We don't keep track of who owes who.   \n\n\nThe fact that he had to write this post indicates they are not that close. I have been in this spot plenty of times, when I win I give back 20% rounded up, if I lose I just pay back what I borrowed. I have also given money for people to gamble and if they win they have always given back more than what I gave them. Even if it was dinner instead of cash.", "Hey kid! IM A COMPYUTA!", "It sounds like OP has money just not with him, so it’s expected he would pay it back even if he lost, now if OP doesn’t have 2 pennies to rub together, I wouldn’t expect the money back if he lost. But OPs friend lent him the money so he didn’t miss out on fun and wasn’t  inconvenienced having to go get money and come back. It was a favour ops friend didn’t have to do and with the way op reacted I wouldn’t expect him to do it in the future.", "I think that’s irrelevant. It all stems from the fact that he won.", "Friendship isn't only about obligations. The friend wasn't obliged to lend OP money in the first place.", "100%. It's a good gesture to give some more back, you can't demand gestures. Kick rocks", "It’s not a reasonable assumption anyways that’s his friend not a goddamn bank. \n\nYou shouldn’t be thinking how can I make a profit out of lending my friend money? You gave 7$ you got 7$ if you want back more than 7 bucks you should stipulate that beforehand.", "Most friends wouldn’t ask for more. If OP offered? Great! But it doesn’t even sound like OP had the chance before the “friend” demanded more money. Would the “friend” demand more than the $7 if OP lost and couldn’t pay that day? Would they continue to charge them interest for every day missed? That’s the type of greedy “friend” this guy sounds like.", "Christ sake. Hope I haven’t upvoted their other comment", "All because it's gambling lol. People tend to lose their minds when it comes to gambling. If he wanted stakes in the loan, he shoulda specified ahead of time, imo. $85 isn't even that big of a prize to be splitting. The friend just has a case of sour grapes. If I was OP, I would never ask this friend for a financial favor again either, so problem solved. But this is why you gotta be careful who you go to the casino with bc some folks think they should always get a cut of the \"free money\" if someone wins", "You can’t participate in the upside without participating in the downside. If it’s a loan, which it was, doesn’t matter what OP does with it as long as it is repaid. Banks don’t earn commission (other than the pre-agreed upon interest rate) when the money they loan out is used to make a ton of money.\n\nNow if the friend wants interest that’s scummy and they should have had that in writing.", "I3ex: yes, obviously. My comment was that if OP had lost, would the friend have expected OP to pay less. Likely, the friend would demand, and justifiably, the $7 back, no more and no less. It has no reference to convenience or 'having fun' or 'the future'.  It is a question that illuminated the same logic: \"Since OP won, he should pay more.\"\n\nMy main point is that the friend was lending $7 and was NOT gambling $7. \n\nIf the friend had said: \"I'll place a $7 bet that you [OP] will win,  and if you do, I will get 30% of your net winnings, or $7, whichever is higher.\" Then the friend would be due the higher amount, based on the bet of OP winning.", "I'm not saying you're wrong, but I am saying most \"gamblers\" would throw in a tip.  Not a split, but give him a twenty instead of seven.", "You realize he just probably didn’t have the physical cash on him and that was required in this particular situation. I would do the same thing instead of leaving the party to try and find some if that was the options. Especially if they have been drinking or w/e", "If they didn’t want to they could’ve said no. But OP is not obligated to give more on a loan just because they have more money than when than started. Whether or not the lender was obligated to lend money is irrelevant, as they chose to do so in the end. Nobody’s saying the lender was obligated to give the $7, that’s not the question here", "And if he had won a physical prize would he be expecting him to sell it 🤔 or gave custody. Or if it was a raffle or bingo.", "I made a lighthearted comment to a dude next to me buying a lottery ticket. He said the cashier could pick. \n\nI'm like,  'Wow.  Double gambling?  That's bold!'\n\nAnd he just looks at me and says flatly \"It's ruining my life.'\n\n\nI....didn't expect that .", "I see it as manners to give some extra when you win, wouldn’t ask for it but I would note it if someone wanted a favour of me lending them money in the future", "I see it as manners, your friend does you a favour you would return the kindness when your doing well. I don’t think it matter if he spelled it out. You don’t need a legal contract to do right by your friend. It seems rude to me to not even offer him a drink.", "Ya that’s what I expected, like a 20 as a I win you win cause we’re friends and you helped me out.", "OP now looks like an ah to half of the friend group, period. I wish life were as easy as the teenagers of reddit like to make it out to be.", "I see that it’s more about manners, someone did you a favour and you win, you do something nice for them. Like if I won a tv over money you lent me, you get a free drink on me.", "Of course OP seems like an AH to the person that feels entitled to a cut above what they initially borrowed for entry.\n\nWould it be nice if OP chose to give more back for the favor? Sure, but they aren't required nor obligated to do so.", "Ya this is a weird comment section. You give your friend something as a thanks if they help you win something. \n\nNot a huge amount but a “yo thanks”", "I probably would buy the friend a drink, if he didn’t get grabby before I had the chance.\n\n\nBut payback for a favour, as I see it, isn’t giving them something right then. It’s keeping in mind that I should do them a favour when they’re in need. If this guy wants to cash in his goodwill right then by asking for extra back, well, that’s his choice I guess. But it makes him look grasping.", "I didn't say they were required? OP is cheap. This convo is becoming embarrassing,  like most of you are either friendless or teenagers.", "It’s wild, I don’t know what happened to people returning favours but it seems a lot of people are sticking to the fact the friend didn’t ask for future winnings when he lent the money at the beginning but too me it’s just the right thing to do when you win with someone else’s help,", "Even without that ad hominem, your argument goes nowhere, on that I agree.", "Why so pressed? Lol", "ESH for sure.\n\nBy no means are you obligated to share the wealth with them. They are your winnings after all. And, on paper, you do not owe him any more than what you borrowed. \n\nHowever, good social etiquette dictates that since you wouldn't have won without the money you borrowed, you definitely should have given at least a bit more to show your appreciation. Or buy them lunch. Or something. By no means do you *owe* them that, but giving a bit more would earn you some goodwill with them and the people they tell about the interaction. That's how you get people to like you: being selfless and appreciative. The \"Chad mindset\".\n\nOn the other hand, it's really bad etiquette to make a huge fuss about not receiving more money than you're owed, in any scenario. A good friend would have kept their mouth shut and let it go. But, since they felt you violated the social contract, they went and violated it too.\n\nTwo wrongs don't make a right, therefore ESH.", "Eh, you're not NTA. You wouldn't have gotten anything if it weren't for the lone. If it were me, I'd split it 50/50 with my buddy. Ideally he wouldn't ask or push, but like... Come on, you'd have nothing it it weren't for him and ya'll went *gambling.*", "Clearly you are NOT a gambler.  It is immoral (to most gamblers) not to pay back money used for gambling.  OP then turned the $7 twelve times over.  I gamble 300 days a year (horse racing) and in that situation, and I have been in that situation, I would have tossed him a $20.", "Dropping him as a friend over this seems awfully extreme.", "I would have paid for his entry since he lost his money to me. So I would have rounded up to $15 and felt like I did a good a thing and enjoy my winnings.", "Exactly. He staked his buddy for all intents and purposes, and good manners in the gambling world would necessitate sharing the win. But we don’t know if either person involved is even familiar with this etiquette. Sounds like op isn’t, but lender is. NAH, just misunderstanding.", "Relevant short story: \n\nWas visiting some old high school friends a couple years ago n was a bit broke. Was in the middle of a 2 month layoff. Anyways one of em wants to go to the casino n said he'll give me $40 to play with n not to worry about it. \n\nI realized I had $7 in my pocket and decided to put that in a slot machine before we even hit the atm. Max bet. Won $800. I handed him $200 right then n there. Put $400 in my pocket to help with bills and gambled (and lost) the remaining $200.\n\nHe never even gave me the initial $40. It just seemed like the right thing to do.", "Oh please, this is a last minute game tournament between friends, it’s not about gambling ethics, their big win was 85 bucks. \n\nI’ve gambled for wayyyy more about a football game with my own mother in our living room and I don’t consider myself a „gambler“. \n\nIt’s really not that deep. Don’t compare yourself to op I don’t think the same rules apply here.", "I don’t agree with that logic. The friend had to ask to borrow $7 to play. His “friend” didn’t offer the money and would have expected the $7 back if he lost. He did no favors and conveniently attached strings when his friend won a few extra bucks.", "I agree I would have given the guy a 20 and a thank you", "I'd offer to buy him a drink or maybe give him 10 but not after he demanded a 'commission' after the fact.", "I won’t even let my friends pay me back for coffee. I’m astounded that he is demanding to be *paid* for loaning $7. I might be able to see the argument if this was a hefty chunk of change (and even then it would still be a gift, not owed- you can’t put interest on a casual loan to a friend, that’s psychotic) but it’s not even TEN BUCKS and OP won less than $100. His evening wasn’t impacted by the loss of $7 + he got back exactly what he was promised.", "Same, $85 is a small price to pay to get some whiny baby out of your life.", "We think alike.", "There is a difference between a sandwich and gambling (if you are a gambler).  Yes 'tipping' someone that loans you money to gamble is commonly tipped if you win, and actually sometimes, even if you lose.", "Yes, lending things implies you will be getting it back. Just because you’re getting it back doesn’t mean that lending something isn’t a kind gesture that could be returned with a nice gesture. \n\nTo use my other example, if my friend lent me their car of course they’re getting it back and if I damaged it in anyway I’d cover the repair costs. So sure, they aren’t “out” anything by lending me their car because they’ll get it back in the same condition as before, but being willing to lend it to me is a kind gesture in itself so I’d return that gesture with something for them like a full tank of gas.\n\nSame thing here, they aren’t “out” anything by lending me $7 but for them being nice enough to lend me money I’d give them back more then they lent me. \n\nThat’s just the manners I was raised on, sorry if your friends don’t do those kinds of kind things for you but my friend group does.", "I would agree with you if the friend had offered the 7 dollars for his friends entry fee to play being that he had no funds, but he didn’t offer, the friend borrowed. He only owes him 7 dollars. What etiquette?", "What if the guy lost. Would his friend forgive the loan and call it water underneath the bridge. Being that he’s trying to extort his Winnings, I doubt it.", "Absolutely what I would have done too. That way, everyone wins. My friend loaned me some money, when he didn't have to. If I lost all my money, I'd owe him $7 and would have had a nice evening playing poker with my pals. Seeing as in this scenario I won, giving him $20 (or at least double his money) shows I appreciate the fact he helped me out by loaning me the money. He's happy, I'm happy going home with $65-70, no hard feelings anywhere, job done.\n\nIf I don't give him a bit extra, is he ever going to want to lend me money again? Probably not.", "Soooo let me get this straight: \n\nImagine if op had 7$ in his pocket and wanted to gamble but also wanted a sandwich so he asked his friend for 7 bucks for a sandwich and used his own 7 bucks that he has on him to gamble hi has to give the friend exactly 7 bucks for said sandwich. \n\nBut if he used his own 7$ for the sandwich and the 7$ he borrowed from his friend to gamble he has to give the friend 20 not 7 ? ….. yea no still unreasonable 🙃\n\n…..", "Although if the friend won $85 and op lost it all, the friend would probably expect that $7 still judging by his entitlement. But yeah if I won $85 i would probably buy him a drink and the $7. Reaction is weird by the friend", "If you were in his shoes with your reasoning, Then you would have a friendship with no benefit for you. It would be one sided. The friend should have given him the $7 unconditionally when asked to borrow.", "Freind lends him money so that OP can participate in a poker tournament. OP wins poker tournament,  then whines like a little girl when freind points out that he wouldn't even been in tournament without help. Doesnt share any of the winfall. Sounds like a shitty friend,  and i wouldn't stake him again", "I disagree, the guy should have given him the $7 when his friend asked to borrow it. And he was keeping score by attaching strings to it. If their is no benefit in having it as a friend, you have no use for it. A real friend would have not thought anything of it and did him a favor unconditionally.", "The friend is demanding an extra tip because he made money.\n\nDo you think if OP would have gambled and lost the full $7, the lending friend would say “don’t worry about the $7”? \n\nHe would 100% still charge him $7.\n\nNTA. You are wrong.", "I totally agree with your assessment. He doesn't appear to be much of a friend.", "The more I think about it, the more I agree with you, a real friend wouldn't ask for more. I am very fortunate to have surrounded myself with good friends that shit like this never comes up because we don't keep tabs and we always payback more than what we owe.", "Here's the key word here: he *lent* him money. He was going to pay him back regardless of winning or losing, what he won shouldn't even come into the equation. If what he payed him back was dependent on how much he earned, by that logic he wouldn't hove to pay him back anything if he lost, and I don't think the friend would've like that. \n\nAnd again, it's not like he won a million dollars, he only won 85 dollars for gods sake. Yeah sure, I can see you making the argument that if he actually won a lot of money it would be nice to give some back. But it's not, and I think the friend is the asshole for just excepting more than he payed just because OP has some more money to spare now", "Yes, I think both people suck here. I think his friend should’ve given the money without a thought and not asked anything in return or even for the money back. I also think OP when he won should’ve thought “hey my friend gave me money and I increased it by 1000% I can give him his money back plus some”. A good friendship should involve thoughtful kind gestures back and forth without expectations.", "$15 is what I said in my head when reading the OP. Might be a bit of a gambler…", "I’m not, \n\nIt’s just indicative of the types of friendships op and you keep.", "The lender doesn’t get to take part in the upside just because OP forgot his wallet. Just like he wouldn’t take a loss either.\n\nRound it to $10 but the expectation should not be to share. If the lender had won, he wouldn’t have shared with OP", "It isn’t because op forgot his wallet, it’s because he was nice enough to lend him the money. I don’t understand how it seems you view ops friend lending the money like it’s expected but not giving an extra amount as like a thank you. 20 would be an amount that’s a nice thank you. The fact op couldn’t imagine a world where he gave extra money as a thank you kinda shows that he expects favours but won’t give them. A buddy helps you out why wouldn’t you help them out when you have won cash.", "$7 promptly paid back between friends does not require a reward", "In poker there is such a thing called staking, but this is agreed upon BEFOREHAND. In the staking scenario the entry fee is GIVEN to the player with the understanding that a loss is a loss but a percentage of any winnings go to the person who did the staking in the first place. In large dollar tournaments it is not uncommon for a prominent player to have several others who have a piece of their action having provided a portion of the buy in to the player. Again, agreed upon beforehand. \n\nThis was a loan. He got his seven dollars back, as agreed upon. Some people may be inclined to give a little extra, but I know for me that inclination would have ceased the moment he announced it was expected. You’re not the asshole as far as I am concerned - he is.", "NTA.  I played poker professionally for a long time, and have lots of friends who did the same.  \n\nI have literally never seen anyone ask for some of the winnings from a loan for an entry fee. \n\nA loan is a loan.  If he wanted to stake you he should have said he was staking you for x% of the winnings.  \n\nYour mate sounds like a greedy asshole though.", "> He’s shown his hand\n\nI see what you did there.", "Lol, this post and comment sent me down memory lane. I was 5-6 years old and my aunt took me to play bingo with her. She bought me 2 or 3tickets (or whatever you call them) while she herself had like 20. I somehow won the main prize (first one to fill in the entire ticket) and she TOOK MY PRIZE because she 'bought the tickets so they were technically hers and not mine'. Damn it's been nearly 30 years and I'm still miffed.", "If the friend was smart he would have stipulated before hand that if OP won they are entitled to more. If OP really wanted to join they would have had to agree, but as it stands no such agreement was made, so asking after the case is bad faith on the loan.", "He didn’t sponsor him in the tournament. The friend had to borrow the money. If he lost would the loan have been forgiven. No etiquette, just a friendship with no benefits for the guy who borrowed. He has no use for it. Good thing it only cost him $7", "This. There’s a gambler’s etiquette at play here. OP’s fauxpaux should be excused, as he obviously didn’t know, but it is a fauxpaux none the less and the friend who lent the money is running his trap to other people. ESH", "100% agreed. This is just knowing when to be a class act. Read the room. Take care of the guy that got you there!", "Let me guess, you feel entitled to other peoples good fortune too? Lmao", "So the guy borrowed $7 and then had to put a 20 percent tip on top of it. What if he had lost? If your going to keep score, then know how to add. A friend would have given him the $7 unconditionally. The friend did him no favor why appreciate it.", "Good choice of words: \"class act\". The OP in this case showed that he is the opposite.", "Yeah I’d at least give him 10 or 20 back\n\nWhy?\n\nYour friend did u a solid so you should return the favor.", "If friendships were based on what was owed... is it really a friendship?  This whole scenario falls into goodwill and common sense.", "To be fair, *the friend* is the one deciding to sour a relationship over a few bucks, not OP. He was never told he’d get a percentage of the winnings + it wasn’t a significant pot- if he wanted a stake in OP’s bet he should have said so upfront instead of throwing a fit after the fact. I have to assume these two haven’t been gambling together/run into this situation before- best case scenario, OP and friend just have different “rules.” Even as a simple case of miscommunication, OP isn’t the one behaving poorly or unreasonably.", "Not at all, I would not have been put off by only getting the $7 back and would not have said anything. Why would you assume that?", "Agreed, but the fact that the friend went STRAIGHT to 'Give me more now!' makes the friend the AH in this situation. Maybe e s h, if OP had zero intention of only giving back $7.", "Who stinges their friend after they helped you win $80?", "This logic confuses me, risk nothing? He still risked 7 bucks regardless....", "Exactly, it's a couple of hours loan for a measly $7. Like yeah I'd make sure I gave it back to someone, but as the person who lent it out I wouldn't be expecting any kind of interest or rounding up.\n\nIn my mind theres a difference in lending someone money because they need it, and lending it because they just don't have cash on them atm.", "How would you feel if you were asked for more money than you were lent then? \n\nAnyone who tries to scam you and claims you “abused their trust” isn’t someone you need or want in your life.", "I agree that OP was only obligated to return the 7 bucks.", "Yeah he obviously didn't have to give him more but if they are good enough friends it's definitely something I would do.", "Offer B the option, take the 85 with a good bye, or be real.", "He borrowed the money specifically for gambling. For any other reason you would be correct but gambling is in its own category.", "Ehhh, it brings me joy to share my successes or come up’s with my friends and my friends do the same. It’s a better foundation for friendships imo instead of dog eats dog and everyones out for themselves. Maybe it’s because most of us know each other for 15- 20 years. Or maybe it’s because we don’t treat each other like a financial institution. You seem to struggle to know the difference.", "My point is that friendship should be about more than obligations.\nThere are things like good faith, kind gestures etc.", "I feel you confuse gambling buddies with friends. \n\nFor People you met through gambling and bond over the activity, I guess you can have your own code of ethics about the subject. \n\n\nBut actual friends don’t do this, gambling or not, you don’t make a profit out of a friend, it’s wrong on so many levels.", "If you pull out a loan right now and make money off the loan, you are not gonna share profits with the bank. Nor would they charge you for making ‘x’ amount of money.\n\nThey will charge you the loan and an interest rate. Doesn’t matter if you make $1 off the loan, $1 million, or even lose it all. They will get their full loan plus interest. That friend is being advantageous and it sounds like you’re one of those people. These are the friends you must eliminate", "It's because most of the people commenting don't have any friends and can't put 2+2 together to figure out that behavior like this is why.", "damn you really type A, huh? I used to be a gambling dealer, for a few years actually, and in my experience, if people borrow money to gamble and leave up, they share the take with the loaner of the money. I saw it happen hundreds of times. I never heard of anybody setting such precise terms before. Different gambling cultures, I guess.\n\nOP, in my part of the world, YTA", "Can't believe I had to scroll so far to find this.", "No my mates would be like ey don't worry you get the next one whever you can\n\n$7 is a fart in the wind over a long friendship!\n\nIsn't the entire point of having mates being able to enjoy experiences together??  Get some beers in ffs", "It seems odd  to me that the intended use of borrowed money determines the terms of the repayment. \n\nSo if OP ordered so ridiculous coffee and hen realizes he left his wallet in the car, and the friend spots him $7 right then, obviously he’s only getting paid back $7. \n\nBut when the use of that $7 has changed from coffee to poker, and additional money is won, the original $7 owed can become more. \n\nI have a hard timid following this kind of logic.", "A friend would have also been like \"hey I won $85, here's $20 for spotting me the buy in.\" It goes both ways. It's not a fucking tip, there is no service provided. It's one friend showing thanks to another for helping them out.", "pork chop sandwiches!", "What do you mean “grey rock him from now on”?\n\nIs this what it means:\n\nGray rocking, or the grey rock method, is a tactic some people use when dealing with abusive or manipulative behavior. It involves becoming as uninteresting and unengaged as possible so that the other person loses interest.", "Yup... I wouldn't lend him money again just out of principle.  I can't believe this is over such a piddly amount.  I have been on vacation with friends where one person pays for the entrance for all of us just to simplify things.  Next time around, someone else may pay for dinner, and so on.  As long as the amounts are close, no one is nickel and diming because we are friends and we all know it comes out clean over time.  But risking your good will and friendship over $10, $20 ??? why would you do that?  OP is not the sharpest bulb.", "Gambling is playing something to win money. Some people play Poker because they enjoy it and it’s fun and you could make a few bucks. Why make it more than it was. The friend who wanted part of the winnings is a Gambler. The guy who borrowed a Poker Player.", "7 dollars shouldn’t require that much charity", "We return things to friends clean and in better condition if possible. Using the car loan - I would do the same thing by adding extra fuel. If I rent a car from a company, I follow the contract requirements without anything extra. \nI guess this isn’t as common as I thought it was.", "That’s keeping score, that’s not a friendship. And he did not spot him the buy in like you say, he offered nothing, he did the guy no favors. The guy had to ask to borrow which means you pay it back and he did. If he loaned him the money with strings attached that’s dishonest and he doesn’t deserve thanks or appreciation, he should be disqualified as a friend. Would he have forgiven the loan if his “friend” had lost. NO! He’s untrustworthy and not worthy as a friend.,", "They are both idiots, but more so OP for not seeing the real problem.  It's not the money.", "Maybe you’re right, I don’t really have any family,  so my friends make my life much more fun and positive, so maybe that’s why I’d give them a bit extra for a thank you", "Don't get me wrong, the OP is NTA. I just think it's not worth throwing away a friendship over something this stupid and petty. If it's a pattern of behavior, sure... but as far as we know, this was an isolated incident and people say stupid shit in the heat of the moment.", "100%,\n\nthis is how not just my myself but the rest of my close friends would treat each other. \n\nIf I found 20$ on the floor in the bar I’m turning it into the next round of drinks for me and the boys. \n\nI’m not saying you have to be generous like this but, it’s certainly a way more commendable way to live and strengthens friendships.", "I disagree, it was all about the money for the guy who loaned it.", "I just don’t give people a lot of chances to show me their character is messed up before I cut ties. I have tons of friends that love me, I don’t need ones like this. Even if I didn’t have any friends, I’m better off alone than around someone who’s thought process is really fucked up."]}