{"id": 21784, "submission_id": "14v5j1l", "title": "AITA for not taking down my paintings so my boyfriend's friends can come over?", "selftext": "I (25F) and my boyfriend (28M) have been together for a little over a year and he moved into my apartment a little over 4 months ago. I love to paint. It’s just a fun hobby that I use as my own version of therapy. Anytime I feel overwhelmed or particularly frustrated, I pour those emotions into a new painting and feel much better after it’s finished. I wouldn’t say I’m the next Bob Ross or anything, but I like my paintings and my friends and family always compliment them. I have about 15 of them hanging up around my apartment in various places. My boyfriend, J, has always said how cool he thought the paintings were and has never tried to discourage me from putting them up all over the place. \r  \n\r  \nAbout a week ago, J said he would like to host dinner with his friends at the apartment. They’ve never been over, and he thought it would be a good opportunity for his friends and I to get to know each other better. I agreed and was happy to cook, make drinks, and host. I immediately started planning what I was going to make and asking J if there were any dietary restrictions that his friends have. He stopped me in my tracks and told me he had one request to make before he confirmed with his friends. He asked me if I would take all my paintings down for the evening and put them in our bedroom. When I pressed him for why he would want me to do that, he shrugged his shoulders and said they might make his friends uncomfortable. \r  \n\r  \nNow my paintings are an expression of my negative emotions, so as you can imagine they lean toward the dark and macabre. They aren’t by any means pretty landscapes or bright flowers, but they are still my art and very personal to me. If the goal of the dinner is to get to know each other more, I would think they are a great conversation piece and show a lot of insight into who I am and what I like to do. J argued with me saying they are “twisted and sick” and that he doesn’t want his friends to think I’m some sort of mental case. I had no idea he felt this way about the paintings, and I was hurt by his description of them. I yelled, got mad, and told him that the paints aren’t going anywhere and if he doesn’t like it, then we can always go out to a restaurant instead. He pointed out that this is his house too now and he should be able to have his friends over for dinner without having to make excuses for the decorations on the walls. \r  \n\r  \nI stood firm in my stance, and we argued some more. He ended up leaving for the night and staying at his friend’s house. He has since come back and keeps bringing up the paintings every chance he gets. I don’t want to make anyone feel uncomfortable, but I think he’s more uncomfortable with my hobby than his friends would be and it’s upsetting to think that over a year into our relationship this is just now coming out. So, am I the asshole? Should I just take the paintings down for one night and end this argument? I’m starting to wonder what other things bother him that he hasn’t told me about.\r  \n", "created_utc": 1688926619, "permalink": "/r/AmItheAsshole/comments/14v5j1l/aita_for_not_taking_down_my_paintings_so_my/", "score": 654, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I think I might be the a-hole because I might be overreacting to the situation. It would be really easy to just take the paintings down and put them back up later. I do want to get to know my boyfriend's friends more and I know my paintings are dark. This might just be me picking a hill to die on without any real reason.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "INFO\n\nSo what are the paintings of exactly.", "I was about to say E S H, but you conveniently omitted what's on the paintings from the original post, which means you are perfectly aware why the request to remove them was made. For that reason, YTA.", "ESH. He was wrong, to wait so long to express himself to you. And , definitely shouldn’t have done it with such words. \n\nIf you invited him to live with you, and especially if he covers bills. It’s his place of residence too. You both have say in shared spaces. Y’all need to compromise. \n\nThat being said as an outsider seeking things like organs and disembodied heads, I’d feel uncomfortable. You don’t know what other people’s triggers are.", "ESH. The way he approached this was  really insensitive and rude. He still has a point that it’s his apartment too. It sounds to me like he’s been trying to find a way to tell you he would like the apartment to be less dominated by your artwork in general and made an excuse of his friends coming over.\n\nLike…I would not enjoy living in an apartment that had 15 paintings that were ‘dark and macabre’, and depending on the content I would definitely worry what friends would think when they came over. A good compromise would be to display a more limited number of them and/or display them in spaces that are less public or shared between you two.\n\nBut he should have come to you and said ‘I love your art and how it helps you process your feelings. But, I find having so many of them around makes the apartment have a darker feel than I really enjoy. Could we find a compromise?’ There’s no excuse for the way he approached it. But you also can’t just insist that you get unlimited wall space for your art at all times.", "YTA he was polite in asking you to take them down for one night. He told you they would make his friends uncomfortable. They’re gory body parts. It’s a perfectly reasonable ask because he lives there too. You said no and kept pushing so he told you they were sick and twisted. He didn’t ask you to take them down completely, just for one night and you refused to compromise.", "Him saying the paintings are “twisted and sick” was a bit mean, BUT he’s right isn’t he? Dark and macabre to you could also be “twisted and sick” to others. The way you described your paintings in another comment just confirms that, as you said it’s a lot of blood, organs, and severed heads. Him saying that’s twisted is a valid opinion he has. Although I can seen how it might have hurt your feelings a bit in the moment. \n\nHow big is your apartment? If it’s a small apartment then I could definitely see how 15 pieces of that type of painting could be too much for him and why he would think his friends would be uncomfortable. \n\nCould you not just compromise for one night? You say it’s a great way to get to know who you are and a conversation starter, but i highly doubt your boyfriend wants your first real conversation/meet up with his friends to be about the painting. You said they are from a source of anger of negative emotions and you use painting as therapy basically and that’s wonderful. But if you all are going to be discussing your paintings the. You’re more than likely going to go into detail about your negative feelings for each piece. That’s not really a light conversation that you want to be having for the first time with your boyfriends friends. I can see why he wouldn’t want it brought up at your alls first get together with his close friends. The paintings do sound very dark and I could see it not being the best first impression of you. And I can see how that could be quite disturbing to other people. What if one of his friends have really bad reactions to something like that? Like what if the blood and organs triggers something in them? \n\nCouldn’t you at the very least take most of your painting to your room just for one single night? Maybe pick out one or two to keep out and just make light conversation regarding those paintings. That way you aren’t just bombarding them with all these “disturbing” paintings the first time they come over? Again 15 is ALOT for a small apartment especially the type of paintings you’re describing. \n\nOver time you can bring more and more paintings out and show them off. That way his friends are able to actually get to know you fully before you bring out the paintings? It sucks but people judge and get judged for all kinds of things. If this is still at the stage where you all need to get to know each other better, I can see why your boyfriend wouldn’t want all of the paintings to be our right away. It might cloud the friend group’s judgement of you. Where as if they get to know the real you first and then see the paintings, their judgement shouldn’t be as harsh because they’ve already come to learn the real you and they know that just because you make “dark disturbing” paintings doesn’t mean you’re some kind of mental case. But if they see the paintings before getting to know you better, they may steer clear of you because they might think that you’re a very “dark” person. \n\nJust my 2 cents. I’m going with NAH. It was kind of mean how he said it, but he’s not really lying about it? From what you described of your paintings they are disturbing. BUT he shouldn’t expect you to always hide this part of yourself from them. Over time he 100% should be okay with you sharing more of yourself with his friends, but I understand why he would want to wait a bit for that, so his friends can know you better before seeing something that might turn them off of wanting to get to know you. It’s just one night, and maybe see if you can leave 1 or 2 paintings out and put the others up in your room so it’s not so overwhelming the first time his friends visit.", "You do Not start by introducing new people to your darkest most disturbing side. \n\nAnd with the info on what your paintings look like I’d personally be “Oh dear that was my phone, let me just check… oh my uncle Arthur was in an accident! I Have to go Now! So sorry …” and run out of there lest I’d be either served a person or end up next days supper myself. No thx. \n\nYTA.", "YTA....\n\n\n\"The paintings are of various things, but common themes in them are eyes staring at you, blood, organs, and disembodied heads. I use a lot of negative space as well to give try and give that hopeless neverending void feeling.\"", "YTA.... gorey paintings? I get having an outlet... but yea most people arent very complex and would think you are a mental case. Im super i to that stuff but the fact you have them hanging up around the house? Yea its a bit... dark", " AH, he asked for one night. You probably don't want to discuss your dark paintings and what let to them with his friends on their first visit...or well, not ideal.\n\n And honestly, it is great that you are using art as therapy....but this sort of thing is supposed to be painted and put away...or ideally discarded. Why would you intentionally surround yourself with all the negativity you once felt? Paintings carry vibrations=energy.....they are giving you that negative energy back. Obviously that's your choice and you know why you do it, but it might be better for your own mental health if you surround yourself with more positive things.🤞", "YTA. He lets you put up your dark artwork 360 days a year, it's not a big ask to have some time with his friends. Truthfully I'm sure he finds your artwork depressing but lets you put it up because he cares about you. That doesn't mean he can't make a request your home be more friendly for one night. \n\nIn the future I suggest a compromise: Pick 1-2 rooms to put up your hobby artwork, and let him decorate the common rooms with happier stuff.", "NAH. You need your 15  paintings of gory body parts. He would like not to see them on a daily basis. It is probably about him not the guests, unless there are particularly unpleasant ones in the dining room.\n\nHe needs a more pleasant living space. He will probably move out and he should for his own mental health. And you can make a painting about the situation for your mental health. Just basic incompatibilty and different tastes in art.", "YTA. He’s always been supportive and told you how cool the paintings are and always encouraged you, but politely asked to take down the “gory bloody body parts and severed heads” just for one night so as not to disturb his friends while they eat? He’s allowed to think the paintings are cool, but also disturbing at the same time. He sounds completely reasonable and level headed and the fact that you are upset shows how detached from reality you are. He’s also correct in that (if he pays rent) it’s his home too.", "Surprisingly, YTA.\n\nYour boyfriend is accepting of you and your dark side, and is happy for them to be up most of the time. But what you’ve described is quite graphic and could be upsetting.by no means do I think you should decorate to accommodate guests, but it sounds like your boyfriend doesn’t love them either and just loves you.\n\nGetting to know his friends does not mean them getting to know the deepest, darkest parts of you.", "ESH\n\nYes, it is your home. But he is correct in that it’s now his home as well. You’ll need to find a way to make the living space work for both of you.\n\nPer you reply to another Redditor,\n\n> The paintings are of various things, but common themes in them are eyes staring at you, blood, organs, and disembodied heads. I use a lot of negative space as well to give try and give that hopeless neverending void feeling.\n\n[found here](https://www.reddit.com/r/AmItheAsshole/comments/14v5j1l/aita_for_not_taking_down_my_paintings_so_my/jrb0uqw/?utm_source=share&utm_medium=ios_app&utm_name=ioscss&utm_content=1&utm_term=1&context=3)\n\nYeah. That content would make a lot of people feel uncomfortable. Your assertion that his friends might be cool with it as little naïve, especially with no heads up and just walking in and BAM! Bloody dismembered heads. Perhaps you too just aren’t compatible, and it is upsetting for this to be coming out a year into the relationship. But here we are. Just matters now how you choose to address it.", "ESH - his approach was bad but his point is valid that it’s his house too. Have you asked before putting pictures up or do you just do it? Your wall space needs to be an expression of both of you, not just you. It is past time to have a real discussion on how the space you guys share is decorating. You need to be open to his input and that can mean taking some of your pictures down. Maybe let him pick his 3-5 favorite and the rest come down.", "Oddly cryptic about the subject matter of thr paintings.. YTA", "It’s HER apartment that he is living in.  Tell him to host the dinner at a restaurant and GTFO.  His masked slipped and he is showing and telling you who he is.", "Esh/nah its an awkward one. He was rude to go about it the way he did, but I think you were also rude for not listening/respecting him. From what you've said your paintings are a form of therapy for you, you paint your darkest thoughts, which I'm glad that it works for you. But wanting everyone to see the artistic side and be intrigued instead of grossed/freaked out seems unreasonable. It would be like printing out pages from a therapy/Dream journal and having them posted on your walls. To me that is to personal for the first time meeting. Maybe you could compromise by having a few of the less gruesome ones out, and putting the more gruesome ones away, I know you said some have eyes staring at you (which could be a good talking point) but others have disemboweled bodies (which could make people queesy and put them off food) I think if you can't compromise, then you can't be together. I don't mean you have to Compromise the way I suggested, just any compromise to show each other you both listen to, care for and love each other.", "NAH. My answer was going to be very different until I read WHAT your paintings were actually of…I can see how organs, blood and severed heads could be unsettling for some of your guests at a dinner party. Since it’s his residence now too, perhaps a compromise can be made. Maybe have him pick 3 or 4 paintings that he feels are the most unsettling and temporarily take them down for the dinner party.  You both need to feel comfortable in your home together.", "[deleted]", "If they’re gory paintings… just take them down. Do u really want people to think that about u? That ure just all blood and severed heads? He is not right for not being honest with u. I guess he didn’t want to hurt ur feelings.", "[deleted]", "First off, NTA. If your boyfriend had issues with your paintings, this was an issue he should have brought up BEFORE you moved in together. However, I would like to very gently suggest the following. You believe that your \"dark\" and \"macabre\" paintings help in the \"goal of the dinner ... to get to know each other more. I would think they are a great conversation piece and show a lot of insight into who I am and what I like to do.\" That may be true, but this isn't how people typically start relationships. People may have psychological issues, past addiction issues. They may have survived abuse. They may have survived poverty. Typically, you don't bring this type of stuff up during your first get together. Typically, a first meeting is pleasant polite small talk.  I think if your painting are truly dark, and you have a lot of them hanging up ... discussion of them may be too powerful and intimate for a first meeting. It would be like showing everyone your diary.", "Nta", "It sounds like you have a decision to make. Keep the boyfriend who isn’t honest with you, or keep the paintings which help with your mental health.\n\nNTA", "ESH. He should've mentioned that the paintings make him uncomfortable long before this. But, you might want to consider that someone could like your work and still not want to be surrounded by it on a daily basis. Intense art isn't necessarily great everyday decor.", "NTA- The paintings were there before him. He needs to move out if he doesn't like them. If he had said something about them before he moved in, you probably wouldn't have moved in together. His living there now doesn't give him the right to change what was there before, since he vocalized before that he liked them.", "NTA. Why did he move in with you if he thinks your paintings are \"twisted and sick\"? This was a conversation that should have happened long ago, and it is on him that instead of communicating how he really felt, he told you the exact opposite to avoid conflict at the time.", "NTA\n\nPeople in this thread are fucking delusional. The asinine comments are getting me heated lol \n\n“Omg ew blood, omg ew ew ew ew so dark so nasty” \n\n“I wouldn’t want to look at it”\n\nYet you all go to movies right? John Wick anybody? Play video games? Ever seen a Tim Burton film? The Saw series? Who the FUCK made you the purveyor of what is appropriate for a dinner party? \n\nNone of you have never been to an art show lmao. The IDEA of ART conforming to your pretty perfect world tastes is a fucking joke. Seriously cannot express this more. \n\nY’all are WILD for telling an artist her art is too gory and weird for her guests. Maybe you should all fuck off. Literally. You don’t like the paintings? GREAT. Don’t come over to her house! The world doesn’t revolve around your low fat sugar free vanilla tastes. If he doesn’t like the art that is HIS problem. \n\nTLDR: It’s her art. It’s part of who she is. If they don’t like it they can leave. \n\nDear OP: You deserve to have friends who appreciate cool art. Went to a show last night and one piece involved a naked lady crushing a guys head, his limp dick was covered in blood and his body was purposefully misshapen. It was titled Girl Power. For some reason I am strongly reminded of it \n\nDon’t listen to these kids or your boyfriend, they just don’t get it-which sucks. Your apartment sounds fucking dope \n\nP.s Downvote this to support the censoring of art!", "NTA... He previously indicated he liked the paintings or at least never indicated he didn't like them. Taking one or two of the particularly gruesome ones down would be reasonable. \nHowever, I'm pretty sure that if you take them all down, he'll always have a reason of why they aren't going back up. He IS embarrassed by them, potentially you, and doesn't want his friends to see the type of painting you do. He is testing the boundaries of how much he can control. It starts small \"just take them down for 1 night, and it's easy to do this to make him happy\" and it moves to \"well you took them down when my friend visited, it will ruin the mood for Thanksgiving... I don't want to put them up to take them down for Christmas... it brings down the mood of the season.... new year it's depressing... Valentines day should be romantic it brings him down...easter.... \"\nnext thing you know, you're lucky if you get Halloween or even get to paint.", "NTA. How is it his house too after only 4 months? Is he embarrased of you? Keep the paintings and get rid of him.", "NTA. It's art. It doesn't have to be warm and fuzzy, it's meant to make you *feel*. It's your home and he moved in with you. If he had an issue with them he should have been honest and brought it up before moving in, not trying to get you to move them now after saying they were \"cool\". I get the feeling if you took them down, you'd find it very hard to put them back up. Moving in after 8bmonths was probably a bit soon.", "NTA", "I think you should consider taking the paintings down- great to create them to process your feelings, but looking at them all the time may not be good for your mental health", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (25F) and my boyfriend (28M) have been together for a little over a year and he moved into my apartment a little over 4 months ago. I love to paint. It’s just a fun hobby that I use as my own version of therapy. Anytime I feel overwhelmed or particularly frustrated, I pour those emotions into a new painting and feel much better after it’s finished. I wouldn’t say I’m the next Bob Ross or anything, but I like my paintings and my friends and family always compliment them. I have about 15 of them hanging up around my apartment in various places. My boyfriend, J, has always said how cool he thought the paintings were and has never tried to discourage me from putting them up all over the place. \r  \n\r  \nAbout a week ago, J said he would like to host dinner with his friends at the apartment. They’ve never been over, and he thought it would be a good opportunity for his friends and I to get to know each other better. I agreed and was happy to cook, make drinks, and host. I immediately started planning what I was going to make and asking J if there were any dietary restrictions that his friends have. He stopped me in my tracks and told me he had one request to make before he confirmed with his friends. He asked me if I would take all my paintings down for the evening and put them in our bedroom. When I pressed him for why he would want me to do that, he shrugged his shoulders and said they might make his friends uncomfortable. \r  \n\r  \nNow my paintings are an expression of my negative emotions, so as you can imagine they lean toward the dark and macabre. They aren’t by any means pretty landscapes or bright flowers, but they are still my art and very personal to me. If the goal of the dinner is to get to know each other more, I would think they are a great conversation piece and show a lot of insight into who I am and what I like to do. J argued with me saying they are “twisted and sick” and that he doesn’t want his friends to think I’m some sort of mental case. I had no idea he felt this way about the paintings, and I was hurt by his description of them. I yelled, got mad, and told him that the paints aren’t going anywhere and if he doesn’t like it, then we can always go out to a restaurant instead. He pointed out that this is his house too now and he should be able to have his friends over for dinner without having to make excuses for the decorations on the walls. \r  \n\r  \nI stood firm in my stance, and we argued some more. He ended up leaving for the night and staying at his friend’s house. He has since come back and keeps bringing up the paintings every chance he gets. I don’t want to make anyone feel uncomfortable, but I think he’s more uncomfortable with my hobby than his friends would be and it’s upsetting to think that over a year into our relationship this is just now coming out. So, am I the asshole? Should I just take the paintings down for one night and end this argument? I’m starting to wonder what other things bother him that he hasn’t told me about.\r  \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Yta", "NTA. If they don’t like it they don’t have to look. If BF is ashamed or embarrassed, he doesn’t have to live with you.", "The paintings are of various things, but common themes in them are eyes staring at you, blood, organs, and disembodied heads. I use a lot of negative space as well to give try and give that hopeless neverending void feeling.", "From the way she described her artwork I would say YTA simply because I know I absolutely would not be able to eat looking at a painting of organs. Nevermind the other stuff", "\"\"Polite\"\" a word meaning willing to freeload off of someone and then insult them and their extremely personal artwork, apparently.", "great advice", "“Lets her?” Oh, HELL no. You don’t “let” your significant other do anything. Also, It’s her house that she lived in before he came along, and he had no problem with the paintings until now. He knew they were there and even said he liked them. He doesn’t get to spring this on her a year in. It’s art that she created and not something she bought, so him telling her this now is extra hurtful.", ">He needs a more pleasant living space\n\nThen he should have said so before he moved in to her place.", "He clearly thinks the paintings are not cool. She’s not detached from reality, you are. She has art on her walls that mean something to her, that have gory dark imagery and she doesn’t want to take them down. That’s the issue here\n\nHe sounds like a loser who doesn’t appreciate art. Kind of like you!", "Check the ops comment its like several heads, organs and stuff, definitely not what your friends first impression of your girlfriend to be and most people don't want to be stated down be paintings of grizzly corpses while they eat yta", "[deleted]", "Eyes staring at you, disembodied heads, blood, organs. Would you eat dinner while these kinds of paintings are all around you?", "Thank you! You put this into much better words than I could/did.", "If this was our first time meeting, I would absolutely see your point. I do want to preface, I have met these friends multiple times and at least a couple of them do know that I paint as a hobby. They have just never been to the apartment or seen the paintings before.", "Wow, you’re so cool and edgy. We’re all very impressed.", "👏👏👏👏", "I can like gruesome looking paintings. Doesn't mean I want the first impression of my partner to be decapitated heads and disemboweled corpses and bloody eyes staring at you. I think it's a fine request that these be taken down for a first meeting.\n\nYTA OP.", "Yeah that could make people feel uncomfortable. I’m uncomfortable by just reading that. That’s fine that’s how you use your emotions and what not but you can’t expect to everyone to be on board with it.", "this should be in the post", "Yeah. Not really sure how you expect them to eat dinner while those paintings are up. Some people get queasy at the sight of blood.", "I’m all for lifting the taboo around mental health issues and have chosen to do so in my own life, but that’s *very* different from insisting strangers face your personal form of therapy during a dinner party. It’s great you have an outlet. It doesn’t mean that your partner is an AH for wanting to create an inviting atmosphere for people you’re just getting acquainted with. \n\nESH. You for being so myopic about how your gory paintings may make others feel and he for using your paintings and their significance against you. I do wonder though if this is just the most recent example of you lacking self-awareness when it comes to how you process things in your relationship. When someone moves in you’re inviting them to make your home their home. Sometimes that means moving your stuff around so that the living space meets both your needs.\n\nNot wanting to look at gores pictures all day every day at your home is 100% acceptable and does not mean he isn’t supportive. Though the way you both handled this makes both of you look like you care more about what you want than your relationship.", "Okay. This should be included in your original post because it makes a HUGE difference! People don’t want to be at dinner party staring at blood, organs, and disembodied heads. Maybe it’s too late for this, but is there some sort of compromise where you can display your least stomach-churning pieces and put the rest away (again, dinner party).\n\nIf you’re unwilling to compromise, then, yes, YTA and you obviously don’t care about making your partner’s friends feel comfortable in your house.", "Be honest, why didn't you mention this in your post?", "Honey, come on.  \n\nYou have to have a clue how that could be upsetting to someone. I get that's it your expression, and that is perfectly fine, but when you have people over it's common courtesy & common sense to ensure they won't be exposed to something this potentially upsetting. \n\nTo give an example , my sister and brothers loves horror movies. They can watch Saw or other torture movies & talk about the weather. It just doesn't bother them. However it does very much both me. Not only do I not enjoy it, but it triggers a lot of anxiety & bad dreams for me. So when we get together we don't watch horror movies because they respect that it upsets me. Your paintings would probably be the same for other friends. \n\nIf he wants them down forever that's enough entirely different issue, but just to take down for the night to make sure your friends aren't uncomfortable while at your house, it should be a no brainer.", "This and moving in with a guy after 6 months is quite worrying when it comes to your mental health.", "I write poetry, particularly when I’m depressed, sad, lonely, etc. Needless to say, my writings are not uplifting. My father hated my writings because they weren’t happy and carefree. I learned early that while I might be expressing myself, not everyone is ready to “hear” what I have to say, or what I’m feeling, especially if it is a negative emotion. If you’re good at expressing your emotions, 15 of such emotional artwork likely is quite overwhelming to view.", "They sound cool, can we see one?\n\nNgl I think that’s awesome. Not sure if I’d want them in my apartment but really the kind of thing I like.", "Kinda off topic but can I see the paintings?", "I had just assumed the paintings had ominous vibes or something but didn’t realize it was full on gore. I guess you’re allowed to have what you want in your own house, but I know that I would be uncomfortable.", "Oh wow. Art is freedom of expression, and if you consider your paintings art, that's okay. \n\nHowever, this isn't *about* your expression or your art.\n\nThis is about tact, social graces, and entertainment. \n\nThis art does not reflect, nor will it cultivate feelings of happiness, joy, and comfort. They aren't any of those things.\n\n**They would, therefore, not be appropriate for the occasion.**\n\nAgain, this is not about you. It's about the environment your bf wants to present to new guests. Please put the art away for this occasion. It would be a nice gesture, and his reasoning is rather sound. Do not take this personally.", "It actually sounds interesting. Also quite a fun way to start a conversation , even if the conversation is \"I want to sit looking away from the disembodied head\".", "Lol why would anyone down vote her describing her work?\n\nAnyway.\n\nNTA: However maybe you can come to an agreement on how to decorate. Otherwise you should be able to have your work up in a space you pay for. Maybe you each get half or something.", "i mean it sounds cool, I'd like to see them but idk if id be comfortable w them while eating", "Right? This post is full of the pro-mooching demographic", "Maybe he thought that by asking him to move in she was going to consider his feelings and make space for his taste and needs in their now shared home. Crazy right?!/s", "It’s a given that moving in together means you will be co-creating the living space and making decisions together. He was an ass for how he went about it but it’s also not fair to just say ‘well you didn’t say it was a problem before you moved in so now you don’t get to change anything’.", "Take a quick read at some of the other comments on this post and see what the general consensus is. If 90% of the people here are agreeing then….?", "It literally is his house too. They now share it. I don’t like the way he went about it but it’s not crazy that he doesn’t love living surrounded by images of blood, disembodied heads and dark staring eyes.", "We're built different. I'd be excited to see it and have no issues eating with them around.", "If I loved the person who painted them and was proud of her work I would. \n\nThese are not prints she picked up somewhere, this is her art. If he's embarrassed by it then I think they have wider issues.", "\"Painting\" and painting nightmares are 2 totally different things. They would probably be creeped out and avoid you in the future.", "Info: and what if one of them has a sensitive stomach or may have issues with eating and the paintings could make it so they physically cannot eat? It would also be rude to invite someone over for dinner knowing there is a huge chance you ruin your appetite. Nothing wrong with you painting them, but just because you aren’t bothered with them doesn’t mean you could be causing serious issues for someone else. And if you’re inviting a guest over (which you both should be able to do in your own home in your relationship) it should be understood that you don’t go out of their way to make them uncomfortable. (How about you chat with the friends and see how they feel about them before making a decision and subjecting them to that with no warning???)", "Stay mad?", "Let’s not forget there are 15!!! Of them in various places around the apartment. I’m not sure how large the apartment is or how large the paintings are but that makes OP seem weird AF. I would not want my friends coming over either and I would think the person that painted them was a mental case too. Sorry, but that’s my truth.\n\nPainting them for therapy is fine but having them displayed over with guest that’s just inappropriate.", "Or eat while looking at it", "So if they were crucifixes and religious iconography (makes many people very uncomfortable) would you still support her having to take them down to appease the her partners wish to shield his friends from a part of her identity?", "I mean... A lot of things can put people off though. The paintings wouldn't bother me. But whatever. The issue is really about someone moving in and asking for changes. Changes to things they knew were there before. For instance. Let's say the dude had a bunch of paintings of nudes. That could make a woman moving in uncomfortable. Should they all come down? Or just a few?\n\nThe issue goes a lot deeper here too, since they're actually Ops work. So asking to take them down, is also asking her to hide something which she previously had in her home. Regardless of the content, the act of asking for this is a very sticky situation.", "Oh crap, I didn't even do that math. Yeah, I'll just reserve judgment on the paintings, because I feel confident these two have plenty more moments of uncomfortable adjustment and discovery coming up.", ">I had no idea he felt this way about the paintings\n\nHow can she consider his feelings if he didn't tell her before he moved in that he hated them? \n\nTelling someone you hate the art they created is massively different to disliking some throw pillows.", "I agree totally but this isn't like he dislikes some curtains, it's a part of her personality.", "Then he should have said that before he moved in. This is not just some decor she picked out, it is her art, her personal expression.", "[deleted]", "I'm a painter as well but even I wouldn't have those kinds of paintings up. I do have some vent art like OP has but it even scares ME when I see eyes from my own painting just staring right back at me. I usually flip them the other way or cover it. \n\nAnyways, I would absolutely LOVE to see OPs paintings but I just don't think these paintings are suitable for a dinner. That's it. If they weren't as gory, her boyfriend probably wouldn't have a problem with them in the dining area. Maybe put the least gory paintings in there instead? Or just have the dinner elsewhere so that everybody's happy and OPs paintings stay in place.", "Then they can kick rocks. It’s her house and her paintings. Not everyone is into Live Laugh Love signs and paintings of sunsets and kittens. If her boyfriend has a problem with that he can take them to a restaurant. I’m into horror and dark art and her paintings sound awesome. I also wouldn’t give a solitary shit what my boyfriend’s friends thought about it, and definitely wouldn’t be dating a guy that has an issue with that. He can love her for who she is, paintings included, or there’s the door.", "This is not the sort of thing someone would say if they’d ever actually cohabitated with someone in a healthy and respectful relationship. Yes, if something makes your partner uncomfortable you would presumably want to compromise because you love and respect them and their needs. \n\nWhat a silly argument!", "I dunno. I think both people have a responsibility to be aware of how their mental health and coping tactics impacts their relationship. This isn’t something she needs to be ashamed of and he was a REAL ah for what he said, but we’re getting one side of the story here and this kind of reaction strikes me as the last straw for someone that has already tried the gentle approach. \n\nMy husband and I have art that’s a bit gory/controversial and it lives in spaces where we can enjoy it without worrying about how it impacts our guests. I also think it’s inappropriate to make others sit in what is essentially a room of deep-dark mental health issue processing when they’re just trying to eat dinner.\n\nMaybe they should just go out to eat!", "I think it’s entirely possible that someone who didn’t think to offer to take some down when he moved in - even just so he could hang stuff he brought - may not be as observant of other’s feelings when it comes to her art. He was not right to say what he did, but I don’t believe this situation just sprang up out of nowhere. And her reaction to  him asking her to remove them - getting super defensive and turning it into an argument about them being a great conversation piece and completely dismissing his concerns - shows you just how open to someone’s feelings she is. And that’s open enough to want to talk all about it, but not open enough to understand that not everyone is comfortable seeing or talking about an acquaintance’s trauma or mental health issues. People that enjoy that seek out those situations by going to shows and art galleries. I doubt they expect it at a casual get together.", "Now he is expressing his discomfort and being dismissed. So are we supposed to think op would've TRULY taken his feelings into account earlier?", "A part of her personality that is completely dominating their shared apartment. He can think the paintings are cool but think it’s a bit much to have 15 of them up. And shouldn’t the place reflect his personality too?", "That’s the problem though. How can you constructively discuss an issue if one person has tied who they are to the issue so much that any disagreement over it becomes an insult to them personally. That’s a really childish and selfish way to navigate mental health needs and puts her bf in a situation where topics are off limits no matter how it is or isn’t meeting his needs.", "Uh, you have no idea whether they added him to the lease but it doesn’t matter. When you move in with a partner your space becomes shared space. What if he has some art of his own he’d like to put up?", "I think it's more the way he worded it that made me think he had an issue with the paintings rather than simply.not wanting them up for dinner.\n\n> I  think he’s more uncomfortable with my hobby than his friends would be and it’s upsetting to think that over a year into our relationship this is just now coming out", "His house too", "Agreed, in this instance going out is probably the best option because it gives them more time to discuss it calmly without the pressure of needing an immediate resolution.", "Her feelings were hurt by the way he described her paintings and because she previously had no idea he felt that way. If he'd brought it up a bit more delicately and in less of a time sensitive way she might have been more receptive. Hopefully calmer heads will prevail and they can talk it out properly when they've both calmed down.", "Yes but he isn't asking her to share space, he's asking her to hide her stuff. I feel like this could have been resolved a lot better if they'd talked about it before they had the pressure of guests coming over.", "His initial request was reasonable. Having those paintings up while you have guests over? You never know who has triggers to what and OP has 15 of various gory paintings. Some people get queasy just at the sight of blood. Even if they weren't having a dinner, it would still make some uncomfortable.\n\nBut I do think he went too far when they argued by saying hurtful things. They BOTH have the right to be comfortable in their home but need to have a serious conversation and to compromise if they want this to work.\n\nESH.", "Her house that he moved into and had no problem with her paintings until now.", "And maybe for both to apologize for their own part in the way they communicated this time around.\n\nPlus no dishes!", "Yup, that’s why ESH.", "Apartment. And he apparently always had a problem just didn’t say anything which is on him.", "The he shouldn’t date a girl that’s into it. It’s quite simple - accept people for who they are and be proud of them or don’t date them.", "Agreed", "YTA. \n\nWe aren’t talking about just darkly colored landscapes here. We are talking images which could be really triggering for a lot of people. \n\nIt isn’t going to hurt you to put them up for the evening. If you wish, you can mention your hobby of macabre painting to your new friends, and see if any of them ask to look at it. Absolutely some people enjoy that sort of thing and there’s NOTHING wrong with it. But it’s also something that will really bother probably a decent majority of people, to the point where at least one dinner guest will probably be made to feel completely uncomfortable.", "Unfortunately, YTA.\n\nYou didn’t mention the fact that all your paintings are of eyes staring at you, blood, organs, and disembodied heads. Those kind of themes would make anyone uncomfortable and uneasy.", "**From one artist to another, YTA.**\n\n1. It's not 'Your' apartment any more. With him living there, it now belongs to both of you. He deserves input on decorations as well now. That's how it goes when you invite another person into your life. You make room for eachother.\n\n2.  Getting to know people is a gradual process. You don't meet people and tell them about the deepest darkest part of your life right off the bat. Or, at least, you shouldn't do that. **That's honestly rude.** It puts a lot of pressure on people. \n\n3. It comes off really pretentious having a shit ton of your own art hanging up around your home to the point it out numbers anything else. I have met several artist like that, and they are usually pretty narcissistic. \n\nI only have 4 of my own small painting interspersed through my downstairs. All of the large focal point art in my home actually belongs to other artist. \n\n4.  Bloody paintings are not appropriate for people not expecting them. Just like you worked through trauma to paint them, what if someone comes in your home not expecting to see that imagery, and it drudges up their own trauma from the past?", "YTA. Truth Time: Art therapy is not about creating some 'final product' for public display. It is instead a *process* intended to take place in a private context, to promote our own reflections on our internal workings, to better facilitate each next step toward personal transformation to a healthier state of being. (And notably: for the purpose of engaging with the external world in a more healthy way, opening up more opportunities for ourselves, not closing opportunities off.) \n\nBy immortalizing and plastering up images of blood and guts, decapitated figures and creepily staring eyes, as permanent decorations on your apartment walls where any visitor may see them, you're not doing 'therapy'. Therapy is structured to be transitional, toward an end goal of health; you wouldn't be constantly reproducing and keeping the same unchanging type of images around if you were actually making therapeutic progress. And letting random houseguests (not just a trained therapist or at least carefully selected and rare individuals who can be trusted with the deepest and most difficult things of your heart) view these vulnerable images... it seems to reflect an unhealthy difficulty to set appropriate boundaries that will protect you from unnecessary harm (including social harm) in this world. Because the truth is, many houseguests *will* think these images (especially revealed to them so carelessly and boundary-lessly, on living room walls) are evidence of untreated mental health issues. It wouldn't be just the fact that you paint gory things in the context of working through internal issues therapeutically (many people would be able to understand that). It would be that you would seem to lack the common sense or ability to 'read the room' and appreciate social norms, such that you can't navigate appropriate boundaries around who you should share your personal therapy work with, and who you shouldn't. Who you should expose to your gory paintings, and who you shouldn't. And people feel (quite reasonably) uncomfortable around people who don't seem capable of recognizing or respecting appropriate boundaries. Because people who can't recognize them, are unlikely to respect the ones that matter to others.\n\nSo, basically, YTA... in this situation. But I don't think you're a literal A. I think you'd benefit from actual therapy, and I'm sorry to hear that it sounds like you're not yet receiving this. In my opinion, everyone would benefit from therapy. But it needs to be a real and legit therapeutic technique, not just an occasional release of stress and heavy feelings producing temporary feeling of positivity, but no larger transition of behaviours and life-way to a more healthy pattern. If you were experiencing true therapy, I'd expect the images on your walls to move to a more private room... and I'd also expect them to eventually change in what kind of imagery they display. And in the meantime, I think it's healthy (even if it feels temporarily uncomfortable) that your boyfriend has raised to your attention that there's an actual issue here. I hope you're able to take some time to breathe and humbly reflect on it, and consider whether a different approach may actually be in your best interests after all.", "YTA.  Your art sounds great, but hosting a party with 15 paintings of blood and gore and dismembered heads around seems… strange.  \n\nMaybe compromise and clear out half of them at least, the most obvious ones in the common areas?", "I was leaning towards E S H, but you conveniently left out the imagery of those paintings in your OP, which likely would make his guests uncomfortable, and asking questions to him that he'd be uncomfortable asking. This makes it YTA for me. He's moved in, contributing to the expenses, which makes your apartment just as much his place as it is yours. Would it have killed you to take them down for the few hours his friends have been there? Seriously, you need to have some consideration for what your portraits signify, and consider not everyone will be comfortable viewing them.", "There was a post exactly like this one but the pictures were too juvenile for the boyfriend.  Exact scenario with inviting his friends over for the first time.  She asked about food preferences, etc.", "When you read the comments a clearly see the one very important detail that OP left out.\n\nBoy howdy….", "Yeah, YTA. \n\nI'm going to copy your comment just in case someone missed it:\n\n*The paintings are of various things, but common themes in them are eyes staring at you, blood, organs, and disembodied heads. I use a lot of negative space as well to give try and give that hopeless neverending void feeling.*\n\nAnd you want to talk about that at dinner. That's not a conversation starter. I understand art is your means to express yourself and same. I also paint darker themes but you have 15 paintings hanging around your house of blood, organs, disembodied heads... You can definitely make a lot of people uncomfortable with that and no, it is not something you discuss with anybody you just met. These sort of things need time and slow introductions because remember, these things are normalized to you, not to everybody. I love the macabre and while personally I would ask genuine questions about the topic with you, I also know that not everyone is the same and that's not a bad thing. Sometimes you have to learn to compromise in life and  take things slowly to get a better outcome.\n\nSo yeah, I understand your boyfriend *but* I don't think the way he's approaching things is good either. Maybe he doesn't know how to communicate it, so try sitting down and ask if he never wants his friend(s) to know about this side of you. Don't be too straightforward because I feel there's high tension right now but try to see where this relationship is going. I feel his response can really make a difference here. Is this part of you shameful or does he feel it's too intense as a starters for meeting his friends? I wish you the best, by the way, don't take the YTA to the heart.", "It’s both of your apartment. Because of the content of the paintings it makes sense he would ask to take them down to have company over. He doesn’t think it’s uncool or is unsupportive of your hobby, he’s respecting other peoples boundaries and trying to create a welcoming environment in which to have company over. \n\nYTA", "Honestly was ready to defend you OP but after reading what the paintings are, YTA. they're your boyfriend's flat too from the sound of it. I know you omitted that detail to get people to be on your side so you know you're in the wrong. I thought they were like Addams Family kind of stuff but nope.\n\nReally the biggest thing for me is comfort level, triggers and trauma exists too. So those paintings of the nature could make people uncomfortable or triggered. because of my neurodiversity and eating disorder, I can never eat food in front of any gory stuff because my brain makes a mental link to it and makes me think it's that I'm eating, even though gory stuff doesn't bother me otherwise usually.\n\nMaybe your boyfriend could have explained to his feiends about it. Maybe you need to give trigger warning to people coming over. It's not a lot to take them down and put it back up.", "Sounds like he has always been supportive before, why not help him out this time. Gore isn't everybody's thing and 15 is excessive.", "YTA", "I read this exact post about 3 weeks ago, possibly verbatim. But 100% of the details are identical...", "Sounds like your boyfriend is not comfortable with the art you put up in your mutual home. Your issue isn't decorating for a dinner party. It's creating a home you both feel safe and happy in and one you both are willing to invite your friends to. \n\nPersonally, if I walked into a home with 15 paintings like you described, I'd be backing out and never coming back. And probably not continuing the friendship. So his concern is legitimate.", "YTA\n\nYou share the space now, and should be willing to compromise. \n\nYou’re also TA because you intentionally incorrectly described your paintings in your post as “lean towards the dark and macabre”. I’d argue that they are undeniably VERY dark and macabre. \n\nReach a compromise like taking the paintings down for his guests and then having just one room in the apartment where they are displayed. They don’t need to be all over the place! And displaying 15 is a lot!", "Yeah, those types of pictures would be upsetting to look at for most people. As a host you want to create an inviting place for people to hang out. If I got to someone's house and was surrounded by blood and guts I'd be scared. And I don't think of myself as someone who is narrow minded when it comes to art but there is a time and a place. You are more concerned about preserving your rights as an artist than you are with the comforts of your guests which makes you a poor host. Keep the art in another room and  if the topic comes up during the dinner you can certainly take people back to look at the art as long as you warn them about the blood and guts. But many people can't handle looking at that stuff.", "Soft YTA.  Your art depicts subject matter that someone would have to go out of their way to look at and by your description, it’s disturbing.  Forcing people to look at such things isn’t ok. Part of being in a relationship is compromising.  Your art is hung all the time. Your bf is asking that it be put away for one night. When they ask what you do you can tell them about your hobby. If they ask to see your paintings, you can warn them ahead of time.", "It occurs to me that she feels he is rejecting a part of her, and she may not be presentable to his friends. There is not enough information to make a judgment here.", "After reading your comments and finding out what the paintings are, YTA\n\nETA: spelling", "ESH\n\nYou are sharing a home which means making compromises regarding art on the walls. It’s not just your home anymore. \n\nShould he have been honest? Absolutely. But you also moved in together really fast. 6 months is not a lot of information about anyone - it’s still the honeymoon phase when everyone is on their best behavior. \n\nMoving in is better met after the honeymoon phase, when you’ve experienced more rough edges and still choose that person. But I digress.\n\nYou’re expecting people to take in the whole of how you express yourself at first dinner party. Slow it down, you gotta give people a minute. Your sharing time, you’re not the main character even if it’s taking place in your home.", "Compromise on some coming down, some up, and none where you are eating. \n\nProblem solved", "oh op, i so wanted you to be right. but YTA with a hint of ESH. looking at your description of the paintings, it’s uncomfortable and i can understand why your boyfriend wouldn’t want his friends to feel uncomfortable. but also, I think there’s part of him that didn’t want you to feel judged and he got protective in a weird way. but op, you’re being stubborn. the subjects of your paintings are very macabre and unsettling, and I think you should hear your partner out on this one without either of you getting defensive.", "NAH. I'm a big fan of macabre art. My boyfriend is cool with some of the stuff I have, but other things make him uncomfortable. Since we share a space, we compromise. I don't think you should have to remove ALL of your paintings - I agree that they're a great way for his friends to get to know you. Maybe you two can decide on which ones will stay in areas where you're entertaining, and which ones can go in a private space? \n\nYou're living together now. You're going to have to learn to accommodate each other. You can't insist on dominating the space, and he can't behave like he's embarrassed of you in front of his friends. Best of luck!", "Given the description of the paintings soft Y T A for that. People generally shoudl accept the hosts taste when visiting somewhere and people have the right to decorate their home as they wish but there are limits to this!  \n\n\n N T A because you should think a good while about your boyfriend seemingly lying for so long about what he really thinks about something that is so important to you as well as seemingly not doing much when his friends call you a \"mental case\" which begs the question whether he agrees.", "YTA. It’s art, but that shit is not normal.", "YTA - Put your art away. They’re meeting you for the first time. They don’t need to smell your farts just yet.", "Wow. I didn't expect the polarizing response this has gotten. I feel I should clarify a couple of things. For the people who are saying we moved in together too early, I agree. It was never our plan, but due to some issues where my boyfriend was living before, we just decided it would be the better environment for him. I have a big apartment (two spare bedrooms, our room, and an office), so before my BF moved in, I was even considering downsizing. \n\nAs far as the content of the paintings... A few people have said I was being purposefully vague about them in my post. I tried to explain that they were dark and expression of negative emotions. I didn't know if anyone would want me to go into detail about them. It's hard to describe them because each piece is different. I've never hidden them or destroyed them as some people suggested I should do because I genuinely love them and they make me happy to see. Each one has its own story and feeling to it and destroying them would be destroying hundreds of hours of work that I put into them.\n\nThere are no disembodied heads in my dining room. Most of my paintings are upstairs and not in the common area already. Only 5 are actually in an area that most people would see. I was not upset that my BF thought his friends might be uncomfortable with the paintings. While I love horror movies, books, and art, I do understand that not everyone does. What I was more upset about what that for over a year, my BF has told me he likes them and has no problem with them being around the house. Yes, I have asked him multiple times. I've even asked him if he would like me to hang them in my office and he has told me there is no need to do that. \n\nI hope this clarifies some things for people. I do appreciate the constructive suggestions people have made. I am going to have a talk with my BF and try and compromise with him as well as get his honest opinion on the paintings as a whole. If anyone is interested, I'll post an update on how that goes.", "The bigger question should be: do you want someone who thinks you are a \"mental case\" who creates \"twisted and sick\" artwork to be YOUR boyfriend and living companion? He is putting what he thinks of you and your paintings -- which are an expression of your inner thoughts and feelings -- into his own words and then projecting them onto his friends. He doesn't really know what they'll think, just what he actually thinks of you and your paintings. Should you take them down? Not if you don't want to, but you could compromise and take some down and replace them with images/photos/art that he likes to share your wallspace. But again, he's told you what he really thinks of you...NTA", "ESH", "Mature adults generally cater at least a little to guests coming over, I love the dark and macabre, I have taxidermy and skulls in my home, I would put them out of site if I had a vegan friend coming over because it's a nice thing to do.\n\nHe could have been nicer I guess, but it was a request, and I think if he personally hated them or cared that much he would have told you to pull them down before now.\n\nESH", "NTA. If he has an issue with them, he should have brought it up before he moved in.", "NTA he should have brought it up before moving in. The fact that he didn't makes me think he wanted to wait until he had the power of saying \"this is my house\".\n\nIf he's embarrassed for his friends to see who is girlfriend really is then you shouldn't be with him. He doesn't like you, he likes who he wants you to be.\n\nI have plenty of friends that do similar art to you and I'm not particularly into it. I just appreciate the skill that went into the picture.", "NTA They’re yours, they’re an expression of you, and it’s your apartment. But you have way bigger problems than that. Your bf is disturbed by your art. That won’t change. The “friend dinner” is an excuse for him to ask you to change. If you take them down, his next request is to ask you to leave them down or limit them to the bedroom. Only you can decide if you can live with that.", "Gonna get downvoted but I don’t care. Your art, your space, no problem. NTA", "NTA. Can't believe everyone's telling you YTA for having your own tastes, whether they're dark or not, displayed in YOUR OWN SPACE. I'm assuming the partner knew that's what your place looked like before moving in. That's wild and entitled of them. I'm not going to make my place more 'pleasant' and take down all my decor just because it makes people uncomfortable.", "This is really only about that final question you raise: what else is he bothered about and not telling you? \nYou are NTA, but not because youre entitled to paint how you like and hang those paintings where you like in your own private space.  You are NTA because you’ve been open and respectful in your relationship. He’s TA because he has clearly not been so honest and would seem to value his friends’ feelings over yours.", "Sure!! They sure don’t! Good thing they’re just visiting and it’s not their home 🥰🥰🥰 \n\nAnd if they never wanna come back bc they hate it? They are nta. They do not have to like it, they do not have to come back. That isn’t rude, that’s their prerogative.", "Nta, macabre or not, it your apartment you pay rent, not him. If he dont like it he can move out", "Maybe I’m biased, because I have an art degree, but asking you to remove your art is completely out of line. Art has no responsibility to be pretty and comfortable. Giving them a head’s up is fine, asking you to remove them from your own space is not. NTA", "Personally I think J sounds like a little flower who needs to grow up .. and if his friends are offended or upset by paintings then they need to, too. \n\n&#x200B;\n\nFuck J.\n\n&#x200B;\n\nNTA.", "NTA I think you've answered your own question in this post. Your boyfriend thinks your art shows a side of you that he doesn't like. He's been lying to you all this time.\n\nIt's not about the dinner.", "NTA, I'm into all sorts of gothic art and macabre art pieces. If hes not comfortable with it, just take them to a restaurant.", "Your boyfriend is immature. Stomping off for the night. Making assumptions his adult friends will be \"uncomfortable,\"\n\nNTA", "NTA if he had an issue with them it should have come up before now. I refuse to hide who I am to make guests comfortable in *my* home", "NTA  \n\n\nHoly shit OP this man is on another planet, \"I live here too now\" oof so you gotta redecorate what was your place first, for guests HE wants over every time because he likes to jump you with shit that bothers him for months at a time? pass hard pass, I wonder what else he is just waiting to jump you with? either he goes to the restaurant like you suggested or this might be a bit extreme but he can always move back out if he wants to pull the \"i LiVe HeRe ToO nOw\" manipulation shit, try out the \"iT wAs My PlAcE fIrSt.\" if this is really the game he wants to play.", "ESH based on what the paintings are. He picked a bad way of going about it, but it wasn't an unreasonable request to ask for them to be taken down for one night. Think of it this way, you might wander around your house naked when only the two of you are home, but you'd get dressed if guests were arriving.", "even if your paintings are macabre (and I read the description), no you should not take them down and yes, he is being rude, and no you two are not compatible and yes, you should not go out with him anymore. NTA", "NTA. It sounds like your BF hasn't been completely open and honest about his feelings, and he's probably hoping to get you to acquiesce to more and more changes over time.", "NTA. Your paintings sound cool, very macabre. You ought to kick out the bf cause he doesn’t pay equally to the rent and stuff.", "NTA.", "Absolutely NTA. Dark, gory and grotesque art has been around for a long time. Sure, it's not everybody's cup of tea, but this is your apartment, and your work that you're proud of, and you were there first. That, and the fact that your boyfriend has pretended all this time to like it, AND that he doesn't even pay rent or bills regularly, cements my opinion. Not to mention him getting so pissy that he left to spend the night at a friend's over this subject that he suddenly had an issue with. That's a huge red flag (most of the Y T A votes seem to be from people who don't like creepy art. I like creepy art and would have no issue eating around it. So does my partner and the majority of my friends. I can assure you that you can find someone who sincerely appreciates your aesthetics. You deserve better.)", "NTA. And what is with all the AH votes?? It's *her* apartment. She can decorate any way she wants to. If the friends (and it sounds they're primarily the boyfriends friends) are uncomfortable, they can go to a restaurant for dinner.", "Why are we preemptively planning around other people's theoretical emotional responses and delicate sensibilities to something they've never seen? Why do you have to hide aspects of you in your home?\n\nJ has asked the \"What if they are uncomfortable with your paintings\" question.\n\nHas J asked the \"What if they respect and admire these expressions of who you are\" question? Does he have a fucking camera? Can we confirm this assumption before we force you to hide part of yourself for the comfort of others in your own home?\n\nClearly, I'm on the side of finding out more and keeping them up unless a damn good reason is given. NTA.", "NTA, against the grain all the comments are saying \"well I wouldn't want to eat around your work either!!\" Isn't that an indicator of who you would WANT in your home???? \n\nWhy would I be friends with people who constantly force me to put away my artwork. Yes, it IS macrabe and haunting!!! Thats who op is. They aren't inviting children, they are inviting grown adults to their living space. They can form their own opinions and the door would be a welcome exit if they clutch their pearls at the thought of eating there.\n\nTo the people who are saying the boyfriend should have a say on their living space, yes he should, he should be welcome to *add* anything but he freely had the option to say shit BEFORE he moved in. But clearly not only did he not, he also willingly stayed with op, if her painting weren't twisted enough to run off someone she's intimate with I'm sure they aren't bad enough that people can actually sit down for a meal. The bf is very unsupporting and I'd discuss with him if there is any future of moving into a Co-owned place because he'd most likely hide away all of ops hard work.", "Why are you with a man who dislikes you to this degree That's not healthy time to kick him back out of your apartment.", "NTA.  He moved in knowing what was hanging up on your walls.  If he had an issue with it then he should have brought it up before you both decided to live together.  He knew he would want friends over…if it bothered him he should have discussed it with you, again before he moved in.\n\nYou are allowed to have macabre inspired decorations around your home.  You are allowed to be you.  Sounds like 1 - your bf is bad at communication; 2 - he wants to change who you are aesthetically; 3 - he is using his friends “coming over” as an excuse to get you to take down the paintings.\n\nUnfortunately, since he waited until now that you are living together to tell you his real thoughts on your art, and in a rude way, you are kind of stuck having to try and compromise.  You both are sharing the space, so you should both get to decide how to decorate.\n\nAlso, I too would be wondering what other things he dislikes about you/your home that he is not telling you about.", "YTA. You should keep those twisted body part paintings in your own private space. What if a kid ever entered your apartment?", "NTA\n\nBut this man is telling you WHO he is and WHO he THINKS you are.\n\nDo you really want to stay with a man who thinks you are twisted and sick?\n\nHe moved into your apartment(is he paying an equal/fair share?).  Just curious.  \n\nAfter reading your description--Maybe not in the room you are eating in?  it might affect appetite.  I mean I can look at gory pix but while eating--not conducive to good digestion.", "Make excuses? Just say yeah gf is an artist and she uses her work as therapy. Neither he nor his friends have don’t have to like your art, but it’s your fucking home too AND YOU AGREED TO BASICALLY GO FULL HOUSEWIFE AND DO IT ALL TO WELCOME THEM INTO YOUR HOME.", "NTA. They’re your paintings in your apartment. But… the amount of people saying yta is a good indicator of how a lot of people would react to any artwork that didn’t make them feel all warm and fuzzy inside. The question you need to ask yourself is do you want any of those people in your apartment? Also some people just suck, even if you took all the paintings down and tucked them out of the way in a different room, some very special curious person is going to want to take a look behind every closed door. How would they react to finding your paintings “hidden”? \n\nYour BF is embarrassed by your artwork. He wants you to pretend to be someone you’re not while paying for his bills. This is not normal. Well, it’s sadly normal but it’s not OK. You need a better BF. You absolutely CAN get a better BF. It won’t be hard to find someone better cause your current BF sucks.", "I read your comment about what specific things are in the paintings. As a person who loves oddities and has a heavy gothic decor home , if ppl are uncomfortable in my home then they shouldn't be there. Plain in simple. I may sound like a bi*ch but my home is my sanctuary.  I assume yours is your sanctuary.  Art is art is art. NTA", "Bugger some of these YTA comments.\n\nNTA. If your partner wasn’t comfortable having them displayed in the first place then he should have used his big boy words and said so. He could still have been supportive of the hobby while expressing that.\n\nWhat’s the rest of your decor like? Do you tend to like the dark and spooky aesthetic? Because if so, it sounds like he’s not ever going to want that in the house, and if it’s important for you to be able to express that, then it’s not going to be an environment thats balanced. Just something to consider.\n\nI create art, and collect stuff by others, and it’s all sorts of weird, dark etc. My partner loves it, but also supports it in the sense of others coming to visit. There’s an assumption that most people are going to be polite about your house, even if it’s a bit different, and if they come in being super judgemental, then they’re revealing something about themselves. The idea that ‘you don’t reveal your full self to new people’ that someone has suggested above is nonsense, especially when they’re coming into your home. Let them reveal their true selves to you through their reactions.", "Nta", "Is your house. They want other decor, try a fucking restaurant. He’s the one with this issue, he can deal. NTA", "NTA, imo, but I wouldn’t ant to be friends with people who were uncomfortable with my art. I also have serial killers, organs, bones, etc in my apartment. My friends and partners know if they can’t handle art, this isn’t the place for them.", "Boy Bye! \nNTA he has shown you he cares more about his friends hypothetical opinions than your beautiful art and by extension YOU, they might love them but he's not even giving them or you the chance to find out, if he's embarrassed of such a big part of you he can kick rocks.", "I feel like we need some examples as to what the paintings are bc sometimes the intensity for it can be a little much for houseguests. Like even if it's completely sfw I'm not gonna have a candy gore daki or whatever just chilling on the couch", "Neat trick how you aged two years in a couple months!!", "I am now envisioning pickman gallery from Fallout 4, that would be upsetting for most people, and Francis Bacon or Zdzislaw Beksinski are some of my favorite artists.", "YTA. It’s a perfectly reasonable request to not have disturbing images on the walls during a one time get together. He didn’t ask you to get rid of them permanently.", "YTA for leaving out the description of your artwork which makes it much more clear why he was asking.", "I would be fascinated by your paintings and would want to ask tons of questions about them! I also would have no problem eating around them. But, not everyone is like me. I can see how some people might be put off by that kind of thing. He's an asshole for the way he went about it, but you're kind of an asshole for not being able to see things from his (and his guests) point of view. Maybe see if you can compromise, and move some of the paintings in the areas you'll be entertaining in, and leave some in the bathroom or hallway. That way, you'll still have some of your artwork up, and bf will feel more comfortable with his friends being over. I'm going with ESH", "YTA it would be very honourable of u to apologise and make ammends", "YATA You two decided to live together. It is no longer your house but y'alls house. Both have a say in the decor. Be grateful he supports your mental issues daily and let him have 1 dinner where he doesn't need to explain it to his friends.", "Okay….  So, I think my first question is this: Is this your apartment or yours and his apartment?  Because, if you still consider it your space only, that might be something to take a look at. \nAs far as your paintings go, because of the nature of your paintings, it might be worth considering that this might not be to everyone’s taste.  Yes, they are yours and, yes, they are important to you.  That’s fine.  However, if they bother your boyfriend as much as it sounds like they do, then the two of you probably need to sit down and have some serious conversations. You have to allow him to be honest with you about how he feels. And you both have to figure out a way to accept your differences and/or decide if you can live with them.", "Yta. Your Bf is a Saint for putting up with you this long. Get some actual therapy. The pairings sound super cool but probably for an art exhibit. Not an apartment with random guests you don’t know. Sure one or two of them might enjoy it too but overall it’s you jamming your trauma on them. That’s not cool.", "If it's important for you to have the paintings up, and it's important for your bf not to have them up. You need a compromise. \n\nWhat if instead of having them in all rooms, you have one room with artwork on the walls? Or split the place 50/50.", "Nta. Do not change yourself,and as an extension, your space, to appease others. They can either discuss it or stay away if it makes them uncomfortable.", "Don’t be shy show us one of ur paintings 💀 YTA", "NTA. No you shouldn't because just like it's his space, it's your space too and if you want to hang your paintings in your space that's allowed. If he doesn't like it he doesn't have to have the get together there. Furthermore if he can't accept them being a part of you and he thinks they are sick and twisted, you really should evaluate the future of you two.", "YTA\nTBH I didn’t know women could be edgelords too", "\\>keeps bringing up the paintings every chance he gets  \n\n\nHe’s trying to steamroll you.\n\nTo me, that is a bugger concern than what he thinks his friends will think of your paintings.\n\nNTA and don’t back down", "NAH.  You have a right to display your art in your own home even in areas commonly visited by guests.  Your bf’s friends have a right to socialize in a place that doesn’t have gory negative images if that’s not their thing.  Your bf has a right to invite his friends over to a house that is also his own.  I expect what you are reacting to is not that some people won’t like your art but that your bf seems to be embarrassed about it and the art is such a personal extension of yourself, it means he’s embarrassed by you.  That may not be what he meant to say.  \n\nRegardless, I think you and your bf aren’t compatible.  There are people who won’t be put off by your art and there are people who when the purpose of your art is explained won’t judge you as a “mental case” for having what seems to me is a perfectly reasonable outlet for negativity.  Have a calm discussion about what having the art displayed publicly means to you and about what having a place to entertain friends that is free of the art means to your bf.  Either you’ll be able to work it out or you won’t and will need to part ways.  Best of luck.", "YTA, I think at first he asked politely and when u asked him why he STILL answered politely. It is his home too and i dont think he feels that.", "I was here to ask what the paintings were of but i see they are of organs, severed heads, etc.\n\nI don't think his request is unreasonable, tbh. I thought you were going to say they were tasteful paintings of artsy naked people or something. But it just sounds like they are disturbing and upsetting (and meant to evoke those emotions in the viewer), which ... yeah. I would not want to go to a party with viscerally horrifying paintings all over the walls. Some people could be genuinely frightened by that. And it's not 1 painting, it's 15! Not everyone wants to look at horrifying images.\n\nYTA", "He thought the paintings were cool when he was trying to get you into bed. Now he's trying to mold you into what he thinks his friends will approve. Sorry, but you cannot stay with someone who is embarrassed by or doesn't like the expression of your core feelings. He doesn't respect you.\n\nNTA. Get his keys back and hand him some boxes to pack.\n\nEdit: I read the description, and although I would not like the paintings, my answer stays the same. It's your art...your expression. And he doesn't like that part of you.", "YTA and your boyfriend is remarkably tolerant for putting up with your cathartic gore paintings every damn day.", "You shouldn’t have to change your apartment for his friends, you should have to change your apartment for him, who lives there also. I’m of the mind that when it comes to home decor a yes and a no is a no. \n\nIt’s cool that you use art as your therapy to process negative emotions, but why would your partner want to live in a space shrouded with the worst/ darkest parts of you? Many people want their homes to be a place of refuge. \n\nAlso why would you want to lead with these negative parts of yourself to his friends who don’t have the full context of knowing you yet?", "Bf is an asshole for not communicating respectfully, and OP is an asshole for not being able/willing to understood that macabre paintings of organs, eyes, severed heads etc. are off-putting when hosting unsuspecting folks for dinner. \n\nPainting and hanging the paintings is fine. Not liking them is also fine. But these two live together and need to communicate properly. ESH.", "NTA. Dump him. If he can’t handle a few severed heads, bloody stumps, and some internal organs- he’s not the one for you.", "NTA, he moved in with you.  Unless his name in on the lease or the title it is not his place.  Of you take them down now you will never be able to put them back up.  He told you what he really thought of them and of you \"Twisted and Sick\".", "How were you 23 two months ago and 25 now?", "YTA", "They just told you smh read the 3rd paragraph", "Yea lol, severed heads and staring eyes and organs. Gee i wonder why he wants them down for a dinner party.", "That is ridiculous. Art is art. It is incredibly subjective, and many people enjoy darker styles and themes. The boyfriend is not an ass because he doesn't love that style of art. But he is an asshole for hiding his true feelings, to the point where he needs to insult his partner and demand they make changes to their household in order to have people over.\n\nThey are not compatible and OP is definitely NTA.", "Yeah she said blood organs and disembodied heads so . . .", "Her paintings are of dark staring eyes, organs, and severed heads - per OP. Yea, I'd take them down for dinner parties too. And there's 15 of them.", "As soon as she said the paintings were an 'expression of her negative emotions' I was already wondering how awful it would be to live surrounded by that before I got to the comments and found out it was all eyeballs and severed heads and organs.  It sounds like she takes her negative emotions and hangs them up on the walls which sounds like a depressing and upsetting place to live.  I get that some people dig that, but the boyfriend should have a say in the decor- especially decor that could drive you into depression or bring up bad thoughts.  \n\nHeck, even if you were Thomas Kincade himself having fifteen of your own paintings hanging around a small appartment is a bit much and room should be made for the other partner to pick out and hang art.", ">The paintings are of various things, but common themes in them are eyes staring at you, blood, organs, and disembodied heads. I use a lot of negative space as well to give try and give that hopeless neverending void feeling.\n\n: /", "He asked for a night where the space wasn't filled with gore paintings. That isn't \" waiting so long to express himself to you.\" That is being considerate of guests. He doesn't suck for that", "I was with you until #3 \n\n I hang my art all over the house. I make what I enjoy. There is absolutely nothing narcissistic about enjoying your own artwork in your own home.  That's just silly.  Do I have others art work up? Yes because I love art. But why pay for stuff, when I have fun making my own?", "^^^this is the answer", "All of this. I hope OP reads this comment with an open mind!", "\"Let's her\"?? She's not his child! She has the right to decorate the space she lives in any way she sees fit. And as for the guests, they're just that. *guests*.  You don't get to march into someone else's home and demand they change their decor to make you comfortable.", "🏆🏆🏆exactly this!👏", "He could very well like the art and understand it’s meaningful to you, but also recognize that type of art might make other people uncomfortable and that’s not the best situation for your first time hosting them", "> I was not upset that my BF thought his friends might be uncomfortable with the paintings. While I love horror movies, books, and art, I do understand that not everyone does. What I was more upset about what that for over a year, my BF has told me he likes them and has no problem with them being around the house. Yes, I have asked him multiple times. I've even asked him if he would like me to hang them in my office and he has told me there is no need to do that.\n\nBut these two think's are not contradictions. He could very well like them and have no problem with them being around the house... When he is not brining over people who he thinks might be uncomfotable with them", "Please do not take down your art. I can assure you that there ARE people out there who genuinely enjoy macabre artwork (look up \"dark art movement\" to see whatI mean). Your boyfriend has basically been lying to you for a year and suddenly, now that he has a free place to live, he has an issue with it. I know my opinion might be unpopular, but I'm also an artist who enjoys darker subject matter and I feel strongly about this. I would die on this hill if I was in your position.", "As someone who enjoys ‘darker’ artwork from artist like Danny Ingrassia and Boris Groh- good for you!Don’t change who you are. \nOpinions are like assholes and everyone has them.", "He pays rent i assume as well as groceries and utilities, so yes... He does have a say. Heaven forbid he not have an opinion on his living space because his SO hangs disturbing imagery everywhere. Yes he should've said earlier, but **it's for one night!!**. It's not the end of the world, who seriously wants to eat food while looking at gore and death?\n\n\"Hmm these meatballs are nice, really compliment the decapitated head with a knife in it.\"", "I have probably spent around 500 hours dissecting human cadavers (anatomy lab). I've even cut off a human skull with an electric saw to get to the brain. \n\nWith that being said, I would be very uncomfortable eating dinner in an apartment filled to the brim with creepy ass paintings.", "Let me go take a survey of 100 of my friends and see which would want to be eating dinner in a dining room full of paintings of severed heads and bloody organs. I'll get back to you to let you know it's somewhere between 99-100.", "Typical dysfunctional Redditor reply:\n\n\"He doesn't want to disturb his friends, even though the paintings are being taken down for one night. Dump him! Kick him out! His mask has slipped, he hates you!\"\n\nGrow up, get real world experience and relationship experience and come back when you're a functional human okay?", "Because he's now living there for four months, contributing to the expenses, and thus should have a say in how he wants to not potentially disgust his friends seeing these macabre images OP painted and strewn throughout their living space? He's not asking her to take them down permanently. He's asking her to put them away for the time his friends are over, having a meal, and not having to deal with uncomfortable guests and/or questions about what they're seeing.", "It stopped being just her apartment when she offered her man to move in. You don't get to share space with your partner and the only make it about yourself. That'd be a terrible relationship", "A few people have also asked if he pays bills. Not currently. He chips in when he can. He works part-time and decided to go back to college to pursue his passion. Something I was well aware of and totally okay with. I make plenty of money to cover all our household expenses and am all about people working towards their goals and what will make them happy in life.", "Bloody organs, severed heads, staring eyes per op.", "Alright. I was on your side because I paint too but this would make me lose my appetite.", "INFO: How did you get certified as a foster home with this kind of artwork on display?  Or has this all happened in the five months since you stopped considering fostering? \n\nYou implied you passed the home visit, which means you could take your pictures down for *that*.  I think you can do it for a night for your boyfriend's sake, too.\n\nYTA.", "Op that sounds cathartic but you should be able to recognise people don't want to be surrounded by that imagery. Would feel like you just stepped into a serial killers house", "I'm all for art and expressing yourself... i'm glad you find it therapeutic.  thing is..... I gotta side with J on this....  disembodied heads,  organs and blood..... it can make many uncomfortable. \n\nIts only for a couple of hours.... I say just put them in the room and have a good time with his friends.", "Then YES YTA for not taking them down when meeting strangers in your home the first time.  That's not a stellar first impression.", "You can’t honestly think that having dinner in an apartment surrounded by paintings like Saturn Devouring His Son by Goya wouldn’t make quite a lot of people uncomfortable. \n\nViscerally disturbing paintings like that have a place and a purpose. But a regular friendly dinner party isn’t it. I’d be pretty uncomfortable seeing multiple paintings like that while trying to relax and get to know someone and eat. Getting to know someone does not mean jumping into your deepest darkest pain right at the beginning", "Ffs, woman, get that shit off the walls where you live. Yes, great you have catharsis, but you don't rub it in everyone's face. YTA", "Yikes. Sorry, but that would be off-putting to a lot of people and potentially upsetting. Your BF is right—it’s his home too—and his request doesn’t seem unreasonable. YTA", "I love the use of negative space in art and would honestly love to see how you have captured that hopeless neverending void feeling, but seeing disembodied heads before I eat might affect my appetite. Could they be arranged in a way so that the gory ones aren't seen before eating?", "Yeah. Definitely something that could be difficult for some people to experience while eating dinner. \n\nEven renowned artists who have dark/macabre work have that work exhibited in smaller spaces separate from their other work. It’s a subject matter that some people just won’t be able to consume.\n\nHere’s the thing, if a friend of mine said they had triptophobia and I painted things that activated that phobia, I’d likely take the painting down rather than ask the friend to leave. The painting can go back up the moment they leave the apartment.", "YTA. I understand they are an expression of your feelings but disembodied heads and organs is way over the top and I think you know that. Doesn’t seem like he wants you to stop painting he just wants you to be cognizant of how others may perceive them. Especially if it’s your first time meeting them", "Yeah ngl if I walked into somebody's house and that was on the wall, I'd probably leave. It's fine to keep painting them if it helps you, but you can't expect others to be accepting of them.", "what the fuck", "Okay, come on. You really can't imagine why having paintings with blood, organs and disembodied heads around during dinner might make people uncomfortable? YTA. Your boyfriend is right.", "I don't even know how your bf lives there, let alone how his friends would react. \nI don't think I would be able to eat with disembodied heads staring at me. I get it it's your art or whatever, but people have different sensitive spots. I would be uncomfortable for sure", "Sounds appetizing", "Why do you want them displayed in your home and constantly reminded of those feelings?", "I’m not trying to shit on you or anything and I get that art is purely subjective but let’s say you walked into someone’s home and let’s say.. i don’t know, they have paintings of fetuses being dismembered or something along those lines. It may be off putting to most people. While there is nothing wrong with what you do and the art you make, try and see it from the perspective of guests walking into a home and seeing such things. They obviously will not understand it the way you do and will most likely be put off from it.", "I’m a huge horror, dark things fan.. and yeah YTA here.\nI would turn tail and leave if I walked into a home with 15 paintings like this just scattered around. Perhaps you need to have a room with your dark art, but not the common area. \n\nI wouldn’t want to have a dinner party with a bunch of dismembered body parts staring at me from the walls. I’ve seen enough murder shows/movies…\n\nYou and your BF seem incompatible. It’s his living space as well and honestly he’s right, your going to make his guests uncomfortable. While it’s your right to hang them, it’s well within his rights to ask you to take them down when people come over. What if one of the friends had trauma or a phobia of blood and dismemberment? \n\nI think you two need to consider that your just not meant to be.", "Dude, as an artist with some not so nice paintings. If this is how you want to display your art. This isn't the man for you. Seriously.  I pulled down the tasteful nudes. I pulled down the weird ones. I pulled down so much. And my walls were bare. \n\nYour house represents you. You know share that house. It should represent him too. But he wants to scrub you outta there. And that's some bullshit. \n\nWhat are you going to do? Take them down everything someone comes over? No. Because this isn't a one time ask.", "😂😂you're killing me. Never take them down!!", "Big deal! Famous artists have painted all sorts of macabre or scary or offensive paintings. But nobody cares when it has a big name on it. His friends sound pedestrian. Everyone has dark emotions sometimes and if they can't accept the light and the dark, screw em", "I don’t know why everyone is downvoting the answer to a question!!\n\nPersonally, I think they sound cool.  Moreover, I think it’s weird af that he told you he liked them up until the point that anyone else would see them.  Time for a serious sit down with the bf.  NTA.", "I think they sound dope 😁 art is subjective obviously but it's a part of you and for that reason alone makes them awesome, I don't understand everyone else's opinion on them tbh 🤷🏼‍♀️", "I think imagination is running wild with these paintings. They are not nearly as bad as people think. Someone referenced Saturn Devouring His Son by Goya as a comparison. They are nowhere near as realistic or gorey as that. Maybe closer to Scott M Fischer or Alexandros Pyromallis, but even those aren't 100% as a comparison.", "JFC- No one is the asshole but cmon that’s just too much!", "YTA. This is absolutely not \"fun casual dinner party\" decor.", "Doesn't matter. NTA.", "The fuck dude.", "1) you need to understand that even though this is your form of creative expression, a lot of people do not appreciate gore and dark art\n\n2) it is both of your house and anyone who is invited as a guest who ISN’T familiar with your style of art should be informed of the content of your pictures around the home and NOT be brought in without a heads up", "Alright. Your boyfriend has been nothing but supportive because he clearly doesn't like your paintings yet he never gave nothing but positive feedback to you. I don't think I'd feel comfortable with 15 of these paintings hanging around the whole house either.", "YTA. \n\nI was leaning toward NTA because I don’t think there’s anything wrong with “dark” imagery but who the hell wants to look at this kind of stuff when they’re having dinner? Not to mention, these kinds of images can be very disturbing and even traumatizing to a lot of people. What if they’ve lost a family member or friend in a violent way?\n\nYou should’ve included this in your post and the fact that you didn’t tells me you know exactly why your boyfriend is pissed. He should’ve been honest about how he felt and it sucks that you found out like this but come on. I don’t think there’s anything wrong with having this as an outlet, I like to draw things with darker themes and enjoy horror elements but I understand that a lot of people can’t handle those things and shouldn’t be forced to look at them.", "OP clearly is vague about what exactly the paintings are, and I can see why after seeing them provide more detail", "It was vague. Get off the high horse smh", "These are new friends though! The paintings can wait for subsequent meet ups.", "Yeah I can’t believe he moved in without bringing this up?!", "Where did she say he was freeloading? I can’t see any info about how much he contributes to the household bills", "Stop projectttinnggggggggg.", "Y T A", "Haha solves that mystery. Off-putting art is not dinner party material", "Imagine what OP would be cooking? Would she cook something dark and disgusting to look at just like her artworks /s. I would be honestly disgusted and wouldn't even want to ear.", "Hmm, no i think you're the one detached from reality. Cool, she has art that expresses her emotions. But i bet you 9/10 guests will not appreciate gory imagery while they try to eat their food. She only has to take them down for one evening, what's the crime about not wanting to disturb friends mentally?", "it’s a shared space, so it’s a compromise- meaning things like decorations are agreed upon, ie, someone let’s the other person do something after they confirm it’s acceptable for the person sharing the space. like OP let’s the bf put up some of his decorations. it would be weird if he just put up a poster of his favorite sports team in their room- he’d ask if it was okay, and OP would “let him” put it up. it’s not like we’re talking “letting someone” play video games or do something unobtrusive. when it’s decorating a shared space, it’s very much okay (and more so should be the norm!) to ask permission for something that must be experienced by more than one party.\n\nEdit to include YTA here, OP.", "Yes, lets her. Sounds like you've never been in a relationship if you think there's no compromise in decoration.", "Actually, she doesn't. There's two people living there, which is why i suggested a compromise. And no one marched in and demanded anything; not sure where you got that. So yes, he lets her put up her amateur dark artwork all over their space, even though it makes him uncomfortable.", "Agreed", "Hence, your BF's point. They may know you paint, but they don't know *what* you paint.", "I am down voting this because it sounds like you are being taken advantage of by paying all the bills while he pursues his passion. But at the same time he is not wanting you to do the same. I have read through some of the comments. The paintings would not be to my liking but he moved in knowing they are there. Now that he moved in and you are paying all the bills he wants to change one of your passions. You need to really think about this.", "So is he your partner, who you care about having a future with, who you respect and love? Or is he someone crashing with you for a short amount of time?\n\nIf they’re your partner and staying long-term/forever then regardless of finances you have invited them to make your home their home and that means things change and you get to each have your needs met. If he’s just crashing that’s a very different situation. If you don’t understand the difference you’re not mature enough to be co-habituating with a partner.", "Ah enchanting- I guess it would be a question of how stylized they are and things like that for me personally. Like if it looked like Saturn Eating His Son yeah that's intense but if it's like GrubHub style it's more tolerable LOL", "Lmao do we even need to ask?", "I would love to post a picture of one of these to give some perspective on what the paintings actually look like, but I have no idea how to do that. They really are not as bad as it seems people think they are.", "They don’t have to like it but it’s her  space to do as she pleases. It’s her art. She isn’t asking them to take one home with them.  NTA.", "I think this would be similar to a musician who writes incredibly dark and personal songs demanding to perform a concert after dinner— awkward for everyone", "He’s been supportive for 4 months of living in her home and all of a sudden, she needs to hide her art. Kick the phony out", "Yes. Best way I can describe it is “trauma dumping” to someone but through painting.\n\nIt’s reasonable of the BF to not want to inadvertently invite his friends to a dark art show.\n\nThere’s nothing wrong with a dark art show in itself. It’s not right to make someone go to one without them knowing.\n\nImma agree with you. ESH.\n\nOP, he was an ass with the way he spoke to you, but he is right when he says it became his house too.", "Also worth noting, the subject matter can trigger an anxiety or panic attack in someone with an anxiety disorder. Everybody is different and one person's outlet can be another person's trigger unfortunately.", "Wait. Where did OP say they're home is a foster home?", "I'm sorry, did you say, \"fostering\"?", "She can take down her emotions because he judges her? What?!", "no no no he is an unsupportive controlling abuser for restricting his poor gfs mental health outlet /s", "Those artists know where their art does and does not belong though - it’s not about name recognition, it’s about being situationally appropriate.", "Maybe just put a huge \"live laugh love\" somewhere to calm everyone's emotions lol", "Wow. I looked up those two artists you mentioned and I think your boyfriend is MASSIVELY overreacting. That's basically heavy metal album cover art. I'm an artist myself and a museologist and there's WAY more gorey and dark art in art museums everywhere than people care to admit here.", "I would put this in the post so people can stop making assumptions just cuz they’ve never seen art that isn’t happy or religious. \nYour art sounds lovely and your bf sounds like he’s just trying to cater to his friends feelings more than yours which isn’t right. Don’t say you like something than ask for it to be taken down while also saying you’d look like a “mental case”. Like I would want a partner to be proud of what I was doing as a hobby and making sure those who weren’t, weren’t in our lives anymore.", "Probably liver with fava beans and a nice Chianti", "I’m a vegetarian but I used to eat meat. If I had seen that artwork while eating, I wouldn’t have been able to eat", "Yep. Living together is about compromise. Currently, she wants it to be all her way with the decor.", "The decorations were there before he moved in. If he had a problem with them he should have said something about it before he moved in, in which case he probably wouldn’t have. If he wanted to put something up that reflects his interests, that’s fine. But he does not get to dictate her preexisting decor. Absolutely not. Telling an artist that they need to hide their art because his friends might think she’s a mental case is mean and a slap in the face to the artist. She doesn’t need a compromise, she needs a better boyfriend.", "My man and I have been together for 13 years. If he spoke to me that way he would no longer be my man. Our place reflects both our interests and neither of us has ever given the other a hard time about it because we accept each other completely.", "Can you explain how a rent paying tenant is \"pro-mooching\" because he wants say in how his apartment is decorated? I'm interested to know how to came to that conclusion. \n\nWhat exactly is he mooching? How is anyone here \"pro-mooching?\" \n\nDo you have a different definition of the word from the dictionary?", "And it was her home first, that he moved into. A compromise would be \"go to a restaurant\" or \"eat outside on the porch.\"", "You can post them to your profile and then link people to that, or use imgur to upload a picture", "You can post them directly to your profile. I’m a hobby artist too (as well as an occasional writer), and my subject matter frequently delves into the dark/introspective/macabre. My take is that your partner should have clarified his discomfort before y’all began living together. My art is sometimes NSFW, and my compromise with my spouse is that those pieces are displayed in the more private places in our home.", "The Good thing about Reddit is that as soon as you say you don't know something, someone will jump in to advise you (for better or for worse). I haven't done it in forever but I think uploading to imgur and adding that link to your post was the preferred way. Word on the street is there's a better way now, but someone else will have to give you that.", "You just create a new post and upload the image, instead of picking a community it'll go to your profile. \n\nI'm sure you know how to do that.", "Says you and her XBF  I hope   \nI think they are not compatible because he’s not honest with her, and I don’t mean now", "I’m Christian and I’d find that much Christian-related artwork to be a bit much. Especially if it was as… intense as the OP describes their own artwork to be. \n\nObviously OP can paint what they want, but you can have too much of a thing, y’know?", "Yes", "There's a difference between seeing religious iconography and having to see paintings of blood and organs and disembodied heads I'd argue.", "I might be ok with moving in with someone and not asking them to take their nudes down. \n\nBut I’d probably ask to take them down for the evening if I were inviting a bunch of old ladies from my mom’s church over for dinner. \n\nTemporarily removing art work that you know is likely to make your guests uncomfortable is just not an unreasonable request.", "But it seems like the boyfriend doesn’t like them either and has just dealt with it. If she is just now realizing that they also make him uncomfortable, then that should be discussed too. It’s his house too.", "The paintings aren’t just of a random subject that could possibly make someone uncomfortable, they are emotionally disturbing on purpose. That’s why OP makes them, to process their own emotional distress.", "Interesting that you think the only way to be supportive is for him to not voice discomfort when he feels it. I would say that OP has a painfully immature idea of how to be in a relationship and cohabitate. How self-centered do you have to be to assume acquaintances would/should be ok with gore on the walls or to be so incredibly dismissive to the concerns of someone who, for the last 4 months has let you have your way with no argument?", "Have you ever known an artist? It's all about pushing the envelope \n\n[Artists don't care if they weird you out ](https://www.ranker.com/list/quirks-of-famous-artists/machk)", "I eat meat but I won’t eat anything while bloody severed eyes stare into my soul.", "Imagine eating beef liver with tomato sauce on it to resemble that of a bloody liver.", "Disagree. He didn't challenge her decor when he moved in because he just moved in. As he spends more time there, he has become uncomfortable with her dark art in all rooms in the house. The compromise is that she moves it to a few rooms or, as he asks generously, keep it up all except for a few special occasions. \n\nYour premise doesn't make sense to me. So the only person who gets to dictate decor is the first person to sign a lease? Can you explain why you think that other tenants don't deserve equal say?", "Your man isn't allowed to express preferences for decoration in the house he lives in? Oh, in my relationship we compromise, but I guess if that works for you go for it. We've been together 13 years too and I'd never dream of demanding my hobby cover our walls and refuse to compromise.", "OP wrote a comment stating that he is not paying bills or rent.", "Correct. And now he lives there and so you compromise. She doesn't get to just have her own way with your hobby anymore, You don't get to tell your roommate that they get no say in how their apartment is decorated.", ">And it was her home first, that he moved into.\n\nSo now it's both of their homes equally.", "Healthy relationships make compromises even in shared living spaces, not just dinner. It stopped being just her place when she offered him to move in. She doesn't get the cake of having her partner there and ONLY how she wants it decorated, it's just reality. \nEdit: This isn't an opinion like \"steak is the best meat \" it's the truth, people shouldn't live in one sided living spaces and anyone who thinks that has serious problems. You know who you are 🙄", "Well this is an OPINION post…and I gave MINE you are entitled to yours…\n\nOP is weird and while that may be chalked up to “incompatibility”; it is weird AF to have beheadings and organs all over the apt…but again that’s MY OPINION and what OP came here for. But thanks for reminding me as I didn’t vote\n\n\nYTA", "He ***is*** honest with her. That's how this whole conversation started. And asking her to take down her unsettling and gory paintings isn't ***controlling her*** ffs", "please tell me you’re not in a relationship, you seem unhinged", "You can and if OPs partner felt that way it could have been brought up prior to moving in but he didn’t she even says he encouraged it prior to demanding she take them all down so that his friends can come over. My issue isn’t the content but the fact that this was not an issue for him until he felt like he would be embarrassed to have his friends around", "In your own home  ?", "Bite your tongue, you can never have too many disembodied head paintings.", "So it doesn’t actually matter what the content is as long as someone might be uncomfortable?", "I disagree, as an atheist I find religious shit weird but I wouldn't ask someone I cared about to remove it to appease my friends 🤷🏼‍♀️", ">religious iconography \n\n>blood\n\n🤨 these are identical in the Christian faith.", "right, it's not like typical religious iconography depicts an emaciated, tortured man in his final bloody moments or anything", "Actually many kinds of religious iconography have blood, organs and disembodied heads.  Depicting a saint’s death is common, expected even, and many were stabbed, dismembered or beheaded.", "There's literally zero difference.", "Yeah I think that is a really solid analogy actually? I would be okay with way more nsfw art in my personal space than I would be okay with showing off to friends/family, that just seems commonsense, and this seems no different (in terms of likelihood to make viscerally uncomfortable, for example- eye and body horror are both very common fears or even triggers for things like intrusive thoughts, and nudity can be as well; I would personally avoid showing someone either without consent).", "It really depends. Let's say an old woman loves clown paintings. And someone thinks they may scare some kids coming for a birthday party. Is it reasonable to ask her to remove all the clown paintings becsuse someone thinks they may make someone uncomfortable?", "But in a healthy and respectful relationship that conversation would be approached prior to cohabitation and absolutely not as a surprise demand to host people after months of supporting the creating and display of them.", "A compromise would likely involve not removing everything that makes the person moving in uncomfortable, or doesn't like. Plus in this situation it's even weirder because the person moving in is asking things to be removed not because he is uncomfortable, but his friends.", "If it bothered BF enough that he is willing to fight with OP about her art. Then he should NOT have moved into her place.  It’s not like they moved to new place together or she moved into his and started hanging her stuff. \nHe is a phony and is more concerned about what his friends will think than how his GF feels", "I would be horrified", "It’s less about tenancy and more about him rejecting a big part of her personality. She paints because it helps with her mental health and makes her happy, therefore he is rejecting her when he should be supporting her. It’s quite insulting for him to bring this up a whole year into the relationship. If he doesn’t accept her as she is then he should never have moved in.", "Read it again. That is not at all what I said.", "OP should put that into the original post then, it's absolutely crucial information.", "No he's a man, he doesn't get a say /s", "There's no reason to call OP weird. Plenty of people enjoy macabre aesthetics, \"creepy cute\" was even a massive fashion trend like a decade ago in Japan. Plus... Like the entire goth subculture. Yeah, she should remove it if she has reason to believe her guests will be uncomfortable; a good host considers the feelings of their guests. However, I imagine he might want to have his friends over with some regularity, and putting the paintings away once a month does feel like she'd be hiding a big part of herself. Maybe it's the kind of thing she introduces them to after she gets to know them, I'm sure her paintings will come up on conversation, and she can display them after that point. Calling her weird is just rude though. She's different from you but there are plenty of people who enjoy this stuff.", "Unhinged  ? Because I don’t want to control my partner", "i think the bf knows his friends and knows that they might find this odd initially, and want them to like OP. “this is a representation of my deepest mental anguish” isn’t always the best conversation starter for a ‘getting to know you’ type of engagement\n\ni say this as an artist who also paints “weird” stuff. bf can simultaneously think they’re cool and recognize that it’s not for everyone, and might not fit the aesthetic he wants his home to present for guests. which is fine, and doesn’t mean your paintings are bad. YTA here", "You’re not wrong, but I can imagine it; for example my partner might make allowances for my little foibles but may prefer me to dial them down a bit for ‘company’. This might be similar, he can deal with the paintings (though I wonder…) but knows they’re too much for his friends.", "Actually I take that back. Leave the religious stuff up. I want to see it all over the wall when I walk in so I will know to immediately turn around and leave", "There are literally relics with bones and body parts hanging about all over the place.", "Yes, that’s called being a good host and friend.", "Yes", "I mean, you could be fine with having them as the decor when it's just you... but you want it to change when it's time to bring people over. You don't want to deal with questions or make them uncomfortable. \n\nSo now is a good time to have that discussion. It can be a deal breaker. No one is going into a relationship having all the hard discussions right away. Because no one knows what those discussions are. The point is to try and have those discussions maturity and feom a place of understanding regularly, and whenever a situation pops up.", "There's a point in life where if you don't know your house being covered in gorey paintings of dismembered heads and organs, and general death and negativity... isn't suitable for a dinner party and will make almost everyone uncomfortable and wonder what's going on with you psychologically, that it's really on you to develop yourself and your understanding of the majority of the worlds population. To find a partner that encouraged you and is happy to move in without them being taken down to begin with, is likely a very difficult thing.\n\nAs a woman, when I was in my early 20s, I dated a guy and went to his house for the first time. He had stuff like this all over the walls. I was legitimately concerned for my own safety. I left and never spoke to him again. Any normal woman saying she went back to a guys house and it was covered in paintings he'd done of dismembered heads and bodies and organs... would be immediately advised on here to get the fuck out of his house. Why.. like.. why is that different for a girl who's partner chose to put up with what he found disturbing and moved in with her anyway? And why would it be a huge red flag if a female showed up alone, at a new dates house with all of that on the walls, but it's not just straight up common sense it's going to be a huge red flag for a group of people meeting their friend's gf for the first time and getting to know her.\n\nThere's levels of common sense here you are just totally choosing to ignore. There's levels when it comes to what you compromise on or understand when someone moves in with you. Removing your paintings of dead people and heads for one night whilst people have dinner and putting them back up after, really shouldn't be a huge unexpected thing that needed to be shared and talked about before agreeing to move in together. There's something a bit missing within someone or some issue with relating to other people or empathising if you don't understand what that will make the majority of people feel like.", "Agree. I think ESH and they’re both being pretty immature.", "That’s not weird at all. He wants a space to be welcoming to his friends. He likely is not a huge fan of the art in so far as he wouldn’t have purchased the pictures, but likely understands the significance to his partner and figured he could live with it. It’s pretty generous to ask to just take them down for company imo. Or possibly he didn’t feel he could say anything because he thought (correctly as it turns out) that OP would just dismiss his concerns and forget that being in a relationship means that she’s not just the main character in the situation.", "That’s so immature. I sometimes forget that lots of kids are on summer break but then I read comments like this and remember.", "but it’s not about accepting her. it’s about displaying some off-putting imagery in a space that is shared equally. your identity is exactly that- YOURS. it doesn’t mean it needs to be shoved down everyone else’s throat. like u/agreeable_you_3295 said, maybe it wasn’t something he could broach until now? maybe he needed something to prompt the conversation (which i admit means they have communication problems, but that’s besides the point)", "Oh nice, glad to see you agree with me! Obviously it was a edit, but hopefully OP reads your response and learns how to compromise.", "How many pictures of severed heads are hanging above your kitchen table? If your man decides tomorrow he's just really in to blood and guts and severed heads, you'd be cool with him just putting them up? After all, in your relationship you don't need permission to decorate your own home, right?\n\nAnd you wouldn't consider asking him to take them down when your grandma visited, because it's his home. So what if grandma is miserable and disgusted and never comes back, right?", "Unhinged because spidey was made to feel uncomfortable and heaven forbid /s", "Except it’s not just HIS home. He moved into HER home and has spent months encouraging her aesthetic and art work. This should have been brought up before he ever moved into the home and absolutely not as a demand that she remove and hide ALL her work. ESH", "Dialing it down and asking her to remove and hide ALL of her work is not the same thing. I could even concede that he could ask for some or most or just the most graphic ones but he seems all or nothing. ESH but I don’t expect much else after moving in so quick together", "Yes that is the answer! I think that should be the answer for the paintings too. Bf gives friends a heads up about OP and their artwork. The friends decide if they are comfortable or not without anyone trying to impose their will over anyone else.", "But the “hard conversations” have literally been hanging on the walls since before he moved in", "You’re telling me that you would move into a house without ever thinking about having friends over to that house with the way it is decorated by the current owner whom you are about move in with as a romantic partnership? \n\nDo people actually move into someone else decorated space and really never imagine having people over until it actually happens?", "IF HE HAD A PROBLEM WITH IT WHY HASN’T HE BROUGHT IT UP BEFORE. You’re missing the entire point I’m making is that this should have been a conversation and boundary discussed prior to him moving in. If he was concerned with what his friends would think that should have been a discussion before he agreed to live with her in her already decorated space that he has not only not brought up as a problem before now but has actively encouraged only to turn around and insult the exact work he’s been encouraging and bashing her mental health by saying he doesn’t want his friends to think she’s a sick twisted basket case. My entire point is that while they both absolutely suck it he should have brought this up prior to turning it into this very demeaning argument.", "Gold! 🏅", "Absolutely! But I’m not super surprised considering they moved in together after 6 months", "Read my other comments, I already explained this. And yes, by rejecting her art he is rejecting her. He moved in to her space and doesn’t even pay rent. When you date someone you accept them as they are or they aren’t the right person for you. He can take his friends to a restaurant if it bothers him. OP is right. Lose the boyfriend and find one that is proud of her and her work.", "I have an actual severed head at my house, made from goat skin and leather. I also have a baby bunny preserved in a jar (one of many spooky gifts from my boyfriend), several pieces of dark art, framed horror posters and a collection of skulls. My grandmother has been to my house. So have my parents, my boyfriend’s parents, neighbors and friends. Oh, and we live in the South.\n\nNot one of them has ever objected to our chosen decor. Not. One. Person. \n\nBecause it’s our space and they respect that. Because they love us and know these things make us happy.  If they didn’t, they wouldn’t come over.", "he’s asking her to move them for the evening, not take them down altogether forever? that seems like a more than reasonable request imo", "I got to say that's not on my checklist of things to think about before I move in somewhere.", "You seem desperate to try and play the \"controlling unsupportive bf\" card. He isn't. He wants a day without literal gore paintings on the walls of his shared space.", "Got it. So same thing if he decides he likes pictures of animals having sex? Dead kids? Human Anuses? Poop? \n\nI'm glad that works for you and your husband, but the point is it IS NOT working for op's boyfriend. You said you and your man compromise over decor, which is the exact opposite of what you first said to me. \n\nThis is a weird conversation. You say you don't agree with me, but you're agreeing with me. If your boyfriend decided he was grossed out by your baby bunny in a jar, you'd just keep it up because \"nobody talks to me that way\"? \n\nI honestly can't tell if you agree with me or not based on what you're writing. Maybe it's because you did that big ninja edit in our first conversation once you saw the downvotes flowing free.", "Tbh I’d be grossed out seeing that but wouldnt say anything to the people who own the severed head because I’d be scared of them.", "For real. There was a similar post not long ago but from the boyfriend’s POV (not saying OP stole the idea or anything) where the response was the exact opposite of this one. The girlfriend had an expensive collection of oddities and the boyfriend wanted to hide them for a dinner party. He got torn apart in the comments and declared the a-hole. Seems there’s a different group of Redditors here today. \n\nEverybody loves the weird girl until she does something weird. \n\nAs a weirdo myself, anyone who comes over knows they’re going to see weird stuff. Dolls, ouija boards, horror movie merch, a bunch of Bowie memorabilia. You can deal with it or GTFO. \n\nThe boyfriend shouldn’t have continued dating OP if he had an issue with it and he definitely shouldn’t have moved in. *Oh, btw, I really hate everything you’ve created and you need to hide it all or me and my judgmental friends won’t like you anymore, lol.* \n\nYeah, no. NTA.", "And you don’t think that will set a precedent for all future guest appearances? Do you think he will be ok with them all going back up and he won’t ask her to remove them again the next time he’s going to have company?", "Really? \n\nHave you moved into someone else’s space that had decor that makes you uncomfortable and waited months to bring it up while actively encouraging that person to continue to create the exact pieces you have a problem with to then turn around and call them a sick and twisted mental case?", "Ikr imagine a world where it’s wrong to put away paintings of severed heads for guests who are coming over for the first time.", "I’m pretty sure none of the people in our lives are scared of either of us. If a stranger were to come over and was scared, that’s their problem. I’d also think they’re probably boring and not someone I’d be friends with anyway.", "I remember that post and that guy was definitely the asshole. I completely agree with you, and any guy who objected to my interest in horror and dark art would be an instant dealbreaker."]}