{"id": 21802, "submission_id": "14vc9yk", "title": "AITA for trying to invite my daughter to someone’s party and possibly ruining it?", "selftext": "\nMy daughter, 9, goes to a small school with 11 girls in her grade.  Her class is very tight knit and we all get along well.  About a year ago the girls started a book club and meet up at different homes 2 times per month. My daughter was in it last summer but we had to stop when the school year began.  She’s a competitive dancer which requires a lot of time.\n\n   Fast forward to 3 weeks ago.  We had a girl in her class over named Sarah.  Sarah asked my daughter if she was excited to attend Addy’s, another girl in the class, birthday party.  She said it was a swimming party and they’d be playing a movie on an outdoor screen.  My daughter hadn’t received an invite.  When Sarah’s mom came Sarah told her how we hadn’t received an invite for Addy’s birthday.\n\n  Sarah’s mom said Addy had handed them out at the last book club and had probably just forgot to reach out.  She suggested I text Addy’s mom.  I was hesitant at first because I do have strong feelings about inviting yourself to things.  I couldn’t see a real reason why she wasn’t invited since it was an at home party and every other girl was. \n\nI texted Addy’s mom and reminded her my daughter hadn’t been at the last book club and if she was also supposed to receive an invite.  She responded that they had hired someone to do a spa for the girls during the party and the service had a limit of 10 so they decided to only do the girls in book club.  She didn’t expect us to find out.  I responded that I understood but felt it was wrong to not include just one.  I told my daughter we can’t expect to be invited every time and this was just a life lesson.\n\nSarah’s mom reached out to ask if I had sorted it out. I sent her a screenshot from the convo.  She didn’t respond for a few days but when she did she told me she had decided Sarah wouldn’t attend.  She felt it was wrong to not include just one child and she could see if our kids didn’t get along or had drama but that wasn’t the case.  They hired someone knowing just one girl would be left out and she didn’t agree with it. \n\nI get a text from Addy’s mom a week later that a total of 4 girls were not attending.  She felt I had ruined her daughters party and was creating drama.  I explained that I had no intentions of ruining her party and had only spoken to one other mom about it. \n\nI talked to my own mom about it who agreed I should not have texted Addy’s mom and if they had wanted us we would have been invited.\n\nThe only mom I talked to about it was Sarah’s which I assume is who told others. I never meant to cause others to not attend or ruin a child’s party.  When I reached out I really felt like it must have been a mistake since she was the only one.  Now I’m unsure if I was just a jerk who now cause unnecessary drama in a small group and possibly ruined a child’s party.\n\nWas I the AH?\n\nEdit: my daughter does still attend book club once per month to once every other month. She didn’t totally leave. She’s just not a full time member.", "created_utc": 1688942679, "permalink": "/r/AmItheAsshole/comments/14vc9yk/aita_for_trying_to_invite_my_daughter_to_someones/", "score": 3884, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I may be the asshole because I texted a mom to have my child invited to her child’s party.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. Not unreasonable to think in a group that small everyone would have received an invitation. But some food for thought…\n\nNot invited? Don’t go. \n\nNot told? Don’t ask. \n\nLate invite? Decline, you were never a part of the plan", "NTA. Addy's mom knows there are 11 girls in the class and decided to go for the activity limited by not including one girl in. That's where the drama is caused. Of course you daughter would have found out - or if not, this would have caused the other girls to isolate her in general by keeping secrets from her. You trying to find out why she hasn't received an invitation is a normal thing. Sara's mom following up on your conversation shows she is concerned that your daughter seems to be left out. Her deciding to rally other moms or explain to other moms why her daughter will skip the party is not your decision, it's hers.\n\nAnother person said you made a bad choice by sending a screenshot of the conversation, because it was a private conversation - I don't agree with that. You were one of the parties of that conversation. You might have as well \"retold\" what Addy's mom said to Sara's mom, for everyone with phone nowadays it is clear that screenshot is much easier way to transfer that information.", "NTA - you don't exclude one kid from a party, it's unnecessarily cruel. Have only 6 sure, 10 of 11 no, and they shouldn't be surprised it's had consequences.", "NTA\n \nits completely normal to want your kids not to be left alone or rejected\n\nAnd you didnt porpusefully send the screenshot just to make a drama..it was just responding to a question someone asked you thats it (but sending the screenshot of a private conversation to someone else is a mistake so watch out next time)\n\nAnd also you didnt make those 4 girls parents to decide to not make their daughters attend \nSo you did nothing wrong\n\nAnd you also taught your daughter than she will not be invited sometimes and that's something that happens and its fine and that is great parenting", "NTA. You didn't intentionally set out to make the other moms back out, you simply shared why it limited to 10 children with ONE other mom. If she felt the hosts choices didn't align with her she has every right to keep her child home. I would have done the same. I wouldn't want my child to be apart of something that was excluding someone else. Not a lesson I want to teach my child. I also find it hard to believe that they couldn't  ask if it would be possible to pay an extra fee to include one other child. If it was 15 kids instead of 10 I could see it being a hard and fast no but 11 instead of 10 shouldn't rock the boat much imo. \n\nIdk why everyone is hating on you sharing a screenshot, typing out \"she hired a service that could only accommodate 10 kids\" is the exact same as sending what she herself said as long as the shot didn't include any other information.", "NTA. \n\nI was ready with my finger on the 'Y', but everything you did was perfectly reasonable.  You asked a reasonable question when you found out your daughter was excluded.  You didn't argue; you accepted the answer even though it was plainly wrong.  Obviously others saw that this is a hair's breadth away from bullying - and it wasn't even the kid doing it!", "NTA. You literally did nothing wrong. Your daughter heard about the party from Sarah. She told Sarah she was not invited. Sarah told her mum. Sarah’s mum suggested you text Addy’s mum. I think asking was reasonable because it was extremely possible that Addy just hadn’t recalled to give the invite not in book club. \n\nWhen Sarah’s mum asked for an update what were you supposed to say? Any lie I can think of just makes it sound worse. You just told her what you were informed - you even sent the exact screenshot of a text. You didn’t paraphrase or make it sound worse. You literally provided it verbatim. If other people want to drop out that is their prerogative. You didn’t even tell them what was happening!\n\nEdit: okay wait after reading these other responses saying sending the screenshot makes you an AH - I am so confused. In my mind paraphrasing Addy’s mum’s text would be worse. Sending the screenshot just ensures no bias. Sarah’s mum is getting the exact reason.", "Nta, they got to know your daughter would find out as little girls talk which is unfair given they were knowingly excluding you \nIf others decided not to go that's their decision", "NTA.  You didn't stir the pot on this one.  And for reference, excluding one girl out of the whole class is a dick move.", "NTA\n\nAddy’s mom is a garbage person for excluding one girl from the class.  I see no problem with your exposing her behavior.  \n\nSarah, and the other girls who didn’t go to the party (as well as their parents) are stand up people.", "NTA. You didn't act as a helicopter parent, you didn't whine or complain to other parents or promote it from your daughter. Hell, you tried to turn this into a life lesson for your daughter. You acted a lot more calmly and rationally than 90% of people on this sub would have. \n\nSome people might not be pleased about you sending a screenshot of the text, and to some extent I get the thought behind that. But this wasn't some deeply personal communication or even gossip. Unless something isn't being said here, it sounds like all you did was send the screenshot instead of quoting verbatim what was said. It wasn't sent unprompted, and the same result would have happened if you'd typed out an explanation. \n\nIs it slightly an AH move to not invite one person? Maybe, but if that one person isn't as involved in the group and it wasn't done on purpose, just necessity due to circumstance, that kind of thing just happens sometimes in life. Just do your best not to get caught in the drama that will likely unfold from here and make sure you're listening to and looking out for your daughter, as the friend group and its dynamic is ultimately going to affect her more than it affects you!", "NTA when only one kid is left out I’d be pretty interested in knowing why myself: was it an accident? We’re there any disputes between the kids i as a parent didn’t know about? Had I or my so done something to piss the other parents of and that was why? \n\nYou’d need to know to fix any problems. And if the other person sees no problem excluding you kid they should also have no problem telling you so or why. \n\nAnd the other parents pulled out because they could see that it was a d move on the birthday throwers part. Plus if they could do it once who’s to say it wouldn’t be their kid randomly excluded next time the nr didn’t agree? \n\nAs for the screenshots, honestly it was the best way of making sure there was no misunderstanding and no ‘he said she said’ later on.", "NTA", "ESH.  Not inviting one girl in a class and expecting no one to find out is really, really dumb.  They reason I didn’t go NTA is twofold.  1 - they are 9, and at that age friendships become more complex.  Your daughter will need to learn that she will not always be included, and conversely, that it’s ok to not include everyone in things she does.  With better communication this shouldn’t be an issue.  2 - sending someone the screenshot of the conversation with the birthday girls mom is a AH move that is also pretty much guaranteed to start drama.", "NTA they excluded 1 girl from the class. That’s messed up. You also didn’t tell anyone to not go, you simply told the truth when asked. Addy’s mom screwed up big time. Adding one more kid can’t possibly have been that difficult.", "Nta *but* Sarah's mom is a shitstirrer.", "While it is unfortunate that they couldn't host everyone, it happens. Many birthday activities have a limit of 10 people so the birthday child picks their 9 closest friends and sometimes people can't be invited. It's tacky to ask why your child wasn't invited, hell maybe the other girl's mom simply doesn't like your child, that's perfectly fair, they're allowed to invite whomever they want to their events.\n\nOn the one hand, you only spoke with one other mom so it's not your fault others declined due to one child being left out. On the other handem, you should ahve simply explained to your child that sometimes there isn't room to invite everyone. \n\nMy 8 year old has a large group of friends, naturally she's closer to some of the group than others. Sometimes she's invited to the parties and sometimes she isn't since the limit meant not being able to include everyone. It's the same for her parties, some years the venue has no limit or the limit is high enough to include everyone, other times it's not.", "> we all get along well\n\n> we had to stop when the school year began\n\n\nWhy are you keep saying we? Are you also in her class? \n\n\nNTA. They have the right not to invite you, and you have the right to tell other information. Others have the right not to attend.", "You texted a screenshot of a private conversation to someone else. Was it really necessary to do that? \n\nYour daughter isn't in the book club because of another activity. That's fine, but you really can't expect her to be involved in things that are occurring with a group that meets regularly and your daughter isn't involved in.  \n\nYTA", "> She felt it was wrong to not include just one child and she could see if our kids didn’t get along or had drama but that wasn’t the case.\n> Now I’m unsure if I was just a jerk who now cause unnecessary drama in a small group \n\nI don’t think you had any bad intentions, but you also sent a screen shot. And I think that sort of tips it to YTA. \n\nMaybe the girls didn’t have drama before, but now they do. Congrats.", ">She responded that they had hired someone to do a spa for the girls during the party and the service had a limit of 10 so they decided to only do the girls in book club. She didn’t expect us to find out.  I responded that I understood but felt it was wrong to not include just one.\n\nYTA & so is Sarah's mom for so many reason in my opinion. Mainly neither you nor Sarah's mom were planning or paying for this event. The mom explained she booked an activity for her daughter's party that had a limit on the number people who could attend. So your response of how it was wrong was completely out of line. Is this woman not supposed to plan activities for her daughter if your's cannot attend? You have no idea what her budget was either. Maybe she could only afford the spa package for 10 people. It was not your place to comment on who is invited to HER daughter's party. Then you shared  private text message wtih Sarah's mom that caused drama. What you did was unnecessary and in bad taste.", "YTA\n\nIf you have your daughter only occasionally showing up for a group activity that meets regularly, you can't expect anyone to take her seriously as a member of the group.  This group meets twice a month, she's showing up maybe 1/4 to 1/2 the time.  \n\nThat's pretty obnoxious.  She's not showing up enough to be involved with the ongoing discussion of books, and trying to catch her up on the discussion is going to disrupt it for everyone.\n\nYou, and your daughter, are treating this book club and friends group as a distant second place to her competitive dance.  That's your choice.  But you can't treat this group and her friends as second-place to competitive dance and still expect them to consider her a full member of their group. \n\nIs competitive dance something your daughter enjoys enough to be putting it ahead of time with her school friends and participating in their social activities?  \n\nIf the dance is leaving her socially isolated and making her an outsider in her own school, she could easily come to resent it rather than enjoy it.  \n\nYou need to have ongoing conversation with your daughter about how the competitive dance affects her larger life, and if it is worth the trade-offs ***to her***.  She's a kid, no competitive activity is more important than letting her be a kid, with friends and school.  Find a balance that lets her enjoy her school social life as well as the dance.", "ESH except Addy's mom and the kids. So I guess just you and Sarah's mom. You made a choice to remove your kid from the book club. Every choice has consequences. Because she's less involved in the groups lives she's understandably being included less.\n\nYou ruined a child's birthday because of this. You shouldn't have told Sarah's mom you were upset and you should have graciously told Sarah's mom that it was a limited invent and hopefully all the girls can get together another time.", "ESH.\n\nPurposefully excluding a nine year child who is still part of the book club is not acceptable adult behavior (as we’ve no indication this was a birthday girl preference but rather an adult decision.) We are part of small school community and that ish isn’t ok.\n\nBut OP - screenshoting a private convo in a passive-aggressive way? Not ok. Just answer the question yourself.  “Yeah we talked. Turns out the party entertainment had to be capped at 10 so [Jane] didn’t get an invite. Thanks for asking.” You sending it direct was designed to get a reaction of some kind at the expense of *another nine year old girl*.", "YTA", "I’m confused with all of these YTA comments? It’s completely unfair to call OP TAH when OP mentioned how she only shared the screenshot to sarah’s mom only. Never did she gossiped about it to multiple people so I think it’s unfair you guys are putting all the blame on OP when Sarah’s mom should’ve been in the fault here as she didn’t keep it a secret and knew why Addy’s mom didn’t invited OP’s daughter. Not only that but it’s completely fair that OP wanted to know why their daughter didn’t get an invited as those girls are also in her class not just in the book club and OP’s daughter still attends the book club but does it once a month so it wouldn’t make sense to call OP selfish for expecting an invite for their daughter, so imo OP is NTA but Sarah’s mom is.", "ESH\n\nYou shouldn't have texted the screenshot in the first place, you created the drama.\n\nOn the other hand it really is kind of mean to ostracize one girl. One girl could have just sat out of the spa but still attended the party.", "YTA but also not. It is rude to exclude one but also expensive. If they excluded one more they would still be excluding one right, bc then it would be one at book club left out? So she’d have to cut the number by 3 “to be fair.” You didn’t say that you mentioned to pay for your daughter and are complacent in allowing the birthday girl to be punished by people not attending. Meaning, you should be saying “don’t not go because of me.” Passing out invitations is awkward and stressful as a kid. As a personal aside- one time a girl passed out birthday party invitations at school and my best friend asked me if I had gotten mine because she had literally seen it. Never got it. Never heard about the party after. Wondered about it because no, I don’t think my friend was insensitive or lying (it was likely bc of class change and us not being friends but just classmates so it wasnt important to redistribute who she missed) but it wasn’t the end of the world. I have never held beef nor asked but I still wonder sometimes and laugh, like right now. Explaining that it’s just bc your daughter doesn’t do book club anymore is a simple explanation that your daughter can likely live with.", "You should have stuck to your strong feelings about inviting yourself to things. It’s not fair.", "YTA \n\nIt was a party for the book club that your daughter dropped out of. Don't overschedule your daughter so much and she may actually have closer friends.", "YTA\n\nYou've got your kid involved in so many activities that she can't put her down friendship roots. You can't manage her way back into a birthday party.", "i think you acted completely above board. i can see why it must have seemed like an oversight just because she missed the book club, not like anything else.  i applaud other parents from holding back their daughters from what was a rude way of dismissing your daughter.  yes, on occasion you won’t be invited to parties and that is a life lesson, but this appeared to be a simple oversight so inquiring about it made complete sense. as for ruining the party, i think the mom did that by treating your daughter as disposable", "NTA I organized a dozen b day parties for my daughter and it’s in extremely poor taste to exclude just one person. Addy’s mom is TAH for excluding one and then telling you she purposely did it because she didn’t think you or your daughter would know? Is she stupid? Kids talk. Social media is a thing. I would be so mad and do what Sarah’s mom did. I’d pull my kid out. \n\nYou were perfectly okay to ask if the invitation was missed. Kids lose things or assume the parents know. Better to ask than to show up. Kids look to parents to learn right from wrong and Addy’s mom is displaying some disappointing behavior.", "NTA. When you got in touch with Addy's mother, you actually thought it was an oversight. If everyone else experiences her as exclusionary and don't want to be part of that, well then, maybe that is because she might be? 🤷🏿‍♀️", "NTA. Yeah you can't invite yourself to stuff but only your daughter didn't get an invite? That's suspect. And you only told one friend and everyone else acted on their own, it's not like you boycott the party.", "NTA I would have done the same in terms of assuming it was an oversight and reaching out, it’s happened to my kid and the issue got rectified. I don’t think you could have anticipated how it would spiral.", "Unpopular opinion,  but YTA. You didn't get invited.  Not cool but it happens.  It's rude and presumptive to  basically invite yourself  .", "YTA", "Soft YTA for sharing the screenshot.  I think you were fine to reach out.  If there are 11 girls in the class and 10 were given invitations the day your daughter missed book club it was reasonable to see if she was invited.  Sharing the convo shows spite.  You could have just said she wasn't invited, and left it at that.  Your actions did start a snowball effect that hurts a child.  You had to know that moms talk.", "Mild YTA you say you have strong feeling about not inviting yourself to things and then you text Addy's mom. I understand you did it for your daughter. The asshole part comes in with sending Sarah's mom the screenshot. And then you are still playing innocent when you hear 4 other girls aren't coming. How could this have happened?  Lets blame Sarah's mom.\n\nUnfortunately this tight knit group probably isn't anymore. Yes, you did cause unnecessary drama. But no, you didn't ruin the party, except for Addy and the other 3.", "ESH. Inviting everybody but one is bad, but you also texted a screenshot to Sarah’s mom, which made it worse. I was leaning towards you being the AH, because you signed up your daughter for many other activities, and you can’t do everything,  but not invited just one kid is bad, so I won’t go there", "Addy’s mom is TA, and you are 💯NTA. I would bet money that the spa service would add on another child for an extra fee, and she was just being cheap. It’s never ok to exclude one child like that, especially because she’s still part of the book club.", "YTA\n\nNot for texting Addys mom. Thats fine. But for sending screenshots of a private conversation.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n\nMy daughter, 9, goes to a small school with 11 girls in her grade.  Her class is very tight knit and we all get along well.  About a year ago the girls started a book club and meet up at different homes 2 times per month. My daughter was in it last summer but we had to stop when the school year began.  She’s a competitive dancer which requires a lot of time.\n\n   Fast forward to 3 weeks ago.  We had a girl in her class over named Sarah.  Sarah asked my daughter if she was excited to attend Addy’s, another girl in the class, birthday party.  She said it was a swimming party and they’d be playing a movie on an outdoor screen.  My daughter hadn’t received an invite.  When Sarah’s mom came Sarah told her how we hadn’t received an invite for Addy’s birthday.\n\n  Sarah’s mom said Addy had handed them out at the last book club and had probably just forgot to reach out.  She suggested I text Addy’s mom.  I was hesitant at first because I do have strong feelings about inviting yourself to things.  I couldn’t see a real reason why she wasn’t invited since it was an at home party and every other girl was. \n\nI texted Addy’s mom and reminded her my daughter hadn’t been at the last book club and if she was also supposed to receive an invite.  She responded that they had hired someone to do a spa for the girls during the party and the service had a limit of 10 so they decided to only do the girls in book club.  She didn’t expect us to find out.  I responded that I understood but felt it was wrong to not include just one.  I told my daughter we can’t expect to be invited every time and this was just a life lesson.\n\nSarah’s mom reached out to ask if I had sorted it out. I sent her a screenshot from the convo.  She didn’t respond for a few days but when she did she told me she had decided Sarah wouldn’t attend.  She felt it was wrong to not include just one child and she could see if our kids didn’t get along or had drama but that wasn’t the case.  They hired someone knowing just one girl would be left out and she didn’t agree with it. \n\nI get a text from Addy’s mom a week later that a total of 4 girls were not attending.  She felt I had ruined her daughters party and was creating drama.  I explained that I had no intentions of ruining her party and had only spoken to one other mom about it. \n\nI talked to my own mom about it who agreed I should not have texted Addy’s mom and if they had wanted us we would have been invited.\n\nThe only mom I talked to about it was Sarah’s which I assume is who told others. I never meant to cause others to not attend or ruin a child’s party.  When I reached out I really felt like it must have been a mistake since she was the only one.  Now I’m unsure if I was just a jerk who now cause unnecessary drama in a small group and possibly ruined a child’s party.\n\nWas I the AH?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA.  You say you have hard feelings about not inviting yourself to things, but then you text the mom to do exactly that and then double down when you tell her it's not fair for one person not to be invited.\n\nYour mom was right, if they wanted to invite your daughter they'd have made it happen.", "NTA - ESH only because you screenshotted and shared the conversation. We all know why we do things like that.\n\nBut, Addy’s mom knew what she was doing here too. You don’t start that music if you don’t want to dance.", "I hope this does not now create awkwardness and tension amongst the girls.", "NTA\n\nIt was reasonable to ask, but you should have dropped it when she said No.\n\nSince the other mom had already been told all this I would have just told her no, you were not invited. No screenshots.\n\nAnd the lesson for your kid is to remember how this feels and not to do it to others", "NTA. \n\nIf there was a limit of 10 girls, and yours drew the short stick, in such a tight group I would have expected the mom to reach out to you and tell you. And also offer to let you know if one of the other girls couldn’t make it and freed up a spot. And it should have been a random drawing or something. \n\nBut booking an activity that leaves one girl out of a class of 11 is a shit move in the first place. She should have anticipated that this would happen. She thinks kids don’t talk to each other?", "Methinks that something about her daughter being a “competitive dancer” might play a part in the story…", "First one I’m with you on, but the later two are some toxic, self-hating shit. Gosh.", "Disagree on the late invite one. Sometimes there just isn't enough space initially, but someone that can't make it frees up space to allow someone else you would have invited had the limit been higher. As long as it's done within a close timeframe of the invites going out to begin with, there's nothing wrong with including someone else in place of someone that can't make it.", "Totally agree that Addy’s mom created the drama the moment she chose to leave just one child out. I can’t help but feel there’s an untold, mean-spirited reason behind it; I just can’t imagine any mom thinking this was an acceptable idea. I would *never* do something this unkind to a kid this age.", "It's also gives an objective report, instead of an subjective one.\n\nETA to fix autocorrect", "Exactly. Not being invited to everything is just a life lesson but if there’s 11 girls in the class and 10 of them go to the party that’s just shitty. She’s going to find out eventually.", "As far as I know Addy’s mom has, well had, no issue with us.  Addy slept over at our home many times during the school year.  We hadn’t seen them this summer but that was due to Addy attending camp and they had a family vacation.  It wasn’t due to not wanting her over. There was no issues between us as far as I knew.\n\nWe have had 2 of the children not attending her party over for a play date in the last week.  We’ve also seen a few other classmates that are attending.  None of the parents mentioned anything regarding party and I didn’t either.  The only reason I found out who had decided not to attend due to my daughter not being invited was because Addy’s mom gave me names in her text.  I can’t say what is being said amongst other parents but outside of Sarah and Addy’s moms nobody has said a word to me about it.  There’s been no real gossip about it as far as I know.", "No in the edit OP said her daughter still attends the book club but only does it once a month? So it’s perfectly normal and reasonable for OP to expect her daughter to get an invite. And the girls are all in her class even without the book club.", "It's all the other girls in her grade at school. It is not a random group of girls that meet elsewhere. She sees these girls every day.", "Whether you text the screenshot, quote verbatim, or just summarize the reason the daughter wasn't invited, the result would be the same. Not sure what about the screenshot makes it stand out, much less make someone the A H", "What specifically does a screenshot do that makes it worse than just explaining in any other way? Seems a weird thing to specifically latch onto", "im confused how is sending a screenshot of the conversation suddenly ruining things? Sarah’s mom is in the fault here she’s the one who gossiped to other moms about it so it’s her fault and her decision that caused things where it would go i don’t think it’s fair to blame OP for that as OP only shared it to one person and didn’t gossip about it to like multiple people.", "My daughter is with her school friends nearly every weekend during the school year.  During summer she takes off from dance and is with different school friends nearly every day.  The only reason book club was even mentioned is because that is how the invites were sent out.  She has been to every single birthday party the class has had and is invited to different friends homes on a weekly basis during the school year.  In summer we have kids in our home or she’s invited out with friends daily.  Her dance is not limiting her friend time, simply making her unable to attend every book club which is held a random nights and some of those nights she has dance class. Also book club is usually discussing a book for maybe 30 minutes with the rest of the time just hanging out and playing.  It’s not a formal event.", "On the contrary, Addy and Addy’s mom at least suck. Can’t really vouch for OP’s daughter, but Addy sounds like a Mean Girl.", "Everyone knows about screenshots now. If you don't want your responses to be shared, you should call. You can't expect text messages to be private anymore.", "The parents still would have felt it was rude to exclude one girl from their class.", ">I was leaning towards you being the AH, because you signed up your daughter for many other activities,\n\nYikes, I'm an A H parent if my kid does competitive dance and also wants to do things with friends at school?", "Yeah, I’ve seen Dancemoms! 😂", "I don’t think that’s self-loathing. It’s self-respect.", "And if the spa is a limit if ten, then you choose another activity  that doesn't  leave one girl out", "But why did she need to report the conversation at all? She could have just said oh space was limited, maybe next time. She created a bunch of drama amongst the mothers over a simple birthday invite. \n\nI have a 9 year old. You just explain that you're not always included in everything and sometimes other people are hanging out without you. There are other parties and hang outs. She isn't being excluded every time.", "It’s really crappy of them to basically go ‘rock, paper, scissors’ on who gets excluded instead of finding something else to do or simply paying a bit extra to get another kid included. \n\nHeck they could have simply sent out a note with the invites, or called/texted the parents that because they were hiring this person they would need to put on a small fee to include everybody because they normally only took on 10 people and there were 11 girls total. \n\nI remember we had that happen a couple of times. If everyone could agree to pay (it was something like 3-5$) each then the party would get to go horse riding, or swimming if not that was fine and it would just be a regular kids birthday party.", "Yeah.\nJust because you can doesn’t mean you should though.\n\nIt’s not unreasonable to believe a conversation between two people remains between two.", "Exactly.  That’s what makes the screenshots an ah move.  If OP had not done that, everyone would have still seen the bs birthday girl’s mom was dishing out, but in a less drama filled way.  The second you are sending receipts as ‘evidence’ you have entered the ESH zone.", "Yep. If you get a late invite, to a limited space event, someone else canceled... just decline", "No, the post literally states it’s because they think they weren’t meant to be a part of it. That’s not pride, that’s self deprecation.\n\nIf you want to live like that, feel free, but it’s hella toxic advice to spread around.", "I feel like Sarah’s mum, knowing this was a bday party at a house, would have asked “what do you mean limited? How does she not have room for one other girl? All 11 girls have been in the house before, clearly they fit inside this house. How does a bday party for a girl with 10 friends have a limit of 9 when it’s at her house?” \n\nUnless you mean she should have told her space was limited because of the planned activity because if so, that’s what she did.", "Well, that's essentially the message that sending the screenshot showed: space is limited to 10, and one girl will have to miss this time. That's it. Maybe the other mom did overreact or could have talked this out without boycotting the party. We don't know, that's potentially not on OP. All OP did was tell the truth, and it is indeed normal to ask about why one child can't be included. That's probably information a mom should have, ESPECIALLY if there are other events where she will actually be sending her daughter with these people. The fact that the party was supposed to be a secret adds a layer to this. It's not missing one event- it's a secret event. I'd be like \"what do you mean you didn't think I would find out about your daughter's birthday, this is silly.\" Red flags are going off, and they're not from anything OP did here. All I know is there's more to the story.", ">hiring this person they would need to put on a small fee to include everybody\n\nWhen you're a host, you pay for the entertainment.  Asking for a small fee to attend a children's party is gross.  If you can't afford the spa treatment for everyone, then you do something else.", "I agree with you. \n\nJust because it's unreasonable doesn't mean it should be unexpected. People suck.", "If someone doesn’t want me at their party I certainly don’t need to beg them. There’s nothing toxic about *not inviting yourself to other people’s parties.*", "“People suck.”\n\nYep - agreed.\n\nHence my ESH vote.", "No one said to beg. This very well couldve been an honest mistake since she wasnt at book club and you dont know unless you ask. Why build a fictional boogey man in your head.", "Nah I don’t think that in a class with 11 girls you manage to invite all but one.\n\nAnd when it was brought to her attention the mom gave some BS about a “keeping it at 10 for a spa day.”", "But it wasn't an honest mistake. And frankly, they almost never are.", "YTA- Fr had no reason to ss the convo and send it to another mom, prolly shouldn’t have even asked in the first place if u weren’t invited, then don’t invite ur self and asking is the same as invited itself unless the other person has the balls to tell you that your not invited, ur daughter misses a party, so what? There will be others", "YTA. If there weren't tensions and issues in the group, there will be now.", "ESH except for the children of course. \n\nAddy’s mom sucks for excluding one kid in a closely knit class/group. \n\nYou suck not for asking why your child wasn’t invited but for including Sarah’s mom in the issue in the first place and sending the screenshot. Instead of showing what took place you could have easily just said you won’t be attending but said it was no big deal. You also waited to let the drama unfold instead of telling Sarah’s mom that she shouldn’t keep Sarah from the party or encourage others not to go just because of your child. It would have worked out better for you in the long run. \n\nSarah’s mom sucks for inserting herself and for encouraging others not to go.\n\nAnd EVERY single one of y’all suck because now none of the girls are going to enjoy the party no matter if they attend or they don’t. You could have possibly put some of the girls against each other all because the 3 of you couldn’t work this out privately.", "YTA. That mom made a decision for her budget and kid’s preferences. You then shared texts of a private conversation to get others to agree with you.", "NTA\n\n\nThe \"spa mom\" is mad bc OP told the truth about her awful behaviour.  \n\n\nYes, that normally brings out the worst in ppl who want to avoid the consequences of their bad actions.  But that doesn't make the truth teller a bad person. \n\n\nOP didn't \"ruin\" anything.", "There are gonna be plenty of parties in this game called life.  Next time don't inquire", "NTA. It is um, possible that the other woman just didn't think. People can be clueless. In this case, she's found out that this was not acceptable.", "If they had wanted to invite your daughter they would have invited her. Not showing up to a book club meeting is not some insurmountable barrier to inviting someone. This 10 person limit was likely a polite excuse. Not everyone has to want every person to come to their party. You tried to push your daughter in then stirred the pot a bit by sharing screenshots. That makes you TA.", "YTA. Not everyone can be invited.", "NTA. \n\nYou reached out to the mom to clarify if your kid was invited. She wasn’t. The other mom followed up with you and you provided information straight from the source so nothing got misconstrued- the screenshot doesn’t lie. You didn’t ask the other moms to back out and not attend. And it’s really fucking shitty they would exclude ONE child.\n\nBy the way “you weren’t supposed to find out” you were going to find out regardless because I’m sure it was going to slip out from the 10 girls who were going to go. You’re going to tell me not one of them was going to mention the event? Which is a shit way to find out she was excluded. \n\nIn lieu of this party and it’s drama, id say take your kid out to a real spa day and do something fun with her ♥️", "NTA\n\nProbably could have done without the screenshot, but you're not responsible for others not wanting to go. \n\nI just feel bad it's at the expense of innocent children.", "NTA. But Addy’s mom is.", "NTA. I’m sure the other mom could’ve paid a little extra to add 1 additional person. OR could’ve picked a different activity or figured out some way to include everyone. What she did was horrible and frankly, I’m glad the other girls didn’t go.", "NTA. It was very rude to invite everyone but your daughter! And of course she was going to find out about it! These are her friends! They are going to talk about it! I'm glad the other moms stuck up for your daughter! Maybe her and the others could do an activity the day of the party?", "NTA. That other mom was OK with one kid being left out. And, honestly, awesome so many other kids and parents didn't like that. \n\nShe has egg on her face and isn't wearing it well - too bad she didn't learn from all this.", "NTA For asking if there was a mistake, that a small class. A class that small and thinking your daughter wouldn’t find out is a bunk excuse. She knew your daughter would find out eventually. She just didn’t care, until she was call out on it and others didn’t agree with her choice.", "NTA. No special party is worth excluding a child. How you explained to your child is commendable and what Sarah's mom did is very respectable and true parenting. Proud of you both", "The dynamics of tweens and parents of tweens if far too complex for Reddit", "All of you are assholes - this is teaching young girls to bitch and moan behind each others backs. Lead by example and leave it alone.", "YTA", "NTA.  Sorry for your daughters exclusion.   \n\nI find it refreshing to see that these mini-melodramas involve women as well.  So often these tales in Reddit involve men wringing their hands about who was/was not included.  \n\nThank you", "I agree invite one/invite all but in her mind she did invite everyone in book club.  I think it would have been better to invite #11 and chances are the person managing the spa day could have accommodated 1 more. I might have asked but I would not be sharing screenshots of the convo.", "NTA\n\nCan't invite one of the group because of the capacity of an activity? YOU CHANGE THE ACTIVITY You don't exclude ONE 9yr old. It's super shitty.", "NTA.  Obviously reasonable questions to ask, and talking to people just seems like a normal thing people do. \n\nSounds like the birthday mum is the AH.", "It’s hard not to be invited. I remember in high school a classmate had a huge slumber party/birthday party. All of my friends were invited and went. They all had lunch at the same time which is when they were invited. It was a tough evening at home with just my parents because all of my friends were at the party.", "NTA", "NTA, you did nothing wrong. \n\naddy's mum made selfish wrong decision. She thought nobody will find out, but people did. \n\nYou aren't responsible for decisions of Abby's mum, Sarah's mum and other mums. Other mums thinks that the invites sucks because they sucks.  Abby's mum is looking for a way how to blame you for consequences of her own poor decision instead of accepting responsibility. \n\nBe glad you and your daughter have friends like that who will stand against any attempt to exclude or bully your daughter.", "NTA\n\nI freaking love Sarah's mom. She has class. She didn't tolerate that one girl was excluded in a small school/class/group. What an amazing woman. What an awesome spine she has.", "NTA.   It is unfortunate it worked out this way.", "NTA\nJust food for thought....what would've happened had dance been cancelled and your daughter attended the book club? Would everyone have gotten an invite but her in her FACE? Sounds funny and not haha funny either.", "NTA. \n\nWith kids it’s easy for communication sent through the child not to make it so checking wasn’t wrong. Sounds like you handled it well and explained it to your daughter in a helpful and adaptive way. It’s not your fault other moms were upset about your daughter being excluded", "NTA. Buuuut it seems like the other girl may be catty towards your daughter and perhaps some of the other girls were also not comfortable with this. Maybe have her host a sleepover or something and invite the whole club", "NTA - but start apologizing to people for stirring the pot a bit, and make it clear you get what happened without animosity. My mom bullied parents that didn't invite me to things, and it just embarrassed me and made me an outcast. It sounds like your gut instinct is right, and this can all be put to rest by a few small conversations.", "NTA. there was no way that your daughter wouldn’t have found out that *all* the girls in the class were at a party that she wasn’t invited to. absolutely no way. \n\nYour intentions from the beginning were innocent, and it’s just unfortunate that it played out the way it did. \n\nYou didn’t create drama, if i were the mother throwing the party i would’ve found a way to include all the girls because i would t want any of them feeling left out. Simple as that.\n\ni know it’s always, but please just remain calm and diplomatic about this, try to avoid getting involved in negative gossip that can ruin groups like this & just know that you aren’t in the wrong ok. \n\nI haven’t experienced exactly this first hand but have seen similar situations play out with others in my daughters friend groups. it’s unavoidable at times, unfortunately.", "Well said… and also that mom thinking she can have 10 NINE-YEAR-OLDS at a party and the 11th “won’t find out” is maybe the stupidest thing I’ve ever heard.", "Agree with all of this. I've planned a lot of little girl bday parties and there is always the option of paying more to add an additional person or additional people, which is what Addy's mom should have done. If that wasn't an option, you plan something else instead. Leaving one single child out of such a small group out like that was a dick move. Good for the other moms for seeing it for what it was and not participating in that. The only person who ruined Addy's bday party was Addy's mom. Nta.", "The invite had said it was swimming/movie party.  They were playing a movie on an outdoor screen while the kids swam and watched. If the event had been at a place, outside of home, I would have assumed it was a pay/kid type of thing and not even asked.  The whole reason I thought it could’ve been an oversight was because the party is at their house.  The invite hadn’t mentioned anything about doing a spa.  Reading the comments I may be TA for sending the screenshot, in the moment I felt it was the easiest way to explain what transpired.", "A screen shot is simply a way to catch someone up without retyping the whole thing. It wasn’t a gotcha in this situation. So I’m with you, this is totally fine.", "I totally agree with you and this limit of 10 crap I am not sure I am buying. \n\nIt is so typical of Women to feel the need to exclude someone to make themselves feel good. It's a behavior many girls are taught early from their moms and then those girls in turn teach it to other girls.\n\nHonestly it's awful and I think OP did the right thing and I think Sara's mom is a hero for not going along with this behavior. \n\nNTA", "I think if it’s your kid being left out, you go to bat as long as it’s not going to result in your kid being treated badly.\n\nClearly, at least some of the other families didn’t know this was going down and didn’t approve of this mom shunning OP’s kid. So it’s good OP made this known, to bring this toxic BS to light before it became a recurring theme. The other parents who backed out will probably be extra careful now to make sure OP’s kid isn’t excluded.\n\nNTA, OP—Addy’s mom brought this on them by being a jerk. Edit: grammar", "When it's just me, then this is absolutely what I do, but her daughter was right there and was asked about the party first, and heard the other mother say that the OP should go reach out and ask so that OPs daughter could go to the cool pool party that every single other girl in her class was going to. That puts a bit of a different spin on things.", "Brilliant advice. Asking just makes things awkward for everyone. Go where you are celebrated, not tolerated.", "Wouldn’t a class this small have a mandatory invite-all rule? Well, I was under the impression this happens a lot with young kids (invite all or none) and it makes sense that it would also apply to a super small class like this (they’re still young too).", "I can agree on this, but I would also say, there isn't anything wrong with a little pettiness and just *casually* mentioning the lack of invite to other parents. sometimes, like in ops case, they'll make sure the parents get the message about intentionally excluding kids for bs reasons.", "I feel NTA, but if you wanted to heal the group, reach out to the 4 moms and ask them to please not boycott the party, as that's not what you meant.\n\nSome people suggest offering to pay for an extra spa treatment so your daughter can join in, but to me that can lead to more conundrums.", "Right? Like this mom was expecting a group of NINE-YEAR-OLDS to keep their mouths shut so the last girl wouldn’t find out? I cannot even comprehend the sheer stupidity of that assumption.", "But she didn't guarantee drama by telling the truth, in fact I agree with the other comments showing that the screenshot is more objective. OP also says she specifically talked to her daughter about going to everything, but it was the responsible thing for OP to inquire about this exclusion of her child specifically. OP needs to be informed about this close group that her young child spends a lot of time with.", "Once Sarah’s mom said she wasn’t attending the very *LEAST* OP could have done was discourage her from doing so. A simple, “oh no that’s okay! Sarah shouldn’t have to miss out just because we’re not invited. Have fun!” \n\nBut OP also let all of this unfold.", "Apparently, several of the girls like OP’s daughter enough that they’re ditching a party for her.", "I could see “only book club” if school had 25 girls to invite and you needed to condense, but to leave just one kid out? It’s cruel. Now all the friends have this one experience that she will be out of the loop on, not because she had other commitments, but because she was just left out, which is big at that age. Again, if it were a bunch more kids, this is easily explainable to children, you don’t get invited to everything, people can’t always have every kid at their home, But you being the ONLY one? How do you make that not personal to a 9 year old?\n\n\nShe didn’t reach out to the moms, they made their choices, and one I think I would make too. I couldn’t stand seeing one kid left out and being a part of it.", "This exactly.  Bullies and toxic people NEVER own up to their fault in this kind if behavior and they have trained the masses to blame the innocent party when they are called out.", ">It's also gives an objective report, instead of an objective one.\n\nI think that second \"objective\" was supposed to be subjective?\n\nAutocorrect for the lose, perhaps.", "That part. Mom was willing to take that risk. She got caught and didn't like the outcome.", "“So typical of women”?! Gtfo with that shit. Internalized misogyny.", "Honestly, I have friends I think about once a day and friends I think about once a month. When I realized that I haven't invited X in a while and I think they would want to hang out then I do. I am more close to some people compared to others. Also sometimes friends might be busy, might not like the event, or space is limited so that is kept in mind when I invite people to things.", "Sounds like you invited yourself to more places than u should have", "I mean, what would be the reason of receiving a late invite (besides complications)?", "I’m with you on this. I was friends with a couple who were getting married in Spain (we weren’t “close” friends by any stretch of the imagination, but a lot of my close friends were invited and attending). I, understandably, did not receive an invite at first but happened to be living in Spain at the time, and quite close to where their venue was. A few days before the wedding the bride and groom reached out and invited me. I assume they had some last minute cancellations, but that didn’t bother me one bit and I happily accepted. It was one of the best weddings I’ve ever attended and I’m so glad I went, even if I was a total afterthought lol", ">Sometimes there just isn't enough space initially, but someone that can't make it frees up space\n\nNahh. It sucks knowing that you arent thought of good enough to make the cut into the original plan of the group, but you are okay enough to be considered to join as a substitute for the better ones.\n\nWith friends Who do that, you Will never be considered as the main group. Just a bench player", "Nope. \n\nYou don't do it bc it makes ppl feel like after thoughts.\n\nHad they been important enough to make the initial cut they would have **made** the initial cut. . .and someone else would have been sitting put due to space limitations.", "Eh. I disagree. I was a competitive dancer growing up, nothing like Dancemoms, and it really does take up so much of your time. I had practice for 4 hours every day after school and 8 hours every Saturday or Sunday, not including actual competition weekends, which took up the entire weekend.", "Please keep in mind that is a reality show and not how competitive dance really is.  Maybe at some studios but definitely not where my girls go.", "I believe those rules only apply if you do the inviting at school/classroom.\n\nInvites In private is free for selecting", "Our school has a rule that invites handed out in class must include everyone.  Outside of school it’s your own choice.", "OP had every right to inquire.  But sharing screenshots is shady.", "Not to mention I'd rather screenshot than be accused of twisting words later. This situation was weird, and it's clear several parents felt weird about it. It's not on OP to smooth it over to make it sound better", "I absolutely expect my private conversations to stay private. Sending a screenshot is rude.", "Agree. My daughter had small classes in primary school. Some years girls out-numbered boys, some not. Until she reached grades with larger classes, every girl was invited to her parties. Cupcakes were sent to school on her birthday with enough for her class, Teacher, and aides.", "I would usually agree with you, and have explained that to my children often, but I disagree on this situation. It is the exception to the rule. If only three to five girls were invited, the rule makes sense, but leaving out just one or even two, no. It’s cruel. I wouldn’t explain it to my child that way in this situation either, because I would never want her to think it’s okay to exclude one person. I would say: We cannot control how other people behave, even when they are behaving badly. People have a right to their choices, but you have a right to your hurt feelings. One day when you are in a position of being the host, you can choose to handle other people’s with care.", "Lol you don't know anything about me. If your going to claim you've never witnessed this behavior first hand or experienced it yourself then I'm going to say your either a liar or the luckiest woman on the planet. \n\nJust because I've observed this as a common behavior in women doesn't mean I hate women or think they are less than men. Men have there own typical social behaviors that are just as negative and I call them out when I see it too.", "Second one usually but not always\n\nThird one, no. Late invites have other reasons of happening", "Absolutely!!!", "It only hurts if the friendship degree is unequal. If you think of a person as your best friend and then you find out you're not in their top 20 then sure, that sucks, but not being in someone's closest inner circle doesn't mean that the friendship isn't real. \n\nIf I got a late invitation to a party I might be disappointed in some cases that I wasn't a priority, or flattered in other cases to have been considered at all, but either way I would make the decision based on whether or not I thought I would enjoy attending, not whether or not I felt slighted by the timing of the invitation.", "If everyone acted like this, my parties would not have friends, my parties were always first family, then friends, there are always many circumstances.\r  \nIt is as if that person who is afraid of heights is offended because they were not invited to skydive, they are situations, there will always be more, if you were happy until you found out about a party, why are you unhappy now?", "Hey my friend couldn’t go to the concert/game/etc. do you want to come?\n\nHey I didn’t see you last week because you were on vacation, we’re having a BBQ tomorrow if you want to come?\n\nHey a couple of our friends backed out so now is room for 2 more people at the campsite/vacation rental, its right on the lake in two week.  I’d love to have you come along.\n\n\nNot everything is some huge melodrama. Sometimes there are limited spaces, sometimes people forget.  If you’re going to be miserable don’t go.", "Remember the aunt Mildred's of the world.\n\nYou have too invite them. But many rejoice when her hemorrhoids keep her home.\n\nWhen old Millie declines they can dance your invite you the box.", "That's a ridiculous way to view it. Some activities have ridiculously low caps on numbers, and sometimes it's truly just that simple that you have 8 close friends but can only invite 4 you have to just pick and it doesn't make the other's an after thought or lesser friends it is literally just that you had a limit. 🤷‍♀️", "Gonna disagree. I have literally loads of friends in different groups from different places; school, work, hobbies, family and such. I never play favorites and I very seldom prioritize one over the other. Except for things like parties or activities that involve me otherwise footing the bill. If I wanted to invite literally everyone I’m really close to to a birthday event at a restaurant it’d probably number close to 100. And unless you’re gonna pay to reserve the whole restaurant for a whole evening and the food on top of that, not possible. Therefore my main criteria is I invite people who have invited me to things before, and often that takes up my budget. It’s not always about “being good enough” it’s about practicality and affordability sometimes too.", "Nah, most people are reasonable and can grasp that some times, there are limits in place and it's not a personal slight, and it doesn't mean they don't matter to us.", "I knew a lot of competitive dancers (I did dance for fun) and the majority of them were super sweet (nicer when not around the older dance girls, but still always nice)\n\nBeing in such a busy schedule at such a young age plus all the attention and hard work I feel like can either make the girls very nice or very stuck up,, I know the stereo type, but I have had a lot of good experiences with competitive dancers.", "That’s how it is anywhere I’ve worked…only have to invite all of done through the school.", "Not in this case it's not shady. The information was not at all private, the information was shared in the most direct and objective way, and the information was solicited. Not shady at all here. This is what screenshots are literally for.", "Yeahh it usually is easier so I get it and people just shouldn't say things over text they don't want getting out.", "Eh, it's a weird enough situation OP shouldn't be interpreting for the other parents. I wouldn't want to try and explain the reasoning second hand either, which is what everyone telling OP not to screenshot is essentially asking her to do. It's not her job to put words in the mom's mouth for her or smooth it over for the other parents. Let the statement she was told stand on its own", "Then you have unrealistic expectations, and you need to grow up.", "Yes, I used to let my kids choose who they wanted to invite, and then I'd check the class lists - if there was one girl/ boy in the class not invited, I'd suggest inviting that one extra person, and it was never a problem. \n\nBut in our school, we generally had two or three classes per grade. As the kids went through school, and the classes changed each year, the invite list tended to be a bigger mix of some from my child's class, and one or two from the other classes in that grade. So nobody was left feeling \"why am I the only one not invited\".", "My daughter has attended a party like this in the past. The limit was set my the company providing the services. They set a limit to ensure all services could be completed, enough supplies were available and enough staff were assigned. \n\nWhen you have such a small group of girls that regularly spend time together, it does make me wonder by Addy's mom would choose an activity that would exclude 1 friend. They could have done a Mom daughter day or invited one friend for a spa day.", "I have, and they’re just like you 😘. Be better.", "?", "While I generally agree that yes of you host you take on the responsibility of paying, It’s absolutely fine to contact the parents and ask them if this is okay with them and if not no worries we have other plans that are fine and nobody will be shamed or named if they don’t want to or can’t pay. \n\nAsking for a small % of what the actual prize pr head is is not rude when it’s asked In Advance and as an option not a requirement.\n\nIt’s basically going “I’ll pay the meal if you pay the tip. Or we can just stay in and I cook.”", "Pretty sure it's an adult way of looking at things when it comes to expecting privacy in conversations.  Then again, when I was in middle school, we said, this is an an a and b conversation, so you can c your way out of it. Which frankly applies to this entire post.", "It's possible that Addy didn't want to invite OP's daughter, so Mom thought this was a kind of back-up excuse if they found out. \"Oh, we would have invited you but there just wasn't enough space.\"\n\nIt's possible to decide not to invite someone to an event without actually making them feel excluded... but this is not how it's done.", "So let me get this straight,  because I said that I have seen this type of behavior in many women and that it is NOT OK, I am just like them...\n\nExplain that to me please. \n\nDo you even understand what internalized misogyny is? I don't think you do. It's a term referring to women who think men are smarter and better than women. In other words a woman who is a misogynist. I didn’t say men can't be bullies or toxic. \n\nWhat I said was that this SPECIFIC behavior isn't a rarity in female social group and that this type of single out exclusion is toxic and it is. \n\nI didn't say you never see this behavior in men, only that I see it often in women.\n\nSo at risk of another down vote from you I'll leave it at this, if your going to pull out common phrases you keep hearing from social media, Google them first and understand what your accusing someone of.\n\nWhat baffles me is we are clearly on the same side here and don't think this toxic behavior is ok so why are you picking a fight about it?", "This is so tacky.", "Everyone should keep things private but expecting everyone to do it is highly unrealistic.", "True. But thats why you ask. Make them say it out loud. That way there is no \"what ifs\" or excuses on monday. They cant pretend after the fact and be like \"where were you, why didnt you come to the party\" etc etc", "But you dont know unless you ask. Clarity allows you to move forward with real information instead of speculation.", "NTA - I might get down votes for this but you actually did the right thing by telling Sarah’s mom what happened and she did the right thing by telling the other moms. Excluding 1 person out of a class of 11 sets a precedent to exclude that 1 person and sets them up to be bullied once the girls hit puberty. Doing what you did and Sarah’s mom doing what she did set the correct tone for how to handle parties in the future.", "When I was in 8th grade, I was in a class with 18 other kids. One girl invited everyone to her birthday party except for me. I didn't know about it beforehand, but the whole ckaaa talked about it and had inside jokes from it for the rest of the year. That feeling of being the only person left out still affects me 15 years later. The \"secret party\" would absolutly not have stayed secret from your daughter. Honestly, good for you for making sure your daughter wasn't maliciously left out and good for the other moms who didn't want to exclude your daughter. NTA", "NTA, you didn't cause the drama or even intend any to exist. 4 parents other than you thought the slighting of your child was bad enough that they didn't care for their kids to attend either, all with no prompting from you. They decided for themselves that it was worth communicating with each other about the situation without you even knowing about it.\n\nThere's no proving it, but it's a fair guess that the same thing would have happened had you done nothing but say your daughter didn't get an invite.", "NTA obviously \n\nAlso we stan Sarah’s mom for not being cool with this absolute bs", "NTA \n\n1.) Rude to leave out one kid, especially for something as STUPID as \"spa day for only ten people.\" It's a swimming and movie party, why bring spa bullshit into in the first place?\n\n2.) It was perfectly reasonable to assume your child got accidentally skipped because she missed the event where the invitations were given out. It's not like there was a class of 40 kids, ten got invited and you called to ask why your kid wasn't 11.\n\n3.) It's not like you threw a fit about her not being invited or asked the other parents to boycott, that was out of your control\n\n4.) On what planet in this day and age does the one left out child not hear about the party. They party hadn't even happened yet, and already a girl told your daughter. \n\n5.) The mom got a well-deserved lesson in manners, although it sounds like it's not making it into her mind, unfortunately", "NTA. If the entire class get an invite except one child, the child is bound to feel excluded, and it's important to understand the reason for that. Also, you didn't force the other mom to invite you, you checked with her in case you've been left out by mistake. The other mom started drama when she chose an activity that excluded exactly one child.", "NTA.\n\nThey purposely left your child out. Which is shitty.\n\nBut even if it was a mistake, the mother is a bitch for not immediately rectifying it.  Don't invite everyone but one kid. That shit stays with you for life.\n\nI have a story sort of similar to this, but with a better ending.\n\nWhen I was in 1st grade, my teacher had handed out invitations to some of the kids I invited to my birthday party during our lunch. Now it was a pizza making party, and my parents paid for a specific amount of kids, so I could only invite my closest friends (usually girls.)  Well apparently, one of the invitations got mixed up as later that day, a boy's mother called my mom and said that her son was so excited to go to my birthday party! My mom was a bit confused at first as his name wasn't on the list. The boy's mother then was a little upset, but before anything happened my mom called me over and asked if it would be okay if he could come to the party even though he wasn't invited as he got the invitation by mistake and was so excited to go.  Without hesitation, I said \"yes of course he can come!\".  Even though she paid for a certain number of kids, my mom didn't care, because this was the right thing to do. She would find a way to make it work. The boy's mother was delighted, and he had a blast at my birthday party.  We later became friends as we shared interests in drawing, video games, and animals.\n\n(I very distinctly remember this story because he would unfortunately pass away during a house fire 3 years later. I thank God every day I made the right decision by having him come to my party.)", "NTA, but I’m kinda wondering if that 10 people limit was true or if there’s something else going on that made them exclude your daughter. Can you ask the spa if that limit even exists?", "NTA \n\nIt would be different if the class size was bigger/the girls weren’t friends but that is such a terrible thing to do to an 11 year old. I’m sure she could’ve hired someone else to do the same basic spa thing with 10+ people. And if the other moms heard about what she did and made a decision accordingly that’s on her. You didn’t “start” anything, you simply described the situation to one person. If she didn’t think there was anything wrong with what she was doing she would’ve been upfront from the start.", "A spa for 9-year-olds? How bizarre. \n\nA normal mom first wouldn't be doing a spa for 9-year-olds, but also would say, \"Oh, there's a limit of 10? Never mind then, that won't work since there are 11 girls in the group.\"", "NTA - it sounds like mom chose the one activity that specifically excluded your daughter.", "This is so ridiculous I don't even know where to start. First thing's first -- you're 100% NTA. Let's get that straight. You were just genuinely thinking your daughter didn't get an invite since she wasn't at the book club meeting. You had no malicious intent at all 💜\n\nAnd what kind of Mom plans a party *knowing* there are 11 little girls but then only has her daughter invite 10 of them (well 9, in addition to Addy)? The fact that Addy's Mom thought your daughter wouldn't find out about every other girl attending the party is just laughable. I think the reality of the situation is that Addy's Mom knows that what she and her daughter did was wrong, and she's being defensive after basically being called out for her childish behavior.\n\nI just don't see what kind of Mom wouldn't want to include all of her daughter's classmates/friends. Leaving out a SINGLE girl and/or planning an activity where you *know* a single girl will be left out just seems unnecessarily cruel 🥺", "Texting Addy's mom to ask was fine; sharing a screenshot of the conversation with Sarah's mom was not. There's no way that's not going to cause drama, and you know it. YTA", "YTA\n\nShe was not invited… did it suck? Yes, but that’s life. The party was for people who always attend, your daughter goes once every month or less… thats life! Sad but its worst to start inviting yourself and make other people bail.", "YTA. Not invited means not invited. Does it suck? Yes. But you don't question it and you certainly don't nuke your kid's relationship with the others.", "NTA", "I'd say NTA based on Addy's mom's reaction at the end you didn't intend that to happen, but maybe don't ask if your daughter was invited if she was you would know and vice versa it can put others in an awkward position and not shine the best of lights on you.\nPlus you could have tried to find out through Sarah's mum in a more discreet way as some food for thought.", "NTA.\n\nYou didn’t cause drama, the mom who chose an activity that would specifically leave out ONE girl did, and she’s throwing a tantrum.", "NTA the party was ruined before it even started.", "The only asshole move here is leaving out one child. That is ridiculous.\n\nI hope the Apple falls far from that tree.", "I'm not even going to touch the idea of who is an asshole here. \n\nIf your daughter wasn't invited, don't go. Were you more upset about the lack of the invite, or was she? Who was initially more upset? Seems like you were. Don't ingratiate your child on to other people. That's just going to make her be the person in the friend group that everyone feels like they are obligated to speak with. You are not doing her any favors. Allow her to navigate the social Moors of childhood. Be there to support her, but don't step in and embarrass her in this way. I don't care if she's 9 or 19. She doesn't want to go to a party she was not initially invited to.", "YTA (and so is Sarah's mother). \n\nThe person providing the spa service limits it to 10 participants. Including \"just one\" ie: your child, brings it to 11. Which is one more than 10 and not what the person hired was contracted to provide...which would be spa services for 10.\n\nYour daughter doesn't attend book club regularly due to her other activities. The Mom decided to limit to the girls who are regular participants in the club. That's fine.\n\nYou, who are not paying for a private home spa party for 10 children by the way, were in the wrong to try and force her invite. Sarah's mom is also in the wrong for getting involved when none of this was her business. The other mom's who pulled their kids out of the party join you and Sarah with an overdeveloped sense of entitlement. As you said, you were a jerk who caused unnecessary drama and messed up a kid's birthday. You probably also cost her parents some money under the general policy of No Refunds by folks hired to do this sort of work.", "YTA u could have just said Abby’s mom said there was a limit to the kids allowed for her event . Also y ask in the first place ? Ur kid is barely in book club now …", "NTA - two things I can’t stand - children’s parties where everyone EXCEPT for 1 or 2 kids are invited, and parties where everyone in the class is invited and no one shows up because the kid isn’t cool enough or rich enough or whatever. These are f’n kids, man, and that BS can be scarring for them. If the unpopular kid invites your kid to their birthday, it ain’t going to kill you to hang out at Chuck E. Cheese for a couple of hours.", "Yta your kid wasn’t invited. It doesn’t matter the reason. The whole drama was caused because you couldn’t accept that your daughter wasn’t invited to a party. Get over it it won’t be the last time.", "YTA - Sorry, but gatecrashing parties isn't cool, even for your kid. Maybe throw your own awesome party instead! 😄🎉", "NTA. I don’t think anyone in the situation is, just an unfortunate chain of events.", "NTA.\n\n Is your daughter me? I was literally in the same situation in 8th grade, complete with the pool party and projected movie (Aladdin).\n\nI was the only girl in the class not invited. I found out about it after the fact, and ngl I'm still sore about it over 25 years later lol.\n\nLike, the girl whose party it was friend-requested me on Facebook a few years ago and I declined lol.\n\nI feel for your daughter so hard.", "1. If your child is not invited DON’T ask why she wasn’t invited have some self respect and class. If someone wanted to invite you , you wouldn’t have to double check they would reach out to you because it’s not the old days we have phones. \n\n2. Your child is barely in the book club , she attends once a month or EVERY OTHER month which means she is barely there. So if they wanted to do the spa thing and they had a limit of 10 girls I can see why she went with it because your daughter is barely there for any of the book club activities but obviously if she was attending like other girls then that would make the mom an AH\n\n3. I still don’t think you are an AH because you didn’t come from a bad place you just made wrong decisions and I love that you taught your daughter a good lesson.", "ESH.  You never should have asked.  It wasn’t Sarah’s mom’s place to tell you contact the other mother.  You are an adult and should know better.  It is kind of crappy not to invite one child, but your daughter is spending less time with the other kids and things happen.  Your daughter undoubtedly has friends from dance class.  Is there any chance at her birthday she might invite some or all of them instead if her classmates?  You missed a teaching moment.  Friendships and relationships change as people grow in different directions and that is part of life.", "NTA, she never expected you would find out. Riiiiiiight because the girls wouldn’t all talk about it at school. I always find it sad that bullying doesn’t just end in school.", "I don’t think you did anything wrong. It’s clear that other mothers believe in solidarity", "yes. you were. as you told your daughter, take it as a life lesson.", "So, your daughter was left out because of convenience, she was the 11th person and they only booked for 10... that's petty. It was right for you to ask Addy's mom, after your daughter heard her friend got an invite, but she didn't and you explained it well to her. \nThat the other moms didn't let their daughters go anymore was entirely on them, not on you. They made that decision. For Addy's mom to blame you is also wrong. She should've known people can cancel/not come last moment. Even if the reason wasn't that they heard from Sarah's mom about why your daughter wasn't invited.\n\nNTA", "Maybe the other four kids just have things going on that day and couldn’t go. Maybe them not attending has nothing to do with OP at all.", "I do think it sucks she wasn't invited but we never invited the whole class to my son's parties. Caps on how many kids that could come can kind of suck. Take the kiddo out for a good night of fun, and just move on.", "YTA", "YTA.\n\nHave some class.", "Soft YTA. There were better ways to have handled it. Yes, it was correct to initially assume that the invitation was overlooked. A better course of action would have been something like this:\n\nSarah's daughter: \"Are you excited about the birthday party?\"\n\nYour daughter: \"What birthday party? I never got an invitation.\"\n\nYou: \"Perhaps the girl's mom forgot to send it, or it could've been lost in the mail. I'll ask her.\"\n\n_**You talk to the mom and confirm the reason.**_\n\nYou: \"I'm sorry honey, they have a limited amount of space for the party, and the girl could only pick a certain number of kids to invite. Maybe next time.\"\n\nYes, your daughter will be disappointed, but she will be able to understand that she won't always be invited to the events that are hosted by her friends.\n\nDisappointment happens in life; _**life is not fair, and it was never designed to be**_. As a mother, part of your job is to teach your daughter coping strategies to deal with disappointment, frustration, etc., in other words, **life**.\n\nRemember, the invitations were intentionally given out when your daughter wasn't at book club, likely to avoid disappointing her and having to explain in the moment why she couldn't attend the party, not to mention the awkwardness that would've occurred because of the exclusion.\n\nNo one could have predicted that the other girl would've assumed your daughter got an invitation and talked to her about the party. Kids do stuff like that. The mother of the birthday girl was under no obligation to let you come in spite of the limit, and Sarah's mom made an AH move by telling the other moms about your daughter having been excluded.", "Your mom is absolutely right. You should not ask for an invitation. As you mentioned several times, it is a small group and it is very unlikely that your daughter was forgotten. Also, why did you send the messages to Sarah's mom? You could say everything was sorted out.\nInitially, I thought yours was an honest mistake, but I am not sure.", "ESH\nIt sucks that your daughter was left out but once you confirmed that your daughter was in fact not invited, you sending a screen shot of the conversation put you in asshole territory. You shouldn't have involved the other parent and should have left it be. You should have followed your own advice that you \"can’t expect to be invited every time and this was just a life lesson.\"", "I am going to beak with quite a few here and say yes. When she becomes an adult, she will rapidly find out that she doesn’t get invited to everything that everyone else does. She needs to learn to figure this out by her self. Mom won’t always be around to fix stuff.", "YTA.  Your first instinct was correct.  You should have not gone begging for an invitation.  It's unseemly and demeaning to your daughter and yourself.", "Strong YTA.\n\nIt's not like anywhere in this story your daughter said she wanted to go.\n\nSince you took it upon yourself to kind of self-invite, if you wanted to you easily could have said you'd cover for your kid instead of nuking the whole party by sending a screenshot which seems pretty catty in and of itself. That's how easy this could have been solved.\n\nSo you managed to get the girls your daughter is actually friends with to not go to the party? Who really suffered outside of a little girl?\n\nHad Sarah and Addy not made you aware, would your daughter even had made the time otherwise or would she have had prior things going on?", "ESH\n\nAddy’s mom: I guess technically nobody should feel entitled to the parties she hosts or what she’s doing for her daughter, at her house, and with her money. But it doesn’t take away from the fact that it’s pretty mean to leave a single kid out.\n\nYou: You kind of suck for asking about your daughter’s invitation. If you didn’t get an invite, don’t ask about it. You’re putting people in the spot and inserting yourself into something you weren’t part of.\n\nThe rest of the adults: They need to let the kids be kids and leave the adult problems to the adults. Addy is not at fault for what is happening and the adults are being petty to a literal child. Trying to get back at the mom by ruining the birthday party is just messed up.", "YTA", " YTA. IMO you should not have talked to Addy’s mom at all. You put her in a embarrassing situation. If you’d left it alone and explained to your daughter that this is how life works or  maybe it was just an oversight she would have learned an important life lesson. Now you’ve stirred up controversy with several parents.", "NTA.  It seems like you don't really care,  but everyone is taking a hilarious stand.   \n\nOnly AH thing is sending a screenshot of the convo.  If you didn't think it was a big deal, let the other mom know it's not a big deal.", "NTA. I agree with what you said about not inviting yourself to things but in this situation - given the situation with the book club and the fact that it's such a small group of people - I would have assumed the invitation was just overlooked too.", "ESH if not invited don't ask. Addy's mom sucks for not inviting but it's her choice to have a actvitiy for ten people. Sarah's mom made it so more people cancelled\n\nOnly people who really suffered are the kids.\nOne's party is ruined as less friends are coming. \nOne's actively didn't get invited and her mom confirmed it. She could have been consoled that they forgot instead. \nOne has to skip on a party cause her mom said so.", "NTA", "i can understand why addy’s mom is upset but she couldn’t have expected any less when you don’t include someone in a small group, it was a bit unfair to choose such a limited activity planned for a party, knowing you’d have to leave someone out\n\nthe girls who didn’t attend simply understood that it’s rude to leave a single person out\n\nno one is really to blame completely, but all kinda suck", "NTA. FK the other girls Mum she's being silly \n\nAnd Sarah is a friend for life has your back", "NTA but the parents are. How can a parent agree to put on a party when their daughter goes to school with 11 kids but the party limit is 10? Makes no sense. Either insist that the hired person amend their number to 11 or don't hire them.", "I am going to go with NTA on this one. You didn’t tell the other parents to boycott the party you just stated to ONE other parent the reason your child wasn’t invited. Issues like this are the reason I don’t do parties (we do nice trips instead) and we rarely attend parties (graciously RSVP-ing no).", "NTA  Sarah is the one who mentioned it to her mom. Sarah herself probably didn't want to go if your daughter wasn't going. The girls probably talked about it at school and decided for themselves not to go, Abbys mom is TA. She is the one who caused the division in the girls. All the comments about not going if you get a late invite are garbage as these are children.  They don't care if their invite is late, they are just happy to be included.", "NTA. \n\nShe didn’t invite book club kids, she invited the kids in her class and excluded 1 child. How did she expect that you wouldn’t have found you. \n\nEven if you hadn’t have raised it, the other moms would have found out. They seem to be in agreement that you don’t exclude 1 child so the same outcome, or if it was after the fact then different fallout but still you’re NTA. \n\nThe mother has no one to blame but herself for her daughters birthday party being different than planned.", "NTA and the solidarity warms my heart.", "I think this mother was absolutely wrong to not include one kid and pretty stupid too if she thought you weren’t going to find out about a party every other child that your daughter knows is going to. That being said- I would have asked your mom friend to be the one to ask the other mom why your daughter wasn’t invited- something like, hey, we were just at xyz’s house and she said she didn’t know anything about the party. I kinda assumed all the girls were invited- sorry I spilled the beans. Is there a reason she’s not invited? because it is kind of rude to just invite yourself. I think I would have avoided contacting her directly and asked another Mom to ask her. I feel for your daughter- I have a 10 year old daughter and they are really so sensitive at that age and they take so much personally. Maybe on the night of the party you can have a Mom-Daughter date and go see a movie or get ice cream or do something fun just the two of you.", "NTA", "NTA and I can't get over the fact that Addy's mom actually said she didn't think they would find out lol. Like little girls don't talk incessantly lol. Like nobody would notice she wasn't there lol. Even Sarah's mom knew something was up that's why she followed up with OP.", "NTA\nIf it was a secret, SHE SHOULD HAVE KEPT IT.", "NTA\n\nYou didn't start the drama, Addy's mother did by excluding your daughter.", "NTA. if the kid really had her heart set on it mom should've looped you in immediately. if mom picked the activity knowingly, she's rude, and still should've said something sooner. conflict avoidance makes things WORSE.", "Nta - you weren’t wrong for wanting clarification. When you understood you used it as a teaching moment for your daughter, which was good. It was Sarah’s mom that caused all the issues.", "Nope, excluding only one child from the class is not OK.  You did nothing wrong in talking with another mom about it.  In my book, the mothers who kept their kids home from the party in protest are champs.\n\nIt's very sad for the birthday girl, who very likely didn't have one thing to do with excluding your daughter.  But her party was wrecked by her insensitive mother who didn't care if she hurt a child -- not by you or by the other moms who refused to help the birthday girl's mom hurt a child.\n\nNTA", "NTA\n\nyou didn’t encourage the other parents to decline the invitation. you relayed what had happened to the parent who you had already spoken to about it. addy’s mom is just mad that she’s facing negative consequences for her own actions. some people won’t be comfortable sending their child into a situation where a friend is being excluded. it’s a great way to teach kids not to passively support exclusion. \n\nthis woman is just mad that she was caught being cruel to a child and not everyone is going along with it. she feels bad because she did a shitty thing. she shouldn’t be redirecting that onto you, but someone who plans an activity knowing one child of a small group will have to be excluded probably isn’t a super kind and thoughtful person who can sit with their mistakes and discomfort.", "NTA. You didn't ask the other parents to do the weird solidarity thing. That being said, I feel really bad for the birthday girl. 😥", "NTA at all. Addy’s mom should have known better than to exclude just one child.", "Now this is the best AITA question i’ve ever seen.", "NTA. You just wanted your child to have fun! Parties are for everyone, right? Don't worry, it's all good!", "NTA  \nAddie's mum could just make it a pool party with the movies on the screen, it would be sufficient enough for the 9yo birthday party.   \nShe chose the additional spa activity excluding this one single child instead. It looks like she would like to \"show off\", but was too cheap to the \"real show off\" and including all the kids. Or she actively would exclude your child, which is the AH behaviour.  \nShe is the AH.   \nSarah's mum and other mums are NTA also - they just showed how the real caring person should act.   \nWe're not talking about some \"wedding invitation\" drama among the grown up people. We're talking about 9yo girl. Excluding a child is just cruel.", "you are so not the AH. your daughter would have been heart broken the moment the others would talk about it on the next school day, of the blast they had. NTA \n\n&#x200B;\n\naddys mom on the other hand tried to outcast a kid. that is a special reservation for asshole reservoir", "NTA. You didn't actively and repeatedly insist that your daughter be included. You just inquired once and were given a very rude reply. The other kids aren't going not because you riled up their parents but because they can probably recognise the shitty behaviour displayed by the parents of the birthday kid and don't want to associate with that. Honestly what a weird move for them to decide on an activity for 10 kids which would leave out just 1. If it were a class of 18-20 kids and a number weren't invited that would be fine. But to just leave out one? Wow!", "YTA.  Your kid won’t be invited to every party, you overstepped", "Nta your daughter is still apart of book club, even if she wasn’t she’s apart of their class and should’ve been included", "NTA and you didn't do anything wrong.", "The clue that OP is NTA is that she didn't raise any drama, and 4 parents pulled their kids out because they didn't agree with exclusion once they found out about it \n\nAddy's mother created the problem and was counting on no one finding out that OP's daughter was excluded.", "Packages like that you can usually pay extra for an additional space they just didn't want to", ">Sara's mom following up on your conversation shows she is concerned that your daughter seems to be left out. Her deciding to rally other moms or explain to other moms why her daughter will skip the party is not your decision, it's hers.\n\nGiven both of these points, there's a good chance that if OP hadn't followed up, Sara's mom would have. If not before the party, then at drop-off. Once Sara's mom found out what the deal was, there is no reason to believe that she would have responded any differently than she actually did.\n\nWhat matters here is not how this lady found out what the Addy's mom was doing. What matters is that once she found out, she refused to be complicit in it. The same with the other moms.\n\nThe only AH is Addy's mom for her exclusion game.", "Yes. It's just so cruel. Good on the other parents for not putting up with that lady's bs. We can't teach our kids inclusivity by exluding people for no good reason. NTA op but spa lady certainly is.", "Straight up bullying IMO", "You're not wrong, but anyone who has a plan blow up because they thought someone wasn't going to find out has only themselves to blame.\n\nIf the other parents thought it was fine to exclude one girl, their kids would still be attending.", "I 100% disagree with the last two. You’re wrong", "The late invite one is lame I forget and procrastinate in inviting people so I end up doing like 3 different batches of invites. My friends understand that I forget things (yes, even the things I want to do) so nobody ever takes it personally", "NTA. She made it a big mess herself as small groups will know sooner or later", "I'm going to completely agree here. She's not an asshole for asking about it. But, those 3 rules are something to live by.", "Late invite is the ultimate insult - we received a late invite to my cousins wedding and others said it was just an oversight.. I’m not an idiot. They didn’t want us there but probably found they had room. My invite cane 1 month before", "That's why we always write the invitations on the group chat to my daughter's class parents. To ensure that everybody know the details, even if the kid lost the invitation or forgot to say about it.", "Sarah's mom has class.\n\nOP doesnt. She sounds narcissistic, trying to cover it up by playing the daughter card.\n\nShame on you, OP\n\nYTA, all the way down", "but why should she lie to Sarah's mom? she asked why she wasn't invited and OP told her exactly why. If addy's mom didn't want others to find out, maybe she should not have decided to isolate a child.", "You don't plan the party activities for your child if you can't invite all the kids from the class beacuse of money. You should plan \"ordinary\" party (pool party and the movies outdoor looks sufficient enough for 9yo girls). If you really want to have a spa to your kid and your budget is limited, make it another time, not as a part of birthday party.   \n\"This event\" was a children's birthday party. This is a toxic and AH behaviour to leave one kid out.   \nIf you don't see it, well...", "That's such a bad take. The kids are in a tight knit group of 11 girls. they stay at each others houses, spend daily a few hours together. How is it a good idea to exclude one kid? just one? making a child feel excluded, let alone a friend, for absolutely no reason at all is vile. the other parents who don't want their kids to attend are probably doing that because they wouldn't want it happening to their child either.\n\nHow do you think it would be, when the girls would all be talking about the spa day they had while she would just wonder why she wasn't included? Addy's mom effectively would isolate the child. Other's kids may not be your responsibility, but as an adult how you treat your kids' friends is.", "Why should op protect a woman who went out of her way to exlude op's kid? It's not op's actions causing the drama, it's Addy's mom. She f*cked around and got caught. How is sharing a screenshot of someone's response bad but purposefully exluding one out of ten kids isn't? Op isn't responsible for what the other parents did (but good on them for not taking part in the exclusion).", "Why is sharing a screenshot wrong? What would’ve been more appropriate?", "She did explain it to her daughter. What the other parents did was their choice.", "That mom included everyone except for 1 child.  She was also stupid enough to think that info wouldn't travel.  Sharing the text was the safest thing to do, as it avoids misconceptions in what actually happened. \n\nA small gathering is fine, but if you invite 10/11, you'd better have a damn good reason for acting like that 1 doesn't exist, because you can do some serious damage doing so. \n\nAnd what message are you teaching your kid at that point?", "If my budget doesn't let me to invite all the my daughter's classmates to some birthday activities, I change the activities to include all the classmates.   \nOf course, my child can dream of some activities like pony-riding or spa. And I can give her it, as a birthday present, separately, not as a part of birthday party.   \nKids are happy just being invited to a party - they don't need super expensive activities.   \nIn my daughter's class if some parents want to make something \"extra\", something, what can be a little expensive, they just are organising the double/multiple birthday for some kids together. This way it's not so expensive to one family, because they share the costs and every kid is included.", "Literally not what happened lmfao", "And OP makes the tension? Not the mum excluding one kid?", "Op was not trying to force invite, if she was gatecrashing the party she would have done it on the day of the party itself...if my child was excluded from something then I would also want to know the reason why so that if it's something my daughter did then I could talk to her about it. Sarah's mom pulled out her daughter because she thought it was not fair to make a plan where one kid is Purposefully excluded.", "This is actually a GREAT point. OP’s daughter is spending as much time with the girls due to her schedule and has probably made other friends through dance.", "She didn’t “involve” the other parent. The other parent asked her outright. Did you want OP to lie? Lmao", "She didn’t beg for an invitation. She asked if it was an oversight or intentional.", "Hoping that the one other girl wouldn’t find out was the weak option as well. At least have the balls to own the decision, contact the OP in advance saying “I’m really sorry but there’s a numbers limit and it kinda fell this way, why don’t you bring your daughter over a separate day to make it clear she’s still a valued friend.”\n\nNTA, much better ways to deal with this.", "As someone with one myself, I can imagine a world where Addy will one day grow to resent her mom’s thriftyness, avoidant communication style, and prioritization of dollar values over actually inclusive activités. Oh and throw in that Abby’s mom doesn’t enjoy changing plans once she’s settled her mind on something, and others bear the harm of it. \n\nI am of course not speaking out of experience…", "I agree NTA where maybe sending the convo itself was probably the wrong move but not enough to make you an AH. But Sarah's mom sounds pretty cool, go take her and your kids to the spa", "No, you are NTA, this whole situation is just silly", "oh definitely NTA, you did the right thing so don’t worry. It was completely okay for you to do what you did and you did not cross any lines.", "YTA bc of the screenshot. There was no excuse for that and it was drama starting. There were waaaayyyy better ways to handle that.  So congrats on spoiling a little girl’s birthday just bc you were cranky at her mom. \n\nAs far as the situation itself, the ONLY reason I think it’s ok what you did is bc there’s only 11 girls in the club. So I don’t feel it’s fair your daughter got left out as she was the only one. \n\nBut normally, it’s pretty rude to ask about your child being included. Sometimes in life, people don’t get invited and it’s not bc of exclusion or bullying, it’s just life.", "Yes, if they didn’t want to attend because one girl was shunned they might not have stayed anyway once they got there. Even if she hadn’t reached out to Addy’s mom, Sarah’s mom still knew that they hadn’t received an invitation and would’ve told the rest when she wasn’t there. It’s better to rsvp no then to leave early in a mass exodus or have to explain why you shunned just one kid and acted like none of them were friends of hers that would’ve mentioned it. Addy’s mom pretty much admitted that she thought OP’s daughter wasn’t friends with the rest of them. So many women like Addy’s mom don’t mature past high school clique behavior and it’s disgusting.", "WTF? OPs kid wasn't being shunned nor was there anything toxic about this situation except how the other moms handled it", "If I’m not told about a party there is no way I’m going to ask! I can take a hint.", "This is summer, school isn't in session. The kids were invited at a book club not school. I HATE the \"all the kids must be invited\" rule because it forces kids to invite their bullies to their party", "I don't follow", "I’m not saying OP is at fault. I’m just wondering what the optics are to the other moms. This could be a mean mom group or it could also be a misperception of OP and her kid?\n\nI know people hear dance kids/mom and may have a prejudice and I was wondering if it was at play- justified or not", "Or maybe they DID want you there originally but were short on space. Once they found they had room, you were invited. Weddings are expensive and you have to pay per person, and you can only invite as many as the hall allows. It's not always an insult to not get invited", "You're definitely NTA but you do have some damage control to do now because the children are the innocent parties in all of this. \n\nEven if you didn't talk to the other parents of the non-attending kids before, you have to reach out and have a conversation with them now. They're free to make whatever choices they want with regards to their kids attendance at the party but they should be hearing from you that this doesn't need to become dramatic for everyone involved. \n\nI'd also see if it isn't possible to simply reach out to the spa service provider and see if they can't either make a one time exemption to their rule of 10, or if they can add one more on a pro-rated basis. \n\nThe bottom line is there's no reason for all these girls not to attend this one child's birthday party. This is fixable. And you should try your best to fix it, even if you are definitely NTA.", "You dont send screenshots of private conversations unless you want to solicit a dramatic reaction", "I didn’t say she needed to lie. But when OP was told somebody else’s child was no longer attended she should have at least encouraged to allow her child to attend. Instead she seemed to be perfectly fine with the idea that someone else would no longer attend as well. \n\nAnd again… that’s bad for all of the children.", "Money is a pretty damn good reason. The package included a certain number of people. The other girl wasn't family and, honestly, that would be a pretty big ask for family.", "\"no comment\" is a respectable response. Just saying. By continuing the convo the birthday party was absolutely disrupted.", "*autocucumber", "I also have trouble believing a provider could manage exactly 10 but not 11. That's not really a thing. Either the parent didn't want to pay for 11, or didn't want to include 11 for some reason of her own, then blamed the provider.", "Agree. Like getting their fingernails painted or whatever is more important than not hurting a little girl's feelings.", "I think if it’s your kid being left out, you go to bat as long as it’s not going to result in your kid being treated badly.\n\nClearly, at least some of the other families didn’t know this was going down and didn’t approve of this mom shunning OP’s kid. So it’s good OP made this known, to bring this toxic BS to light before it became a recurring theme. The other parents who backed out will probably be extra careful now to make sure OP’s kid isn’t excluded.\n\nNTA, OP—Addy’s mom brought this on them by being a jerk. Edit: grammar", "Sounds like your ego is easily bruised. I have a big social circle so not everyone can get invited to every single event/happening. Myself included, when I instigate things I try to keep a healthy rotation but I also don't calculate it like a maniac I go with feeling and I see my closest friends more often. I still care deeply for some people I see less often, but we can't all be on the same level of friendship/availability. I assume it's the same with most of my friends, can't be besties with all of 'em.", "Sometimes that's okay.  If it's a friendly coworker? Or a new friendship? Of course you aren't prioritized over people they know well and have established friendships with.\n\nSomeone who you thought knew you well and valued you as a friend?  Maybe just prioritize other activities.  Go if you don't have other things planned or are interested in the activity, but don't put people first who don't return the sentiment.  Also don't cut people out when they're happy to be friendly even if you aren't each other's top priority.  Just match the energy.", "What a piss poor attitude to have. Are you equally close with every single person in your life? Do you always invite every single one of your acquaintances to make sure everyone is included?", "Eh, back when I had limited space for my blow-out annual event (Friendsgiving...I lived in a small condo and could only provide space for 8 people plus me to sit down), I always invited a bunch of people and said \"first 8 to RSVP are in, waitlist after that.\" I always had a waitlist, and people always understood. When I bought a house and could open up the invite, I ended up with 15 guests for my first year. Hosting a formal meal like that for 15 (16 including me) is no mean feat, but they knew I could pull it off. :)\n\nFor this party, it sounds like the hosting mom could have done the spa part first, first 10 get in. Then we're all going to swim and eat, all comers welcome.", "I can tell you’ve never planned a wedding", "Sounds like you can't have acquaintances or casual friendships lol. \n\nYou don't have to come first all the time to be close with people.", "Yep self respect is worth a lot more than any amount of money\n\n. I was the only kid in the neighborhood to not get an invite to another kid's party (my brother and sister got one) \n\nI found out because everyone else was excited for the party, I mentioned I hadn't been invited, then a week later just before the party I was asked if I wanted to attend.\n\nI declined, saying I'd rather spend time alone, which apparently ruined the birthday party because the birthday kid was wondering what they did wrong after that I didn't like them 🤣", "Sometimes, but not always. If the event has only been discussed once, and its at something you were busy for, that doesnt necessarily mean they actively excluded you", "Exactly. She was obviously not invited. \nI don’t see a girl excited about her birthday “forgetting” to invite a close friend.", "Perhaps things have changed, but the only rule I recall about inviting every classmate was if a child was passing out invites during school. You could mail invites to whomever you wanted. That was a few years ago and a small school.", "I’m a first cousin and she was not only one of my bridesmaids and godmother to one of my children but we were extremely close into adulthood. Our mothers were SIL’s and friends. \n\nOnce my husband and I and our kids moved to the other side of the country it was out of sight out of mind on her part.", "So you wanted OP to cover for the other mom and be weird about it lmao.", "very possible there was some kind of groupon or some kind of discount if you ordered exactly 10, but even then, it wouldn’t be hard to talk to the provider as you said and just pay the full price for one extra person or something. i can’t imagine a small business  turning down a ten person job just because they don’t want to work on an 11th", "It’s absurd to me that you don’t notice men do this too.", "Excluding a single girl for the convenience of getting a ten girl spa session, is terrible. Did she reduce the package to five and toss the sixth girl when she got the cancellations? She had to have known this was going to create drama or at least hurt feelings. A lot of it could have been short cut by simply calling OP and letting her know the situation from the beginning and discussing how to best handle it, instead of letting her and the daughter find out second hand. It's really not cool to exclude a member of a group in a situation like that.", "This  comment is stolen from u/discofeverish https://www.reddit.com/r/AmItheAsshole/comments/14vc9yk/comment/jrcssr8/", "Yeah this is actually a really eye-opening exchange when it comes to why reddit is the way it is.\n\nTons of people apparently believe they should be the main character in the lives of everybody they know.", "Agreed. I know that I can be high ranking yo people but may be asked to do something after X person says no. Doesn't mean I'm bad... it just means they have other friends too which they are entitled to see. I do not need to be number one. Thinking that you should be first and turn down a second person invite just makes you kind of a crap friend that thinks you should be the whole world in that person's eyes.\n\nNo, sit down. The world doesn't revolve around you.", "Why decline? It’s okay not to be first in line in all relationships. You might still have some good mutual friends there to hang out with. You sound like a bitter berry.\n\nSome limited space event invitations first go to relatives. If some of them can’t make it, invitations are sent to friends. Doesn’t mean the friends don’t matter, it just means they don’t come before family. If you get an invite, you’re welcome to go, why would you turn that down?", "Don't let pride get in the way of being the places you want to be and doing the things you want to do.", "Yes. In my daughter school (and all the other schools in the whole country , I'v heard of my friends from the other towns), inviting the whole class/just the boys/girls is mandatory. I mean- not the written rules, but just the \"decent\" thing to do. You can additionally invite friends from the other activities, neighborhood, cousins etc., but never ever exclude kids from your class.", "I don't think it's just that. I suspect some people have gotten burned by realizing that the people they prioritize as their closest friends only think of them as a peripheral friend and now they can't handle any situation reminds them of that feeling. Whereas people who've had a solid circle of close friends for most of their lives aren't stressed out that there's plenty of people they're friendly with who don't consider them close friends because they aren't relying on those people's friendship for validation.", "Exactly this. I could only have x amount of people at my wedding. When some of the family we invited told us they couldn't make it, we sent out a few more invites to friends we were so glad we found now invite. It wasn't that these people weren't part of the plan, we were just limited.", ">Why decline? It’s okay not to be first in line in all relationships. You might still have some good mutual friends there to hang out with. \n\nTo add to this - sometimes people are just better friends with other people. They've spent more time together, or just had more they connect with over, have memories, have attended each other's to-do's - if you're trying to get closer to someone or you're interested in spending more time with them and their/your other friends, being bitter that you weren't a first-pick and declining to go when you ARE invited is self-defeating because you are opting out of also having shared memories and all that other good stuff.", "I had a paintball party for my son. I could only invite 10 people so I invited his soccer team. Not everyone RSVP’d. So I sent one more notice to the team, no additional RSVP’s. I then sent out an invite to his friends. Same situation. I then invited neighborhood kids. (Each set of invites had different RSVP dates). \n\nAll the kids that showed up were kids that we wanted at the party. The reason for the different sets of invites was because I didn’t want to only invite a few kids from each group and I wanted to make sure I had space. \n\nThe day before the birthday party I had several people ask if they could still come to the party. At that point, I said yes but told them the cost would be $40. Needless to say, they didn’t show. \n\nIf they had only RSVP’d on time, I would’ve paid for them.", "Agreed... pretty well every event has a hierarchy conditional on numbers... immediate family, extended family, friends, acquaintances.", "Because you weren't a part of the plan. This rule goes double for things that require people to pitch in for.", "I pick the fight because you’re wrong.", "Yeah we were trying to keep our wedding small (but had a minimum we had to pay for regardless) and thus no plus ones that we didn't know were invited and people were understanding of that. When a few people RSVP'd no we reached out to people and asked if they were still interested in bringing their partner - every single one thanked us for thinking of them and brought their SO along. It happens. Especially when the host is the one paying.", "And I have had house parties where people RSVP the day of the party. I’ve never refused anyone to a house party.", "Or sometimes space is limited. Specially for parties and weddings and such. I’m not saying Addys mom isn’t totally faultless. It’s rude to do a spa day knowing it’s a group of 11 girls and only 10 could join in. That was malicious intent. \nBut it’s also okay to have an A list and a B list of things don’t work out. Not everyone and everything can make you #1 priority all the time.", "If they didn’t remember then u weren’t that important", "Not all of us grew up in wealthy or even comfortable terms. \n\nPaying a pittance to give your child (and others) an opportunity they otherwise wouldn’t get and was only possible if everyone gave a little was vey much an opportunity appreciated by both parents and kids. \n\nThere is Nothing tacky about a community lifting together to raise the standard instead of just accepting living on dust even on days that are supposed to be celebrated.", "No I think your just making assumptions.  Let me try one more time to clear this up. \n\nIn my comment I was not comparing men and women. I was referring to typical though not exclusive behavior seen in women.\n\nIt is a fact that men and women are both competitive within a group dynamic. However typically this competitive behavior manifests differently in women than it does in men.\n\nWhere am I getting this from? College psychology. Here is an article from the association for psychological science about it.\n\nhttps://www.psychologicalscience.org/news/releases/mean-girls-and-queen-bees-females-under-threat-of-social-exclusion-respond-by-excluding-others-first.html\n\nI get where your heart is, I wish the world was all equal as well but the truth is that it is not and people with good hearts (like you) understanding why that is, is the first step in getting there. It is a lot easier to combat bullying when you understand why the person is behaving the way they do.", "She’s not wrong. That’s literally what happened here.", "Agreed. It's situational. Addy's mom was rude. It's is still ok to have an A/B list sometimes.", "It wasn't malicious. The birthday girl wanted a spa day, they could only do 10 girls someone had to be excluded. So was mom supposed to tell her daughter \"I know this is what you want and it's your birthday but you don't get what you want because we HAVE to invite everyone?\" It sucks being left out, I get it, but kids also shouldn't be pressured to include everyone just because. Trust me, being included because the parents forced the kid to include you is worse than not being included at all", "That’s what I was thinking. My grandparents have 62 grand kids and great grandkids. Probably 30ish of us adults actually all attend each other’s events, each of us having anywhere from 1-5 kids. Not one of us could afford to pay for everyone at a party like that. So we all pay our own way or get a group rate and pitch in. This way all of our kids and us get a good deal and a fun party to celebrate whatever we’re celebrating. I’ve never understood people who think this is tacky.", "Neither did I. \n\nI could understand this if you’re close friends or family, but asking school acquaintances to fund your party is tacky.\n\nEdit: also maybe *because* I grew up with “dust” as you say, I can’t imagine the intense shame my mom would feel having to tell a school friend of mine’s parents that she couldn’t afford to contribute.", "I think when the kids are 9 and all very close the right thing to do is to tell your kid that your friend’s hearts are more important than having a spa birthday. This wasn’t like there were 20 girls and only half got invited, this is a close group of 11 girls, and only 10 were invited. If this was no big deal, 4 other parents wouldn’t tell their own children you aren’t going because this is wrong. So yes- you are supposed to say no because people’s hearts are more important. Imagine what her daughter is going to feel like the next time all those girls are together and excitedly talking about the party- the one that she didn’t go to because she was the only one in the whole group who wasn’t invited. Additionally, as the parent booking the party, I would have told the staff- I want to book a party but we have 11 girls and are willing to pay for the extra but we can only do 11. If they couldn’t accommodate then I would have taken my daughter to the spa by herself as a mom & daughter day thing and figured out something else for the party or found another spa that could accommodate. Im sure the package probably included 10 and they could add one one. Imagine a bridal party with 11 people- are you just going to leave 1 bridesmaid home because 10 is the limit?! I guarantee these places are flexible bc they have groups coming and going all the time. This was Addy’s mom hurting a child bc the package was for 10 and it was easier to leave a child out than ask and pay for an add on. And as a mom, I can tell you that there is no way in hell that that child “wasn’t going to find out about” and hear all the details of that party. Imagine if that was your child and they now have to wonder why they were the 1 kid in the group of friends that was left out- on purpose too. How do you think that 9 year old feels about herself?", "NTA. I have a rule with my kids. They can either invite the whole class, all the girls, all the boys, or no more than 25% of the class if they want to pick and choose. That way they will never be having a party where a majority of the kids were invited but just a few were left out.", "Nta. You didn't have anything to do with other people deciding that they won't be apart of excluding a child. The fact that mom said \"I didn't think you'd find out\" is the calling card of every butt hole", "NTA. That mom was a major AH for inviting 9 out of 10 of her daughter’s classmates, and excluding just one. \n\nOur rule for our kids is that if they want to invite more than 50% of their same-gender classmates, they have to invite them all. Each of them has about 15 kids of their gender in their grade. My younger prefers smaller parties and usually invites 5-6 kids. My older likes big parties so has opted to invite all 15 + a few friends from other schools, so ~20 total. Leaving out just one kid and inviting everyone else is thoughtless.", "NTA. The mom should have known your daughter would find out she‘s the only one not invited. It‘s kinda cruel to do such a thing.", "NTA My kids attended a small school (about 16 or fewer per grade) and at this age, excluding just one is hurtful. I’m sure that the spa people would have added one more, had they been asked.", "Nta. She’s upset with the consequences of her own actions", "NTA\n I'm petty. I would invite everyone to a mimosa party and exclude Addy's mom. Hire a masseuse and post pics. Tell her there was a limit to how many could come and she just didn't pass the muster. Get the rest in on it too.", "Sarah already knew you weren’t invited, when your kid didn’t go, she’d have asked (or even before).  \n\nI am generally against inviting yourself but this was particularly weird if they’re all still close.  In what world wouldn’t daughter find out?   Utterly ridiculous to think otherwise.  \n\nEither that mom is TA or she’s covering that her daughter no longer likes yours, which only drags our more drama", "NTA\n\nBut Spa for 10 year olds? Is that normal now?", "Well, I think you acted trying to do what is best for your daughter. If my daughter was the only one not invited for a birthday class in a party I would ask the mother of the birthday girl as well, it can very well be bullying or something else like they were having a fight, in both cases as parent you should be aware of what happened. Probably Sarah doesn't see your daughter as a book club member anymore and it is ok, but they are still on the same class and see each other every day.\n\nOn the other hand I am not sure about sending prints of personal conversations with someone else, but Sarah's mother chose to alienate your daughter, so she has to deal with the consequences of her acts.", "NTA. She was being cruel. Her actions were found out, there were consequences.", "NTA you had every reason to think it was an oversight and you didn’t push or create upset you told one person who asked you.", "NTA. It was not your intention, you thought it was a mistake. It was their intention to leave your daughter out, against the group spirit. Sarah's mom felt strongly about this, which was right and few other moms supported her, and you. I would say this is rather a life lesson for the birthday girl & her mom. \n\nI am quite sure what ever the treatment was, they could have stretched it to 11 from 10, children wouldn't know what to expect so they could have arranged one more in. I can't imagine any business would refuse if you tell them one child would not be invited to the whole party because of them if they are not able to squeeze in one more.", "NTA, it hurts to find out about a social event to which you're not invited in this way even as an adult. You asked the question on your daughter's behalf and left it at that. You didn't tell four children not to attend", "NTA, you clearly didn’t set out to ruin a kid’s party. Addy’s mom on the other hand is a big a-hole.", "NTA because as a mom of an 8 year old girl, I probably would have done the same as you. \n\nBut I’m confused as to why the party-throwing mom didn’t ask for the spa person to let her add on just one more kid… and if they said no I’d come up with a new party plan that included ALL of the girls so nobody would feel left out. Also, there are 10 girls that are going to be at the party and one who wasn’t invited- and the party throwing mom thought the one wouldn’t find out? Has she MET children!? They talk a LOT. It was a given the uninvited one would find out.", "NTA and good on Sarah’s Mum for the solidarity to your daughter. That was very mean not to invite one kid and I would’ve asked in those circumstances, assuming it would’ve been an error.", "Here's my question: Why did this person book something that had a limit of 10 people knowing there were 11 children in here daughter's class?", "Nta. It’s a small class, of course your daughter is going to find out and of course you’re going to ask about it. You didn’t approach in a negative way whatsoever, only wanted to why and you got response. Whatever happened afterwards doesn’t have to do with you. Clearly she’s bothered because she expected a different outcome where people were more understanding towards why she only left one child out. She sucks.", "NTA, I do feel bad for the birthday girl though", "NTA.\n\nIn a class of 11, it is shitty to exclude one person and\n\n1. Not even bother to tell them\n2. Pull the \"you weren't supposed to find out\"\n\nIt's normal and reasonable that in a close or tight knight group, everyone is invited. It is pretty shitty to plan an event and exclude one person specifically. Given that other parents had pulled out and \"you weren't supposed to find out\", it is likely that they had been told that all of the girls were going only to find out that just one had been left out.\n\nAddy's mom had brought it upon herself. It's one thing to not be invited, it's another to \"not supposed to find out\" because that shows they were intending to not even have the courtesy of telling you.", "NTA. As there was nothing negative going on between the girls, it was reasonable to assume that the other parents had dropped the ball and forgotton that one girl wasn't at the book club. What wasn't reasonable was for the brithday girl's mother to assume that, in such a small group, your daughter wouldn't discover that she had been left out. What was her thought process, I wonder. \"Oh, we can only have ten places? Well, X doesn't come to book club all the time so that's easy, we'll just not invite her, we can give the invites out when she's not here, and pretend nothing is happening because, of course, none of the girls or their parents ever talk to each other.\" \n\nI might not have shown anyone else the exchange, just said \"they could only have ten so decided to limit it to the full-time book club.\" I can sort of see the corner that Addy's mum jammed herself into, though I have to wonder whether she spoke to the spa person and explained the situation. Sometimes, being nice, polite and offering to pay an extra amount to cover one more attendee in a case like this can be very helpful.", "NTA. You didn't push anything, and Addy's mum was out of line for knowingly (by her own admission) inviting all the kids bar one.\n\nI totally get that sometimes there is a numbers thing with parties, but I have never let my kids just leave out one or two people. It's everyone OR there's a reasonable enough amount NOT invited that no one can feel singled out.", "I don’t really think anyone is the AH here.\n\nI think texting and not speaking on the phone/in person left too much room for interpretation/second guessing.  \n\nI think it was an oversight but not malicious and if everyone had connected live maybe OP’s daughter could have joined post spa and/or the other mom could have just asked about the cost of one more.  \n\nThere were solutions available but communicating electronically on our phones, at least with those we don’t know intrinsically, can get needlessly messy.", "ESH Holy shit you guys. Get a job or a hobby or something. This is some insane Real Housewives meets The Prince crap. \n\nThis is all nonsense and means absolutely nothing. Go build a house with Habitat or… watch Jack Reacher on Amazon Prime. There are millions of better ways to spend your time and, more importantly, your emotional energy.", "Honestly by drawing attention to this and sharing conversations will more likely than not hurt your child more than good, you should have left it slone and yes i think YTA for causing drama.", "Yeah, my mom tried to get me into birthdays, too. She gave up when she realized that the other girls just didn't like me. Tough situation, but this is just life sometimes.", "NTA. You behaved in good faith, checked in if there was a mistake, accepted when there wasn't and told the truth without any embellishment to another mother. \n\nYou are not responsible for the behaviour of other mothers who have decided not to attend. You are also not responsible for the behaviour of the OG mum who decided to invite 10/11 children to a party. \n\nIt's absurd to me that she thought your child wouldn't find out about a party every other girl in her class went to. She knew your child would find out... she just didn't care. \n\nDoes she owe it to anyone to invite your child to a party? Nope. But honestly I cannot imagine being so meanspirited I'd leave one child out. \n\n&#x200B;\n\nAnyway - you have done nothing wrong.", "I wonder if Addy's mum made up the spa thing and the other mothers cottoned on to her antics?  \nI mean combining a pool party movie viewing with spa treatments? Outrageous!", "NTA Addy's mom caused the drama, I don't know why she thought the one girl who didn't get invited wouldn't find out. She probably didn't think she would be confronted and you're daughter would have just suffered in silence", "NTA.", "NTA - Abby’s mom was ok with leaving your daughter out for the convenience of a 10 person package. I bet she didn’t even check to see if they would allow one more to be added. I would hope she’s not dumb enough to actually believe you and your daughter wouldnt hear about this awesome party from either the other moms or kids. Also, you didn’t ask any of the other mom’s to do anything, they chose to stand up to Abby’s Mother’s petty act.", "Did the parents of the other 4 girls not attending specifically say it was because of the non inclusion? Or did they, you know, maybe have other plans that fell on the same day/time?", "NTA and the other mum is awesome in my opinion. She refused to let that happen to your daughter and did the right thing.", "Nta", "NTA, you politely inquired, and when Sarah's mom asked, you told the truth. No drama - this is on Abby's mom.\n\n>She responded that they had hired someone to do a spa for the girls during the party and the service had a limit of 10 so they decided to only do the girls in book club.\n\nAm I the only one here thinking that this children's birthday party thing is getting way out of hand? Why does a bunch of 9yos need a SPA service? Wouldn't they have been just as happy with playing in the pool and watching a movie? Then all of them could've attended.", "YTA.  Your daughter wasn't invited (for whatever reason) and you should never have pushed to get her invited.  You don't know what the repercussions might be at school for your daughter.  My mother did this to me when I was a child and it had terrible repercussions.  The birthday girl was my school bully and I did not want to go to the party.  But my sister was invited, so my mother called the birthday girl's mother and wangled an invitation for me too.  The bully made it very clear to everyone at the party that I was there under sufferance and I suffered for it at school.  This is one of those times when you should mind your own business and stay out of it, instead of trying to pave the way for your child.", "The fact that other parents took their children out of the party attendance, should tell you all you need to know! YNTA but I can see how you put your neck on the line to try and make your child involved. I respect that. \nI was that kid when I was younger - I was always left out.  I feel for yours. She will grow up to outshine them all tho ;)", "YTA. You knew you were starting drama when you sent a screenshot of a conversation between you and one person to a 3rd person", "I don't think you did anything wrong. NTA", "ESH. You shouldn’t have reached out, just make it a teachable moment for her. Bday girl’s mom bc she excluded only one girl from the class. People always find out.", "NTA, the fact the other mom did this and just hoped you and your daughter would not hear about the party is really sad and shows she knew what she was doing was not the right choice.  What she should have done is call and explain. There was probably a way to have your daughter still come to the pool party and movie part even if she might miss out on the spa part.  Or if it was a money thing I'm sure all the parents wouldn't have minded putting in $10ish so no one would be left out.  This really was on the other mom for not communicating and just hoping no one else talked about the party.", "YTA.\n\nYou actually said that you feel strongly about inviting yourself to things but when you got told the service they had was limited to 10 people you kicked up a stink and leaked dms to others to make sure everyone else felt the same.\n\nIf you truly felt strongly about inviting yourself then the sole response to we can't have more than 10 is \"I understand, I hope you have a great party and I hope abby has a great birthday\". Leaking the conversation to make someone else seem like the bad guy... makes you the bad guy.", "NTA about the party thing. You could have asked Sarah's mom to ask for you, but you did nothing wrong in any case.\n\n\nI don't like the word competitive for a 9 year old that is so intense she hasn't got enough time to read and attend some book club twice a month. \nReading is much more important than winning dance competitions in the long run. Kids should have a childhood and time for friends, not be this competitive. For that YTA.", "NTA. Addy's mom is awful.", "NAH I totally agree that you're not the A, obviously you were trying to find out what happened as your daughter hangs out with this group very often. But on the other side I'll give the other mom the benefit of the doubt. I'm just saying, maybe she was trying to follow her own daughter's birthday wishes doing the spa thing, that's why she didn't choose other activity, and for some reason it's very common that the service is given only up to 10 kids. Not the first time I hear this. Anyways she should have handled it differently, of course you two would've found out sooner than later, at least she should have invited her to the movie. Idk. if she never intended to invite you kid on the first place, that obviously creates drama on such a tight group, and of course the other mom is the A. Maybe an update on her side would help to find out. Like I said, benefit of the doubt until we have more info. Ps. Sorry for any grammar mistakes, not my first language.", "NTA, this is a difficult situation. You assumed the invite had been forgotten to be passed to your daughter & when you found out the situation you left it at that, you didn't push to get an invite. The mum of the birthday girl should've reached out to people in advance to booking the spa party to find out how many people would want to attend before booking something with a limit of 10 & then intentionally leaving 1 child out. You told Sarah's mum the truth of what happened & it's not your fault that she told others.", "NTA. \n\nI get it why people are saying you shouldn't have asked - but they're putting an adult slant on it. Kids give out stuff and forget to give it to absent kids all the time. \n\nIt's an unwritten rule isn't it that when you have a party, invite who you like but you don't just leave out one child. That's mean. The mum is at fault here for deliberately excluding one child, and then trying to keep it a secret when she has a 9 year old child for goodness sake. \n\nYou asked out of genuine confusion that it might have been missed, and another parent answered you assuming the same. How that can be dressed up as your fault I don't know.", "As a mother myself, I would want to know if one child from a friend group had been singled out to be excluded. I would not want to participate in hurting a kid like that, and would have been upset if I found out after the fact. \n\nOf course your daughter was going to find out. You don’t live on the moon. The only way she wouldn’t is if all the girls were told not to tell your daughter, which would have made Addy’s Mom look even worse. \n\nAddy’s mother received declined RSVPs because parents objected to her decision to exclude your daughter. She is trying to blame you because she apparently didn’t want the other parents to find out. That’s blaming a target for her own disappointing behavior. \n\nShe still feels no regret. \n\nI’m glad your daughter has you on her side. You didn’t quarrel. You reached out to determine if there was an oversight, and shared what happened with a friend. \n\nAddy’s mother has an opportunity to learn a life lesson, herself.", "NTA! You didnt ask anyone to do anything. Honestly im impressed at how all the moms banded together with you and stood up for your daughter! I dont think theyre evil for not inviting her, maybe they assumed she would be busy with dance, but the people who chose not to attend because of it must be pretty awesome to feel so strongly about your child being excluded from their group.", "NTA, but Addy’s mom is for thinking this is okay. You didn’t cause drama (although personally I wouldn’t have texted Addy’s mom), it was the other moms who decided their kids would not attend the party - and respect to them for it. \n\nInviting only some classmates = fine (especially in a large class)\n\nLeaving only one classmate without an invitation = YTA", "NTA as long as you legitimately thought it was just an oversight. I guess you could have just left it with Sarah's mom, hoping she would ask. I'm not sure why Addy's mom thought you wouldn't find out if the kids are all friends. Of course you would find out. Also, you taught Addy's mom a valuable lesson-- when you do shitty things, things usually get messy.", "I'm going with NTA. It's fair to assume she was missed by accident. And I personally think it's cruel to exclude one child, especially if everyone else is invited. It happened to my daughter once. The child in question was handing out invites to the whole class. When she got to my daughter she ripped up the invite and said ' you can't come. My mum doesn't like your mum so I don't like you' \nMy daughter wouldnt have gone anyway because didn't like the child, but that was unnecessarily cruel . Although not surprising as her mother was the same.", "I’d say Sarah’s mom is TA for stirring up drama", "NTA\n\nthe other girls not attending wasn't your choice, that was their/their parents' choice (mainly Sarah's) so i don't see how that can be your fault.\n\nnot inviting one child is pretty mean, and expecting them 'not to find out' is plain stupid - she's in a class of 10 other people who are *all* going - they're gonna talk about it! Addy's mom did exclude a child. so she is the root cause of this problem. she excluded your kid and hoped you would never know.\n\nyou didn't really try to invite your own kid either. you were checking in case there was a mistake (cause i mean, we're human - often it is just a mistake) so i don't see what you did wrong.", "NTA\n\n1. Its easily possible that a invite gets missed. Asking and being told and accepting is totally fine.\n2. The other mom escalated it for some reason and TBH I wouldn't have shared the direct convo with someone else but just said that it was fine and left it at that.", "NTA. \nI agree with you on inviting oneself, and especially as kids grow up they start to have their own affinities and preferences regarding with whom they want to spend time. And especially for their birthday I think they should have a say in whom they don’t want to invite. But this did seem to be the case. It wasn’t the bday girl who excluded your daughter, it was her mother, for whom it was easier to just exclude one child that to find an alternative. And her “didn’t think you’d find out” is silly, especially since the girls go to school together, not just the book club. \n\nAnd YOU weren’t campaigning for other girls to decline, it seems to have been Sarah’s mom. \n\nAll this being said some girls or mothers might not like the fact that your daughter doesn’t attend the same book club sessions as everyone else. It may disturb the dynamic of the group or they may feel they are wasting time when your daughter goes occasionally. (At best she goes half the times, when she doesn’t go a quarter of the times).", "Absolutely! May be your daughter is not such a good friend and was not invited! All the drama shows me where she gets it from.", "If it is only 12 girls in the group the party girl mom should make sure to reserve a place were all the girls could go. If it cant be that spa, well there are other places. They go to school together, is normal your child will find out. You question was honest. If it was a big group then you shouldnt ask, but in a small group like that one is norml to think what you thought. That the invitation was given on a day your child didnt go and they forgot to send it. The A here is the party mother that excluded your daughter.", "NTA. As someone who was bullied in a small school and the only one in the class not invited to numerous birthday parties and get togethers- that shit stings. I hope that other mom learns her lesson.", "From what you've told us, you asked politely and then didn't insist she be allowed to go or encourage anyone else to not go.\n\nNTA", "Nta", "NTA. when I [25F] was 8 years old [give or take], I started at a new school. About halfway through the year, I received an invite to a classmate's birthday party and responded that I'd be there. He sent an email back saying that including me in the email list was a mistake, but he'd ask his mom, and then a following email with the same \"capacity\" excuse. 15+ years later, and I still remember how devastated I felt. \n\nThis mother is projecting her own weird bullshit onto children. There's no reason that in a group that small, a child should be excluded. They will remember, but they don't have the cognitive development to understand why. You stuck up for your kiddo, that's important.", "I’m holding my judgement. Yes it was mean to invite 10 out of the 11 girls in the year but…these are kids from book club. your kid a competitive dancer - I can’t see that they would have much in common.\n\nHave you ever wondered why your daughter? You say “*we*all get along well” almost like you’re living your life for your daughter. Could it be that your child is similar to you? You come across as a bit overbearing. Could it be that the other kids find her just too much, and don’t want to be around her. It sounds like they’re not really friends either with her demanding schedule if she only attends book club once a week.", "NTA - what they did was mean and they shouldn’t be surprised if other people don’t want to endorse their meanness once they knew about it.", "ESH im a litle baffled by all the NTA.\n\nThe way I see it, grownups are doing \"whos the asshole here\" dance while the kids are the one suffering.\n\nThe birthay mom, you and sarahs mom ruined the kids party.\nThis would have been avoided if she called sll 11 girls, yes.\nThis could have alsone been avoided if you didnt stir the pot.\nAnd this could have been avoided if Sarahs mom didnt donwhat she did.\n\nMaking 4 parents stop their kids from going to a friends b-day? Yeah reall class!", "YTA. \n\nIt was fine for you to reach out to ask if your daughter not being invited was a mistake. However it was an AH move to then send screenshots of the conversation to a third party. The only reason to do this was to stir shit & cause problems. \n\nWhen you were asked if you had the issue sorted all you needed to say was yes it's all sorted. Nothing else.", "I don’t think it was wrong at all not to invite your kid. But I also don’t think she can blame the whole thing on you because other moms agreed with you. NTA just an unfortunate situation there’s not always a bad guy", "NTA.  Nah, I get you might feel guilty reaching out but you didn't do anything wrong really.  In fact, you reaching out and the fallout are UNRELATED.\n\n  \nSo even if you feel guilty for reaching out, it's unconnected to the other parents' feeling that it's not fair.", "NTA\n\nI like Sarah’s mom", "Or you know, Abby hates Ops kid and left her out of a party and is perfectly nice when at the book club because the kid isn't an asshole and doesn't have to be mean to people they don't like.\n\nAbby doesn't want her at her birthday party so doesn't invite her. Mother makes up story to let OPs kid feel less bad about not being invited, OP decides to put her on blast and all but demand an invite despite supposedly being \"strongly against inviting yourself to events\".", "If OP’s kid hardly attends book club, Addys mom is more than welcome to view OPs kid as redundant.  However Addys mom should have at least contacted OP initially.", "Same. The options were to summarise and potentially misrepresent what happened, giving Addy’s mum the opportunity to say ‘that’s not what I said’ or…lie and cover for the woman excluding her child? \n\n‘Here is what she said’ with no comment seems much more polite and concise to me.", "Right how is screenshot any different than perfectly retelling what they said? It just leaves less chance for embellishments, its more honest to just send the screenshot.", "I agree with the original message, but I don’t know how to feel about the edit.. you yourself are saying you don’t feel like the person is TA but you’re writing that they are? I’m sorry, I’m confused", "This happened to me in grade 3. Every girl in the class except me was invited to a girls party. My mom called as well to confirm it wasn’t an oversight and was told it was numbers. I also had the comment from my mom that these are life lessons, and took me out to McDonalds. I’m 40 and I still recall how I felt being left out.", ">(but sending the screenshot of a private conversation to someone else is a mistake so watch out next time)\n\nThe result would've been the same if OP had just verbally related the contents of the texts, IMO. Sending the screenshots didn't do anything just talking about it wouldn't have done.\n\nOP did right by her daughter, and that's the important thing. Abby's mom having her attempt at secrecy blow up in her face is on her, not anyone else.", "it seems like neither op nor her daughter even asked though. Sarah brought it up to OP's daughter, then told her mom about what happened, then her mom in good faith recommended a course of action, then OP went on to make sure her daughter wasn't being (and probably feeling) left out because of an oversight.\n\nbday girl's mom answers, and OP accepts and says not a word about it to anyone but her daughter to explain and give her a good life lesson, until Sarah's mom follows up. OP just repeats the explanation she was given, and the rest was completely out of her control.\n\nso her daughter got information that she could not have, in good conscience, not followed up on with bday girl's mom. even if your food for though were perfect, that's still a lot to explain to and expect of a little kid.", "I'm reminded of that one Big Little Lies episode.", "Can I just throw in please don't always decline because of a late invite. My scatter brained self (my mom died recently) forgot to send invites to my older kids' friends for my younger kid's bday party. I sent late invites..literally two days before it was happening. Thankfully, one of them was able to show so my older kids weren't feeling awkward or left out. (Party was at a public venue.)", "For grownups okay, for kids? I don't know", "Late invite? Your host could be neuro divergent and forgot about you!", "She accepted the answer? No she didn't, she told her it was wrong then leaked teh conversation to hurt her. IN what world is that accepting the answer.", "In what universe does your kid not wanting to invite someone they're not close to to their birthday party make you a \"garbage person\"?", "This comment needs to be higher. I agree.", "She did drop it. She told her daughter she couldn’t be invited to everything. She didn’t tell anyone else except to respond to Sarah’s mum.\n\nSarah’s mum asked for information. I get the sense that if OP had refused to give more context than ‘we aren’t invited’ the outcome would have been the same. Sarah’s mum wasn’t interested in a party where one kid was excluded, and she wanted to know if that was the case. She then let some other mums know.", "I suspect she knew they'd find out and just didn't care until there were consequences for her child.", "She wasn’t not invited because of friendship dynamics tho, as the moms agreed their kids get along and even the other little girl was like “why mom?” If she had seen any drama unfold she wouldn’t be asking why her friend wasn’t invited", ">It's tacky to ask why your child wasn't invited, hell maybe the other girl's mom simply doesn't like your child, that's perfectly fair, they're allowed to invite whomever they want to their events.\n\nIt's a group of like 11. Not a parent, but if I had to deal with a parent petty enough to specifically not invite *one* child from a group of 11 that are relatively close, no dramas, no falling outs, etc. I would probably pull out too because that is just immature and shisty behavior.", "You should have sent her a message explaining why you declined! \n\nThat said, my daughter has people in her class she wouldn't want at a party. She just has smaller parties.", "I was on OP's side until she mentioned that her daughter left the book club to focus on competitive dancing.\n\nNothing wrong with that at all.\n\nHowever, the other girls are consistently involved in the book club, so it makes sense they all received invites and OP's daughter didn't.", ">Your daughter doesn't attend book club regularly due to her other activities. The Mom decided to limit to the girls who are regular participants in the club. That's fine.\n\nThis is what moved the needle for me too.", "👏🏻 Agreed", "She thought she wouldn’t find out until AFTER the event. She wouldn’t be stupid enough to think one of the 10 girls would never mention anything, she just hoped it would be too late when they did.", "The fact that the 2 main activities do not limit the number of attendees, makes it worse for me. NTA", "You did nothing wrong. Even if you're paying per person unless there is some history of bullying between the kids you invite everyone or far less than the whole group. You don't leave one person out.", "Cool, so when's the cookout you're having for all of us? Remember, you're evil if you don't invite literally everyone.", "Unless there is some past history of the kid not being invited as the bully. You don't have to invite your child's bully to a party to be fair. It's natural consequences.\n\nWithout that history it's cruel to exclude one child.", "I’m saying I’m confused why other people are saying she’s an AH for sending a screenshot. I send screenshots of convos myself all the time just to convey easily, quickly, and accurately what someone says so I was just saying it’s confusing to me that people are saying sending someone’s exact words makes you an AH, but somehow paraphrasing doesn’t.", "Agreed. It might just have been an oversight, people forget stuff. Talking to each other can solve a lot of problems.", "No, declining for an event where you were purposefully the only one left out for absolutely no reason tha  they didn't want you there, it's not toxic to decline. OP's daughter is still part of the book club, so Addy's mom was lying about how they \"limited\" it. Which is why the other mom's likelyulled their girls from that because they knew Adfy's mom was up to some shit for whatever reason. \n\nIdk what's happening exactly but Addy does for some reason not want OP's kid around. Inflicting yourself on someone who so clearly doesn't want you there is some self-hating shit.", "Getting a late invite can come off as you being a backup because someone they wanted couldn't come, but they still wanna pad out numbers.\n\nThough it heavily depends on the scenario around why it was late", "Guess we know someone who doesn’t have any self respect…", "I'm sorry but the other parents are 100% allowed to make their own judgement here. Excluding a single child in a group is something skeevy shit and thankfully four other parents can see that. Nothing OP can do will heal this group because she isn't the one who broke it. Addy's mom is. But it says a lot that you can't see that and think OP is responsible.", "The fact that other moms didn’t want their kids to attend anymore because your daughter was excluded solidifies NTA. They know something is up and that this wasn’t just an oversight. If it was harmless the other moms would not have done this.", "Lol what are you talking about.", "Given the number of other parents that also pulled out, they (as parents) probably expected that all 11 girls would have been going, not just one being excluded. \n\nIf 3 - 4 people out of a group of 10 pull out from your party or event because of something you did or failed to tell someone, that's just on you. The other parents probably sensed something shady was going on but didn't have any proof/confirmation or have convictions they stand by.", "If several people have to be left out because of space/financial constraints it's one thing. To leave out just one kid is such awful behaviour. \n\nI was the only person a classmate didn't invite to her sisters' wedding. Maybe because we only had home room together. Everyone else had a least one class with her. \n\nStill I was only one person & I got asked repeatedly about my plans. Only to have to keep telling people I wasn't invited. Noone ever asked why I was left out or took the slightest notice. \n\nOPs' daughter is going to remember this and she'll remember that Sarah and 4 friends stood up for her.", "> I’m really sorry but there’s a numbers limit and it kinda fell this way, why don’t you bring your daughter over a separate day to make it clear she’s still a valued friend.”\n\nBecause she's not, obviously. If the girl having the party really liked her, she'd have been invited. Just because their school is small doesn't mean all of the girls are required to be friends and it doesn't make them a bad person to not invite someone to their party if they dont particularly care for them.", "This. 👆\n\nIf Abby's mom had some level of communication skills things would have been much smoother. But excluding a single child is the worst thing I can think of in any given situation of this sort. It's like buying 12 donuts for a group of 13 and saying \"Jim, you can't have any because I didn't see a point in getting a whole other box for one person.\"", "When the other mom says when confronted \" I didn't think you'd find out\" that's pretty clear the ops child is being excluded on purpose", "Right? That’s so embarrassing", "Who wants them to be competitive? Do they request it themselves or are you pushing? I find it a bit worrisome that your kid doesn't have enough time to read and attend an event with friends every two weeks.\nYour children should have a childhood and time to be with friends, children are not there for the parents to show off with them.\n\nIf they want it themselves and have fun doing it and don't just do it to please you  then that's perfectly ok, but competitive hobbies that leave little time for other things should not be pushed by parents but should be something coming only from the kids themselves.", "How is it any different than exactly retelling the conversation?", "My only fear is that the four friends will be mad at her because their moms made them skip it. Hopefully the parents have good conversations around this and why we don’t go to things that leave someone out unjustly so they get it and do stand with her instead of feeling upset with her.", ">dy’s mom created the drama the moment she chose to leave just one child out. I can’t help but feel there’s an untold, mean-spirited reason behind it; I just can’t imagine any mom thinking this was an acceptable idea. I would never do something this unkind to a kid this age.  \n>  \n>295ReplyGive AwardShareReportSaveFollow\n\nYup, I organise events all the time. You can generally squeeze someone else in. You have to pay but you can do it.", "There’s a difference between ‘observing this kind of behaviour’ and ‘typical of women’.\n\nCome on now.", "I was waiting for this comment! It’s one thing if you, as an adult, “would never” ask about whether you’re invited to party, or would decide not to go b/c you weren’t a first choice, etc. But it’s a very different thing when you’re talking about one child being left out of an otherwise “all class” bday party. One might be considered bad manners or lack of insight, whereas the other is mom advocacy, which I think is perfectly appropriate — as long as it’s not done for drama, but in a peaceful, friendly, “let’s make sure this small community is doing right by all its members” kinda way.", ">Not everything is some huge melodrama  \n\nIf ever this sub needs a new tag line on the banner, this is it", "Except none of the situations you mention here are a single 9yo purposefully being excluded from a group she belongs to.", "Or, perhaps perhaps perhaps, choose to do something that doesn’t have an attendance limit?  I cannot understand this way of thinking about children’s parties. Nothing needs to be ‘exclusive’. Last time I noticed, public swimming pools are large enough to fit eleven little girls. The birthday girl’s mother is the AH, which she then reinforces by accusing OP of ruining the party. I’m concerned about the nuclear fall-out impacting these girls and their friendships. That birthday girl’s mother has dirt on her hands.", "Right? I feel like maybe the people who are apparently sooooo offended by a late invite or not getting invited to an event maybe don't know a lot of people? When I turned 40 during the pandemic there was max of 10 at restaurants and 25 in private residences. I had 2 separate parties and still didn't get to invite everyone I wanted. \n\nEven now, I wouldn't be able to fit everyone I wanted in my house and I certainly wouldn't be able to foot the bill for all of them at a restaurant. I just have a lot of different friends from very different segments of my life.", "You literally can't be close to 100 people. There is research on this, and it is way smaller number of people you can be close to, but of course you can have many friends you don't want to exclude. \n\nMy brother is very popular and has a huge friend group because he just is genuinely a great guy. They would like to get married with his gf, but keep postponing it because of the cost of the wedding.. they have tried narrowing down the number of guests but it would still be over 300 so they just stay engaged for now 😆 Perhaps they will elope one day.", "Why? Maybe it's a cultural thing (I'm not American) but here it is completely normal to do that. \n\nEvents are expensive and venues have limits. If you can invite 50 people, you can invite basicly just close family and friends. That doesn't mean you wouldn't like to have your fun coworker or nice neighbor there, but if it's grandma or that one friend from high school who moved cities, it's gonna be grandma. \n\nIf grandma can't make it though, I don't see why it's wrong to go \"Oh but now I have the resources to invite that one friend I'd really like to catch up with\"! \n\nI would not feel slighted at all if that were to happen to me and I've been that person who invited someone from the \"back-up\" list and people were happy to be invited.", "Yep. Had a coworker who I didn’t really care for got engaged and invited almost our entire staff to the wedding. She and her guy both worked with us. Me and my then BF (now husband) we’re not invited, but we were cool with it, we weren’t really friends with her like some other coworkers. \n\nSo three days before the wedding she approached me to say “hey, we had you and bf on the C list and we had a cancellation so you can come the wedding.” Yep. Now you see why I didn’t care for her. \n\nShe had her head so far up her own ass she didn’t realize my stepsister was also getting married the same day and we would be out of town for the wedding. My response: “oh we’ll be in (another state) for my sister’s wedding. But thank you anyway. Guess it’s time to pull out the D list.” \n\nAlso her marriage didn’t work out.", "My kid walked aroubd with an invite in his backpack for a freaking week because that kid wasn't at school the day he brought the invites. Kids forget, the kid in OP's story is 9 not 16 and it's summer vacation so they probably don't see each other every day. Perfectly reasonable to think that maybe there was a missed connection somewhere if they're the group that always invites each other to things.", "It depends on exactly how competitive. In very competitive environments the nice ones are often trained by their parents to bend to their will. I have some examples in my kids class, not dancing, other hobbies, that are done by the request of the parents. Lots of them as adults will tell you of their childhood being abusive. Lots of stories out there. \nIt's not good for kids beyond a certain point of pressure. \n\nIf it's still relaxed and fun they enjoy doing it  that's one thing, but if they are pushed and do it only to please their parents, that not ok anymore.", "You clearly have no idea about competitive dance. Most dance studios have competition teams where kids can compete in group ensembles or do solo dances. They have heaps of fun and often end up going away for weekends together to do this. My kids do it too. The group comps teach them so much about work ethic and having fun with your team mates (whether that's onstage or in the pool at the hotel), and the solo comps teach them about working towards a goal, and how to be a good winner or loser. They also make lots of friends from other studios doing it and have an absolute blast. One of mine begged for solos for 2 years before I said yes, and they have so much fun on competition days with all their dance friends. \n\nYour comment is like saying kids shouldn't be on a soccer team or netball team, as that's their parents showing them off. The dancers who do comps (which are really commonplace at most studios I know) are just normal kids who love what they do. The parents are mostly very tired mums and dads who support them, and make some friendships along the way. Not everything is as you see on TV.", "My daughter was a competitive dancer  and gymnast for a lot of years. She wanted to do it because she loved it. Now she’s a lot older and doesn’t want to do comps anymore. She still does dance (RAD) and gymnastics but doesn’t compete. She still puts on shows cause she loves it but she doesn’t want to spend hours practicing for competition especially as academic workload increases. Most parents go with what their kids want. Sure there are some who pushes their kids but in my experience of being in the scene for the last 12 years in 2 different countries, most kids love it and do it because they want to.", "Same reason why recording conversations in most states are illegal.", "Yeah - ‘not expecting you to find out’ is ridiculous. If 10 girls have a shared fun experience they’re going to talk about it - OP’s daughter was always going to feel horribly excluded eventually. Addy’s mum just means she hoped they wouldn’t find out *before*.\n\nIf your child has 10 friends and the party idea only has room for 9, you do something else. Her daughter is 9, she didn’t need a professional spa experience. You don’t make another child totally miserable and lonely for it. Grab some face masks and nail varnish and have all the kids over.", "Honestly I'm surprised at how willingly some people give advice on how to cut other people off for some minor slights/jabs.\n\nI understand it's just their own perspective, but so many people advise burning entire bridges over small issues or \"red flags\" that pop up completely from their own inferred versions of events. It's a bit ridiculous.", "Except the previous comment wasn’t about this specific situation, it was about generally getting a late invite or offer when someone else drops out.", "Years ago a friend of mine late invited my parents to her wedding because some older relatives had to cancel last minute. My parents weren't offended   .The wedding was a very small event due to costs.", "In this case, because the mom is purposefully leaving only one person out of a birthday party for no good reason.", "> You sound like a bitter berry.\n\nHow are they bitter for choosing happiness over being a pity invite where no one really wants them around?", "Exactly this.", "Generally, if invitations are handed out in a classroom, it's polite to invite everyone.\n\nIf invitations are handed out off-site or mailed, it's fine to do a smaller group. If your kid has issues with one particular child or group of kids, you just mail the invites as to not cause problems in the classroom.", "Yeah, most of the popular people I know got there by appreciating this.", "Yeah, like I might have to invite my shitty aunt out of obligation, but her saying no lets my old friend from high school come", "Especially with weddings where there are a lot of people you „have“ to invite paired with space limitations of venues, getting a late invite doesn’t automatically mean not being wanted there.", "TBH, getting a late invite can be a bit of an honor depending on situation. A space opened up with a group of people that decided you (an acquaintance or not close friend) were the one they'd like to have and grow a relationship with. You are there cause they want you and not because of prior obligation.", "Friends before extended family though, no?", "Yep. There's maybe half a dozen ppl I would be hurt if I wasn't invited to their wedding (assuming it was nothing more than, you're just not in my top 100 favourite ppl). Any invitation I got beyond them I'd be flattered that they **did** count me in their top 100. Last minute invite? I'm pleased our friendship has grown so much in the time between issuing invites and someone dropping out that you thought of me.", "That's not how it works here. You're inviting all the girls or nobody (you can throw  your birthday party with just the family, cousins and neighborhood friends and it's nobody's business, but inviting classmates means you're inviting all of them).   \nFortunately my daughter is very \"easy -going\" and liked by her friends. Also school takes the active part in ensuring that every child is included in the activities and when there are the issues between kids, teachers are actively stepping in and helping to fix it.   \nI always talk to my daughter before the party, reminding her, that she should take care of all her little guests, especially when e.g. a new kid in the class is invited. That it is her role as a good host to make everybody welcomed and included in plays and fun.   \nOf course she has her favourite \"BFF\". But we can make a playdate or sleep-over to them anytime. The birthday party is for all the kids.", "Depends on the event and the person. And the friends and the family. Personally my best friend comes equal billing with immediate family, then other friends, then extended family.", "Yta.", "Soft YTA here. You did indeed create drama, albeit unintentionally, simply by forwarding that private convo between you & Addy's mom. That was between you two, nobody else's business. As soon as you were told there was no oversight, that your daughter wasn't invited, you should have got right on planning something special for her, like taking her somewhere she enjoys or has been wanting to go to. When Sarah's mom asked you about the status, all you needed to say is that you two were in touch & unfortunately it wasn't going to work out for your daughter to attend, that's the breaks. If she pressed, you either don't reply, or just let her know you had already made plans for that day anyways. You also got a life lesson out of this experience,... Always trust your gut,... You were uncomfortable with the idea of reaching out to Addy's mom about this, but talked yourself into believing it may have been an oversight, so you went thru with it.", "YTA\n\n* You weren't invited\n* Upon being told about the limit and that you weren't invited on purpose you still pushed\n* You prioritized dancing over the book club, book club friends are at the party. Live with the consequences and teach your child about them\n* You made your child the least wanted friend by prioritizing the dancing, do you think anyone wants her at the party? She's just not that good of a friend to the others. \n\nIt sounds like your child would rather be in the book club than a competitive dancer.", "YTA. Parties are for friends, not randoms. Respect boundaries and don't ruin someone's special day.", "YTA for sharing the screenshot. It sucks, but it happens. She was only allowed 10 spots for the spa, so she excluded the person who was there the least. Sounds completely fair. Maybe your kid has a friend at dance who has a birthday coming up? Either way, it's a good lesson for the kid: You can't always get what you want", "How did she think your daughter wouldn’t find out if everyone else was going? What an arse hole", "NTA. You didn’t tell the other moms not to send their daughters.", "NTA. My guess would be that Addy’s mom just didn’t think it would be that big of a deal, like, “Oh, you can only take ten? I guess we’ll just do the book club girls then.” This was, obviously, a miscalculation on her part, and it would be smarter for her to admit her mistake than to be upset that others found out that she had made one. Honestly, though, I really feel like she should have known that it was time for a change of plans the second she realized that she didn’t want you to find out about the party.", "NTA", "NTA   \n\n\nFor me the general rule when inviting kids to parties is that either you exclude the majority or everyone is invited. If you have limited space you have to make sure that the majority of the class is not invited because then the kids not invited won't feel like they are the only one.", "So in short, you and 4 other mums separately decided  that Addy’s mum wasn’t being fair and Addy’s mum blamed you for inciting a protest? \n\nNTA", "NTA. I would also assume, they might simply forget... and I agree with Sarah, that it is not ok to left out one girl from the group.", "NTA. \nI hope Addy's mom is just surprised and disappointed and therefore trying to blame you, but will see this and then around and let it go. I DO understand why this is a disappointment for both Addy and her mom.\n\nIs she TA? Dunno. It wasn't very insightful of her to exclude just one girl. She should've known better. But after this had been pointed out, she should've done everything in her power to make the spa accept the 11th girl and maybe adjust the program a bit. I would not expect the mom to cancel the spa. Another option would be to let your daughter skip the spa part but let her attend the rest of the party. Still sad for your kid, but it's a compromise and you can explain this to your daughter. You sound very sensible and I think she would understand and appreciate what she CAN attend. But this is just an idea.\n\nLastly... I think it's a very nice gesture of the other moms to have their daughters not attend, but on the other hand is this not very nice for Addy (it's not her fault) and it's kind of harsh for Addy's mom. I think it was an honest mistake, a wrong choice. I DO think it's up to Addy's mom to fix it, but tbh, the only people coming close to being TA are the moms who don't let their girls attend.\n\nI hope it all works out for you all.", "NTA\n\nYou didn't ruin anything. The mother of the girl did by not inviting your daughter and when other mums found out that your daughter was not invited they stood in alliance with you. \n\nAlso to the people saying they wouldn't care if they weren't invited you aren't a 9 year old anymore and think back when you were that age and tell me you wouldn't have been upset if you were the only one not invited.", "NTA, you didn’t ruin the party, the other mom made a choice, that’s all. Sucks for her kid though. Can’t she let her kid have a say in this? Fucking hell. I can’t deal with all these parents who get too involved in their kids’ drama. They’re kids. There’ll be drama. It’ll go away someday. \n\nAlso, what is up with all these parents making a fuss about birthday parties? If your kid isn’t invited, you teach them that sometimes, people don’t want to include you, and that if they don’t, then they don’t value you and aren’t worth your time. You don’t try to fight to get them invited. They will just hate your child more than they do, and exclude them the next chance they get. You can’t force friendship. And anyways, it’s just completely rude to do. Not saying it was applicable here, as the other mom told you your kid might be invited. But in general. This isn’t the first time kid birthday parties cause problems. Man, I’ve had friends all go to this one girl’s birthday party. I wasn’t invited. Didn’t know the girl. I didn’t make a fuss, I didn’t feel rejected. It’s just life. No one wants a person they don’t know/appreciate at their birthday party. Y’all are treating these parties as if they’de diplomatic meetings, and not a get together with the people your child cares about. Stop.", "NTA. Unfortunate situation but not your fault.", "NTA, but don't be the AH by thinking your daughter is entitled to go", "I don’t think it was wrong to make the assumption you and Sarah’s mother did that your daughter’s invite was lost in the shuffle. \n\nTo top it off it was and AH move of the parent to exclude only one child and assume kids won’t talk to her about it (anyone with kids knows they spill the beans on EVERYTHING to EVERYBODY). I get budgeting and space issues are real concerns but so is the dynamic and feelings of children in friend groups. You exclude one and everyone knows about it, sometimes the other kids can pick up on that and mirror the behavior without knowing why. That could be messy for both the one excludee, and the excluder and other involved kids. \n\n\nWhen things get messy between adults, things get messy for their kids who did nothing wrong.", "NTA - excluding just one girl is really cruel. And the other moms could see that and decided to pull their girls out, without you suggesting it.", "NTA -\n10 out of 11? She was being rude doing such a thing.", "Excluding just one girl is weird, nta", "NTA. That is really shitty to exclude one child when there are no known issues with their relationship, especially as she does still attend book club, just not as frequently as the others. I would tell my child to pick something else to do if it meant excluding one of his friends from his birthday party. The other mum ruined the party by being sneaky and stupidly expecting that you and your daughter wouldn't find out.", "NTA. I know people are bringing up the screenshot but I don't think Sarah's mother would have taken 'no we're not invited' differently anyway. She still would have talked to other parents about it and the outcome would be the same.\n\nYou asked a reasonable question and were given an answer. You taught your daughter how to deal with that answer. You did nothing wrong.", "NTA AT ALL . Sarah's mom took concern and you spoke sincerely with her with no real agenda. \"Maybe they forgot\" was pretty reasonable in this specific instance. It's not like you confronted her thinking \"my daughter deserves to go and I will ensure that she does\" even it would obviously put y'all out a bit to not get the invite. \n\n  \nWhen Sarah's mom took interest herself, what are you supposed to do, lie/omit things to make someone else's bad decisions look good? \"Oh, we talked about it but decided my daughter would just not go\" would be misleading/false and Sarah's mom would have questions anyway. Sending a screenshot is quite direct but there's actually less room for telephone game/miscommunicating what Addy's mom said, compared to if you had just given your own recollection. I can totally see a case for giving a gracious/generous summary, but in this specific case Sarah's mom would have still reasonably wanted to ask, \"so if the talk went well, why did you decide your daughter wasn't going?\" or \"so they really didn't have a good reason not to invite your daughter, it was just the booking thing?\" or whatever. I doubt the outcome would have been any different, honestly.\n\nYou helped your own daughter adjust to the idea of not going. You made the right calls there.", "NTA. It's only 11 girls, all except your daughter got an invite, and she wasn't present when they were distributed. It was okay for you to call if there was an oversight. You can't control the other mothers' reactions. They chose to not attend as a mark of solidarity, and send a social message to the other mother, who did the wrong thing by booking a service that would exclude one girl (a shit move, btw). It's a learning experience for all.", "NTA\n\nThat was really crappy of Addy's mom, and you didn't ruin anything. You asked her, she answered, and if anyone else dropped out of the party,  it's because of her behaviour, not yours.", "NTA. Honestly, I don't blame you for approaching Addy's mother. I can only imagine how horrible it would've felt for your daughter for everyone in the class discussing the party the next day at school, and your daughter having no idea what they were talking about.\n\nJust be careful, Addy might be a bit upset at your daughter for 'ruining' her party. She might  not understand the whole situation due to her age.", "NTA.  \n\n\nBut I would recommend a course of fixing the damage - take into account, this comes from someone who is not a parent, but I do work in a teaching position with kids around the same age and been on the sidelines for a few instances of drama between parents over the years.  \n\n\nAnd if its not put to rest and the fire of the drama stopped, it can potentially keep coming up and making the relationship between you parents, and as a result, your kids, strained.  \n\n\nI'd recommend doing something along the line of making a group message to everybody in the parent group with a text along the following.  \n\n\n\"Hey everybody.  \n\n\nIt has come to my attention that my daughters lack of invitation to Addy's birthday party has lead to some conflict and a few of you in sympathy having cancelled your daugthers participation in the party. While I appreciate and is touched by the sympathy, I would love this not to become a point of conflict and drama.  \n\n\nAddy's parents, as I understand it, acted on a wish from Addy to have a spa event at her birthday party, and the service they was able to find for it had a hard limit of 10 attending. While sad not to have my daugher invited, they made a judgement call to invite the 9 others in the book club to the event, in order to give Addy the birthday party she wanted. They did not do it to be mean to me or my daughter, just to as parents make the wish of their daughter come true on her birthday.   \n\n\nWhile you may or may not agree if that was the right call on their behalf, lets not pretend any of us are perfect and make the right decision all the time; For instance it was maybe not the right call of me to share the conversation I had with Addy's mom about it, leading it to get further shared and putting many of you in a position of feeling you had to take sides, I apologize for putting you in that position and to Addy's parents for impacting what should been just a happy day for their daughter to celebrate her birthday\"  \n\n\nThat got a bit longwinded, dont know if you could summarize it more, and maybe call/text Addy's parents first about it and make sure they fine with it too; Would be a shame if their tight knit group dissolves from a single instance of a bad judgement", "NTA\n\n>Edit: my daughter does still attend book club once per month to once every other month. She didn’t totally leave. She’s just not a full time member.\n\n>Sarah’s mom said Addy had handed them out at the last book club and had probably just forgot to reach out.\n\nThis seems plausible. If she didn't attend the book club anymore, I wouldn't ask about the invitation. But she is part of the book club, so it seemed like a mistake.\n\nSarah's mom made the decision to share this with other moms. And they decided not to let their children go. This is not your fault.", "I may get downvoted a lot for this but NTA and props to Sarah's mom for standing up to it. Her point is right they did hire someone knowing only one girl would be left out. I don't think it was wrong of you to contact her I don't see anything wrong in asking her why your daughter was excluded.", "You are in absolutely NO WAY the AH!!! Don't apologize!! You looked out for your kid, had she not known about it beforehand ( like the mom intended, didn't think you'd find out cause little girls are going to talk) she would have definitely caught wind about I it later, making her feel bad she was the ONLY one not invited ... Addy's mom sucks and was probably a mean girl, props to Sarah's mom for telling the group!  Nothing in this situation is your fault and you are definitely not the AH! Kudos to the other parents that pulled their kids out of this mean girl shit... I wouldn't my kid to participate in a party that only one girl was excluded from, it's a teaching moment as a parent to always consider the people around you and don't be exclusive. Addy's mom ruined the party by not inviting your daughter! You're a good mom, NTA", "I- This gets worse by the second. So Addy's mom intended to pull off the other girls to a spa without ever informing the other parents of this until after the fact? At this point I don't think your kid being excluded is the only reason the other moms pulled theirs. This feels off so badly in so many ways.", "No, you did nothing wrong. NTA", "You didn’t do anything wrong. As another commenter said, sending the screenshot was the best thing you could do to explain the situation to the other mom, because you showed her exactly how it played out. There’s no room for concern that you might have misrepresented what happened. \n\nThe fact that several other girls’ moms have pulled them from the party is proof that you’re NTA and the bday girl’s mom is TA. Excluding just one girl from a tight-knit group is plain mean. Bday girl’s mom is mad because she knows she did something wrong, she just didn’t expect to get caught. But it was delusional of her to think that she could exclude one girl from this party and no one would find out.", "‘It’s not personal, it’s just that I can only have 20 people max, there are 21 in the grade, and you are the one I like the least so you miss out - but it’s not *personal*, it’s numbers!’\n\nI understand numbers when you can only have 10 and there are 25 kids to choose from, no one is going to be close to everyone, but finding out you are dead last in the friend order? That shit stings forever.", "Screenshot is even better than telling your own version of what happened. Let people make up their own mind with the evidence provided.", "1) Thie isn't an event with adult, but little girls.\n\n2) OP's daughter is the only one in the group left our and without a good reason.", "I agree with the two first, don't go, don't ask, but I would totally go to the late invite. It's not a problem for me if I was not first choice. Noone can be everyone's first choice. I do have close friends, and friends who are less close. I have fun with all of them.", "> Wouldn’t a class this small have a mandatory invite-all rule? \n\nSounds very Orwellian, telling kids they have to invite who Big Brother wants and not who they want.", "The biggest thing to remember is that Addys mom had the opportunity to reach out to you and explain why she was hosting a party that had a limited number of invites, she made the choice not to do that and she has to know that for a young child, competitive dancer or not your daughter is still a child, it is very traumatic to be the only one left out of an event that your entire peer group is invited to. \n\nThere is no reason when she first put this together that she could not have reached out to you. \n\nIt is unfortunate that Addy is being punished for her Mom’s behavior, and I can understand how sick to your stomach you feel right now about what Addy is going through. \n\nIf you like you can always invite Addy to a play date with your daughter where they go to the movies or do something else to celebrate Addy’s birthday so that she understands that nothing that is happening has anything to do with her. \n\nYou can even arrange for a delivery of something fun like flowers to come to her house on her birthday so the little girl on the other side of this (Addy) isn’t left feeling bad either. And this way you can make Addy feel happy, without having to deal with Addy’s mom. \n\nWhat you can’t do is make Addys mom be a more compassionate person, and that is OK", "Where did you get that the girls aren’t close?", "And? Everyone at school sees everyone else, do you think that means they're obligated to be friends with everyone and be forced to do stuff with them outs of school?", "They go to school together and the OP said the girls are all close in this small grade. I can’t imagine this once a week book club is some difference maker.", "But when it’s 10 out of 11 kids being included, that’s exclusion in my opinion.", "It means you are not among their very closest friends, but that they like you. Unless it's someone you thought was your BFF, or if like here a whole friend group  EXCEPT one was originally invited, I don't see the problem with that.", "But that’s not what this is. You’re an adult. Inviting every 9-year old girl in a class EXCEPT for one is very mean. And to expect that the other girls wouldn’t talk about it is delusional.", "Not asking because you weren't told is far from respecting yourself.", "More like pride or insecurity you don’t need a code each situation has nuance", "For an adult I’d be inclined to agree but not for kids this age. They’d have all gone to the party and talked about it in class afterwards. It’s messed up. Parent should have done something that everyone could be included in", "I mean, I wasn’t invited to a thing just cause the host didn’t realise I was back in the country - so sometimes it pays to get a mutual to ask :)", "Did you miss the part about it being a small school \"with only 11 girls in her grade\"? So yeah, it was all the girls in her class except for one.", "Just out of curiosity, if she’d typed the convo out verbatim with ‘I said this’ and ‘then she said this’ in the middle of it would it be more acceptable in your eyes?", "I think the bottom line is the adults behaved in a way that made everything worse and that'll probably cause negativity between the girls. \n\nSomeone upthread referred to the moms as behaving like the Real Housewives and frankly, I think that's spot on.", "OP's kid wasn't shunned, she is facing the natural consequences of being a competitive dancer (really a competitive anything) as a child. OP isn't a  asshole, though I don't think she should have asked, but the life lesson isn't \"we can't expect to be invited every time\", it's \"competitive dancing means your social life and relationships will suffer\". I don't see why it's toxic to not invite a kid who only shows up for a shared activity once every other month; it was OP and her daughter who distanced themselves to prioritize another activity.", "Lovey you don't have 100 close friends you have 100 acquaintances with whom you engage in transactional favours on a quid pro quo basis. That doesn't qualify as afriendship let alone close one.\n\nI'm assuming you're young & still in the stage of life where quantity beats quality. That won't last. Maybe start being more selective in your choices or you'll run the risk of ending up with no real friends. Ask anyone in that position & they'll tell you it's not a fun place to be.", "No, no they didn't cancel.   \n\n\nInvites often go out piece meal for lots of reasons. \n\n People decide to invite the 5 ppl that they know the contact info for and  get the rest of the addresses later.  Kids have a list that is totally complete and then show up sobbing the next day because they totally forgot their 3rd best friend. Some ppl get contacted by email. Some by text. Some by note. Someone got divorced and they don't have the kids that week and take a while to get back. Kid doesn't tell you that Clara and Claira are actually two different kids.   \n\n\nTaking a slightly late invite as a personal slight is a rigid and self-defeating approach.", "Eh, sometimes staggering invites can happen, like with events where you are inviting a lot of friends from different parts of your life and the planning is a bit adhoc.\n\nAlso, sometimes people wait to invite you for a reason. Why bother texting you today for plans next week, if Im seeing you tommorow and can invite you in person then?\n\nPlus, sometimes plans change. Maybe your friends were going to do something you are known not to like and that you never show up to (say, clubbing or hiking). The plan falls through due to unforseen circumstances (rainining makes the hike impossible, the club is closed for a private event) and they end up doing something else, which you actually like. Would you say no just because you werent originally invited, when there is a perfectly valid reason?", "It could be. But when you see each other every day that's different", "It’s way more common than you’d think.", "There are genuine invitations and invitations out of politeness, that have to be honored nevertheless. At my wedding, there was one cousin I wanted to attend. For keeping peace in the family, I however invited all of them. If one of them would‘ve said, he/she wouldn’t come, I would’ve invited someone else.", "Yeah that isn't self respect, that's main character shit.", "The words out of my mouth. It’s okay to not be close to everyone, I’d still take a late invite. It’s not that deep/", "yes, you can still have a good time, maybe even strengthen the relationship since they were glad you could come", "Yeah \"I didn't get invited in the first batch of invites so I don't even WANNA go, for my SELF RESPECT\" is some petty insecure stuff. \n\n&#x200B;\n\nHowabout \"if you get an invite and it seems fun and you can go, think about maybe going and don't base it on social signaling/whether you think you are being valued enough as a friend/needing to feel popular\"", "Yep.  My one friend gave me B-list status updates until enough relatives declined that she could invite me. Her parents paid. Their friends came before the couple’s, sadly.  \n\nOP is NTA.  My kids’ school had a rule about this, and it didn’t matter where the invitations were handed out. If you invited more than one or two classmates, you had to invite the entire class.", "There is a great difference between pride and self-respect.", "Omg she actually told you you were on the C list!!! Great response though, ask the people on the D list 🤣🤣", "Rubbish. So much generalisation. My kids would be laughing at this idea. And most dance parents I know would be laughing at being accused of bending our kids to our will! It's usually the other way around, and we are being dragged along for the ride! Not saying it never happens, but in 12+ years at a studio, I would say I know 1 or maybe 2 parents like you are describing, and literally hundreds who are pretty normal and have normal kids who just love dance.", "Also for events like weddings, sometimes you're sending out invites a year before the wedding. Relationships change in that time.\n\nThere's a couple that were originally just evening guests of my wedding and we became such good friends with them in the following few months that we were actually super excited when someone else cancelled and we got to invite them to the whole day.", "I feel like weddings are different though, there's so much family obligation and political shite around them. I got a late invite to a friend's wedding which she told me straight up was due to family politics, and I didn't mind at all. Not sure if that'd translate well to a party, but I suppose everyone is different!", "My wife and I did the exact same. We had a max capacity of 50 guests, and invited our very dearest friends and family to attend. When some guests canceled 2 months in advance, we sent out a select number of invites to family friends who we didn’t originally have space for. They said yes, and it was such a joy to have as many loved ones as possible attend our wedding. One couple in particular were my sister’s best friend’s parents, whom I’ve known for 25 years. I’m so incredibly thankful that they could be there, even if it was only possible because other dear friends couldn’t be.", "I'm suspicious about the claim that the person doing the spa day for a nine-year-olds birthday party has a strict limit of ten.  I'm surprised no one else has questioned this.\n\nAlong with that, I find it odd that out of ten girls invited to the party, four of them have been pulled out, presumably by the mothers after OP shared the screen shot of the birthday girl's mother's explanation for excluding OP's daughter.  It sounds like there is some undercurrents of tension between the mothers of this little group of classmates.\n\nAm I being overly suspicious and reading too much into things?", "Yes. Refusing to participate, and missing out, because you weren't top of the list is pride lol", "Yeah I absolutely agree with this. It's not always an afterthought. Years back a friend of mine, was getting married with limited numbers so I was only invited to the reception. A-OK with me. Couple of people dropped out in the days before and he invited me to the wedding since a space had opened up.  \n\nWasn't for a second offended about not being invited originally, quite the opposite. I was actually quite touched that a space had come up and he thought of me.", "And some families, like mine, are so large that extended family gets subdivided. My hierarchy would be something like:\n\nClose immediate family\n\nClose friends\n\nClose extended family\n\nOther friends\n\nModerately close extended family\n\nDistant, but liked, extended family\n\nCoworkers and acquaintances\n\nExtended family of whom I have a neutral opinion\n\nDisliked family \n\n(I counted my maternal relatives recently. ONLY including living blood or adopted family, there are 46 descendants of my maternal grandparents. Once you add spouses and step-children, the number is closer to 90. My dad had the same number of siblings as my mom, so that side is about the same.)"]}