{"id": 21843, "submission_id": "14vryba", "title": "AITA for telling my friend her jealousy is not my fault nor my problem?", "selftext": "I (22F) have known Jen (22F) for 7 years. We went to the same high school and kept it touch a bit when we went off to different universities.\n\nLast night, Jen send me a long text about how I am plotting against her and making her feel jealous. The way she wrote it, she said it was **my** fault and **I** did this to her so she expected me to change. I told her that I'm sorry she feels this way but it's not my fault she's jealous and it's not my problem to fix it either. She called me an asshole and a bad friend because she thinks it is my problem to fix for making her feel that way.\n\nI think what made Jen blow up was this week I hung out with my uni friends but didn't invite Jen because she previously told me she disliked them. I'm not sure what Jen wants me to do here because we both have friend groups we don't invite each other in. It's normal.\n\nOther than that, in a very long text, Jen said that I deliberately make her feel jealous by   \na. being 'skinny and pretty' while she struggles to lose weight  \nb. having high grades while she is barely passing and getting into a 'better' uni than her  \nc. having guys (including her past crushes) confess to me  \nd. having a full time job while she is still looking  \ne. now dating a guy she had a crush on during elementary school who she expects me to not have dated at all to preserve her feelings\n\nWhile I feel bad for her, a lot of these things I can't help or I have worked really hard towards. I get good grades because I study hard while she chooses not to study and I go to the gym regularly. It's hard to hear someone complain about your successes and make you feel you don't deserve them when you worked hard for them. \n\nI am not plotting to ruin her life. On the contrary, I helped her with her studies, cleaned up her resume, and helped her apply to jobs. I think I've been a good friend to her these years but it's not my job to fix her insecurities. \n\nShe told our mutuals about this and they think I was an asshole for disregarding her feelings and telling her she can't/shouldn't feel that way. I'm pretty angry about this whole situation so I thought an outsiders' POV would help.\n\nAITA?", "created_utc": 1688990184, "permalink": "/r/AmItheAsshole/comments/14vryba/aita_for_telling_my_friend_her_jealousy_is_not_my/", "score": 58, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) telling my friend that her jealousy is not my problem or my fault\n2) I may be the asshole because I disregarded her feelings and refused to help fix the issue\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. If your mutual friends are so concerned for her allow them to continously attempt to pump up her popped tires of self worth. It looks like you need some new friends. I wish you the best of luck.", "NTA. Jen is not your friend, she’s an energy vampire who clearly attends the Jonah Hill School of Accountability. Drop Jen and anyone who thinks she has a point.", "NTA. Your friendship with Jen may have run its course.  It happens.  Don't engage further.", "NTA\n\nYou can't fix her problems.  I'd stop helping her, to be honest.", "You NTA.\n\n🤪JEN🤪 IS DISFUNCTIONAL - There, I helped 👏", "INFO: What exactly did you say to her that made everyone around you think you’re TA?  It’s pretty hard to judge this when you’ve painted a completely one-sided picture where you couldn’t possibly be TA yet everyone with knowledge of both sides of the situation thinks otherwise.", "NTA\n\nIt's clear she has a lot of insecurities, and while as a friend it's nice to be supportive of her trying to work through them, and do things like avoid making comments about food or weight in for of her, for example, you shouldn't have to change how you go about your own life and navigate everything around her insecurities.", "NTA. Unless you specifically promised not to do those things (which would be insane if her to ask and insane if you to agree to), you’re under no obligation. It sounds like she can’t take responsibility.", "WTF ?       \nDefinitely NTA         \nHer problems are exactly that.        \nHER problems.         \nIf she wants to feel better about her life she needs to try and make her life better not expect you make yours worse", "🚩🚩🚩", "NTA\n\nHonestly, it sounds like she is using you as a target for all her unhappiness at her own life.", "NTA I would text Jen and let her know that if this is how she feels about you then it’s time for you guys to take a step back from this friendship for a while. Ask her specifically what she wants you to do to “fix” it. Does she want you to start gaining weight? Not try in school? Quit your job?", "NTA. Ditch the “friend”, she isn’t worth the headache of dealing with her.", "NTA, her being jealous of what you have doesn’t make it your fault", "NTA - I would be very weirded out if a friend ever said any of this mess to me. She wants you to get ugly and live under a bridge alone indefinitely?", "NTA.\n\nDoes she expect you to deliberately become a loser just to protect her feelings? she's the AH.", "> I'm not sure what Jen wants me to do here because we both have friend groups we don't invite each other in. It's normal.\n\nShe expects you to coddle her, to not have a life outside of her, and to never have any successes. If that sounds ridiculous than good you're several steps ahead of some people who some how arrive at thinking that's reasonable. \n\nYour \"friend\" wants you to stagnate for her own benefit, and that is a bad look. To say otherwise is at the very most charitable a codependent behaviour.\n\nNTA", "You are both growing up and clearly growing apart.\n\nAfter reading though many of the comments, it doesn appear that you are intentionally sabotaging her.\n\nHer grades are her problem.  Her weight is her problem. Dating her elementary (or even HS) crush is her problem.  You are a few yrs out of HS.\n\nYour mutuals friends either don't know the whole story and only have heard Jen's version.  Do not get into it with them.  If they wanted to know they would have talked to you to find out you side.\n\nI think Jen is actually upset as she probably as admire you and been jealous of you for a while.  Now it is all coming to a head and you two are growing apart.\n\nNTA", "Tell u a secret,She is not your friend u think she is. Stay away from her, jealousy can't be treated.", ">She told our mutuals about this and they think I was an asshole for disregarding her feelings and telling her she can't/shouldn't feel that way. \n\nInfo: How did you respond to her text messages? Because it's weird that all your mutual friends think that you disregarded her feelings and told her she shouldn't feel that way.", "INFO: Did you tell her she shouldn't be jealous, or just that it's not your responsibility to address it?\n\nYou don't have the right to tell her what to feel, and she doesn't have the right to tell you what to do.\n\nAlso I'm pretty sure this is all about 'e' but again, of course it's natural for her to envy you but of course it's not reasonable for you to 'suck' at life to make her feel better.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (22F) have known Jen (22F) for 7 years. We went to the same high school and kept it touch a bit when we went off to different universities.\n\nLast night, Jen send me a long text about how I am plotting against her and making her feel jealous. The way she wrote it, she said it was **my** fault and **I** did this to her so she expected me to change. I told her that I'm sorry she feels this way but it's not my fault she's jealous and it's not my problem to fix it either. She called me an asshole and a bad friend because she thinks it is my problem to fix for making her feel that way.\n\nI think what made Jen blow up was this week I hung out with my uni friends but didn't invite Jen because she previously told me she disliked them. I'm not sure what Jen wants me to do here because we both have friend groups we don't invite each other in. It's normal.\n\nOther than that, in a very long text, Jen said that I deliberately make her feel jealous by   \na. being 'skinny and pretty' while she struggles to lose weight  \nb. having high grades while she is barely passing and getting into a 'better' uni than her  \nc. having guys (including her past crushes) confess to me  \nd. having a full time job while she is still looking  \ne. now dating a guy she had a crush on during elementary school who she expects me to not have dated at all to preserve her feelings\n\nWhile I feel bad for her, a lot of these things I can't help or I have worked really hard towards. I get good grades because I study hard while she chooses not to study and I go to the gym regularly. It's hard to hear someone complain about your successes and make you feel you don't deserve them when you worked hard for them. \n\nI am not plotting to ruin her life. On the contrary, I helped her with her studies, cleaned up her resume, and helped her apply to jobs. I think I've been a good friend to her these years but it's not my job to fix her insecurities. \n\nShe told our mutuals about this and they think I was an asshole for disregarding her feelings and telling her she can't/shouldn't feel that way. I'm pretty angry about this whole situation so I thought an outsiders' POV would help.\n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "I don’t get how this is an issue at all. Imagine playing a sport, and asking your friend to not perform well on purpose (and that’s a game,  not life). Big NTA-anyone that expects friends not to do their best cause it makes them envious doesn’t have their head on straight, or at very least, is very entitled. Your friend should look at ways to improve themselves, not for their friends to hold themselves back so they can feel better", "NTA.\n\nI'm immediately wondering if she is having some sort of mental event that's making her lash out because this seems a bit extreme for anyone.", "NTA. Obviously, you or anyone else can't be making her feel in a certain way, only her own thoughts can, as feelings are based on one's own thoughts on a subject. At the moment, it looks like she can't think straight and so could benefit from therapy, but I very much doubt she'd like to hear that advice from you. And her feeling that you are plotting against her is a big red flag.\n\nDid you literally said that she can't or shouldn't feel that way? Well, she can feel that way, as she obviously does... And that she shouldn't... well, feelings don't magically  change by just wishing they shouldn't be there. \n\nIf you kind of defended yourself by saying that you worked hard for your accomplishments, it may sound in her ears that you in fact accused her of not working hard enough. So, perhaps that's what your mutuals meant by saying that you disregarded her feelings?  \n\n\nAnyway, NTA.", "NTA.\n\nMisery loves company. Your \"friend\" thinks she can even things out and make herself feel better by dragging you down with her. Do not let her.", "*I am not plotting to ruin her life*\n\nBut she is kinda plotting to ruin yours. So far she is attacking you for your weight, grades, boyfriends, University acceptance and Job. If she cannot elevate herfelf in some way she will find a way to bring you down, it may be time to start distancing yourself from this one.", "NTA OP, and please cut off all those individuals who are helping fuel her insanity.", "What is your “friend’ on? Does she actually expects you to give up your life so she can have a shot at what you have? You are who you are and she can’t take your identity!\n\nNTA", "NTA - sounds like Jen needs to get into therapy.", "No you are not\nIt is NOT your fault she feels that way.\nYou need new friends", "NTA - don't ever let someone make you live smaller just to feel better about themselves", "NTA.  She's self-sabotaging and lashing out at you for the results of it.  It might be time to start distancing yourself from her and those who were backing her because she'll just keep using you as her punching bag until/unless she changes.", "Jesus Christ. Jen sounds insufferably obnoxious. She should learn the world doesn’t revolve around her. If she’s unhappy with weight and looks, she should change her diet and do some regular workout and change her lifestyle. None of that is your fault. Neither is the other stuff.\n\nI get that she probably feels that all this comes easy for you; when in reality most is probably a product of more effort and a healthier lifestyle.\n\nShe suffers from main character syndrome, the world doesn’t revolve around her. Maybe go low contact with her for a while. \n\nNTA. Good luck!", "NTA. Your friend needs to grow up. Like, who cares if you are dating her elementary school crush. Who cares if you are skinny? Not all guys like skinny women. Maybe they do not like her for her personality.", "INFO: You said that Jen said you are “deliberately skinny and pretty to make her feel bad.” This is an insane statement. There is a massive difference between saying this and “well that’s what she meant”. So when she accused you of this, what did she say, word for word?", "Sorry, but she doesn't sound like a friend worth keeping. I mean, you don't have to go out of your way to say awful things, but you can leave it that you make no plans with her, but if you run into her because of shared friends, it's \"Hey!\" then move on.\n\nIt's not you job to police her insecurities related to your successes. It's ridiculous to even put it out there.\n\nNTA", "I told her that I'm sorry she feels that way but this isn't my fault and I'm not sure what she expected me to do. I told her I don't think I did anything wrong and I don't see anything I have to change. She can't blame me for her insecurities and her perception of herself. I told her this is something she has to work on herself and she shouldn't feel jealous towards a friend.  \nOur mutuals think I should try to change and make her feel better and not disregard her feelings.", "This lol. Unless everyone around OP is insane or blind, I can’t believe none of OP’s friends sided with her.", "I said both to her, that friends shouldn't be jealous of friends and it also isn't my problem to address and fix.", "By what, sacrificing your own health and grades to pump up her ego? She needs to get over herself, maybe go see a therapist instead of making you the reason she's dissatisfied with her life.", "She is projecting her issues onto you. Don’t let her. Also, those friends suck. Sorry but it’s the truth.\n\nI see this all the time: people are upset about something about themselves or unhappy with their life and instead of making the effort to change, they demand others to change so they can feel better about themselves.\n\nIt’s unhealthy, it’s ridiculous, it’s unfair and it’s not really how the world works, nor should it. They need to learn that change needs to come from within, to make the effort and improve, which will in turn hopefully make them happier. Asking others to change just produces more entitled assholes.", "There is something seriously wrong in these mutuals if they at all think this is remotely reasonable", "How do they want you to change?  It still feels like you’re leaving out a big piece of the story.  Obviously it would be wrong if they wanted you to get fat and to stop studying so your grades dropped.  But if what they’re saying is that it would be nice if you spent five minutes of a conversation not either bragging about your own life or lecturing other people on how their lives would be better if they were more like you, then there may be merit to their criticism.", "My friends who don't know her side with me, but our mutuals she told this about think I should change and try to make her feel better.", "Also can't Wrap my head around that. I mean Sure perhaps OP is doing some Voodoo or witchcraft to make Jen fat, dumb and Not really lovable. Shame on you OP \n\n😂 NTA you don't need These people.Stay true to yourself", "They mentioned I could try to make her feel better by hanging out with my uni friends less and not wear dresses and skirts around her but baggy clothes but I don't think I should have to do that. Also I don't brag about my life or lecture people. I'm just trying to live my own life and do my best.\n\nEdit: I'm also not rubbing in her face that I hang out with other people or something. She just sees my instagram stories hanging out with other people and I don't think I should have to hide my social life either.  \nSorry if I sound a bit heated, I'm just frustrated about this situation.", "She is the one who needs to change to feel better, instead of blaming you for her problems. You study hard, exercise, apply yourself. You reap the benefits of that. She doesn’t try very hard at anything. And not a healthy and positive friendship either. Are you to be her whipping post?", "Change what?", "Change how, gulp down calories and fail in the exam, quit job lmao...\nNta", "Thats ba. The things she’s complaining about are (mostly) about her life choices and lifestyle. Making her feel better is not on you. Maybe you need better friends.", "Jen needs to see a therapist and you need to be careful around her. She has made you the scapegoat for all her anxieties and sounds like she is going off the rails. \n\nNTA", "That sounds like a controlling boyfriend 🤣🤭.", "Your friendship group sounds weird and controlling. Unless you're missing something out it sounds like you'd be better off without them. Maybe you should start hanging out with your uni friends _more_!", "They said I should try to do things to make her feel better about herself like hanging out with my other friends less and not wear dresses/skirts but baggier clothes around her.", "I don't know if I'm missing something. Maybe she told them something I don't know? I tried explaining my side but they said my side doesn't matter in this situation because she's the one who feels bad and I should make her feel better and tip toe around her because I 'have it better'.", "They're crabs in a bucket trying to keep the one near the top of the bucket (OP) from escaping.", "The only thing you need to change is your friends (as in, these mutual friends who are telling you to lessen yourself)", "I think you know the inappropriate nature of that request.", "Just ditch everyone. Including Jen. Seriously, it will be better for you on the long run.", "Or instead just stop hanging out with her or sharing anything about your life with her.", "That’s incredibly misogynistic.", "lol no. tell them you’ll put a paper bag on your head just as soon as they do. \n\ntbh at first i thought she had some sort of late night breakdown and sent that text (to your ex or your dad or whoever) you never wanna actually send, but involving other people is doubling down on some seriously troubling behaviour imo. nta.", "Your friends are a figurative crab bucket. (When one crab tries to escape, the others pull it back)", "Your side does matter op.  She needs therapy for her insecurity", "They’re just shitty friends. She’s making drama and they want it to go away, so they’re telling you not to rock the boat.\n\nIt’s incredibly toxic. Ditch them."]}