{"id": 21854, "submission_id": "14vytwl", "title": "AITA for thinking my mom wants my boyfriend?", "selftext": "My boyfriend (M20) and I (F21) have been together for almost two years. We live in different countries but manage to see each other almost every other month. My mom was overjoyed when I told her I have a boyfriend, because he is my first everything and I’m not usually a social person. She was even happier when I told her he was coming over to visit. \n\nThis was about half a year into our relationship. She came with me to pick him up at the airport, and from the very beginning she was acting weird. Kept making negative comments about me in front of him, trying to prove that she’s so much better. My boyfriend was obviously weirded out by her behavior, but he was still polite and even gifted her a chocolate from his home country. When we get to my apartment after a two hour drive, I expect her to just let us out of the car and she’ll be on her way. But no. She follows us inside. She proceeds to show him around my apartment as if it were her own. \n\nMonths later I come back from a trip to his country. She picks me up at the airport, and is relatively quiet for a while in the car back home. I start talking about things me and him did, recalling amazing memories I made with him. She starts talking about how she’s done the exact same things with multiple men. And of course that it was way more romantic. I dont even know what to respond at that point so im just quiet for the rest of the ride. When we get to my apartment, I show her some of the things I bought, like chocolate. Then I show her a stuffed animal my boyfriend got me as a gift. She immediately grabs it, hugs it tightly, gives it a kiss and smells it. While not letting go of the stuffed animal, she looks at the chocolate I bought, the exact same my boyfriend got for her the first time he was here. She tells me she hasn’t eaten her chocolate yet, that its a gift that means so much to her that she can’t eat it. Keeping it makes her feel like he’s still here, like she has a part of him. \n\nAbout a month ago my boyfriend came to visit again, this time for longer. Because we wanted to see more of my family, we had to stay at my mom’s place for a few nights. We ended up spending a lot of time with my sister. We planned things to do together just the three of us. When my mom got to know this, it was almost like she gave us the silent treatment - especially towards my sister, because she took my mom’s place. However my mom kept making it obvious she felt left out. This became even more obvious when we wanted to go to the beach. To make a long story short, she got very offended that we wanted to be by ourselves at the beach. My mom is closing in on 50. We’re in our early 20s and usually I have no problem hanging out with my mom, but this is a bit different. \n\nI dont know what to make of this situation and maybe its more common than I make it out to be, but like I said this is my first boyfriend, and her first son-in-law.", "created_utc": 1689006594, "permalink": "/r/AmItheAsshole/comments/14vytwl/aita_for_thinking_my_mom_wants_my_boyfriend/", "score": 34, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1. Judging my mom and putting her in a potential bad light. \n2. My mom is just being a mom and affectionate, maybe im overracting.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. But I actually think your mom is a Narcissist, not interested in your boyfriend. This is the first time that you have had an (serious) affection other than her and that is a threat especially if you are good “supply.” \nI know this because the behaviors are focused on YOU … slighting YOU in front of him…. Making the stuffed animal uncomfortable with just you…. Etc.\n\nYour BF is from another country which means she might lost you eventually semi-permanently if this goes well.\n\nTime to set some MAJOR boundaries, again, not to protect your relationship with your new man, but to untangle yourself from a predatory mother.", "NTA, that's some weird ass shit.", "NTA, Seriously sounds like your mother is jealous and missing her youth. Perhaps she needs to find a nice man of her own. Maybe help her set up a dating profile? If her behavior continues you may need to put some distance between her and you bf when ever he visits. If she asks why, tell her you both feel uncomfortable with her behavior. I would also refrain from discussing your time with him in her presence.", "NTA, no offence your mum sounds really weird and manipulative", "I don't think she wants your boyfriend, it kinda sounds like she's viewing this as some kind of competition, which she needs to seek help with. This is weird erratic behavior that will cause your bf to run away. \n\nNTA.", "NTA - Sounds like Mom has a couple of screws loose.", "NTA. Your mom is being weird. Does she act likes this towards other boyfriends your sister has had? It’s no problem thinking that this may be the case.", "NTA - if I had to guess, it’s probably less that she wants your specific boyfriend and more of a mid-life crisis deal where she’s single (I assume?) in her 50’s. That being said, it’s weird and uncomfortable and she needs to knock it off", "Nta, you’re a grown woman and she should let you make your own decisions, her behaviour on top of that seems even more odd.", "NTA - please voice this out, to both your partner and your mum. Not at the same time though.   Also ask your partner what he feels about the situation, does he agree/disagree? Etc. It's really odd behaviour, like very abnormal.", "NTA\nWhether she is sexually attracted to him or is so grateful to him for being with you or something else… she is batshit", "NTA.  I don't think your mom wants your bf,  I think she misses being young and in love and is trying to feel this again through your relationship.   She does need to back off and let you grow up and make your own decisions.", "Has your mom actually DONE anything to try to break up the relationship?", "NTA She's being super creepy. This story would make much more sense if she was your preteen little sister and not your 50 year old mom. Sounds like she's feeling her age.", "NTA, but I don't think she wants him. Sounds like she's just very insecure about being older and jealous of you for being to experience young love whereas she never can again. \n\nWell, actually, the sniffing the stuffed animal thing is kind of weird actually, and the \"keeping a part of him\" thing with the chocolate. So maybe you're right. Jeez...weird situation.", "NTA but it couldn’t be more obvious your mother is obsessed with him or obsessed with the fact that you’re getting attention and she isn’t. \n\nFor the love of god stop involving her in anything you guys do. Jesus.", "NTA", "I'm not seeing the actual conflict here.\n\nHas your mom actually DONE anything to try to break up the relationship? Has she made a tangible move on him?\n\nI agree, it's odd behavior, but I'm saying NAH", "i'm not sure this post qualifies as it's under the feelings category and there isn't any conflict other than your mom clearly competing against you and then feeling left out. in this case, you're not an asshole for feeling or thinking a certain way if your actions are appropriate and don't endanger anyone.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy boyfriend (M20) and I (F21) have been together for almost two years. We live in different countries but manage to see each other almost every other month. My mom was overjoyed when I told her I have a boyfriend, because he is my first everything and I’m not usually a social person. She was even happier when I told her he was coming over to visit. \n\nThis was about half a year into our relationship. She came with me to pick him up at the airport, and from the very beginning she was acting weird. Kept making negative comments about me in front of him, trying to prove that she’s so much better. My boyfriend was obviously weirded out by her behavior, but he was still polite and even gifted her a chocolate from his home country. When we get to my apartment after a two hour drive, I expect her to just let us out of the car and she’ll be on her way. But no. She follows us inside. She proceeds to show him around my apartment as if it were her own. \n\nMonths later I come back from a trip to his country. She picks me up at the airport, and is relatively quiet for a while in the car back home. I start talking about things me and him did, recalling amazing memories I made with him. She starts talking about how she’s done the exact same things with multiple men. And of course that it was way more romantic. I dont even know what to respond at that point so im just quiet for the rest of the ride. When we get to my apartment, I show her some of the things I bought, like chocolate. Then I show her a stuffed animal my boyfriend got me as a gift. She immediately grabs it, hugs it tightly, gives it a kiss and smells it. While not letting go of the stuffed animal, she looks at the chocolate I bought, the exact same my boyfriend got for her the first time he was here. She tells me she hasn’t eaten her chocolate yet, that its a gift that means so much to her that she can’t eat it. Keeping it makes her feel like he’s still here, like she has a part of him. \n\nAbout a month ago my boyfriend came to visit again, this time for longer. Because we wanted to see more of my family, we had to stay at my mom’s place for a few nights. We ended up spending a lot of time with my sister. We planned things to do together just the three of us. When my mom got to know this, it was almost like she gave us the silent treatment - especially towards my sister, because she took my mom’s place. However my mom kept making it obvious she felt left out. This became even more obvious when we wanted to go to the beach. To make a long story short, she got very offended that we wanted to be by ourselves at the beach. My mom is closing in on 50. We’re in our early 20s and usually I have no problem hanging out with my mom, but this is a bit different. \n\nI dont know what to make of this situation and maybe its more common than I make it out to be, but like I said this is my first boyfriend, and her first son-in-law.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Our mothers are kindred spirits. In my case, I think my SO is just the type of guy she wished she had settled down with back in the day, not that she currently wants him or him specifically. She has a lot of regrets about the time she wasted with my dad. Idk if that might ring true with your mom as well. \n\nNTA btw. It's weird and I empathize with you.", "Based on OPs comments this is very likely to be the case!", "for years she’s said she doesn’t want to settle. she keeps seeing a lot of men actually, but never more than a hook up. its also worth mentioning she makes them think she wants them and just them, when in fact she sees multiple at once. and since she has all these men wrapped around her finger, i find it odd how she seems so caught up with my boyfriend", "thank you. outside this she is being praised by everyone for being this perfect woman and its really frustrating because they dont see this side of her", "NTA. Your mom is being weird. Does she act likes this towards other boyfriends your sister has had?", "I’m very open with him about my concerns and he knows about this post. He is just as weirded out as me, if not more", "not action wise. she has instead at times tried to find things about him that could make him untrustworthy, tried to make me less into him etc. but all she’s saying is bullshit and based on pure speculation. its also worth noting that she’s said that if me and him were not together, she would shoot her shot with him", "I’m worried that i’m overreacting and that her behavior is more acceptable than I think it is. I had to leave a lot out because of the character limit, but my post in r/confessions has the whole thing", "So you’re waiting for the mom to actually do something before you’re willing to call her an asshole for her obviously gross behavior…?", "I can see that. Its more like i wanted to see if i’m overreacting and being an asshole for judging her.", "It kind of just sounds like your mom just likes attention. I don’t mean any offense to your mom. It just seems like any man she wants their attention on her. I don’t think in her mind she wants to date him but it could be she sees herself as desirable as in every man wants her so she assumes the same from your boyfriend. Or it could be she wants your boyfriend to want her not because she wants him, but because of the attention. Not normal behavior but makes sense given your mom’s dating history. I would keep your distance and call out your mom every time she does it. Something like you’re making everyone uncomfortable with your behavior please don’t act this way with my partner or something. NTA", "She may not actually want your bf specifically but she’s definitely jealous that you’re getting treated well.  I’d be very careful this is really weird.  Can you move out?", "Then have a good chat with mum, I really think if you don't let it out, it's going to get worse. Basically just get everything out in the open", "This is really fucking weird and not at all normal behaviour. Honestly I’d be losing contact with my parent over this kind of behaviour. It’s unhinged. Don’t let her mess with your head into thinking this is at all common - it’s not.", "I don't think you are overreacting at all. Definitely odd behavior on her part. NTA", "Nope, NTA it sounds like your moms a cougar and has her heart set on your BF.", "hell no. any chance you watch vanderpump rules? your mom reminds me of stassis mom."]}