{"id": 21862, "submission_id": "14vzzw8", "title": "AITA for throwing away something my sister said wasn’t hers", "selftext": "In order to get out of picking up after herself my (17f) sister (15f) will claim that the mess isn’t hers. Whether it’s food, trash or an item she left outback she’ll say “thats not mine” and 8 out of 10 times our parents will believe her and make me clean it up. \n\nThe other day my sister left out her makeup palette. It was on the living room table for three days until our mom got mad and yelled for whoever it’s for to pick it up. I don’t wear makeup because it breaks me out and makes my face itch, mom knows this so why did she think it’s mine I have no idea. I say it’s my sister’s but she immediately goes no it’s not, I don’t even wear that brand or color. So mom then tells me to pick it up and says I should know better than to leave my by stuff laying around for so long. \n\nI just look between the two of them then say ok. I pick up the palette and toss it in the trash. My sister then panics and says why would I do that. I say it’s not yours, it’s not moms and it’s not mine so I threw it way no one wants to use mysterious makeup that just appeared in the house. My sister then digs in the trash and pulls it back out. She tells me I messed it up and that it was a gift from a close friend. I replied I thought it wasn’t yours, that’s when she makes a face like oh crap. Her excuse was she didn’t recognize it until now, I said yeah right, she just told me to shut up and went to her room. \n\nMom tells me that I was cruel. I reminded her that my sister said it wasn’t hers so I had every right to throw it way. She said since I knew it was hers I was in the wrong. She wants me to apologize and offer to buy her a new one. I don’t want to do either of those things. If she truly cared about it she would have picked it up instead of saying it wasn’t hers. I’m also upset that mom is completely ignoring the fact the my sister lied to get out of doing something so I feel like apologizing would let her know it’s ok to keep pinning stuff on me. Dad is the only one who acknowledged my sister’s lying but also says what I did was wrong AITA", "created_utc": 1689009205, "permalink": "/r/AmItheAsshole/comments/14vzzw8/aita_for_throwing_away_something_my_sister_said/", "score": 1744, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I may be the asshole for throwing it way when I knew it was hers\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Easy NTA. Your mom said to clean it up which means put it where it belongs. It wasn’t yours, your mom’s, or your sister’s. You put it where it belongs, in the trash. If anything, it was a pretty clever way to catch your sister in a lie.", "NTA. \nOh the younger sister favoritism is strong in this post", "NTA, your mother is an AH for clearly favoring your sister. You are under no obligation to apologize or replace your sisters make up. If she hadn’t lied, she wouldn’t be suffering the consequences. I would tell your sister that every time she says it’s not hers from now on, you intend to throw away, and when you do, it won’t be retrievable.", "NTA.\n\nSis was being lazy and you called her out on it. She just didn't want to put it away.", "NTA. But your sister and parents are. No, it wasn't wrong to throw away an item that everyone said wasn't theirs. It was the smart thing to do. If your mother wants to talk about your \"cruelty\" (note: that's not what \"cruel\" means) in throwing it away instead of your sister's constant lying and refusal to own her mess, she's a big problem, and the problem will only get bigger as you get older. You have a year left before you become of age and can get away from them. Start planning.", "Im sorry your mom sound’s just horrible", "NTA. And I think you’ve uncovered the perfect way to deal with this bullshit in the future. Lots of love from a fellow scapegoat.", "NTA. Really teaching your sister to be honest and to clean up after herself should be your parents job, but clearly they are not doing it. If your sister said it wasn’t hers and you know it’s not yours why would it not be trash. Are you supposed to be all-knowing or something that you can tell it’s your sister’s but your mom can’t? I get you suspected that it was you’re sisters but the lesson you’re parents have been teaching is “Believe the 15 year old no matter what” so it’s on them. Unfortunately sometimes parents are TA and this is one of those times. There is no logic to your mom’s argument; it is just blatant favoritism.", "NTA, fellow scapegoat.", "NTA and kudos to your for tossing that shit.  Toss everything out that she claims isn't hers as needed.  I wouldn't apologize for SHIT.", "Lol NTA - play stupid games, win stupid prizes.", "NTA keep doing this", "That's hilarious🤣🤣🤣 Please keep doing this!! NTA.", "NTA - and what you did was fine.\n\n All the responsibility for the item was placed on you by both mother and sister so your decision to throw away something you didn’t want was utterly reasonable. lazy liars may well learn their lesson. Do not under any circumstances give sister a new one and, indeed be very clear that this is your going to be your exact approach to every such disputed item from here on.", "NTA but your mom is. So is your sister. Show them both this thread.", "NTA", "NTA. Is your mom the younger of her siblings by chance? Lol", "NTA\n\nMy kids learned real quick not to pull the \"but it's not mine!\" shit with me. Granted, my kids are under 10 so I wouldn't actually throw them away, but it only took 2 times for them to greatly improve picking up their toys.\n\nAs a mom I'd be cheering you on in my head and calmly explaining to your sister that she INSISTED it wasn't hers...what did she expect? Fuck around and find out. \n\nGood for you", "NTA. Your sister is for being a lazy liar, but my god your mum is the biggest AH of all. Its obvious it wasn't yours, it obvious your sister lied and now she wants you to apologise?!\n\nAt least now if your sister pulls that crap again, all you need to say it \"guess I'll throw it out then\"", "ETA, although yours is somewhat justified.\n\nedit: I don't think you owe your sister a new one", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nIn order to get out of picking up after herself my (17f) sister (15f) will claim that the mess isn’t hers. Whether it’s food, trash or an item she left outback she’ll say “thats not mine” and 8 out of 10 times our parents will believe her and make me clean it up. \n\nThe other day my sister left out her makeup palette. It was on the living room table for three days until our mom got mad and yelled for whoever it’s for to pick it up. I don’t wear makeup because it breaks me out and makes my face itch, mom knows this so why did she think it’s mine I have no idea. I say it’s my sister’s but she immediately goes no it’s not, I don’t even wear that brand or color. So mom then tells me to pick it up and says I should know better than to leave my by stuff laying around for so long. \n\nI just look between the two of them then say ok. I pick up the palette and toss it in the trash. My sister then panics and says why would I do that. I say it’s not yours, it’s not moms and it’s not mine so I threw it way no one wants to use mysterious makeup that just appeared in the house. My sister then digs in the trash and pulls it back out. She tells me I messed it up and that it was a gift from a close friend. I replied I thought it wasn’t yours, that’s when she makes a face like oh crap. Her excuse was she didn’t recognize it until now, I said yeah right, she just told me to shut up and went to her room. \n\nMom tells me that I was cruel. I reminded her that my sister said it wasn’t hers so I had every right to throw it way. She said since I knew it was hers I was in the wrong. She wants me to apologize and offer to buy her a new one. I don’t want to do either of those things. If she truly cared about it she would have picked it up instead of saying it wasn’t hers. I’m also upset that mom is completely ignoring the fact the my sister lied to get out of doing something so I feel like apologizing would let her know it’s ok to keep pinning stuff on me. Dad is the only one who acknowledged my sister’s lying but also says what I did was wrong AITA\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA I do that with my kids stuff . Shoes, toys you name it. I will throw it. And donate it. Especially when I hear It's not mine on repeat.", "NTA - never apologise and definitely do not buy a replacement.  Both your sister and mother ate on the wrong and it backfired on them.", "Oh and don't buy another...that's some bullshit", "Every time she says “it’s not mine” just respond with “may I throw it away then?”  \n\nForce her lie. She’ll figure out that she can’t get away with that anymore.\n\nNTA", "I think you need to try to have a calm talk with your mum and explain how this makes you feel. Explain how it makes you feel when your sister lies. Explain how it makes you feel when your mum finds out she's lying but doesn't say anything to her. Explain how it feels like she always takes your sisters side.\n\nTry to do it calmly. Expect a little push back while she takes it in but try to be kind. Once you've done this, the ball is in her court and she can decide how she wants to address it.\n\nIt may go well, it may not. But you have to talk about feelings to have a chance at improving the relationship.\n\nGood luck.", "You know you're NTA. \n\nWith that said, if your parents consistently favor your sister like this then I urge you to start saving up money now to leave as soon as you can after high school or college. It's not going to get better.", "This is some /r/MaliciousCompliance/ level petty but your sister deserved it. I applaud you. NTA.", "Nta. I would have said “she lied to you so I’d have to clean it up. I just cleaned it up.”", "NTA. This is some golden child bullshit. Don't you dare apologize.\n\nThe most important thing to do in a golden child situation is to stop second guessing yourself. It looks like you can't rely on either parent to correct your sister's behavior, so trust your gut.\n\nIt also might be time to make overt verbal statements about the disparity between your treatments. No parent likes hearing that they favor one child over the other, especially when its true. Rub it in their faces every opportunity you get. They don't have any problem with your discomfort. Create some for them.", "NTA. Good for you.", "NTA - But your mom is for enabling this behavior.", "Mother is obviously picking favorites, and sister needs her ass beat", "NTA, but WTF is wrong with your mother?", "Your mom is the biggest problem here.", "NTA. Yes it was obvious it was probably hers, but *that applies to your mom too*, and your mom insisted you were responsible anyway.", "yep, in fact i think this is a tactic op should keep using. nta.\n\nedit: and for the love of god do not offer to replace it. your mom wants her to have a new one she can buy it herself.", "\"I'm sorry you got caught lying to mom to get out of taking care of your things.\" NTA.", "It was very clever but unfortunate the mom still defended the liar", "It's so blatant too", "Yep, I smell “Golden Child & Scapegoat” dynamic in the air! Mom sucks big time!", "This is what you should say when you apologize to your sister. NTA", "Yeah, mom sucks and everyone here knows it.  Sister sucks because she's a lazy, entitled Golden Child.", "NTA & you are right.  Your mom is ignoring that your sis lied so she wouldn't have to clean.  But why?  You don't owe either of them an apology.  It was your sis's makeup & she knew it.  The thing is, so did your mom.  So why didn't mom just go directly to her instead of saying whosever it is?  It seems you are more responsible than your sister.  So instead of parenting your sister, she is making you do more work bc she knows you'll do it where your sister won't.", "Hahaha, mom also got caught being a deceptive fuckwozzle.  Clearly she know who it belonged to, and yet wanted to manipulate you into taking care of it, and it backfired on her.  No wonder she is taking sister's side.\n\n2x NTA (since you are dealing with two assholes here)", "NTA. No one wants to use anonymous make up so you did the right thing. \n\nI hope this makes your sister more accountable for her things.", "NTA...and I feel like you've found a really good tactic. Every time your sister claims something says it's not hers, just announce then it must be trash. Every. Time. Let her have to keep either stopping you or digging it out of the trash. Make it harder on her to not pick up after herself.", "I would buy a lock box for your room and any time you need to pick up something from your sister put it in there, it is clearly yours, she even confirmed it. Only let her have it again when she tells your mom the truth.", "What the fuck? I'm so sorry that you're having to live with this BS. Totally NTA and in no way should you pay for any of that. At all. Sounds like some fucked narcissism you have to deal with in both your mom and sister.", "NTA, and if your sister does this again, keep throwing away her stuff until she learns her lesson", "Don't replace it or apologize.   Let everyone know from now on if you have to clean up after her whatever it is goes straight in the trash.  Tell your mom to stop enabling your sister's lying and stuff like this wouldn't happen.   Who's gonna clean up after your sister if you leave for college or move out?", "NTA\n\nYour parents seem to favor your sister. You might want to have a conversation with them when she is out of the house about how this whole pattern of behavior makes you feel small and less than her, and how their trusting your sister over you every time when they know she lies like this makes you feel like you can't trust them to have your back when you need it. They may not realize how big an issue this is.\n\nOr they might just be shit parents who favor your sister as the golden child. Hard to know without the conversation, but either way you'll either get things to improve or know where you stand with them.", "NTA\n\nI'd apologize when hell freezes over but I'd also just start throwing stuff away when your mom tells you to clean it up and it isn't yours.  Especially if you suspect it belongs to your sister.   Eventually, one of them will learn to either clean up after themselves (your sister) or stop treating you like a maid (your mom)\n\nAnd since your dad seems to see how this game is played, I'd give him a head's up so he can have your back.", "NTA and I'm pretty peeved on your behalf that your mom is not on your side here. If your mom knew it was your sisters, and you knew it was your sisters, and your sister knew it was hers, then why is your mom making you put it away?", ">She said since I knew it was hers I was in the wrong\n\nNo, she knew it was your sister's and she was in the wrong for believing your sister's lie - which she knew was a lie.\n\nNTA", "You’re NTA but you’re moms not worth a fuck", "It was a very good tactic, BTW, but going forward, just verbalize first \"It isn't mine but I will be happy to take it to the garbage can if nobody claims it\".\n\nNTA", "Op didn't absolutely nothing wrong. I'm wondering if the 15 year old is the golden child and always gets a pass from her parents? Seems odd that OP would get in trouble for her sister lying.\n\nNta", "NTA\n\nOf course your mom would tell you you're cruel and expects YOU to apologize when your sister lied directly to her, as she clearly has a golden child in your sister. All you did was throw something away that according to her didn't belong to anyone.\n\nI would strongly advise against apologizing as they both know if they can get you to admit wrongdoing then they can make a habit out of blaming you for things your sister does", "NTA. \n\nHowever, your mom is not very smart and performs significant mental gymnastics to allow your sister to do/say what we she wants  without consequences.", "NTA. Don’t apologize or buy your sister anything. If she was really taking good care of the gift given to her by your friend, she would’ve claimed it and not let it sit on the table!", "NTA\nWhy should it be your problem if your parents want to enable her jerk lazy attitude", "Nta.  Do not cave.", "What exactly is your mom on? I never understand this level of favoritism, next time put the damn make up in a sink and watch that shit go down the drain.", "Girl keep doing what you doing. Each time sister lies throw her shit out in the trash.", "I would have done the same. NTA \n\nEverybody else is one.", "NTA. Your mother constantly makes you clean up after your sister and encourages her to lie to everyone so she doesn't have to be responsible for her own messes. What you did was perfectly appropriate. Since it \"didn't belong to anyone,\" what were you supposed to do with it? Your sister needs consequences and no one else seems willing to give them out. Don't buy her anything. She can YouTube how to fix the pallette, and then maybe she'll value her things. I say do the same thing to anything else she denies owning. Toss it immediately. You can't just have anonymous items lying around your home.", "NTA.  Ask your mom why she blaming you is okay and why should you pay for something she told you to clean up?  When you clean up you put garbage in the garbage can.  If no one claims something it is garbage.", "Hold your line - you neither owe your sister an apology nor new makeup.\n\nAs someone older than your Mom, I think it was a rather perfect way to reinforce that the common \"it's not mine\" response has consequences.\n\nNTA", "NTA. Easy to see who’s the golden child in this family.", "NTA I suggest you keep this up as it’ll be the only way to get her and your mom to stop blaming you. Tell your mom why should you buy her a new one when she deliberately lied to both of you? You did what was asked and got punished, if you didn’t do it you still would’ve been punished. Sister played stupid games she gets to win stupid prizes.", "NTA momma has a favorite kid and it shows big time", "You are NTA. I would encourage you to continue to throw away any items your sister leaves unclaimed around the house when you get stuck cleaning up after her.  Who knows she may learn to put her things away.", "NTA and your sister is awful. Remind her if this is how she’s going to act, you will not be a big sister to her for much longer", "NTA your mom knew it was your sisters and still tried to make you clean it. Ask your mother since she knew why did she think it was okay for you to pick up after her child? Your not paying for a new but she can since she knew it was hers. Hold your child accountable.", "Why does your sister enable you sister?", "NTA. I liked what you did there OP.\n\nMaybe tell your mother that you'll apologise to your sister when your mom stops indulging her favouritism.", "NTA. Your sister is a psycho & gets what she deserves. Don't pay for anything. I would become a broken record from here on out to almost everything, why doesn't she constantly get away this? Over & over& over & over.", "Nta, in fact, do that every time. She'll get out of that habit quickly.", "You are NTA, but oh, my word, your mother is enabling your sister to lie, be entitled, and mistreat people. She should have given your sister a consequence a) for not clearing her things like she was told, and b) for lying about it.\n\nInstead, she is telling *you* to replace a thing that nobody claimed.", "NTA- Tell me who is your favourite child without telling me, someone might wanna DNA test all the siblings.", "your mom really couldn't make it obvious who her favorite child is unless she came right out and said it. NTA, but you're never gonna win here. your mom has her golden child, I'm afraid.", "NTA\n\nBut it seems like you are missing the real issue here. \n\nThe enabling of your sisters actions by your parents and maybe some golden child syndrome.\n\nJust because you knew it was hers doesn't mean you should have to take accountability for your sisters LIES.\n\nYour sister LIED. Straight to your mothers face and they accepted that and blamed you.\n\nThen when you actually do as your mom says you STILL get blamed and your sister STILL becomes the victim after being discovered in her LIE by your mother.\n\nNow your mother wants you to apologize. What for? \n\nWhat is there to apologize for? Ask her? \n\nAsk her WHY should you apologize for ***your sister lying to your mother*** so ***YOU can take the blame.***\n\nWHY???\n\n>I’m also upset that mom is **completely ignoring** the fact the **my sister lied** to get out of doing something so I feel like apologizing **would let her know it’s ok to keep pinning stuff on me.**\n\n☝☝☝☝☝☝☝☝☝☝☝☝☝\n\nTHIS is why. So your mother can **ENABLE** your sister to keep ***pinning stuff on you.***\n\nAsk your mother WHY is that allowed.\n\nTime to have a long serious talk with your parents sooner than later.\n\nAsk them why they enable and favor your sister so much over you.", "NTA - I think the next time your golden child sister tries to pull this shit, ask her if she's sure she want's you to clean it up.", "NTA. You should definitely keep pushing back like this. Your mom allows this to happen because she knows you’ll accept responsibility and clean up the mess without complaint, whereas your sister would likely argue and make excuses. So stop doing that. If your sister doesn’t want to claim responsibility of her own stuff to avoid having to clean up after herself then she runs the risk of losing that stuff. She’ll change her tune pretty quickly once she realises this.", "NTA. Your mom wants you to apologize to your sister when your sister lied directly to her face? I'm a mom myself and that's the most ridiculous thing I've heard. Your sister effed around and found out. I would have done the exact same thing you did if it were me and my sister. The ONLY thing I could see your mom saying is you should have made it a big show to give your sister time to recover from the lie, like \"wow.. how did this marc Jacob pallet of eyeshadows end up in here? I don't wear make up and mom you don't wear these shades. I guess I should throw it out so no one accidentally uses it and gets an eye infection! It's a shame since this is a pretty expensive brand..\"", "NTA Your mum and sister are being massive AH's.", "NTA. It sounds like your mother doesn't want to parent this situation. She wants the clutter cleaned up but doesn't want to do the work of getting your sister to be responsible for her own items.", "NTA\n\nnext time destroy it before throwing it away. Every single time she does that, destroy the item right then and throw it away. Don't apologize and don't argue", "NTA and I’m sorry your mom is like this", "NTA. Why are your parents rewarding your sister for lying??", "NTA.  \nWhat is cruel is putting more responsibility on your shoulders to clean up a mess that is not yours. Your sister lied and then acknowledged she was caught in a lie and you were still blamed.\n\nYour dad acknowledged that your sister lied, and then blamed you too? Your parents are creating a monster.\n\nEdit: Do not buy another make-up pallet. She lied to you, if she valued that gift then she would have looked after it. And this is a learning lesson.", ">mom is completely ignoring the fact the my sister lied\n\nWTH is wrong with your mother?\n\nNTA, hope your sister learns to stop lying", "NTA", "NTA, and I'm so sorry that your mom has a clear golden child and a clear scapegoat child. (I'm a mom, and there is no excuse for her bias, not even if you and your mom butt heads while your mom and sister share a bunch of common interests.)\n\nI wouldn't bother showing this post to your mom, but I would consider sharing this post with your dad and ask him to help you. You at least need some protection from your mom's flagrant bias and your sister's opportunistic abuse of her favored status with your mom. He may even be willing to find a family counselor and tell your mom that it's time to get some professional help.\n\nIf nothing else, you at least have some consolation that in just two more years, you may be able to go away for college. Once you get some distance between yourself and your mom/sister, you can enjoy a freedom to choose how much contact you have with either of them and how much you let have any say in your life.", "NTA. Ask your mother if you were an unwanted pregnancy because she really seems to hate you.", "Definately NTA. In fact, I would have been a passive-aggressive asshole walking it to the trash can.  \nGosh, it's so weird that I forgot about this palette. It even looks expensive.  I'm surprised I bought it bc I don't even wear make up! \n\nGood for you for keeping things classyj!", "NTA. Your mom is making you clean up after your sister, knowing that you don’t wear makeup? I’d have thrown it away too.", "NTA", "Fuck that mom.", "Eeefffffffffff to the naaaaaawwwwwwwwww\n\nNTA.", "NTA. Your parents are being ridiculous.", "NTA. They need to idk, be a parent?? I had similar situations with my family when I was just a few years older than you. Glad I've had the opportunity to make my own family.", "NTA You owe your sister nothing. Definitely not an apology because she lied. I would try to have a very frank discussion with your parents about the blatant favoritism towards your sister. Bring up how she gets away with lying all the time, how having you be her maid doesn't teach her any responsibility, etc. Hopefully at 18 you'll be leaving for college or at least saving up to move out of you choose a different path. Ask them what is going to happen after you're gone? You could also show them this post, as long as you don't think they'll freak out about you making it in the first place.", "NTA but your sister is and your mom is enabling her.", "NTA. If they insist that it’s yours and demand you clean it up, then you’re within your rights to clean it up as you see fit. Including throwing away something that you don’t want to keep.\n\nTell your mom that SHE knew it was sister’s and still tried to make you clean it up, and that if SHE wants to apologize to your sister and buy her a new palette SHE can do so, but you aren’t going to be a doormat to cover for her inability to parent reasonably.", "NTA and I'd continue to do it.  Don't replace it and don't apologize.  Every time she says it isn't her stuff, I'd pick it up and take it to the backyard and hammer the crap out of it.  Then collect the pieces and say you are making a mosaic- this will be perfect for your art.  Then start an art project by gluing pieces onto a board that says \"no contact\" or whatever you prefer.  Your family are all acting like AHs (especially your parents for condoning her lying and laziness) so you might as well do what you need to get your point across.  I'm one of six kids and understand the pain- I got through it with this level of snark and stubbornness.", "NTA - There's no excuse for being such a shitty mother.", "You're NTA but your mum is pure AH", "NTA - tell them you’ll stop asking and toss anything that no one claims out.", "NTA. \n\nWhen you turn 18 you should absolutely get the hell out of this house.", "Nta. I think it was a good move. But, I think if it happens again I would make a bit more of a show:\n“Oh. Mom, is this not yours? Ok sister, it’s not yours? And it’s not mine. If it’s not any bodies, I guess I better just throw it out”. Like, really project that if your sister doesn’t speak up, it goes in the garbage.", "NTA. You did a good job.", "I think this would be a case of justified AH. Was it petty? Yes. Should you have done it? Probably not. But did the sister have it coming? Oh, yes. Honestly, the biggest AH here is your parents for doing nothing about your sister's chronic lying. If they're not going to handle it, they shouldn't be surprised when you do something about it. NTA", "NTA Tell mom every time her golden child lies and you have to clean up after the little asshole it will be going in the trash from here on out. She can decide if she wants her younger daughter to be a liar and lazy or if she wants two decent kids.", "I don’t like your mom", "NTA, but I have a horse in this race. When Covid hit, my city had a huge number of kids enter the foster system and because we could, we took in 5 kids (kids were sleeping on cots at the CPS offices). We’ve adopted 2 sisters and are adopting 2 more who are sisters (the other girl had a mother who has since ODed and her dad just got out of prison and he still has parental rights) Anyway. I love these girls but ever single thing left out is “not mine”, “I didn’t do it”, etc. There are enough kids here that I feel like they are zebra using their strips and group size to confuse the lion who just wants the zebra to clean up after themselves.", "NTA and good job, sorry your parents make you parent your sister and teach her responsibility instead of doing it themselves like they should.", "NTA\n\nFeel free to send this link to everyone in the family, tell them not only will you not be apologizing until she does for constantly lying but you’re done picking up after her shit. If they have a problem with the mess they can take it up with her. They may try to make a power move by grounding you, (just take it, but refuse to do any cleaning that wasn’t a mess made specifically by you or your parents anything to do with her is off limits even if they try to make a punishment out of it). They won’t ground you for life likely just for a week or two, until they get the hint that they can’t intimidate, bully, or manipulate you into being mistreated for your sisters benefit. \n\nP.S. If I were you I’d just go straight to your sister and tell her that it’s going to keep happening, so long as she says its not hers and you know for a fact it’s not yours or your moms. She’ll get the point quick if she hasn’t already. Btw what you did was not cruel, what was cruel: was your sister lying to shriek responsibility, and get you in trouble for something you didn’t do. Your parents are just pissed you don’t worship the ground she walks on like they do, and that’s fucked up.\n\nP.S. 2 : Before they say “well that’s what big sisters do” “that’s how it’s supposed to be” no the fuck it’s not. Siblings are supposed to joke, make fun of each other, steal each other’s clothes, fight over the remote, etc. IT IS NOT your responsibility to be your sisters maid and scapegoat.", "NTA. NGL, I laughed when I read what you did. Clever! \n\nI'm sorry that your parents suck. They both clearly play favorites, your mom actively and your dad passively. You say you're 17, so I hope that you can get out of there ASAP.\n\nDo NOT apologize and do NOT buy a new palette.", "NTA - as a mom, I approve of you throwing the make up out & would have died laughing as your sis dug through the trash.", "NTA - and I’m an eyeshadow palette hoarder. I take care of my stuff and your sister should’ve as well.", "Your mum is 100% the AH here. I got mad just reading that passage, I can’t imagine living with it…\n\nShe lets your sister get away with WAY too much. The moment your sister revealed the make up was hers, your Ma should have called her out for lying. No way that’s on you, for calling your sister on her BS.", "NTA and please show your mother all these responses.", "What you did was wrong but at the same time she kind of did it to herself. Before anyone asks, op could have said, \"Well then I will just throw it away since it doesn't belong to anyone....\" that would have gotten a reaction out of sister as well. NTA, don't use your money to buy her a new one.", "NTA\n\nTell Mom that if you keep having to pick up stuff that isn't yours, you'll keep throwing it out.  It's Mom's fault she isn't making Sus clean up after herself.", "Nta", "NTA. Next time stomp on it and insist you believe her when she said it’s not hers.", "If only her mom didn't suck this whole thing would have been awesome haha! So brilliant, but her mom didn't even care her sister lied. Screams \"golden child\" to me. NTA op", "As a parent, I have trouble understanding this.", "Yeah this is a hill I’d die on. You SAID it wasn’t yours. Your sister should be in trouble for lying and being lazy. How infuriating. Just keep counting the days OP, until college or whatever you plan to do at 18. \n\nNTA", "I remember getting grounded for something that happened when I wasn't even home. I was out with a friend AND HIS FAMILY at a movie. I came home and my sister had told the babysitter that I had done it, the babysitter told my parents it was me and my parents said neither of them would lie. But somehow everyone I spent all day with was not enough evidence to prove my innocence. They're currently not getting any responses to any attempt to reach out and my mental health is doing much better!", "I imagine it must be tough being the black sheep in a family of AHs.", "Right? Believe the 15 no matter what, ignoring the simple logic that OP DOES NOT WEAR MAKE UP.", "I bet even if OP said “it’s sisters”, Mom still wouldn’t believe her. Lose lose for OP.", "OP, this is the way you start adding some boundaries to your life, and I’m happy that you were able to pick such a well-related consequence to your sister’s lie. Hopefully she will think twice before she pulls that again, but if not, you’ve got the perfect response. Breaking it when you toss it is key. She gets one shot to claim it, or it’s gone. \n\nYour household sounds like it’s got at least one narcissist (your mom), plus a golden child, which really is an apprentice narcissist. Read up on narcissism for more ways to cope, and understand this is not you not being enough, it’s others taking advantage of you.", "Or start saying \"oh great, it must be mine, I'll go put it away in my room.\"  And then keep it.  Or if OP can't use it, regift it.", "Mum's abusive. I don't think she gives af what op wants.\n\nNTA", "Adding on, if it was a special gift from a friend, then she didn't treat it very well. She left it lying around for several DAYS, not carrying about it. If it was so special why did she treat it so poorly?", "[removed]", "This. This right here.", "She needs to tell her mother, if you know it’s hers and I know it’s hers, why DO I HAVE TO CLEAN IT UP? If you don’t want me to throw away her stuff that she lies about being hers so she doesn’t have to do any cleaning, then I am not going to clean it up. Take your pick mom. Tell her to pick up her crap and put it away or it will go in the trash if you make me do it.", "Yeah, why does Mom continue to make OP the bad guy?", "Oh absolutely.\n\n\"Well, she says it isn't hers, so clearly you are a liar because she is my perfect, golden child\" \n\n-The mum, probably", "if op has a door that locks that’s definitely something to try! but if mom interferes, i would just go ahead and break it and toss it in the trash. sis’ future roommates will thank her.", "Preferably in front of the mom", "🏆🏆🏆", "Sister must be the golden child.", "Dad sucks too for going along with it. I’m sorry, OP. You deserve better. NTA", "I would ask the mom for specifics when sis is not around. If sis lies could I have a guideline for what to do with her things? It has happened before and I am tired of getting blamed for her stuff and having to pick up after her when she lies. THEN OP take a picture of everything in your room on your phone to prove it is not yours and show it to mom next time she lies. And if you have to pick stuff up, photograph it and e mail it to sis and cc mum with are you sure it isnt yours? And then if she wont reply in written form throw it out oor use it or give it away. NTA but mum favours sis. Any other family to advocate for this?", "OP didn't mention a dad in the picture, but ostensibly, YES VERY.", "NTA, this is a hill to die on. Everytime your mom brings it up say she should apologize to us for lying", "NTA. Favoritism is a horrible dynamic to set. Show your parents this post and let the internet tell them they are bad parents.", "NTA. It was a total BOSS move. Loved reading your post. And yeah it sucks being blamed for things other people do.\n\nEdit: Your parents are on your case bc they KNOW that you will listen to them and lil' sis will just blow them off. I don't know why people go after the person who is rational and doesn't rock the boat and NOT after the person who is the irrational boat rocker.", "Tell you mother she will enjoy having her irresponsible daughter live with her when she is 40. She is an enabler and should just let things lie as is. Maybe the next time your sister will think again about claiming it’s not hers she can’t get mad with the consequences. That’s life get used to it. Take ownership of your actions. I wouldn’t make you pay for anything and if it was a treasured gift your sister would have kept better track And care of it.  Your mother is oblivious to her actions especially when she knows that her one daughter doesn’t wear makeup. Wake up MOM!!! Let the siblings resolve it and stay out of it. It’s the only way they will learn diplomacy as adults. I was the youngest of 4 girls and learned some hard lessons but guess what as adults we are the best of friends and have a healthy respect for one another.", "NTA \n\nWhat you did wasn't wrong in the slightest. They are all letting you down, even your Dad.\n\nProbably you will get punished so you will have to decide whether to do this or not, but think you should stop cleaning up your sister's mess at all. Just refuse if it isn't your mess.\n\nEither your parents will have to make your sister clean up or do it themselves.\n\nThey are making you 'keep the peace' by letting your sister lie and having you tidy up. Maybe have a heart-to-heart with your Dad (since he's the least AH-ish) about how this makes you feel.", "NTA and also LMAO.  Honestly keep doing this.  Anytime she says something isn’t hers and you have to clean it up, just throw it out.  Someone will get fed up and change the behavior, but it won’t be you 😁", "I hope your mom hasn't caused you too much emotional or mental damage with how she treats you. I could never imagine being this one-sided or irrational to my kids. Your sister sounds like she is taking cues from what her mom has taught her is ok, as far as her behavior is concerned. Hopefully the world (and you) can continue teaching her to undo those bad lessons the hard way. Your mom is the AH. \n\nYou? NTA. Not even close.", "Ugh. Honestly I'm so sorry your in this dynamic. But also your sis obvs FA and FO. NTA", "Not only are you NTA but it was a clever tactic. I'd make it clear that I intend to keep doing it. If everyone in the house claims an item isn't theirs, then it goes in the trash. Better yet, it gets destroyed & put in the trash. The fact that your mother is willing to *reward* your sister for manipulating her into making you clean up is awful. I'm sorry you're in that situation. Maybe sit down & talk one on one with your dad, he sounds slightly more reasonable.", "I agree with dryadduinath, but I  am thinking you could go beyond by using it.\n\nWhen your mom complains about you throwing something of your sister in the trash, reply to her that she must make her mind - either your sister is responsible for her stuff, or in case she isn't and you are the one responsible, then she can't complain when you deal with it your way. You can't make your sister tell the truth and assume responsibility, but she can and isn't doing it. \n\nIf you are to take care of everything, then she can't complain because she isn't doing anything - or if she wants to complain, then whenever both you and your mom don't recognize something as your or her responsibility, you're going to dispose of it by throwing it in your sister's room (be it clothes, makeup, jewelry, food or trash), since she is the one prone to memory lapses. If she doesn't want to deal with her messes in a responsible manner, you'll deal with it your way, or your mom can deal with it her way - but she can't switch her options according to her convenience or mood and expect her decision to be respected.", "They have a favorite and it's not you, get a job, save up and move out asap", "Clever girl \n\nAlso come join us in the narcissistic parents sub. You might relate.\nNTA", "NTA. I'm sorry both your parents suck.", "where was your mum, when she wa spicking it from trash - your mum should have realsied her lies..", "NTA and start throwing your sister's stuff against the walls...\"But it's not mine!\" And walk away.", "Why did your mom believe your sister when she said it wasn't hers, but not you when you said it wasn't yours? NTA", "NTA, your mom refused to believe you when you said it wasn’t yours (even though she knows you don’t wear makeup) but then gave out to you for doing what you were told after your sister continued to lie, she can’t have it both ways. Don’t apologise or buy her a new one, that will just tell her that her terrible behaviour is acceptable, if she continues to lie then she should continue facing the consequences.", "I'd tell mom, \"You know what's cruel? You choosing her over me by making me clean up her stuff every time she leaves something out then says it's not hers. She just proved to you that she lies, and you are still trying to punish me for the outcome of her lie. *That's* cruel. It's straight-up Cinderella-stepmother behavior.\"", "Start a collection - anytime your sister leaves something out and you end up hanging to clean up something useful - keep it. \nDepending on how much longer you will be living at home, you can collect the trash as well, then when you move out leave it there with her name on it.\n\nAlso - if I find random stuff in my house, it gets tossed or donated. NTA", "INFO did you throw it with such force that it broke the makeup?  OR did your sister decide she couldn't use it because it touched trash.\n\nNTA and I would double down on this.  EVERYTIME your mother forces you to clean your sister's messes you throw it out or equivalent.  IE:  If it's clothes, bleach it when you are told to wash it.  Things like that.  Of course you have to be willing to deal with the consequences if you do choose the justified/petty route.\n\n(sister=Golden girl much--not just the cinderella routine for you but that they choose to believe her lies and blame you).\n\nPS your mother is so the AH too here because she basically acknowledges that your sister lied and still makes it YOUR responsibility.  So your sister should have NO consequences for not cleaning up nor any consequences for lying.  Your sister is not being raised to be a functioning adult.  People(like future roommates and employers) will not take kindly to her leaving messes for others to clean and lying about it.", "Your mum is a prat", "NTA. Sorry you are dealing with this. Trust me when I say that freedom will taste sweet when you move out, which sounds like it won’t be long.", "NTA... fun revenge\n\nShe is a habitual liar, no need to apologize.", "NTA. Why does your mom favour your sister so much? Your mom is cruel to you all the time by not believing you and your sister is even crueller by deliberately making sure you take the fall for. Why doesn't your mom make your sister apologize for lying and for knowingly dumping the blame on you? Your mom is the biggest asshole here, second only to your sister.\n\n&#x200B;\n\nWhat you did was NOT wrong. It was the only thing you could do.", "Absolutely NTA. Play stupid games win stupid prizes.", "NTA - Simple solution to having to argue your case to you Mom who clearly let's everything your sister does slide is Mom gets a label maker or orders stickers with your names on them & Let's see your sister get out of her blaming you *Make sure to not let your sister near your stack of stickers!", "NTA you told her it was your sisters and even she said it wasn’t.  She’s the ah. Ask her why she favors your sister and let’s her get away with evergthing", "NTA - do not buy a replacement, laugh at ANYBODY who suggests it. Moving forward, ANYTIME she says something isn't hers when it's left out, toss it in the garbage again. When she (or mom) starts whining, laugh and walk away. FAFO.", "NTA. Keep throwing away the stuff that belongs to nobody. Your sister will learn pretty quickly. “Oh, this doesn’t belong to anyone? Guess it’s trash.”", "NTA.\n\nTell your sister from this day forward, any mess of hers that she says isn’t hers and you’re forced to clean up—is **going directly into the trash can**.", "NTA. I keep thinking of ways to be petty, but none of them will help the situation. What I believe you should do is start preparing to leave when you come of age, as their behavior won't get better.", "NTA sis had to learn what the statement \"consequences of your actions\" means, and your parents certainly weren't doing it. I'm not one to condone siblings parenting each other, but teaching lessons is an entirely different matter.", "NTA \n\nPlease have a read through r/raisedbynarcissists", "NTA - and don’t apologise for shit! You done absolutely nothing wrong. Your mum is the AH for enabling your sister’s behaviour and favouring her instead of being equally fair to both of you. You should show her all these comments, it might open her eyes! Also, every time your sister says “it’s not mine”, destroy it and bin in. You’ll see, soon enough she’ll change her tune! Good luck!", "NTA your sister needs to learn that lying has consequences. Your parents aren't doing her any favors by enabling her lying.", "NTA your mom is enabling your sister to be lazy and entitled. By making you clean up messes that aren’t yours she’s telling your sister that telling lies pays off for her.", "NTA… as the older sibling i feel this so fucking hard. once you turn 18 you need to sit your parents down and have a long conversation.", "NTA, your mom should have started tossing items long ago. Keep on doing it; you'll be hopefully out of the house soon and then they can fight amongst themselves over who cleans up their own mess!", "NTA- Your mom will walk a mile out of her way to figure out how to get you in trouble and excuse your sisters crimes. You are the scapegoat and your sister is the golden child.", "NTA.  Your mom would rather have you do all the tidying up than actually parent your sister and insist on her doing her fair share.  Keep up with this tactic--it's a good one.", "Easy NTA. And in the words of Scar, run away and never return when you turn 18", "Shit I would have ran it under water too so it’s not recoverable lol", "NTA.\n\nAlso keep doing that.  If no one claims it, TO THE TRASH!  I bet that won't go on for long at all, and she may even start actually cleaning up after herself.", "NTA \n\nIt kinda sounds like your mom is showing preferential treatment to your sister.", "NTA sounds like your Mom has a favorite... and it isn't you...", "NTA, your mom and sister are TAs.", "NTA. This is your parents’ fault for appeasing your sister, and your sister’s fault for lying.", "NTA\n\nChuck it out the window next time", "NTA.", "NTA and your family is truly a hot mess. Don't apologize and don't clean up any messes that aren't yours.", "NTA. Your parents suck at parenting (& seem to favor your sister & enable her, ugh), so you had to be the parent & teach your AH sister a lesson. (Which your parents, who suck at parenting, immediately tried to negate.🤬)", "NTA", "NTA.. And if this is a common occurance.. Your mum needs to read this thread.", "NTA. Your mom seemed pretty quick to believe precious little baby even though she knows you don’t use makeup, and assumed the worst about you. I’d request an apology from them both!", "NTA. Let me guess - your mom had older siblings too? This is the kind of favoritism my parents (both the youngest of their siblings) tended to show my younger brother when we were growing up.", "NTA, and I think you should do this every time something similar occurs. It was clever. Let your sister learn that her property only goes un-trashed when she admits it's hers at cleanup time.\n\nFor whatever it's worth, my mom would have trashed the makeup herself if we kids had each claimed it wasn't ours. And she would have laughed if one of us did it and the other freaked out. I'm sorry (and confused) that your mom is blaming you for some reason. That's just odd.", "NTA I would have marched out to the curb side bins and put it directly in there. I, too, get itchy with make-up. My brother used to do this type of shit to me, my fave was when he said that an old rotten apple that was found under his bed was mine, I mean c'mon man.", "NTA.  And next time, give that palette a good tapping to loosen it into a powder, throw the powder out in the regular trash and the palette shell in the recycling. After all, recycling is key!\n\nAnd have your parents read this post and the comments.  They should really understand two things: \n1) there are consequences to our actions.  Your sister not only said it was not her palette, she doubled down by saying she  would never buy that brand or colour. Your parents may be willing to baby her to infinity, but in the real world, telling lies is not going to go so well.\n2) your parents are being unfair, and even abusive, to you.  If your mother knew it wasn’t yours, why is she pushing you to throw it out? Much less gaslight you by scolding you about letting “your” things lie around? YOUR MOTHER IS THE BIGGEST AH in this situation because she is not doing the right thing, which is holding your sister and only your sister responsible. And she’s letting your sister lie and you take the punishment for literally believing your sister. This incident and the overall issue of putting things away shows a FUNDAMENTAL FAILURE BY YOUR MOTHER AS A PARENT(your dad is not much better either).  Better for her to acknowledge this failing and correct it. If things keep going this way, your sister will end up having a rough time in life and quite frankly, it in your position, I would distance myself from my parents because what they are doing to you is hurtful. \n\nKey phrases in caps lest your mother reads this and actively tries to remain under the delusion that she is a good parent.  She is not.", "NTA.\n\nContinue doing this until she learns to pick up after herself.", "INFO:  Every now and then a makeup palette question comes up.  Way more than real life.  Is this real?", "Definitely NTA.  Hopefully this will help your sister \"remember\" when things are hers.  And if she can't remember her own things, then maybe she doesn't need them anyway.  But the main point is: I bet she won't leave her things lying around anymore... And your mom will also stop telling you to clean up random things.", "Wow. NTA, but your mother really, really is. She doesn't want to discipline her youngest, so she just fobs the responsibility off on you. She KNOWS that some of these things are not yours; that they are your sisters, and yet she still pushes responsibility on to you.  It's easier for your parents to make you do it, because they don't want to actually, you know, parent.  \n\nKeep this up. Straight up say \"It's not mine, and I will throw it in the trash you want me to clean up sister's mess.\" \n\nHow about they actually try parenting their daughter instead of fobbing the responsibility off on you.", "NTA\n\nI do ‘dad pickups’ from time to time, they are announced.  Anything remaining is either tossed or ‘stolen’ by me at my discretion.  My rationale to my kids is the same, if it is yours you pick it up.  If you leave it out because it’s not yours, you lose the right to be offended.\n\nNot sure if you plan on showing to mom, but it may not go the way you think it will.", "Your mother is a terrible parent.\n\nNTA", "NTA your mom is a lazy piece of work. She knew it wasn't your and didn't feel like dealing with lying sister", "NTA. \nI’m the oldest daughter too. I call out my mom’s favoritism in front of everyone tho and she hates it but it’s the truth so w.e lol & this post reeks of it as well.", "She fucked around and found out. NTA. Your mom and sister both sound like a piece of work though.", "NTA. I get the sense that there’s a scapegoat/golden child dynamic going on in your family. Both of you say the makeup isn’t yours, but your mom assumes you must be the one that’s lying.", "NTA. Keep this energy forever. It will serve you well.", "NTA, I'd double down and keep throwing her stuff away. She will either stop leaving it out or people will stop asking you to clean stuff for risk of having their stuff thrown away.", "NTA. Good job! It’s clear your mom is not being a responsible and caring parent. Instead of discussing your sisters lying and correcting her behavior, she’s inappropriately making you the problem. You did nothing wrong. Your sister lied and these are the consequences of her actions.", "You are NTA and keep doing this every time!  just keep throwing everything away and then watch how quickly your sister stops lying and starts picking up after herself.", "YOUR MOTHER IS THE MAJOR FUCKING ASSHOLE ESPECIALLY WHEN SHE'S PICKING FAVORITES! DONT APOLOGIZE! AND TELL YOUR IDIOT SISTER IF SHE KEEPS LYING LIKE THAT YOU'LL THROW EVERYTHING AWAY NOT PUT AWAY! YOUR NO ONES MAID! \n\nNot the assbut!!", "WTF is going on with your mom? All of this feels so toxic.", "NTA, your whole family is though. Tell your parents their hypocrites for getting mad at you and that they're teaching your sister that she can lie to them without consequence. \"Don't blame me when she's lying to you about boys or partying, you're creating your own monster\"", "NTA. I’ve been in this situation as the mom, except I was the one saying “well, if it doesn’t belong to either of you I guess I’ll throw it out.” Works like a charm.\n\nI’m sorry your mom seems to be favoring little sister here. It sucks but it happens. If your relationship allows and you don’t think it’s intentional, you might want to explain to your mom how her reaction is making you feel like a second class citizen in your family. Your sister gets away with lying and manipulation at your expense and you’re the one expected to apologize - what?? \n\nThis dynamic is terrible for everyone, because it hurts your relationship with your parents/your sister, and it also hurts your sister by encouraging really nasty behavior that will bite her hard later in life.", "I actually find this pretty a funny and clever way to deal with it. You could even take them for yourself or give them away. I wouldn’t apologize either. Your sister will figure it out eventually. NTA\n\nPS sorry your family treats you like this.", "NTA tell your ‘mother’ she either makes your sister clean up after herself or She cleans up after her. Anything not yours that you are ordered to clean from now on goes Directly into the trash.", "You are brilliant and NTA.", "Sounds like your sister got her stupidity from your mother.\nNTA", "NTA. I would have scraped out all the colors in to the trash can so she couldn’t have simply picked it up and wiped it off.", "NTA but inform everyone in the house that that is what you will be doing from now on. No one can say they weren't warned.", "You mother need to apologies to you befor. Your sister too. \nShe need to takes responsabity for her mess \nTell both of them thath if you have to clean after her again you will put her thing in the trash again …\nNta", "NTA, the favoritism here is INSANE", "NTA, Your mom is TA, move out as soon as possible.", "NTA\n\nShow your asshole parents and sister this post", "NTA.", "NTA and not wrong for throwing away. It seems like your mom favors your sister.", "NTA. Your mom was blaming you for something that wasn't your fault- in fact you can throw those words right back your mom and say \"she should know better than to leave her stuff laying around for so long.\"", "NTA. Favoritism is strong", "Fake a hearing issue. They're clearly just being assholes to you because your sister is the golden child so don't bother caring what they think. Every time they tell you to clean up something that belongs to your sister, act like you didn't hear them. Ask them to repeat themselves over and over. They'll get over themselves.\n\nDon't buy your sister anything. She can wipe it off. NTA.", "NTA. I guess your sister is the golden child? Do not buy her make up. Maybe your mom will believe you instead of the liar next time.", "NTA. Your sis and mom are wrong. Sorry you have to deal with this unfairness. Good on you for realizing that IT IS u fair though and you deserve better.", "I hope you make your parents and sister read all of this. 😆\n\nEdit: I also have to say this was super clever and screams that you're not gonna be a victim and that's just awesome. Put this in your motivational bank, doesn't matter if your sister is the favorite now, your future is a bright one filled with independence and honoring truth. Your parents are probably gonna be dealing with your sister's entitlement for the rest of their lives.", "NTA. Any reason your parents decided to hate you?", "I think you should always do this. NTA.", "Your mom is emotionally abusive", "NTA. Your mom is the one in the wrong. Once you're old enough,  I hope you move out. It's clear your sister is the golden child and a brat to boot.", "Your family is awful. Sorry about that", "Tell your mom, \"Earlier you were sure it was mine. Now after throwing it away, you're telling me I know it was hers and I'm cruel? I thought you said it was mine?\"\n\nNTA", "NTA She’s a spoiled brat by the sounds of it!", "ESH. Your mum and sister for sure, but you took it a step too far and ruined someone elses property when all you really wanted was for your sister to admit it was hers. You should have announced your plans to throw it out, given your sister the chance to own up to it. This might seem soft, but really it's about protecting yourself from potential blow back.\n\nChess not checkers.", "Your sister has to learn to take responsibility. Congratulations on giving a lesson and no, don't back down to your mother because that's BS. NTA", "So ask your mom why since SHE knew that it was your sister’s, why didn’t she insist your sister clean up after herself? Is there favoritism going on that you should know about? Inform her that this is how you will be dealing with similar situations like this in the future and that you WON’T be reimbursing anything. Those are the consequences of lying on you. NTA.", "NTA play stupid games win stupid prizes", "NTA. Your dad may be right that what you did was “wrong” but sometimes people just deserve to have wrongs done to them for everything they do to others. How many years until you get to move out and go NC with these AHs?? Cause that’s what those two are asking for.", "YES mom and sis are TA", "Next time make sure your sis get a real good close look at it before it goes in the bin.\n\nNTA\n\nYour mum is enabling her childish bs and will get fed up of it herself once you move out.", "NTA. And congratulations for taking, what I consider to be, an excellent approach to this particular problem. \n\nDo this every time this situation arises. Every time she denies things are hers, throw them away (if I were you, I'd destroy them too so that she couldn't fish them out of the trash).", "Your mom is an asshole", "Does your mom always favor your sister like this?", "Nta tell her if she forces the issue you will move out and go no contact soon as you're 18", "I bet your sister is the golden child. Your mom is enabling her.\n\nIgnore both of them. If your sister didn't want you to throw it away she had three days to pick it up.", "Poor Dad probably wants to take your side but he has to sleep with Mom and deal with your sisters bad attitude so he‘s playing Switzerland.", "NTA. What's up with your mom?", "Sorry your mom is like that. Don’t buy a new one. And threaten to throw away anything that’s mysteriously sitting in your house unclaimed. Maybe don’t need to actually toss anything unless this issue continues.\nNTA", "I wish your mom and sister could read these comments, if they are reading this just know you both suck LMAOO. Don’t worry OP don’t give up hope you’ll get out soon", "Sister lies, mum protects liar, and you're the bad guy. Stand your ground on this one. Tell them they're gaslighting you and next time be honest and mum, be reasonable. \"I'll apologise when sister admits she lies, and when mother apologies for not trusting me.\"", "NTA and I love what you did! \nIs your mom the youngest child in her family? \nMy mom is and would always take my (younger) brothers side in situations like this when it was clearly his/ his fault. I think it’s because she can relate to being the youngest and not always being believed/ get her way. Either way she sucks in this situation (respectfully).", "The answer should always be.\nIf sister tells you it isn't her's but mine. And you believe her over me. Then its mine. If if mine I choose what I do with it. \n\nIf something ends up in the garbage that shouldn't the fault is with the person that left it there, was warned to pick it up and refused.", "NTA. Lol, tell your mum if she wants to keep being irresponsible raising your sister she can buy her new shit.", "NTA\n\nNot only would I refuse to pay for a new one I would promise to break or throw away any other items she claimed was mine Until she stopped doing it and cleans up after herself", "NTA. But your mom sounds narcissistic, you are the scape goat and your sister the golden child. Obviously can't say that just from your post, but maybe you should read up on it. Took me many years in therapy to learn how to deal with that (also scape goat), and honestly, if that's your case, the sooner you start, the better. Reading on the subject could also help you spot problematic behavior patterns and learn coping mechanisms for possible issues.", "Your mother is an asshole-to you. I’m sorry, she’s the poster child of poor parenting", "IMO, you are NTA. This is something I would do as a 15 year old to my older sister, too. You clearly stated it wasn't yours, your mom didn't believe you and told you to clean it up, you did. You cleaned it up and put it in the trash. Your sister needs to take accountability for her stuff and her actions, but that is her journey and if she has to watch you throw her stuff away in order for her to do that, then so be it.", "WTF is wrong with your mom?", "Lol move the fuck out when you can seriously, textbook enabling, your sister is on the fast track to becoming a complete slob.", "NTA. \nYour mom is either an incredibly lazy parent, or a narcissist.", "Your sister is the AH, your dad is the AH and your mom is way beyond that, she is just disgusting. I feel sorry for you.", "Nta and your mom is for playing favorites. Your sister needs to learn to pick up after herself and your mom should be teaching that but instead she’s raising a lying entitled little brat.. sorry you’re having to deal with it", "Your mum is punishing you because you're the reasonable child. In this moment of malicious compliance, you stopped being reasonable, so she's punishing you more. She's unwilling to confront your sister so she's leaning on you.\n\nSounds like you will get punished either way, so consider sticking up for yourself more. Your parents will not like it, but hey, you're already mistreated so it's already bad!. It's cruel of your parents to expect you to absorb all friction at a personal cost. Captain Awkward writes about this kind of thing very movingly, I recommend her blog.", "NTA - Sounds like your mom has a\"golden\" child and you are the scapegoat. That kind of thing happened to me several times.", "NTA.  I like your solution, OP, though I'm not as nice as you. Rather than a nice, dry waste paper basket, next time I'd stuff it WAY down in the kitchen garbage.  Along with the coffee grounds, gooey eggshells and bacon rinds.", "\"it's not mom's, it's not mine, and it's not sister's...I guess its going in the trash...Going once...Going Twice....SOLD TO THE SINK WHERE I'M WASHING IT ALL AWAY!!\"\n\nNTA. Your mother is a real piece of work.", "Nta. I was the child of 2 who was always picking fights--how could it be my older brother with obvious little man syndrome? \n\nI once had to get blood tests because they believed him when he said he didn't hit me.", "Bro your mom is TA... what the hell? She's teaching your sister how to be a horrible me person. Im sorry you have to live there", "NTA. Good for you for sticking up for yourself.", "NTA\n\nYou said it perfectly yourself:\n\n> I’m also upset that mom is completely ignoring the fact the my sister lied to get out of doing something so I feel like apologizing would let her know it’s ok to keep pinning stuff on me\n\nAnother issue is the fact then when both you & your sister deny ownership of something you’re the one who is forced to clean it up every time. How is that remotely fair?", "NTA. Today it's makeup palettes, next time it's gonna ba situations.\nYour sister is gonna end up creating messes in life, and she won't know how to take accountability nor how to fix them herself.", "NTA. \n\nI love the your malicious compliance here. \n\nMom just went with whatever was easier and it was easier to make you clean up a younger sisters mess. Bravo OP. Keep throwing out your sisters stuff when she leaves it everywhere. Just be prepared for the same treatment though lol.", "You should have warned her first and said if it's nobody's it goes in the trash. You should also remind your mom that you don't wear makeup and why would she tell you to pick it up when she knows that you don't wear makeup. While I think your sister is definitely wrong, you could have handled that a bit differently.", "Your mom sucks, has she always favored your sister like that? Since you’re close to 18 I would be working towards getting out of that house, it seems like a toxic environment. NTA.", "NTA.\n\nSigned,\nYour Biggest Fan (and fellow scapegoat older sister).", "OP should keep repeating this until sister changes behaviour. \n\nIt's gonna be a fun ride btw.\n\nNTA", "NTA. Your mom's terrible", "No offense, but you’re NTA and your mom sounds slow", "NTA\n\nSister needs to learn the consequences of lying all the time. Anything that \"isn't hers\" should be immediately thrown away. And your parents need to back up these actions.", "NTA. And I know what is going on here — the same thing happened to me. For your mom, your sister is her most brilliant creation — and every time they pull this double-team shit on you, your sister shines ever more brightly. It’s real. It’s their little thing. And it will never change. For what it’s worth, being my mother’s favorite has totally wrecked my sister’s life. She has nursed an eating disorder for 75 YEARS! Yes — seventy five years eating skinless baked chicken and iceberg lettuce, no dressing. (Baked potato on holidays only). My sister is mean through and through because she HAS to be in control of EVERYTHING, and she does it with sarcasm, belittling, and brinkmanship. Please believe me — it gets better. You can grow and go. Leave them to each other. I found a good therapist (and it was hard to do, but I kept looking). I’m re-parenting myself. I have legitimate friends who like me. A mother’s love is highly overrated — you can bloom and thrive without them.", "Nope. NTA. I think you're justified in standing up to your mother about this. This shouldn't be a big deal - it's just a make-up palette, and your sister is a kid who'll mess up in this way occasionally. But your mother should realize that in putting this on you, who had nothing to do with the whole thing, she made a mistake. If you can, tell her calmly and in a grownup way.", "Nta \n\nI would drop this family asap", "NTA. You were cruel for calling her bluff, but your sister lying all the time is OK? Wtf.", "NTA.\n\nI don't even know what to say about this. I have girls a bit older than you with the same age difference and I can't even imagine acting this way as a mom.", "NTA kind kf sounds like mom has a favourite or just can't be bothered to parent the second child.\n\nNo way would I be replacing that and that would be a tactic I'd continue using, keep throwing away her stuff until she learns to clean up after herself 🤷🏼‍♀️.\n\nReally the mom should be punishing her for lying and trying to weasel out of cleaning up her mess rather than you for forcing her to come clean.", "NTA\n\nShe said it wasn't hers, even after you said it was. Since no one claimed it, it must have been trash. If she had wanted to keep it she should have picked it up. She acting a spoiled brat, and can get over it. Your mom even knew you don't wear makeup but still insisted it was yours. This tells me that she is endorsing your sister's behavior, so is just as guilty in my opinion. Maybe next time your sister will take better care of her atuff.", "NTA and beautiful malicious compliance, I applaud your brain, I wouldn't have come up with that at 17.\n\nWhy should you be punished when your sister lied?  Your parents are giant assholes for enabling this behavior.", "NTA \n\nNothing to apologize for.  A few more items lost to trash might even teach your sister to clean her things up", "NTA I used to have the same problem when I was younger. Parents just know you’ll do it when ask sibling doesn’t do you end up being the tidier uper. Annoying. I do do it every time this happens until she learns her lesson.", "NTA Dang if I was your mom I’d be laughing my ass off. Ok it’s mine? Ok I guess I’ll take care of it then, in the trash you go, lol! You have better mom skills than your mom! I’m sorry I’m a mom and I’m rolling on this one!", "NTA. definitely. i’m a grown ass adult and i would’ve done the same for sure.", "Nta. Please let your mom read these post because she sucks so much. What kind of mom does this to one child? Why is it on you to pick it up?!? Why does her precious little princess never get held accountable? Even when its cleared she lied & told you to shut up?!? Yet mom still thinks you should apologize & buy her more to leave out? Start saving & run the moment you turn 18", "Big time NTA your sister needs to be responsible with her own stuff and your mom needs to hold her accountable instead of spoiling her.", "NTA well played OP", "NTA - your sister might have actually learned something, if you parents didn't step in to ruin that.  I think you were very clever.", "NTA. Why did your mom yell at you to clean it up and then be upset that you did?", "Your mom is enabling your sister's lies because it's easier to make you clean than to reprimand your sister all the time; she's doing a disservice to you both. Keep throwing away her things.\n\nNTA.", "Little sis is lucky. I would've found the nastiest garbage I could. The bathroom, the kitchen after cleaning the fridge, the yard waste full of dog crap.\n\nOf course, I had a little brother.", "Yeah, the only possible variation is to say \"Since it's not yours, hers, or mine, I'm going to throw it away. Does everyone still agree it's not theirs?\" and then you're 100% in the clear.\n\nYou're not TA if you DON'T give her a chance to rethink her lie, but you're definitely in the clear if you give her the chance and she doesn't back down.", "FAFO", "To avoid this situation in the future OP can just announce that she is about to throw the item out. That way her sister either has to accept the blame or willingly allow the item to be thrown out.", "The mother literally has proof the sister is a lying asshole. Nothing will change here, but at least OP knows for sure who the golden child is. I just hope they stop taking any more shit from their mother/sister demonic duo.", "In fact. Its moms job to parent not op. Id just keep going", "Yup as the elder sibling I feel this in my bones, and yet my parents wonder why we almost never talk.", "Make yourself harder to handle than your sister. Throw greater tantrums. See who they rush to appease THEN. \n\n(The preceding comment is not actually advice and should not be put into practice unless professionally  trained)", "Don't ask just say it's not yours, it's not mine so I'm just going to toss it.", "Don't be so sure.  The favoritism is so blatant here that Mom may very well punish OP for \"antagonizing\" or some such bullshit.", "\"Anonymous makeup\" is not a concept I thought I'd stumble upon today.", "Why show them the thread?   Sister will cry and Mom will punish OP for being \"cruel\" to her sister.", "But also stock up on pop corn to watch from a safe distance the Trainwreck that the Golden child will become when she has to go out into the world.", "Because it's easier.  \n\nThat's literally all. It's lazy parenting designed for nothing but temporary peace-keeping.", ">What you did was wrong\n\n\nNope. It wasn't. \nHer sister lies to get away with shit. Op gave her a direct consequence.", "Isn’t that a bit of a large accusation based on a single post?", "also mom clearly has a favorite child. is she a narc or something?", "Mommy dearest clearly has a Golden Child and it's not OP. The fact that even after the GC gets exposed lying to her, she still blames her other daughter. Because she knew the make-up was her sisters. But the mother had refused to believe this fact just minutes earlier and scolded her for leaving it lying around. No \"sorry for not believing you, OP\". No \"OP's sister, you're grounded for lying and for leaving your mess in the living-room for days\". No, it's still somehow the non-GC child that shoult be blamed and punished. \n\nWhen OP is grown and out of the house, her mother will wonder why she went LC. Especially when the GC starts to act out even more, and becomes a burden. She's going to wish she had a responsible child around to help in her old age.", "Grind it up and make a potion in front of sis", "The mom won't care.", "Mom's probably a narcissist. They love picking favorites and victims and pitting them against one another. It's called Triangulation. Her and Golden Child have a special bond and abusing OP is their joint activity.", "What don't you understand?", "'Goat, not sheep. :)\n\nBut yes, it sucks as l exactly as long as you allow yourself to be a part of the shitshow.  Granted OP is 17, but she's on the cusp of freedom.", "Not in my opinion - the way mom automatically believes sister and blames OP for all the messes and makes OP do the work of cleaning up, favoritism is emotional abuse", "She doesn't need to do that. \"It's not yours? OK , I'm going to bin it.\" And then bin it. A couple of those, and she won't have to say anything.", "Either one is fine, but I would be petty as fuck and tell both parents, especially the dad since he at least acknowledged her lying, that if this kind of thing keeps happening, she will keep or throw away whatever she claims isn't hers.\n\nShe either needs to keep better track of her stuff or she can't complain when OP takes it or throws it away.", "Sane idea: thank sis for the gift and when she freaks out - also caught in the lie, and forced to put whatever away herself or lose it for good.\n\nThat said, if OP reads this, you're already doing most of the picking up, probably because mom's too tired to deal with your sister's noise. Offer to just keep things tidy without the fuss if they pay you 10 bucks a week (or something).\n\nLike nothing crazy, but they're buying a cleaner house and less obnoxious behavior from your sister. You get some cash. It's a win win.", "Mom is definitely choosing the golden child and picking on OP.  Mom knows op doesn’t wear make up. So this was all pretend. She knew it belonged to her sister, but she didn’t want to start an argument with sister so she picked on OP to clean it up instead. \nOP NTA, don’t buy her a new one. Keep throwing stuff in the trash if it does not belong to anyone. Your sister is a cow.", "u/Financial_Special_25 is a bot.", "She can tell mom whatever she wants. Mom won't change or even care though.", "And what was OP supposed to do with it anyway, if not put it in the trash? It’s OP’s sister’s personal item, so it belongs in the sister’s room (or otherwise with the sister’s stuff). Was OP supposed to put it away by digging into her sister’s things?", "I’m not denying the narcissism but also, in many non narcissist households with siblings it’s always the younger siblings that be getting away with many things while the older siblings tend to get in trouble more/left out.\n\nCalled younger child syndrome the youngest sibling is always spoiled ect, middle child syndrome. Three sibling household when the middle child is left out or basically non existent and always in trouble because of the younger child. This is younger child sibling as it’s only 2 sibling household. I’ve experienced this myself being a middle child too.", "OP is the designated scapegoat and can do nothing right.\n\nSister is the golden child and can do nothing wrong.", "She's really good at gaslighting OP into thinking she might be the AH. That's tough to grow up with.", "Mom has chosen her golden child and it ain't op. So mom knows who the makeup belongs to. Sister says it's not hers. Op says it's not hers....mom decides it is ops and op needs to clean it up.\n\nRidiculous 100% NTA.\n\nMother is the AH and sister is entitled.", "But clean it up how? It’s not like it was rubbish, or dirty dishes, or laundry. It’s a single personal item left on a table. All that’s left to do is put it away into the room of the owner, so if it’s not OP’s then wtf is OP supposed to do with it? Binning it was really the only answer left.\n\nSo yes. This ridiculous charade of the sister and mother is essentially performance art to show OP that she’s designated as her sister’s servant, because expecting her to “clean up” her sister’s personal item is nonsensical.", "My parents literally told me I was the guinea pig which is why they realised how they treated me growing up (extremely strict and grounded me all the time) didn't work so are doing a different technique with my sister (can do whatever she wants) 💀💀", "Putting it away (wherever \"away\" is) *is* cleaning it up.", "The last sentence of the OP starts with \"Dad is the only one who... ...still thinks IATA\", so yes they mentioned dad, and yes, he sucks for going along with it.", "It’s the very last sentence of the post.", "I missed that; thanks for pointing it out.", "Oh man, I completely overlooked that mention--good catch and you're extremely correct about his role.  OP absolutely deserves better.  Hopefully, the next year brings independence.", "Easy miss since it’s literally just a snippet. But dude for real! Poor kid. Hope she gets out asap!", "And like...FULLY OUT or whatever terms she's healthy and thriving in.  Pretty sure she doesn't know what she's living with, but I know firsthand how you never understand how fucked up something is if you've never known different.  SNAFU is real.  And real sad to grow up in.", "I’m sorry you know what that’s like :( but agree 100%"]}