{"id": 21864, "submission_id": "14w2mlu", "title": "AITA for wanting my husband to keep getting chemo so that he witnesses his son's birth?", "selftext": "Okay this is a very difficult topic, I realize that so we both are going to write it. Me and my husband (29M) and before I start, I realize that you are internet strangers but we want a third opinion and it never hurts trying.\r  \n\r  \nMy husband (let's call him Liam) has blood cancer and it's been diagnosed too late, the doctor told us he's going to live a year and half or so, best guesses, if he gets treated, a few months without it. I'm pregnant, 3 months.\r  \n\r  \n**My perspective:**\r  \n\r  \nLiam is going to die, words are not enough to express the feelings I have right now and God knows that but I keep crying whenever I remember it so I just want to be strong for once and write how I feel. Liam and I always wanted to have a family, that's all that we ever wished for, and when we finally started it, he's going to disappear. It's not his fault, I'm never blaming him but I just want him to witness the birth of his son, just a photo of him and his son together, something to remember him by and something that my son is going to see in the future and something that doesn't make him regret it later.\r  \n\r  \nI just don't want him gone without knowing that his son is finally alive and healthy, I just want to have that moment but he doesn't want to keep getting chemo because he feels terrible, it's just a few months more, I keep telling him to hang on a little bit and he feels so conflicted right now.\r  \n\r  \n**Liam's perspective:**\r  \n\r  \nI never wanted to have chemo but my wife pressured me to do it, I understand how she feels and how my whole extended family feels, they want to see me more, they want to have more memories with me, they want to enjoy life with me a bit longer, but I can't I just can't do it anymore, my head is hairless, I feel so tired that I can't go to the gym like I used to anymore, it just hurts and I feel awful. What's the point of living if I can't enjoy it anymore? Just to see my son? I love my son before he's even born so so much but I don't even know if he's going to like me being miserable in a photo, I want to leave with dignity and I don't want him to see me like this 10 years later. I followed the treatment plan in the beginning for my wife and parents and siblings and all but I don't think I want to continue anymore and now she keeps trying to convince me to do otherwise. \r  \n\r  \nWe want your opinions. What would you do if you were in my place? AITA (the wife) for telling him to keep getting the treatment? AITA (Liam) for wanting to stop?\r  \n\r", "created_utc": 1689015040, "permalink": "/r/AmItheAsshole/comments/14w2mlu/aita_for_wanting_my_husband_to_keep_getting_chemo/", "score": 102, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Wanting to stop the treatment plan for the blood cancer I got, I might be the asshole for pushing him to keep getting it when he initially doesn't want to anymore and I might be the asshole for not wanting to follow it anymore.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Good Lord this is beyond reddits paygrade. NAH, you each have perfectly understandable feelings stemming from an unimaginably hard situation. No one is an asshole for wanting more time with a love one, but in the end the decision has to be made by the dying individual. You make that decision with the advice and thoughts of loved ones, but this is the most personal decision that can be made.", "NAH\n\nBut it's Liam's decision. \n\nOP, not to be harsh, but you're trying to get Liam to go through immense levels of anguish for a photo op. And eventually, if Liam caves to your request, someone is going to tell your son what happened. Imagine growing up with a picture of your dad, likely in obvious pain, and thinking he fought to be there for you. Now imagine that day when someone lets it slip that Liam never wanted to stick around, that he was in immense pain and discomfort, and he put himself through that hell because you, OP, demanded it.\n\nAnd to be crystal clear, you would absolutely be the asshole if this wasn't cancer. With cancer, all bets are off. People make crazy decisions all the time. Allow your husband to die with the dignity he is begging you for. Support him in it. Make his last days, weeks, months, as pleasant as possible. Stop asking for something so superficial. \n\nAnd if you really want a picture of Liam with your son, I'm an artist, so just message me privately, and I will be glad to photo edit the two of them together, or paint a portrait of them free of charge. I know (from all too painful experience) how hard it is to let someone go to cancer-- to come to terms with someone stopping treatment. If there is truly no hope, living a horrible life to squeeze one more day in is no life. Liam has come to this realization, and you have to as well, for Liam's sake.", "Friends, I truly have no words other than to say NAH. I am so sorry. \n\nThat said, I am going to gently suggest that Liam is entitled to do as he wishes. Nothing about this is easy or fair, and I totally and completely understand why Mrs. Liam wants what she wants. \n\nBut this is Liam's body, and it's what's left of his life. One cannot just live for other people. It is valid and right to live for yourself, too.", "NAH.  Given that you can't have what both of you would most prefer, you both want what you want and there is nothing wrong with that.  It is just very sad.  \n\nHowever. Because it's Liam's pain and Liam's life, Liam gets to decide.    Don't try to push him into prolonging his pain, since he has said that's not what he wants.  \n\nMaybe the two of you together can think of some ways to connect Liam and the future child - does he want to make video or audio recordings, choose some of his belongings to be set aside, pose for a picture with his hand on your belly or at the ultrasound appointment, etc.  \n\nOP, you do need some support to grieve not getting to see Liam be a dad the way you wanted.  Liam shouldn't have to be the one to comfort you.  If you don't have some friends/family who can just listen to you (ideally people who are closer to you than to Liam), then you should probably start looking for a counsellor of some kind.", "NAH\n\nThat being said, as someone who watched someone very close to me go through 9 months of chemo, and then pass away. Please don't pressure him to do this. \n\nI completely understand why you want him to make it to that moment at the very least, but I beg you to consider what the next six, and a half months will be like for him if he does. He will be in so much more pain than you can possibly imagine right now. \n\nThis is going to be a nightmare for both of you, no matter what you decide, but if you push him to do this his last few months with you are going to be unbearable for him. \n\nAfter my family member passed the biggest regret that any of us had was that several of my family members pushed her to have chemo instead of letting her do it on her terms. By the end she was already gone. She was not her anymore, and she was begging us to just let her go in her few moments where she was coherent.\n\nPlease don't make him do this. Let him choose to do this on his own terms.", "Liam - you won’t be around for your sons life and it’s heartbreaking. I’m so sorry.  \n\nOne thing you can do is write letters or record videos for him.  You can write a letter for his first day of school, first heartbreak, getting a car, graduation, marriage.  Anything you can think of.  \n\nYou can record yourself reading a bedtime story. \n\nAlso, I know it’s not my life so I can’t say what you should pick.  But I think the story of your dad fought every day so he could see you born would be meaningful to your son.", "Chemo’s not a guarantee of anything and it puts a lot on the body. Even if he did do it, he may be too weak to be around for the birth and honestly him having a compromised immunity and being at a hospital isn’t a good idea.\n\nThis is his health. It’s his cancer. He gets to decide how to proceed with treatment.", "Nobody is the asshole here, this is just an impossible scenario with no winners.\n\nUltimately it boils down to what is right for Liam and how he wants to navigate this.\n\nDeepest condolences; the closest analogous situation I have is watching my grandmother succumb to brain cancer and that was impossible to deal with. I cannot fathom it happening to a spouse on the verge of having a child.\n\nMay you get through this with as much grace as possible.", "I am a chemo/radiation survivor and let me tell you, if I am ever diagnosed with cancer again, I will *NOT* be doing chemo again!\n\nWhat you need to know ...\n\n1.  Chemo is NOT a guarantee of more time.\n2.  More time does not equate to having a quality of life.\n3.  Chemo is pouring gallons of poisonous chemicals into your body that kills the bad cells AND the good cells.  It destroys you from within and doesn't guarantee it will get the cancer.\n4.  The chemo side effects are the single, hardest, most painful thing I have ever undergone.  The bone pain nearly drove me crazy and I have a high threshold of pain (I walked on a broken foot for a couple days right after I started chemo before getting it diagnosed). Nothing touches the pain.  Nothing gives you relief.  It hurts to sit, stand, and lay down.  You don't eat, you can't sleep, all you can do is pray that the end comes soon.\n5.  Baldness was the least of my worries.  Do you have any idea of what it feels like to be nauseous 24/7 for 365 days?  I am not talking upset stomach, i am talking about carrying a trash can around at work because I never knew when I would need to vomit because I felt like I was going to vomit all the time.  My doctor was treating me for the overwhelming nausea the entire time but nothing worked.  Very little stayed down.  I ended up getting regular IV supplemental nutrition which was horrible in and of itself.  \n\nOP, you can want what you want but this is not your decision.  You selfishly want him to be around for the birth - which is entirely understandable.  However you need to understand that even with chemo, he may not make it that long.  You also need to understand that just because he takes the chemo, he isn't going to be himself.  Are you going to be able to clean up his vomit when he gets sick in the muddle of the night?  Are you going to clean up after him when he is too weak to make it to the bathroom in the middle of the night?  Are you willing to stay on top of the dozens of medications he will need to take, making sure he takes them when he us supposed to in the right dosage - because chemo brain is real.  He will be able to read the pill bottles but won't be able to make sense of the directions.  When he is too weak to walk into the infusion center, will you push him in the wheelchair, even when you are 9 months pregnant?  You need to understand what you are asking and what you are getting into.\n\nThis is heartbreaking.  I get it.  But your wishes do not trump your husband's reality.  If he has made peace with his own mortality, you have no right to demand anything.  Make him comfortable and let him go.  It will be much more peaceful for him.\n\nI am sorry for you both.  OP you are an AH only if you try to force your choice on your husband.", "Chemo has awful side effects and often means that the final months of life are a torture not a blessing. The person with cancer gets to decide the path they will follow, the decision is difficult enough without anyone putting extra pressure on.", "No one is an AH, totally understand where both of your are coming from and I'm so sorry, I have absolutely no idea what I would do in your situation. \n\nThe only suggestion I have is perhaps Liam should start a video diary, share memories of your life, how you both met, how you feel about your son, about your wife, the things you wish you could be a part of. The things you'd do if you could. \nI suggest the two of you share special moments together, record and photo as many things as you can. \nThose can be the things you cherish and share with your son.", "NAH. Just pain. \nPain from an illness and treatment. Pain of loosing someone you love. Pain for not being to meet the son and having the family you’ve always wanted. Pain for dreams that won’t come true. \n\nTake pictures now. Do your maternity shoot. Get pictures of the two of you together.  Have him choose a special blanket and stuffed animal. Have him choose a few milestone gifts. Even if it’s something you have to buy closer to when the time comes.  If it’s a blanket. Take pictures of him snuggling the blanket and the stuffy. So that your son can look at them and see how excited he was and how much his dad wanted to hold him.  That his dad picked these things out for him. \nAs others have said. Make a video of him saying how much he wanted to be a dad and was looking forward to meeting him. Write letters for important days (starting school, elementary school grad? Middle school, 16th birthday, Graduation. First car, first girlfriend, first heartbreak, wedding, first grandchild). Or just journal, be it hand written or typed.  Spill thoughts of things you’d want to share.  First car.  First crush. First big injury. A funny story.  Because while a picture of his dad holding him is nice, being able to hand your son an envelope or something and have dad share a story or advice is something that will last a lifetime.  That dad made sure he would know he loved him enough that he fought long enough to make sure that he’d have something special for a long time.     And before you stick them in envelopes make sure you make a copy or a digital copy just encase something happens like a fire so those words never get lost. \nFocus on now because he might not make it even with the chemo. Don’t put these special things off in hopes of a picture you might never get.  6 months is a long time. And as much as that might be a special picture, your husband might look like death as his body gets ravaged.  So there will always be a sadness to that picture as even if that picture is a great picture the strength and life isn’t going to shine through like it would if the picture happened today.", "This isn't for AITA. But, for the bots, NAH.\n\nI don't think I would get chemo, nor would I force my husband to do so in this situation. But OP isn't the AH for wanting to spend more time with her husband, and her husband isn't the AH for wanting to try and enjoy (or at least, not hate) what little time he has left.", " NAH this is a heartbreaking situation. I think you have a right to voice your opinion as long as you recognize that it’s your husbands decision in the end. Husband should hear out his wife but shouldn’t feel pressured to make his last days more miserable than they have to be.", "I will say NAH, but this is not an AITA question. It’s a tragic personal situation. I just finished eight rounds of chemo, but my situation is completely different because the chemo could save my life. While I understand where the wife is coming from, this is 100% the husband’s decision. Cancer takes away so much of our agency. It’s easy to be on the outside and say he should choose the course that will extend his life, but it is his life. My heart goes out to all three of you and your family.\n\nETA: i realized that saying I just finished 8 rounds of chemo could suggest I meant “It’s not such a big deal.”  I meant the absolute opposite. It is a massive deal.\n\nChemo regimens vary a lot, and people’s reactions to any given chemo regimen vary a lot. But it can absolutely wreck you and the effects can be cumulative. \n\nHusband has been through it and it has been bad enough that he has decided he’s through. What I meant is, I understand why he might feel that way and I respect it, however hard it might be for others to understand.", "NAH. No assholes here.\n\nI'm so deeply sorry you are going through this, but I have to take husband's side. His quality of life is far more important than the length of life. \n\nThere are many ways for son to remember his father. I would take videos, make audio recordings, leave behind letters and gifts. There are many, many ways to preserve your love for him. \n\nTo the wife- please seek a regular therapist because you're at high risk of pregnancy complications from stress and PPD. \n\nStick together until the end. I hope you both find some peace.", "NAH. I am so terribly sorry that you both have been put in this situation.\n\nTo OP: chemotherapy is brutal. At some point, value of life has to come into question. Is Liam going to be comfortable if he continues with treatment? Having your husband's best interest in mind is the best way to go forward from here.\n\nTo Liam: you're exhausted, tired of the extra work that comes with knowing a loved one is going to pass, and watching your family try to grapple with and prepare for reality. I wish you peace as you enter this final stretch.\n\nYou're both here to support each other. While I wish Liam could meet your son, maintaining his dignity is something he treasures, and that choice should be respected. Even if Liam isn't there in body for the birth of your son, he sure as hell will be in spirit.", "NAH. This isn't really an AITA situation. That said, I think it's cruel to force someone to continue to suffer. I get that you guys have wanted a family and your son is almost here, but cancer wasn't part of that plan and it can't be ignored. The timing is the pits, and I'm awfully sorry that you guys are enduring this, but I think the person with the cancer needs to be the one to decide how to spend their remaining time. Liam can write a letter or take a video for his son to have one day, you can get a lovely photo of Liam touching mom's belly. Dragging Liam through months of chemo so that he can be ill and miserable in a photo with the baby he won't get to watch grow up anyway, in my opinion, feels worse than letting him go when its his time knowing that his son will grow up loved and hearing memories of who his dad was at his best.", "NAH.\n\nAs I was once going through cancer therapy I can relate to Liam's view a lot.\n\nMonths of chemotherapy sucks the will of living out of people as those drugs make you feel miserable (side effects, lots of them). Very very miserable. And that feeling increases from cycle to cycle. I went through this and know exactly how it feels. It just wears people out.\n\nI had a chance of surviving, but trust me, at some point I wanted to throw in the towel anyway because I felt so bad. Words to describe this feeling escape me at the moment. My apologies.\n\nHowever, I had support from my family to go through this time and finished chemotherapy. Without them I wouldn't be typing this.\n\nBut: I am also a dad and seeing my child for the first time is an experience I dont want to have missed.\n\nI hope you guys find an agreement on this one.", "My thoughts and prayers are with you both. I can’t imagine how incredibly painful this is for you both.\n\nI understand both sides of this situation.\n\nSo here is my suggestion. Sit down and write letters to your son for birthday, for graduation, for his wedding, for when he becomes a father. Leave these letters with your family go give to him at appropriate times.\n\nAlso record messages for him to watch. This way he gets to not only have written letters but he can hear your voice. He will cherish all of these.\n\nNow for the hard part. As a internet stranger this is my take. You and your wife can either give up on the chemo and spend what precious time you have left with each other. Maybe take a second honeymoon. Do something that you both have always wanted to do. But spend quality time. And only GOD knows but you may be around in 6 months and see your son. No one knows when their life will be up but you would spend the time you have left enjoying the people you love the most. You can decorate your son’s nursery.\n\nOr \n\nYou and your wife can decide to fight continue the chemo. You will be constantly at the hospital. You will be week and tired. Your life will revolve around dr and hospitals. You will more time but not quality time with your family. You will not feel like doing anything. You will be existing not living. And the sad fact is you still may not make it to see your child born. \n\nThis is a heartbreaking situation. There is no right answer. \n\nBut no matter what you do please leave your son with memories of you. You and your wife fix up a box with letters and home movies. I think this may be your happy compromise.\n\n\nFor your wife. Let me leave you with this thought. Do you want your last memories of your life with your husband to be of one’s with hospitals and him suffering. Or do you want your last memories of him to be dancing with you in the rain, or walking on a beach. Or even decorating your sons nursery. The picture you want for your son will not show him the man his father is. It will show him the father that was sick. That was tired. \n\nYour memories will be what your son holds on too. So make those memories happier ones instead of ones of him suffering and stuck in a hospital.", "love him unconditionally. it’s his choice, support it.", "NAH. there could never be assholes in this situation. OP, honey, your husband is making the hardest choice he’s ever had to make. would you rather have him by your side a little longer, miserable, in pain, living unhappily, or would you rather enjoy the short time you guys have together as quality time, not counting the days until Liam’s condition worsens anyway and he passes? \n\nyou’re not an asshole, honey, but i’m siding with your husband here. i know you do love your son and you know your husband does, too, but it obviously is hard for him to project into a relationship with a baby he will maybe never even meet, or only for a very short period of time the baby will in no way be able to remember. your husband wants to focus on you, the love of his life, whom he knows and knows how to take care of.\n\nlet him take care of you while he still can, don’t make him undergo chemo and make him regret living every additional day, agonizing in pain. he will not be able to father your baby, let him enjoy being your husband while he still can.\n\ngood luck to the two of you, for whatever the future holds. i’ll keep you in my prayers.", "THE SOFTEST YTA I CAN GIVE. SO SOFT IT'S LIKE COTTON CANDY. \n\nThis is an awful time for both of you.\n\nI understand why you would want him to do chemo, but I've seen what it does to a person. It's not nice. By the time your son is born, your husband (on chemo) will most likely be tired, cranky, and sickly.\n\nIt's best that you respect his decision in not taking the treatment. Help him live the rest of his days happily because that's honestly all you can do.\n\nGood luck, guys.", "There are no good answers here; my personal take is to have Liam follow whatever treatment he wants to follow. Miserable and sick life doesn’t help anyone, if he can feel better and make some positive memories, that’s what I’d want. Use the time to write letters to your child, advice,memories, hopes, dreams, etc. have bucket list experiences with wife…make positive memories instead of having the last months be painful. Wife will actually remember these times, baby won’t. And it doesn’t sound like chemo really gives you any real advantages. \n\nHaving said that, it’s easy for me to sit on the outside and not have to experience what you’re both going through. \n\nNAH.", "NAH - this is an impossible situation. I am so sorry you guys are dealing with this, and I want to cry on your behalf...\n\nLiam - do not feel guilty about wanting to live your last few months feeling relatively good and being there for your wife. There is beauty in living a full, but short life. Liam's Wife - don't pressure him. Make all the memories you can while he's here. Take a million pictures with the belly and with you. Do the things you've put off doing. He may make it to see his baby born, but if he's in treatment he'll be miserable and just existing. Make the most of his LIFE.\n\nSending so much love your guys' way!", "Soft YTA\nI understand your point of view, but your husband is suffering. Why make him suffer for so many months just so he can meet his son? Also it’s his body, his decision. I recently lost my mom to a very fast, brutal cancer (her prognosis was the same as your husband’s) and she tried chemo, but suffered too much and so stopped. Chemo did almost nothing for her except make the little time she had, worse than she was.\nI am so sorry this is happening to you guys. I wouldn’t wish it on my worst enemy. One thing I can advise is to make memories while you can, especially videos.", "NAH. This is above Reddit’s pay grade.", "My thoughts and prayers are with you all, but ultimately, Liam, it’s your body, your choice. Your spirit will live on through the stories and memories your friends and family have, and they will be passed on to your son. ❤️", "Oh my god. I really don’t think there is a right or wrong side, if anyone is an asshole it’s Cancer. There are no winners here.\n\nVery sorry for you both. NAH", "NAH, of I were in husband's shoes I would do the chemo. Even one picture together will be cherished by a child for all their days.", "This is Liams decision. So sorry for what both of you are loosing.", "this is above reddits pay grade, so NAH. \n\nBut i will offer you my own little story. Growing up one of my Best friends was raised by her mother and stepfather ( she calls him dad as he cam into her life at 1yo), because her dad passed away from cancer 3 months after she was born. They found out very similar timing to you and he did chemo so he could hold his little girl. She is now a woman in her mid 20's and every year on her bio fathers Bday that she loves and misses him. The picture of him holding her as a baby is one of the most precious things she owns. She has it in her first home with her partner and even though he was so sick she is so thankful she has that of him. ( her stepdad was great and they have a great relationship too).", "Christ, this is tough. To get it out of the way NAH. I'm so sorry you three.\n\n What I can say is that my father didn't want to go through chemotherapy, but was pressured.\n\n I would never let a loved one make that mistake again.", "Remember to write v things for all of your sons milestones. Teach him things on how to be a man.  Make videos,  record your voice singing lullabys, anything and even you can for your son.  Then do some similar for your wife and family.  This is an unfortunate hand you've been delt, but you get to live on in their memories. Best of luck,", "NAH\n\nWords can't touch how sentimental and devastating your (entire family) situation is.  I wish I could give my two cents because this is Reddit, but this is LIFE.  The post is clear that there is a LOT of LOVE and for that I hope there is some consolation.  Best of luck.", "Oof I'm so sorry for what you are going through. You are not an asshole for wanting what you want but ultimately he deserves the right to choose what he does with his body. YWBTA if you pressure him.", "NAH. \n\nOP, I'm so sorry that you have to deal with this. Please don't put Liam through this. There's no guarantee that chemo will prolong Liam's life beyond your delivery date. There's no guarantee that stopping chemo will mean Liam isn't present for this child's birth. The only guarantee is that Liam's quality of life in his final days will be horrible if he continues the treatments. Please don't force him. \n\nLiam, I'm so sorry that you have to deal with this. You have a right to quality of life in your final days.  It's your call, and no one else's. If you want to stop, stop.", "NAH.  You are both going through something horrible.  Can you create a video message to play for your son?  That way he has something and your wife has a keepsake.\n\nI'm so sorry.  Ultimately, dad, it's your decision.  If you need to stop chemo, go ahead and make the arrangements you need to make.", "Obviously no one is an AH, but my vote is for Liam to have the choice & dignity of deciding how to spend the last few moments of his life.", "Soft YTA. My step mom got diagnosed stage 4 pancreatic cancer. She quit chemo after one round. Chemo is torture and it’s selfish to ask a human to torture themselves for your own comfort and closure. Let them die in peace and *enjoy* the last of their life. This simply cannot happen if they’re on chemotherapy. The dinners that I had with my step mom after she finished chemo are some of the most treasured moments I was so blessed to have.", "YTA\n\nLook I'm really sorry to both of you. But even if Liam gets chemo, there is no guarantee he will be well enough to be present at the birth and he's not going to have any quality of life when meeting your baby. \n\nLiam's decisions and feelings about continuing chemo take precedence here. But OP, aside from that, you're seeing up situation where your husband is going into hospice care while you have a small infant to care for. There's no good time for Liam to die, but it's going to happen. And the time line you're setting up is not necessarily going to be better for anyone involved.", "Nah God, thats awful. I am so fucking sorry that you two are going through this.  \n\nI think, at the end of the day, its Liams body. Liam has to deal with the side effects and feeling like shit.  What if he gets chemo, but is to ill to be in your room?   Immune compromised peolle really *shouldn't* be in the hospital.", "Soft YTA, you can't decided what a cancer patient does. You can offer advice, but it's his body, his choice. Plus chemo isn't a \"miracle\" treatment. Sometimes it helps and sometimes it makes things 10x worse. \n\nI had a Aunt fighting breast cancer a few years ago, she denied the chemo treatment cause it was killing her faster than the cancer itself. \n\nI know you don't want to lose him, but you don't choose when Death comes a knocking.", "Nah- let Liam enjoy the time he has left. Instead of pushing for a picture with the baby, how about you two work on creating videos, letters and other things to show to your child when he's gone?", "NAH:  \n\n\nWhat you could do instead of a photo with your son:\n\nWrite a journal or a letter to him. Give all your dad advice. Write how much you already love him. \n\nIn the end it's Liam's life, Liam's decision. I can't imagine what any of you are going through. My heart is breaking for you all.", "YTA (though I obviously don’t actually want to call either of you AHs). Simply, the person dying gets to make the choice. This is one of very few impactful choices he has left. That choice will affect the rest of his life, short as it may be. Not asking him to spend the rest of his life having to pick between chemo misery or pressure/guilt from you would be a small piece of comfort and control you can give him.", "It’s hard to call anyone TA for how they’re handling an absolutely horrific situation, but I’m coming down on a slight YTA for wife. Your feelings are understandable but you become TA when you pressure your husband to continue suffering.", "NAH", "I don’t think either of you is the AH. I understand both perspectives. Despite the pain and overall distress of the circumstances, I believe the opportunity to hold your newborn child for even a short period of time is worth it.", "Oh sweet couple ... there is no right or wrong answer here. I am praying for all of you. But if Liam discontinues chemo, he'll be able to live life to the fullest while he's still here. He can make videos, write letters, take photos with the bump and ultrasounds. Don't continue chemo - in your case, it's not worth the side effects. Look into alternatives to dull the symptoms. And NAH... just grief and love.", "[deleted]", "NAH.  I cannot imagine what you two are going through, but I can feel your heartbreak.\n\nMy only advice is to read the book Being Mortal by Atul Gawande.  \n\nI hope your reaming time together is happy.  I am so sorry for your loss.", "NAH - What a truly horrific situation\n\n&#x200B;\n\nI get where wife is coming from - the experiences you already miss that'll never happen. You think a moment and a photo will help, but kiddo will never know dad, as hard as that is, so a photo and a moment where you see dad holding the baby wont help you\n\n&#x200B;\n\nFor husband to make the decision to forego meeting nipper shows you just what his situation is, no matter how he may try to hide it from you. The fatigue, frustration and LOTS of pain\n\n&#x200B;\n\nFWIW, I take snapshots in my mind, of instances. You know those moments, you recognise them immediately. Stop, and focus on them. Snapshot them, burn them into your memory\n\nYour present becomes your future, because baby is part of your fella. That they can't exist at the same time is the tragedy you need to come to terms with", "There are no assholes here; just two grieving people. I'm so sorry for what you are going through especially while pregnant but I watched my father struggle through chemo and die slowly over the course of several years. It's awful. He was in so much pain and it hurt my heart to watch it. He wasn't himself anymore; just a broken shell of the man I knew.\n\nI know you want to hold on for every moment that you can squeeze out of this--and I don't blame you--but please be strong enough to let him go. You are torturing Liam by forcing him to go through chemo to last a few more months.", "NAH...Under these circumstances I would likely choose the chemo.  I would fight for the goal of being a family, even if just for a short time. I'm so sorry and wish you peace.", "NAH.\n\nOpinion: Live long enough to see and hold your son. He will cherish that picture of you holding him.  Please don’t go w/o meeting him. \n\nStrength for all three of you.", "Soft YTA \n\nI can’t even begin to imagine how you’re feeling OP but if you genuinely love someone then it’s cruel to expect them to extend their suffering when you already know the outcome.\n\nMy heart goes out to both of you.", "I also say NAH\nUltimately I think Liam has to be the deciding vote. I understand wanting him to meet his son but he deserves to decide if he is too tired to continue treatment when the end is already a done deal\nI am so sorry for your family", "Neither one of you are TA here. In the end, it's Liam's body to do with as he pleases and we all deserve to live and die on our own terms and few of us get the chance to make the decision on where and how to go. Let Liam do his own thing. Record a video or videos for your child, while Liam is still well enough to do it and  then let Liam pick his own path. Much love and best wishes to you both and your unborn child.", "NAH. Sorry, this is way above my paygrade. The emotional enormity of this is beyond who is and isn't a cloaca. You both have strong, reasonable points and your emotions are collectively valid. You're both suffering albeit differently. Cancer is pure evil.\n\nIn the end, the only people who know the answer is you both. You both need to look deep into yourselves and ask what you would want if the positions were reversed.\n\nMy heart breaks for you two.", "My dad died recently, and I had to work with his medical team to interpret his medical directive. My heart is with you. These are difficult days. There are no a$$holes here. I offer this suggestion for your consideration. Talk with hospice and palliative care nurses. They may offer some wisdom or some guidance during these difficult days. \n\nMy dad’s last weeks were horrible. He was in pain. He was confused. He moved beyond suffering into being tortured by his disease. I’m still struggling with those sounds and images in my brain. My last moments with him were just overwhelming and painful because I couldn’t fix him, and I couldn’t make it better, and I couldn’t reassure him about what’s next. \n\nAs I planned his funeral, I did one really small but really healing thing, but I didn’t quite expect it to be so helpful to me personally. My dad was a veteran, and he was buried at a National Cemetery, and we opted for all the pageantry of a military funeral, and I had a photographer photograph the service as it moved quickly. My dad was cremated, so photography wasn’t intrusive on his personal being. The photographer captured all the little details of the event, and all the humans who supported us that day. I love these photos. I look at them almost daily. They are beautiful. They are replacing the awful memories. They humanize our death experience. They make me feel proud of his service. \n\nSometimes, we have an expectation of how to process grief and loss, and sometimes it looks different. Sending ❤️.", "The softest YTA. Please let Liam take what time he has left to have conversations with his son that he won't get to have later. Things like vide messages and letters that I'm sure he won't be up to writing or filming if he feels miserable. \n\nThe picture that you'll have isn't worth the time he has left.", "Why don’t you make an audio or video series for your son? This would mean more than a picture of you together I believe. Maybe talk about events from your childhood, talk about life lessons, talk about loving his mother, talk about loving him and how sorry you are to leave? I think this might give everyone a measure of peace. So very sorry!", "NAH\n\nHave you talked to the doctors to see if there is an in-between option, such as palliative chemotherapy? It depends on his exact diagnosis and stage, but there may be an option to do a lighter chemotherapy regimen that would give him a little more time, while having fewer side effects and misery than the \"full court press\" (chemo that is intended for a cure). \n\nUltimately though, it's up to Liam to decide how much longer he wants to hang on. There's no guarantee he would live long enough for the birth anyway - he could get a complication from the chemo and decline faster than expected. If he's ready to go, he should go. Maybe he could record some voice messages or write letters for his son to read later, or other ways to connect after his death.", "NAH.\n\nI say this gently, the person who is dying should be making their own decisions.  Seeing the baby born isn't for the baby's benefit, and it clearly isn't for Liam's benefit either.", "NAH. Liam, could you work with your wife to make videos, recordings, letters, etc. while you are still feeling up to it? That will preserve more of who you are as a person than a photograph can.", "NAH\n\nWhat about doing a maternity shoot where he in in pics with the baby bump which your son can see later and see how much his dad wanted him and loved him?\n\nI am so sorry y'all are going through this ❤️", "NAH\n\nI see a lot of suggestions for creating memories for your son later, but the one I don't see is a composite photo as this seems to be important to OP.\n\nFind or take a photo in a suitable position for holding a baby, then add him in later if chemo is discontinued or fails. \n\nThis is a terrible situation to be in, and I wish peace for you both and your family.", "All i know is, when someone decides that they are done, thats it.\n\nIt hurts, but it would be better to let him go like his wish.\n\nMy mother decided that she was done with chemo a couple years ago,  and that marked.the beginning of the end. Those decisions to do that arent taken lightly and its inpossible to imagine the pain they are going through.\n\nTough situation", "NTA, both sides are understandable. \nYou wanting him to be there is very understandable.\nIt is a dilemma in its core definition,  I would still take his side, let him take the last of his life on his terms. \n\nI wish you strength.", "NAH. Obviously. \n\nI can’t even imagine what you are both going through. \n\nI tend to feel that since there isn’t a clear right or wrong answer, in the end Liam is the one living in his failing body, and ultimately the decision has to be his. \n\nI’d like to offer a 3rd possible suggestion. There are “natural” and “holistic” cancer treatments that exist in the world. I am positive that they aren’t going to be a cure. But when I was a teen, a teacher of mine chose to stop chemo and pursue alternative treatments. She still died, but she was healthier and felt better in the last 6 months or so of her life. \n\nI’m just saying maybe there’s another treatment option that might buy a little time, maybe not as much time as the chemo, but better quality time. Perhaps enough time to meet the baby. Or if not, perhaps at least increase the quality of the time that is left.", "YTA it's poison, if there's no chance then it's really just putting him through so much pain for no reason, he's going to die and i'm so sorry your family is going through this but his last months should be comfortable not suffering through chemo", "Wife YTA, husband N T A, it’s extremely selfish to want your husband to continue to go through all this pain and suffering all because YOU want a freaking photo! I couldn’t imagine forcing my dying spouse to continue to go through pain and pump poison into his body just so I could get something I WANTED out of it.", "Look, not to be the biggest asshole in the universe but does the pregnancy pre date the cancer diagnosis or did it come along after? \n\nIf you decided to have a baby KNOWING one parent was going to die then ESH", "I would look for alternative treatments besides chemo. I knew a guy got diagnosed with intra ocular melanoma. He did alternative therapies no chemo and he is alive and his cancer is undetectable You could try a weaker version of chemo or other anti cancer drugs along with accpuncture, herbs and other alternative therapies.", "INFO\n\nI mean, are you **ready** to be a single parent?\n\nDoes it even make sense to be thinking about keeping the fetus, now that you have this news?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nOkay this is a very difficult topic, I realize that so we both are going to write it. Me and my husband (29M) and before I start, I realize that you are internet strangers but we want a third opinion and it never hurts trying.\r  \n\r  \nMy husband (let's call him Liam) has blood cancer and it's been diagnosed too late, the doctor told us he's going to live a year and half or so, best guesses, if he gets treated, a few months without it. I'm pregnant, 3 months.\r  \n\r  \n**My perspective:**\r  \n\r  \nLiam is going to die, words are not enough to express the feelings I have right now and God knows that but I keep crying whenever I remember it so I just want to be strong for once and write how I feel. Liam and I always wanted to have a family, that's all that we ever wished for, and when we finally started it, he's going to disappear. It's not his fault, I'm never blaming him but I just want him to witness the birth of his son, just a photo of him and his son together, something to remember him by and something that my son is going to see in the future and something that doesn't make him regret it later.\r  \n\r  \nI just don't want him gone without knowing that his son is finally alive and healthy, I just want to have that moment but he doesn't want to keep getting chemo because he feels terrible, it's just a few months more, I keep telling him to hang on a little bit and he feels so conflicted right now.\r  \n\r  \n**Liam's perspective:**\r  \n\r  \nI never wanted to have chemo but my wife pressured me to do it, I understand how she feels and how my whole extended family feels, they want to see me more, they want to have more memories with me, they want to enjoy life with me a bit longer, but I can't I just can't do it anymore, my head is hairless, I feel so tired that I can't go to the gym like I used to anymore, it just hurts and I feel awful. What's the point of living if I can't enjoy it anymore? Just to see my son? I love my son before he's even born so so much but I don't even know if he's going to like me being miserable in a photo, I want to leave with dignity and I don't want him to see me like this 10 years later. I followed the treatment plan in the beginning for my wife and parents and siblings and all but I don't think I want to continue anymore and now she keeps trying to convince me to do otherwise. \r  \n\r  \nWe want your opinions. What would you do if you were in my place? AITA (the wife) for telling him to keep getting the treatment? AITA (Liam) for wanting to stop?\r  \n\r\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NAH this is so hard I’m so so sorry for you both. I wonder if your husband went off chemo with that extra energy and peace what you could to to plan some memories and special moments for your child in the future. \n\nI understand you want your husband at the birth and that photo of him with your child, but perhaps that energy can be better spent now filming videos or writing letters. There have to be other options to have a presence and an impact in your child’s life for years to come, while also respecting your husbands wish to discontinue treatment that is ruining his quality of life. I do believe the old adage of quality over quantity. \n\nIm so sorry again for you both and wishing you love and peace in the time you have together", "Had a good friend who was taking chemo. He confided to me that he only did it for his wife. He was sick and miserable. Told me he wouldn’t wish that on a dog. And he loved his dogs. \nAs hard as this is, this is his choice. Support him as he tries to leave with some dignity.", "A very soft YTA.  I completely understand wanting your husband to meet your baby & being able to have a photo of them together…BUT, your husband must be absolutely miserable to not want that for himself.  You need to find a way to respect that & let him live out his final days the way he wants.  Praying for your family.", "NAH he isn’t wrong for not wanting chemo and you aren’t wrong for wanting him to live long enough to be at the birth. The real AH of this scenario is cancer. The internet strangers are sending you virtual hugs.", "You are asking Liam to suffer additional mental and physical agony for a picture he does not want to take. It was selfish but understandable that you wanted him to get chemo at all. Let Liam enjoy the rest of his life and let him die in peace.", "Chemotherapy regimens are sometimes worse than the actual cancer. The quality of life the person undergoing chemo has is barely worth living because the toll of the chemo has on the remaining healthy tissues is devastating. You're not wrong for wanting your husband to continue treatment, but in the end, do you want his last month with you to be remembered as the worst months of his life? You want happy, joyous memories, so making him continue chemo will rob him of peace and you of happy memories. \n\nThis situation is devastating, no matter how you approach it. Live in the present and don't focus on the future that will never be. It would be a heaven sent gift for your husband to see his son before passing, however that may not be in the cards. Try to capture the remaining moments to document and cherish and share with your son as he grows up and allows them to learn who their father was and would have been. \n\nI'm so sorry you all are going through this. I pray for your peace.", "NAH\n\nI see everyone's perspective.  It's an immensely shitty situation.  You both have valid points.\n\nIt's extremely difficult to lose someone so young and it's perfectly normal to want to spend as much time with them as possible.  It's also perfectly normal to want him there for the birth of his son.  You need support to be able to get through the pregnancy and he deserves to meet his child at least once.\n\nAt the same time, this hit me hard.\n\n> I want to leave with dignity and I don't want him to see me like this 10 years later.\n\nAs someone that's watched 2 grandparents die from a debilitating disease that left them a shell of their formal selves (with a 3rd somehow still hanging on), I understand this too well.  My wife never met my 1 grandfather and I won't let her meet my remaining grandfather because she'll never see him how he was, she'll just see the empty shell he is today.  I've given her explicit instructions that if that were to ever happen to me to just let me go and not prolong anything.\n\nOP, your husband should put together a book with as many moments from his life as you can possibly get together.  Graduations, birthdays, your wedding, etc.  Maybe some handwritten blurbs from him.  Just something, anything, that you can show your child one day and say \"look how great your dad was\".  It'll never replace his father but it will help him know something about the kind of man he was.", "I feel like this one might be above this sub's pay grade.", "I don't think anyone is an  A hole in this case! \n\n  The wife has her reasons for wanting her husband to get Chemo. But she is forgetting quality over quantity.   I feel for her I would want my husband to stay alive as long as possible, but I also wouldn't want him suffering.  \n\n   This is not fair for anyone involved!!\n\n  I am sorry but your husband is the one being put through these horrible treatments that give no guarantee that he will survive 6 months on. He feels horrible and wishes for death to stop the pain and sickness. He gets veto power over this.    \n\n   Take lots  of pictures and prepare videos for your son.  Maybe write some letters to your son for different milestones in life.  But don't waste the precious time left you have a left couple. \n\nI am sorry, and I pray for you and your family.", "This is hard guys.  Cancer took my father, and while I got some extra time with him, he was gone before he died if you get me.  I hope you both find peace and happiness the next few months regardless of what you decide.  No matter what don’t hold it against each other though, for the sake of what stays behind.", "NAH \n\nLive life and create incredible memories. Chemo is HARDDDDDDD and takes a toll on the person. Please let Liam choose what he wants to do because OP, that is the best way to respect him and your love. \n\nLiam I hope you feel better and document your time together. Do bucket list items together and take videos or photos. \n\nRecord your voice telling bedtime stories and lullabies - especially your favorites. \n\nWrite letters for your future child and think of milestone gifts you would want the future child to have. \n\nFind your favorite photos that you would want to be remembered by. \n\nOrganize your favorite recipes for sick days, sad days, holidays, etc. Think of favorite activities so it feels like you’re always a part of day to day life + celebrations. \n\nI’m sure others have ideas in the comments but these are what come to mind. \n\nI knew someone that threw a ‘goodbye’ party for herself and favorite people when she still felt like herself before having to go into hospice/end of life care. Everyone shared memories, ate her favorite foods, and she sat down with each person and mourned together privately. It was really beautiful.\n\nEta: misspellings\nAlso ETA: I work in the cancer realm and can send resources and great organizations for you, OP and Liam", "YTA. I’m currently going through chemo and it really, really sucks for a lot of reasons. Your situation is so tragic and unfair, but this is Liam’s decision to make. He deserves to go out on his own terms, not feeling like absolute garbage from the carefully measured poison that is being pumped into his body. \n\nI’m so so sorry you’re in this situation.", "Simply because you are asking for a judgement I am going with a soft YTA. Your husband is going through hell right now and you are asking him to continue to do so just so you can have a single picture and memory. Depending on where you are, he is going to leave you with a mountain of medical debt on top of your own medical debt of birthing the baby. If you have any complications he is not going to be able to be there for you. Quite frankly he might be too tired and sick to even be with you in the hospital as chemo patients are immunocompromised and the hospital is filled with some serious germs.\n\nMy father was diagnosed with pancreatic cancer too late. We were given the option of maaaaaybe 4 years with chemo or 2 1/2 best chance without. He did one round with no results and called it quits. Later doctor's found out the initial ones were wrong and we had 6 months from initial diagnosis to death. He chose quality of life versus longevity. We got to make some final good memories with him and we dont have many of him being a ghost of himself. Your husband is the one dying, he gets final say over his own life.\n\nConcentrate on making the memories now. Write letters, make videos, take tons of pics, splurge on maternity shoots. Let him love you and your son with all the energy and life he has left and dont make him suffer the long and slow death of chemo.", "This is Liam’s body, life and choice. He didn’t ask for this and should be able to go out on his own terms. \n\nNo one is an AH, it’s just a really sad situation. My heart goes out to all of you", "I agree with Liam's perspective", "NAH. I've survived two cancers and did the journey with my dad when he developed leukemia.   I currently volunteer  in the hospital's chemotherapy department.  I've been through chemo once.  You are both in a terrible situation and my heart breaks for you.  I understand you and your family are trying to create memories but unless you've been through chemotherapy, you don't get it.  Please let Liam die with dignity, I know of no easy way to say it.", "Wife is the asshole - no way would I prolong my misery to see something so I can die. Just NO", "NAH. this is an incredibly difficult decisions and my heart goes out to both of you. but it is ultimately liam’s health and therefore his choice whether or not to pursue treatment. i’ve seen people suggesting he write a journal or a letter for his son, and i fully agree; even if he is unable to get a photo with his son, there are certainly other ways he can leave a mark on his life. sending love to you both, please stay strong and cherish your time together 💕", "Gentlest YTA to the wife. Your reasoning sounds innocent, but it’s selfish to force someone to continue to live in misery against their will regardless of the reason. I am sorry for all 3 of you, but it’s Liam’s choice. I think a good alternative is to make journals or videos for your son to have in the future so that he has tangible proof that he is loved.", "NTA either of you.  But it has to be Liam’s decision no matter how hard this is for the wife.  My heart breaks for both of you.  This internet stranger is sending you lots of love and strength.", "NAH\n\nWhat about a maternity shoot with your husband and the baby bump which your son can see how much your husband wanted and loved him in the future?\n\nI am so sorry y'all are going through this ❤️", "Very sorry. Liam’s decision should be honored and no more ouch back. Stop adding to his anxiety that’s so selfish.", "NAH. What a difficult decision. Ultimately you have bodily autonomy, so can cease treatment - understandably. Record some videos and write some letters to your son.", "This is above AITA pay grade. I wish you both peace.", "YTA for having a child and pressuring him to do something he didn’t want in the first place. Bad wife.", "No AH here.  Both of you have your reasons and the reasons aren't AH material.  \n\nWith what time is left start writing letters , cards ( birthdays, graduations, wedding etc )  with messages from dad,  recording video messages to your son .. etc.  I think these correspondances will mean so much more to the child when he's growing / grown up.", "First off, this is heartbreaking, and I'm sorry you are both going through it. I can't imagine how tough it is. \n\nWith that said, ultimately, it should be Liams decision and should be supported. Both of you have a good argument, but whatever physical, mental or emotional pain he is going through should take priority. \n\nBest thing I think you can do is have another sit down talk, one sit-down talk, or ten, doesn't matter, with Liams say in the end. Try to understand from the others perspective and make a decision when you are ready.", "Wife: YTA \"Keep suffering for a photo\" \n\nI get the idea behind it but... ouch.\n\nLiams life is his own.\n\n\"I didn't want cemo\" and yet, here we are. That's so fucked.", "NTA\n\nChemo is hard on the body and Liam will be drained emotionally and physically. I lost my 14 year old daughter to glioblastoma (brain cancer) and we did chemo. It did not keep her with us longer. She passed the following year. Please write, record videos, make birthday cards together to give to your sweet baby. Prepare for the future with the precious time you do have. Also I am so, so sorry. Fuck cancer.", "So sorry you are going through this.... It is a hard situation and everyone's feelings are 100% valid in this and no one is wrong for wanting what they want.\n\nMy own opinion in this is taken from my own thoughts on the matter. I've seen folks go through Chemo and it is almost worse than the disease itself. I personally decided long ago that if I ever were faced with cancer, I will NOT go through the Chemo and just live until I can't.\n\nLiam's words stick out to me and resonate greatly...... \"What's the point of living if I can't enjoy it anymore?\"\n\nJust my 2 cents", "My mother was diagnosed with terminal cancer, I was six months pregnant at the time. My first thought was I hope she doesn't linger in pain. She died a month later, two months before my son was born. She knew I was pregnant and didn't let me know until it was obvious she was dying. I was glad she didn't suffer even though she did not see my son.", "NAH - wishing you all love with an impossible situation.  \n\nBut having been through the death of my spouse from an aggressive undiagnosed Cancer when my little man was only 18 months old, either of us would have done ANYTHING for more time and at minimum, more time to prepare videos, letters…anything. We didn’t get the time to prepare. You do and I’d say take every available second.", "I'll just say, it isn't unheard of for people to live unexpectedly long once they stop treatment, or for them to die quicker because of treatment toxicity. Maybe if he stops his quality of life will be better and he'll live a few months longer than expected?", "Nobody is the AH in this situation, but Liam has very little choice left in this world, so my opinion is he ultimately needs to be blue to make this choice for himself.", "Sorry but YTA. I don't know much about chemo but from what I have heard, it's not something I would want to put my spouse through.\n\nI also remember some celeb talking about experience of being a mother and father. While mother has shared experience with the baby over the 9 months of pregnancy, the father only becomes father when he can see and hold the baby. \n\nYou as the pregnant woman are already a mother. You are carrying your baby and the bond will only grow over coming 6 months through happy moments like it's kick n ultrasound pictures and also through tough moments like issues with body, mobility. As a mother you are already sacrificing as lot.\n\nYour husband on the other hand can only be a good husband for now. His bond to the baby is only through you and all he does to care for the baby is to care for you. He doesn't have a strong bond of being a father as of yet.", "NAH Cancer sucks and I'm so sorry that you've been dealt such a terrible hand. I just have to echo what others have been saying about chemo. My MIL was diagnosed with stage 4 pancreatic cancer last year. She was told that she would only live 6 months with treatment. She quit chemo after one round because the effects were so terrible that she ended up in the hospital. She ended up living just over one year. Nothing in life is certain. I don't think I'd choose to live in misery, knowing that I was going to die regardless.", "NAH\n\nOP, from one pregnant woman to another, I can empathize with you. However, this has to be a decision Liam makes, and especially sounding like he didn't want chemo from the beginning, it seems he has made peace with his battle.\n\nI'm so sorry you are going through this and I can't even imagine the fear and sadness you may be feeling..but chemo is hard on the body and mind. If he can go out on what feels like his own terms in this awful situation then please support that.\n\nLiam, I am sorry for this horrid situation. Consider maybe leaving some audio vocals behind maybe like a journal or even physically write a journal to him. Just talk to your son; it doesn't necessarily have to be about anything important or it could be. You could talk about what you did that day, how you met your wife, how much you love him or teach him things you wanted to teach him.\n\nI hope you two can make the best of the rest of your time together ♥️", "This is one of the saddest things I’ve ever read. Wow I’m so beyond sorry. He’s 29 and dealing with that I really am sorry. This truly is beyond Reddit opinion but I’m going to speak to both sides:\nLiam’s perspective- I can’t even begin to understand the pain and suffering from cancer. If I were you I’d feel the same. You already feel awful and chemo will just add to it. However, I can’t imagine going quicker than I could. I would want to spend every second with my wife and son so that’s my honest answer on that but I get how hard that could be given the pain you’re already enduring. \nOP’s perspective- I can’t even begin to understand what you’re feeling. Losing your husband at 29 with a child on the way… I’m so sorry. I understand you want him to stick around to witness the birth but you have to respect his decision and it truly is his to make. The fact is that he will pass from this and even chemo is just postponing the inevitable and that’s awful but he is the only one who can dictate what his body is feeling and if he wants to go sooner that’s up to him. \nAgain to both of you I’m so so sorry… I pray for you both", "NAH. But it is Liam’s body. He’s sick. The chemo is keeping him alive for people other than himself. His life is pain and discomfort. I can’t imagine how heartbreaking it is to know that he will never know his son, and vice versa. But chemo is poison, and while the poison can cure, it can make you so very very sick and it’s not going to cure Liam. \n\nI am so sorry for what you’re both going through. I think, instead of a photo, Liam could try writing letters for his son’s milestones, to be opened when he’s older. Obviously this will take effort and be tiring, so start with the big ones - starting kindergarten, driver’s license, graduation, first date, etc. Maybe the two of you could put together an “About My Dad” scrapbook: dad’s memories, favorite things, favorite photos. Work on it together.", "NAH\n\nBut I'm on the dying man's side. One's death is a personal choice, only he feels when enough is enough.", "NAH...this is so deep and heavy that there is no right answer. Liam deserves to be comfortable, and it's understandable that you want him to witness the birth of his child. Don't let any of this sour the time you have left together. Maybe start making videos together that you can show your son as he grows up. Write some letters and do voice recordings for milestones; lost first tooth, first day of school, 10th birthday, prom, wedding, and so on. Liam, maybe leave some letters for your wife too. There is no way to make this easy, for either of you, or any of your family. Just soak in all the love and joy you possibly can right now.", "NAH. This is a horrible situation for everyone involved. In terms of photos, the only photos of me with my dying grandpa (also cancer) are very sad. But thankfully I'm too young to remember him like that, and many more photos of him are young and happy. Kiddo will be too young to remember. \n\nBut also, chemo SUCKS. This is why some people refuse treatment - it isn't just the hair loss, but the exhaustion and nausea and all the debilitating side effects that make a patient feel like passing on is better.\n\nNo one is being selfish here. It's all a horrible, impossible scenario. Whatever happens your husband will die and you'll be a widow with a baby. Will a photo change that for you? Will it change it for your kid?\n\n(From being the kid in this kinda similar perspective, as I have a very close relationship with my grandma who helped raise me, it is nice to have those couple of photos of Grandpa holding me.)", "This is such a kind and thoughtful answer, with a lovely solution. Bravo. 👏", "I wish I had an award to give you, as this took the words right out of my mouth. Very kind of you to offer your services as an artist as well.", "I second this person’s comment.\n\nYou are both in an impossible position, but ultimately it is Liam’s decision. \n\nWhen I was 19 … many many many years ago … my mom was diagnosed with terminal lung cancer. My dad pressured her into treatment. She lived less than a year from her initial diagnosis, the cancer spread to her brain and her last six months were awful. It was emotionally devastating on our family. I have so many good memories of her but my last ones are traumatic. \n\nI know that my dad’s request was made out of sadness, shock, avoidance, love, concern … very human reasons, but it took away any time she could have done some last hurrah whims and it made the end of her life more painful.", "THIS. \n\nI was going to suggest this too.   Record yourself.  Write letters.  Maybe setup an gmail account just to email to your future son and give advice, thoughts, pictures , whatever.", "This is an amazing idea.", "Agreed.  Chemo is fucking brutal, we can express our wishes to loved ones, but it’s ultimately each person’s decision what they’re willing to tolerate.", "Soft, soft YTA. Confronting death and accepting it is one of life’s hardest tasks. If Liam is there, let him go. I wouldn’t wish it on anyone to meet their baby and then know that they can’t be around for their life.", "Very similar to what I was going to say. Super soft YWBTA (the wife), and I am so so sorry this is happening to y’all.\n\nBest wishes for everyone involved ❤️\n\n(eta the W B)", "Fuck cancer.  I miss my mom so much.", "Great idea ❤️", "There’s a No Assholes Here judgement option if you’d like to use that instead", "It’s called NAH (no assholes here)", "There’s a No Assholes Here judgement for when you don’t think anyone is in the wrong. Just FYI", "....The only thing you got out of this was the photo?\n\nYou completely glossed over getting to spend as much time with him as possible, giving him the joy of seeing his son (even if it's only once), having the time to say his proper goodbyes, all of that?\n\nOP wasn't even the one that mentioned the photo, ffs.", "Wow, the gross take on the thread. Their kid is clearly wanted, suggesting someone abort a child they clearly love and have zero desire to abort is horrible.", "Seriously? Seriously??", "This is not the question they asked. Clearly they have made that decision, otherwise they wouldn't have posted what they did. I'm sure both OPs are going through enough hell as it is without people suggesting they lose a child they already say they love as well.\n\nOPs, I'm so sorry you're in this situation. I can't even imagine. All I can suggest is encouraging Liam to go through treatment he doesn't want, rather than allowing him to go on his own terms, could make him resentful in his final months. But I completely understand your stance, I imagine I'd feel the same in your position and want to hang onto every last second by any means.\n\nSending as much strength and comfort as I can muster, although I can't imagine it will be of much help.", "What the fuck is this take", "i’d imagine she views the fetus as a part of her husband, and doesn’t want to lose it.", "Incredibly heartless comment."]}