{"id": 21870, "submission_id": "14w0y92", "title": "AITA for leaving a trip early instead of doing what my group wanted to do?", "selftext": "I went on a weekend getaway a while back to a city that’s 5 hours away from my area. I drove 3 of my “friends” on the way there. The other person that went drove themself in later that day. So while we were in this city, they did not care about my opinions at all. I mentioned several times about things I wanted to do and I was completely disregarded. We went and did what they wanted to do the whole weekend, and I felt really left out. I’m not the kind of person who can just push through those feelings, so I was a little cold and distant because I felt hurt. I should’ve tried harder, and that is my fault for that. \n\nFor some background information, I have a rocky past with one of these friends and our relationship is very tumultuous. There are times where we have so much fun, and there are times where we can’t stand each other. To be completely honest, the only reason I went on this trip was because of that friend, I only associate with the other 3 because of them. They all make questionable life decisions (drug use, treating people poorly, etc) so I limit my interactions with them to only group settings. \n\nThis trip was so stressful and disappointing because I felt like the group did not care about what I thought or wanted, they just needed me to chauffeur them around. Didn’t even let me pick the music I wanted to listen to while I was driving. Anyways, my problem was when we went to an event and they did drugs in the back of my car without even asking me if I was okay with it. They know how I feel about it because they have left me out of things in the past when drugs were involved, but they tried to say they didn’t know I felt that way about it and just thought I’d never do it. I told them that I was very uncomfortable with and it didn’t even want to be around it. They seemed to understand, but during the event pulled it out again and did it right beside me. \n\nSo after that I packed my stuff and sat it by the door. The next morning I told them that I did not want to stay and do anything, I just wanted to drive home. I said that if they wanted to stay they could ride with the other person or they could ride back with me right then. They chose to ride with the other person, but told me that they felt I owed them a ride. They are now very upset with me for “stranding them” when I gave them the option to ride with me, I just didn’t do what they wanted me to do. I don’t know if we’re friends anymore, I don’t know if I care. So AITA?", "created_utc": 1689011353, "permalink": "/r/AmItheAsshole/comments/14w0y92/aita_for_leaving_a_trip_early_instead_of_doing/", "score": 67, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > My friends did things I was uncomfortable with after I asked them not to, so I decided to leave a trip early. I told them they could ride with me or they could ride with the other person. They’re mad because I left early.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "You're NTA. You didn't leave them stranded, 4 people will easily fit into 1 car. And even if you had actually left them stranded, you'd still not be the arsehole. They should've at least pretended to care about some of the activities that you wanted to do if they wanted you to ferry them around the whole time. I'm just curious though, have you learned a lesson from this?", "I had a group of friends when I was about 20. I was the only one with a car, and they were always asking me to drive them places. At the time, I was desperate to have friends, so I did what they asked. It became apparent after a few months that my car was the only thing about me that they liked.  The first time I refused to drive them, their true colors came out. \n\n&#x200B;\n\nThese people are not your friends. They are, at best, Uber customers.\n\n&#x200B;\n\nNext time they want a ride somewhere, tell them to pay up front for your time, mileage and gas. Sure, they will call you an asshole, but that is simply them projecting.", "NTA - You didn’t leave them stranded, the other person has a car and can take them back.", "NTA, obviously. Doing drugs in the back of your car is completely unacceptable. You don't owe anyone anything.", "NTA Those don't sound like a friends as much as people who take advantage", "NTA I think this friendship was over long ago and that they've be depending on you for things.", "NTA\n\nThey made you uncomfortable and disregarded your feelings throughout the trip. Get new friends and ignore them if they contact you.", "NTA, these people aren’t friends", "Nta you don't owe them anything. Your also not leaving them stranded. They have a way to get back home. They also decided to not ride back home with you. So that's on them for that.", "Nta you didnt owe them anything", "NTA.\n\nAnd for what it's worth... if people did drugs in my car AGAINST my consent (never-mind without my consent) their trip would have ended on the spot with me kicking them out.\n\nP.S. Those people aren't your friends.", "First of all, everyone should not have to do what others want. You should have separated when needed. second, the driver is the person to keep happy so you control what is played (within reason - I'm not going to blast metal with non-metal friends, etc). NTA.", "NTA but these aren't your friends.  Second, your car, your music or else they don't get to ride with you.  Third, drugs in car = bad, could get you also arrested for that depending on your local laws.  \n\nA big lesson you learn is when to stand up for yourself and walk away.  You did this in the end here which is good.  I would have done it sooner, especially if they were ignoring what you wanted to do entirely.", "This reminds me of the time I took an employee out for a “relaxation day” to make myself feel like I had friends! He booked tickets for The Flash instead of Spider-Verse, ordered in a pizza with pineapple, black olives, and anchovies, and asked me why I was eating the crust instead of throwing it away! I subsequently fired him and told him he never mattered all that much to me! NTA OP!", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI went on a weekend getaway a while back to a city that’s 5 hours away from my area. I drove 3 of my “friends” on the way there. The other person that went drove themself in later that day. So while we were in this city, they did not care about my opinions at all. I mentioned several times about things I wanted to do and I was completely disregarded. We went and did what they wanted to do the whole weekend, and I felt really left out. I’m not the kind of person who can just push through those feelings, so I was a little cold and distant because I felt hurt. I should’ve tried harder, and that is my fault for that. \n\nFor some background information, I have a rocky past with one of these friends and our relationship is very tumultuous. There are times where we have so much fun, and there are times where we can’t stand each other. To be completely honest, the only reason I went on this trip was because of that friend, I only associate with the other 3 because of them. They all make questionable life decisions (drug use, treating people poorly, etc) so I limit my interactions with them to only group settings. \n\nThis trip was so stressful and disappointing because I felt like the group did not care about what I thought or wanted, they just needed me to chauffeur them around. Didn’t even let me pick the music I wanted to listen to while I was driving. Anyways, my problem was when we went to an event and they did drugs in the back of my car without even asking me if I was okay with it. They know how I feel about it because they have left me out of things in the past when drugs were involved, but they tried to say they didn’t know I felt that way about it and just thought I’d never do it. I told them that I was very uncomfortable with and it didn’t even want to be around it. They seemed to understand, but during the event pulled it out again and did it right beside me. \n\nSo after that I packed my stuff and sat it by the door. The next morning I told them that I did not want to stay and do anything, I just wanted to drive home. I said that if they wanted to stay they could ride with the other person or they could ride back with me right then. They chose to ride with the other person, but told me that they felt I owed them a ride. They are now very upset with me for “stranding them” when I gave them the option to ride with me, I just didn’t do what they wanted me to do. I don’t know if we’re friends anymore, I don’t know if I care. So AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "I have learned that they’re not good friends to have and I am better off without them. I have also learned they never respected me or cared about my opinions.", "Well it sucks that they treated you like this and you wasted that time with them on the trip but at least you know now that they aren't your friends and you can focus your energy on people who deserve you xxx", "ESH.  You admit to not really liking three of them, having a questionable relationship with the closest person, and they like to do things you don’t even want to be around.  Why would you even chose to go under those circumstances?  It’s common for a group to do things that the majority of the group wants to do.  That does not mean you can’t go off and do something you want to do.  Just say, I really want to go do x so how about I check in with you later to see where you are and maybe meet up?", "Driver picks the music; shotgun shuts his cakehole. NTA.", "NTA\n\nIt sounds like you really don't have much in common with your now ex-friends.  Move on.\n\nThat said, I've gone off and done my own thing when on trips with others.", "NTA, these people are not your friends.", "Well I didn’t put this in the original post because I didn’t think it was super relevant, but I did end up staying in the area after I left the hotel. I told them that I would wait for them and still give them a ride home. I waited for an hour and a half and then they decided to ride back with the other person anyway.", "NTA. Drop these toxic people and find better friends. And you really need to toughen up. When its your car, you decide the music unless you tell someone to go ahead and pick. But if you don't like it then tell them sorry, they need to pick something else Remember, if you let someone treat you like a doormat, they WILL treat you like a doormat. And yes they are mad, they are losing their chauffer and their doormat.", "> Third, drugs in car = bad, could get you also arrested for that depending on your local laws. \n\nShould be noted that, in the US anyway, regardless of state a passenger dropping their drugs in your car instantly makes those drugs yours as they are on your property and by virtue in your possession.\n\nSomething tells me the people the OP describes aren't the type that would choose someone else's freedom over theirs."]}