{"id": 21944, "submission_id": "14wrfw8", "title": "AITA for removing my stepdaughters bed and giving it it my daughter and making my stepdaughter buy a new bed.", "selftext": "I have a daughter from a previous marriage ( 15 Jenny) and a stepdaughter when I got married to my wife. We both have primary custody of our kids. My daughter took the transition decently while my stepdaughter (Emile 15) did not. So family therapy mostly with her mom and her but I and Jenny will come in for some sessions when wanted. \n\nOverall I thought it was going okay. Jenny got a job the moment summer started, she use to have a twin bed but when Emilie moved in with her queen size bed that’s all she wanted. So she basically saved all her money and bought herself an queen bed frame and new mattress. She loved it.\n\nThe two kids got in an argument, it started out over bread but got more heated. My daughter made a comment about about Emilie’s dad not giving a shit, it was unacceptable. She got her phone taken away for a week, had a lecture, banned from her club for the week, and of course apologized. We talked about getting her to do therapy also but that got interrupted.\n\nFor context Jenny is mixed, and Emile spray painted slurs on her new bed frame and mattress. So my wife and I made the decision that Emilie’s bed would go to Jenny until she buys Jenny what she ruined it’s going to be expensive but she has a job. Also lost in privileges for a month. Her options are sleep on the floor or the couch.\n\nI got a call from her father and he went off, I told my mom what happens and she also thinks I am an asshole for this punishment", "created_utc": 1689082148, "permalink": "/r/AmItheAsshole/comments/14wrfw8/aita_for_removing_my_stepdaughters_bed_and_giving/", "score": 45, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I got rid of my stepdaughters bed as a punishment and people are calling me an asshole for it. AITA for giving my stepdaughters bed to my daughter and making my stepdaughter buy her a new one\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Why would Emile’s Dad call you instead of speaking to his ex-wife?\n\nTaking away a bed doesn’t solve your problem. These two young ladies have some serious issues. It appears without intervention from a professional their behavior will only escalate. You may want to admit to yourselves that you are both in way over your head. Get these girls some professional help... ASAP!\n\nNTA", "NTA - I would not let your daughter live with someone clearly racist. Y’all need to move out. Like seriously.", "Ouch. Low Blow for Low Blow. Your family isn’t blending well and your therapist isn’t getting the job done. NTA because punishment of some sort needs to happen, but there has to be a group therapy session. This sucks so bad for everyone.", "So, Emile got racist and destroyed her step sister property, so had to replace it with her own?\n\nNot an AH move for that, but she does have to have a bed. \n\nMaybe a better solution would be that you get her single sized bed, and if she wants a better one, she pays for that.", "NTA\n\nThat's what you call asymmetric warfare.  It went from a sister fight to a racist destruction of property.  That requires a consequence and therapy because that did not come out of no where.  In regards to the \"punishment\", what does her dad and your mom think is appropriate?  That you and your wife buy a new mattress set?  There is only one person who needs to face this consequence and that's Emile.  It's not like she is some little kid who does not know better, she's 15!!!  Maybe the other option is to take the defaced mattress, paint over it and place a plastic sheet on it and let her sleep on that.", "NTA. Jenny started this fight but Emilie escalated it to hate crime adjacent bs. That’s not acceptable. Jenny had her punishment, now Emilie gets hers.", "NTA\n\n>For context Jenny is mixed, and Emile spray painted slurs on her new bed frame and mattress.\n\nNo way this can be tolerated at all. I think you punishment fits the crime honestly so NTA from me. I'd say however give her a week on the couch and if you can replace the frame and have her just pay you back the rest over time. It is a bit mean to force them to a couch.", "NTA, I was ready to assume you were giving your daughter preferential treatment but you and your wife are correctly responding to a disgusting act of racism and vandalism from your stepdaughter. I wouldn’t be surprised if the racism stems from her father. The fact that he’s seemingly angry would support that idea. Good that you’re already in family therapy. That being said it is a bit inhumane to tell her she should sleep on the floor.", "You've got much bigger problems than this sub is equipped to deal with. I don't think making your stepdaughter sleep on the floor or couch is the right answer, making them swap beds would have been a better thing to do. You need to ALL be in family therapy right now.", "NTA\n\n***For context Jenny is mixed, and Emile spray painted slurs on her new bed frame and mattress.***\n\nQuite frankly, the 'punishment' is light, considering she did the above and that's not touching on the fact that she was a straight up asshole with the dad comments and got a slap on the wrist. Racism is never okay, not calmly, not in the heat of the moment. NEVER. And at 15, she should already know this.", "NTA. A 15year old should be mature enough to not spray paint slurs. She's being a bully, a racist one at that. And as they say, racism is taught. Make sure that her parents aren't racists themselves.", "NTA, but has Emilie ever said anything racist before or expressed racist opinions? Because this is something you need to get to the root of. Her behaviour was way out of line, but you should also have a serious talk with her about racism and how calling people slurs make them feel. She need to know not only that this was wrong, but also why.", "NTA, play stupid games win stupid prizes. Emillie knew what she was doing was wrong and still did it. Jenny had appropriate consequence for saying something unacceptable and now Emillie gets her due consequence for ruining an expensive bed. INFO, has she been racist before?", "NTA, somewhat..., though I would buy Jenny a new bed while Emile works it off and let Emile keep her bed. That said, I wouldn't tolerate living in a house where my child isn't safe from stuff like this. Home should be a safe haven, not another place Jenny has to worry about being hated and bullied because of her skin color/ethnic makeup. I absolutely, 100% wouldn't tolerate it, I don't care how much I loved my spouse, having a little racist gremlin as a step kid wouldn't fly period, never mind when my kid is a target of the racism.", "NTA\n\nEmile ruined Jenny's bed, Jenny gets her bed and Emile must pay for fixing what she ruined. Sounds only fair to me.\n\nHad she said those slurs in the heat of the discussion... But she spray-painted them on her bed. What was she expecting?\n\nPut her mattress on the floor and she can sleep there. A bed isn't a necessity, a good mattress is.\n\nEdit: Emily doesn't have to sleep on the floor, she can sleep on the bed and mattress she ruined.", "ESH. you need to get both the girls help. they are stuck in this situation because you and your wife made a choice. \n\nYour daughter said hurtful words your stepdaughter upped that stakes with not only distruction of property and racism. \n\nIt was a deliberate an act of racism and is lucky your daughter has not went a pressed charged for her actions. Since she bought  the item herself.\n\nYou and your wife and her ex need to find away to sort this out before  you both lose your daughters", "INFO - why don’t you buy Jenny a new bed and make Emile pay you back? Emile should definitely be responsible for the damage she caused but it doesn’t seem fair to make Jenny sleep on a much smaller bed until her stepsister earns the money to replace her old one.", "INFO: How much does the bed cost?", "NTA. Emilie took what could be considered a normal fight between new step siblings to a completely unacceptable level. Something needed to be done to shut that down *now*. The people who are saying that the punishment is too harsh don’t seem to understand just how serious this can become if it isn’t stopped now. And, considering her father’s response, I’m now wondering where she got it from.", "I'm going to say ESH except for the girls.\n\nI'm mixed as well and can put in my two cents.\n\nBut, removing her bed and forcing her to sleep on the couch or the floor because the adults in this story dropped the ball isn't going to make Emile less racist. \n\nIf anything, it's going to make things worse. Was the girls even introduced and allowed to know each other? When Emilie did this, why didn't you send her to her father's house instead? Hell, when you did therapy sessions, why focus on separate sessions and not a mix of both? \n\nIt sounds like y'all was trying to mix families after the marriage instead of before the marriage.", "NTA\n\nShe ruined her sister's bed on purpose, with hate speech and slurs what a fuckin charmer, so she lost her bed. She faced the consequences of her actions. Good parent, cookie.", "There doesn't seem to be any favoritism here.  When Jenny was wrong, she was punished appropriately.  Emilie ruining something your daughter worked and saved for calls for exactly the kind of punishment you're applying.\n\nNTA.", "NTA.  Emile's behaved in a racist manner towards her step sister. It's one thing for people to argue and fight.  What Emile did, however, crossed a line into something entirely unacceptable. The consequence/punishment is for her to make restitution. As such, the punishment fits the crime.\n\nAs long as you and your wife are united on this punishment, you're good.", "Honestly I get why you did it but YTA. It is beyond messed up to remove a child's bed.", "NTA. Way to go", "Nta and honestly you guys are parenting goals. You're teaching her to be responsible for her actions and it's not overly harsh and I LOVE that mom backed you up. I feel like it's so much worse when one parent messes up the team work.", "YTA what is this punishment doing? It’s just building more resentment! You’ve only just put more of a target on your daughters back? This isn’t a mild fight over two four year old wanting the same train set! This is a way bigger issue and involves racism. Then when it comes down to it you have you have way way bigger issues to come. It’s not going to end well. Protect your daughter.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI have a daughter from a previous marriage ( 15 Jenny) and a stepdaughter when I got married to my wife. We both have primary custody of our kids. My daughter took the transition decently while my stepdaughter (Emile 15) did not. So family therapy mostly with her mom and her but I and Jenny will come in for some sessions when wanted. \n\nOverall I thought it was going okay. Jenny got a job the moment summer started, she use to have a twin bed but when Emilie moved in with her queen size bed that’s all she wanted. So she basically saved all her money and bought herself an queen bed frame and new mattress. She loved it.\n\nThe two kids got in an argument, it started out over bread but got more heated. My daughter made a comment about about Emilie’s dad not giving a shit, it was unacceptable. She got her phone taken away for a week, had a lecture, banned from her club for the week, and of course apologized. We talked about getting her to do therapy also but that got interrupted.\n\nFor context Jenny is mixed, and Emile spray painted slurs on her new bed frame and mattress. So my wife and I made the decision that Emilie’s bed would go to Jenny until she buys Jenny what she ruined it’s going to be expensive but she has a job. Also lost in privileges for a month. Her options are sleep on the floor or the couch.\n\nI got a call from her father and he went off, I told my mom what happens and she also thinks I am an asshole for this punishment\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA- I came here expecting to give you a different verdict than this. But what you did is acceptable in this situation. Not only did she destroy someone else's property but she did so by being a racist and that's just disgusting and not acceptable.", "I had a family member divorce over this kind of thing. The kids simply could not get along. The married couple was great, but in the end, it wasn't a fair situation for the kids.", "Esh - your stepdaughter should absolutely buy a new bed. But she should get the slur one. She shouldn't be sleeping on the floor or a couch.", "NTA- Emile ruined Jenny's bed and is now suffering the consequences for her choices. You should have her sleep on the slur painted mattress.", "NTA, but the bed replacement/punishments aren’t going to fix it, and Emille is just going to spend all the time she’s sleeping on the couch thinking about how this is Jenny’s fault and that it’s unfair.\n\nThe beds are a symptom of hate and resentment between your daughters. My guess is that it’s deeper than you even realize, and it’s just bubbling over.\n\nThe fix is way way way above Reddit’s pay grade. \n\nIt’s above your therapist’s pay grade because the job isn’t getting done. \n\nHighly suggest *individual* therapy for each daughter *and* family therapy. \n\nGood luck.", "This is the only way. \n\nI don’t understand, yet again, why parents blend families when they *know* that one or more of the kids is not happy about it. \n\nNow they are stuck with this mess. \n\nGet both girls into therapy together. They don’t have to be even friends, but they have to find a way to have some semblance of a respectful, civil relationship.", "It sounds like one of those, \"we jumped into a marriage quickly and forgot we have kids\" situation.", "My wife hung up on him and I picked up not knowing who it was…", "This 100 percent! \n\nI agree with making her purchase property she damaged. I agree with punishing her.\n\nHowever it is child abuse(she is still a child) for her not to have a bed. If her dad pushes this it could cause you to loose custody of both girls.  She has to have a proper place to sleep. \n\nSo if I was you and your wife. I would buy the step daughter a twin bed. Nothing says you have to give her the luxury’s of a queen size bed but she does need a bed.", "Pointing out that your deadbeat father doesn’t care about you can be just as hurtful. Both of these girls are out of line and deserve equal punishments.", "No, this really was the first time anything even close happened.", "> though I would buy Jenny a new bed while Emile works it off and let Emile keep her bed\n\nI've seen this story enough times to know Emile is never going to work it off if given the option.", "Read again... Emile damaged (spray painted slur words) Jenny's bed, which was bought by Jenny with her own earned money. Emile had her own bed taken away as punishment.  \n\nNTA", "Or replace the stepdaughter with a twin size until she buys a new queen size bed for the stepsister.\n\nShe needs a bed. She doesn’t need the luxerys of a queen. Op can replace it with a twin bed or a day bed relatively cheap. Until she works to buy the other one back.", "Frame and mattress was close to 2000", "Yes they had a two years before we got married, her dad is in another state and most of the time won’t take his kid when he does have custody. \n\nIt got much harder when her dad stopped caring when the wedding was close, it went from basically a 50/50 split to her living almost always with mom.\n\nSo our marriage basically went with her dad abandoning her,", "It’s not messed up. It’s the natural consequence of her choosing to ruin another child’s bed.", "I don’t know if they are parenting goals to be honest… their daughters hate each other and have declared all-out war.", "Both of these young ladies appear to have a common goal... that is hurting one another. This is not even close to a good living situation for this family. \n\nI think OP’s opinion that Jenny “took the transition decently” is a huge reach.", "I hope you get these young women some help. They shouldn’t be living with this type of animosity & anger towards one another. It’s not healthy & I can only guess it will get worse for them.\n\nWish y’all the best", "Air mattress or one of those camp mattresses, which the couch would be more comfy\n\nWorse case, if she refuses to pay is to just take it from her account and any money she gets for like her birthday until it’s paid off", "My bad .. I got the daughters’ names mixed up. I made the edit. What I’m asking is why can’t OP and his wife replace the bed and have Emile pay them back. Ultimately OP’s wife is responsible for her daughter’s behavior so I don’t think it’s fair for Jenny to have to make due with a smaller bed until her step sister comes up with the money to replace it.", "Yeah no. Downgrading to a twin? Sure. But it's fucked up to deny a child a literal bed to sleep in.", "My guess is, to teach her a lesson now.  \n\n>I don’t think it’s fair for Jenny to have to make due with a smaller bed\n\nBoth beds are/were queen size. If Emile's bed would be a lot smaller I totally would agree with you.", "A mattress is a necessity, a bed isn't.", "Got it. I misunderstood. For some reason I thought that both girls had twin beds originally and Emile upgraded herself to a queen and that’s what Jenny destroyed. OP and his wife are doing the right thing then. He says that Jenny almost has enough saved up so how fast she gets the rest will depend on how badly she wants her bed back.", "The options presented were the floor or a couch. So if they downgraded to a mattress on the floor sure. But forcing a kid to sleep on the floor or a couch is still an asshole move. And I doubt either are great for the kids physical wellbei.", "Just for clarification here, I think you’ve still got the girls mixed up! \n\nJenny now has Emile’s bed and Jenny was the victim of the hate crime. \n\nEmile is the one having to save up for a new bed because hers has been given to Jenny as a punishment for Emile’s act of racist vandalism. \n\n(Only pointing out the accidental name flipping because one of them (Emile) has committed a literal hate crime, and even seeing the victim accidentally called the culprit makes my skin kinda crawl!) x", "You're right. I'd say they could let her sleep in the bed/mattress she ruined. But a mattress is the bare minimum.", "100%. The issue with this sort of 'punishment' is I doubt it is teaching the kid anything other than to her her family."]}