{"id": 21951, "submission_id": "14wui0q", "title": "AITA for rewarding my stepkids for disrespecting their mother?", "selftext": "There's this movie that came out this summer all the kids were really excited to see. When my kids went for their summer time with their mom, they said to my stepkids not to watch the movie without them so they can all watch it together when they get back. My stepkids said okay. So a couple weeks ago my wife said to her sons that she would take them to go see the movie while her daughter was at ballet. My stepsons said they didn't want to go, because they promised they would wait, which I thought was sweet.\n\nMy wife said that wasn't a reasonable request, and she was offering to take them, so they don't have to wait, but the boys insisted they didn't want to go without their sister or my sons. My wife was annoyed and said they could stay home and do nothing then. I ended up taking the boys to get ice cream, which my wife was very upset about, because she said it's not right to take the boys to get ice cream but not her daughter. I said I was rewarding them for being thoughtful, and she said that I wasn't, that I was rewarding them for being disrespectful.\n\nAnyway, my kids got back Saturday, so I said I would take all five to the cinema to watch this movie. My wife said no, that she didn't want to go to the movies that night because she was tired. I said we'd just go without her, and she said no again, but I took all the kids anyway. She said I'm wrong for overriding her with her kids, that they aren't my kids, and it's not my place. I said the kids waited all this time to see the movie, so they earned it. She's currently not talking to me.", "created_utc": 1689089446, "permalink": "/r/AmItheAsshole/comments/14wui0q/aita_for_rewarding_my_stepkids_for_disrespecting/", "score": 1076, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I took my stepsons to get ice cream and then all the kids to the movies a different day, even though my wife said no both times.\n\nI might be the asshole because she is pregnant and dealing with a lot and because I undermined her authority with her children.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "She pulled the “not your kids” card? Yeah, NTA. She’s a giant AH.\n\nStart planning your escape. There’s a reason the first (?) guy left. I suspect you’re finding out too.", "NTA\n\nYour title is misleading. The kids want to bond together and the other adult just wanted to do whatever she wanted.", "NTA - I don't think the kids were disrespectful, and its lovely that they want to do things with their step siblings meaning they see them as true family which is brilliant. I do feel sorry the daughter missed out on a fun ice cream trip, however the boys deserved a reward for sticking to their word and being thoughtful.", "NTA\n\nYour kids agreed to watch the film together. They stuck to that. Actually commendable.\n\nFeels like your wife just wanted them to not watch the film together which just makes me confused as to why?", "NTA.\n\n>the boys insisted they didn't want to go without their sister or my sons. My wife was annoyed and said they could stay home and do nothing then.\n\nYour wife had a needlessly antagonistic response to this. I find parents / people who are this angry at a perceived lack of appreciation/gratitude to be really draining and frankly it's teaching the kids the wrong thing. They were PUNISHED for wanting to uphold their word, and for honoring the wishes of their step siblings. It's very sad to me that your wife chose to see disrespect in this, and lacks respect herself for their bond. Was it really that hard for her to find something else to go do with them? It's especially odd that she wanted to extend this grudge and punishment several days later by trying to prevent the whole family from seeing this movie.\n\nIs your wife normally this petty and vengeful?  \n\n\nEDIT: Clarified references to 'them' being the kids.", "NTA\n\nWhy is your wife trying to create drama between all the children? The children aren't disrespecting her, she is disrespecting the mature agreement they all made. Is intentional sabotage of this blended family a common occurrence for her?", "NTA, there's no disrespect here from them.  Your wife however is disrespecting all the kids wishes because they all want to see it together.  A child not wanting to do an activity isn't being disrespectful.  Why does she think they were being disrespectful to her?  She has no grounds from what I can see.\n\nAlso taking the kids for ice-cream was a nice thing, daughter was at ballet so she was doing her own thing (plus would've been excluded from the cinema so it's a non-point.)\n\nMaybe a little bit not great for taking the kids on Saturday when your wife wanted to go too but was tired for that night... although it's Saturday night, how long are they supposed to wait?  If there's one reason she's not talking to you, it's this one night.\n\nOn her \"not your kids\" line... does she want a family or a fuck buddy?  Time to talk this through together... hopefully nicely.", "NTA. Your wife is choosing some very strange hills to die on. I like your step kids.", "So it was disrespectful for the boys to get ice cream while their sister was at basket, but it wasn't disrespectful to take the boys to see a movie while the sister was at ballet?  Your wife is petty AF.  NTA", "NTA.  How was that disrespectful?  If you excluded her out when she could have gone then sure.  Shes all about having control, not just over her own kids.  Sounds like every situation, no wonder it's her second marriage.  You could say the same thing when you took the boys out for being thoughtful on the 'overriding her kids'", "NTA - \"they aren't your kids\"? ....", "NTA. It’s wonderful that all of the step kids get along so nicely! Why does your wife want to create conflict between them all? Most stepmothers want peacefulness at any cost, so this woman’s antics not only are baffling but only serve to propagate the evil stepmother myth", "NTA.  You have a wife problem.  Why is she trying to sow dissent between the kids?", "NTA. Sounds like you’re acting like the adult here, setting a good example of living up to promises and creating a sense of unity by shared experiences. Your wife is acting like a child and cares more about obedience than what is best for the family.", "So your wife’s logic is her sons can see the movie while daughter is at ballet but you can’t take them for ice cream while daughter was at ballet because that’s unfair to daughter?\n\nI can’t make it make sense…\n\nNTA", "NTA the kids didnt disrespect her they kept a promise they had made with their siblings. she is angry you took the boys for ice cream but not their sister when she was going to take them to the cinema without her.\n\nShe is jealous they chose their siblings over her. is this not the dream for blended families that the kids get along this well", ">the boys insisted they didn't want to go without their sister or my sons\n\n>My wife was annoyed and said they could stay home and do nothing then\n\n>she said it's not right to take the boys to get ice cream but not her daughter\n\nE S H except your kids. Your wife is petty and mean, and you should have taken all the kids for ice cream. These kids are more mature than either of you.\n\nEdit: daughter wasn't home so NTA.", "[deleted]", "ESH\n\nYou guys don't sound married or like you're on the same team with parenting.\n\nI'm guessing you have a history of undermining and ignoring each other on parenting decisions, which has lead to the current state where your wife is pissed to hell you keep countering her. Please go through this thing you wrote and count how many times you vetoed her and just did what you wanted. I counted at least 6, possibly 7 times.\n\nBecause she has no power and no voice, she's going to start screaming and lashing out, even if she does it through the silent treatment or petty denials.\n\nYou guys need to get on the same page and realigned as a team.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nThere's this movie that came out this summer all the kids were really excited to see. When my kids went for their summer time with their mom, they said to my stepkids not to watch the movie without them so they can all watch it together when they get back. My stepkids said okay. So a couple weeks ago my wife said to her sons that she would take them to go see the movie while her daughter was at ballet. My stepsons said they didn't want to go, because they promised they would wait, which I thought was sweet.\n\nMy wife said that wasn't a reasonable request, and she was offering to take them, so they don't have to wait, but the boys insisted they didn't want to go without their sister or my sons. My wife was annoyed and said they could stay home and do nothing then. I ended up taking the boys to get ice cream, which my wife was very upset about, because she said it's not right to take the boys to get ice cream but not her daughter. I said I was rewarding them for being thoughtful, and she said that I wasn't, that I was rewarding them for being disrespectful.\n\nAnyway, my kids got back Saturday, so I said I would take all five to the cinema to watch this movie. My wife said no, that she didn't want to go to the movies that night because she was tired. I said we'd just go without her, and she said no again, but I took all the kids anyway. She said I'm wrong for overriding her with her kids, that they aren't my kids, and it's not my place. I said the kids waited all this time to see the movie, so they earned it. She's currently not talking to me.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Lol there was no disrespect (until you took them to the movies. That was kinda disrespectful but that was you and not the kids). The kids said they wanted to wait. There was nothing wrong with that.", "Nta", "When someone who has kids from another relationship gets married, it is not up to them to decided if their new husband/wife is a paternal figure, it is up to the kids. The kids love your children as their own siblings and they respect you enough as a paternal figure. She doesn't get to use the \"not your kids\" card here, as it is not up to her to decide that. NTA", "NTA but your wife sure is - You might want to think long and hard about that.  She is deliberately trying to cause resentment between the children and she is creating drama in the home.", "NTA. She is showing you her true colors. She wanted to favor her kids and she didn’t like that they wanted to wait for your ex’s kids. Her line about how her kids aren’t yours seems similar to her not wanting your kids around for fun things", "It's wrong for you to take the boys to get ice cream without her daughter,but *not* wrong for her to take them to the movies without her? You're mostly NTA,it sounds like you're doing a good job of trying to foster positive relationships between you & all the kids. Her reaction in this situation is super odd imo,it sounds like she's either being needlessly controlling,or that she's insistent on being the,\"FUN parent\". She wants to be the one that takes them to the movies,she wants to be the one that takes them for ice cream,and she doesn't like when you're the one having those experiences with them instead.\n\n However,I do think it would have been better to wait until your wife was able to go with you all. Personally I think that was inappropriate,would it have hurt to have gone the next day instead? The whole thing started because the kids wanted to go together as a family and not have anyone miss out,so why make mum miss out? She was being weird about this to start with,but going without her wasn't cool,and is the sort of thing that builds resentment in the long run.", "NTA - Is this a control thing with her? Is she actively TRYING to make the kids all hate each other? And blaming YOU for being the one to reward them being good, honest people, instead of doing what their shady mother demanded and tried to punish them for???\n\nPlease get her into family and couples counseling. Those kids are going to need you in the future, if you remain with her - guaranteed.", "That's what she said I did. She the one who thinks I'm being an asshole, so I'm trying to accurately represent her perspective.", "Congrats, you discovered that titles don't always accurately represent the body of the post lmfao", "This sub is full of blended families who try to push their kids to bond and have limited or no success. This family’s kids have bonded and this mom is mad about it", "I'm like 99% sure the daughter wasn't there, so she couldn't get ice cream (just from them saying they wouldn't go to the movie without their sister and step brothers)", "A bit but I perceived this to be an alternative activity that OP did with the boys while the daughter was at ballet - OP's wife was offering to take them to the movies during that period which would have similarly excluded the daughter who was at ballet. And OP was I believe trying to reward/recognize their thoughtfulness as well.", "I counted two. What are the other four?", "Seems like she just wants control and needs to chill out.", "It just wasn’t a good title.\n\nMaybe something more like,\n\n“AITA for taking the kids to the movie without my wife?”", "Yeah, she was at ballet.", "This. If she was really tired when OP went to the movie, she would have been happy to have a few hours of quiet while OP took the kids.", "A good title is one that makes you click, which you did", "Okay. Then just your wife is an AH.", "NTA.\n\nYour wonderful children, all of them, understood the true meaning and importance of making a promise to each other. They're the ones who deserve respect.\n\nYour wife expected the kids to break their promise and thinks she's the one being disrespected??? How can you respect someone in the first place if they themselves do not respect the honor behind keeping a promise?\n\nAlso, NTA for rewarding the kids with ice cream, and then the movie for all of them.", "NTA\n\nYour wife reminds me of my narcissistic grandma who would always ignite fights between the kids and randomly picked the favorite of the week.\n\nIt's a wonder the kids turned out so well.", "NTA\n\n'They aren't your kids' ummm by law and marriage they are. It was so sweet of them to want to wait for everyone. Im guessing she's upset because she wanted to be the 'cool mom' but got rejected.\n\nIm not sure why she took it so personally tho. Its just the movies.", "NTA\n\n'They aren't your kids' ummm by law and marriage they are. It was so sweet of them to want to wait for everyone. Im guessing she's upset because she wanted to be the 'cool mom' but got rejected.\n\nIm not sure why she took it so personally, tho. It's just the movies.", "NTA \n\nThe kids value keeping promises and their bond with each other, that's sweet and should be rewarded.", "In my opinion you sound like a great parental role model.\n\n\nThe kids not wanting to go without their siblings is indeed extremely sweet, and they deserved that treat.\n\nYou are absolutely NTA. I hope you all enjoyed the movie.", "Nta but is she always so difficult?", "NTA, your wife is trying to manufacture issues to divide the kids. Start bracing for more erratic behavior", "NTA. What a pill she is.", "NTA  \nThis seems like an awfully odd and ridiculous place to take a stand. What's her real problem?", "It sounds like your wife was intentionally sabotaging the deal the kids made with one another.\n\nShe is angry that the kids stuck together.\n\nI am happy the that the kids stuck together it shows respect for one another, and they trust one another.  Its good for a blended family is the kids get along.\n\nYour wife wanted to treat her two sone differently than your kids. That would annoy me as a parent.\n\nI am glad you had a nice time with the kids.\n\nBut I this you have a wife spouse issue.\n\nNTA", "You were able to handle a bunch of kids to the movies alone? 🤯 I only can one and with another adult.", "[removed]", "Right!? Totally NTA and I don’t understand why your wife isn’t proud of the kids for caring about promises they made to each other and for being respectful of each other. Blended families can be hard and she should be encouraging them getting along and compromising.", "How was that disrespectful? If you excluded her out when she could have gone then sure.NAT", "Your wife is acting like a child and cares more about obedience than what is best for the family.", "The kids said they wanted to wait. There was nothing wrong with that.", "Ok....I would agree with you, but logic me through how her behavior makes sense. How does punishing kids for being thoughtful for their other siblings benefit anyone other than the mother's ego?\n\nHow were the actions of the father (other than the fatal mistake of disagreeing with his wife) incorrect?\n\nEffectively she was punishing the children for made-up offenses; is her voice being silenced or is she being prevented from harming the familial relationships?", "So, lemme get this straight..... she was willing to take 2 boys to the movies without 3 of her other kids.... yet she got mad at you when you took the boys out for ice cream....without the other 3? that seems hypocritical, no? But I LOVE the fact the two boys were so excited to see the movie with their siblings that they were willing to wait, and great idea in rewarding them for that behaviour.", "Is it just me, or is the entire post difficult to follow? All the posessive adjectives/modifiers and pronouns make it difficult to figure out whose kids are whose.", "She didn’t wanna go to the movies because she was too tired, so when you just said “fine we’re going without you then.” She flat out just said “no.” As if you were automatically going to obey her and say “well guys we can’t go now because mom said so.” She flat out expected you to just stay home and be miserable with her. \n\nNTA. “Disrespect” her more often!", "ETA why didn't you delay for another day or something? Why wait for the kids for the movie but not the wife? You are villifying a person instead of their mistakes and your wife isn't being considerate of others", "NTA - enjoy your quiet time. I bet you deserve it!", "Yes it was totally misleading. I almost called you the A-hole based on the title. Glad I read more", "I'm sorry- all the kids, your kids and your stepkids agreed to wait to see a movie to see it together. And all the kids actually waited to see it together.\n\nYou give the kids whatever treats they want at the movie.\n\nWait, that was the question, right? What the wrong amount of candy was to celebrate a successful step-family kid bonding moment?\n\nI'm not sure what's going on with your wife. I'm guessing you don't know either. I'd just say when she stops acting like a two year old and is ready to talk- point out that there was no way you weren't going to encourage this kind of bonding between the kids. Everyone complains about the difficulty in merging families and they had this moment were all of their kids were on one page. (And it was healthy- they weren't all hating on you two.) You weren't going to hamper that.\n\nBy all means, ask her to verbalize her specific problem. But it can't just be that you took the boys to get ice cream and not her daughter- cuz she was going to take the boys to the movies and not her daughter. And it be that you decided to take all of the kids to the movies because as an adult in the house that the sort of decision that you make, just like she might decide that it's hot today and she's going to take all of the kids to the beach. It may vaguely look like the parenting decision- but it's more of adult household decision.\n\nNTA", "Wow- so now they aren’t YOUR kids! What kind of message did she expect to send with that statement? Sounds like rough roads ahead! Your Not the ass for rewarding them for sticking to the promise. They sound like well behaved kids. NTA.", "NTA. She wanted to take them to the movie while her daughter was at ballet…..perfectly acceptable to her…\n\nYou took the boys to get ice cream and she got upset because it’s not right to take the boys to get ice cream without the daughter…. but basically the exact thing she wanted to do with the movie is somehow now NOT acceptable…", "NTA.\n\nYour step-kids were not disrespectful, they just asked not to see the movie without the others. How is that disrespectful? It's actually kind and sweet. Your wife sounds unhinged....", "Wtf is going on with your wife? No one gets ice cream when even one kid isn’t home? That’s dumb. \n\nSomething else is bothering her. \n\nNTA.", "So NTA! She is one seriously petty woman! I'm so glad the kids waited for the others. That was thoughtful. I hope you stand your ground. She seems to me to be one of those people who simply refuse to be wrong. So when she is, she deflects blame from herself to others.", "NTA\n\nA number of the posts seen in Reddit dealing  with merged families discuss how the kids are not at all interested in becoming a blended family.  They live as ‘us’ and ‘them’ with parents sometimes as mediators and other times antagonists. \n\nIn this post you have kids from two families actively blending themselves.  \n\nSo why is your wife acting like this was a negative and apparently gotten her feelings hurt when her kids wanted to honor their commitment to their  non-blood siblings?  \n\nDoes she tend to only do things with her kids and not with yours or does she support the blending?  \n\nBest I have is maybe find a babysitter for the kids so the two of you can go somewhere calm and discuss this.", "NTA. This is so bizarre. Who has the patience for this crap lol.", "NTA. She wants to take the boys to the movies without their sister, but you guys getting a simple ice cream without her is wrong? Then after all this pushing it's not right to ask the boys to wait for someone else, the entire family has to wait another day because mom is tired...\n\nLike others have said, it's really sweet that the kids want to watch the movie all together, related and step-siblings alike. \n\nI realize, unlike the clock app, my comments goes directly to OP, and this is not nice to your wife, but she's a really selfish ah.", "NTA\n\nI took 5 kids to see Spider-verse a few weeks back. My wife was THRILLED to have a quiet house to herself for 3 hours. \nI think it's sweer that your kids/step kids are bonding. Not sure why your wife is trying to drive a wedge between them.", "NTA.  What's it like having 5 kids?  At least you can divorce one of them.  Too bad, seems like her kids are cool and get along with yours.", "NTA. All the kids were on board with wanting to see the movie together,  and that she got a couple hours alone! She doesn't seem to understand how awesome that is.", "\"Not your kids\" is a massive red flag, particularly when you both brought kids into the relationship.\n\nNTA here, your wife is though.", "NTA, let her not talk to you. Enjoy the silence.", "NTA. Did she fabricate trouble for her ex like she does for you? Do you want to spend your life with a woman who treats your children like they aren't really family? If this attitude isn't dealt with things will only get worse. She is trying to cause trouble between your children and her children.", "I was prepared to go another way, but NTA.", "Yeah, how is it disrespectful to politely decline a movie offer because you promised someone else to watch it with them? Is your wife expecting her kids to do every little thing she says, and never decline an offer or a suggestion? It's not like they refused to do the chores or were sneaking out after midnight or something - they just said no thank you to an offer to go to the movies! Are they not allowed to have their own opinions or plans?", "I don’t generally jump to the “they’re cheating” conclusion (and I don’t here, either, based on what we know.) \n\nBut it sure sounds like OP’s wife had a plan that depended on everyone being out of the house at that time and she’s big mad that didn’t happen.", "So the wife gets to decide the boys are forced to stay at home bc they didn't accept her invitation? It's not like they refused to do their chores or intentionally made a mess or did something that *actually* deserved a punishment. She offered to take them to the movies and they said they'd rather wait until they could go with everyone. And then when everyone does want to go to the movies except she doesn't, she just gets to prevent them from going simply bc she doesn't want to join them?\n\nShe was being petty and power tripping over her own kids, which is not a parenting decision that should be respected.", "The kids said they wanted to wait.", "Totally agree! They sound like great kids", "[Bot](https://old.reddit.com/user/Individuale3060) stole [this](https://old.reddit.com/r/AmItheAsshole/comments/14wui0q/aita_for_rewarding_my_stepkids_for_disrespecting/jrkgkhs/)", "So according to her, its ok for her to take her boys to the movie without their sister, but not ok for you to take them to ice cream without their sister? There's no arguing with so.some like that, the goalposts will just keep moving. I may be a bit cynical, but she wasn't tired over the weekend. She wanted to get back at the kids for not going along with her plans and you ruined it.\n\nDefinitely NTA, but I would be keeping an eye on her for any other micro retaliations.", "Well one of you did what the kids wanted in regards to the movie and the other didn’t. Whoever did what the kids wanted was the one doing what the kids wanted, and the other was doing what they wanted while ignoring the kids wishes…", "That's the part I'm confused about. He took 5 kids to the movies, something they wanted to do together and you're upset because.....? You had a quiet house with zero children when you were tired. What is this really about, lady?", "i love it when my husband takes our ONE kid out so i have a quiet house. let alone FIVE.", "Touche’", "Wanting to be the eye of the family drama storm most likely", "YTA", "NTA your wife shooter true colors and it’s only gona get worse, find a divorce attorney asap", "NTA. I’m so confused here", "NTA\n\nWTF is wrong with your wife?! Shes trying to manipulate and turn these kids against each other. Is she mentally all there? Because her arguments make zero sense. She needs therapy.", "NTA, but your wife is big time!", "Nta\n\nSounds like you didn't learn your lesson from the first wife and married her again.\n\nFool me once as they say.\n\nMay be youll learn before the third one.", "NTA. I suspect your wife really wanted to see the movie and was using her boys to justify going to see it as soon as she could. She got annoyed that this fell through and got annoyed when you said you were all going but she couldn't.", "Run brother. And lawyer up. NTA", "\"They arent all my kids\" is just such a painful statement and it really is horrible. Its one of the biggest things that makes people not want to be step parents, when their so can turn around and use that against them. NTA for the situation as well", "Not only do you juggle 5 kids, you have to handle a grown up child as well. NTA.", "NTA but what is up with your wife demanding they go see a movie without her daughter, but then get pissed at you going to get ice cream without daughter?  \n\nEnjoy the silent treatment, you earned it!!", "You are married, you pay for food the kids eat, clothes the wear and water they drink. They are your kids.  They promised to wait and they waited.  I believe she is in the wrong.", "NTA, but your wife is and has control issues.", "Well your wife may not be on board about the movie, but the two of you have blended your families perfectly! \n\nHow wonderful it is to read a reddit story about step siblings that actually want to spend time together!!\n\nNta! That is a healthy bond the kids are developing! I would do everything I could to encourage it!\n\nTell your wife she has been great with helping the kids bond and you love the results so much, you are following her lead. Remind her she is only butthurt because her sons turned her down so they could hang with people closer to their own age. Let her know this means they are maturing properly, and she is part of the reason. \n\nThen maybe get her some ice cream too! \n\nCouples fight. That is normal. But it is important to anyone (wife) to feel respected, like your opinion matters. That is part of a happy relationship. Make that up to her, because you did disregard her. \n\nbut don't feel guilty about taking the kids for ice cream or to the movie.", "Silent treatment if she doesn’t get her way? 🚩 \n\nI don’t think she likes your kids", "You sound like a great father. \n\nNTA, in any way.", "They did not disrespect their mother, they just preferred to go to the movies w/their step-siblings.", "NTA\n\nHonestly your wife sounds like a petty AH.", "This dynamic is feeling a little toxic, is everything okay in this marriage? Is there a lot of tension at home now? The kids just wanted to see a movie :(", "NTA\n\nThis was a power move that she sorely lost. She tried to get her kids to break a promise to your kids and failed. Then she tried to prevent you from taking ALL the kids to see the show and failed. The fact that she's not speaking to you indicates that she's pretty petty when it comes to \"my kids, your kids, our kids\"", "NTA but that “not your kids” comment is a big red flag that you guys aren’t United in her eyes bc you don’t listen to her demands. I’d run if I were you before you get deeper in the hole Step parents in general are either in it respectfully  co parenting , or not. She’s the latter and it’s only a matter of time before things escalate into more foolish arguments.", "I agree, this doesn’t sound good. Not a well-blended family, at least your wife isn’t. If the kids want to watch together, why would she try to force her sons not to wait? Seems unnecessarily mean. I don’t get it.\n\nAlso the “not your kids” card was cruel. Maybe you can all talk about this as a family? \n\nNTA, and good luck.", "Yes. The kids are holding a promise. The mother is way more childish than her kids.", "The wife was the one who would have been taking the kids to the movie if they went without the step-siblings. So that doesn't make sense with this scenario, she would have been out of the house at the movies.", "I read it more as she would have dropped them off at the movie, but that’s definitely not the only read it on it by any means.", "I often wonder, do people not portray the awful side to themselves before marriage?\n\nYou should probably show her this, and from her reaction, you can make a decision on what to do next.", "NTA.\n\nSounds to me like your current wife is working on becoming your second ex-wife.\n\nEx-wife tried to pull a power trip on the kids by saying they needed to stay home and be bored because they weren't willing to go see the movie with her. That's why she was upset you took them out for ice cream.\n\nCurrent wife tried to pull a power trip and block you from taking all the kids to see the movie, hence the \"not your kids\" nonsense. Her being tired is a reasonable excuse for her not going with you. It's not a good reason to prevent the kids from seeing the movie.\n\nThe fact that both your ex and your current wife are power tripping should alarm you.", "Sounds like those are some awesome kids!\nNTA", "NTA", "Im so sick of people who think kids having their own opinions and decisions is “disrespect” they’re not slaves they’re humans. NTA", "If my husband took our kids out without me I would be elated. Time to myself!!! Your wife has a problem. NTA", "Omg! I’m so sorry to say but your wife has the maturity of my toddler, lmao. NTA obviously", "These kinds of posts should come with a flow chart to spell out exactly who is related to who, by marriage, blood or whatever. Kinda tough to figure out if \"mom\" is ex or current wife, and whose kids are whose. \n\nNevertheless, it appears to my confused brain that you are NTA. I hope everyone who went enjoyed the movie.", "Your wife is a control freak and needs to get off her high horse! Your not the asswhole at all.", "Was it Spider-Verse? NTA by the way", "NTA, you weren't rewarding disrespect. She was disrespectful to push them to break a promise. Then played the not your kids BS. Fuck that she's definitely TA", "NTA. This exchange makes me raise an eyebrow. Do your kids get along okay? It seems like. Why is your wife trying to incite kids against each other?\n\nMight need some time to sit and discuss between you two what's going on.", "NTA\n\nAny other person would have said, \"Oh, that's right, I'm so glad you remembered! You're such good kids for keeping your promises!\"\n\nInstead your wife was telling them, \"Break your promise, break your promise! Fine, you won't break your promise? YOU CAN BE BORED!\"\n\nThere is something incredibly intentional about this, OP. I would observe her more closely around your kids, especially when she doesn't think you're watching.\n\nYou treat her kids like they're yours. She treats your kids like...they're an inconvenience to her.", "NTA\n\nSounds like you have 6 kids, not 5.", "The not your kids thing is a major 🚩🚩🚩🚩\n\nNTA. \n\nAlso makes one wonder how she feels about YOUR kids.", "Yeah it really seems like she’s trying to create an us vs them dynamic instead of a 2 parts of a whole. She was upset because *her* kids put a promise they made to *your* kids over what she wanted to do to the point where she punished them for it by throwing a fit and not doing anything… and then got mad that you took them for ice cream instead of doing nothing. You ruined her punishment. So she doubled down and threw a fit when all the kids were there and tried to ruin the movie. She’s emotionally manipulating her own children and trying to weaponize them against yours.", "For real. Reading her reactions during this ordeal gave me bad vibes. NTA OP", "ya dude. this set off all my alarm bells", "I say this in my head so many times when I browse here.", "And proud of them for making the promise to begin with. This sub has so many stories of blended families that don't work, of kids resenting being forced to communicate and live with step sibs. This story is refreshing from the perspective of sibling communication, but confounding as to why the mom is trying to sabotage this.", "your wife don’t like your kids.\n\nthink about that.\n\nshe was trying ***REALLY HARD*** to get her kids to break a promise they made to your kids.\n\nshe’s not gonna stop.", "Exactly!", "I think some couples counseling might be in order here. The kids are fine, they seem to get along well but there's something very odd about the way your wife is trying to separate them into 'your kids' and 'my kids' when they clearly feel like family to each other. And punishing them for wanting to keep their promise? Doubly weird. I think it might be helpful to find out what her thought process is in a situation where a third party can mediate.", "The Eye of the Family Drama Storm, that's gonna be a song title when I start a band 😁", "Family Drama Storm would also just be a sick band name haha", "Yessss haha!", "NTA, ALL your kids sound delightful. I hope whatever selfish behavior your wife has isn’t transferred to your kids.", "Esh,  her more.   You need to communicate better, or get the kids out of this situation", "NTA - the kids were never disrespectful. How is taking the boys to the movies ok but for ice cream not? \n\nYour wife sounds crazy and mean.", "NTA\n\nShe sounds exhausting", "NTA, but your wife is a piece of work. She was disrespected by the kids whose boundaries and commitment she was disrespecting? Sheesh, that one takes some mental gymnastics.", "NTA what the actual hell is wrong with your wife? Tryna drive a wedge between “her” kids and “your kids” instead of celebrating how much all your kids love and respect each other? Woman needs therapy.", "Why are you married to the wicked witch of the west?", "NTA but I think you have a bigger issue I think your wife hates your kids and wants her kids to hate them as well to try to divide you from them!", "Okay, what are the 6-7 times?\n\nHe took the boys to ice-cream instead of making them stay home because they didn’t want to go to the movies without their siblings.\n\nHe took all the kids to the movies because they’d all waited patiently to be able to watch it together and mom decided to “have a headache” and prevent anyone from going.", "Also, notice the double standard? It was ok for her to take her sons to a movie without her daughter (she was at ballet), but it wasn’t ok for OP to take the boys for ice cream without her? Only the wife gets to exclude her daughter?", "ESH but the kids.\n\nYou and your wife need marriage counseling badly. She obviously has issues with the roles the kids and you have in each others lives. But you obviously don’t respect her. Maybe she wanted to see that movie with all the kids but actually was tired? You couldn’t wait one more day? Did you even ask? They had waited a long time, they could’ve waited one more day. And you did actually take her legal children without her permission-that’s weird. If she’s pulling a controlling move, you doing the same thing isn’t any better. \n\nI feel bad for these kids. Seems like they’re doing their best and they have two supposedly adults in their lives with major emotional problems and no respect for each other.", "NTA - But your wife needs to consider why she's acting the way she does.", "NTA. Tell your presumably ADULT wife to grow the eff up. She's acting like a 5 year old.", "NTA\n\nEvery day this sub gets horror stories of what happens when stepsiblings don't get along. I don't get why your wife is so butthurt that the stepsiblings are getting along in your household, that's a great thing if she wants to have a happy family.", "NTA. I don't understand her logic here. She wanted to exclude the other kids by having the boys see the movie, they very thoughtfully said no, and you provided them an alternative to do that day since she was going to do something with them ONLY anyways. \n\nThis reads like she specifically wanted to hurt your kids or sow discord. And then she made the \"not your kids\" comment. This needs to be nipped in the bud immediately imo.", "I agree  it's also time for you to start paying very close attention to how she treats your son's. She's absolutely fine hurting them for her children's feelings so what else is she doing. What evil little digs does she do to your children when you're not there.", "She didn't have a problem leaving the daughter at ballet to see the movie, so what was the difference between you getting them ice cream? Her double standards are really evident here.", "Yeah, seems like the adults are the problem here", "nah just seems like one of them so far", "Maybe she thought the movie was 'not appropriate' for daughter(read not girly enough) and didn't want to pay for step sons?  It's mean but there it is.\n\nNTA.  You did a solid and your kids/step kids sound like a band waiting to happen.", "NTA. Thank you for being a good dad to ALL the kids.", "NTA. I'd be ticked off by her crap.", "NTA - Your wife sounds like hard work man", "Anyone just read the title then go straight to the comments to be surprised?", "NTA but wifey is & a bit of a hypocrite! It’s ok to take her kids to see a movie without their step siblings but it’s not ok to take them for ice cream without her daughter! Sounds like different rules apply to her bio children. What u did was really sweet & she should be glad ur good to her children. She could lesson from u about making her step kids feels important & included. Sounds like u want to treat all the kids equally but she doesn’t! I imagine it must’ve been a lil hurtful for ur kids to hear about her trying to come between the the kids & ruin something they wanted to do together.", "Your wife was being petty, a control freak, and an asshole.\n\nGood for you for standing up for the children, and taking them to the movie anyways.\n\nNTA OP.", "Nta…. Sounds like your kids/step kids have a good relationship why is your wife trying to throw that off balance that’s my question especially when getting blended families to get along is so hard and alot of them have issues when they’re adults most parents would help support this good relationship not try and sabotage it", "Disrespect? In what parallel universe not wanting to go to a movie night out is “disrespecting”?\n\nNTA.", "I noticed that too lmaoo the mental gymnastics of that one. 😂\n\nSad that OP is a better parent to all of them and his wife is a selfish thief of joy."]}