{"id": 21953, "submission_id": "14wx4vz", "title": "AITA for naming my son something different than my STBX and I agreed upon, therefore taking away the chances he’ll ever have a child with that name?", "selftext": "My soon-to-be-ex husband is the fourth member of his family with the same name. So for purposes of the post he’s John Alan Smith IV. It is very important to the family that the firstborn son is named that. His grandfather, father and himself all have different nicknames but still, their legal full name is the same. Not sure what would happen if one didn’t have a son, it hasn’t happened yet.\n\nAnother important note: my STBX had cancer when he was in his 20s. Chemo destroyed his chances to have kids naturally. He froze his sperm prior and we used IVF three times. This was his last viable sample. \n\nSo, anyway. My STBX and I were still together when I got pregnant. When we found out it was a boy, he asked if we could keep up tradition. While my husband’s name isn’t one I totally love, I don’t hate it and we settled on a nickname for it that I actually did like, so whatever, it’s cool.\n\nThen STBX began having martial issues. He had an affair. I filed for divorce. I still planned on naming our son what we agreed on. I also agreed with STBX that he could still be in the delivery room.\n\nMy STBX didn’t show up to the birth (despite numerous people including his own mother trying to get in contact). He acknowledged a text I sent after the baby was born but never came to the hospital. I was furious and hormonal and ultimately decided to name my som what I always wanted if I had a little boy. It’s not similar to my husband’s name nor the nickname we had landed on. I did give the baby my STBX’s last name as it’s also mine and I have no plans on changing it as I built my small business around it. \n\nSTBX finally came by when my son was a week old. He blocked me on Facebook long ago so he didn’t see what I had named him. When I introduced him, my STBX was surprised and asked why his name wasn’t what we agreed. I explained that given all he had put me through, he forfeited all rights to picking the name. STBX was pissed and left not long after.\n\nMy SBTX’s family says I was wrong to do this and I broke tradition. He’ll never have another son to do this with. I broke a multi generational cycle. They claim I should’ve gone along with it. Even some of my family said it was cold. AITA?", "created_utc": 1689095295, "permalink": "/r/AmItheAsshole/comments/14wx4vz/aita_for_naming_my_son_something_different_than/", "score": 29, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) naming my son something different than what we agreed upon. 2) he will never have a child with the name he wanted simply because I was upset with him.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA - he had an affair. He ruined his own life. Why should you be expected to name your child after a cheater?\n\nWatch his reaction to this name choice closely. If he decides not to be close to his only child because of this, if he lashes out at you or family in any way, remind him that he is a cheater. Remind him AND his family that he destroyed his own life.", "NTA. Why should he get to put his name on a project he did none of the work for.", "NTA. And What's with this same name lineage / tradition / crap ? You son is not a number. You gave him the chance to be his own man, with his own name.", "Traditions change🤷🏾‍♀️. This man cheated on you and missed his own child being born.  But yes let’s focus on babes name. You did the right thing. He’s showing you who is really is, you don’t want your kid named after someone like that.", "NTA, if he didn't care enough to show up for the birth of his son, he doesn't actually care about his son.  It's just the name itself that has meaning to him.", "NTA: STBX and his family need a reality check", "NTA. “Yes we agreed but you also agreed to be faithful till death do you part, sucks to be you.”", "NTA mostly because I did the similar to my ex (except it wasn't a family name and he did eventually have a kid with that name).\n\nWhen my ex came at me with \"BUT WE AGREED, YOU PROMISED\" I was quick to cite the other pretty big fuckin' promise he'd made and broken... The 'til death do us part' one.", "NTA \n\nIt's not traditional to cheat on your wife.   (or is it in his family?)  \n\nIt's not a traditional name for you and he showed little regard for you and your baby so, yes, he forfeited the  tradition himself.   It's his fault, and his family can blame him for the break in tradition.", "We do naming traditions to honour the legacies we care about. \n\nHe’s a cheater who didn’t bother to acknowledge or see his child until he was a week old. He doesn’t deserve to have a baby named for him.", "NTA - It's their tradition but your baby, if he can't even be bothered to be at the birth what's he going to be like co-parenting.", "NTA. If he cared, he woulda been there. He shoulda gotten in writing.", "WE make traditions.", "Even if I didn't think multigenerational names were stupid, NTA. The minimal effort is to show up and he didn't do that so he lost the right to have a say in the matter.", "It's hard for me to say this because I do sympathize with your feelings about the ending of your marriage but\n\nYTA\n\nI get that it's difficult to have empathy for your STBX right now but you \\*did\\* agree on a name  and to unilaterally change it isn't a good look for you. At all.", "NTA\n\nYour kid isn't your ex's object to show off or just to keep an old tradition alive. He needs to put in effort and already seems to not even be doing the bare minimum. When he wants to act like a father, you can treat him like one", "NTA. Sounds like he wanted the idea of a child but once you got pregnant and it became real, he didn’t actually want one.", "NTA, and that \"tradition\" is so effing stupid anyway. Congratulations on the birth of your son!", "Yeah sorry;  YTA", ">My SBTX’s family says I was wrong to do this and I broke tradition\n\nTheir family tradition went out the window the second your ex tripped and his penis fell into another woman.  They get no say.\n\nNTA", "NTA\n\nHe cheats, he loses", "NTA\n\nAt the end of the day, he showed you he didn't care for the baby (by ignoring is birth completely), only for the tradition. At this point, he morally forfeited is parental responsibilities/rights to you.", "NTA, he cares more about the name than his son", "NTA. He couldn’t even be bothered to show up at the hospital when his son was born so it doesn’t look like he plans to be much of a hands on daddy. Now, the stbx has years to be a good dad and if he is, then maybe his son will want to change his name someday.", "YTA. Despite his actions, you broke the agreement because you were mad at him", "NTA\n\n1. He had an affair.\n\n2. He didn't show until a week after the baby was born.\n\n3. He has you, the person he should be trying to develop a healthy co-parenting relationship with, blocked.\n\nHe forfeited his chance to have his son named after him.", "NTA", "Hell no you are NTA!! Screw that noise. He doesn't deserve a say in shit. Good luck to you OP! You got this!", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy soon-to-be-ex husband is the fourth member of his family with the same name. So for purposes of the post he’s John Alan Smith IV. It is very important to the family that the firstborn son is named that. His grandfather, father and himself all have different nicknames but still, their legal full name is the same. Not sure what would happen if one didn’t have a son, it hasn’t happened yet.\n\nAnother important note: my STBX had cancer when he was in his 20s. Chemo destroyed his chances to have kids naturally. He froze his sperm prior and we used IVF three times. This was his last viable sample. \n\nSo, anyway. My STBX and I were still together when I got pregnant. When we found out it was a boy, he asked if we could keep up tradition. While my husband’s name isn’t one I totally love, I don’t hate it and we settled on a nickname for it that I actually did like, so whatever, it’s cool.\n\nThen STBX began having martial issues. He had an affair. I filed for divorce. I still planned on naming our son what we agreed on. I also agreed with STBX that he could still be in the delivery room.\n\nMy STBX didn’t show up to the birth (despite numerous people including his own mother trying to get in contact). He acknowledged a text I sent after the baby was born but never came to the hospital. I was furious and hormonal and ultimately decided to name my som what I always wanted if I had a little boy. It’s not similar to my husband’s name nor the nickname we had landed on. I did give the baby my STBX’s last name as it’s also mine and I have no plans on changing it as I built my small business around it. \n\nSTBX finally came by when my son was a week old. He blocked me on Facebook long ago so he didn’t see what I had named him. When I introduced him, my STBX was surprised and asked why his name wasn’t what we agreed. I explained that given all he had put me through, he forfeited all rights to picking the name. STBX was pissed and left not long after.\n\nMy SBTX’s family says I was wrong to do this and I broke tradition. He’ll never have another son to do this with. I broke a multi generational cycle. They claim I should’ve gone along with it. Even some of my family said it was cold. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. One thing is to get divorced and being a crappy husband but he wasn't there for you or the baby when you were both in a really vulnerable state. Sue him for child support like yesterday.", "NTA\nHe didn't show up until a week after he was born. It's pretty clear he doesn't care enough to be involved. Why should your child carry his name if he isn't planning on actually being a father.", "NTA. But you should change his name, not his first but his last name. I was leaning towards his side until you said that not only wasn't he there for the delivery, he didn't show up for a whole week and he didn't even stay long when he did visit. You made the right call.", "NTA I firmly believe the parent that grew the baby human gets final say on the name (within reason, don’t name it something stupid like toaster or after an ex to be spiteful) \n\nGenerational names are dumb as fuck", "YTA - You even know it and are hoping internet strangers can convince you otherwise.  You stated yourself that you were \"Furious and hormonal so.....\"\n\nYou have now even made the choice for your son, as he will not be able to continue the \"family\" tradition of making his first born son John Allen Smith VI\n\nIf it was that you couldn't bear to hear your Ex's name every time you had to call your son, that might be different.  But you are keeping the last name because its easier for your business.", "NTA. Maybe his AP can get knocked up by someone else and that kid can be given the family name.", "NTA. Unless STBX comes from a long line of men who cheat on their wives and get divorced and who can't be bothered to show up for the birth of their firstborn son pretty sure *he's* the one that broke tradition.", "Nope. NTA. Fuck anyone who says you are. He showed what that baby meant to him by not being there for the birth.", "NTA.\n\nOnly if he knew that there's more to family \"traditions\" than a name, like idk, maybe being there when the baby is born? When you're the FATHER? \n\nSoooo N T A.", "Eh. I get that this tradition is cool, but if it were so important to STBX, then he could've shown up at the birth. He didn't even meet his son until he was a week old? Caring more about what his name is than HIM is cold.\n\nI'm going with NTA.", "ESH.. but mostly the stbx.", "NTA because he didn't show up to the birth or make an effort. That shows what kind of dad he is going to be.", "NTA . He didn't show up to his son's birth, he has no right to complain.", "NTA - he cared so much he didn't turn up until a week after he was born.  It doesn't matter if you've broken up the child should of come first for him and whilst he may not have been there at the birth he should have been there straight after at the very least the next day.  You're going to be a single mom and he showed he isn't going to be there, if he cared he would of been.  Can't think he is going to be there much after this anyway which is a huge shame for him and something he'll regret later on.  Go on and have a fabulous life with your son.", "NTA. Sounds like he’s not even really going to be in the kids life. Name him what you want, you’ll be the one doing all the raising and heavy lifting", "The thing is, his dad and grandfather have both reamed him out for cheating on me. His parents nearly cut him off for it. They’re big on adultery being a sin.\n\nI think they’re more upset I stopped the family tradition. I tried asking what would’ve happened if I had a daughter and they said we could’ve at least found a feminine version of the name. But even then, it’d end the whole “John Alan Smith” (insert Roman numeral here).", "He hasn’t even seen our son since and it’s been 2 weeks.", "Maybe if he was so concerned, he could have shown up for his own child's birth. Oh well! Sounds like he fuxked around and found out", "He didn't even dare to show up when his son was born. \n\nOP's tradition is that the father has to be present at the birth of the child to be able to decide on a name.", "Except he didn't even show up for the birth until a WEEK later, you know, the part where you fill out the paperwork right after that indicates you're the father and the name of the child.", "co-signed.  Especially if both of them agreed on the understanding that you're on the road to being each others STBX", "It's hard to have sympathy for a man who couldn't be there for the birth of his kid. Sounds like dude FAFO", "He broke their wedding vows (also an agreement). So?", "He broke his marriage vows first", "I’m not gonna change the last name because I’m keeping it. I have a small business with my full name in the title and to change it would be a lot of paperwork. And as an aside, this has been my last name for 12 years. I really don’t want to change it. It’s who I am at this point. My STBX doesn’t get to take that from me.", "It's also a centuries old tradition to not break your marriage vows", " Meh, it’s HIS family’s tradition. Not hers. He broke their family. She broke a ridiculous tradition.", "If he cared so much about his baby and the tradition, why didn't he showed up when he was born?! He waited **a week** before going.", "They better be on your good side if they want a relationship with YOUR baby. Congrats and focus on your baby.", "So hi *did* break the tradition of no cheating.\n\nIt's unfortunate for them that their son is responsible for  the break in tradition.  \n\nIt's not your fault.    You will be the one raising him.     \n\nAre you going to allow grandparents access?", "The ex isn't treating you or your son like family. So why follow that family's traditions?\nNTA", "Sorry, I hope he pulls it together for the both of you.", "Exactly, so he didn't even recongized his son until a week after he was born.", "I respect that and congratulations on your new son.", "It was still a situation where she did it out of spite, and that makes you an asshole no matter how you slice it.  If I said Everyone's an Asshole would that be better?  She doesn't get to not be the asshole, just because he was not a standup guy.  \n\nShe still intended to give him the name after the separation.  Maybe dude was going through some shit, being that the only biological kid he could ever have was with a woman he was no longer married to, and he wouldn't be able to see grow on a daily basis and do all the things a father dreams of doing with his son.  Maybe this drove him to an unhealthy mental state, we don't know.  She said everyone \"Tried\" to get in touch with him.  Doesn't say anyone did successfully and then he re-surfaced when he was able to put his \"outside face\" back on, walks into the hospital and again has his dreams crushed one final time.", "If they calm down, yes. They’ve been supportive outside this. But if they keep it up, no. I’ve laid that boundary so we’ll see where we go.\n\nIt’ll also depend on how much custody he gets because I can’t stop him from bringing our son around. Right now, I’ve filed for sole custody and he claims he’s not contesting it but anything can happen.", "Right, in court you would be held for failure to appear~~contempt of court~~.  The idea of naming your soon after yourself is egotistically already.  Usually, you think the number after would be pushing for a better individual, not devolving into a burned-out parent.\n\nedit: contempt =/= failure to appear.", "Thank you❤️", ">  She said everyone \"Tried\" to get in touch with him.  Doesn't say anyone did successfully\n\nMultiple people, including his mother. While he knew that the mother of his child was ready to give birth any day. And even if, SOMEHOW, nobody got in touch with him that day, he didn't show up until 1 week later. Was he completely off the grid and out of touch for a week? During a time when he knew his son was going to be born soon?", "I wish you good luck with the whole thing.   I hope it works out well for you and your son.", "Held in contempt of court?  You know what that is right?  Just so I know someone has told you, \"contempt of court\" is when the judge throws you in jail for being disruptive/disorderly during a court proceeding towards the officers, court officials, or the judge.\n\nEDIT: Not understanding how father not showing up for a week for a baby is metaphorical", "Anyone who has suffered depression can tell you yes, it can last for a week or longer and make you not even be able to get out of bed.", "Thank you ❤️", "Thanks, I just figured not showing up to court is just as disruptive, but its a sperate thing.", "No acutally I believe you can be held in contempt for not showing up when court ordered.  I'm just not a litigator, so it's not ever been something I practice or witnessed (I do in-house counsel for a corporation), so I didn't connect the dots from what you initially said.  So technically I think you are right and I'm the idiot."]}