{"id": 21989, "submission_id": "14xavr1", "title": "AITA for telling the stylist to cut my girls hair however they want and to stop asking me if I am okay with it?", "selftext": "My girls are 14 and 17. The both have short hair. The 14 year old has 1/2 her head shaved as an undercut and. The 17 is always doing weird things with her hair.  Frankly I don't care what they do with their hair, it's hair it grows back and it's on their head not mine.\n\nSo my 14 year old said she needed a haircut as her hair had grown out for a few months. I took her to chain salon, as I was pulling in my 17 year old pulled in bedside me by surprise. She also needed a haircut, I said just come on and I'll pay for it.\n\nThe 14 year old told them what she wanted and showed them a picture, they turned to me and asked if I was okay with it. I said whatever she wants I'm fine with, they cut it and asked if I was okay with it. I asked my daughter if she liked it she said she wanted it shorter, they asked me what I thought.... I told them to please cut another 2 inches off and shave the undercut shorter, they tried to argue that it looked more feminine at the length it was at, I said if she wants it shorter then do what she asks. They did, she loves it\n\nMy 17 year old was next and showed them a picture of some weird idea she had, they again asked if I was okay with it. I was annoyed at this point and said said she is 17 if she wants a buzz cut give it to her, if she wants some. Anime hairstyles go for it, but quit asking me, I already said let them have whatever they want, it is their hair.\n\nThe stylist looked visibly upset and my youngest said I was being rude... But I was just done with them asking me if what they wanted was okay, when I had already said more than once that they could have whatever style or cut  they wanted\n\nSo AITA.", "created_utc": 1689127794, "permalink": "/r/AmItheAsshole/comments/14xavr1/aita_for_telling_the_stylist_to_cut_my_girls_hair/", "score": 3987, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I think I might be TA because I did snap at the stylist when he was just asking questions about my kids hair.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA for the sentiment but I do think you were a little bit of an A H for your attitude to the stylist. I suspect that the stylist just wants to make sure you don't complain at the end of the hair cut - I could imagine parents saying do what they want and then just playing on their phone and being shocked at the end of the cut.", "NTA\n\nAs a woman I cannot count the number of times I've gone in for a cut or color and the stylist has tried to refuse what I ask. Then I see people go into salons and walk out with rainbow hair or bright neon blue but my asking for blonde or a pixie cut is unreasonable somehow? A few years ago I got sick of the BS. If I want to cut off all my hair or go platinum or whatever, do what I ask you to do. If you refuse, say that you refuse instead of beating around the bush and trying to talk me into something I don't want. But in the end, it's my damn head. Now, if a stylist starts trying to talk me out of something, I walk out and go somewhere else. \n\nI'm not sure why stylists think they have some god given right to tell customers they're wrong for asking for what they want. I get it. SOME people get upset. But ffs, give Women the benefit of the doubt that yes, we know what the hell we want. Stop treating us like we're too ignorant to know what's best for Us. If its that huge of a deal, start making people sign Non-Complaint Disclaimers--like an NDA. But don't just assume I have no idea what I'm doing or that I'm going to automatically freak out over a stupid haircut. \n\nNext week I'm going back to get a pixie and have it dyed platinum. No regrets. It's just hair--it'll grow out if I don't like it.", "Nah \n\nI get why after the 3rd and 4th pushback from the hair dresser that you were over it. You weren't rude, you didn't yell or swear. \n\nI also get her re-checking with you because I'd say the hairstylist has probably copped more than a couple of sprays from parents peeved that their kid has gone and done something nuts to their hair. The \"more feminine\" line sucked, but I get her checking the rest.  \n\nNot all kids are lucky enough to have a parent who understands body autonomy.", "NTA, I get being frustrated. Yes you were a bit rude, but I get where’s it coming from. And I’d have been annoyed when they made the comment about it “being more feminine”. That being said, this is why it is good to always go to a regular stylist. It’s so much easier when you have one you have a good rapport with, and they can start anticipating what you want.", "NTA\n\nI know it's not always financially feasible, but as a woman who has had non-traditional hairstyles for most of my nearly 50 yrs (including shaved head, undercuts, high & tights, pixie cuts, a rainbow of colors, etc) it makes life MUCH better when you find a good stylist who you go to regularly. It is totally normal for them to verify that you really want shorter/more unusual things since it's not like they can glue it back on, but moving it into the sexist BS of them trying to argue that traditional feminine styles are better was absolutely unacceptable. They might as well have just said out loud \"can't have men thinking you're lesbians or trans\"...I'd have lost my shit at that.", "NTA.  \"They tried to argue that it looked more feminine at the length it was at.\" Oh hell no. I would not be giving them my money. It's good of you to tell them to not ask you, ask them! It's their hair! Maybe next mama can wait in the car", "NTA but you have to understand they probably get controlling parents quite a bit. She just covering her own ass.", "NTA you told the stylist multiple times and it should have been pretty obvious that you were ok with tour girls making their own decisions. They even showed a picture and you said it was fine! It seems like the stylist was being judgmental of what they wanted and wasn't comfortable doing the cuts for that reason.", "NTA. You reiterated several times throughout the same visit that your daughters can get whatever they want. The stylist kept asking you the same exact question, several times. Anybody would’ve gotten annoyed by the end of it.", "NTA", "NTA. I would feel more sympathy for the stylist if she was just asking, but her coming in with the “it should look more feminine” nonsense shows that she was being a judgey asshole", "Mild YTA\n\nThis is a measure twice cut once scenario.  There was no need for you to get upset", "YTA. You were rude. Let's take a step back and ask ourselves why this hairdresser might obsessively check in on the parent before making what could be drastic changes to the child's hair. I promise you they've been yelled at, or their friends/coworkers, after they received \"permission\". Is it annoying? Sure. But that's what they likely need to do to prevent a full meltdown in their shop. No need to give them a hard time when responding doesn't actually take any effort.", "Nta, but you do need to understand that they ask you so many questions, and if everything is ok because they've probably had really bad experiences in the past with parents.", "Honestly, YTA they're both minors . Sure you meant what you said, but ppl are a holes and I'm sure the stylist has dealt with plenty of \"do what you want \" then gotten shit for not checking in more. She was protecting herself and you still gave her shit cause you couldn't be bothered to say yes a few more times than you thought ? Maybe think about it from her perspective for a second. Damned if you do and damned if you don't with customer service.", "YTA Many stylists have been given crap and even threats and nonpayment cutting kids hair. They are doing due diligence. Suck it up and stop being so rude.", "ESH, you did clearly state multiple times that your kids had free choice, and the hairdresser should have stopped, but I can also understand exactly why they kept asking and making sure the job is done correctly. I'll be honest I don't see a scenario where it would have been smooth sailing, it's just a personality and precaution clash.", "You’re mad because you’re telling them about bodily autonomy and they’re not respecting your views. Understandable. NTA", "YTA. \n\nYes, you had to repeat yourself multiple times. Yes, that’s REALLY frustrating. It’s a big pet peeve of mine, too. \n\nThere was no need to treat them that way for being thorough and checking for parental consent in today’s world of posting everything on social media at the slightest upset or misunderstanding. The service industry is rough.", "YTA - But this is mild at best. I can certainly understand that it can be frustrating to be asked the same thing repeatedly. And sometimes, our emotions can get the better of us, and we lash out. Does that make it right? No.\n\nIn the future, you could always let them know at the beginning of the haircut that whatever the kids want is okay with you.", "YTA\n\nYou were rude. Clearly this habit of asking repeatedly came from their experience of parents being pissed at stylists.  I remember a post here a few months back of a woman who berated a stylist for cutting her daughter's hair the way the daughter asked for it to be cut. \n\nI feel bad for the stylist, they must dread cutting children's hair at this point, they can't win..", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy girls are 14 and 17. The both have short hair. The 14 year old has 1/2 her head shaved as an undercut and. The 17 is always doing weird things with her hair.  Frankly I don't care what they do with their hair, it's hair it grows back and it's on their head not mine.\n\nSo my 14 year old said she needed a haircut as her hair had grown out for a few months. I took her to chain salon, as I was pulling in my 17 year old pulled in bedside me by surprise. She also needed a haircut, I said just come on and I'll pay for it.\n\nThe 14 year old told them what she wanted and showed them a picture, they turned to me and asked if I was okay with it. I said whatever she wants I'm fine with, they cut it and asked if I was okay with it. I asked my daughter if she liked it she said she wanted it shorter, they asked me what I thought.... I told them to please cut another 2 inches off and shave the undercut shorter, they tried to argue that it looked more feminine at the length it was at, I said if she wants it shorter then do what she asks. They did, she loves it\n\nMy 17 year old was next and showed them a picture of some weird idea she had, they again asked if I was okay with it. I was annoyed at this point and said said she is 17 if she wants a buzz cut give it to her, if she wants some. Anime hairstyle go for it, but quit asking me, I already said hi e them whatever they want, it is their hair.\n\nThe stylist looked visibly upset and my youngest said I was being rude... But I was just done with them asking me if what they wanted was okay, when I had already said more than once that they could have whatever style or cut  they wanted\n\nSo AITA.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA, just saying you’re fine with whatever they choose is enough.", "[deleted]", "NTA\n\nYou told them multiple times to give your daughters whatever they wanted. That should have been the end of it. The stylists got intrusive and deserved your response.", "NTA\n\nI went to a place and replied \"no\" to a question, it was not what the person wanted to hear. They tried asking 2 more times. I got annoyed and said that \"no means no\" even the first time. They didn't take it well.", "NTA", "NTA. I grew up in a small, rural town. My hair was pretty standard for the mid-90s - long, straight, a few layers, with bangs. One day, shortly after graduating high school (not quite 18), I was frustrated with it and wanted it cut to my shoulders. I made an appointment, drove myself to the salon of my choice (my mom used a different salon), had my own money in hand, and asked the stylist to cut it. She refused, claiming she needed my mom’s permission. I walked out with un-cut hair because I wasn’t playing her game. She still called my mom…at work…and my mom was PISSED that the stylist disturbed her at work because, as she said, it was MY hair and MY choice. I never had my hair done in that town again. Hair grows back. There are bigger issues in the world. Thanks for letting your kids express themselves.", "I don't want to call you The Asshole because I applaud you letting your kids express themselves and your full support of that. But you have to realize your support is extremely rare and the poor stylist was just trying to give you respect as the mom to make the final decisions. Most mothers don't mean \"Whatever\" when they say \"Whatever.\" She was just trying to do the right thing by everyone.\n\nMaybe you were a little  bit of an asshole to the stylist, but not intentionally?\n\nMaybe tell her you appreciate her the next time you see her for being so considerate of your whole family.", "NTA. I would send my kids to the barber shop by themselves if they would speak real English. My kid went to a new person without me and asked for them to cut his triangle. My only rules for them right now are that they need to do the daily maintenance by themselves and they can’t make drastic changes on a whim. But my kids are also a lot younger than yours.", "YTA. Both your girls are minors, and as such, the stylist has a responsibility to make sure the parent is OK with what they are doing. I would bet that they have been confronted before by iirate parents in their career, for doing what their minor client has aske, even though the parent has said do what you want.", "NTA\n\nI had this exact same problem once my daughter decided she was over having waist length hair.\n\nThe first two cuts were to her shoulders & then her chin. Same salon. Both visits it was like pulling teeth to get the damn stylist to do her job & cut her hair the way we BOTH asked for.\n\nShe even said \"Well, how's her daddy gonna feel about this?\" MORE THAN ONCE & I kinda wanted to commit a felony right then & there. (Her daddy btw doesn't GAF how she does her hair so long as she's happy.)\n\nSo we found a new, better salon. (It’s actually one I used to go to 20yrs ago, so maybe not so new. LOL) It's a town over, but she gets her own dedicated stylist (Mr. Jacob. We love him.) & after our 1st visit when I said \"It’s her hair. She’s the boss. Give her whatever she wants.\", he hasn't asked for my permission or whatever once & it's great. (He did ask if I'd thought about her having an undercut because her hair is insanely thick, which I thought was a great idea. So we showed her pictures & she loved it. Been rocking a chin length bob with an undercut for going on 2yrs now.)\n\nWe also started taking her little brother there & he has his own very nice stylist that he's declared he will marry someday. (He's seven, so it's cute. Not creepy. I promise.)\n\nAlso also, we all have AuDHD & they actually have sensory sensitivity training which is freaking glorious. Silent appointments are SO restful.\n\nTotally worth the extra miles & money.", "Mild YTA.  I allow my kids the same choice and I've managed to never be snarky or blow up at stylists who want to double check with me.  How can she tell if you are going to turn into one of those moms that freaks out as soon as the cut dries and is shorter than expected.", "NAH. The stylist is just covering their butt so that at the end of the haircut they don’t get an angry parent refusing to pay because they’re not happy with how the kid looks.", "NTA\n\nYou gave full consent and made it clear your 14 year old was in charge. They weren't listening to what your 14 year old wanted, invalidated her request ,and tried changing it to fit their views on femininity, which is borderline offensive, really.\n\nEven if you were rude, you weren't wrong.", "I would agree with you since that was my initial thought as well. \n\nExcept then I read this part. \n\n>I said whatever she wants I'm fine with, they cut it and asked if I was okay with it. I asked my daughter if she liked it she said she wanted it shorter, they asked me what I thought.... I told them to please cut another 2 inches off and shave the undercut shorter, they tried to argue that it looked more feminine at the length it was at,\n\nDo you see that last part? \n\nThe parent gave specific instructions and the stylist argued that her way was more \"feminine.\" That's not just looking to the mom for approval. \n\nThat's a stylist who does not approve of the kids choices trying to impose her viewpoints on the client.", "See I could see that if they both had super long hair or something.\n\nbut you could tell daughter 14 already had that cut, it was just grown out.\n\nAnd 17 well her hair is about 5 different colors and lengths .. so what she wanted wasn't anything stranger than what she had already", "The rain I don’t believe that is because when OP told the stylist to cut it shorter the stylist objected and said it would be more feminine if it wasn’t shorter. \n\nThat’s not “I don’t want the moon to complain” that’s misogyny and controlling how girls look and it’s a pile of garbage. \n\nHad OP responded that way when it was just confirming with the person paying I’d agree about the tone, but if someone said that to me about and in front of my daughter how OP replied would have looked super polite. \n\nNTA", "It kind of reminds me of the school photographer we had in high school. It was senior year and most of us seniors were getting professional portraits done, so a few kids decided to go all out for silly school ones. Well, the photographer has a fit and refused to take their picture because they were beautiful girls and he refused to photograph them looking so ugly or something (they had silly hats and stick on moustaches). Eventually someone has to get the principal who was like, \"Just take the damn pictures, why am I here?\" He eventually dud but grumbled the whole time. (also gave off a general creepy vibe, the principal made it clear he would not be coming back)\n\nOr the time my mom and I took silly photos in Vegas. It was one of those things where they photograph your face and put it on a different body (like, I have one from when I was a kid with my face on a fairy body). The guy recommends my mom a d I do showgirls but we found one with Marilyn Monroe and Elvis. I was big into old Hollywood stuff and my mom said I should be Marilyn and she'd be Elvis. She did an Elvis face that was so hilariously bad I said we HAD to do it. But the guy kept pushing showgirls. Even made us take extra pictures so he could show us how the showgirls would look. He seemed genuinely upset when we still took the Marilyn and Elvis one home instead.\n\nSome people get oddly offended, and seem to take it personally, when women or girls do something that makes them seem less feminine or traditionally attractive. It's gross.", "I have a friend who’s a stylist - she is so talented, can do miracles with a cut and color. But she is also super sensitive. She got in this career to help women feel better about themselves…and in the rare moment when her clients don’t like their cut or style, it kills her. Like, for real, it takes her time to get over feeling guilty that her client feels badly.  Because for good or for ill, women’s confidences are deeply affected by their feelings about their hair, and she’s in it to build women up.\n\nI agree women should totally get what they want, it use to bug me to be questioned, too. But after seeing my friend and her clients in this situation, I understand better why she closely questions big changes. I appreciate that she cares.", "How do you factor in this part of it... \n\n>I said whatever she wants I'm fine with, they cut it and asked if I was okay with it. I asked my daughter if she liked it she said she wanted it shorter, they asked me what I thought.... I told them to please cut another 2 inches off and shave the undercut shorter, *they tried to argue that it looked more feminine at the length it was at*\n\nThat's not a CYA statement. That's directly arguing with the choices of the *parent*. \n\nWhen the *parent* aka the person paying, says \"cut two more inches and shave the undercut shorter\" there is no need to CYA other than perhaps repeat it back to make sure you understand.", "100% this comment right here!", "OP gave the stylist specific instructions that the stylist argued with because her cut was more \"feminine\" \n\nThat's not measured twice cut once. That's imposing her ideals on the client.", "I'm curious what your breakdown of this part is...\n\n>I told them to please cut another 2 inches off and shave the undercut shorter, they tried to argue that it looked more feminine at the length it was at,", "> I told them to please cut another 2 inches off and shave the undercut shorter, they tried to argue that it looked more feminine at the length it was at,\n\nThat's NOT checking for permission. That's i.posing a personal opinion on a client.", "She did say exactly that! How many times does she have to repeat it?", "Op DID. \n\n>I said whatever she wants I'm fine with, they cut it and asked if I was okay with it. \n\nOP didn't lash out at the first query. \n\n>I asked my daughter if she liked it she said she wanted it shorter, they asked me what I thought.... I told them to please cut another 2 inches off and shave the undercut shorter, they tried to argue that it looked more feminine at the length it was at,\n\nThen OP gave explicit instructions, and the stylist still argued. \n\nThey then did the same thing with the 17yo. \n\nThe stylist clearly had a problem with the kids choices and *wanted* the parent to have an issue too.", "So did you just completely fuckin skip reading this entire post?", "If you read the post, she had told the stylist that multiple times.", "That would be believable if the stylists hadn’t pushed back that the 14yo’s hair was “much more feminine” when they didn’t cut the requested style.", "Yep. My mom went through the same with my siblings’ hair, except my sibs were adults when it happened. Mom and sibs walked out before they ever sat in the chairs because the stylists kept arguing about what my siblings wanted their hair to look like. It’s shitty but it happens a lot more than some people want to believe.\n\n(My siblings are disabled and cannot live alone, please don’t harp on my mom handling things for them)", "Where was this mom when I was a kid?", "I just think the stylist was covering themselves and just from reading reddit I can see why they feel the need to do this.", "I suspect the stylist has been burned before. You need to remember that you are not her only client. It costs nothing to give her grace", "I would consider it shell-shock. I can't imagine how many times a stylist at a chain got yelled at by a controlling parent or someone trying to scam a free haircut or someone who wanted something different and then instantly regretted it.\n\nThey also may be trained to ask/confirm multiple times b/c the managers are exhausted from all of the above.\n\nUnless a service worker is obviously being a AH, I try to give them the benefit of the doubt b/c they take so much abuse and so many of the issues are out of their control.", "The point is, they’re your kids, and you’re paying. They’re covering their asses because they *HAVE TO.* You may be a lovely and trustworthy person, but I can promise you they have had people that aren’t, and who will suddenly claim it’s not what they wanted and refuse to pay.\n\nI get that it’s annoying that adults don’t always give kids autonomy, but this is literally their job and *YOU* are the paying client. It’s weird but that’s the way it works. You’re the parent. You brought them in. You’re paying and waiting for them to be finished. Because they’re your kids. It’s great that you give them such decision-making power, but you can’t get mad at the stylists because other parents don’t. \n\nI mean geez, how hard was it *actually* to just say “yes, that’s fine?” or just keep saying “whatever they want?”  What were you doing, running a zoom meeting from the waiting room? Juggling priceless artefacts? Solving a difficult equation? You’re literally there to kill time while they get their hair done, and maybe get yours done too.\n\nYour *fourteen year old child* showed more social consciousness and consideration than you today. Maybe just ruminate on that for a little while. You raised her, and I’m assuming you believe you did a pretty good job. I agree, she sounds like she’s empathetic and she’s not afraid to tell you when she thinks you’ve done wrong. No one is perfect. Today you definitely weren’t.", "Was anything they were asking for going to be different prices than what was originally talked about?  That’s the only thing I can think of were they would want to keep checking in with the person paying after giving the initial “ok”.", "Look, YTA.\n\nEven your kid who you were sort of backing up thought you were being rude. This comes down to you being too impatient to deal with being bothered with three whole questions over the course of what, 30 minutes? An hour? And therefore being rude and snapping at a service worker.\n\nI get it, you're annoyed. Just try to be nice anyway if the person has done nothing wrong? It's just called being polite.", "The stylist presented her opinion on what the outcome of the cut would be to ensure that it matched what the individual wanted.\n\nThat’s exactly measure twice cut once.\n\nI just had a daughter devastated by her bangs because she communicated what she wanted poorly.  This type of stylist would have helped in that situation.", "To me this is to ensure that the person is clear on what the outcome will be.  A less traditionally feminine hairstyle.  I would suspect that peoples pictures of what a style looks like in their head, the instructions to the hair dresser, and the end result after the literal interpretation of those instructions are all different.", "She said it regarding the 14 year old, and then they asked again regarding the 17 year old.\n\nThey probably could have reasonably assumed that it would apply for the 17 year old as well, but you know what they say...", "Especially with a chain place - they probably have locations all over and a set corporate protocol with trainings to always confer with the parents of a minor due to past lawsuits, threats of lawsuits, etc.", "No,  it was a great clips no matter how they cut the girls hair it was $17 plus whatever I tipped them", "She presented a picture. The OP ok'd the style based on the picture. \n\nThe stylist chose to ignore the picture, leaving it longer to look more \"feminine.\" \n\nThe stylist then argued with the parent when given specific direction to match what her daughter wanted. \n\nThis is not saying \"your hair has too much curl for that cut it will be a lot of work.\" \n\nTaking a picture of the style you are looking for helps avoid the communication issues.", "The kid had a picture of the style she wanted. \n\nShe already had short hair with an undercut, this would be obvious to any stylist working on her, it had grown out only a couple months. So it would not have been very long at all. \n\nIt would be pretty obvious that the client wasn't looking for anything traditional. \n\nThen the follow up instructions \"cut two more inches and go closer with the undercut\" it's very obvious that the stylist only trimmed the existing cut. That wasn't what she was asked to do. \n\nThen arguing showed how she felt about the parent supporting the kids requests.", "No where in the OP does it state the stylist left it longer than the picture to be more feminine.\n\nIt states when it was done she wanted it shorter.  And when she asked for it shorter the stylist said that it being longer was more feminine.\n\nWe don’t know if it matched the picture or not.", "My MIL is a hair stylist, and she tells stories of parents who take their teen for a haircut, say, \"Do whatever they want,\" spend the whole appointment looking at their phone, and then go nuts when the cut is all done and refuse to pay for it because it's not what the parent wants. That stylist has probably had a few people do that to her, so she is veeeeery wary now.", "So my mother worked in a chain salon for a lot of years. It is really common to have people come in and ask for one thing and flip out when you give it to them. \n\nMothers show up with children saying they want 2 inches taken off and then flip out cause it’s too short and they actually have no idea what an inch is, or people who show up with pictures from a magazine wanting an exact cut, but it looks horrible on their face shape, and even parents who say “what ever they want” and then flip out when they see what their kid wanted. \n\nIt’s a defence mechanism to ask and ask and ask. \n\nYou’re not an AH for the sentiment, but you could have been a little bit nicer about the delivery, the snappiness earns you the YTA\n\nNext time try making a joke out of it “do what ever they want, if I don’t like it I’ll just pretend not to know them in public” or “they’re the ones you have to please, I pay for smiles”", "My nephew moved in with me from the Midwest to California after getting his Master's. I was headed out for a trim at a local quick cut and he asked to come as he needed a haircut. He sat in the chair, told the stylist what he wanted (which was a short buzz cut) and she looked to me for approval. He was 23. We both just started cracking up and told her how old he was. She was just so used to asking permission for any parent/child type pair that came in that she just didn’t really clock his age.", "NTA. I would similarly be annoyed. I would have handled it a bit differently though. After the first time they asked, I'd say \"I appreciate you asking but it's their hair. They don't need my permission, they already have it. Ask them, not me. Thank you.\"\n\nI get all the comments about how stylist might have been burned before but the \"would be more feminine like this\" comment rubs me the wrong way. Sounds like a lot of very polite opinion, disguised as 'are you going to let them do this?' or personal discomfort about their style leaking out. She seems to have been professional otherwise so no harm, no foul but still.\n\nThey sound very adventurous. I'm not sure where you live but a lot of places have salons or at least stylists that are a bit more to your daughter's style. Some stylists specialise in \"crazy\" hair. That way you're not asking Miss Balayage and Feminine Long Layers to cut something that's alien/crazy to her.", "NTA. Honestly, hair stylists that won't cut hair short on female presenting people are obnoxious as F. I'm a grown adult and I asked for a haircut that was shaved just a little in the back and the hairstylist just straight up didn't do it. She asked me a dozen times if I was really sure, and didn't cut it even close to how short I wanted it even after asking her to take more off three times. I didn't have the backbone to be as blunt as you are and I wish I was like that sometimes. I guess you could have been gentler just once to clarify \"oh you don't have to ask me, the hair is up to them\" and then if they persisted got a bit more snippy. Pun intended.", "I get it.  I’ve got an almost 20 year old who likes to experiment with her hair, too, and I have the same mindset of, “it’s hair, it’s your hair, I don’t give a shit what you do with, as long as it’s clean.”  But YTA for -how- you responded to the stylist. It’s a chain, the stylists are making sure to play cover your ass, and are most likely trained to do so. Next time, just lead with, “Hey, I’m 100% on board with whatever (name) wants. Seriously. If she wants you to give her a Friar Tuck, go for it. I have zero opinion, I think she looks best when she’s happy.  I’m going to sit over there, and catch up on a few things I wanted to check out, let me know when you’re done. Thanks!”", "YTA. You could have been nicer with your response. This isn’t just about short cuts. If your kid asked to have some weird symbol shaved into her head and the stylist didn’t check with you I’m sure you would be livid.\n\nThe stylist is covering her ass. All you had to do is just be polite and give permission. It’s not that big of a deal.", "YTA, but softly. Your kids are minors. The stylist can’t do anything to your children without your permission. You should be more understanding of that.", "YTA - kids often \"want\" insane hair styles. If they pick one mom hates, mom ALWAYS rips the stylist a new one for it. It's not that hard to confirm to the stylist that you're ok with your kids picking stupid hair styles of they want to", "YTA. The stylist has probably had parents yell at them before for not cutting kids hair exactly how the parent wanted it. If they would have cut it incorrectly I’m sure you would’ve been upset with them. They wanted to be sure both you and your children were okay with the style. It’s to prevent any issues or complaints at the end, you should not get annoyed or be rude because they are checking in with you.", "YTA if the parent is there, then stylists have learnt that they don’t get paid when the parent is upset.\n\nIf you had dropped them and left or walked away to the waiting room then it wouldn’t have happened.", "My nine year old has been experimenting with hair.  Currently, one side of her hair is shaved the other long, though we need to get a haircut.\n\nI don’t particularly like the hairstyle but it’s not my hair.  I grew up never allowed as a kid to have my own style so this is important to me.  Last time hubby took her and it was obvious they were trying to get it to look more “feminine” as they left certain spots untrimmed and barely shaved it.  I told hubby he’s not allowed to take her until he can stand up for her; daughter is a people pleaser who will say she likes things she doesn’t, so she needs an advocate here and hairdresser can be *pushy.*\n\nI’m thinking that if I get the reaction you got, constantly asking me if it’s ok, I will just turn to my kiddo and ask her until they get the message.\n\nKids deserve autonomy and hair is something that intensely matters to the person wearing it and shouldn’t matter at all to literally everyone else.\n\nNTA.  You are a good parent.", "NTA you said they could have whatever haircut they want and showed pictures to confirm. The stylist pushed back with their personal sexist opinions about a more feminist look. Absolutely ridiculous.", "NTA\n\nI would understand the “she just didn’t want you to get mad” stuff if it wasn’t for the “more feminine” line. That makes it extremely obvious the hesitation wasn’t because of uncertain parental approval but rather because of sexist gender hangups about how girls hair “should” look. I’ve experience this, when I cut my hair short it took me *three* haircuts to actually get them to do what I wanted instead of trying to “feminize” it. And the third one only did what I wanted because I’d taken a pair of clippers to my head in a friend’s basement in the interim and only gone back to have the style cleaned up in the back where I couldn’t see very well and knew it was uneven. Good for you for sticking up for your kids and letting them have autonomy over their own hair!", "NTA\n\nWhen they tried to refuse to do what your daughter and you wanted because it would look \"more feminine at the length it was at\" that's when the stylist became the major As.", "NAH I think they have to ask you because a lot of parents would come in screaming if they did something to their kids hair without the parents consent.", "I'm a hairstylist of 20+ years your NTA yes maybe rude because you don't understand that for stylists we have our shit jumped on regularly by parents that say let them do whatever they want it's their hair. What these parents really mean is do what every they child wants so as long it's a \"normal\" cut and nothing to drastic from how they came in. It's a rarity for parents to truly allow their child the freedom to do whatever they want to their hair and not freak out on us. So we rather be safe than sorry we cut the child's hair", "NTA, but it's a chain - the stylist is covering their ass - it's probably corporate policy to triple check with parents", "NAH as a stylist I will say that you seriously do need to ask everyone involved 1,000,000 times if they really mean it because I have literally been shown an anime picture and then had a crying child in my chair SEVERAL times so she was just realllyyy covering her ass. But you affirming your daughters right to make choices for themselves doesn’t make you rude it the delivery just may have been miscommunicated. Go you mama! You’re my favorite kind of parent to have in the salon! And the more bad haircuts they choose as teens the sooner they’ll find their style as adults.", "NAH but they should have stopped asking and you could have phrased it nicer. I would be frustrated too", "While I can understand why the stylist would ask if you were sure as a CYA to stop you complaining later, once is fine (and once for each cut is fine) but multiple times especially after not giving the 14 yo what she asked for is too many, and the comment she made about it \"not looking feminine\" enough rubbed me the wrong way. It felt very judgemental rather than confirmational. NTA.", "She’s probably had parents yell at her before for not checking in with every little thing. I’ve seen videos about it on tiktok. From her perspective, it’s better to be safe than sorry. I don’t think you’re TA though because that feminine comment was rude.", "If your 14-year-old heard your tone and said you were rude, you probably were. Because we can't hear tone in this post. You might have said something very basic, but said it angrily or dismissively. I find in dealing with service people, it's more about the tone than the words. If the stylist looked upset, you should have apologized. If you didn't, YTA.\n\nOn a side note, I'm really glad you let your daughters have full freedom to express themselves through their hair. I do the same with my sons, who both have very long hair. For that, NTA.", "I really don’t understand the Y T A votes. The stylist’s comment about the haircut looking more feminine was out of line, IMO. I will take the downvotes but I don’t understand why that was a relevant comment to make when OP herself had asked for the cut to be shortened as per the daughter’s wishes. This reeks of tired gender roles to me. The stylist wanting to retain the cut’s femininity went directly against what the daughter (and mom!) wanted, so I’m wracking my brain trying to figure out why it was even brought up in the first place. NTA.", "NTA but you probably could’ve given the same message less bluntly.\n\nI had a hairstylist that apparently had some customer PTSD once. I asked her to cut my waist length hair to chin length. She acted very scared about it, so I reassured her that I had done that before plenty of times before and it’s not a big deal to me. She was actually shaking a little bit at the end despite me talking to her very calmly and nicely the whole time. I’ve worked customer service for years, so I get it. I guess a lady asked for the same and freaked the eff out on her when she realized how much hair was gone. Hairstylist only cut it to shoulder length and I was done spending time there on her therapy. So I just paid for it and got a shorter cut somewhere else a couple days later. I’m still a little annoyed by it, despite having empathy for her experience.\n\nPoint being, after talking to enough hairstylists in my life while doing this kind of thing, I’ve realized some people treat them terribly. And that’s why they get so scared. Which sucks, because it really is just hair. And it does just grow back (for us lucky ones).", "NTA- But maybe try finding a small business salon, I find they are more accommodating and friendlier. I take my kids in, show them pics of what they want, and I may only get asked about the length or color but other than that they listen to my kids when I say it's their hair ask them. Most of the time if they ask me, it's because my kid is sitting there with a deer in the head lights look and isn't responding.", "YTA for the way you treated the stylist. No doubt they were just following corporate guidelines - if the parent is the one paying for a minor child's haircut, then they check first with the parent.\n\nIf your 14 year old felt compelled to tell you that you were being rude, then that should be a sign. 100% the hairstylist has had parents walk in & say \"give them whatever they want\" and then be shocked pikachu and screaming for the manager when they see the end result of what the kid wanted. Hairstylist was just doing her job, all you had to do was say \"yes, that's fine\".", "NTA, I hate having to repeat myself, and they just seemed to be saying \"you sure?\" Instead of o.k., and wanted to toss the feminine part it on top, like jeez shut up n cut already or I'm leaving", "Tbh- as a hairstylist, I’d say NTA. I personally feel relieved when I have a parent like you. I prefer to let the child make their own hair decisions whenever possible. The situations that I’ve been in where the parents are lurking and micromanaging/ not letting their kiddo get the cut they want always feel very uncomfortable to me. Like others have said- you don’t have the most typical parent reaction that a hairstylist is used to, but I think worst case scenario you were a little rude and best case scenario you made her rethink children being able to communicate for themselves and having a little autonomy.", "NAH. Just a totally normal interaction from what I can tell.", "YTA. Be polite. These folks get yelled at by parents all the time. They get yelled at if they listen to the kid and not the parent. They get yelled at if they listen to the parent and not the kid. Answer the question. The stylist is making sure of the expectation  trying to get it right. Be polite.", "NTA", "NTA.\n\nI was prepared for N A H, but that \"more feminine\" line brought it from the stylists just covering themselves from a potential parent backlash to inserting their own physical gender ideals.", "I was going to be away all day, so I gave my 16 year old cash and told him to walk to the barbershop a block away. When I came home he had the best haircut he’s ever had.", "YTA - not enough stylists commenting on here, lol.  A stylist lives between these two spots where she is trying to meet people’s unrealistic expectations and also create a following that will allow her to survive economically.  They are often living off tips, and are expected to make people look good at speed - often working on many people a day.  High strung, combative individuals, often difficult to please are at least 30% of the clients.  She already knows you are not a happy camper due to your vibe, so she goes out of her way to make you happy by confirming what you want.  The femininity of hair might be meaningless to you and me, but I promise this person has dealt with tears, threats, rudeness and rage filled yelp comments in their career.  Not to mention all the photos and tagging of pictures on social media.  If your 14 year old thought you were rude, you were rude.   \n\nAlso, many stylists actually care deeply for their craft and are hesitant to give people cuts/colors that they think will look bad.  That is why some stylists won’t just “do exactly as I say” when people come into the salon.  In their own self concepts, they are not servants ready to obediently follow orders, they are artists, waiting to decorate their canvas. (Obviously, not all stylists- many are more pragmatic/accommodating than that.)", "NTA- I've seen stylistics act this way before.   We went somewhere else.\n\nThere is so much control over people to have hair cuts to fit a gender rolls vs a meaningful expression of unique personality, it's sad.", "You were the one paying, it makes sense to ask you if you were okay with the cut. Now the stylist could have read the room a bit better after the first kid--but that's not a *huge* mistake, just misreading signals.\n\nI guess NAH but you both got a bit (ahem) snippy with each other.", "NTA. The stylist shouldn't have any opinion regarding anything to do with gender and your child. If you make it clear the lid can get anything she wants, they shouldn't ask you again.", "NAH.", "Being a successful stylist is all about reputation, if you end up not happy and post a shitty review because you gave no guidance, then they lose business asshole! How hard is it to tell them how to cut it?", "NTA. \n\nYou’re actually a great parent. But you see, these stylists have had many angry parents give them hell for not quadruple checking that it’s okay. So they’re shocked that you’re a reasonable human who knows that hair will grow.", "nta. you said “whatever the kid wants” and they kept asking you.", "If the hair stylist wants to argue with you after you said it was okay to give the girls exactly what they want, then, NTA.", "My mom would have killed me, the stylist and burn the whole salon if it was more than a trim.  I wasn't allowed to cut my hair. \nShe tried that shit with my daughters.  It LOVE telling her 'it's there hair, their choice '. And when she starts, I stop it.\nBoundaries are so much fun.", "YTA I get you were annoyed and didn't care what your daughters did with their hair. Unfortunately, many parents very much care, and can be an absolute nightmare for the hairdressers to deal with.  No need to take it out on the hairdresser for the very real need to check in and make sure her ass is covered.", "Then wouldn't NAH be more appropriate?", "Uhhh.  I don’t really buy the stylists just wanting to make sure Op didn’t complain.  It’s the “it looks more feminine” comment that makes me think so.  I get checking in but stylist was pushing back because she didn’t like the hairstyle the girls wanted.", "The number of times I've been asked \"will your husband be ok with taking this much off?\" \n\nEvery damn time I tell them that if I shave my head my husband doesn't get an opinion.\n\nHate that shit.", "The sheer number of times I have asked for something specific and then they hair stylist did something completely different. I remember when I was 16 breaking down and crying when I got home from a haircut because I just asked her to trim like an inch off my hair to get the dead ends. It wasn’t bad, I just wanted it to be healthier so it only needed a trim. I had long hair when I got there, it was halfway down my back. She cut my hair to my shoulders because that was what she thought would look better. I was so upset and in shock I didn’t even know what to say when I saw it. My mom immediately could tell I was upset though.", "Honestly shit like this (and generally being very protective of my hair) is why I do my colours and my cuts on my own. If I ever mess up? It’s hair. It grows back (plus I have some years of practice so I’ve gotten decent at it).", "That's the problem I did confirm with the stylist that they could have whatever stupid haircut they wanted. Then they tried to change my 14-year-olds to make it look more feminine. When I told them to cut two more inches off and shave more off the undercut they still questioned me. Then the 17-year-old who is going to go get a haircut by herself,  just happened to show up when I did, whose hair is already five different colors and five different lengths ask for something else weird they asked if I was okay with it.\n\nThe 14-year-old already had the hairstyle she wanted just grown out and just wanted it shortened up again. And the 17-year-old's hair already looks insane no matter what they did they couldn't make it look any worse.", "The stylist argued and tried to push a more feminine look. That's not just checking in with the parent that's pushing personal opinion.", "Exactly this. I'm a woman with short hair, sides and back buzzed off with 3ish inches of length on top. It took me YEARS to find someone who would cut it that short. They didn't even want to use a straight razor for texture. All i could get was some variation of a pixie cut, which is not what i wanted. Everyone was concerned about how masculine I'd look, they didn't even have to say it, it's pretty clear from tone and overall vibes if they are afraid of issues after the fact or disapprove of the cut.\n\nI go to a barber, now, who happens to be a woman.", "YES thank you! I have no idea how people are missing that part. Personally, that’s all I needed to see that the stylist likely was not inquiring to cover herself but was inquiring because she did not approve. The stylist also repeatedly asking (even though the mom was very clear) also stuck out to me, but it’s mostly that feminine comment that makes me say NTA. I don’t really know what else OP could’ve done since they made their position very clear to begin with.", "> I don’t want the moon to complain\n\nStupid moon, getting in everyone's business :)", "You’re the customer, you’re the one who pays and tips, you’re the one whose happiness matters to the stylist. Shes just covering her ass. Its annoying but it makes sense", "It’s probably bc of the chain place. Find a good stylist that they like - even if they are at a chain - and stick with them. \n\nKudos on letting your kids express themselves! I was a teen in the early 80’s and my mom had the same mindset. My best friend was in cosmetology and experimented quite a bit on my hair. Totally NTA.", "People get.mad all the time when they say they won't.  \n\n\nI said whatever they want but not like that", "They do this to me and I have 3 boys! I always ask my kids how they like it too.", "I suspect the stylist is covering their but in fear of being screwed over. Might I suggest what my best friends mum used to do, offer to pay in advance, or write a note saying you agree to pay for whatever hair cut your daughters request the stylist to do.\n\n Also consider trying to stuck to the same stylistso that you build a relationship with them and in the future this won't be an issue because the stylist knows you and more importantly knows your daughters hair history, (over dyeing can cause weird colours, loss of colour and breakage).", "But the staff didn't know that. \n\nIf it really doesn't matter to you then find an actual salon so that they can get to know you and your hands off approach.", "Or it's a stylist trying to have a style conversation to make sure her client has considered her options. The feminine comment is shitty but lots of people care about that sort of thing. The woman who did my kids' hair when they were teenagers knew they didn't need my permission, but she would still engage us in conversation to get us talking and sharing feedback. \"Mom, Kiddo here says she wants more beads. What do you think? I told her it might look like Venus Williams cosplay but she thinks it'll look cool.\" or \"Mom, you think Kiddo will have any problems with school if I use the neon extensions she wants?\"", "It takes 5 seconds to confirm. There's no reason to be short with the stylist", "“…no matter what they did they couldn’t make it look any worse”. You not only sound like an impatient person but we’re clearly giving vibes to a stylist working on a minor that your lack of concern was out of disdain. So now they have a paying customer who is impatient, not verbally HAPPY, just sort of whatever just do it don’t make me tell you again, and a minor calling the shots. \nWhat a crummy customer you were. This isn’t a lesson about body autonomy or listening skills as much as it should have been a lesson to you about professional artists eager to please clients getting treated poorly (by you). Can it get annoying to reconfirm? Yes. Do you sound like the type of person that would complain if they did something not to you or your child’s liking? Also yes. They’re just trying to please you.", "Barbers are awesome!!! Best cuts I've ever had, and I have long hair. \n\nI have ADHD and sitting in that chair is absolutely torture for me. I hate it (one of the reasons I have long hair, lol) \n\nThe number of times I've asked them to cut off 4\" for them to tell me it doesn't need that much cut, then me to argue back just cut off 4\",  then to be finally done and realize I'm going to have to return or sit being tortured another hour for them to adjust the layers is innumerable. \n\nBarbers just give me the cut I want.", "I had a good friend who told me she always got a better cut from a barber. They didn’t argue, just did what she asked.", "That’s why I go to a barbershop.", "Except for that feminine comment. That makes it suspicious to me that they might not have liked doing those kind of cuts.", "The part where the stylist wants to argue whether it should be cut shorter and how much more feminine her own idea of the cut would be, that's when she became the AH. That's why he got irritated.", "Heck, I was just a cashier - all I did was scan items, bag items, and give the customer their items and receipt. \n\nI was yelled at more than a few times (\"sorry ma'am, the sale is on Levi's, not Wranglers, so those jeans are not 25% off\" - customer proceeds to lose their damn mind), and I can almost guarantee that it's so much worse when your job is altering someone's appearance. \n\nSo I'm with you, the stylists are likely just trying to do a good job while not getting yelled at.", "Yes!!! This is what many people don't seem to get.\nI don't think the stylist's comment was necessarily misogynistic, but more along the lines of, okay, just so we're clear, this is the outcome you're wanting, right? Because the worst thing in the world is to have a complaint filed against you when you've done exactly what the customer asked for, but they didn't understand what they were asking for.", "Yup, i only go to barbers now too. My mom has never found a hairdresser who will do what she wants them to do. Doesn’t matter how plainly she says it, how often she repeats it, they never do it. She ends up going home and getting the buzzers out and trying to fix whatever they did.", "My worst job was as a drive thru cashier at a Wendy's. If prices went up Id get yelled at like, yes, I the person making minimum wage behind the window controls prices for this national chain. I'm totally the person you should be mad at.🙄", "Maybe go to a locally-owned salon next time? Especially one with a more alternative vibe. They’ll be a lot less likely to bug you with questions like this, but would at least keep you involved by explaining what they’re doing as they go, provide tips for care/how often to come back in for a trim, suggestions for what crazy idea to try next time, or what ideas absolutely will not work on your daughter’s particular hair type (some hair types just don’t work with some styles, unfortunately), etc.\n\nIt still covers their asses, since both of your daughters are minors and you’re paying for it (they don’t want to get sued later if you object to something), but in a much less intrusive way.\n\nIt takes a bit of shopping around and is often slightly more expensive, but you get much better service for your money.\n\nA good example of the place I like to go to is Scream Salon in Seattle, WA. One of the stylists there was the one who helped me figure out that the reason I was overheating so easily in the summer wasn’t because my hair was too long…it was because my hair was too *dense.* It was so dense it wasn’t allowing any heat to escape my scalp at all, and was also the reason it couldn’t hold any sort of style (way too much hair and therefore too much weight) and took forever to dry (not enough air reaching the roots). Instead of just going straight for cutting it short, she tried thinning it out instead, and that made a world of difference.\n\nI’ve got to plenty of chain haircut places over my lifetime, and not a single one of them said anything about how freakishly dense my hair was! Which says a lot about the level of service and attention to detail you get there…", "We don’t know if she asked shorter than the picture or not.  The story makes a lot more sense of the 2 more inches off we making it shorter than the picture.\n\nEveryone seems a lot more reasonable if it’s\n\nCut it to the picture, checks with OP, Do you like it, no 2 inches shorter, that will be less feminine (then the picture), just do it it what’s she wants.\n\nThat seems a pretty likely scenario given the OP doesn’t say if it matches the pic or not.\n\nAlso if the detail of the picture relative to the cut gets added later in my opinion that would be an unreliable add as it just goes to paper over wholes in her story", "I think everyone should be required to work 6 months at a fast food place, 6 months at a retail store, 6 months at some telephone answering customer service type job, and 6 months cleaning somewhere. Citizens should be drafted into service like some countries do for their military. The whole country would have better behavior if everyone had a little experience in these kinds of jobs.", "The 14 yo has short hair and an undercut already. It had grown out a few months. So we aren't dealing with really long hair to start. And the fact that she was repeating the style would have been pretty obvious. \n\nThe follow up instructions were to cut two more inches. That's a pretty large difference for someone who already had short hair *and* who came in with a picture. \n\nThere was no reason at all for the stylist to impose her views of femininity. \n\nIt would have been obvious that the parent and child decided together that the cut needed to be shorter. They were right in front of her.", "Now you’re just adding things not written for some reason.  She didn’t impose her views of feminity. She discusses societies views on femininity while clarifying what the Final Cut would look like.\n\n\nMeasure twice cut once and be nice to people in the service industry", "YTA. You have no idea the number of raging asshole parents cosmetologists deal with on a daily basis. You get to count yourself among their number now. \n\nWhen there is a parent present for a cut they always defer to the parent and make sure they are happy because the parent is paying and 6 times out of 10 they will fly off the handle for most minor of things. Not to mention the heavy number of parents that try to micromanage the cut and start getting pissed because the hair doesn't look right when they're a third or more through the cut.\n\nMy mom has been a cosmetologist for most of my life. She's done everything from the cheap mall salons (anyone old enough to remember that Sears had a salon?), to owning her own shop and everything in between. These days she works in a kids salon. Some of the stories I've heard over the years would make your blood boil while others would just make you shake your head at the rapid decline of human decency.\n\nIt's because of shit like that many cosmetologists have learned to try to be proactive and try to prevent the absurd reactions from parents by keeping them involved in the process. Even then they can't fucking win. You should be grateful that they cared enough to take their time and make sure it was right as most chain salons don't give a shit about quality. They want quantity and pressure their staff to speed through cuts to meet quotas.\n\nI hope you at least tipped them well. If you truly didn't care what the cut looked like then you should have stayed in the waiting area and not gone back with them. Maybe next time just drop your kid off with cash and have them call you when they're done while you go to Starbucks or something.", "You were so freaking rude. There was no need for it, they were being cautious and considerate, and you stomped all over their good intentions.", "When my kiddo turned 1, they started pulling my long hair while I held them. Hubby and I went to the salon to get my hair chopped off because I was tired of the hassle. When I told her I wanted a very short cut,  almost buzzed, the hairdresser looked at my husband and asked if he was okay with that. Holy shit. He obviously replied that he was okay with whatever I wanted, and it was strange to ask.", "Recommendations for next time, drop them off and leave. Pick them up when ready, I'm sure you can wait outside or go and have a coffee or something. Saves you the trouble and everyone will be happy. When I was 14 I went to the hairdresser all by myself. I can imagine that isn't always possible due to distances and needing a ride but you can just drop them at the door and run some errands. Kind of ESH as you were not nice but the stylist should have listened too.", "NTA. Honestly, when you said 'it's their hair and they can do whatever they want with it' that should've been enough to stop them repeatedly asking you, right? That would've annoyed me too.", "NTA. I have been the person who has gotten their hair not cut how I asked because they wanted it more feminine or so I could wear it more feminine. During pandemic my hair grew out much longer than jet had been in a long time. The first time I cut my hair after the stylist would not and did not want to give me the undercut or super short hair on top because she once ended up getting someone who thought they wanted it that way and then the husband yelled at her. I was frustrated and ended up hating my hair but every time I said cut more she’d barely cut it. I never went back to her again. While they do it to cover then they also loose customers doing it as well. \n\nWhile you may have been able to phrase it or say it more calmly I’ve been there myself and almost screamed at them as a grown adult getting my own hair cut because I should be able to be feminine.", "I think 1 or 2 times is reasonable but asking about every little thing is not so no you’re not the asshole in my opinion!!!", "This could have went differently, as they are both minors she was doing her job and all stylist gives their personal opinions about the cuts, YTA for the way you reacted each time she asked.", "Not really. You gave her clear instructions at the beginning. She should have just kept quiet and did what you told her to.\n\nHowever, I can see why she would have asked you multiple times. There are to many people who would say the same thing, then would complain that the stylist did what they were told. So I'd be a little understanding about why she would keep asking over and over.\n\nYou probably should have been even more clear that whatever the kids want will be find with you, and that you really do mean just that.", "NTA the stylist asked you way too many times, damn. Once per kid is enough, especially after they showed the stylist the picture and you said sure.", "NTA!!!\n\nI was going to say yta until the \"its not very feminine\" argument the stylist tried to start. After that comment, I would say you have every right to be snippy and impatient with that stylist.", "NTA\n\nI went with my mother to a hair stylist who asked if she was okay with it every two minutes. She didnt spoke a word with me and I was confused....\n\nI was 24 years old.", "NTA, I worked in children's entertainment (face painter) for a decade, when a child asked for something that some parents might frown upon, I gave it to them, I'd ask if they wanted to change it up to be more masc or femme, but I always asked them what they wanted, if their parent was absent at the time, too bad so sad if they don't approve. Kids usually know what their parents will approve of, and I totally did not mind being conspiratorial with them. 🤣\n\nI also never separated my designs by gender, because that's a weird pressure to put on kids. \n\nParents should not be control freaks about their children's styles. They also shouldn't manipulate them into doing what they want, but they unfortunately do. \n\nIn the 10 years, I had only a handful of parents mad at what I painted their kid when they weren't paying attention to them... And almost all of them were scary designs, and sometimes the kids or their siblings were frightened of their designs. 🤣", "If the stylist was upset, your tone was probably aggressive. Maybe more aggressive than you intended due to frustration. So NAH is my my ruling.", "YTA.\nI only say this because there have been lawsuits over this sort of thing.\n\nNeither child is a legal adult and you were their parent.\n\nI understand your frustrations but one lawsuit over this sort of thing can ruin reputations.", "YTA for snapping. If you are standing right there when the haircut is happening, and paying for the haircuts, it’s reasonable for the stylist to assume you want to have a say in the haircuts. I would sit in the waiting area and let them get their haircuts without looking over her shoulder.", "NTA. This is why I bought myself clippers and taught myself to shave my head and keep the sides trimmed. I usually only go in when the top gets too long. Don’t actually trust myself with the scissors. When I do half the time I have to re go over my sides and back bc so freaking few of them respect how short I want it. They want to use a different blade even though I tell them exactly the one I want or do a fade. My sides and back are heavily grey.  When it grows in, it looks a bit darker. You give me a fade it looks like I have a line across my head. I also don’t always have the time or desire to sit through having my most of my head reshaved bc they wouldn’t go as short I wanted first go round. I’m still sad my friend moved shops to further away. I know people suck, but like I’m a grown woman. I know how feminine I want to look (heard that one sooo many times). Please just cut my hair how I like it even if you don’t personally like it.", "NTA, but your attitude might have come across as a bit rude. I am 18, almost 19, and my hair dresser STILL asks my mom. Even if I'm the one paying? \n\nI am not in the US, I'm in Scandinavia. But it really bugs me to be honest haha.", "NTA! When I was young and questioning my gender, I wanted to get a \"boy short\" haircut. My mom was okay with it but the hairdresser was not. She kept trying to talk me out of it until she eventually did. All I wanted was to look more androgynous but noooo, I walked out with a bob. My 13-year-old confidence was destroyed and I'm still pissed! Let your children get whatever haircut they want and explain to your youngest that it's okay to be assertive to rude people.", ">I told them to please cut another 2 inches off and shave the undercut shorter, they tried to argue that it looked more feminine at the length it was at, I said if she wants it shorter then do what she asks.\n\nI get that hair stylists want to make sure that they don't get in trouble with the parents but this right here is the point where you were justified to be a little rude. They had an opinion about your daughter's appearance after you had already made clear that she's the boss about her hair. That makes you NTA.", "NTA.\n\nMy mom had the same thoughts on hair: \"It grows back, and it's not on my head.\" So I've done it all growing up pretty much. I used to have hair down to my knees and got sick of it, so I wanted to chop it. Went to the salon and said, \"Chop it to off, I want a pixie.\" The hairdresser almost had a fit and actually brought my mom back and had me repeat myself. My mom looked at me and said \"eh, I don't a pixie would look good on you but you do you, I would keep it at your ears so if you need to hide your piercings if you have too.\" And walked away. Went to my ears and donated the rest.", "YTA. The stylist was just making sure you as the adult legally responsible for these CHILDREN were okay with the decision they were making.\n\nThey’ve absolutely received complaints and going down the “how dare you do what my child asked, you should have checked with me first”. There’s also an almost 100% they’ve had the “I know it’s what I asked for but you should have warned me it would come out looking like this” feedback. \n\nI’ve worked in customer service. No matter how nice any one individual can be, the general public are horrible, especially when it comes to those people carrying out a service. \n\nIt’s just like a restaurant employee asking if you’re sure when ordering a dish because it’s spicy, it’s because they’ve had hundreds or thousands of customer make that exact complaint in the past so they’re trying to stop it happening again. The worst part is there will still be customer la that complain they weren’t warned about how bad it would be, so it’s obviously a needed tactic.\n\nJust be nicer to people doing their job, it’s not difficult.", "You'd be surprised at the number of homophobic mothers who think anything above the shoulder makes their daughter 'look like a boy'. I know in their heart the stylist wants to do whatever the person getting the cut asks, but they also wanna make sure they get paid and not review bombed by bigots.", "NAH\n\nBut try to understand that the stylist probably has to deal with crazy people who lose their shit over barely anything (and your situation was probably comparatively extreme). It sounds like your oldest daughter can drive. Just let them go alone next time. Easy.", "NTA I understand why you were annoyed, just know for every parent who says “whatever they want” and means it, there are 3x who say one thing then are shocked by the results.", "Why were you driving your 14 year old daughter around in a bed? Seems pretty irresponsible to me.", "NTA. I think u need to start going to a local place not a chain. They tend to b less tolerwnt of that. Mostly because stylists literally rent a space and if theu dont make rent they r out. Not making rent usually means they suck at their job. My SO and I c the same person every time. It's my job to find someone who isn't insane then we just follow them furrever. Last one moved out of state, had to find a new one. Literally went back to the same small local salon, after trying a few ppl at the chain salons. Found a new one about a year ago and she is amazing! Anyone in the kalispell area looking for a good stylist DM me, I would b happy to tell u all about her. She's damn good at her jon and when u ahbe curly hair u and u find a good one u basically have them 1st in ur speed dial.", "I really don’t understand it. I live in the Netherlands and from the age of 12 I went to the hairdresser allone. Nobody ever asked my parents… came back with a purple Mohawk ones hahaha", "YTA, sorry. That seemed like a rude response. I get what you meant but you forgot that these people get chewed up over the smallest things and tend to err on the side of caution. They might not know that you are in the “hair grows back” camp. Its pretty uncommon. And once they cut, they cant stick it back on.\n\nBe politer about it next time, put yourself in their shoes.", "As a dental nurse I have seen patients be told that they need a crown but cannot afford a nice shiny white crown so have opted for the gold colour one (back tooth) on the NHS as it's cheaper, told them it is GOLD colour and in the name, still agree to it, sign the treatment plan, see the tooth before it's put in and like it only to complain 2 days later it's not white coloured and they want their money back as the 'didnt know it would be white as who reads forms anyway '\n\nHappens all the fucking time.\n\nNTA for letting your kids have what they want but a bit YTA for being a bit dickish to the staff who is only trying to make sure you understand what they are gonna do for your kid and mamma bear mode is very strong when you are altering your child's appearance in any way and they don't want to be under fire.", "YTA - your youngest is right.", "I'm not sure, I'd say no one's the asshole, although I'd say both of you did stupid things. You could've been clear from the beginning, saying 'whatever they want, no matter how weird, they can have it.' instead of doing it piecemeal and then apparently snapping at the barber, as your 14 year old thought you were rude. But the barber arguing with you and your daughter about how feminine her hair looks is stupid, because who says she (or you for that matter) cares? That's not up to the barber.", "NTA I hate it when stylists change the haircut because they'd prefer it more \"feminine\" or \"masculine.\" Their job was to cut it how they asked. They didn't deliver until you told them repeatedly", "NTA but try to find an alternative hairdresser in your area that specialises in different hair styles, so they are comfortable doing what your kids want. i’ve had weird hair colours and hair styles before and have completely given up with going to the hairdressers because they never do what i want or they try to talk me out of it.", "NTA\n\nI'm surprised they did this with your 17 year old too, considering she came in separately. Who would they have asked if you weren't there? Maybe they would have asked your 17 year old to face time you to ask for approval. \n\n\nThe 14 year old I understand more as they want to make sure you as the one paying as the parent of the minor they are working on are happy. They may have dealt with bad parent clients in the past. You aren't TA as you told them multiple times not to worry about consulting you. Next time let them know any confirmation questions should be directed toward the one getting the cut.", "YTA, both of your children are underage, you as their guardian are responsible for them and you got angry for a hair dresser making sure that she provides the best service possible? The hairdressers I do not return to are those that do not communicate at all throughout the cutting process because more often than not haircut is of sub par quality since they did not really care.", "As someone with Alternative hair who just had a nightmare cut done yesterday... The worst they can do is not do what I want and make shit more \"feminine\" or \"ground\" my haircut to make it as bland and stupid looking, coming to a weird conclusion between my already alternative hair and my new cut idea which then looks the absolute worst because it's neither my old cut getting \"de-alternative'd\" NOR me getting a fresh looking, professionally done alt haircut. I end up with soup on my head basically and that's what happened and that is the worst for me.\n\nDo not try to normie-fy alt people, they won't like it, it's disrespectful going against the clients wishes and also with no prior explanation or warning just because (and I know because I have seen the training myself) a trained hairdresser gets a book that honestly ridiculous in telling them what's feminine and what's not feminine. Like? They get told cool colors or winter colors are a thing and that you should never dye hair too bright and that women want soft cuts when the pictures in their salons are often models with super sharp cut edges.\n\nIt's honestly disrespectful that I had to pay 75 bucks for the worst haircut and get gendered as a girl no matter what I do. It's frustrating.", "I agreed until the stylist made the comment that the 14y/o hair looked more feminine at the length she cut it initially. That’s when it was more like she wanted mom to persuade her daughters to look feminine. So no, mom was not an AH for her attitude. I already answered why you making me answer more than once.", "> I could imagine parents saying do what they want and then just playing on their phone and being shocked at the end of the cut.\n\nThat's on them.", "Until the age of 17 I jumped around from hairdresser to hairdresser desperately trying to find one that wouldn't ignore my requests. Even if I firmly said no, I found they would still somehow get their way. No, I don't want a fringe. No, I don't want layers. These were not big things. \n\nI finally found a hairdresser that only **suggests** things. \n\n\"Ohh, have you thought about going red?\"\n\n\"Yeah, I have and I don't think I'd like it!\" \n\n\"No worries, let's get started!\"\n\nRealised when I met her that all my stress about getting my hair done was just because of the constant arguments I was having. I swear I don't know why it's so difficult!", "When I was 14 I wanted extremely short hair. My aunt and the stylist (who was a guy) kept arguing with me because “trust me honey, you’d hate it.” I eventually just gave in and when I got home, had my mom cut it as short as I wanted for free. Wasted my aunts $70 and still don’t feel guilty. Fuck her and the stylist for not listening to me.", "I stopped going for this exact reason. I used to have straight cut bangs and a straight bob, I looked great in it, and I had it for over 10 years. I had to argue EVERY time. I was told it wasn’t possible for my hair to have bangs or a straight bob would look boring or whatever. They also always wanted to cut layers as my hair isn’t very voluminous but layers never made my hair get volume, it just made it look thin and horrible. I could straight up tell them to absolutely not cut layers and they would argue, say fine and then they did it anyway and say “it’s just a bit. It’ll be so flat otherwise”. No, it’ll be flat either way, it’s just how my hair works and now it looks thinner.", "I have such a stylists. She's awesome. 13 years ago I asked her to cut off my ponytail (after one of my long hair phases) and since then I tried so many different styles of short hair. Right now I have an undercut and I don't have to tell my stylist anymore what I want. She just knows. Love her!", "This ^^^ \n\nfwiw I've had the barber on occasion triple ask if I wanted what I showed, I'm glad he talked me out of it. It did not suit my face at all", "I was going to say. As a butch lesbian I would consider that to be a microaggression and experiences like that are why I cut my own hair at home (or get my girlfriend to cut it). It is absolutely not the stylist's place to impose their idea of femininity on OP's family.", "You think because a parent says they are fine with whatever the kid wants means they won't fly off the handle and refuse to pay for the cut afterwards? \n\nReddit doesn't have enough fingers and toes to count the number of stories I've heard from my mom about parents that confirm four or five times what they want and then flip the fuck out when they are given exactly what is asked for.", "Not all parents think like you do, unfortunately. Not long ago, I saw a post about a lady cutting her 12 y/o son and his friend's hair, and everyone was ripping her to shred about how it was practically assault to cut a kids hair that wasn't hers. I can understand the sentiment behind talking to the parents and getting permission before doing it, but people were seriously acting like she took him to get a face tattoo lmao. So many comments saying they would be physically violent with her if that had been their child. Over a haircut!", "Stylist doesn't get a good tip when the one paying for it doesn't like it", "As a stylist, sometimes kids want strange cuts or have something already. Often the parents don’t really pay attention and get angry what they see what their kids picked. \n\nI also imagine this was weird for the stylists because especially in a chain they will be doing very conventional cuts and were probably surprised.", "You should be able to converse with a hair stylist about your daughters’ hair cuts for less than two minutes without getting angry.  YTA", "There's a way of saying \"I know you keep asking but honestly, I'm the type of mum that thinks it's their hair, they're young it will grow back, they can do entirely what they want with it and have fun and I honestly don't care either way - just that they are happy. So just go for it and do exactly what they ask\", that should stop a stylist asking you repeatedly in a much better way vs \"stop asking me, I've already told you\".\n\nPresumably you were irritated at this point and it came across in the bluntness. If your youngest is pointing it out, your tone must have been pretty rude. But you're not a stylist and never have been, probably don't know how new they are, how many people ask or argue for their money back or complain, what that might do to their job or if they're in a rocky place at work etc etc. Customer service in my experience is just one of the worst places to work, because men and woman will just blow up about absolutely nothing and forget you're a person when it suits them.\n\nThat's not to say she was right either, but we can't control other people and how much they might be worried about making a mistake, just how we try to understand them and get the point across in a way they'll understand.\n\nSo I don't think its about being an AH here tbh, I think it's just about learning to be a bit more understanding and communicate better in situations to get the outcome you want. That way their day isn't ruined, and you don't worry and feel bad about it later. It can be hard when you're irritated for sure, but I've had to work on this myself so it's definitely possible to re-orietate your thinking and automatic responses on it. A large part of it for me is imagining I'm giving people energy,  rather than being the type of person to drain it away from them with negativity or bluntness etc.", "I think it would be helpful if you built a relationship with a particular salon or stylist, or just send them in with cash and go to a nearby coffee shop to wait. As others have said, they’ve probably had bad experiences with unhappy parents.", "it's called CYA - Covering Your Ass.\n\nSee, I had a customer when I worked at subway that always got a tuna sub with double or triple meat and I always told him that it would be $x amount extra for whichever he got. He would always tell me that he knows, that he gets it all the time and that I don't have to keep telling him.\n\nThe first time I decided to heed his words and not say anything, he complained about the extra cost, that he shouldn't be charged because he \"wasn't told\" that it would be extra for more meat.\n\nYou might not be like that, but it is better for the stylists to cover their asses and double check with you and with every customer, every time because the one time they don't could be the time they get burned.\n\n\nOh and if you or anyone else is wondering what happened with tuna man; I told him he knew damn well it was extra, called him out on what he was trying to pull and said that I wasn't taking the charge off. He refused to pay, so I dumped it in the trash. Never saw him again after that.", "I have worked with parents, and I will tell you that there are some that are all for whatever their kid wants until they see the final results and then they flip out, refuse to pay, call the police, or post horribly negative reviews on every social media channel they can.\n\nI understand your frustration, but they are really just covering their bases. I don't think you are an AH, but ai am not sure that they are either.", "More like they got the impression that OP wouldn't approve.", "I get that they want to avoid hair regret but there's much better ways to ask the same questions. I got something fairly extreme done and they asked \"have you told your husband what you're getting or will it be a surprise?\" Both the words but more the tone were so positive and excited that it didn't feel at all the same way as \"do you have permission from a man?\"", "This happens a lot.  I’ve had long hair for much of my childhood and all of my adult life (now 31) and I basically just don’t get professional cuts anymore.  I’ve only ever found one stylist who didn’t either a)cut more off than was necessary when I’d asked them not to or b)pitch a fit the whole time cutting my hair because I didn’t let them chop it all off.  Unfortunately that one stylist who understands my desires and respects my choices is awesome and therefore very busy.  So basically I just cut my own hair now.", "I stopped trying to find a hair dresser like 10 years ago who wouldn’t argue… Especially with the bangs and layers thing. I always had bangs when I was younger and was always told it wouldn’t work with my hair. They also always told me that I should cut layers, but layers looked horrible with my hair because it’ll look incredibly thin with layers. I could tell them very clearly to NOT do layers and they’d do it anyway. I now cut my own hair.", "My mum had the same trouble. Her hair was a really pure white, with a little natural wave. Very pretty hair, but she found it hot in summer.  She could not find a hairdresser to cut it off for her \"because it was so pretty\". For whatever reason, what SHE, an intelligent articulate woman, wanted did not count for anything.", "🤣🤣", ">get that it’s annoying that adults don’t always give kids autonomy, but this is literally their job and YOU are the paying client.\n\nRight? If you don't want questions about how you want their hair cutting, don't take your children to the hairdresser. I'd have thought that 14 is old enough to just be dropped off at a hairdresser - if a parent is accompanying a child and paying for them, damn right I'm checking with the parent.", "Having someone ask you over and over if something's ok is high key annoying and it would make me bonkers. However, OP could have just said \"anything they want is ok with me, feel free to ask them directly\" and just cut the whole thing off at the pass.", "A couple hair dressers have told me \"my man would never let me cut off all my hair!\" \n\nI just something like \"that's sad that you'd let them control you.\" And look devasted for them. \n\nThen they back pedal like their lives depend on it.", "Yeah, I’ve been cutting my own hair for years now too. I basically only go into a salon when I want to do something drastic that I can’t do myself. But basic trims or even cutting several inches off when it gets too long, I just do myself.", "Exactly. At almost 30 I have a hard time getting them to cut my hair the way I want. They will straight up say it isn't feminine or because I have chubby cheeks it'll make my face look fat. They will leave my hair multiple inches longer than I want it and not even in the style I wanted. They decide that isn't how an ”attractive woman” looks.", "This! That comment reveals the intentions behind her constantly questioning.", "Yup.  \nI'm non binary, but AFAB with very feminine features. I've had to stop going to certain locations of chain barbers because they try to feminize an androgynous cut or try to override me completely.  \nI know I can't do the structured men's cut of my dreams, but a wispy pixie cut ain't it folks. Doesn't matter what I show them--they make some comment and doubt me the whole way through.", "Yep, that right there is what jumped out at me and makes me say NTA about mom. I had to fight stylists for years as a little girl trying to get masculine haircuts and more than once went home crying because they would give me pixie cuts instead of the shorter, more butch styles I brought in as examples.", "I found that very judgey.", "I worked overnights at a convenience store in a rough neighborhood while I was attending college. I had guns shoved in my face a few times, got yelled at on the regular, can say how many times I had to explain to people I can't sell their kids Alcohol or Cigarettes even if they sent them with a note, and 60 to 70 hours a week for minimum wage plus hazard bonus of a dollar. 🤣\n\nMy mother was surprised I managed to do the job for a 18 months. 🤪", "Yea I totally read this as the stylist trying to give her personal Recommendation of how she thinks the hairstyle will turn out if she does what the daughter says. \n\nI’ve had plenty of hairdressers and barbers and they more or less give their opinions because as much as it’s technically my hair/head, it’s their brand.", "In 2017 I wanted a buzzcut and the chain salon I went to initially REFUSED to do it. Mind you that I was 23, so not underage or anything. They asked me multiple times if I was sure and then still went to my hair with scissors...I told them that I wanted a buzzcut and to just use the machine. It was a struggle to get them to do it, and I know it was because I'm female and they thought short hair isn't cute/feminine enough", "I stopped going to the hair salon like 10 years ago (I’m 31 now), because every time I had to argue with the stylist. I used to have bangs and I absolutely loved them and looked good in them. I had them from age like 15 to 27 I think. So many told me that my hair wasn’t made for that style or it wasn’t possible or that I should do X instead. I could even show them an old pic of myself for what I wanted and they’d still tell me that it won’t work. I don’t think I was happy with a haircut because they never did what I asked for. \n\nI hate conflicts and telling people they’re wrong so it was always so extremely uncomfortable for me to go, so I stopped. I learned how to cut my own hair. It might not be perfect every time but it’s better than paying 60-100€ to argue with them and not getting the look I asked for.", "When my friend had short hair, she went to a barber. Said it was 10x easier getting the cut she wanted and was cheaper too!", "I didn't. It sounded more like they didn't want to get chewed out for not giving their daughter \"a more feminine look\" as they almost certainly have been a million times.", "I guess I don't find that scenario likely for a few reasons. \n\nOf course, even asking for INFO about the picture could create a biased response. \n\nSo going by what was already given... \n\n>My girls are 14 and 17. The both have short hair.\n\n>So my 14 year old said she needed a haircut as her hair had grown out for a few months. \n\n>but you could tell daughter 14 already had that cut, it was just grown out.\n\n>The 14-year-old already had the hairstyle she wanted just grown out and just wanted it shortened up *again.*\n\n>Then they tried to change my 14-year-olds to make it look more feminine. When I told them to cut two more inches off and shave more off the undercut they still questioned me. \n\n14yo usually have access to social media today. Chances are the picture was something on her phone that she had used to get the previous cut, or a picture of her with the previous cut from social media. \n\nThe 14yo *already* had short hair. The hair style already included an obvious undercut even after a few months. \n\n14yo's hair can grow fast, but not that fast. \n\nChances are all she needed to begin with was 2.5 to 3\" to get back to the previous style. \n\n2\" is also a *huge* discrepancy with short hair. It's the difference between chin and ear length. \n\nAnd for the stylist to say her way is more feminine, that's probably the discrepancy we are talking about. \n\nI find it really hard to believe that a 14yo, who already had the haircut she wanted, it just grew out, would bring in a picture with that much discrepancy. \n\nSure she is 14, but she already had the haircut she wanted. She knew exactly what she wanted. OP says she just wanted the same cut again, not shorter. \n\nThe OP made it abundantly clear that the child was in charge of her hair and the child's opinion was the only one that mattered. The stylist still tried to impose her own viewpoint.", "The same thing happened to me when I tried to get mine cut short at 23. The woman at the salon *refused* to use a trimmer and insisted on scissors, and I was too non confrontational at the time to demand it. She straight up said “Oh, you don’t want to look like you went to your boyfriend’s barber” \n\nMa’am. I am gay. That is exactly what I want. Two salons later, I finally found someone who understood and turned it from soccer mom to butch, like I wanted the first time.", "im going to be honest and give my perspective. im not a stylist so im sure that doing stuff every day would normalize it, but if a woman with long hair, even a bob, asked me to shave their head i would probably ask a million times too just because i would be terrified of shaving it and then having them tell me it’s too short or they hate it or they changed their mind. you never know who’s been in that chair before you, you never know how many people have yelled at them for cutting their hair too short or because they decided they didn’t like what they asked for. so yes it’s annoying and might feel like it’s sexist, but really i think if a man with long hair asked me to shave it i’d ask if he was sure too because hair takes so long to grow, and i’ve instantly regretted cutting my hair short so many times and i don’t want to be responsible for that regret in someone else’s life.", "Salons do that to me and I'm almost 30.", "short hair doesn’t make you unfeminine", "Are you me?  I've been saying exactly this for decades.", "Work retail between Thanksgiving and Christmas 1 year.. It would change their whole world.. 😓\n\nAnswer for a Cable Company on Superbowl weekend. Good God what a mess that is. Especially when it's an independent answering service that doesn't have access to their computer network & has to rely on call backs from on-call service techs that just want to watch the game themselves. 😵‍💫\n\nYTA -I know it's annoying, but anyone in customer service in the modern era has PTSD and lives in literal fear of losing their job with any particular interaction. Try a touch of kindness instead of a dash of anger.", "90% likelihood that she wasn't \"imposing her views of femininity\" and was trying to make sure OP truly was ok with it. She probably got the impression from OP that they wouldn't actually approve of it. It happens constantly.\n\nIf a parent really doesn't care then they shouldn't go to the chair with them and should either stay in the waiting area or just drop them off.", "Very similar to my experience. Two different people absolutely refusing to do what I want, leaving it longer so it was more “feminine”. I finally got what I wanted with the third *after* I took a set of clippers to it in my friend’s basement  and was only at the last place to get the uneven back bit cleaned up. Like I know what I want and it isn’t a pixie cut it’s an undercut.", "Completely agree. I'll go back and put that in quotes just to make that more obvious.\n\nThe point is that hair stylists will be given instructions by the parent only for the parent to flip the fuck out at the end of the cut because they gave them what they asked for. If the stylist played that card it means they got the impression from OP they wouldn't approve or, because undercuts have gotten more popular, they had already been chewed out ten times that day by asshole parents and were trying to not make it eleven.", "Not a asshole. Best Mom ever🌞", "NTA you said they could have whatever haircut they want and showed   \npictures to confirm. The stylist pushed back with their personal sexist   \nopinions about a more feminist look. Absolutely ridiculous.", ">they tried to argue that it looked more feminine\n\nI was going for N--A--H but NTA for this comment alone, I know hairstylists often have trouble with parents complaining but talking about \"feminine\" hair styles sounds so wrong..", "> they tried to argue that it looked more feminine at the length it was at\n\nSo is it a gender conformity centre or a hair salon? The stylist was imposing their own neuroses on your daughters. Never go back there. \n\nNTA", "NTA because you walked in with girls who had unique styles, albeit grown out a bit, and photos of what they want. When asked if you approved of the style and cut you deferred back to your daughter’s preference and choice with support. I can understand a little more concern with the younger daughter but the stylist thinking a 17 year old is not going to be specific about what she wants and what she’s willing to look like at school, around other teens is ridiculous. The stylist clearly needed that push to just do her job. \n\nI say this as someone who went to get my hair cut from waist length to chin length. I planned to donate it. I asked the stylist to cut it like the picture I had (of myself) and she took about 6 inches off before brushing the hair off and removing the cape. I asked her why she didn’t finish and she said because that was enough. I paid my bill and asked the stylist standing next to her if I could book an appointment. Surprised she asked when and I said “first available booking. Confused she asked what I meant so I asked what she was doing right then. She said nothing so I asked her to put me in the computer for a haircut. She moved slowly and did as I asked. Walked me to her chair and asked how she could help me. I showed her the same picture and asked for that chin length cut. She said ok and started cutting with hesitation. I told her it’s just hair so get rid of it. She did and when it was done it was an amazing cut. My hair is very fine but I have a LOT of it so the floor looked like a massacre. The other stylist was fuming but I paid for the second cut and tipped the stylist. She did an amazing job and it was a lot of work. The first stylist got mad and wanted a tip. I told her she’d have gotten a tip if she’d given me what I requested. \n\nYou were clear, concise, and direct. No need to worry. Your daughter probably felt embarrassed because the stylist was mumbling under her breath about you and your daughter heard it.", "Fuck no, NTA. It's insane how adults police childrens hair. My youngest boy, 7, has wanted long hair for so long! My husband and I finally convinced his mum, by saying we'll pay for all the childrens hair cuts in the future. At his last haircut, the hairdresser cut of 2 cm and charged us 25 kr (the equivalent af 4$), because it only took five minutes.\n\nI don't care if you are a boy, girl, man, woman, nonbinary, it's just hair! Let people do what they want with their hair", "YTA. Mega big time. Super raging huge.", "YTA\n\nThe stylist was covering their ass, because they've had parents come in before with:\n\n\"Cut the kids hair to what they want\"\n\n\"YOU DID WHAT TO MY KIDS HAIR\"\n\nJust nod and say fine, it cost you nothing.", "NAH As a member of the weird hair gang, I’ve faced the same thing. But if you’re in a chain salon, you have to understand they are used to clientele that is prone to complaining. The stylist was probably trying to cover their ass. \n\nLike I said though, it’s super annoying especially the assumption that having short hair is somehow not normal. I’d honestly recommend going local for haircuts like that if you can. The experience is much better and you’ll get more creative styles especially for short hair.", "The stylist was clearly playing it safe.. how were they know that was your mindset?\nI’d be pleased if the hairdresser asked me, I’d feel that they were taking the responsibility seriously and cautiously.\nI think you were rude by the sounds of it.\nBUT it’s nice that you let the girls be who they wanna be, that’s cool.", "Soft YTA, these poor stylists have parents who kick off at them for stuff like this so you can't blame her for keeping checking. It's definitely a cover her ass reflex i'd say", "Everyone saying NTA for you snapping at the poor stylist doing her job. \n“I understand their haircuts aren’t what you normally do or would even like to do, however I let them get whatever they want. So please, don’t ask me as it undermines them and it’s their choice. Cut their hair as they say, without consulting me. Thanks”. \nIf you did that, then did the outburst, that would be understandable.\nBut YTA here", "YTA\n\nDo you have any idea how much flak they must take with cuts and if its wrong, ESPECIALLY if its not something \"normal\".\n\nCost you nothing to be a bit more polite and all the stylist was doing was double checking.", "NTA. They just didn't want to do non-feminine haircuts on female-presenting people. Don't go back there.", "SO NTA!\n\nThat's that old boomer/silent generation bullshit ass mentality! Thinking kids & young adults don't know what they want! Deferring to you like your girls weren't even standing there! The stylist was rude! You were paying for it! Give your girls what they want, or run you  your money back!\n\nI bet she was one of those ppl who when they see a gorgeous young girl, being herself, doing her thing, is quick to call them \"fast\", \"hot\" \"wanna be grown\" and saying crap like \"she is wild! You need to control her before she start screwing and having babies in your house\"\n\nBut thank you for breaking generational curses! Just remember, that if that stylist has kids and they are in the nursing home, they are going to wonder why they kids don't visit them! Can't understand why they kids want little to nothing to do with them! Clueless ass hell. Mean while your girls are going to make sure their mom is ok", "Nta, I’m sure you don’t know why she may have did that. As a stylist in training, I once cut a teen’s hair the way he asked then his mom freaked out. I was told to always make sure the parent is really okay with it.", "Edit: NTA obviously. \n\nGiven a lot of the comments here, I'm begging women and femme-presenting people who want short haircuts to find a friendly local barber. It's cheaper and faster and they do what you actually want and well. I've been seeing my small town UK barber once a month for years. I pay for a 'gentleman's cut' as a woman and he sees no issue with that because that's the cut I want. \nI've had a spiky crew cut and now an undercut and my only problem now is that the top is long enough I probably need a hairdresser to properly shape it just once a year or so.", "NTA. I get it once or twice. I had super thick, long hair and wanted a short chop with an undercut. I get that they want to make sure you're not going to change your mind. \n\nAfter the second time, you checked, do what is asked.", "You were the A for the attitude. Not all mothers are like you and dont let their kids have the hair style then want, so to avoid problems the woman was making sure that you were consenting. Aldo i do think is cool you let your daughter express themselfs.", "Slight AH for snapping a bit but honestly sounds like that’s not a salon you have a report built with so they don’t know how you feel about your children having total reign over their hair. See some parents will say “I don’t care whatever they want” but then would be pissed if their daughter came out of the chair looking like Cindi Lauper with half a shaved head because to them that’s considered super outlandish for a girl and the hair stylist is then berated for not being able to read minds and know that’s how the parent feels or something. Now depending on how the stylist acted with your one kid commenting on what would be more feminine I can’t say if they were judgy with that comment or not since I wasn’t there, but that’s why my overall point matters. Find a place you like, with stylists you like and frequent them so they get to know you and your kids a bit. Knowing your clientele on a more personal level means that the stylist will already know your freedom of expression attitude on hair and will be able to ask for specified questions of your kids based on their hair track record and their general vibe. A good stylist will know more or less what you probably want done with what you currently have, and a great stylist will be able to spitball some ideas that seem at least in your wheelhouse (without being pushy and listening to your ultimate decision obviously). That and ensuring whatever you get done will last as long as possible by providing good care tips. So while this might not be the stylist for you in this instance, shop around a little and you’ll find the spot that can keep tabs on all the details of y’all’s hair care and expression needs", "NAH.", "Sounds like the hairdresser was just being accommodating and covering their ass if you didn’t approve… but your 14 yr old daughter calling you out for being rude? That should be a sign you took it too far with your response. \n\nI get being annoyed with being repeatedly asked a question, but no reason to be rude, or go so far as to make your own kid uncomfortable.", "NAH. \n\nThis one's a tough one. On the one and we have you, a parent that is understanding that thier children have thier own styles and wants and the stylist saying \"But this looks more feminine\" is kind of cheeky. \n\nHowever I can also imagine the following scenario happens alot. \n\n*Parent A takes child they're not used to taking to the hair dressers* \n\nStylist: Is this ok? \n\nParent: Yes, sure, s/he says they always get one like this. \n\n*One hour later, phone rings and Gollum is screaming at them over the phone, as the other parent says they weren't told what it entailed*.", "NTA. The feminine comment irked me.", "saying yes was quicker than that tirade YTA", "NTA.  This is exactly why I hate hairdressers if we can also tack the 'so, doing anything fun on the weekend' question into it.  I've been doing my hair for a very long time.  They're not fun, they're not clever, and I hate how long they take to do the basics.  Get out of my universe along with telephone sanitisers and HR people.", "NTA on principle but YTA in practice.\n\nStylists will generally ask parents for clearance simply due to the _absurd_ incidents that've happened at times.\n\ne.g Kid asks for X, they check you're OK with it and they proceed. Kid wants Y change before finishing, they check with you before proceeding.\n\nIt's all well and good you assuming things are fine, but they're there to provide a service and if there's anything that needs altering, you as the \"responsible adult\" will be checked with - because who'll be liable if you don't like it? __Them__.\n\nEvery place has a horror story where they've done as asked, only for a parent or awkward customer to say \"oh but I thought it would be like X and what you did is nothing like that!\" so they waste their time, give a refund and it's awful for everyone.\n\nYou only got asked what, twice? You need to chill and calm on the attitude - if you got asked half a dozen times, well there were half a dozen changes or alterations, so _yes_ you will be asked.\n\nPoor stylist is literally doing their job, as trained and the right way.", "YTA - You should be happy they have the respect for you as the parent to confirm. Furthermore, you yourself said when they asked if you were pleased with the first haircut you asked for changes.  So they were more than polite (in fact intuitive) by continuing to ask for your input.  Sounds like they went out of their way both as the parent and the paying customer, to be polite and consider your input, and as your daughter said you were rude.", "Neither of them were 18, so really . . . you still have to approve.\n\nYTA, but I also get it.", "NTA. I mean how many times do you have to tell them? Not like your daughters are 4 and 7. And I don't think you were remotely too harsh.", "NTA. If there are any adults in your or your kids lives who also have creative and less traditional haircuts they should ask them who they use for haircuts and if they can recommend them. They’re just covering themselves from backlash from angry parents but also your daughters shouldn’t feel like they’re being judged for what they want to do with their dead keratin. They’re at the perfect age for such a safe form of experimentation.", "YTA. You do realise the stylist will have experienced helicopter mums? And has learned to always make sure mum is ok or get shouted at?\n\nPoor stylist is probably caught in a situation where she is damn if she doesn’t ask, and damn if she does ask. And you just add to the stress of her job.", "Being in the service industry can sometimes be no-win. There are plenty of people who ask for things and then complain when they get it, saying “that’s not what I meant.” I would assume that the stylist is just trying to protect themself.", "The stylist was pushing an agenda. Thank you for standing up for your kids and AFAB people who don’t want “feminine” cuts in general. NTA", "Stylists have heard that before then, they have to deal with the nuclear explosion of mom or dad, too busy on their phone to pay attention,  going ballistic.    It's nothing to you.   It's their job and being fired to them.", "YTA. The stylist is responsible for making sure the parents approve of what minors have done to their hair. A stylist can literally lose their job if a parent complains that they did not approve how their kids' hair was cut. \n\nNext time, just tell them that your kids have complete autonomy & please don't keep asking for your approval.", "NTA:\n\nBut you could have said it nicer.", "idk, I think the \"it'll be more feminine\" comment takes away my sympathy for the stylist.", "> I suspect that the stylist just wants to make sure you don't complain at the end of the hair cut \n\nThe stylist arguing that a longer cut would look more feminine when they were already told what to do by both the child and adult is a reason to complain though. There is no indication that any of these people were aiming to look feminine, and it’s never okay to assume that’s what someone is hoping for if they haven’t directly expressed that to the stylist. \n\nIt sounds like teens and parents both clearly set the tone here, and the stylist was trying to push her own agenda. \n\nNTA", "I'd have to say it depends. If you have black hair, or have dyed your hair previously, platinum might be damaging to do in one setting and the upkeep could be super expensive. If you have extremely curly hair maybe a pixie cut won't look that good. Your hairstylist might have just been trying to avoid a disaster. I find it hard to believe an hairstylist would flat out refuse something unless you said you were going for a haircut and ask for a lengthy procedure instead. It's not about a woman not knowing what she wants, it's about a professional giving their professional opinion as it's their salons name that will be attached to whatever comes of your hair.", "ASD is why I’ve given up on salons. The arguing about various undercuts and shaved bits was fucking annoying (especially as non-binary) buuut having to sit in a chair for an indeterminate amount of time, in front of a mirror, making desperate small talk, with no ability to tap out halfway through, music blaring, lights at full glare… now I just buzz half of it myself and DGAF.", "Doesn't UNNECESSARILY RUDE  = AH?\n\n...least in my book it does", "> The stylist can’t do anything to your children without your permission. \n\nAbsolutely not true. Show me anywhere on earth where this is the law.", "I agree it was rude but I think the fact that it was framed as making the daughter look more feminine is something that it would be hard not to get annoyed by. \n\nIt’s always better to be as polite as possible but that’s exactly the sort of thing I can imagine finding really frustrating.", "I guarantee you that the kids wouldn’t have received the cuts they wanted if OP had stayed in the waiting room and not spoken up on their behalf. And I certainly hope your mother doesn’t argue with customers that the cut they asked for isn’t “feminine” enough.", "For every parent like you that has no issues with how the kids want their hair, there's another that would go ballistic at them if they cut it without asking you. They are just covering themselves, you don't have to go off at them, just say clearly it's their hair, I'm happy with whatever they want so you don't need to run it past me.", "Listen, soft YTA. I get the sentiment, but I managed salons for a large chunk of my career before changing careers. You are responsible for your minor, the stylist is not, and many parents get up the stylists ass, even after saying “whatever they want.” \n\nDon’t be rude, just agree. They are protecting themselves from the hundreds of other parents that throw tantrums. You’re expecting them to assume, don’t do that, You may be fine with whatever, but their experience with parents is wildly different, and they don’t know you. Just be nice when they ask, it’s not their fault that they have to build in protections so parents don’t lose their minds over small things, or taking ONE direction from the minor that the parent then freaks out about. They are asking your permission because these are YOUR children that they don’t want to be held liable for.\n\nJust be nice. Also, stop walking in to random hair stylists for specialized cuts. Find one you like and go to them consistently, then they won’t be as guarded and you’ll get better hair cuts.", "Dont bitch at me, bitch at the 10 other moms that were just here breathing down my neck because the 1/8th im trimming off her daughters hair is too much or her 7 month old infants fade doesnt look right cus his head is still lumpy", "Have you ever worked a customer facing job?\n\nMost of us have been screamed at about something out of our control (or something that a customer has directly asked for).\n\nIt's not great customer service for them to keep asking but that doesn't justtify your terrible attitude in return. I'm not sure it's YTA territory but it doesn't paint you in a good light. A little empathy and compassion go a long way.\n\nI appreciate that you leave the power of appearance in the hands of your teenagers though.", "But these are the sort of parents who would be threatening to sue and would post bad reviews online", "I would say the stylist was an A H though by not listening to the family", "I (F26 for context) have shaved my head a couple times now. EVERY TIME I go for a haircut cuz they shave it better and smoother than I do I get the same two questions:\n1-do you have a boyfriend \n2-what does he think about your hair?\n\nThe looks I get when they find out he helps me shave it", "I just think the stylist 1. Can't listen and 2. Didn't approve if the types of haircuts the daughters wanted. She pretty much said so", "Not to mention that both girls are minors", "I would be with you, but for the part where it seems the stylist argues that the haircut isn't feminine? This seems to me like the issue isn't with liability; just personal preference.", ">they tried to argue that it looked more feminine at the length it was at\n\nI would definitely call this the line where the service worker was being an asshole and no longer deserve the benefit of the doubt.", "It actually costs real money. Because continued asking like that *will* wear some customers down so they'll accept a haircut they never wanted (see: several comments here) and will just end up paying for another haircut at a different salon.\n\nAt some point the stylist just becomes a bully. The revelatory line was her comment that it isn't feminine. She's policing how op's daughters express themselves, by attempting to feminise them beyond what they want.", "It does, because you then have to pay to go get another haircut somewhere else.", "I wouldn’t say the hairdresser didn’t do anything wrong, especially when she stated the hair cut “ wasn’t feminine”", "I always had the opposite problem! I have very thick hair and it gets really frizzy no matter what I do, and cutting layers into it just makes it even bigger. \n\nI'm lucky I ran into a hairdresser that listens. Even still I sometimes just have her do the \"base\" of my hair and finish it off myself to get it exactly how I want.", "This is why I think OP should find a locally owned salon that is a bit more funky and alternative instead of going to a chain where these types of styles are uncommon.", "Yes. It wasn’t “do I have your permission?”  It was “are you seriously going to let her do this?!?!?!?!?”", "Oh yeah, this.\nDuring my teenage years I tried for years to find someone in my smallish town to cut my hair shorter than chin-length and they all refused with comments like \"such a pretty face\" and \"well now that would be a bit short, wouldn't it\" and \"oh, we better keep these ears covered, they are rather large\". \n\nSpend a lot of time looking like a picture of Jesus. \n\nTook me until college to find a queer-ass hair saloon where the guy just laughed when I told him and gave me a beautiful cut which revealed ALL OF MY BIG EARS. (They ARE big, don't care, they are mine and I like them.)", "This is a plausible idea on one level, but this comment thread is full of people recounting how they got the same treatment when they were the literal adult asking for a \"non-feminine\" haircut.", "i mean yes but they didnt ask these questions to the client aka the daughters, but instead asked the parent who already stated theyre fine with whatever. wouldnt they want to make sure the kid is happy then and not the mum. especially the 17 year old would be considered old enough to decide their own hairstyle and nobody would have went and called her mum if OP had not happened to be there too.", "Yeah, I had a stylist do that and I looked at it a little more and realized I actually liked it more and felt prettier with it like that as opposed to having it the way I thought I wanted it.", "Ergh. For the longest time I've had hairdressers try to cut mine too short. I have long hair (not crazy long - mid back at the mo, but it has been longer) it is nice condition. I've had hairdressers try to convince me that cutting off six inches will help it grow faster (no, it will not) or have a vastly different view of what a 1-2 inch trim is than say the actual measurement of 2 inches. \n\nIt isn't as bad now, mostly because longer hair seems more in vogue, but it is annoying. If I ask for x, that is what I want. Not what you think I should have. I know what I can maintain day-to-day. I know how quickly my hair grows.", "Yeah I've had an undercut for a few years and once I went to a barber/salon and wanted my hair done on the barber side of the shop as it was a barbering job, I got shoved over to the salon side the MALE stylist barely did my hair, didn't even use clippers and I had to pay more for the privilege", "exactly. this mom is the best mom and this stylist is the exact kind of nightmare i hate. ugh.", "It doesn't really. It reveals society's general attitude towards girls having short hair and doesn't necessarily reflect the stylist's personal views.", ">it’s technically my hair/head, it’s their brand\n\nMy head is not their brand. I do not consent to it. If they want to cut their brand into my hair, they need to pay me, and that only with consent.\n\nAlso, there's a big difference between opinions, and not listening to the client. I pay for the service, I expect them to cut me however I want, period. They can recommend all they want, if I say no, that should be the end of it.", "Post-chemo - I was at the barber's every 3-4 weeks. It was cheaper and they did what I wanted and there was none of the pushback. And I rocked the more typical men's cuts.\n\nFWIW", "This is why I always got my buzz cut at a barber shop.", "I always wondered if going to a barber instead of a salon would be the way to go for no questions.", "When I was 20 my best friend handed me the machine and told me to do it for her🤣 was kind of a surprise for me, I asked her if she was shure bc I never done it before. She told me I was always very thorough and precise in the things I do so she trusted me. The (very) short hair looked awesome on her.", "Same! I'm your age and the one time I went to a hair salon in the last 10 years they gave me a hair style and color I really didn't like. So I went back to cutting and dying my hair myself.", "Seconding the barber. I never have these issues.", "Totally agree.  Have said similar for decades as well.\nOr to put it another way, I came here to say that ^", "It took me so long to find someone to listen to me. I had gone to the same woman my entire life, and when i was 16, I came out as trans (ftM) and wanted my hair cut ASAP. \n\nMy mom was okay with it, but that woman was all but flat out crying over my hair. I found it absolutely wild that she was mourning what I was ECSTATIC to be rid of. \n\nMy hair had been super long, and I couldn't even donate it because of the way she just took a little every time, tried to fight me, and then continued 🙃 \n\n(Also while Im complaining, I got her to dye my hair one time and wanted blue, and she tried to mix red and purple to \"make blue\" because she didn't have any during my appointment, and then just put brown back in my hair.)", "I ended up going to a barber before I found my hairdresser (which was recommended by a fellow pixie). Least they used clippers", "I should've done the same haha, it's also cheaper!", "Last (and only) time I coloured my hair, it went canary yellow. The hairdresser told me it’ll fade and go lighter in a couple of days. It did not. I was already blonde and I asked for lighter blonde. It looked awful for months until it had grown out.", "Those comments about what's feminine or not irk me to no end. I, a woman, have a buzz cut. No issues getting it as I do it myself (I had the clippers already since I had a side cut). My mum keeps trying to convince me I look like a boy. Thing is, I look super feminine and I actually think the buzzcut enhances it, since I'm very pale with very dark hair. Finally my features can be seen, my freckles and eye colour are now obvious. Also I wear A cut dresses with a bow on the back and cats on them. Yes, I also wear sports clothes at times, but I don't look any less feminine for my lack of hair. Similarly, if someone wants to look super butch with long hair, they'll manage it. Just let people have the hair they want without fictional ideas of what is or isn't feminine.\n\nRant over.", "Is an undercut not long on top with a short piece or pieces at the back/sides?\n\nThat's what I had when I was a teen. You shave a bit under the longer hair. Thus, \"undercut\"", "She... what?\n\nRed and purple make blue if you're using light.  Otherwise you get a redder purple, which she should have learned when she went to colouring school. \n\nHow?\n\nDid she never actually dye hair?", "I wanted shorter hair, maybe a nice bob, and black hair with red bangs. They gave me a really weird looking half long haircut and black hair with... green and blue spots in it, because \"it'll look better\". I looked like a nightmare cow for 2 months.", "Oh yeah, one of the butchiest butches I know has really long hair. It most emphatically does not make her less butch. Meanwhile, when I try to grow my hair out I start looking like some hipster Jesus, no matter what I wear. Best I can hope for is hipster Jesus in drag. My short cut meanwhile gives me all the opportunities :-)", "Yes. An undercut usually uses clippers on the sides/back to make a starker difference between the hair on top and the sides. Pixie cuts use scissors to shape the hair shorter on the sides but still blended into the top. It’s a softer and more “feminine” style and was *not* what I wanted.", "🤷🏻‍♂️  By the time she was done, it didn't look like she had done anything. Only when the sunlight hit the ends just right could you see it was purplish-red-brown instead of just brown. \n\nAlso, this was after i showed up for the appointment the first time, and she was closed, so I rescheduled... She worked in a very small town and I wouldn't be surprised if she wasn't actually certified or whatever.", "NTA as a former stylist I'll say the hairstylist was VERY out of line with her \"more feminine\" comment. That's shockingly unprofessional and she should have just shut up and done her job after the first time you approved the cut. You should honestly change stylists. I do not think you would be out of line to file a formal complaint. She should know better. Unless asked for her opinion directly she should have kept that to herself and frankly this has homophobic undertones. I don't know how your daughters identify but the stylist clearly is the type to think girls should look like girls and boys should look like boys which is pretty outdated and gross.", "NTA (you could’ve been a bit less rough but I get it tbh)\n\nI’m a trans guy, I haven’t passed at all like I did as a middle schooler, and even though I’m 20, since I can’t see without glasses or make small talk (autistic), so I bring my mom. I cannot tell you the number of hairdressers that purposefully try and make my hair as feminine as possible, despite me actively saying I don’t want it, even when my mom advocates *for* me. The excuse some have used is that “mom looked uncomfortable, so I tried to do something she liked” when it’s literally my very own 20 year old head!!\n\nOne thing extremely common is asking for the back of my hairline to be shaved straight across, but they **decide on their own** to cut it into a V, or try and leave my bangs significantly longer than I ask. It goes far beyond CYA protocol every single time. They literally just do what they think is “prettiest.” \n\nIf it were up to my mom, I’d have my hair down to the floor again, and she finds it extremely difficult to visibly pretend she doesn’t. They always default to asking my mom, even before I say I only brought her since I can’t see the cut until it’s finished. Showing pictures, explaining shaves and cuts other stylists have done, using my hands to describe lengths and how it goes against my head, nope, has to go through mom first. I know I look young but this is usually well past the point of me saying I graduated a while ago, and talk about my friends being in uni or work, so it’s not like they’re still sitting there thinking I’m a child. \n\nAnd because of our situation she internally gets *really * upset that they ask her own personal opinion *every single little cut*, but I can’t even imagine how grating and annoying it must be to genuinely not care, but then still have them ask over and over and over again (for two whole kids!) about the *femininity of your children’s hair*, yeesh. \n\nYeah, you embarrassed them a little, but it happens; you’re doing a good job— kids have nice, professional cuts, while also it being in a style they like. You’re letting them experiment the proper way, not with office scissors and koolaid packets most other kids do. Wish more parents could be like you. Maybe make a plan for what to do/say in the future, in case this happens again though lol", "NTA but the stylist is", "NTA.\n\nMy daughter is only 6, so I more just relay what she wants to the stylist than telling the stylist what to do while \"going over my daughter's head,\" so to speak, as we've usually talked about it before we left the house (and more than once!). When she gets to be a teenager (or even just not as shy about talking to adult professionals she doesn't know), if I'm there at the same time and the stylist keeps asking me, I'll be saying, \"She's your client, not me; I'm just here for the bill,\" before I go sit down in the waiting area.", "NTA - 1) it’s not your hair, it’s the kids hair and 2) you already said you didn’t care. Not like they need your permission to get their hair cut the way they want, anyway. 3) did she actually try to pull some sexism bs with your youngest? Yikes.", "NTA I wish you were my parent!", "YTA. Relax. Anyone reading AITA has heard of parents going apeshit about kids’ haircuts.", "Ma’am, this is a Great Clips. \n\nYTA because you could have handled it better and been nicer to the stylist at a chain salon who probably gets screamed at by half the parents who come in.", "YTA, yes I'm pretty sure checking with a parent that they're allowed a more extreme haircut is pretty standard procedure when doing a child's hair. \n\nAnd her comments about feminine styles are an opinion that you're free to ignore, she's being honest that this cut isn't what most people would want or like, so wants to confirm that that's what you really want.\n\nI suggest getting over yourself", "YTA - she was trying to be decent and make sure these unusual cuts were still ok with you so you belittle her in public in front of your kids. Your daughter was right - you are rude and even worse you don’t even realize when you are being the asshole. What a horrible example you set for your kids, maybe next time show some patience for your fellow human being so your children will know that how you treat those providing you with a service is just as important as the president of the bank you utilize.", "YTA. This stylist has been yelled at plenty of times by parents. Even by parents who said \"Whatever my daughter wants\" and were then appalled - appalled I tell you! - that the stylist would actually give their daughter such an ugly, un-feminine hairstyle.", "YTA. You probably dot understand how may times the stylist has done exactly what they were told.. and people still complained and bitched at them at the end. Get your head out of your ass.", "Don’t hate on the hairdresser. They probably get mums saying whatever and complaining.\n\n&#x200B;\n\nbe polite! They both kids so the hairdresser will look to you to double check", "Y T A Just smile and nod", "Yes!!! Giant AH.\n\nBoth kids are under 18 so she has to look to you to get the necessary permissions to cut the girls' hair, otherwise she leaves herself open to legal action against her.\n\nShe asked you once if a particular style was okay, you said yes. Then the kid asked for changes, so the narrative changed. She had to ask for further permission. \n\nPlus, hairdessers normally know best if something will suit you or not. The hairdresser just wanted to help and you, like a complete loon shout at her like a moron.\n\nI would not welcome you back into my salon again, no money is worth being treated like that. You have some nerve asking if you are the AH.", "YTA They get paid crap at those chains and deal with a bunch of jerky customers. The stylist is constantly faced with kids who want one thing and parents who won’t allow it.  She was trying to keep both you and your daughters happy.  That’s her job and also how she gets her tips which she can’t survive without.  Put your self in the other person’s shoes before being rude.  We all need to be more patient and kind with each other.", "Wow.  Yeah, YTA.\n\nThe stylist has to ask.  She's probably been yelled at before by parents who do care.  \n\nI also do not care what my child does with his hair.  It's his hair, not mine.  I'm still polite.  \n\nHow hard is it to be polite?", "YTA. Put yourself in the stylist’s shoes. She’s probably had countless moms berate her and scream at her for giving the style their daughter wanted without consulting them. She’s covering her own ass and I don’t blame her with how terrible people treat each other these days. You could have gotten your point across without the attitude.", "YTA for the attitude they still minors and the hairstylists just doing their job. It’s an unconventional style most parents aren’t ok with.", "YTA here. \n\nYou let your kids express themselves and have no issues with what they do with their hair. That's great. \n\nBut, you are not everyone, and some people tend to freak out and blame service workers. The stylist was really just looking to avoid an angrey parent, as I can pretty much bet they have had one before. \n\nYour kids being minors means that if you don't approve what the sylist does, they could face some consequences.", "YTA. Cutting a minors hair is different than an adults. The stylists job could be on the line for going against her own judgment and that of the parents. She was hesitant because she has bills and needs a job.", "YTA.", "I think a lot of people like to assume a lot of things about stylists without really understanding what goes into the job. You don’t know what kind of clients she’s had before you. I actually am a hairstylist and I have had multiple moms tell me to do whatever the kid wants and then end up upset at the end because it’s not what the kid and parent talked about prior . So now I don’t take risks like that because I’m not trying to get screamed at or end up with bad reviews online. As far as suggesting not to go shorter because it looks more feminine: it’s her job to give you suggestions based off of what she thinks looks good. You all confirmed you didn’t care about that and she did what you asked and went shorter. At the end of the day, they are still minors and you were rude to another adult over something so small. If you don’t care and don’t want to be asked then send them by themselves next time. \nYTA", "I’m going to say NAH and the reason is because I get why you were annoyed and I also get why she kept asking you.\n\nI’m a hair stylist and if someone is young enough for a parent to accompany them into the salon, they 99% of the time are there to monitor the haircut and make sure their kid isn’t asking for anything too radical. If this hairstylist had no prior background with you and your girls, she probably was really nervous to do something too drastic. In a chain salon, no one sticks up for a stylist when a parent complains, they just lose the ticket and make $0 usually.\n\nAlso, a few inches off of any haircut basically makes it a different haircut and the amount of times people don’t understand that is pretty insane. I’m from the south and people DO NOT like having a pixie that makes them look like a guy from behind, that’s just really common for the stylist to explain how the change would affect the look.\n\nNext time, give them the money and wait outside or just drop them off. Or better yet, find a stylist for them and stick with them. That way, she/he builds rapport with you and knows what to expect.", "NAH here.  Stylist is likely traumatized from getting abused by parents in similar situations.  You're not wrong but also understand the stylist was just covering herself", "NTA", "NTA.\n\n\"Lady? If she (either daughter) ends up not liking it it's a lesson learned. Please do what we're paying you for - cutting/styling hair.\"", "Now... If you missed this \" they tried to argue that it looked more feminine at the length it was at\" I would say, okay, yes you're the AH for the attitude, reason being in they are a hair stylist and I guarantee that if a parent didn't tell this stylist exactly what hair style/cut their child would have or if the stylist didn't keep checking in, they would be covering themselves over complaints/abuse from shitty parents.   \nHowever, \"they tried to argue that it looked more feminine at the length it was at\" THIS. Tells you that this stylist was not open to your daughters with those kinds of cuts/styles. It's natural for a hairstylist to make suggestions to the customer but it is not their job to make those kinds of unprofessional comments and then continue to ask \"If it's okay?\" in this situation. Besides, your daughters 14 and 17, they're not immature, they know how they want to look, the hairstylist should be asking THEM, not you, not other customers, of what they think.   \nOverall I'd say NTA. But just be mindful in other scenarios, hairstylists would ask you, just out of sheer caution not to upset you/cover themselves from complaints.", "NTA. Asking once or maybe twice is to cover oneself from complaints is fine, but asking constantly PLUS the comment about your daughter's hair being more feminine is not ok. Actually, based on the feminine comment and the fact that the girls already had a buzzcut etc, the stylist sounds highly judgemental to me. \nHair stylists like that are the reason I haven't been to a salon in years - either highly judgemental or refused to do what I wanted. My husband cuts my hair and I cut his.", "NTA. Bless you, you wonderful person.", "NAH, but my mom’s a stylist, and - I don’t think you realize the sheer number of irrational moms out there who completely lose their shit when something’s even a little off with their girl’s hair, at least in their minds.\n\nYour attitude is super atypical for a parent who brings their kids in. Long hair, short hair, doesn’t matter - even if the mom says “do whatever” there’s plenty who will flip on a dime and start screaming when the stylist does something that they don’t personally like.\n\nJust know that they put up with ALOT and can be super cautious for a reason.", "NTA \n\nI’m so fucking sick of these kind of comments from stylists. It’s all from the same vein, “how is “x” (usually a male relative) gonna feel about that?” Idgaf, it’s my god damn autonomy. “Oh my husband would divorce me if I did that!”  That really fucking sucks for you, I’d never be in a relationship with such a childish person because that’s abusive and toxic af!", "Nta... I've had similar experiences with my own hair where the lady has said one thing, I have repeatedly asked for another only to be told no again. I was so frustrated I told the lady \"if you can't cut my hair the way I want it, I can go find someone who will\" she finally cut my hair the way I wanted it. Just cut the hair. Omg. Not a difficult thing.", "They have probably had parents refuse to pay. It’s annoying but they are balancing that you are paying and unfortunately many parents aren’t so supportive.", "NAH I'd say it was okay for the stylist to ask, could have been more polite about saying not to ask. should have just said what you said at the beginning of the post, it's her hair and it will grow back. then maybe added, \"you don't need to ask me.\"", "NTA and I don't get this attitude of so many hair stylists. I hate going for that reason that I always have to argue whether I *really* want what I want, be it colour, length or style... \nand then sometimes they still do something different that *they* think fits/is appropriate... Most of the time I just do it myself or ask a friend to cut my hair.", "NTA, but the stylist didn't want to do something to get her not being paid.", "NAH\n\nThey've probably dealt with other parents who were far more controlling and likely to blow up.\n\nThat being said, if your daughter found you rude, that leaves me questions about how exactly you said it.", "YTA There’s no need to be so rude! It’s great to allow your girls to be in charge of their own hair but it costs nothing to be nice to the stylist. How would you like it if someone snapped at you in that way?", "NTA really, but you could've just said _Really, do whatever,_ __my__ _permission is not necessary._", "NTA. Wish my parents had respected my autonomy when I was a teenager like you do for yours 👏👏👏", "NAH.\n\nThe stylist was just doing her job. You're the one paying, and it's easier to cut more hair off than to glue it back on, so I think it's fair of her to check in with you. She doesnt know your relationship with your daughters or how you let them do what they want with her hair. You might have been a bit snippy in the interaction (no pun intended), so try to remember that this worker is just doing her job and trying to make sure you don't give her an earful about how she \"ruined your good Christian daughter's beautiful hair\" or something like that.", "Kudos to you for allowing your children to express themselves how they see fit. Most salons have policies and procedures when it comes to children services. There have been too many cases when children ask for things parents aren’t ok with.  NTA for protecting your girls and their decisions, especially after that feminine comment.", "NTA, sure maybe you where rude but there’s only so many times you can repeat yourself before you have to be \n\n(Also I WISH my dad was like you growing up lmao)", "My hair is long and I want it longer and my hair stylist will at least once a year tell me that it needs to be shorter.  I’m like my goal is to have long hair and if I didn’t need to dye it I wouldn’t even be here.", "NTA in my opinion, but i think this came from the stylists trauma, not all moms are as easy going and caring as you and some of them do actually make a big deal after telling the stylist do whatever u want and demand a refund and want to 'sue' them because they're minors and they didnt ask the mom for approval, i think the stylist was only doing her job trying to actually not fall in the trap that a lot of people set. however u don't have to explain urself too much but u should understand that not everyone is as chill as u when it comes to their daughters hair.", "NAH\nThe stylist was protecting herself against what has likely happened in the past. Read some other posts on this forum. You’ll see several parents have an attachment to their kids hair. You’re the unicorn. \n\nMaybe more communication would have helped your situation, communication from both sides.", "NTA. Don’t go to chain salons. Find a stylist who is good at those styles and keep going there. You’ll build a better relationship and the the stylist will be able to learn your dad’s hair types and preferences.", "\"I yelled at a low wage service worker because they have to protect their livelihood by checking in with shitty parents who walk away without paying for their services because it was not what they agreed to do and they're the ones paying.\"\n\nFixed it for you. YTA", "YTA. While your daughters are the client, you’re also the person paying. It is not unreasonable to confirm with the person who is paying. \n\nAlso stylists get lots of people who ask for one thing and then complain. Some of the biggest complainers are people who bring in reference photos because they expect to look just like the people in the photos. The truth is people don’t judge a stylist based on whether or not they “do whatever they\nask”, they judge them on if they like how it looks in the end. \n\n“Oh no the stylist asked me a question and I had to put down Candy Crush for 20 seconds the horror”. If they want to double or triple check before making a change being as it’s their livelihood and their goal to make people leave happy then let them. What an unnecessary overreaction.", "Or you could have said the first time they asked ‘thank you for asking but my girls are totally free to get whatever hairstyle they like, please ask them. You don’t need to get my approval’. \nSurely you must understand that, unlike yourself, many many parents would at least have input into their 14 yr old daughters hair? I was fairly strict with my daughters hair at that age because I signed forms upon enrolling her in high school that said I agreed with and would uphold the school rules regarding uniform, and part of that said they hair could not be any colour other than ‘natural’. So as much as she moaned about not being able to have green hair, I had to make sure she didn’t actually get a crazy colour during school semester. \nEqually they would have experienced doing a teenagers hair, only to have an angry parent storm into the shop demanding a refund and berating them about what they did to their kids hair.\nIf your daughter said you were rude then I believe you were rude, which in this instance was completely unnecessary and just made for a terrible experience for the hairdresser involved.\nIt costs nothing to be kind.", "Many parents have a tendency to micromanage their kids' hair.\n\nSo congratulations for not being one of them but do try and see it from the POV of the stylist who probably gets complaints if it isn't what the parent wants.  Soft YTA", "NTA. \"They tried to argue that it looked more feminine at the length it was at.\" Oh hell no. I would not be giving them my money. It's good of you to tell them to not ask you, ask them! It's their hair! Maybe next mama can wait in the car", "The stylist has likely been in a similar situation where a teenager asked for a haircut, didn't like it, instantly regretted it and got a bollocking off the parent.\n\nI don't blame her for being cautious.", "YTA - Dont be rude to the stylist.  Once it's cut it's done,  stylist was just double checking as they are minors.  Sorry you were so inconvenienced to be asked a handful of times.  SMH … to busy and entitled to a answer a few questions.  EDiT - Typo", "YTA. You are paying. The stylist is making sure that they don't get told, \"this is awful! I'm not paying for this\". You would not do that, but for sure others would/have. Have some patience.", "they already asked the fucking question twice, and the oldest is 17. they do not need ops permission to do anything with their hair anyway.", "NTA. i think the comment abt femininity from the stylist is all we need to really know to understand it was her own preferences preventing her from being comfortable listening to the kids", "This is one of the times “the customer is always right” is actually true. \n\nThe entire phrase is “the customer is always right, in matters of taste.” So if a customer wants something that you absolutely hate, they’re right and you should sell them that thing. (It does NOT mean they get a discount just because they said so.)\n\nIf a customer wants an undercut with neon yellow hair and purple stripes, that’s what they should get. It doesn’t matter if the hair stylist doesn’t personally like it, it’s not their hair!", "By “people” did u mean men?", "Ah, yes. I can sense the southern in this post. Born and raised and it’s still *so* weird when people treat my dad like the head of household. Lol. He’s around for the ride, not taking the wheel.", "Chain salons have records of the cuts they've given (at least the one I go to does), no matter which stylist was behind the chair at the time. There is no excuse for not anticipating what is wanted and actually listening to the person in the chair when they tell you they want exactly the same thing as they wanted during the last twenty or more visits.", "Or she knew from experience that some parents thinks the haircut will be a short feminine style and get upset when it isn't.", "This is what I thought, too. I have a friend who's a stylist and she's had the same complaint as your MIL.\n\nAlso, a good stylist will talk to you about your style, especially a more drastic or style-heavy one, to make sure you 100% understand what you are really asking for. I imagine the 17 year old had a cute anime picture for a hairstyle, but she might not have understood how a drawing of a haircut translated to real hair. What if the character has a different hair texture and density than the human asking for the haircut? What if the haircut was simply unrealistic? \n\n I get why people bristled at the feminine comment about the 14 yo, but again, I give the stylist the benefit of the doubt and think she wanted to make sure the 14 yo understood what she was committing to and how the shorter length would alter her appearance. Some people dislike looking less feminine, some don't care, and some do want to look less feminine. The stylist doesn't know this client that well and wanted to cover her bases. \n\nFinally, when a stylist cuts your hair and sends you out into the world, you become a representative of that stylist or salon. Sometimes the cut you think will look good on you doesn't, and unfortunately, people will throw a stylist under the bus instead of honestly saying, \"This is actually what I asked for. The stylist did a great job; I just picked the wrong style for me.\"", "This right here. I’m blown away by all the NTAs. Naw, she’s the AH for sure. There is no reason to be rude to anyone in any service industry for trying to make all of them happy. Reddit is so weird sometimes. There is no way these people live irl like they say on here.", "I feel like they were just clarifying that the haircut wouldn't look feminine because once it's cut it can't  be undone, I've gotten haircuts in the past where i was sure it was what i wanted and afterwards it wasn't.\nNot to mention a lot of parents say they don't mind and then refuse to pay afterwards because the cut is bad", "I'm kind of viewing this in a different way.\nHer line about how the 14 year old's hairstyle would be more feminine if she cut it at different way just sat wrong with me.\n\nHair stylist tend to be some of the most egotistical people and I've witnessed countless amount of times that my friends are basically forced into haircuts they don't want just to appease their hair stylists who are throwing a baby tantrum.\n\nChances are, she was just trying to cover her ass, but to me it just seems like she didn't agree with these girls having hair like this", "Normally I would kinda agree that the stylist was just covering her ass. But her comment about it being \"more feminine\" when it's longer made it clear that she was just beinf judgmental over the daughters' choices. She was being the opposite of considerate. I would not be telling this stylist that I appreciated her, I would never be telling this stylist anything ever again, because I'd be going to a different salon.", "She gave it already", "This response makes no sense. The OP states that the kids clearly told the stylist what they wanted and that one even had photos of exactly what they were looking for.", " I have no experience in such things but it sounds like they were in the wrong salon. They were asking for a style the salon wasn't comfortable with.", ">the stylist objected and said it would be more feminine if it wasn’t shorter.\n\nAnd if the cut is less feminine than a dumb-ass parent realizes it would be, that parent could also use it as a reason to blow up.", "From the title I thought *you* were getting the haircut.  I could relate. Just cut it, let me nap.", "The stylist was likely following the salon rules- most places I have been to make sure to ask consent of a parent or guardian before any drastic changes which it sounds like your girl’s haircuts would qualify as since they involve buzz and undercuts and being very short. They will also ask adult clients several times if they are sure before doing a drastic change because it’s easy to be shocked when you see it in the mirror for the first time. There is an art to cutting short hair well, the salon needs to cover itself so that if the customer isn’t happy then they did already ask permission. \n\nUnless this was a regular salon for your family, which it doesn’t sound like it is, then the stylist doesn’t know that your daughters enjoy short and dramatic hairstyles or that you are comfortable with them doing as they wish with their hair. Since your daughters enjoy having very different hair then I’d suggest their finding a stylist they like and sticking with them so the stylist will know exactly what they like and how to do it plus can suggest other short or dramatic looks which they might really love. In my experience stylists love when a client is open to very different and dramatic looks, it allows them to be creative and do something fun, I’d chalk this up to the stylist not knowing your family rather than being annoying.", "NTA but the stylist may have had some bad experiences with other parents in the past where they repeatedly told them to do what the child wanted only to flip out at the end. But I do see why it would be annoying after several times of saying this.", "You think people haven't been pricks to the hair dresser for illogical reasons before? They just want to cover their bases", "Honestly I’m 100% sure people have complained unreasonably at some point and used the excuse “but they are under 18, they can’t decide” as a reason not to pay at some salon! Even when it seems absurd, that can happen. Do you know these stylists? They might feel a legitimate need to double check with you. You could avoid in future by maybe making a clear statement upfront that your daughters pick their hairstyle and you’re fine with whatever they do (but kindly to the stylist and not impatient).\n\nThe feminine comment rubs me the wrong way *but* I can also see that coming from some past issues with a customer in theory so it depends. It’s hard to say with minors because I could 100% see some one going off on a stylist because obviously they didn’t want their daughter to have that hair style and they should know not to make it less feminine or whatever, even if the kid has almost the same hair already frankly.", "I get that it is annoying….but maybe the stylist has cut the hair how the teenager asked before and got crap from the parents. It honestly sounds like she was just protecting herself. Next time just take a moment and explain a bit more why you are okey with what your kids want. It costs nothing to be kind.", "The hair stylist was being extra cautious probably because parents get mad at them. So you got mad at her about it lol", "But for every parent who is like you (and me for that matter, I’ve never understood being controlling about a kid’s hair) there are probably 4-5 who would lose it on the stylist for not doing it their way. \n\nA little empathy for those working in service jobs please.", "After I graduated high school I chopped my hair off. It was mid back to shoulders and my mom cried but she didn’t say boo to me, because it’s my hair ..", "Lots of people will say stuff like this but then act all surprised at the end to try to get out of paying. I’d be willing to be she’s had a more than a few experiences like this. NAH", "You’re pretty cool. NTA", "Put yourself in the stylist's position, though...\n\nIf she doesn't ask, and then the parent has an issue, it can't be sorted after the fact, and would likely cause a scene, and be a big problem. \n\nEasier just to ask, even if it has to be multiple times.", "Not a asshole. Best Mom ever", "Or alternatively, the kind of parent who might blow up might not have realized what the haircut they were approving would look like, and it not being feminine would be a reason in that kind of parent's eyes to get mad.", "yeah, but that's easy for us to say when we're not the one the parent is blowing up at or refusing to pay.", "I know of a few places that won't cut under 16 hair without a parent or adult there. It's mainly for child protection but it also is a CYA policy over hair style as it means the parent is there the whole time - so it's not a surprise.", "I can imagine that scenario as well as the parent not paying attention and becoming furious over the hair cut.", "Nah, stylist is just a sexist prick. Listen to your customers and stop projecting your world views on them.", "NTA\n\nWhat I can't figure out is, why do people who *don't* get the most vanilla ass haircuts keep going into those places?\n\nI would never go back lol", "You were so freaking rude. There was no need for it, they were being cautious and considerate, and you stomped all over their good intentions.", "I was a teenager and I said I don't like blunt ends so could she make the ends come to more of a V shape. Literally had one side about 2 inches longer than the other because she didn't understand, I guess. I went home and immediately fixed it myself. Same place was curling my hair for graduation. The lady doing it left halfway through  and the next lady used completely different products and methods. I haven't paid for someone to touch my hair since. My motto is \"I can fuck it up at home for free\"", "This is why having a 15-30 min consult before your service is so helpful. I’ve figured out over the years that it is SO easy to miscommunicate with your stylist. Having a back and forth about expectations and realistic results helps you feel more apart of the process for sure.", "Ooh are you me. Exactly my issue, from the straight/blunt bangs to layers anywhere. Blunt cut bangs are the only ones that suit, I need the weight for them to sit right, while layers in general make my (already thin) hair flat and gross. Last time I explicitly said what I wanted, showed previous pics from just after a cut, and confirmed all was clear. Dude then picked up the scissors and before I could even comprehend what was happening he’s randomly hacking into one side of my bangs “just thinning them out!”.  I was absolutely furious and looked patchy and bald for weeks.", "Not a hair stylist, but I've worked with kids aged 03 to ~65, and their parents. \n\nWhen someone, especially a kid wants to do something questionable, double-check.\n\nEven after a double-check, if they don't know me well, and they don't like the outcome they will complain. \n\nThe stylist has probably had a lot of kids, teenagers, or parents say they are okay with a cut, double-check, and then complain the cut isn't *adjective* enough. \n\nIn this case, OP and the kid are okay with it. Others say they are, and maybe they mean it when they said it. But when their hair isn't how they pictured it. They can complain, refuse to pay, to tip, etc. \n\nStylist was covering their ass. NAH", "Then why did the stylist feel the need to point out that \"longer looks more feminine\"?", "No I have had stylist I’ve gone with my sister to and they just straight up don’t think women should have short hair", "they had already asked and been answered twice by that point.", "\n\n>Even your kid who you were sort of backing up thought you were being rude\n\n14 year olds think you're rude if you tell the sever they brought you the wrong meal at a restaurant. the jokes about Gen z being fearless when they stand up to government but lacking a backbone to defend themselves in situations like this  didn't come from nowhere, so her thinking op was rude is really rather irrelevant. Gen z is the embodiment of the John mulaney joke about someone spilling soup on them and them apologizing to the person who spilled the soup", "Yup! I could tell from the way OP described how the stylist kept asking and checking meant the stylist has had to deal with some crazy customers being too critical and contradictory. Stylist wanted to cover their butt so OP doesn't freak out at them when the haircut is done.", "I have heard stories of the male partners going to the salon to yell at stylists for cutting ‘their woman’’s hair short or dying it. Not to mention the domestic violence that can occur due to ‘unapproved haircuts’.", "This is a very creepy and misogynistic comment.\n\nEdit: How are you gonna say this here, and then in other comments say \"You do what you want to do.. don’t let anybody force you into anything you don’t want to do\" and \"NTA. People ought to mind their business.\"???\n\nMy god, maybe take your own advice and mind your own business while women do what they want to do rather than being forced to take pictures they don't want to take???", "I’ve had one hairstylist since I was about 6 years old and I don’t trust anyone else with my hair. It’s kind of a problem, actually, because when move/leave for college I don’t know what I’ll do. But I trust her to do literally whatever she wants to my hair because never once has she overstepped a boundary, never once have I felt pressured, and never once have I walked out of her studio feeling worse than when I came in. I‘ve been on a mission to grow my hair long (21 inches from the crown!) and I get trims every two months to keep the ends looking full.", "Confirm yes, once maybe. Not repeatedly. Not after being told over and over again that the one in the chair is the client they have to listen to. At some point it becomes obnoxious.\n\nI get it, I have empathy for the stylists, but it is annoying as fuck to have to keep redirecting the stylist to the person in the chair.", "Yes, this is the part that made the stylist the AH.", "Maybe they didn’t want others to think she looked like a boy?  They were looking out for her?", "Or they’ve experienced women asking for shorter cuts only to complain about it not looking feminine enough, so they wanted to cover their own ass.", "This is exactly what makes the OP NTA here", "No, that's just making sure the clients understand what they're asking for.", "From the way the stylists kept asking OP to be sure if it's ok--especially since they work at a chain salon--tells me they've experienced many instances of other parents blankly telling them to do whatever their child wants then turning around blaming the stylists if the parent doesn't like the end results of the hair cut.  Particularly, if the parent is going to remain present during the hair cut, the stylist is going check in with the parent to be sure what the child wants is ok.  The parent may say whatever their child wants is fine but they most likely experienced parents contracting that through out the haircutting process.  If the stylists didn't check in, the parent will blame the stylist why they didn't say going shorter would make their daughter more masculine looking, their face looks rounder, looks weird, etc.  And, a stylist is going to do their best to provide what their client wants, but will also provide their professional opinion if a client wants to go shorter, etc. to let them know about things they may not realize may occur--like the length may not be very flattering to their face shape, etc.  Since this is a chain salon and it doesn't sound like OP has an established relationship with the stylist, it was probably hard for the stylist to gauge if the parent really means it when they say whatever the child wants so they were extra careful.  But yeah, your suggestion for OP to tell stylists anything their child want and to ask them directly is good.  I'd add that OP could've have then left the salon after saying that so the teens could then deal with the stylist themselves. (Sorry, I didn't mean for this comment to be so long!)", "I'd say that was their professional opinion being offered because some people care about that and it doesn't sound like the stylist and OP has an established relationship for them to know whether that really matters to them.", "Except the daughter, as OP stated in a comment, clearly had that same cut already, it had just grown out. It was misogyny, pure and simple.", "Yes, exactly, because it doesn't sound like there is an established relationship between OP and stylist.  Stylist doesn't know if they've considered if it's too feminine or masculine or if that is an issue they care about; hence, stylist provided their opinion.", "I am so glad to hear someone else say this.  I constantly have hairdressers giving me the haircut they think I should have instead of the one I am asking for, no matter how explicit with directions or how many pictures I have.  I have tried all kinds of salons at varying price points and it is the same thing.  My daughter had the same issue.  She started going to barbers.  She says they just do whatever you tell them to do and call it a day.", "Imagine a stylist trying to help a client look attractive. THE NERVE", "and what sucks is that it won't end even when parents aren't there. I was in the same boat from about 10 to 18, where they'd constantly ask parents \"is this fine?\" so excited when I was about 20 and going to my first cut without parents.....\n\nperson actually argued with me because *she* didn't want to cut it \"too short\" (I am female with naturally thick hair, it does look gorgeous long but it's my hair and I like boyish looks!) and how pretty it was long.\n\nactually had to threaten to walk out and find someone who'd be willing to cut it. she did it but not without under the breath comments....\n\nI personally think it's good for OP to set this example early; my kids know what they want (esp with something like HAAAAIR) and will continue to know what they want even when adults and older people try to manipulate their decisions or feelings. NAH.", "I haaaaaaaate that crap. I grew up having people insist I be feminine and honestly, I have no desire for that. During lockdown I buzzed it all off.", "Not necessarily---the haircut turning out less feminine could be a reason for a parent who didn't realize what it would look like blowing up.", "We are the same 🤝", "No one really minds long comments, but it helps to break them up into paragraphs :)", "Yeah, fair enough. Perhaps OP should expect some double-checking and questioning when they are obviously the responsible adult, but that particular question would be out-of-line in any situation.", ">I'd say that was their professional opinion being offered\n\nIt's unprofessional af to tell a customer they'll look less feminine with a haircut they want regardless of service relationship.", "She clearly was in conversation with the daughters. She just brought in the parent at certain moments. That's actually a great practice with teenagers in general because we all know how antagonistic they can be to their parents. Positive conversations with a third party involved are useful bonding experiences and an opportunity for the teen to see their parents agree with them.", "Same. So much less hassle, stress and expense just to do it myself!", "Next time you see someone with a haircut you would like for yourself, introduce yourself and ask who is their stylist.", "A buzz cut for a girl can sometimes lead to regret and the girl coming back to the salon complaining about “how could you let me” so I’m imagining sometimes they’re just trying to cover their asses and be really sure that you want it. I once cut my hair incredibly short, liked it a lot for about a day, and then started crying on the second day about how much I wanted my old hair back. I can imagine the effect on someone with a much more drastic haircut than what I got could be similar, if not worse.", "Why are you so concerned with children being attractive?", "I used to cycle between long hair (too lazy to go get it cut) and short pixie cuts. When I would go periodically to get it all cut off I would show them pictures of what I wanted, and they would leave it too long. I'd tell them to go shorter, and they'd chop another 1/4 inch off.  I would assure them they really couldn't go too short and yet they'd always wimp out until I'd get frustrated and say it was good enough just to get out of there. Now I just cut my own. I wish I'd started doing that years ago.", "Until the age of 17 I jumped around from hairdresser to hairdresser desperately trying to find one that wouldn't ignore my requests.", "I've started going to barbers when i want to buzz my head. The number of stylists arguing with me is insane. Like, my hair is the only thing I've got from my indigenous heritage. And it is thick. To the point where it's dangerous to me in the summer since i overheat easily. If i don't have at least half my head shaved i suffer. And sometimes i just need to be sheared like a sheep.", "Stylists who you ask for a trim and they end up cutting half your length are a nightmare. Asking if the mother is okay isn't a nightmare. Maybe they're just sick of parents who don't give a damn and then blame everyone else and leave terrible reviews if the result isn't to their liking.\n\nAnd even if the stylist didn't particularly like that cut, they still did it, and they did it well if both girls were happy with the result.\n\nOP's child could tell her attitude was crappy.\nThere's just no winning with some people.", "I would consider it shell-shock.", "[deleted]", "Nope, it reflects the stylists internalization of society’s attitudes towards girls having short hair.", "And then the customer yells at the stylist for not saying something. Stylist don't know OP or the teens. Stylist is telling them something they don't know if they've considered.  Stylist is just covering their bases.", "I don’t say that the stylist had a right to ignore OP’s wishes and y’all love jumping to conclusions. But stylist, especially licensed ones, should be allowed to give recommendations. \n\nHaircuts aren’t necessarily a thing to give recommendations on but telling a client that a certain color process will damage their hair is a worthy recommendation, how a certain style may damage their hair is also a worthy recommendation.", "Yes. I used to go to a lady barber and she would buzz away my hair, no questions asked.", "Oh absolutely. No barber ever questioned whether I really want a zero fade or not, they just assume you're there for a reason and cut it as short as you want. 10/10 would recommend.", "NTA but you have to understand they probably get controlling parents quite a bit.", ">i don’t want to be responsible for that regret in someone else’s life.\n\nYou are NOT responsible. They asked you and they’re paying you. It’s their responsibility.", "I actually had waist length hair cut to above my shoulders this week. The hair dresser asked if I’d had it that short before (yep) and if there was anything else she needed to know, then she just cut it. \n\nI love it, she’s taken a physical and metaphorical load off - and if I didn’t, it’s just hair", "I have almost the same experience. I love having my hair around neck length, but I'm too lazy to maintain it so by the time I get another haircut my hair has fully grown out to mid back if not past it. Thing is I have dark curly hair that stylists absolutely adore. They constantly ask me if I'm sure I want it short and I constantly need to tell them that I've had my hair short before, and actually prefer it like that, I just go too long without haircuts. Cue to the stylist cutting my hair to about shoulder length, and me asking for shorter. Luckily on my end they do eventually get to the length I prefer.", "I dont think people who don't have thick hair realize just how hot it can get. How sticky and gross and overall unbearable it is in the summer days.... and for some people it quite literally can be a health hazard because of it. \n\nI've had women tell me they're jealous because \"with thick hair you'll be getting your hair done at the nursing home!\" \n\nwith thick hair we need to be comfortable with a thinned / buzz cut before climate change gets any worse.....", "They weren't commenting on the asking mom bit though, but rather expressed criticism over the stylist's \"she'll look more feminine with longer hair\" comment. Like, that's literally what u/ALostAmphibian 's comment says and you're commenting below...", "Yeah, dealing with people who push stereotypical gender norms can be a nightmare for some people. Everyone’s different.", "Perhaps you're not meant to be a stylist if you take offense to this.", "Covering their bases don't include shoving their opinion on what they think is feminine or not onto their customers.\n\nIf they *only* double-checked with the parent and didn't say anything about how they think it was an unfeminine hair cut, it would be NAH. But the stylist decided to insert their *personal* opinion that no one asked for, and it was unprofessional to do so.", "sure but give it to the client not the woman that is also there...", "I absolutely love that my hairstylist doesn't give me any lame excuse. If I want an undercut, he'll ask \"up to where?\" and then cut the extra length on the sides to match the photo I show him.", "She gave it to the mother, the person paying for said style. And she did it in front of both of them. \n\nShe was covering her own ass", "U can do that while stil respecting ur client\n\nNot to mention that the mom should have no say over the hair of a 14 year old, bodily autonomy and all that"]}