{"id": 22021, "submission_id": "14xncyw", "title": "AITA for throwing my wife's things away?", "selftext": "Using a throwaway account for this.\n\nFor context, I've (35m) been together with my wife (f35) for eight years. I love her dearly.\n\nHer mother (my mil) passed away in January. They were close and it's been hard for her, especially as her dad passed away a long time ago when she was little and she doesn't have any siblings. She feels like she needs to keep her \"family history\" alive which has led into a hoarding situation. Basically, when her mother passed, my wife had a hard time letting go. We emptied the mil's house and managed to sell it, but my wife insisted on keeping several boxes of \"family heirlooms\" (dish wear, lamps, books etc. mostly useless things but important to her) and ordinary things that belonged to her mother (dresses, shoes, pillows, albums etc).\n\nFor months, these boxes filled our storage room, an entire wall of our living room, one corner of my office, two kitchen cabinets and our shed. I get that she's sad, but I've repeatedly asked her to sort through these boxes because we can't keep on living like this. She said she wasn't ready to throw/give away things that had been dear to her mother and asked me to give her more time. Mind you, her mother died in January so it's been months already.\n\nYesterday when she was at work, I finally had enough. I went through the boxes myself. I threw away everything that was useless and burnt everything (but photos) that was made out of paper or similar material. I managed to empty out the shed and clear my office of her things.\n\nI did expect her to be a bit upset, but she went livid when she got home. She kept crying for hours and wouldn't speak to me. Now she's saying she wants me to go to my parents' because she \"can't stand to look at me\". I pointed out we own this house together and that she can't just kick me out. I understand she needs time, but I need my living space. And ultimately I was just trying to help her to move on.\n\nSo Reddit, AITA?\n\nedit: Okay so I want to clear up some things: I didn't throw away *everything*. I only cleared up the shed and my office, the two places I use the most. She still has plenty of boxes elsewhere in the house. And I didn't *burn* everything either. We have a fireplace and I only burnt *some* papers etc. not things like photos.", "created_utc": 1689165290, "permalink": "/r/AmItheAsshole/comments/14xncyw/aita_for_throwing_my_wifes_things_away/", "score": 36, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) I threw away my wife's things even though she didn't want me to.\n2) She didn't want me to throw the things away and got mad that I did. She thinks I'm the asshole, but I think she should see this from my pov\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", ">For context, I've (35m) been together with my wife (f35) for eight years. I love her dearly.\n\nIt doesn't looks like.\n\nYTA", "YTA - if my husband took my box of family heirlooms and set it on fire like a cartoon villain I would leave him too. There is not coming back from this.", "Babe, it's been like 6 months, I don't GET why you aren't over it yet. YTA", "YTA and I don't buy it - throwing the stuff away would be bad enough but going through the effort of burning stuff is over-the-top enough that it strikes me as bull", "YTA. How dare you decide what is useless and what isn't. You are an awful person. Please get therapy to learn how to deal with a person who is grieving, because this is NOT. IT.", "**YTA**, and I can't stress that hard enough. Your contempt for your wife is despicable. I have a very hard time believing that you \"love her dearly\" considering how you treat her. You describe the objects as \"mostly useless stuff but important to her.\" Key phrase, \"important to her\". You clearly care about yourself more than you care about your wife.", "You have just destroyed your marriage", "YTA. Holy shit. You have zero empathy. It's been less than a year since her mother passed, who was her only remaining parent that she was close to, she's still actively grieving, she has NO FAMILY LEFT and you trashed her memories because you couldn't handle the clutter? Are you kidding? Are you evil? I'm not even kidding, if someone had done this to me after my parents passed away I would have cut them out of my life immediately and never set eyes on them again. You're going to be lucky if she doesn't divorce you over this.", "YTA going thru the things is understandable. But dude you freaking destroyed things with your love of fire. Way too far, way out of line, and does not demonstrate how much you 'love her dearly.'", "Are you serious? Really? You thought it would totally definitely not be at all emotionally damaging in any way to just lose things she has a sentimental attachment to, which you acknowledge are important to her, with no say whatsoever in which items mean something to her and which don't? \n\nMaybe you burned the last book he dad read to her at bedtime. Maybe you the way the shirt her mom wore the day she cried into her mind and because her best friend moved away. You have no idea because you gave her no say, and you're seriously wondering if you did anything wrong? Sure didn't get the opportunity to re-live memories as she went through things.\n\nSure hasn't even gotten through the first year. The hardest year. Don't act like you're helping her move on. This was 100% because her grief was taking up too much space, and your space was more important.", "Lol. I hope you enjoy paying child support because your marriage is over.\n\nBut look on the bright side! You did help her to move on....from you.\n\nYTA", "YTA. Less than 7 months (I’m assuming it took you a while to sort the house) is not nearly enough time to decide you “can’t live like this” dude. Your wife is grieving and asked for time. You violated her trust and her boundaries. This’ll be extremely hard to come back from.", "Are you for real? If yes, YTA!\n\nWhat the hell is wrong with you? Why do you have negative emotional quotient?\n\nI feel HORRIBLE for your wife. Not only did she lose her family but she also realised her husband is an AH. \n\nI wish I could give her a hug and be there when she divorces you.", "YTA just get a storage unit for a little while until she is ready. Not that hard to be compassionate for fucks sake", "YTA\n\nHer grieving doesn't follow your schedule.", "YTA. My god man, I'd divorce on the spot. Is this real? It's only been 6 months, it's still incredibly fresh. You \"needing living space\" isnt even a drop in the ocean compared to what shes feeling. Awful human.", "YTA\n\nEnjoy divorce court. You're callous and cold. There's no looking at this from your perspective. You threw out her connection to the last living family member she had. You deserve nothing but divorce papers.", "Omg, you ginormous asshole. These things take time to process and you just blew up that whole process. I hope she divorces you over this, you compassionless ass. YTA", "Wow.\n\nMajor yta.\n\nYou threw away everything that YOU determined is useless. Who elected you to be god? \nThen. You burnt everything that is made of paper.\n\nBURNT? I don’t know what you wish to achieve but I’m pretty sure your wife would prefer that you got burnt instead.\n\nI am quite sure I am understating it but you are an extremely cruel and callous person.", "# YTA \n\n#  I hope she divorces you. You wanted space, you'll get space, you'll be living on your own from now on. In  the end you'll get what you wanted.", "YTA\n\nYou weren't trying to help her you were only thinking of yourself.   \n\nYou couldn't put up with a few boxes in the house so had to destroy her last link to her parents.  \n\nWhy not go and rent a storage locker and move everything to there?", "YTA. The processing of grief can take up to 2 years, sometimes even longer. If your wife told you she wasn't ready yet, you should've respected it. My grandfather also passed away in January, and my mom definitely still has an incredibly hard time dealing with it. These objects were trash to you because they didn't hold sentimental value. To your wife, they were the last physical reminders she had of her mother, the only family she had left. \n\nShame on you.", "Yta for the way you went about it. My mom also died in january and it feels like yesterday. Yeah, the stuff had to go but it wasnt your shit to get rid of....or to determine what was \"useless\". Have you suggested she get therapy? I dont think id be able to forgive you.", "YTA, if that was me its a DIVORCE. its none of your business, you could've done a million things instead of hurting her more than she already is. rent a storage, help her out, making it an activity, understanding what each item means, yet u threw everything in the trash and burned the last thing she had from her past. YTA.", "Help her move on from her mother’s death. By torching her belongings. You’re a sick selfish bastard. YTA and she shouldn’t be have to suffer being near you. Do one decent thing in your life and pack your things (or torch them!) and move out.", "YTA. It’s only been 6 months. My mother also died recently and I’d lose it if my husband did this. Unless you’ve had a parent died you can’t imagine how final it is and how horrible it is. You did a terrible thing.", "YTA - disgusting and just abusive. I hope your wife will finde someone who treasure her the best way she deserves.\n\nOh of course after she got rid of you useless bum", "OP said specifically that he expected her to be a “little upset.” So you went into it knowing that it would piss her off. So why do it??? Grieving doesn’t have a time limit, you were just too selfish to realize this. Those boxes had her parents’ life in them and you cruelly set those things on fire like you didn’t have a care in the world. YTA big time and I would not be surprise if she leaves you.", "YTA, big time. There were more options for you to try. Six months of mourning a loved one is not all that much. I get that you were inconvenienced and reaching your wit's end but you were so terribly destructive and disrespectful of your wife's grief. I wouldn't be surprised if this becomes a permanent fracture in your relationship. \n\nYou could have asked her to set a deadline by which the things would be cleared out, you could have set up a workshop kind of exercise where you go through the things together, you could have asked for one box at a time (say, one per week or one per month) to be done, you could have obtained an external storage unit, etc. etc. etc. It's pretty disgusting that her feelings went out the window due to your inconvenience.", "YTA. January was about 5 minutes ago. You have done something unforgivable. Plus you sold the house - why could the proceeds not have been used for extra storage?", "YTA - I like to think I'm an arsehole but jesus fucking christing shit you take not just the biscuit but the entire biscuit aisle. How did you expect this to pan her? Your wife comes home from work and thank you for burning items that mean something to her? Everyone handles grief differently and there is no right/wrong way to do but what you did is wrong in every sense and every possible universe.\n\n&#x200B;\n\nYou even say \"important to her\" - the thing is she clearly is not important to you. I can't even imagine the most incompetent carton husband figure being this fucking stupid.\n\n&#x200B;\n\nCould they have not gone in the attic/loft/basement/storage centre? So many ways to have prevented this how did burning them become the best idea you could come up with?\n\n&#x200B;\n\nedits: correcting spelling and adding more words because everytime I read this post again I find something else to say", "YTA. You didn't help her to move on, you took away her way to have a satisfying conclusion of her grief when she goes over those boxes and memories and decides what to keep and what not. You are an incredibly selfish person and I can't believe you don't realize it. It's been half a year only since her ONLY PARENT THAT SHE GREW UP WITH AND ONLY IMMEDIATE LIVING FAMILY passed away. People get hit by the parents passing away and sometimes it can take years to go over it (and not completely). \n\nYou threw it and BURNED IT AWAY? Are you for real? Maybe there were letters there, notebooks, mementos. This is a relationship dealbreaker here. It was her stuff, very sentimentally important stuff and you knew about it. You were fed up with it? Why not offer to rent a storage space? Let her pay for it? \n\nI hope you are happy with your empty shed and office. And soon to be bedroom. \n\n&#x200B;\n\nI wonder if your parents would say something about you \"moving on\" from the memories of them after half a year of them passing. How about you ask them, huh?", "YTA. You weren't trying to help your wife to move on. You were trying to get boxes that you considered junk out of your spaces. You've wounded your wife. Now she has to deal with the loss of those items, feeling like her past/family history has been stolen way from her...and that YOU did this to her.", "YTA...I hope you are kidding. There is no time limit on grief. If she wasn't ready to go through them, she wasn't. Who are you to decide it's been enough time? Have you any empathy? You burned the paper items? You destroyed her property. That is not something you can undo. You are a huge AH, and I hope you reflect and realize how selfish this was on your part.", "Wow, this was incredibly cruel and violating. YTA", "YTA. \n\nI would try to breakdown all the reasons why this was a horrible, cruel thing for you to do, but I think you might actually be too smooth-brained for any of it to sink in, so I won’t waste my time.", "YTA. Sorry, but if I had a SO and they did this to me, I’ll divorce them, hell, this is literally *property damage*, considering you BURNT things that weren’t even yours to begin with and that should warrant police being involved. \n\nThere is no time limit for grief, many people would go as far as for the rest of their lives to grief someone so close, like their parent. Hell, I keep my paternal grandfather’s watch that I got as some sort of an inheritance in a box, which is kept safe in my shelf, and I refuse to wear it over grief and regret for not calling him on his birthday just before he died (and mind you, I was not informed about his health). If my hypothetical SO threw or burned his watch, I will not hesitate to pack my bags and block him from everywhere for the rest of my life.\n\nYou should have had her go to therapy. I’m sure there are many therapies that help in moving on. You’ve gone WAY too far. Good luck in bringing this relationship back to its glory cause there’s no way this will not end in divorce.", "yta\n\n. Mind you, her mother died in January so it's been months already.\n\n grief can take years to get help for \n\nits her mum and your burnt her stuff \n\nget your divorce lawyer ready looks like its going that direction", "YTA if you actually loved your wife you wouldn't have burnt her things. Grief takes a minimum of a year and a day as you have to experience all the firsts (birthday, Christmas etc) without the person you lost. Your wife is only six months into her grief. \nDon't be surprised if you get served with divorce papers.", "Wow YTA without question. I’m so glad you’re not my husband. If she wasn’t ready to let things go you could have gotten a storage unit. It’s so incredibly painful to go through things that you inherit from a loved one who has passed. As her husband of eight years that loves her so deeply you could have had some compassion for her.\n\nI understand the frustration of the hoarding situation, my parents have a major issue with keeping useless things to the point of mildly hoarding and I’m constantly bugging them about going through it all which I agree can be extremely stressful. \n\nBut in your situation, it’s only been a few months. She had to empty her mothers house and sell it quickly, which can be somewhat traumatic alongside losing someone as important as a mother. Simply getting rid of things she cherished without her consent was toxic and selfish. \n\nAs you point out, the house belongs to both of you and she has the right to keep things there. If it was really so bad you could have found an alternative to trashing and BURNING all of her stuff. You’ll be so so lucky if she ever forgives you. \n\nIt’s not your job to help her move on.. especially on YOUR time.", "YTA\n\nAnd a massive one.\n\nIt was HER things, HER grief to process.\n\nYou could have gave her a proper ultimatum to sort out the things in your office and the common rooms. But even then, throwing/burning her stuff wouldn't have been justified, especially with many other options that would have force her to: packing it in the middle of the driveway (a bit AH, but still justified) or in the middle of the entryway, or putting it at someone's else place in the family, etc.\n\nBut simply throwing/burning it, as if it was yours? Nope.", "Hard YTA.", "YTA what you did was very selfish to say the least. She’s going through possibly one of the hardest times in her life and you’re more concerned about boxes around the house. Was there not a better solution… a storage unit maybe until she was ready to go through the boxes, getting her into therapy if she’s not already. You say it’s “been months already” which is pretty insensitive there is no set timeline on grief. Grieving for her mother is something she will have to deal with the rest of her life it comes in waves.", "YTA. \n\nIt’s been six months, very strange for you to just expect her to be over it by now. If it was bothering you so much you could’ve just put it in a storage unit. She literally asked you to give her some more time, then you go behind her back and burn her things, of course she’s going to be livid.", "Asshole isn’t an accurate enough word, you’re a fucking prick.", "You should of gotten a storage unit for 6 months", "Info: have you lost someone very close to you? A parent? Have you suffered grief? How long and how did you cope with that grief?", "Yes, YTA. Huge AH! Grief can take months if not years. If the stuff bothers you (which I get, it's inyour living room) you should have rented storage.  \nMourning doesn't follow rules, it's different for everyone and you never get over it. Yes, the pain will become less over time but your loss becomes a part of you and the grief never completely disappears. It's been 'just' 6 months, not 'already' 6 months.", "YTA. You determined what was useless for somebody else. You don't know why something may or may not have been important to her. She's still in grief; it doesn't matter if it's been 6 months or not - she's still grieving. Surely you could have found a way to reorganize to get the stuff more out of your way if it's that much of a nuisance without actually destroying it? A storage unit? One of the pods or something? Reorganize items so they fit better and take up less space? But wholesale destruction was way too far.", "YTA. Get ready for divorce papers", "Ummm yes. You are a asshole. Get over yourself. Holy shit. I hope this isn’t real.", "YTA. You are so heartless you need therapy to understand how normal humans experience emotions. I would not blame her for divorcing you and cursing you for the rest of existence.", "YTA\n\nAs fare as big as a mountain.\n\nThere are no words to tell you what you made wrong.", "YTA.", "YTA. No explanation needed.", "Yta. Grief has no time limit, and your next post will probably be. AITA for trying to fight the divorce because my wife filed for it when I tried to help her clean up.", "YTA\n\nPerhaps THE asshole. You are delusional to even consider that this could actually be acceptable in any way", "YTA. Imagine how it would feel if this happened to you? Why wasn’t a storage unit an option here? Did you really need to burn everything or were you trying to make some kind of point? \n\nGrief is hard but you don’t get to decide when it’s over for anyone but yourself. You are a callous and unsupportive. You claim you love your wife but this was not an act of love. You burned her mother’s dresses. You threw out heirlooms.\n\nI hope you are prepared to receive brand new papers as a result of your actions. I doubt there is any coming back from this.\n\nI really hope you’re a troll because if you aren’t, I pity your friends and family.", "I just don't understand your thought process.. Like I get that you wanted your office back and started looking through the stuff but why the hell did you throw it away (or burn!! wth).\n\nYou know what might have been an idea? You could have driven to the container store, bought boxes in maybe 3 different colors (or marked them with a marker).\n\nGREEN - keep / RED - don't keep / BLUE - undecided\n\nSort the stuff in your office into the boxes and then put ALL boxes somewhere in the house and ask her to look over it when she feels like it and let her have the final say. And not pressure her. That would have been a start and not a big fat fire surprise.", "YTA. It has barely been 6 months since her only family member passed away. You weren't helping her and you knew it. You were punishing her for her grief. Burning everything that was paper? What the actual f is that? You sound like a cold, heartless psycho. If my husband did this to me I would never forgive him. Your marriage is probably not salvageable after this. I hope your poor wife gets the love and support she needs somewhere else. She sure as shit isn't getting it from you.", "YTA. Helping someone move on is like helping them to find a grief counsellor or therapist they can talk to, offering them kindness and support - it's not throwing out the things that they're desperately clutching onto because of their feelings of loss that's what we call \"making it worse.\"", "YTA - I have stuff piled in a corner from my parents house who died two years ago. It’s taken this long to feel strong enough to go through my mums cook books and throw most out. My husband has things from his parents similarly. The most I would do is move these to clean around or pop in the loft in a safe storage container. It wasn’t your stuff to get rid of - it was hers and it had huge sentimental value.", "Yta. I wouldn't be able to look at you either. Man I hope this isn't real.", "YTA. Hope it was worth losing your marriage over this. It is going to be a messy divorce.", "Moving the things would have been one thing.\n\nActively burning and destroying someone else's property?\n\nNot only is that a dick move, it's a crime!\n\nYTA", "This has to be a troll post I just can't imagine a person doing this but in case it's not I would say YTA.\n\nI cringed all through this post my man.  I am not the most sensitive guy but even I can see what you did would result in a big problem. \n\nThe funny part is that were not wrong in how you felt but you could have done this in so many different ways, but you chose the one that would be the worst. \n\nGood luck mate.  Not sure if your partner will forgive you. This is one screw up you can't fix. Hope you have a time machine.", "Your edit didn’t help. YTA\n\nHere’s my edit: I wouldn’t be able to look at you either. \n\nEdit 2: to help someone else solve a problem you rent a storage unit for the stuff. That’s what my dad did for my mom when she brought back all the stuff from her mom’s home. They went through one box at a time after about a year of her healing from the loss of her mom. But it was too raw for 12 months to do that. Understandable you don’t want the boxes underfoot, so just move the boxes out temporarily.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nUsing a throwaway account for this.\n\nFor context, I've (35m) been together with my wife (f35) for eight years. I love her dearly.\n\nHer mother (my mil) passed away in January. They were close and it's been hard for her, especially as her dad passed away a long time ago when she was little and she doesn't have any siblings. She feels like she needs to keep her \"family history\" alive which has led into a hoarding situation. Basically, when her mother passed, my wife had a hard time letting go. We emptied the mil's house and managed to sell it, but my wife insisted on keeping several boxes of \"family heirlooms\" (dish wear, lamps, books etc. mostly useless things but important to her) and ordinary things that belonged to her mother (dresses, shoes, pillows, albums etc).\n\nFor months, these boxes filled our storage room, an entire wall of our living room, one corner of my office, two kitchen cabinets and our shed. I get that she's sad, but I've repeatedly asked her to sort through these boxes because we can't keep on living like this. She said she wasn't ready to throw/give away things that had been dear to her mother and asked me to give her more time. Mind you, her mother died in January so it's been months already.\n\nYesterday when she was at work, I finally had enough. I went through the boxes myself. I threw away everything that was useless and burnt everything (but photos) that was made out of paper or similar material. I managed to empty out the shed and clear my office of her things.\n\nI did expect her to be a bit upset, but she went livid when she got home. She kept crying for hours and wouldn't speak to me. Now she's saying she wants me to go to my parents' because she \"can't stand to look at me\". I pointed out we own this house together and that she can't just kick me out. I understand she needs time, but I need my living space. And ultimately I was just trying to help her to move on.\n\nSo Reddit, AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Ugh. I get it, I hate hoarding and piles of stuff.\n\nBut. She's grieving. For you to just throw things away without her consent is wrong. YTA.", "Definitely YTA", "YTA\n\nIt's bad enough to throw things out instead of just sort them into different piles of what you consider useful and unuseful for her to then go through, but to actually **burn** things shows your intentions were malicious and to make sure there was no recovery option.\n\n6 months is ***nothing*** when it comes to grieving the loss of the last parent!!", "YTA.  Your actions very likely have ended or damaged the marriage in some fashion.  \n\nMen like you are why all my property including my home are in my name only.  A man does something like this to me and I will have the sheriff serve you with an eviction notice.  Simple and clean.", "YTA if I came home and found that I would straight up walk out the door and never see you again. How dare you?", "YTA. She needs psychological help this is how hoarding disorders start.", "You're the biggest AH that ever existed. You cannot dictate or control the grieving timeline for anyone, *including* yourself. I hope she divorces you and sues you for mental and emotional abuse and wins. \n\n***And ultimately I was just trying to help her to move on.***\n\nAre you a licensed therapist? What gives you the right to interject your feelings into her life experience?\n\nTalk about being devoid of emotions like empathy and sympathy. Why bother having a discussion or engaging in therapy when you can go ahead and destroy someone's entire life like it meant nothing at all. Marriage is supposed to be a partnership, not a dictatorship. She's not your property. Her belongings cluttering up your house sure hit a note with you, didn't it Fred Flintstone? \"I'm not emotionally mature or available, so she shouldn't be either.\" \"Me, me, me, it's all about me.\" You're an abuser and I hope she gets everything you own and then some for having gone through this abuse. \n\nI hope the rest of your life you are burdened to madness with the knowledge that you committed familial genocide.", "Keep that same energy of moving on quickly when your parents or anyone else you dearly love dies\n\nYTA", "It depends. Is there a history of hoarding in their family? Did she grow up very poor? If the answer is yes then I understand your fear AND why you did what you did but if not then YTA. \n\nHowever, hoarding can also be triggered by traumatic events like the unexpected loss of the loved ones' stuff before they were ready to let go. \"Months\" is really not a long time to process and you may have just made a hoarder. Good luck to you.", "ESH but you more than her.  Your wife was essentially hoarding her parents' possessions as she didn't want to let them go but was storing them in places that only impacted you and not her.  That was not fair to you.  You should not have destroyed anything, even if they were useless scrap paper with no significance.  Your wife is obviously struggling with their deaths and getting rid of the stuff without her invlovement is just going to make the road to acceptance much harder.  What you should have done is move all the stuff out of the shed and your office, and placed it in a shared area like the living room.  Then when your wife came home sit her down and tell her you two need to figure out what to do with this stuff once and for all.  Keep the important things but surely she doesn't need her mother's shirt she saw her wear once on a Tuesday.", "ESH except you can't really say a woman trapped in untreated grief and a man trapped in a burgeoning hoard are assholes exactly. More like life can be cruel?\n\nYou're trying to stay married and you've inadvertently ended up living with a hoarder as her grief has gotten stuck. Insist on a grief counselor and an OCD therapist. If she refuses treatment, try a legal separation into two separate living situations. If you really want to stay married to this person and she won't get treatment or it doesn't work (and if this flowers into full hoarding the treatment outcomes aren't great) your choice may be to live in a hoard or buy/rent a separate space. \n\nLastly I would have recommended a visit to a divorce attorney. Living in a hoard, with someone who's treatment resistant, is miserable. I've seen a family member go through it. I wouldn't wish it on anyone.", "You are a huge asshole, maybe a bag of assholes in a dumpster fire. Grief doesn't have a timeline, dude. And even if it did, it's not 6 months. 6 months she's probably still picking up the phone to call her mom on a daily basis. And furthermore it's not your job to decide what is important to your wife. I have a handkerchief of my dad's that's terribly important to me. A plain old cloth handkerchief that you can buy in a 3 pack at any Walmart for a couple of bucks. It's one of the most important items I own because it was his. \n\nI'm so angry for your wife that I honestly hope you never have another partner in your life. You deserve to live the rest of your life alone.", "ESH it would drive me mad having clutter around...but thats because i prefer minimalist...i dont do 'stuff' \n\nAnother solution was to get a storage unit...then it could have gone in there.", "Nta she was hoarding useless rubbish and cluttering your home", "Leaning towards YTA but I will just say INFO cuz op just said that they \"repeatedly asked\". You should have sat down with your wife and had a talk about this because I understand that it clogs half of your living space but you went a bit too fast. You should have done that with her and reasoned with her. If she continued being unreasonable, then NAH.", "NTA - I have a sister that bought a huge storage shed when my mother passed and put tons of her stuff in there.     So seeing her obsession with keeping things and selling things off, I'd say you need to gently help your wife memorialize her mother in some special way to help her begin to let go.  It will take time but some people can only process the grief by having things to hang on it.", "yea i am sorry, living in a hoarding situation for 6 months with no end in sight, you 100% did the right thing op.  NTA", "ESH. You more than her, though.\n\nWhat she did was wrong. It's wrong to turn an entire family house into some long term storage shrine to a departed loved one. It's not fair to the other people living in the house to expect them to live like that. I'm sorry, people are going to say \"she was still grieving\", \"grieving doesn't follow a schedule\", whatever. As a practical matter, you don't have a right to make others live with your grieving in that way. \n\n**However**. What you did is unforgiveable. There are ways to approach hoarding mentality and grief without causing more psychological harm, and you didn't do that. You did it the worst possible way, and then have the gall to act like you only expected her to be a little upset for a few minutes.", "\n\nNo, you are not the AITA here. You were trying to do something that you felt would help your wife and you consulted her repeatedly beforehand. You gave her a chance to sort through her belongings and she didn't. You were well within your rights to go ahead and help her move on without her permission, but it is understandable that she is upset. You should not have burned anything without consulting her and that was wrong, but it is understandable given her lack of action. You should apologize for burning things without her permission but remember that this was out of concern for her wellbeing and shortly explain why you made this decision. She may still be angry, but she will hopefully understand your motivations and forgive you.", "I can’t see how you’re gonna recover from this one. YTA.", "YTA. Instead of offering to get an extra storage space or some other solution,, while your wife grieves her loss of family, you threw out her things, that connected her to her mother. If it were me, I'd divorce you over this. It's been 6 months, ffs. since she died. Her last connection to family. Her mother. And then you threw out her property. Yeah, I'd never trust someone who did something like this, again. Pretty sure what you did was also illegal, because inheritance isn't shared marital property. So she can't throw you out of your house coz it's shared, but you can destroy property that isn't yours? Goddess, the entitlement and callousness you exhibited here and are still clueless as to why you're the AH?", "YTA and it is impossible for me to be civil beyond that", "You are not your wife.  Your perspective is different. Neither is wrong , but enforcement of one over the other  is the problem. You didnt negotiate.. you demanded and then unilaterally acted. A storage locker would be a better solution. She wasn't ready and you weren't forebearing or kind.", "Bruh. Yeah hardcore YTA. When your parents pass remember this and don’t allow yourself more than a couple months to grieve and your wife gets to decide what is “okay” for you to keep. May you stub your toe & step on a Lego everyday until you learn your lesson.", "You are NOT  the grief police", "YTA\n\nSorry her parents death and grief is an inconvenience for you. My god. My husband’s grandmother died recently and i felt terrible about ALMOST throwing out a Christmas card she gave us…I definitely feel better now. We still have the Christmas card hanging up. I have no plans on removing it.", "YTA. \n\nYou would have all the space you could handle my dude.", "YTA. Holy shit, I'd be so fucking devastated if someone did that to me.\n\nPeople grieve on different timelines. My partner/fiance of 7 years left me a little over a year ago and I still can't go into the room that was his office. \n\nSeriously dude, you have a whole lot of making up to do.\n\nEdit: It doesn't matter if you didn't throw *everything* away. You have no idea which items are most important to her. Are you seriously that dense??", "YTA. Have you not heard of storage facilities where you can temporarily rent space and give your wife time to heal without throwing away or BURNING her things!!", "YTA", "YTA. Let's see how you feel six months after your marriage ends because of your callousness. Do you think you'll still be grieving?", "YTA should have rented a storage unit and moved the stuff there if it was becoming an issue.", "YTA a thousand times over.\nSo, have you heard of storage units?\nAnd did you know you can move stuff into them?\nIt gets stuff out of your house and you don’t destroy belongings that aren’t yours. That you can’t see that is astounding and concerning.\n\nYou are a terrible partner.", "YTA SO MUCH YTA. And the fact that you're even asking about this...", "YTA \n\nIt’s only been half a year, she lost one of the most important persons in her life and you decide you know what means something for your wife in the boxes\n\nI lost my parents in 2018, I could only open the boxes in 2020, you should’ve given her time you selfish b", "YTA. I hope she divorces you and is awarded all your possessions, which she then destroys.\n\nYesterday on Twitter someone posted a thread of all the examples she found *just on Reddit* of men destroying or getting rid of their girlfriends and wives possessions, hobbies, work output, schoolwork, projects, and even animals because they were angry that women have feelings, thoughts, and experiences that didn't include them. Seeing it all laid out was really shocking! I know men hate women -- I mean you guys really HATE us -- but it's still so hard to see it in action like this.", "YTA. You will not be able to recover from this.", "YTA. Even more so for your update trying to justify it. My father passed away years ago. What most people would consider “the useless stuff” are the items I cherish most. How dare you.", "YTA. Mom has been gone 6.5 years and dad going on 2 and I still have boxes of person stuff that I can’t go through. Part is waiting on siblings to be available but I also break down when I see things or smell something that brings back memories.", "YTA here. Absolutely.\n\nDude, I get having a problem at your house overflowing with boxes, but throwing it out is not the solution! Seriously, what is the matter with you? Rent a storage room to put things in, until she's ready to do something about it. How was that not your first thought?", "YTA!  Are you kidding? It's been 6-7months, that's not that long and she is going to be grieving for a long time. You should have been patient and let her deal with stuff herself or if it was that big of a deal then offer to get a storage unit for it.  My mum still has stuff from her parents passing and I'd never push her to get rid of stuff before she was ready. \nLearn some compassion.", "YTA. I get your frustration, (oh do I get it,) but it wasn't your call to make. Your wife *was* starting to be the AH for not taking your feelings into consideration, but then you escalated....\n\nHowever: so many immature people on here jump straight to, \"Divorce!!!\" which suggests to me that they have not been in a long-term committed relationship, and they are coming from a place of ignorant passion.", "So renting a small offsite storage wasn't an option? She could have gone through the boxes as her grief eased. But holy cow YTA. You don't get to determine what is important to her.", "This is one of the easiest YTAs I’ve seen. Grief has no timeline. It’s been 2 years since my grandmother passed and my mom still isn’t ready to go through her things. You know what my dad did? He rented a storage unit, so she could go through everything on her own timeline. \n\nIt is absolutely monstrous of you to destroy your wife’s things like that. Who the fuck do you think you are, deciding on what’s “important” and what can be tossed? It doesn’t have Jack to do with you. You want your own space? I hope your wife gives you all the space you need, forever, in the form of divorce papers.", "Yta, you do not get to choose what is an acceptable time for someone to grieve.  I hope she leaves your ass", "I mean look at the bright side, you will be able to keep your new place as tidy as you want.\nYTA obviously", "YTA: that is not how you help someone move on. What you did was extremely selfish and you would be extremely lucky if she stays with you. Hoping and praying she doesn’t.", "YTA\n\nEver hear of a storage unit? It could have been that simple. Idiot.", "YTA.\n\nAs someone who just lost their father... You. Done. Fucked. Up.\n\nIs it an inconvenience? Sure. A better course of action might have been to relocate the boxes, AFTER  a mature adult conversation with the person who very likely no longer wants to be your partner.\n\nEveryone processes grief differently and you just turned the entire process inside out, in its head, with no consent.", "Yta. My mother passed in March. While I don't have as much stuff (my mom had very little to her name) my sister and I split the estate and I have 2 boxes and a suitcase filled with things. I'm not ready to sort through it. It's too soon for me. I've tried several times and my grief just doesn't let me. My therapist even said this is not something you rush. But he did encourage me to sort for 30 mins once a week if I can but at least once a month. You took away her ability to process this. I would never forgive you.", "YTA.\n\nYou say you asked her to go through them because you couldn’t keep living like that…but did you ever actually talk to her about any of it? Like actually sit down and discuss your concerns and try to come up with a game plan together?\n\nTo me the best solution here would have been to go through them together and see if you could get dwindle down the number of boxes. There’s probably things in all of them that go packed when emptying out the house that she’d be willing to let go of. Go through together and see. Make it clear you don’t want her to get rid of important things. Maybe what’s in two boxes could fit into 1 and then it’s one less box.\n\nOr you could have set up a schedule of going through one box a week.\n\nOr you could have suggested therapy.\n\nOr a storage unit.", "HOLY YTA BATMAN!!!!", "My mom is a hoarder. I grew up in it. Until you live with someone that can’t get rid of anything, you just don’t get it. Having said that, damn you took the nuclear option. Wouldn’t have been my choice of course. YTA, mainly because you probably just ended your marriage and didn’t see it.", "Wow. Maybe this belongs under AmItheDevil. \n\nYou are absolutely the worst kind of selfish AH. I’d divorce you so damn fast", "My mom died when I was 15 and 12 God damn years later I still can't sort through everything and my dad treats his room with her like a mausoleum--nothing touched--for 12. God. Damn. Years.\n\nYou are a raging ah. Grief takes a long ass time.\n\nGo get checked because this takes a zero ability for empathy to even begin to consider this action.", "YOU ARE THE ASH-HOLE \n\nMy brother in Christ, how dumb are you, like seriously are you on the spectrum or something cause there is no possible way you thought she wouldn't kick yo ass when she found out that you quite literally burned and threw away her late mother's belongings\n\n\nShe can't get those back you know, they're literally gone forever, the last memory she had of her mother, the only piece of her that she had left is either sitting in a junkyard somewhere or is literally ash and cinders \n\nYTA\n\ni hope that when your mom dies someone throws away her stuff and makes you watch as they burn all the things that have sentimental value to your stupid ass\n\nLet us know as soon as she leaves you, cause you know as well as all of us here that right now she's just counting the seconds until she quite literally never has to see your dumbass ever again\n\nSmh", "YTA, it's been less than a year. Instead of meeting her with compassion for losing her parents, you decided to be a flaming @-hole and throw away her heirlooms! \n\nDid you consider getting your grieving wife some therapy instead of being a callous goblin? \n\nHow about taking onebox out a day and help her sort through it?", "YTA. It’s been barely 6 months. Grief can take anywhere from days to years to process. You could’ve picked a day and helped your wife go through items but instead you chose to do the worst possible thing possible and start going and tossing away items on your own. It doesn’t matter that you only did the boxes in the rooms that you are only normally in, you still went through your wife’s property that is very personal to her on an sentimental value that you may not understand. \n\nMy dad died in 2007 a couple weeks after my birthday. It’s been 15 years and I still have moments that it hits me hard. But the grief hits my mom even harder. Most of his items we got rid of pretty early on (siblings each got something). I got one of his shirts he used to wear all the time, plus his coin collection, and a pair of binoculars. My brothers each got one of his guns. I don’t remember what my sister got. Now 15 years later my mom decided to go through some more of his stuff (mainly military documents). I now have a deer call and an old cigar. \n\nNo matter rather it’s been a couple days or even years everyone processes grief differently and the way they behave on the grief is going to be different. Your job is not to go through and rid of stuff on your own, but to be there and support your wife as she goes through her own process of healing.", "YTA. Part of grieving is taking the time to remember that person as you go through the stuff- and you robbed your wife of that chance. Who are you to decide what was valuable to her or not!?\n\nThis is quite possibly one of the most heartless things I’ve read about on this sub… actually burning her stuff was way over the top.", "This process of grief is going to take at least a year if not more. You have now made it take longer. Throwing things out was a flat wrong move and you're a selfish idiot.\n\nGroveling is your best first move. \n\nDo you have an attic or can you afford a small storage unit? She will need time and she must go through these boxes herself to process her grief. She hasnt let her mother go yet and these boxes represent her. Storing them and dealing with one or 2 at a time would be best. Expect her to reduce not just toss. Find a womens shelter for clothing. A purpose for the things will allow her to let go easier. It did for me when my mother passed.\n\nThen grovel some more. \n\nAlso, YTA", " Well, you’re not only the biggest YTA of the week, you’re the monstrosity of the month. My heart breaks for your wife. As someone who has lost immediate family members, I would divorce you and go no co Taft forever for what you did. Your parents and friends will see what a terrible and despicable thing you did. Disgusting", "By throwing away, or setting fire, to everything and anything that you decided wasn’t important, you put your marriage, and your wife, on that pile of trash and ashes. \n\nShort of amnesia or brainwashing, I can’t imagine any way to come back from this utterly gross, cruel violation of her trust and grief. \n\nYTA.", "6 months and u think she should be over it already!? YTA my mom died in march and if my husband pulled anything like this. I would divorce him immediately.", "boy you are one hell of an AH.\n\nBIG YTA", "YTA-  \"We own this house together.\" Super rich coming from you! First off, I get it's an inconvenience, but you're right, it's HER house too, and she can put whatever she wants it.  Second, by that logic, those were HER belongings, and you had no right to touch them!  On top of all of that, you weren't trying to help her move on. It was 100% about what you wanted and had nothing to do with her! You were selfish and unkind. There are so many ways you could have helped her, but you chose this route. I hope she sees the person you truly are.", "YTA so much!!! It’s been 6 months! I know what it’s like to loose a parent and there is no time limit on grief… what is wrong with you to do something to heartless?! I truly hope she divorces you because this was just vile on so many levels", "Huge YTA.", "YTA... My heart hurt reading this... \n\nHas it ever occurred to you that instead of burning her things, YOU COULD HAVE RENTED A STORAGE UNIT \n\nHow could you do this to someone you love.... You essentially restarted her grief ALSO MONTHS IS NOT THAT LONG OF A TIME TO GRIEF FOR A PARENT ESPECIALLY ONE YOU WERE CLOSE WITH \nWtf is wrong with people....", "Right like what… babe sorry I know your mother died but like it’s been 6 months already and I need my shed back. The lack of empathy is SCARY.", "Yes! Because if he had just tossed papers in a garbage bag the wife could still get it back; by burning the papers there’s no way his wife can reclaim what he threw away. Burning the MIL’s items is intense. Wtf.\n\nOP: you’ve got deep issues and they’re spilling over into how you’ve reacted to your wife’s grief. YTA and work on yourself because you’re just going to torpedo your next relationship.", "Too bad he's a waste of space..", "Exactly. Reading this first thing that came to mind was divorce. What a horrible man.", "He sounds too coldhearted to save mementos from his parents.\n\nI am appalled at what he did to his wife. He is YTA beyond belief.\n\nMy mother died nearly 50 years ago. I still treasure a dress she designed in her 20s, a pair of pillowcases she embroidered for me when I was a child, a sweater she knit for me as a teen. I have her beautiful china.  She and my father immigrated here from postwar Europe with very little. They had to leave nearly everything they owned behind when they fled their country.", "> It’s not your job to help her move on..\n\nAs her spouse and someone who supposedly loves her, it is his job to help her move on. But you do that  by being supportive, by listening when they just need to talk about it, by comforting when they're overwhelmed. You don't do that by running a stopwatch on grief and saying \"Time's up! No more grieving.\"", "A vile, heartless spawn of a cockroach and a dung beetle, coz there was nothing human or loving in what he did.", "I would guess he hasn’t based upon his actions but maybe he has and he’s just heartless which would also be a fair guess based on his actions", ">Keep that same energy of moving on quickly when your par\n\ntner dumps you.", "Bait used to be believable", "She communicated back to him that she is still grieving and not ready to deal with it yet and asked for more time.", "I lived with hoarders and struggle every day myself as an adult with my own home. It's a slippery slope on how to handle these situations, but there are therapists that can help with this.\n\nI'm gonna say OP is  YTA because the hoarding is tied into grief & neither were going to fixed with him talking at her.", "No. It's his MIL who passed. Not some stranger. He's a part of the grieving whether he likes it or not. Definitely a YTA.", "I would have to disagree with her doing anything wrong. Why a storage unit wasn’t an option idk but either way it’s not like she’s living with roommates or just “other people” it’s her HUSBAND the person who vowed to love and be there for her through the best and worst times so… and it’s not a shrine it’s boxes and it’s not like she said she plans to live like that forever all she asked for was time 6 months is not long term by any means either", "6 months, 6 freaking months. That’s what he gave his wife to mourn her only living blood relative before he burned her possessions in a fit of petty, I’ll show you how to move on bullshit.", "Not legally he wasn't. Inheritance isn't shared marital assets or property. So he technically destroyed someone else's property, and she could technically sue him for the damages (mostly emotional). The money from the sale of her mother's house (her childhood home probably) also doesn't belong to him.", "And when your parents pass I hope someone shows you the same consideration.", ">I pointed out we own this house together and that she can't just kick me out\n\nfunny how OP understands ownership when it comes to HIS property but suddenly fails to understand it when it comes to his wife's belongings.\n\nYTA jesus", "Same. I never jump to 'divorce' on reddit but I cannot see how OP can come back from this. No empathy, no respect for his wife's property...how could she trust him after this? He doesn't give a flying fig about her, it's all about his needs, not hers.", "I don’t think help was the word they where looking for forced would have been better bc that’s what he was really trying to do", "Yeah, but he’s living in a horrible situation. I wouldn’t be able to have boxes taking up the majority of my living spaces for months. \n\nHe was wrong for burning stuff, but his wife was wrong for not listening to his repeated requests to clean up the mess.", ">Why a storage unit wasn’t an option idk\n\nPossibly finances. Storage units aren't free. Actually from my reading it sounds like they HAD a storage unit and they filled it up first, and the stuff in the house was the overflow, but \"storage room\" is ambiguous, I suppose.\n\n>it’s her HUSBAND the person who vowed to love and be there for her through the best and worst times so\n\nWhich is a romantic vow, but in the real world, it rarely holds up. Most people do not deal well with hoarding behavior, and a wedding vow doesn't magically change that. \n\nDon't get me wrong. What he did was wrong, too. Much worse than what she did. It was a terrible, terrible way to deal with the issue. But there *was* an issue.\n\n>and it’s not a shrine it’s boxes and it’s not like she said she plans to live like that forever all she asked for was time 6 months is not long term by any means either\n\nNeither of us know the people involved. What I do know, from my own experiences on both sides of the issue, is that when you're dealing with something you really don't want to deal with, six months becomes a year quite easily, which becomes two years quite easily, and so on. Hoarding behavior, regardless of it's motivation, very rarely clears up on it's own with time, because in a way it's actually a method of trying to exert control over or avoid dealing with loss. At six months, it does need to be addressed. Just not the way OP did it, not that way at all.", "I was very clear what he did was absolutely wrong.", "Yes absolutely! Help should have been force. Obviously his job is to support and comfort her, I just meant it’s not his job to make it happen sooner than she’s ready.", "You can rent storage space. You can have alternatives to destroying her last memories of her passed away mother.\n\nIt has been half a year and they had to empty the house and move things so probably not had those boxes for the entire period.\n\nHe chose to do it when she was at work because he knew she wouldn't approve or agree. It is not only -his- living space, it was hers too.", "I’m not saying he was right, but I’m pointing out that the wife was also somewhat wrong (not nearly as wrong as OP). He told her multiple times he was overwhelmed by the mess and she just ignored him.", "She is griefing and has communicated she is not ready to deal with it. She didn't ignore him. She asked him for more time! He didn't tell her - your time is up, I am burning it all. He actually planned to do it when she was away so she wouldn't able to do anything about it.", "Her communicating she’s not ready to deal with it is ignoring his request. I agree he was wrong with the way he went about it, but she was wrong for not figuring out another solution that didn’t negatively impact her husband, who has communicated he was overwhelmed and struggling with the mess.", "No, it isn't ignoring him. Her not being ready to deal with her grief is related only to her and her emotional pain from losing her mother and learning how to process it. It has nothing to do with him. And probably that's what was so infuriating to him that he would chose to destroy her connection like that just to \"clear some space\" \n\nHe was overwhelmed? She lost her only living family!", "Spoken from someone without empathy, just like OP. She communicated she is not ready. Next step is to get therapy or other outside help as opposed to planning a Bonfire to his Vanity. Marriage is a partnership, not a dictatorship.", "We’re going to have to agree to disagree with this. I could not live in the situation OP is describing, with boxes everywhere. It would take a horrible toll on my mental health. Yes, his wife is processing losing her mother, and yes, OP messed up in the way he went around it, but we also have to acknowledge that it’s OPs house too and he has the right to not live in utter chaos.", "I agree, and I have empathy for the wife. As stated later down this thread, living like OP has described for months would negatively impact my mental health, so I also understand OP feeling overwhelmed. \n\nI have stated multiple times OP was wrong for going behind his wife’s back and burning her mothers stuff. That is incredibly inappropriate. But I understand his frustration.", "Can we agree that he doesn't have the right to destroy his wife's belongings?"]}