{"id": 22037, "submission_id": "14xrq9h", "title": "AITA for not wanting to treat a meal after receiving a sum of money", "selftext": "Context: Asian household \n\nLet’s start from the beginning.\n\n I’m currently a student with a loan that I need to pay off after I graduate. Few months back I applied for a scholarship but received no email for an interview whatsoever so I thought I wasn’t shortlisted. To my surprise I was selected for a monetary award. It’s not a small sum so it’ll definitely be useful to save up since I do have that loan in place. \n\nNow here’s the thing, I told my family  about the good news and the first response I got was a request for a treat at a specific restaurant and it costs a good 25% of the award money. \n\nObviously I knew it was expensive and I don’t mind treating a meal that’s more affordable, but at that moment in time I decided to avoid the topic and not really reply back. After that interaction, I’ve been getting the silent treatment or being called stingy.\n\nAITA?", "created_utc": 1689175751, "permalink": "/r/AmItheAsshole/comments/14xrq9h/aita_for_not_wanting_to_treat_a_meal_after/", "score": 390, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I may be the asshole because I’m seem ungenerous towards my family.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Correct your family. They should be treating you as a celebration of you.\n\nYour sum of money is a scholarship.\n\nNta", "Now you know what your family is like.  Ridiculous expectations from them\n\nNever mention money in front of them ever again", "your family wants you to spend... scholarship money... on dinner for them? isn't *all* of it supposed to go towards your tuition/books/loans?", "NTA - Time to keep your mouth shut when it comes to money.", "Asian from a traditional Asian family here.\n\nOur cultures have a high sense of familial obligation, many times to a point of toxicity. And I’m sure you’ve experienced something like this throughout your life, but our families also like to use that familial obligation to guilt trip us into doing what they ask. But I will say that a large reason for this entitlement (even if it’s not okay) is because of our collectivist cultures, that because “it takes a village,” if one person is successful, we’re all successful and therefore should share in your (monetary) successes. Even if you did all the work. They think because they played a(n indirect) role in your success as your family they should partake in it. \n\nAlso this is scholarship money, something that’s technically supposed to be used for school & related expenses (even though most agencies won’t check what you use it for). They should understand that with how expensive school is, that you’d want to prioritize money toward that.\n\nIn the future, either don’t tell them the dollar amount or don’t tell them of things like this at all if you wouldn’t be able to withstand their bugging for more details. It’s easy to second guess yourself because you have so many people against you, but stand firm! You’re not alone and you’re doing the best thing for you.\n\nIf it isn’t obvious already, NTA.", "No, NTA.\n\nYou are thinking ahead and looking to be prepared for surprise expenses.\n\nYour family wants you to spend 25% of this award on a meal? What? That's insane. \n\nI would think that they should treat YOU for the award.", "NTA . tell them that the money is to pay for the student loan.", "NTA. Your family are AH's, just looking to mooch off you. If they were pleased, they would treat you, not the other way around.\n\nJust enjoy the silent treatment, and don't respond.", "NTA- stop telling your family and friends about your money from now on. Like never mention your finances again. No one should know what you make, what you have or are getting. No one should have access to your accounts. Get all the way grown and take charge of your life.", "No you’re not being stingy. I don’t tell my parents how much money I have for this exact reason", ">and it costs a good 25% of the award money.\n\nWow.  NTA definitely.\n\nPretty poor form by your parents to even suggest it.  The silent treatment and whinging is extremely childish too.  Parents who view their children as a meal ticket, in this case literally,  are not doing good parenting.", "NTA...That's not what the money is intended for.  Simply say no, or you will be used as a bank machine for the rest of your adult life.", "NTA\n\nIt's for schooling.  Period.  \n\nIt's an absolutely unacceptable request to spend any of that money.", "NTA, Good Heavens! That scholarship is for your education, a long term investment in your life. A fancy meal is a few hours of indulgence and a bit of showing off; when it is over, nothing is left but regrets. Treat your family when you have the stable income to do so.", "NTA\n\nDont spend your money for this!\n\nYour education is fare more importent as some food for your family.", "NTA - why would anyone expect you to spend scholarship money (aka money that is supposed to go toward school) on a fancy meal?? That’s pretty damn entitled of them", "NTA, but why not pay off the loan early, that will take all the pressure off. You received a scholarship for school, shouldn't the whole thing be used for school?", "NTA - You got the money to assist with your education, and thats where it should be going.  Now if you go and blow it on some random luxury item because \"Hey, free money\", you still wouldn't technically be an a-hole, but it would be more iffy lol", "NTA by my standards, but what do I know about your family's cultural expectations and customary behavior? I would think different \"Asian households\" would handle this differently? There are so many different Asian cultures. I can't tell from the context defined as \"Asian household\" whether their reaction to your reaction is culturally justified or they are particularly rude. For my money -- no pun intended -- their request for a super expensive treat is so presumptuous and greedy that ignoring and not addressing it seems like the mature way to go, silently but firmly setting a boundary. If it was my in-laws, I could definitely tell that this behavior supports my view of them as assholes.", "Asian here. \n\nThe scholarship is for you to use towards your studies.   \nMy family was happy for me when I got scholarships. I was treated to some bbq. \n\nAFTER I graduated and got a job, I treated my family to a very nice meal to celebrate and thank them for supporting me. I continue to do so with a steady income. \n\nNTA, your family should be ashamed of wanting to waste your scholarship money that you need.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nContext: Asian household \n\nLet’s start from the beginning.\n\n I’m currently a student with a loan that I need to pay off after I graduate. Few months back I applied for a scholarship but received no email for an interview whatsoever so I thought I wasn’t shortlisted. To my surprise I was selected for a monetary award. It’s not a small sum so it’ll definitely be useful to save up since I do have that loan in place. \n\nNow here’s the thing, I told my family  about the good news and the first response I got was a request for a treat at a specific restaurant and it costs a good 25% of the award money. \n\nObviously I knew it was expensive and I don’t mind treating a meal that’s more affordable, but at that moment in time I decided to avoid the topic and not really reply back. After that interaction, I’ve been getting the silent treatment or being called stingy.\n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA - ultimately it’s your money so you get to decide what to do with it.", "Payment towards a loan is a better use of the money than an expensive meal.\n\nNTA", "This is terrible, terrible behavior couched in a cultural context. It is not culture, it is a personal failing of your parents/family. For reference, American culture is permeated with overweening greed for a variety of reasons. Nevertheless, it is not the fault of American culture when people try to charge their guests to attend their wedding, that is terrible behavior within a larger cultural context. NTA. Pay off that loan. Do not buy them one goddam bread roll before it’s paid.", "Your family are a bunch of selfish AHs. NTA", "NTA. The money is for school, not a meal", "NTA\n\nare your parents willing to help pay for your loan once you graduate? It’s a lot easier to spend other people’s money than your own. This money is for school and if they aren’t helping you pay for school then that’s all you need to say", "NTA. Firstly, congrats! That's from me. That's the reaction your family should've had.\n\nSecondly, the scholarship might be earmarked for specific uses. Not spending a bunch of money on a restaurant.\n\nThirdly, your family is being ridiculous. Why should they be treated, especially when it's 25% (or maybe more) of what you received? They're asking for a luxury and trying to shame you.\n\nI would suggest you remember this for the future. Unfortunately, not all families are happy for their kids' successes and are trying to get a piece for themselves. I went through this in my own family.", "NTA. This isn't fun money, you earned it specifically to pay off a loan and no one else is entitled to your money. Let them be petty and ignore it.", "NTA.", "NTA I think spending 25% of the scholarship award goes against the spirit of the scholarship.\n\nIf you had been asked, \"How will you spend the money?\" An answer of, \"Well, I'll be spending 25% taking my family to a celebratory dinner,\" might have resulted in you not getting the scholarship.", "NTA.  Don't do it.  If you give in, then it'll turn into more and more requests.  \"Well, you agreed to the dinner, and this is a small request, so....\"  Nope.  Nip that in the bud.  That's your money for your schooling.  Not. Theirs.", "NTA. The money was given with the intention to help with your school fees. Not to treat your parents to a Michelin star dinner. They're the assholes not just to you, but the person who provided the scholarship. Very unethical. Imagine if you left money in your will or whatever to help a student in need and the family just blew it. You would have put the funds elsewhere.", "The funds are for your education, not your family. NTA unless you give in.", "Wow. It’s not like you won the lottery. You got a scholarship. Save your money and apply it to school. If they question you just let them know they disperse it directly to the school and not to you.", "NTA and don’t ever let them convince you otherwise. It can be hard to break them away from their cultural experiences and expectations, but just because that’s the case, does **NOT** mean that you need to fall for them too.", "NTA. Your family is ridiculous.  Enjoy the silent treatment.", "Thank you for that insight.", "NTA.  This is insane!  Why would you spend 25% of money you need for your education for a MEAL!  This money is not party money.  You need this money.  Asian household or not, do not spend this money on frivolous things such as a meal - not even an \"affordable\" one.  They should be taking YOU out to dinner for doing such a good job securing funds for your future.", "Absurd. That money is for school. Use it to pay off your loan or use it to pay for school. Don't use it to buy people dinner. NTA", "It's not a lottery winnings, it's a reduction of your debt. NTA", "NTA, but you need to educate your family immediately. This sum of money is not the result of a lottery ticket, this is a scholarship. It is intended for use toward your education, and any other use is incredibly unethical and tasteless. The request is absurd and totally irresponsible, and treating you coldly afterward is a very big red flag. Your family has exposed themselves, and you should be very careful about any mention of money in front of them in the future.\n\nIf anything, they should be treating you after this announcement, as a celebration of your accomplishment.", "Definitely NTAH. \nMy dude… that is so hurtful.\nI’m sorry. I hope they see how selfish that was to ask you that.", "A succulent Chinese meal???", "NTA but I don't think the Asian part is relevant? \n\nI'm Asian and my parents would never tell me to blow money meant for schooling on a meal. Yes, maybe you treat when it's a raise at your job or something but this isn't that.\n\nYou're not being stingy, you're being prudent.", "NTA. Funds are for education, not fancy meals.", "NTA They should be celebrating you.  Not you celebrating them.  Use the money for school and your loan, you have no obligation to treat them to anything.  But you should tell them.  They'll still be mad, but at least then you can say your piece about how the money wasn't awarded to you to treat them, but to use towards your future.", "NTA 25% of the scholarship award money?!? Are they having you fly them to a Maine lobster restaurant or something? ... whaaaaatttt in the world!", "NTA, that's money specifically for school. You're not treating anyone with it. Good luck in your studies!", "NTA. If I got a scholarship the first thing my parents would do is ask me to use it for my studies, to pay off student loans and fees and THEY would throw ME a treat. Not the other way round. You received scholarship for your education. You did not win a lottery and you are using your money to complete your education without debt. So you are in the clear.  \nEdit: My family and me are asians too", "Yeah, no. NTA don’t do it. That’s selfish af and moving forward don’t tel them about any money, grants, scholarships, loans that you get", "That’s crazy to ask that from a student! They should be taking you out to celebrate and paying for you! NTA.", "NTA,  what would be the point of taking them out.  You want to have it for you.  Don't take them out.", "the monetary award for for your education.  It wasn't to treat the family to an expensive  dinner.  You earned the it.  they didn't\n\nNTA", "INFO\n\n> the first response I got was a request for a treat\n\nWh... *what*? A *treat*? Who is your family, [Rami Malek](https://www.youtube.com/watch?v=TOq0dzxouts)?", "NTA. That is not free money. A lot place specifically (US) require the funds to be spent on school related items or living expenses. And is misused could be required to be repaid. Years ago I worked in student finance and was told a story about a student who fully admitted they used the loan and grant money on like band equipment (not a music major) or something similar and the loan servicer went after them. Not sure if it’s true.", "Nta, that's not what that money is for.", "Treat your family when you have the stable income to do so.", "Thank you! That reaction is yikes! \"Let's spend this other person's money meant for school on a meal that we'll shit out hours later!\"\n\nMetaphorically shitting out your money, OP. Don't do it", "Better yet, time to go LC at a minimum.\n\nETA:  My vote is NTA", "NTA. Scholarship money is for school. Unless they want to kick in….", "NTA.  This isn’t a random gift.  It’s meant to help offset your costs.", "NTA, this is a scholarship, to be used for education, not family dinner.", "cherish the silent treatment.   Hope it is extended for a long time.", "You didn't win a lottery, you won a scholarship for the purposes of pursing your academic goals. Spending it on an extravagant dinner would be like trying to blow your college fund on a trip to the Balkans instead, of you know,...college. \n\nNTA. Buy them a couple lemons and tell them to suck it.", "NTA I would address thdm. Because how are you upset at my scholarship fund? Why is an expensive restaurant more important then my education?", "NTA\n\noffer to cook for them/host them so they can see how you live and how inappropriate their request is. that money is for education", "NTA\n\nI'd just reply back with an offer to take everyone to Subway.", "NTA\n\nIf the money was intended as scholarship money, using it to throw a party at a fancy restaurant would be inappropriate.\n\nIf it wasn’t, it would be better put towards living expenses.\n\nIf you play your cards well now, you will have a good career that pays well and then you can treat people to fancy restaurants as often as you like. Blowing your money now may make that impossible", "NTA\n\nStop telling your family anything about money.", "NTA. How incredibly rude of them to invite themselves like that.\n\nOP: Great news, I've got a scholarship so I don't have to pay off this huge debt after I graduate.\n\nFamily: Cool, now spend a quarter of that money on something completely unnecessary and luxurious for us instead of your debt. And if you don't, we'll give you the silent treatment.\n\nThis is toxic behavior.", ">They should be treating you as a celebration of you.\n\nExactly. In Asian households, the eldest would generally treat the younger ones and not demand treat like they did from OP. \n\nAlso, a scholarship is for a specific cause. It is not the same as a salary hike. NTA, OP.", "Not only that, they want OP to spend 25% of the scholarship amount on this!\n\nThey are out to lunch (no pun intended, etc.)", "Some family are just leeches. A good chunk of my student loans were spent on bailing out my shitty family after being guilted to hell and back instead of taking care of my needs", "can't you get into trouble for something like that? isn't it fraud because someone else could've used it for their education and that was its intended purpose?", "It probably depends on the scholarship in question tbh, as well as any regulations in place at the university", "Weirdly most likely no. Scholarships typically have living expenses included in valid expenses. \nNow... is it a grey area If eating out and paying for others counts... oh yeah", "It depends on the type of scholarship and what specific terms are attached. Some scholarships allow you to spend the money freely on whatever you need or wish to. The only real contingent is that you have to prove you're enrolled in school to get the money. They probably expect that you're going to spend it on tuition or at least rent, food, transportation, etc., but they can't really dictate how you actually use the money. Once you've received the money, it's yours to do with as you wish. \n\nThere are scholarships that are specifically for tuition, but those are often paid out directly to the school to where the recipient is never actually in possession of the money.", "If this scholarship could pay off the loan or out a huge debt in it why would your family want you to waste 1/4 of it on a meal? That’s insane and so selfish", "NTA. You aren't entitled to your family's money. Sure you can be disappointed if someone wins the lottery and doesn't give you anything, but even then you'd be an asshole to expect anything.\n\nWhen someone gets a scholarship that helps pay towards costs so they can be less poor during their time as a student it's literally crazy to expect them to immediately waste a huge portion of it on a fancy meal. \n\nHave a little less stress about money over the next several years (more money while student, less debt after) or piss a chunk of it away on one meal. It's a no brainer.", "NTA.  School money is not restaurant money.  Is your family footing the rest of your bills or just weird?", "NTA. You're not being stingy; they're being a spendthrift.", "NTA. That money is scholarship money. Not I got lucky in Vegas money. It was given to you for a purpose and you are correct in using it for its intended purpose.", "NTA\n\nThe money was not for an expensive meal out. You would be better off paying off part of your loan. How crass of your family.", "Scholarship = used for school. If they want to celebrate you, it should be their treat. NTA.", "NTA. I hope you have learned that you cannot tell family anything about money.", "NTA- I feel like that's misappropriating funds. This money was intended for your education. You shouldn't have to put yourself into further debt to treat family to a meal.", "NTA\n\n\"You gots money? Wooo! TREAT US!!\"", "Definitely not, congrats on the fact that you intend to pay back your student loans and that you have a plan.", "NTA, but your family is.  You got a reward, and THEY are supposed to benefit?  That's a firm no.  Your reward is to be able to minimize your loan.\n\nDon't they understand how money works?", "NTA… who would have it in them to take all that money from their child? Who is a student..", "I have to say...I don't know if this has anything to do with an Asian household...your family's attitude might just be theirs, because using scholarship money toward a meal doesn't sound like a cultural value thing.\n\nNTA. I would say no. Even 25% of 1000 is 250 bucks and that's a lot for a meal without any reason (although not sure how big your award is or how many people it would be, but still...not a good use of scholarship money).", "In my country (Balkans) it is also common for the eldest members of the family to pay for a dinner or a celebration, let's say a Christmas dinner for example. But if somebody celebrates an accomplishment/ heritage/ retirement/ birthday etc, it is this person who pays for everyone.The person who celebrates treats the rest of the group. However, it is up to this person if he wants to do so and requesting for a treat is considered rude.\n\nEdited to add: NTA, as this is money given to you for your education, it's not a salary or something.", "That's what I'd be telling my greedy family anyways"]}