{"id": 22049, "submission_id": "14xwtkr", "title": "AITA for removing my non binary friend as bridesmaid?", "selftext": "[removed]", "created_utc": 1689187117, "permalink": "/r/AmItheAsshole/comments/14xwtkr/aita_for_removing_my_non_binary_friend_as/", "score": 26, "replies": ["Your post has been removed. \n\n#Do not repost this without [contacting the mods](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) for approval, including edited versions. Reposting without [explicit approval](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_can_i_repost_a_thread_you_removed.3F) will result in a ban.\n\nThis post violates Rule 12: This is Not a Debate Sub. Posts should focus strictly on actions in an interpersonal conflict, and not an individual's position on a broad social issue.\n\n[Rule 12 FAQs](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_rule_12.3A_this_is_not_a_debate_sub) ||| [Subreddit Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/)\n\n\n\n###Please ensure you have reviewed this message in full. We will not respond to PMs to individual mods. [Message the mods](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) with any questions. \n\n####Please visit r/findareddit to see if there's a more appropriate sub for your post.####", "Helen is an attention seeking drama queen regardless of identity.  They are making the event all about them and did it at another wedding.  I guarantee it will happen at yours.\n\nYou have bent over backwards to accommodate this person and they are throwing it in your face.\n\nNTA - I would probably rescind their invitation based on their behavior.", "Sounds bit like Helen was hoping to make the focus of the wedding about them instead of you and your partner.\n\nNTA", "So...your friend decided they were going to buy and wear a suit that didn't in any way match your wedding theme/color scheme? And they won't consider wearing a suit that does?\n\nNTA. They are trying to make your wedding about themself.", "NTA - like at all.\n\nThis is just entitled behaviour, even if you are their best friend of 7 years.\n\n1) This is YOUR wedding. The day should be about you, not them.\n\n2) While they are a baby-gay (someone who has recently found out they're LGBTQ+), I'd still expect a (I assume) 25+ y/o to not turn their newfound gender identity or sexuality into their entire personality, especially not when it's completely inappropriate timing (other people's weddings, jfc)\n\n3) just because they're now non-binary doesn't mean they can now act like a - and forgive my word choice here - complete and utter jerk (Ignoring your repeated inquiries, refusing to at least compromise as a bridesmaid - ESPECIALLY when you were already willing to accommodate them by agreeing that they could wear a suit instead)\n\nI hope you still have a joyful wedding, though :)", "yeah let's delete the whole non-binary issue temporarily\n\nBridesmaid insists on a BRIGHT orange dress or a MAROON dress--neither of which is your even close to your wedding colors?  Would this be acceptable for BM to insist on them?\n\nBridesmaid is recently divorced and insists you introduce BM as Ms. not Mrs. and reversion to maiden name not Married name.  okay sure.  BUT NOW BM expects you to chase down your guests to correct their mistakes on someone they either barely know or have never met before?  \n\nBM's agree to be in wedding party and wear the butt ugly color The bride chooses and often agrees to butt ugly design.  Because that's the joy of supporting Bride.\n\nBM can also wear a name tag with NAME and pronouns if they are SO worried they will be misgendered.  I do not have sympathy for friend at this point.   They are TRYING to make the wedding all about them.", "NTA\n\nHelen sounds exhausting and wanting to be the center pf attention at your Wedding, as well as a drama stirrer. Good riddance", "NTA you tried several times to please your friend. But the thing is, it’s YOUR wedding, and the fact that you found a suit for them but they said no, just goes to show they would probably be stubborn and ruin your big day anyways.  Hope your day is beautiful and drama free!! :)", "NTA, it's on them to choose pronouns and names, but it doesn't mean the whole world should bend around them coz of that. You tried to be understanding but you can't make the whole wedding about Helen. It does feel like they decided to change their pronouns just to get attention though", "NTA. Speaking as a non-binary person, Helen is being an asshole.", "Nta. As part of the wedding party you wear the colors the bride/groom choose. You were already doing the correct thing  accommodating by understanding Helen's choice of pronouns and masculine presentation and no dress or feminine attire. However hijacking the other wedding to livestteam their little rant was tacky as fuck.and wanting to hijack your wedding as their coming out party and expecting you to use your day to be celebrate the ninbinarystatus  and be the politically correct police against your guests. Not cool of Helen. Helen is apparently suffering main character syndrome and thinks every event and every occassion is about them. Helen  can go be triggered elsewhere in their orange suit and you can enjoy your wedding without catering to their narcisstic and self centred expectation that your wedding and the world revolves around  them.", "NTA- I really think you dodged a bullet. You definitely went out of your way to try and accommodate your friend. You should be able to enjoy your day and not worry about how a member of your bridal party is doing or if they misgendered. I can just see them live-streaming every little detail and complaining the whole time and causing a scene.", "NTA. You were allowing them to wear a suit instead of a dress, you just wanted it to match in color.  I don't think that's asking too much.  And asking the bride to police the guests all day, just no.", "NTA Being a part of the wedding party means you need to adhere to the color theme, your friend should have at least asked your permission before taking it upon themselves to buy a random color. \n\nIn the future, I would suggest Helen wear a pronoun pin or something similar to avoid misgendering.", "NTA This day is about you, not them.\n\nFirst of all, they should have spoken to you about these things before they bought a suit, so you could add your input. Instead, they went out and bought a suit that doesn't match anyone in your wedding party without talking to you first. Why? They're not being very understanding or willing to work with you and that's pretty selfish. \n\nSecond, they sound like they're high maintenance. I understand that they are non-binary and want to be called by the correct pronouns, but they can't expect you to go to every guest to correct them. That's just too much.\n\nIt sounds to me like they really never wanted to be in your wedding in the first place. They went about this in the wrong way. They should have told you in the beginning that this event would be too triggering and stressful, so you could have picked someone else right away.", "NTA. If they would be a true friend they would not behave like this. You are not losing a friendship. Unfortunately this person decided that everything needs to revolve around their non-binary coming out. A true friend would understand her role in this event. They said it would be too triggering... That's true, they are not able to handle not being in the spotlight. Let it be...", "NTA - Helen made their choice.", "They are an AH.", "Nope! NTA by a long shot!\n\nThis is YOUR wedding day, and Helen is trying to make the day all about HIM.\n\nYou dodged a bullet -- IMHO -- because how awful would it be to have Helen there making a scene at your wedding!\n\nIf it were me, I would leave Helen alone and let him come to you and apologize. And if he never does, well thats his loss.", "NTA. Don’t let anyone in your circle or beyond let you think any of your issues with them have to do with their new found non binary status or anything in that sphere.\n\nThey were ignoring your color choices completely.   You saw them behaving badly at another persons wedding.  They already said they fully expected to be the center of attention by being announced with their preferred names and pronouns…for what reason?  Anyone who doesn’t know them, would be introduced during cocktail hour small talk like anyone else.  They can tell who they’re directly speaking to how to address them.  \n\nThe kicker, and corker for me…..They expect you to run interference during your wedding for any perceived gaffes.  \n\nYeah, no.", "NTA if this story is true but it sound like the kind of thing conservatives make up to lampoon progressives.", "NTA. it doesn’t matter that they’re nonbinary, helen is expecting special accommodations to make your wedding about them.", "NTA\n\nJust the outfit issue:\nTake the nb part out, if they were female presenting and tried wearing a different colour dress as part of the bridal party, you would request them to pick another, pick one for them, or attend in any outfit but as a guest. And ghosting you is definitely not acceptable behaviour. \n\nPronouns:\nAbout pronouns, you can definitely step in if you are at the scene. At most, you can send a heads up to your family and friends that they should respect all your guests' pronouns. Some cultures don't get it (I'm from and in India, I know the general scene in this part of the world is not very accepting.) But you would have done your part and some of your guests would definitely be mindful. But on your wedding day, chasing people around is definitely not something anyone should be asking of you. \n\nWeddings being triggers:\nThis could be valid so they are allowed to make this point. But they should have had the basic decency to talk to you about their genuine concerns instead of bringing up the other issues. And sooner would have been better.\n\n(Edit: judgement)", "NTA. Helen is centring themselves in an event that isn’t about them. Making a literal announcement about their gender is so dang weird. \n\nPlus those suits sound ugly as hell but that’s just me.", "NTA - Helen sounds like the kind of person that insulting right-wing memes are made of, expecting special consideration, spotlight treatment, and permission to trample what you had planned for your wedding. You went over and above your obligation, searching suits that would match what would fit, keep them included despite their continually adding stress to an already stressful period in your life.\n\nThe day is about YOU AND YOUR NEW HUSBAND, not Helen and her new identity. The bridal party is intended to help share the burden of accomplishing a successful and fun party, yet Helen kept trying to make your day harder in multiple ways. It will likely hurt not to have your friend there, but your story makes this sound like a blessing in disguise.", "NTA\n\nYou tried to be more than accommodating. \nHelen could have at the very least picked a suit that matches your wedding colors. They don't like the colors? Though $#!+ It's YOUR WEDDING! And the entitlement of expecting you to announce them and run around correcting everyone. Wtf? They could correct people themselves. \n\nAnd ppl wonder why nobody wants anything to do with the LGBTQ community... because people like this give a bad rep. \n\nI appreciate you being progressive and accommodating. Sorry that Helen had to be so selfish and try to make your wedding about them...", "NTA Hellen doesn’t want to attend your wedding, they want your wedding to be Completely about them and the fact that they are a they/them.  \n\nAll eyes Must be on them at all times, which is the Only reason anyone not in a circus act would wear a orange suit.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n\nI (26F) am gettibg married in August. One of my bridesmaids is my best friend of 7 years Helen (26) Helen is gay and masc presenting. In May, when buying the bridesmaids dresses, Helen told me that they had already bought themselves an outfit for the wedding.\n\nHelen told me they were non binary and no longer ok with anything close to female presenting. They had bought a €500 3 piece maroon suit. It was lovely on them but didn't match the bridal party colours at all. So I searched for a suit that matched the dresses and that Helen would feel happy in.\n\nI found many suitable options, they were gender neutral but trendy. Helen left me on read for weeks, now it was mid June and I felt so stressed that Helens suit was not yet organised. I had to repeatedly message Helen about this and they were very aloof, saying they would look around thrift shops for a suit they liked and would bring it to me for approval. They added that they don't like any of the options I gave and said the colour I chose wasn't flattering for them. At this stage I was really annoyed, so I gave them a deadline by the end of the week. \n\nThe deadline came and went and no word from Helen until they attended a wedding in late June. Helen wore a bright orange suit. They spent the day live streaming on Instagram, complaining that the bride and groom weren't making enough time for them and were excluding them. Helen said they were misgendered a lot and that 'the experience was incredibly triggering.' They messaged me asking if they could wear that same orange suit to my wedding. I said no and that I was just going to pick a suit for them at this stage. \n\nThen Helen asked me to announce to my wedding guests their new name and pronouns. They also requested if they are misgendered that I come and correct the guest that does it. I replied that I am happy to introduce you with your preferred name and pronouns, however I can't be expected to chase around each of my guests on my wedding day in case they make a mistake. I have guests from many different countries and cultures and can't keep an eye on all of them (for context we are getting married in a Muslim country and many of my guests are from Eastern countries)\n\nThe next day Helen messages and said that they will either be wearing the maroon or orange suit. I replied that I want them to be comfortable but as they won't match the bridal party, they should step down as a bridesmaid. I got a curt reply to this where Helen said they understood. Later that day Helen messaged me saying they would no longer be coming to the wedding as they believe the day would be too 'triggering' for them. We haven't spoken since then. Am I the asshole here? \n\nTldr: my bridesmaid came out as non binary and I removed them as bridesmaid for not fitting the colour scheme. Aita?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > (1) I removed them as bridesmaid because (2) this might have been an overreaction and I could have worked harder to accomidate and include them in the day.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nNot by a long shot. Being non binary is not easy but it is also not an excuse to behave like an AH. You have been more than accommodating offering to find them another option to replace the dress and still be in the ceremony. We all have seen the bridezillas excluding friends because of tatoos, weight, high, hair color or any nonsense but not matching the color for the ceremony is a good enough reason to exclude someone.\n\nIt's your wedding, it's not about them. They seem to be the kind who need a lot of attention and can't even make an effort for you, on one of the most important days in your life.", "NTA Holy shit, talk about trying to make the entire day about THEM. Helen sounds exhausting. And self centered.", "I’m NB too and wow, Helen is absolutely TA here. They have no right to expect you to cater to them on your big day. You were perfectly reasonable by offering to find them a suit. NTA", "NTA\n\nI have no idea how Helen is managing to survive, especially in a predominantly religious country, as a non-binary person with this thin of skin. If Helen wants to wear a pin with “they/them” on it at the reception that’s fine, whatever, but I’m leaning towards thinking this is all attention-seeking since they would have probably stepped down from the very gendered role of “bridesmaid” if they were truly so sensitive.", "Nta\n\nThe problem solved itself there. They expect everyone to make everything about them, even when it's something that has nothing to do with them.", "NTA The day is not about them. It is ridiculous to expect you to spend your wedding day running around correcting people, and that's the cherry on top of their clothing demands.", "NTA.  You were totally fine with a suit, with them presenting masc and being a brides person not “maid”.  You just needed them to get the correct color.  A normal expectation put on every member of wedding party (and lesser extent guests have dress codes too). \n\nThey were being a uncommunicative AH.  I’d be relieved they aren’t coming.", "NTA, this is your wedding and Helen is trying to turn it into their coming out party lmao", "NTA - it’s your wedding. You don’t have to cater to someone no matter the circumstance. \n\nThat being said, the fact that your friend doesn’t want to comply with your options and ignored you when you were trying to meet them in the middle, just goes to prove they are not a good friend to you. Be careful who you surround yourself with.", "NTA\n\nYour wedding is not their coming out celebration.", "It is a difficult scenario as I really wanted to make them comfortable and have felt my friends pretty divided and some even thinking its homophobic. I feel I've lost a friendship over this and am debating if I was too harsh.", "Sounds like Helen wanted them to get married at “her” party.", "Thank you for your perspective, I feel the entire situation has now become a gender issue. I didn't want them not to attend at all, I am hurt they're not coming but I can understand maybe this is all new to them and a scary scenario.", "there's such a thing--I learn something NEW every day!", "*them", "I wish it was made up. After everything I just had to laugh at the ridiculousness of it all. Helen and I did meet at an intersectional feminism course in uni in Europe, so I guess I should have seen something like this coming.", "Nope, you're fine. Helen refused to compromise. They chose to end the friendship. Regrettable, but you can't cater to their extreme demands.", "Having an argument with someone who happens to be \n queer =/= being homophobic.\n\nNTA btw. You really tried.", "dont misgender someone just because you dont like them.", "Why are you a bigot? OP isn't. NTA", "As a trans man, this is decidedly not a gender issue. It's personal taste. If you've agreed to be a part of a bridal party you do give up a little bit of your own personal style and taste. They had to have known that going into this. You are trying to be cooperative. It's one thing to wish to be properly gendered and wear something comfortable to a wedding. It's another to think your opinions on color and taste trump the bride's at her own wedding. It's okay if they're struggling to navigate an identity that's new to others, you are kind to want to help them, but you are not a bad person for not wanting to sacrifice the vision of your wedding because they're in a difficult and very emotional place.", "Ha ha. One of my best friends is a gay man, and we always joke about it. I once accidently pushed him down the stairs, (don't ask, you had to be there) and he started, jokingly yelling \"hate crime\", I said it's not a hate crime if the person is being an asshole. It's just plain old assault."]}