{"id": 22102, "submission_id": "14yiy9d", "title": "AITA for refusing to change my plans?", "selftext": "I have been getting pretty burnt out from work and I've noticed myself getting tired a lot quicker and having barely energy. I needed a day to myself to just relax, watch netflix, read, play video games etc and not leave the apartment. Last Saturday I told my gf that that's what I would be doing on the Sunday since we had no plans.\n\nWhen we woke up Sunday morning, my gf asked if we could go out for the day. I refused and told her she knew what I had planned for today. She just said she needs it for her mental health because she's feeling quite low. Since we were both off work on the Monday I mentioned that we could go out for the day on Monday. She refused and asked if I could do my plans on Monday. I told her no because I made these plans first.\n\nShe mentioned again that she needed it for her mental health and I just asked what about my mental health. I mentioned that she knew I had planned to relax because I was burnt out so why is my mental health less important than hers. She just said that's not what she was saying but that she needs to get out for the day so I told her I'm not stopping her going anywhere. I pointed out she could ask a friend to go or go on her own but that I won't be going today.\n\nShe said I was being unfair to her because I knew she struggles with mental health issues but I just repeated that her mental health doesn't automatically come before mine and she knew about the plans I made. AITA for refusing to change my plans?", "created_utc": 1689249692, "permalink": "/r/AmItheAsshole/comments/14yiy9d/aita_for_refusing_to_change_my_plans/", "score": 4056, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Made plans to stay at home all day to realx since I was burnt out\n\nOne the day I had planned to stay in my partner ased if we could go out for the day because she was feeling low because of her mental health. When I refused she said I should be fine moving the day I had planned because she was struggling with her mental health\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA - She's asking you to put her mental health before yours. You wanted time alone to chill, she wants to go out and do something, which she could do alone or with a friend or relative, but she's insisting that you have to do it. That's unreasonable. \n\nYou both recharge in different ways and she should respect that.  And you offered to do it another day, so no, you're not the asshole.", "NTA \n\nI completely get that level of burnout and needing to decompress, I need those days and tell my wife 2, 3 days in advance that I need this day to unwind. She's happy to be lazy sometimes if not she'll go see some friends or family or get her nails done whatever, you don't have to do everything together all the time.\n\nShe'll invite me or ask if I'd like to do something but there is zero expectation and more she's just seeing if I changed my mind which sometimes I do. \n\nLook after your health and well being OP and encourage your partner to do the same", "NTA\n\nYou'd made your plans to relax at home on Sunday very clear and explained that you were burnt out and needed this to improve your mental state.\n\nWhen she decided she needed to go out, you offered her the option to push it to Monday. That's a very reasonable compromise, and only a day later. \n\nShe seems to think that her desires and needs (whether related to mental health or not) trump yours and that's a bit of a worrying trait in a long term partner.", "NTA\nYou communicated your plans beforehand  and offered her a decent alternative for what she suggested.", "You made a boundary. You communicated it clearly.  A decent person would accept this without question. \n\nThe rest is just ‘noise’. \n\nNTA.", "NTA, its her bad that she can't do her mental health by herself. You gave her a solution, she wanted instant gratification, life doesn't work that way.", "INFO: When you have conflicting wants/needs like this, does one of you usually get what they want/need while the other accommodates them, or do you tend to split conflicts pretty evenly?", "You are SO NTA. You stated your needs clearly and your gf shat all over them. She doesn't care about your mental health, only her own. You gave her clear options, but it seems that she expects you to be her only option and doesn't care what it costs you.", "NTA is she always in capable of doing things alone? Does she always want to be prioritized over you? Or is this a one off? If you communicated your plans that should be enough. I sometimes will come over unplanned(I always ask first) my partner but I don’t try and change his plans.", "INFO: is there a reason she can't go without you? Like, is she disabled, or can't drive and there's no taxi service in your area or what?", "NAH \n\nSeems like you both just had a different perspective on what you wanted your day to look like & how you relax. Either go to your own things or split the day so everyone gets a little bit of what they want.", "[deleted]", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI have been getting pretty burnt out from work and I've noticed myself getting tired a lot quicker and having barely energy. I needed a day to myself to just relax, watch netflix, read, play video games etc and not leave the apartment. Last Saturday I told my gf that that's what I would be doing on the Sunday since we had no plans.  \nWhen we woke up Sunday morning, my gf asked if we could go out for the day. I refused and told her she knew what I had planned for today. She just said she needs it for her mental health because she's feeling quite low. Since we were both off work on the Monday I mentioned that we could go out for the day on Monday. She refused and asked if I could do my plans on Monday. I told her no because I made these plans first.  \nShe mentioned again that she needed it for her mental health and I just asked what about my mental health. I mentioned that she knew I had planned to relax because I was burnt out so why is my mental health less important than hers. She just said that's not what she was saying but that she needs to get out for the day so I told her I'm not stopping her going anywhere. I pointed out she could ask a friend to go or go on her own but that I won't be going today.  \nShe said I was being unfair to her because I knew she struggles with mental health issues but I just repeated that her mental health doesn't automatically come before mine and she knew about the plans I made. AITA for refusing to change my plans?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA\n\nYou already told her in advance that you wanted a day for yourself.  She should respect that.  She could ask her friend to go out with or go on her own.  You even told her that you both will go out together on Monday.  I suspect that she's jealous and is trying to take your day away from you and wants it to be her, her, her.  \n\nYou both need to keep communicating even though you have been communicated with her often.  She needs to learn to keep communication open.", "NTA. You need to put your own health first.", "NTA. My husband works at an office, I work from home. On the weekends he exercises in the mornings and then likes to rest, eat, catch up on tv shows. I sometimes excuse myself for a few hours to get my dose of social interaction and then I join him back at home. Everybody has needs and they’re not always the same, the key word here is respect. And adults don’t need to be attached at the hip either.", "NTA- She could have gone out alone.", "She's trying to control you.  RED FLAG ALERT", "NTA\nIt seems like she sees your \"rest and recharge\" day as \"not doing anything\" that she can schedule for you at her whim.\nHer using \"mental health\" as her reason for \"needing\" you to sacrifice your plans for hers seems manipulative. Rather than accepting your decision and explanation, she's made it a power struggle over who controls your time.", "I agree so much with this. OP made a boundary to have his needs met. Anyone who challenges or argues against that is disrespectful of that boundary.", "I was thinking along these lines. \n\nIf this is a pattern, it could be to do with control or attention or making you prove you value her? \n\nThe one day you need for your MH and suddenly she comes in wanting you to go out with her for her MH….sounds off.", "No there's no reason. Neither of us drive so we'd have been getting the train and no shes not disabled", "What do you mean we had a different perspective? I communicated to my gf that I would be using the full day to relax and recharge as I was burnt out and then when the day came she expected me to cancel it because she wanted to go out. That isn't a different perspective, it's just expecting me to cancel my plans", "Me having a day to relax and recharge is a plan. Why is it my job to be flexible and not my partner? There is nothing she wanted to so on Sunday that could not have been done on the Monday so why is it different?", "For people that need alone time to recuperate these are definitely 'plans'. 'Going out' is not a clear plan either, no reason why it can't be done the next day like he suggested.\nHe clearly stated his plans for that day beforehand, which trumps her last minute idea to do something.", ">\"watching netflix and playing video games\" are not \"plans.\"\n\nBro his plan is to do whatever the hell he wants to do. His plan is to do the things he wants to do for himself. His plan is literally to stay home and relax, how is that not a plan?", "Seriously? He needs to be more flexible? He's exhausted and offered multiple compromises-- either she goes alone or with a friend, or they can go together Monday-- while she's offering none. NTA in the slightest.", "What? Planning to relax is 100% plans. GF can also be more flexible. If I had been looking foward to doing nothing for a day all week and my partner knew that, then asked me to do something instead, sticking to my original plans is not being an ah. GF can ask a friend to do something if she needs to get outta the house so bad, and op is NOT responsible for her mental health, nor does he need to prioritize hers above his. OP is NTA. GF is manipulative!", "NTA. She doesn't seem to care about your health at all, or she wouldn't be demanding you to jump at her will to serve her instead of letting you rest. You offered to go out with her the day after, so she can either take that offer or go out with someone else or by herself on that day. She could even go out both days!", ".... you needed to stay home & she needed to get out of the house to relax & recharge. That’s just a different perspective of how to manage your needs.", "Yes but when I've already communicated what I need then my gf should accept that instead of thinking her needs come first. I suggested she go on her own or with friends but she was adamant that I cancel my plans", "That's not a different perspective, that's having different needs.", "You both thought your needs should come first .... it’s possible for 2 people to be burnt out & need different things to help them cope. \n\nI’m guessing you feel very strongly that you’re right & she’s wrong. Since you don’t actually explain what your gf was going through at the moment.... I don’t think anyone can judge her. Was it a reasonable request? I have no clue. That’s why I don’t think either of you are ah. \n\nInstead of pointing fingers at each other perhaps you should have a conversation about how to better manage this type of situation in the future.\n\nIf this is an ongoing issue then maybe you’re not compatible as a couple.", "She just said she was feeling low so there's nothing I can explain about what she was gonig throguh beause that's all she would say.", "I don’t think you’re an ah but .... if my husband really needed me to help him get through some struggles I would probably just change my plans to the best of my ability. After 31 years of marriage I can tell you compromise is a healthy relationship tool. But if neither of you are feeling your best I can totally understand why this turned into an issue. \n\nIf she just doesn’t believe you get a day to relax then that’s just ridiculous. You should talk about what happened from each of your perspectives. Why was it important that it happen the exact way you wanted it to happen? Sometimes people in relationships just annoy each other.... it happens. Often. \n\nHopefully you’re both feeling better", "\"I need this for my mental health\"\n\n\"And I need this for my mental health, why is yours more important\"\n\n\".....but my mental health!!!\"\n\nI'm sorry you're burnt out but this needs to be addressed immediately. This is not a topic to put off until a later date. She needs to be sat down and asked why her mental health is expected to take priority. No more just brushing the question off to get to her demands, she needs to answer that question. NTA\n\nEdit: I didn't think I'd have to put a disclaimer on this but don't approach this when either of you are still heated. Give some space to calm down and then sit down and talk this out. But don't put it off for days/weeks. This is too important of a topic to put on the back burner or else it'll just keep happening over and over until it becomes a huge blow up.", "NTA... she can go out .\n\nWhat is this new mental health card? Is it like a book of tokens? A get out of jail free card? \n\nIt's just a new way to manipulate at an old game. Yes, we have different needs and we can mention what would make us happy, but we dont demand it at the cost of the other person's wellbeing.", "NTA - She knew your plans and is asking you to sacrifice your mental health so her mental health prospers. It sounds like she's co-dependent and needs to have more hobbies of her own. She also could've waited until Monday if you were both off.\n\nI would have a serious discussion with her, because I have a feeling she will unfairly resent you for not adhering to her plans. If this is a constant thing, then I would reconsider the relationship.", "NTA and I’d be looking long and hard at someone who put their needs ahead of mine when I’d stated my intentions with plenty of time for them to adjust to what they needed. I tell my husband regularly-I am not leaving the house unless a fireman has me in their arms! It’s necessary and you were well within your rights!", "NTA - gf has a lot of growing up to do.  \n\nShe is very dependant on this relationship.  She needs to be an individual first before considering being in a couple.  I'd be allergic to this kind of clinging", "NTA - It's okay for you to do your own things sometimes. Scheduling a day to relax is still a plan and she doesn't get to just override it because she wants to. It sounds like you communicated this early as well. This is on her for being the sore person here, not you.", "Nta\n\nIt seems like she's TA here for either trying a power move on you or just putting your mental health second.", "NTA. Although it may not seem like a big issue in the grand scheme of things, it is concerning that your girlfriend is completely disregarding your mental health in order to prioritise her own. I hope that this is a one time thing and doesn’t crop up elsewhere.\n\nYou made her aware of your plans with more than enough notice, and offered solutions such as going out the following day, or her meeting up with a friend. You were willing to hear her out, but she wasn’t with you.\n\nBoth of your needs are just as important, but you scheduled yours in first. That’s all there should be to it.", "Why couldn't your gf go out for a walk herself and you stay in? Like, I'm in the exact same situation with my partner and if we both had different needs (which we often do) then we're not joined at the hip and could just do our respective things.", "NTA. Is your girlfriend one of those people that can't stand seeing someone else sitting around for 5 minutes without finding something for them to do? Sounds like less of a mental health thing and more of a I don't like seeing you being \"lazy\"", "NTA she is asking you to put her mental health before your own that is a huge red flag! There is no reason you can’t have your day to relax and she can go out and have her day out.", "NTA\n\nMighty convenient that she waited till that morning to suddenly need to go out for her mental health and drag you along. \n\nYou already made plans. She knew about them. She can go out by herself.", "NTA and big red flag right here. Resorting to trying to get her way by saying “but my mental health!” and ignoring your mental health is a sign of a narcissist. I know you’re not asking about breaking up, but think about how she is going to try and manipulate you in the future like this again.", "NTA. It's troubling that she knew about your plans in advance and still tried to prioritize her needs over yours. It's like she did it on purpose. You two may need to work on whatever that underlying issue is to have a healthy relationship.", "NTA, this is very serious in my eyes, I'd suggest a long talk about boundaries and self-preservation and even some therapy for both of you individually. Unfortunately, if she refuses to accept that you put yourself first, you gotta make some hard decisions.", "NTA. Stay firm on your boundaries and don’t let her get away when crap like that", "NTA - I’m glad to see you stuck to your boundaries", "NTA- and maybe time for some reflection? Does your GF consistently try and undermine your mental health, and use hers as a way to get what she wants?", "The fact that you think you might be an asshole for wanting to practice self care is pretty alarming.  Does she regularly not acknowledge that your feelings/needs matter?", "Codependent much?", "NAH. Sometimes everyone is burnt out. And the less mental energy we have, the harder it is to spend it on others and seeing their perspective. I’m sure normally you’d have no issue taking her out, but on this day you didn’t have it in you to do so. Just like on other days I’m sure she could have understood that and left you alone or made other plans. It sounds like you both need a break and being kind to each other can be hard when you’re both in that state of mind.", "I would not call either of you AHs. I would say you both need to learn to compromise more. Neither of you is wrong or right in this circumstance. If you can't learn to compromise with each other then it will be impossible to build an enduring relationship.", "You are not important.  You should realize this.  What she wants is the priority because she is the princess.  We ALL struggle with issues.   Who doesn't?", "Lol, NTA, but wait until you’re married. I can’t even get stuff down around the house because my wife has something planned every weekend.", "How old are you both, and how long have you been together?", "NAH", "Oh ffs.  Why is your mental health more important than mine?  No, why is yours more important than *mine*.  Jesus Krispies what a joke.  Who cares who declared their plans hours ahead of the other.  Just decide amongst yourselves, like adults, which day is which.  Rock paper scissors if you have to.  If you can't bother with each other's needs why are you even together?  ESH", "You both sound bratty, tbh. Why couldn't you switch your plans to Monday? What difference does it make?", "[deleted]", "Was she wrong to ask you the same morning when you’ve had planned beforehand? Absolutely, but it seems like you’re standing firm just to make a point… I call this 49% NTA and 51% YTA.", "NTA if her mental health is prohibiting her from doing something without you there, she needs to respect your position. It sounds exhausting.", "Nta.", "NTA. She's a grown up and quite capable of going out on her own.   \n\n\nAnd having no plans is having plans.", "NTA\n\nBeing girlfriend and boyfriend doesn't mean you're attached to the hip. You can both have your mental health day. You can stay in, and she can go out. You don't need to do it together.\n\nThis shouldn't be a conflict but your girlfriend is making it into one.", "NTA from experience I can say burn out can really wear on you and some days you just need that rest. It isn't your job to be going out every day even if it is your girlfriend.", "NTA. You and your mental health matter too. You offered reasonable alternatives, at that point she was being capricious for wanting YOUR presence in particular. She could've gone out with her friend Sunday and you on Monday. There needs to be a compromise.", "NTA, she clearly DOES think her mental health is more important than yours, she insisted in how her own plans that would make her feel better are more important. Good for you for prioritizing your health. Hope you feel better soon.", "No nta. Why should her mental health be more important than yours", "NTA. You told her before Sunday. You explain again, but her actions show she thinks her mental health is more important than yours.", "NTA", "Nta, she can go do her things without you", "NTA.  If she wanted a day trip so badly and you weren't up for it, she should stop nagging you and make plans with a friend.  You said you were going to spend the day chilling at home, if she wanted more activity than that, then that's on her to find a solution that didn't involve you.  This has nothing to do with mental health of anyone, it's about making choices for yourself.  If her mental health issues are getting out of hand, she needs to discuss this with her therapist.\nWork was killing me too, but I had the opportunity to retire early.  Browse info about new career options while you're relaxing.  My 30 year old son got fed up with his job and is now in training to be a train conductor.  You don't have to stay in a job that's burning you out.  Look for a new job, go to trade school, look at certificate options at community college.  Some community colleges offer aptitude tests and can help guide you to a new career.", "NTA. If you had gone out with her on Sunday, she would have suddenly needed you to go out with her on Monday.\n\nShe had prior knowledge of your plans and tried to ruin them day off to fuck with you.", "NTA people recharge in different ways. You should both just take the day to do your own thing. You didn’t ask her to stay home with you so why do you need to go out with her? I don’t understand why she can’t go out by herself?", "NTA", "NTA", "NTA\n\nIs she not capable of being out in the world alone or entertaining herself? \n\nYou are not her therapy dog. \n\nThe way she is using “mental health” is very manipulative. You have some fairly large issues going on with her, and needing downtime is definitely not one of them.", "NTA , she is straight up telling you that her beeds are nore important. And she cannot go out without you? Why?", "NTA.  You offered a compromise and she said no,   and also like you said she could out with family or friends.", "NTA.  You made plans, and communicated those plans with your partner in advance.  Her deciding day-of that she also needs a day, and somehow her needs trump yours, make her an asshole.  Shit like this is why men struggle so much with mental health - we're always told it isn't as important as our partners.", "NTA. Weird power play attempt by your lady. Stay strong, she’s being unreasonable. Enjoy your relaxing day!", "NTA. Why couldn’t she just go out on her own and let you rest?", "NTA, she could have gone by herself or ask a friend.", "NTA: You need that time. She could go out on her own or wait until Monday.", "Me and my gf do this every other weekend we call it pyjama day. If you work full time waking up and knowing you get to chill all day after a busy week is a great feeling \n\nNTA btw", "NTA You offered different compromises like she can go out with you the next day or with anybody else this day. You're right: her mental health is not more important than yours.", "NTA", "Major NTA. You expressed in advance your plans for the day. Suddenly that day arrives and she needs to be out and with you? Nope. Her decompression time absolutely does not trump yours, nor should she expect it to. \n\nThis is a bigger conversation, I think. She won’t change this type of needy behavior without a serious chat.", "NTA. Nobody is stopping GF from going out.", "It's fine to have mental health problems and communicate them, but it is not OK to make them someone else's problem. If she needs to go out for the day, she can do so by herself, or choose a day when you don't have anything else planned. NTA", "NTA. Op, it’s time to have a sit-down with your gf and talk about reciprocal empathy and support. Being a partner and respecting her mental health does not mean ignoring yours to prioritize hers, or tending to hers at the expense of yours. Fairness is not one-sided.", "Sounds exhausting", "NTA", "NTA. Your gf is displaying a level of co-dependency on you that isn’t fair nor healthy. It’s not a reasonable expectation to rely on only your partner to get needs met. Ideally she should feel secure enough to go out without you. If she has difficulties with this, if you have the option to go to therapy together, I highly recommend it.", "NTA - your gf is suffering from a case of \"I can do that to you, but you can't do that to me\".", " NTA. Your mental health is just as important as hers, and you had already communicated your plans for the day in advance. Many people think that resting is simply laziness, but it is important to listen to our bodies and give them what they need when they need it. Resting when needed (not talking about days-long depression sleeping here) is a productive activity because you are actively taking care of yourself in that moment. If she was in such need of going out for the day for her own mental health, then she could have invited a friend out or just gone out solo instead.", "NTA,\n\n but I would suggest to consult for your ongoing depression/burnout", "NTA - why can’t she go out and do something by herself?", "NTA at all.", "NTA. She sounds selfish and maybe a little immature. Stick to your relaxing day hun. And if she ruins it, have a relaxing Monday as well!", "NTA.\n\nYou know what we do when one person wants to go chase dopamine by going bargain hunting in supermarkets and the other one finds that activity exhausting and dopamine-draining? That's right, the dopamine chaser goes on their bargain hunt alone while the other one stays at home. That way we both get what we need. Because we're adults who can do things by ourselves now and then.", "NTA to put this in a physical analogy, its like you've each got a broken leg, she's asked you to rub her errands because her leg is broken and when you've suggested \"Could you use a delivery service or ask a friend who doesn't currently have a broken leg to run your errands?\" She's responded by complaining that you don't care that her leg is broken. It's ridiculous", "NTA. You can do things separately. It would really annoy me if my SO couldn't get up and out and do their own thing without me.", "NTA. She needs to learn to be on her own and have more respect for your needs. It sounds like she was pushing you to give in and using her mental health as a manipulation tactic. I feel bad for you :/", "I had a partner like this. Always trying to get me to go out to appease her. Apparently she was incapable of doing her own thing. Drove me crazy. I often would oblige but I slowly grew resentful my needs weren’t being respected or considered, despite repeatedly and politely expressing them. I also grew exhausted because I work full time and like to have one day a week (just one!) to lay low around home, it’s how I like to recharge and prep for the next week. Needless to say that relationship wasn’t meant to be. NTA", "NTA. Sounds like she took what you said about needing time for you, and tried to twist it into being all about her instead. You are 100% right in your response and I am baffled that she convinced herself you would be ok with doing the exact opposite of what you planned and then claimed “mental health” like it’s a magic word to use against you. She’s gaslighting you OP", "NTA\n\nShe literally can do things without you. You aren't responsible for her mental health. She is.", "NTA for recognizing that you needed a break. Boundaries can be set without it being a competition though and you took the bait your gf was setting out and helped turn it into a conflict. “I’m feeling burnt out and my plans were to stay in. I let you know yesterday this was the plan and you are free to do as you like.” Done, that’s the boundary, nothing else to be said.", "Say you gave in and went out on Sunday and then on Monday she wanted to do something then as well would she expect you to do that as well. No keep your boundaries you are as important as she is.", "NTA providing she is not a child there is absolutely no reason she can’t go out by herself. I’m married and do it all the time. Too much time spent together is not always a good thing. Plus you offered to spend the day with her on Monday.", "NTA. You compromised by proposing same thing on Monday. How did she compromised?", "I really don’t see why this had to be an either/or situation. You gave her options: do it tomorrow, go with someone else. She wasn’t willing to compromise at all, AND didn’t seem to have any concern for you! NTA", "NTA.\n\nTime to end the relationship, your GF doesn’t care that you need to do something for your mental health.  And the fact that she didn’t want to go out by herself or with a friend means that it wasn’t her mental health that needed you to go with her, it was her wallet.", "You know what the flight attendant tells you to do if the oxygen masks drop? Put your oxygen mask on first. You can't help others if you can't breathe.\nEdit to add NTA", "NTA, your gf must be used to getting her way. She should also not be guilting you with her mental health issues.", "She's making it pretty clear where she thinks your needs stand in relation to your responsibilities towards her. But you do not need to participate in her mistaken beliefs. It seems to me like you opted out in a polite and caring way, even going so far as to offer alternatives. So, NTA", "NTA.\n\nThis is sadly a very common issue in relationships.  You are entitled to some time to relax and rest and no one is entitled to just take your time from you.  Chances are that you feel so burned out becuase every time you do have some disposable time it gets absorbed into meeting her needs.  \n\nLike seriously, its a meme that some women just can't stand seeing their partner sit on a couch or sleep late.  As you say there are tonnes of options, you aren't responsible for her entertainment.  Set a clear boundary and stick to it.", "INFO \n\nIf you had Monday off why couldn’t you compromise and have your mental health the next day?  I understand your need for it,  but there’s times to pick and choose what you can do and if you had the extra day off you could have done both? \n\nDid you already have Monday plans?", "I can’t stand people who constantly use the term “mental health” in order to get their way and your girlfriend sounds exactly like that kind of person. She tried to force you to do what she wanted by invoking “mental health” regardless of what you thought. And lets be real, chances are she was just a bit bored that day and really wanted to go out with you. That’s normal, framing it as a mental health issue to force others to bend over for her is gross.\n\nI don’t want to feed into the cliche of this sub always telling people to break up or divorce immediately but if I was you, I’d probably do just that. Like I said, can’t stand people like that.", "Welcome to the world of introverts... where you're plans for doing nothing don't count for anything and Must! Be! Filled!\n\nI don't dispute that she needs outside stimulation for her mental health, but she doesn't get to walk all over your equally important needs. You mentioned the obvious solution, that she go out with someone else or alone. \n\nNTA", "NTA. You had plans.", "\"I mentioned that she knew I had planned to relax because I was burnt out so why is my mental health less important than hers. She just said that's not what she was saying\"  That's exactly what she is saying!  NTA.", "NTA. I genuinely don’t understand adults who can’t go do things alone.", "NTA", "NTA. Your gf is using mental health in a lame attempt to manipulate and guilt-trip you to do something you don’t want to do. You told her you’re staying in. She doesn’t want to stay in. Good for you for not giving in and standing your ground. Does your gf have no friends? Why is it so hard for her to go out of the apartment without you? She sounds annoyingly insufferable and disrespectful and I hope she realizes the world doesn’t revolve around her. Are you happy in your relationship? You really need to think about if you want to continue being in a relationship with her. She sounds like a horribly entitled person who doesn’t take your needs/wants into consideration at all. It’s about her all of the time. It would start to get old really quick.", "NTA\n\n\"Yes, your mental health matters. That's why I suggested tomorrow. Why do you want me to risk my peace of mind changing my plans I've already had for days, to take care of you at the drop of a hat? You can't wait, but now I have to?\"", "I have this same issue with my bf. He needs his days off and likes to stay at home and I like to go to trips. I respect his being alone and when he is feeling like it we are going together out, otherwise I am going alone. I really appreciate every time he is going out with me because I know he is doing it for me.", "NTA. \n\nShe wants you to put her mental health before your own, and that’s insanely selfish.", "You👏are👏not👏responsible 👏for👏your👏partner's👏mental👏health! \n\nIt's exhausting seeing this crap all the time. People feeling sucked in and pressured to deny their own needs in order to take care of their mate. You gotta put your oxygen mask on first. You can't help other people out of you can't breathe yourself.", "NTA even if you were to change your mind you would be resentful and both of you would likely come back from the day out annoyed with each other and very much not relaxed. Enjoy your day to yourself and hope you feel more chilled 😎 as a result.", "Recently broke up with a girl who would do this type of thing all the time, her reasons and feeling are always more important. She would get mad at me for going to sleep at a reasonable time every night, and not staying up to drink with her. You're NTA", "NTA \n\nAt the end of the day everyone is responsible for their own mental health and yours is just as important as hers. \n\nYou aren’t hindering her from going you just won’t be able to go as well.", "NTA you told her in advance and she wanted you to change your plans to accommodate what she wanted to do.  You were correct that it could be done Monday.  I have to ask if she's always like this or was this a one-off.", "NTA", "NTA", "So OP’s gf is giving the, “I’m not saying my mental health is more important than yours, but I expect my mental health to be more important than yours” treatment?", "NTA", "NTA, she can deny it all she wants, she *is* telling you that her mental health is more important than yours. I can't imagine why it has to be you who accompanies you instead of a friend unless it's some kind of test or powerplay, neither of which are acceptable.", "NTA - Fair is fair, my guy.", "NTA. You mental health matters too.", "It seems almost deliberate the way she insisted that she needed to go out the specific day OP set aside for rest and tried to use her mental health as emotional leverage. \n\nThe fact that she continued to push back, is, I agree, worrying. I think OP should keep an eye out for this pattern going forward.", "I feel bad for OP. Now they're probably going to be stressing about this and their gf instead of unwinding like they planned and needed. NTA for sure.", "you’re not her emotional support animal, you have your own needs, you told her your plans, you told her your reasons, she doesn’t get to put you in her purse and drag you out because “mental health”. you’re a person. she’s a grown up, she can go outside without supervision. (tbh it kind of sounds like you both could use some better communication skills, saying i need this for my mental health is… kind of overdramatic. you’re tired, you want to stay in. she’s bored, she wants to go out. it doesn’t need to be that deep, and even if she pulls the mental health card being tired and not wanting to go out is still a perfectly valid reason not to go with her. mental health is not a trump card, and it’s not a get out of jail free card. idk, i think maybe it’s my own history that’s making this rub me so wrong, but. it bugs me.) nta.", "This is very well said!", "Yes! And why can’t she just go out on her own or with girlfriends????", "But, but, thAt'S nOt wHaT ShE WAs sAYiNg!", "agree", "I agree NTA but I do think a compromise would be better than a flat out no. If my partner asked this of me I would want him to feel as well as myself. I feel really bad if he's feeling anxious/low. I want the absolute best for him.", "I agree NTA but I do think a compromise would be better than a flat out no. If my partner asked this of me I would want him to feel as well as myself. I feel really bad if he's feeling anxious/low. I want the absolute best for him.", "\"mental health\". dude is just being lazy.", "And realistically it would have been perfect for OP to have the place to himself for the day while she went out.", "Same here. I'm more extroverted than my husband and will happily make plans with friends when I want to go out and about, especially when I want to do things he doesn't enjoy like shopping. I've started encouraging him to book 'recharge days' off work too, such as when we have family events. So for example my sister's wedding was a Saturday, which both of us have off work anyway, but we travelled over the Friday (3 hours driving) and home the Sunday. I told him to book Monday off work so he could have a day of video games or anything with no need to be anywhere or do anything. He ended up working as they were low on supervisors that specific day, he text asking if he off for a specific reason and I told him it's a recharge day, he chose to work and take the day elsewhere. No big deal.", "Nah, she can STFU for a bit and then they can discuss this or whatever the hell else she wants after OP has had some time off on his own to rest, relax and recharge.\n\nLetting someone hijack your rest day for a bloody fight is letting them stomp all over your boundary as if they can do that, then you'll never get a day off.", "Even if he tends to get his way in the end, he set this all before and she knew it. He wouldn’t be an AH for this instance if he prioritized himself. He gave reasonable alternatives.", "i’m so glad i’m not the only one bothered by that! thank you.", "This is on her for being the sore person here,", "I call this Pajama Day.", "Co- dependent even!", "Innit!", "I wish I could downvote a comment more than once.", "If it makes no difference why should he change his plans?", "I hate how people don't consider that a person should be giving time to themselves first. His plan is stay in his home and give time to himself. Why can't she go out with him on Monday? Its not like she can't go out without him", "He did have plans though. His plans were to stay at home at watch TV and not do anything. Sometimes you need days like that to rejuvenate. \n\nAlso by saying “spending time with your girlfriend is the bare minimum” insinuates that he never sees her or hangs out with her when this is a one time thing that he wants to just chill at home. He should be allowed to occasionally just chill out by himself without being called a bad boyfriend. \n\nI do think I would have dived further into what was wrong with the girlfriend and why she was so adamant on going out. I think from there they could have reached a nice compromise on how they can each support each other and get back to 100%.", "Yes? And? \n\nHe had plans and she knew about them. Why should he give into what she wants? She can wait till Monday.", "And? If he's doing this to make a point, won't she listen better the next time he tells her what he needs?", "So, he should just do as she says to not “prove a point”?", "Wdym?", "And your comment is 100% wrong 😂", "I love it when people explain why one party is the asshole, yet vote NAH anyway.", "His perspective: I need X for my mental health so I'm going to do X.\n\nHer perspective: I need X for my mental health so I'm going to do X AND you need to cancel your own plans and do X with me.\n\nThese aren't just different but equal perspectives. He didn't demand that she drop everything to stay home with him. But she did demand that he drop his own plans to go out with her. \n\nShe needs to learn how to take care of her mental health without making it an automatic demand on him. Otherwise she's going to become one more CAUSE of his burnout (if she's not already).", "AGREE WITH YOU", "It was.  Some kind of control nut thing.", "‘Almost’?", "Its probably why he is burnt out, wanna bet the last 3-5 times he tried to recharge she hijacked his time and pushed him into doing something she wanted.\n\nHe probably wasn't even aware that was what was going on.", "NTA, its her bad that she can't do her mental health by herself.", "Loved, “you’re nor her emotional support animal.”\n\n😀", "This isn’t a boundary, just communication of needs. “Boundary” is the new “gaslight” everyone throws it around even if it’s not really applicable", "[removed]", "[removed]", "AGREE WITH YOU.", "He tried to compromise by offering a different day but anything more would have been sacrificing what he needed.  She was unwilling to compromise", "OP did offer a compromise. He would keep his plans for Sunday and they could do what the girlfriend wants on Monday. If he gave in and went out with her on Sunday there is absolutely no guarantee that he would get to relax and do his original plans on Monday since she could again pull the mental health card and insist he do something with her.", "He tried to comprise by offering to do something the day after instead. She refused.", "Yeah okay, that’s such a toxic mindset. Resting is so good for you in moderation, and it sounds like OP needs it. Everyone deserves a self care day, and sometimes self care is laying on the couch all day eating snacks \n\nNTA.", "\"mental health\". Girl is just being manipulative. And spoiled. \n\nShe claimed she needs to go out for her mental health. If OP offered to foot the bill for HER mh day, she'd probably be on board.", "A lazy day every so often is good for your mental health, especially when you're constantly on the go and rarely get a chance to just relax.", "Man... I wish my ex had been like you.", "Maybe I misread you but it it sounded like his supervisor texted you? Is that right?", "She even suggested OP put off their plans until Monday, because her MH obviously trumps their’s /s, but somehow I don’t see Monday being a day just for them either and she’ll find another reason for them to put it off for her.", "Why is it she can’t do things on her own or with a friend? For me personally, this behaviour would be a red flag - that level of dependence or attempt at control from a grown adult.", "NTA. Does this happen often?  You makes plans and she becomes needy?", "I helped you with your down vote wish", "We need to set some boundaries about people misusing the word boundary", "Gaslight is the new buzzword people use when they really mean asshole...", "[removed]", "Pedantry...\n\nWho cares?", "Forgot to switch your alt lol", "Comment Stealing Bot. OP made the original further down.", "I'm sorry to hear that. I mean we haven't always got it right but after 10.5 years together we have muddled through. We also communicate well I'd say, a low day we just say we are feeling 'like a balloon' and to us we know that means energy is low. I always ask can I do anything if my husband says this and offer support but also just leave him alone to recharge if that's all he needs.", "It's so nice when someone understands that for some of us, recharging with solitude is essential.", "No they contacted him before the date. He booked the time off and then whoever higher up saw an amount of staff in supervisor or higher positions for the team was all off so they were asked can anyone make switches. As he was taking a recharge day he chose to work instead and allow his colleagues to keep the booked day off. I had nothing to do with it except reminding my husband the reason he booked the day off.", "I'm honestly wondering if she's part of the reason for his burnout.", "You keep using that word. I do not think it means what you think it means.\n\nIt's not about perspective...they're not having a debate about what constitutes unwinding/recharging. They are disagreeing about what OP should be doing with OP's time off..., and since OP knows what they need and said well in advance , it is not unfair. OP's sweetie may be disappointed, but she can figure out a self-soothe and maybe tomorrow will be better.", "They don’t have a shared need - they aren’t a monolith joined at the hip. \n\nThey are two different people with different needs. It’s not a perspective problem, it’s not an insight problem, it’s a respect problem.\n\nShe isn’t respecting his needs, needs he had courteously expressed in advance & she did it by trying to manipulate him.", "I'm setting a boundary that you mustn't do that. \n\n👿😈 (my phone is frikken tiny, cross out the one that's not grinning, I can't see which is which)", "And then gaslighting about it.", "How are the communication of needs and boundaries different?", "Gaslight = any and all emotionally abusive behavior regardless of the type\n\nNarcissist = absolutely every single even slightly shitty person on the planet\n\nBoundary = any kind of request whatsoever\n\nJust for anyone who needs to catch up.", "  It sounds like you communicated this early as well. This is on her for being the sore person here, not you.", "I'd hardly call this pedantry. Words matter. This isn't \"excessive\" concern about \"minor\" details. This is concern about the actual meaning of words.", "No, it's a comment stealing bot. OP made the original further down. I've never caught a bot in the wild, so I'm currently trying to figure out how to report it.", "No, that's a copy bot who copied the OP's reply.  \n\n\nReported as Spam and Harmful Bots.", "[removed]", "NTA You communicated your plans beforehand and offered her a decent alternative for what she suggested.", "Boundaries are for you and dictate your actions if/when something happens. “I need you to stop complaining about work” is different than “if you continue to complain about work after I have asked you to stop, I will no longer be calling you after work.” Boundaries are not punishment for other people not doing what you want, they are just you telling yourself and others what your limits are.", "There's definitely a venn diagram with this, but in my mind a boundary is \"you cross this line and the relationship is done\"\n\nIn this instance, GF is being pretty selfish, but its likely not something OP is gonna break up with them over - if GF *always* puts her needs above OPs, then yeah totally reasonable to have a bigger conversation about their relationship and what is needed for it to work for both partners.\n\n*\"I just need this weekend to chill\"* is communicating a need vs. (as an example out of thin air) *\"I need a day week to be myself to decompress, if that doesn't work for you I don't see this relationship working out\"* is communicating a boundary.", "They’re not. Someone is just talking out of their ass.", "Language also evolves. The only languages that don’t are dead ones.", "It's bullshit though. This is post of about boundaries.", "report, spam, harmful bots.", "Except she doesn't need him to go with her. She can either find someone else to go out with or just go alone. But if she genuinely needs OP specifically to go with her, then she needs therapy more, bc it's not healthy to be reliant on someone else for your mental health. What if OP was sick and couldn't go out, or was away on a trip? It's also unfair to put that pressure on someone else and make them responsible for your mental health, leaving them feeling guilty if they can't or don't want to go out and do something that day.", "What?\n\nLook, he has no requirement to go out if he doesn't want to. Not only that, but he's giving her options to achieve her goal of going out. If your happiness depends on your partner being by your side all the time, you need to step back and reflect on your relationship. It's not healthy.", "The fact that you think you might be an asshole for wanting to practice self care is pretty alarming. Does she regularly not acknowledge that your feelings/needs matter?", "No, they are, words have meanings.\n\nTelling someone \"I have plans for today and I'm not breaking them\" is not setting a boundary. It's just communicating that you have plans which you don't intend to break.  \n\n\nTelling your partner \"Please do not come into my home office unbidden during work hours\" is setting a boundary, if you need an example.", "Thank you!", "Telling someone \"I am not going to allow you to take my time and use it to suit yourself no matter how much you push or manipulate me\" is a boundary.\n\nTelling someone that they can either accept that you occasionally need time off, alone, resting and they need to respect that or you'll end the relationship is a \"boundary\".", "So many bots since the boycott last month!", "So, you put your husband’s mental health before yours? Sounds healthy", "ESH for being in such a weird relationship with what sounds like a whiny child, NTA for the change of plan. Door's right there, she can go out by herself/ with friends.", "NTA i'd even be willing to bet she did this *because* you said you were going to use the day for that.\n\nor she misinterpreted it as 'i don't have anything else to do so I'll just hang out' which is like when you tell a friend you're \"doing nothing tonight\" and get a \"great! so you can come out to...\" no, i told you i had plans to do nothing lmao\n\nThis girl I used to date would do this to me. I'd be having the worst week ever and need a day to myself and seemingly immediately she'd either make plans on plans or invite a bunch of people over. Some people just don't get it.", "NTA - Good grief, this sort of stuff irks me. Sometimes people's needs just don't match up, it happens, she needs to get over it and work with what she's got at that time without demanding you give up your wellbeing for her. Your mental health and her mental health are equally important, and each of you have to care for yourselves before you can help anyone else.", "I am wondering whether you should start reconsidering your relationship as your GF sounds very needy and insecure. You are NTA but she sounds like she may be as should doesn't seem very considerate or compassionate and comes across quite selfish. Also for her to play the mental health card is a low blow and quite a manipulative move !!", "NTA. That's a fairly standard manipulation / control tactic she's trying to pull off.", "I am tired of people using \"mental health\" as a way to excuse being assholes", "NAH you're both struggling and what you both needed conflicted with what the other person needed. You are probably both less than full capacity for a conversation and it's good to remember not everything has to have someone who is right and someone who is wrong. Your gf needs to work on ways she can help herself, but that isn't always immediate if you have mh issues, so it will be a process for both of you. Burnout is horrible and can take a long time to recover from so make sure you start building recovery into your every day routine", "[deleted]", "You guys sound exhausting \n\nESH", "Are y’all overweight at all?", "You’re the asshole!", "YTA. She needed you. You could have delayed your plan by 1 day.", "YTA Yeah, sitting on ya a$$ getting fatter doing mind numbing crap is great for your mental health.\n\nYour girl could do better imo.", "NTA.\n\nI'm fucking sick of people using mental health as an excuse for everything. If it isn't the current nonce scandal at the BBC, it's a girlfriend using it to get her own way.", "NTA. \n\nI get it. And the healthiest relationships allow for partners to recharge in the way that's best for each person, without laying a guilt trip on anyone, after plans have already been made. Or even if the plans need to change.", "NTA. You said you're basically too burnt out on everything & offered a great compromise. As someone who's been severely burnt out before, she doesn't NEED the immediate gratification of going out & hauling you with her. She can wait a day or got out with someone else.", "NTA. Why doesn't she just go out with a friend? Clearly you are so burned out you felt the need to plan a day to decompress. I don't get these people who think they have to be constantly joined at the hip. Exhausting.\n\nThe difference between the situations is you aren't stopping her from doing what she wants. But she wants to stop you from doing what you want.\n\nI would get it if you never wanted to go out. But it sounds like you are just asking for one rare day of peace.", "Well done for standing your ground. Your mental health matters as much as anyone else's, including your gf and if she values her mental health that much, she should be respectful of yours as well. No double standards. I would also recommend having a real talk with her about this before it becomes \"a thing\". I hope this has been the first time it happened and that you're able to make her see why she's not being fair. If this has happened before, then it's a big red flag. Hope you're feeling better now!\n\nNTA.", "NTA - you gave multiple solutions to this issue and I commend you for that. You are allowed to set boundaries and you expressed your concerns about your burn out prior to her wanting to go out. In a relationship there is compromise and you gave a lot of it. I'm glad you stuck to yourself as it seems like she was being a little manipulative by trying to make you feel bad for also wanting your time to reset yourself.", "NTA\n\nAs you said, you weren't keeping her from going out, her mental health isn't more important her mental health (and neither of your mental healths is the other person's responsibility) and you made an announced your plans first.\n\nIt sounds like your girlfriend is insecure about being by herself/not attached to you at the hip, and that's a her problem that needs work. Because it's not fair for her to force you into being her crutch to deal with life and the world.", "NTA at all. I recharge the exact same way. Last month, 4 people in my bf’s friend group (including my bf) had birthdays, I had a big project at work, and I moved apartments. I don’t think I had time to sit down for more than an hour that whole month. Once everything was done, I had a whole weekend where I played stardew valley from the minute I woke up to the minute I went to sleep and it was SO needed. Luckily my bf completely understands but if he had asked to go out I would’ve asked to reschedule like you did. If I had gone, I probably would’ve been moody and grumpy because my social battery was at 0. Everyone needs time to recharge but you also need to be understanding of the way your loved ones recharge. You offered to do it another day, she could’ve gone out on her own that day.", "NTA.  If she wants to go, she can go on her own or with a friend like you said.  It is your relax day.", "NTA she’s 100% acting as if her mental health is more important than yours, which isn’t fair. You’re burnt out, you need rest and time to yourself, by all means don’t let anyone force you out of that. If she needs to get out of the house, she doesn’t need YOU SPECIFICALLY, to do it, so she should be taking care of herself as well.", "NTA!!!\n\nYou didn't push her to do anything, while she is pushing you to do it her way (mental health excuses or not). If you're not feeling like doing anything other than what your plans were, no one, and i mean no one has the right to force u to do otherwise.\n\nYou shouldn't feel bad about it, even if she is an important person in ur life. U do u, man!", "NTA.  You stayed your case.  Your GF behaved immaturely.  Also, you cannot be responsible for someone else’s mental health.  If staying home one day throws your GF into a spiral she needs to seek professional assistance.", "NTA and good for you for knowing your mental matters too and not being afraid to call out her absolute bullshit. the bad news is I think she doesn't really care about you so like might wanna dig into that with her. She clearly thinks she comes first in the relationship", "NTA\n\nSo her mental health days matter and your mental health days don't.\n\nYou made plans and restated it to her.  You asked were her mental health was more important, and she said \"That's not what I meant!\" and then said it was unfair that you have a mental health day when she wants one essentially PROVING what she just said was false.  That is what she meant but just doesn't like how it makes her look.\n\nI don't know man.  You told her before hand what you needed and it went in one ear and out the other.  It shows how much she pays attention to your needs.", "NTA 1) you're not joined at the hip. she can go out without you. 2) you told her what you wanted to do and why and 3) she feels her needs come before yours, see 1 above.", "Nta. If she needed to get out and spend time with you for your mental health, then she should have suggested that when you told her your plans, at which point you both could have decided the best plan together. But her telling you to change your plans to what she wants is selfish and does come across as her thinking her mental health is more important than yours", "NTA, your mental health is just as important and she's TA for trying to weaponise it, you communicated in advance, she's free to go out if she wanted", "NTA and your gf needs to make some friends.", "No buddy, you’re right. Not the asshole. She can go out with her friends or by herself. You also need to take care of your own self.", "NTA. GF is self-centered and exhausting.", "NTA\n\nAnd if Monday is an open day, I don’t understand why she’s guilting you into giving up your Sunday when you’ve already announced your plans to decompress on that day.", "The audacity to use your mental health as an excuse to impede another person’s. NTA.", "NTA—she is being very selfish asking you to put her mental health above yours. You didn’t say she had to do a thing with you for you to be okay. You planned a solo thing of relaxing at home. AND let her know why. She now says the only way to help *her* mental health is if you sacrifice your mental health day? No you two having mental health days are not mutually exclusive. She can go out and you can stay in. You are NOT in the wrong.", "As someone with extreme mental health (some days I can’t leave the house alone due to panic attacks) NTA. She knew you needed the day to recharge and is still insisting on you putting her needs first. I get she may be feeling low or may not feel like she can cope going alone but she can’t decide her needs trump yours. You tried compromising and she’s saying no. That’s on her.", "NTA. We love our partners but we cannot be everything all the time for them, especially when you are burnt out too.", "NTA. and I understand your GF's perspective too, I wont lie.  But she needs to respect your boundaries and you can't light yourself on fire to keep her warm. \n\nTake care of yourself. Life is very short and hard.", "NTA, get some rest my guy", "NTA.  I'm having one of those \"decompress\" days myself tomorrow!  I requested a vacation day from work, told my husband it is a \"chill out\" day for me, and that he didn't need to take the day off since we would not be doing any activities. He is totally fine with this. We are both introverts and he does it on occasion too.  I'll probably run out and get us something for dinner but for the most part I'll be working on my hobbies or watching TV. \n\nYour girlfriend was told ahead of time what your plans were, so it isn't like you made plans for some awesome activities then backed out of them.  Sounds like she needs to learn how to do stuff by herself.  She is pressuring you to cancel your plans to accommodate her wants, and that is not cool.  Plus, you are offering to run around with her on Monday so she needs to back off.  I'm not saying you need to break up with her, but you need to have a sit-down with her to make sure she understands that you cannot be 100% responsible for entertaining her - she needs to learn to be a little independent or she can look forward to a lifetime of unhappiness.", "I feel like neither of you is an asshole, but given that you're both a little inflexible about your preferred activities, and your preferences don't match, maybe you're not very compatible. Both of you need either a partner with similar preferences, or a partner who's willing to say, \"OK cool, we'll do your mental health support thing today and my mental health support thing tomorrow.\" Neither of you are that person, which doesn't make you assholes, but it may make you not right for each other. NAH", "Introvert vs extrovert.  You both need to respect each other's batteries, but she needs other friends to recharge with socially, when your battery recharging schedules don't align.\n\nYou recharge alone, she recharges socially.  Not a deal breaker in itself, but not being able to deal with each other's (or not able to take care of one's self) can be problematic.", "💯NTA. She can do her thing while you do yours.", "NTA, tell her to grow up. She already knew your plans and should have made plans of her own. Why do some people want to be more like your kids then partners?", "NTA. But *she* is. \n\nShe's being both manipulative (\"**I** need it for **my** mental health!\") and dismissive (\"You know about **my** mental health issues!\") while completely ignoring what you want/need.", "NTA- and she’s very manipulative", "NTA that’s exactly what she’s saying. To guilt you for it literally is saying she thinks her mental health is more important than yours because she’s asking you to put your needs on the back burner. She’s being incredibly selfish in this situation", "NTA.", "NAH. Seems like you're both just having a hard weekend and it is hindering communication and understanding. I think that's just part of relationships.\n\nMy wife has social anxiety. So the thought of asking her friends to hang out stresses her out. So I'm her default hang out buddy. Lol. She also struggles with doing things outside of the house alone sometimes. It can be frustrating for someone like me who likes to just do whatever I have planned to relax. I can be alone or with friends or my wife, as long as I am not being forced to do anything I don't want, and I'll be relaxed. \n\nFigure out why you are both upset and where the miscommunication is coming from. I think you'll be fine", "NTA. I get she wants to fo do something but she knew your position in advance. I don't understand why she needs you specifically for her day out and can't go with a friend, family member, or even god forbid by herself. How do people reach adulthood so unable to be alone? She sounds pretty demanding to be honest, are her demands on your time perhaps why you are starting to feel so tired all the time??", "NTA.\nShe's being dumb and inconsiderate.", "NTA you want to do the plans you made, even if the plan is do nothing.  She doesn't get to override that, and as you said if she wants to go out, she can go by herself or ask a friend.", "Your relationship is doomed since neither one of you is willing to meet the other’s needs. You make it sound like you have booked reservations and put down deposits you won’t get back. I won’t say you’re the asshole, but you are being petty.", "NTA; maybe she’s the reason you need down-time.", "NTA. She needs to be able to help her mental health without being dependent on another person.", "Sadly, i'd say both of you are being a bit mean.  You certainly do deserve to recoup your depleated energy, but you shouldnt really say \"well, what about my mental health\".  Both of you need to respect each other's mental health, and that phrase doesnt cut it there.  Yes, she was being unfair, by expecting you to further exhaust yourself for her benefit, but that doesnt entitle you to how you approached it.  Would have been better to say something like \"i am really sorry, i'd love to come out and show you a good time, and help you with your troubles, but i have been so burned out, that i feel it would mean you'll have to pick up the pieces if i do burn out, as i fear i am.  How about we set a date nite to do that together, and i'll be fine if you wanted to go out with X, you havent seen them in a while.  Or if you wanted to just be around me, i'm sorry i am only going to mope around and recharge my batteries.\"\n\nMy advice, is to apologise you both felt shit, and neither of you helped each other.  Admit you just werent in a position to to give her what she needed, but once you've gotten energy back, go and do something with her man.  Dont let this carry on, as you'll end up being in a rut, which might be what shes fearing.", "NTA. She knew about your plans beforehand. Yet suddenly needs to go out for \"mental health\" reasons and wants to push yours to the side and demand you come with her? There's nothing stopping her from going out with others.", "NTA\nShe can put with others. \nThis is wild to me. If she is that dependent on you for her outings then her mental struggles are more severe than she thinks and she should consult a doctor. \n\nEnjoy your day off at home just relaxing ! Those are the best days.", "NTA.  You're not insisting that she stay with you, and you've offered to spend the day out with her on Monday.  If you were telling her she needed to stay home to support you it would be a different verdict, but I think you're being perfectly reasonable here.", " NTA\n\nThat said, it seems like you and your partner need to have more effective communication about your wants and needs.", "NTA, gf is being unreasonable and not caring about your needs, why can’t she go out without you?", "Damn. Sounds like she's laying down the gauntlet. She wants to make sure you know her needs are more important than yours, and that you should feel remorse for abandoning her in her time of need. Take care of yourself, or don't, but at least understand the expectations. NTA", "NTA.  Welcome to the societal concept that men don't have emotions, and don't have mental health issues.\n\nYou're absolutely right; she can do what she needs to do while you do what you need.  \n\nAnd the thing you're missing out is that it's very bad for her to be making you responsible for her mental health.", "NTA oh she suddenly Needs it Right when you have said you do?  Attention seeking much is she? \n\nI can tell you right now Who you need to get rid of in your life to find your energy and joy back in your life.", "NTA….your girlfriend does not need you to go out for HER mental health.  She can do that on her own.  You are correct in that you also need a day for YOUR mental health and you told her you would be taking this day for you.  And for you, that means staying home.  Your day is no less or more than her day and it is not a competition.", "This is really hard and you have my sympathy. \n\nMy last GF was extremely extroverted and had abandonment issues from her parents and really REALLY needed to be with people. \n\nI am an introvert about half the time and need to be alone to recharge. \n\nThis caused many problems. We eventually got through it and made it work (it was not the reason the relationship ended and we are still on good terms). But it took a lot of communication and boundaries and compromises. \n\nIt’s tough, don’t hold on to something that isn’t working but also do your best to communicate how you feel. Best of luck.", "NTA   I do not understand her thought process.   She's very selfish.  Do you want to spend the rest of your life with someone who will not prioritize you?   Think about it.\n\nGood luck.", "NTA I wouldn't change your plan. It doesn't seem like a mental health emergency on her end. She'll be fine. \n\nDon't keep arguing with her. If she has friends and or family, she can use them for support. All your asking for is one day. If that's too much for her, then you have a big problem on your hands.", "Why cant she get out and you stay in?  Are you two at that stage where you have to spend every moment together to make it a relationship?", "NTA\n\nI think I hurt my brain, trying to follow her logic here. She is free to go out, but wants to ruin your day. This relationship isn't going to work.", "NTA. You are respecting yourself, your plans, and your mental health. What you said to her is absolutely fair: why should her mental health come before yours? It doesn't. \n\nShe is projecting by telling you that you are being unfair, she knows SHE is being unfair and rather than feeling guilty, she's dumping it on you. \n\nYou are not preventing her from going anywhere, she can leave the house if she wants to. She's being the AH.", "NTA. gf is being selfish", "NTA, nothing is stopping her from going out but her own selfishness.", "NTA\nI don’t like that she’s trying to make herself the victim. You told her ahead of time that you needed a day to chill.", "NTA.  She sounds childish honestly.", "NTA\n\nYou told you pryer that you wanted to just relax & not go out. She’s putting her mental health above yours, she can easily go out by herself & do what she wants to do.", "NTA - she wants you to prioritize her over you. She can go outside and have fun on her own.", "Hard to say because I would assess my mental health needs against hers and whoever needed it the most would win at my house. Can’t judge that in this situation. Maybe ask her to go out with a friend?", "NTA\n\nIt irritates a me to no end that people can’t go out and have fun on their own. Sure, it’s more fun with someone else but come on. Deal with it. \n\nYou told her what exactly you planned. In essence she expected you to entertain her.\n\nNot cool.", "NTA\nYou need to take care of your mental health too", "NTA\n\nShe's being really selfish in this scenario.", "Nta", "Info: why couldn't she go out by herself or with a friend?", "Adults are responsible for their own mental health. She is making you responsible for hers. This kind of dependancy is not a great facet of a relationship", "NTA \nSounds like manipulation to me. Not because she’s asking for a mental health day or your support but because you’ve already expressed you did this for your health and not leisure. You also provided a good alternative which she turned down. So this seems to cater to her while acting as a disservice to your health. I’m not suggesting she’s doing this intentionally but this is a red flag for certain personality disorders. Start reflecting to see if she has had a history of overstepping boundaries. \n\nThe post suggests you actively talk about her mental health struggles. You don’t have to disclose any of it but has she been diagnosed with anything or actively in therapy/treatment? If not, I would suggest she do so and soon for both of yours mental health.", "NTA. \n\nI’m proud of you OP. You recognized you needed some time for yourself and planned for it. You were even considerate enough to pass it by your gf first and chose a day where you had nothing planned. \n\nThen you refused to put yourself second by relenting to the pressure your girlfriend was putting on you to give into her whims. \n\nYou did the right the right thing for the future as well. You will most likely need days like this in the future and you set a precedent that when you need a day for yourself, you mean it. \n\nI kind of did the same thing years ago and decided Sundays would be days I could do anything I want. I needed to know I have this “vacation day” every week that I could count on to not be expected to do things I didn’t want to do (within reason of course). \n\nIt has been so beneficial to me that I go to bed excited on Saturday night knowing all the pressure is off on me on Sunday. We have no kids so that’s not a concern. \n\nIf there is something my wife wants to do that’s only on a Sunday, sure, I’ll do it even if I’m not all that excited about it, because she gives me this day to relax most times and I appreciate it it so much.", "Don’t mind me, holding a spot in this post to come back because my boyfriend needs to hear it.\n\nFor the record, NTA, OP. You need time to be alone and recharge, and there is absolutely nothing wrong with that. My boyfriend has canceled plans we already had because he needed the time to himself, and we just rescheduled for a different time. Don’t buckle, either, because you’ll spend the whole day and then some resenting your girlfriend, and nothing good will come of that.", "NTA - here’s me changing shifts to give my partner two days off together without me because I can tell he’s getting burnt out. And he deliberately does not work from home just so I can get me time on my days off! Do I have days I want to go out and he doesn’t? Hell yeah, do I deal with it and suck it up? You bet! We talk about it and compromise, like you suggested.", "Absolutely NTA. She certainly is though! She clearly thinks she is more important than you. Run while you can. It’ll never change.", "NTA. \nIt's not like you are forcing her to stay home as well? You planned this day, you needed this day, you looked out for this day, she knew it was today. Today is your mental-health day, period.\n\nIf she was in some kind of crisis, okay. But she knew in advance. This is also a good opportunity for her to learn how to cope with those days when you're not free. (and this is coming from someone who struggles with mental health as well)\n\nShe wants/need to do something and go outside, okay she can call a friend of family member to chill. She can listen to music or a podcast and make a walk. There are plenty of opportunities she can explore herself.\nYou're not the AH and she's the one being unfair.", " NTA. \n\nIt seems like she leans a lot on her mental health needs. We all have our issues but it shouldn’t be the excuse or reason for everything.", "Yikes on bikes. She is demanding you put her mental health before your own. She says you can just recharge on Monday but the same applies to her desire to go out. You gave her notice and she didn't respect your plans. NTA", "NTA, you explained it very well, if she needed to go out for her mental health then yes she could have gone on her own or called a friend. You needed to stay indoors to work on your own mental health. Fair and simple.", "NTA. I’m beginning to see why you may feel so taxed and need this time. Your girlfriend is really in the wrong for how she is approaching this. She needs to respect that you have needs as well, and that sometimes you’re gonna have needs, and she’s gonna have needs, but you need to take care of yourself first. She cannot be laying all of her needs on you. I think you handled this very well in standing your ground for what you need and what you already had planned, and encouraging her to look outside of you for support. She has friends, she has family, and if she doesn’t, then that’s an issue that she needs to tackle.\n\nAs we grow up our culture does a really good job on making people feel bad for putting themselves first and making sure that they are healthy so that they can show up in the best way possible for all of the responsibilities and other people in their life.\n\nPlaying the mental health card here and insinuating that since she has certain problems that they should always trump your needs is really concerning and some would say abusive. It’s certainly manipulative, and is not respectful of you at all.", "INFO: Was there something specific going on with her that she needed support? E.g. needed to talk about some recent bad news or deal with something traumatic that happened?", "NTA - as you said, if she needed to go out for her own mental health, you weren't stopping her, and she could go alone or with a friend. My partner takes walks around the complex when he feels the need to get out, I don't go with him though. And totally feel you with the burn out, some days you just need a day to do nothing and not plan, think, do errands, etc. Best of luck, hope your gf comes around and y'all are able to compromise and respect each other's needs.", "Break up", "Is there a reason you can't each do whatever you want separately?", "Hesitatingly NTA. I had a bf that would do the same thing. He would need to decompress at home by playing videogames. The thing is he would get sad if I left the house to hang out with friends and if I stayed in the house he would ignore me. As long as you aren't making the situation impossible like mine was you are not the asshole.", "NTA\n\nYou need to stand firm for your own mental health. Our mental health issues aren’t to be used to manipulate other people into doing what we want.  You are right, she’s a grown adult and nothing was stopping her from going out and doing something.  Unless she’s got some kind of phobia about going out by herself or something. And even then it sounds like she has other friends.", "NTA, what happens come Monday if she is not recharged, will she demand you go out again. You cannot take care of others until you have taken care of yourself.  She is a selfish AH.", "NTA. My husband and I both do this occasionally. And if I want to do something, I go do it by myself. Works for us!", "NTA\n\nSigh.  So many people weaponizing this shit lately.  And I can't help noticing she didn't have an answer about why her shit is more important than yours.", "NTA", "NTA\n\nEven if you plans are to do nothing, you have plans. You need these plans. She can go hang out with friends or by herself and be fine. She doesn't need you to be there with her 24/7", "Nta, but what if she had somthing planned, like a suprise?", "NTA.  You have her notice and you were clear.", "Her mindset is selfish. NTA she does realize the world doesn’t revolve around her right?", "Trust me on this, if you went out the Sunday, Monday would come and she would want to go out again. \n\nYou could both go to therapists, and they'd tell you the same thing, which is to dedicate a day to yourselves. \n\nNothing wrong with this, especially considering you gave her notice. If you hadn't given notice, I'd still be on your side. But you would've been slightly more asshole.", "NTA the way people recharge are different and we need to understand that otherwise no one get to recharge and mental health just keeps going down. The fact she wants you to pick her over yourself is just sad.", "This sounds just like  post I read about six months ago.  \n\nI guess the message of the story is to keep your plans to yourself.", "NTA.  You told her your plans for Sunday.  She didn't seem to have an issue until she wanted to do something else.  She refused your suggestion of doing things together on Monday or contacting another person.  She does seem to believe that her mental health is more important than yours.", "NTA.  Why is her mental health more important than yours?  And she can go out on her own, or see if she can find someone else to go with her.  Or just wait a day, just like you said.", "NTA she’s being odd. If she needs to go out. She should just go out. You told her your plans in advance. This is weird", "ok hear me out...\n\nAlmost feels a little manipulative for her to suddenly want to go out when she *knew* that you had planned for a \"me day\". Feels a little bit like she wanted to see what you would do: pick her or your self care day. She can easily go do her own thing but instead is asking you to sacrifice something that you had explicitly planned on. As an introvert, people who don't respect my gentle \"no sorry, that's my 'do-nothing' day\" are people I like to hang out with less and less.", "nta.  planning on doing nothing is a solid plan.  i wish more people understood this.  curious though, and not that you should have, but is there a reason why you absolutely couldn’t have your day on monday ?  trust me i don’t think you should have changed days, i am just curious like i said. do you feel that your girlfriend was purposely trying to ruin the day you had planned by picking sunday to need to have a day out ? i thought it odd that she came up with this only after you told her of your plans.", "NTA. My spouse and I sometimes have very different needs. I have ZERO problem leaving him home when I need to get out. It is better than dealing with his sulking.", "I don’t think you’re the asshole but relationships are about compromise. You two do not want to step down and are pushing the other one to do so. It doesn’t seem like you guys handle the smallest of conflicts well and imho that is bad news for your future so you should really take arguments not as competition but as a chance to compromise and negotiate.", "You two need to learn effective communication and compromise. There is no reason you both could not come to an agreement since you had 2 days off. Being stubborn will get you nowhere and her too she could've waited to go out but you could've also relaxed the next day or done something else. You both need to communicate better.", "NTA she is trying to manipulate her priorities over the OP. To me this is a toxic relationship. He compromised to do things with her on Monday but that wasn’t good enough for her. Plans were made and she couldn’t respect what he needed. Mutual respect for one another’s mental health isn’t being met if she is complaining that she can’t wait a day. Therapy is in dire need for her as she seems wholly dependent on him for her mental health. Which in fact is completely unhealthy. People need to be responsible for their own mental wellbeing. OP is doing that and being a good partner", "She can literally go do whatever she wants. Take your time to recharge, friend.", "NTA and well done to you for standing your ground. My husband works long hours (05:00-20:00 6 days) aswell and his day off is his stress free day I usually leave him in bed and go sort the house out while he gets some sleep and catches up. Your mental health matters just as much.", "And putting this pressure on OP isn’t helping with their MH in any way. Guilt trips suck. You take care of you. NTA.", "NTA. You were clear with your plans. You have to put your own oxygen mask on before helping others. \n\nAlso, it's taxing on mental health to be your partner's only support, so I think encouraging her to do things with friends was smart.", "If she's struggling with her mental health then she needs to step up and fix it herself. It's not your job to do that. Healing oneself comes from within, not from you having to do something. I was told from my therapist long time ago of multiple things to help with my disorder for my mental illness and none of them required having to be taken out for the day. It helps to be out of the house sure....but so does going for a walk for an hour which is what mine told me to do everyday. She should be doing that honestly \n\nNta. You recharge your batteries. That's highly important but only for your mental health but physical health as well", "NTA. You're not her nanny. She is perfectly capable of spending a day out on her own or with a friend, tending to her mental health needs. She wasn't being fair or considerate of you and your own pre-articulated needs. If you two don't live together, consider not having her stay over the night before you need a down day.", "NTA, GF needs to make a friend who is also an extrovert", "Nta", "NTA\n\nThis is a huge red flag. This says a lot about her importance versus yours. If you're moved in together ask yourself if you're seeing others. I'm sorry, but not respecting choices is a deal breaker for me, especially when they are made in advance. \"She said I was being unfair to her because I knew she struggles with mental health issues,\" tough, what about your issues?", "Agree to go to the beach… and do nothing at the beach", "NTA.  You communicated pretty clearly, which is key in relationships.  Communication and following through with what you communicated are fundamental behaviors in a relationship imo.  Making adjustments to plans is sometimes necessary, but not in this case.", "NTA you clearly communicated what you needed and ahead of time even, you even offered to go out a different day. You’re GF seems really petty to try and push you to change your plans", "NTA your need to have some down time is definitely important. You are not canceling on her, you gave her a clear understanding what you were doing. She can go out with a friend or family or alone. Her needs don’t take precedence.", "NTA.  You're totally in the right OP.  Good on your for standing your ground and not be guilted into literally putting her mental health over yours.", "Nta, your mental health matters before anyone.", "NTA. if it's a serious enough mental health issue, then she should have no problem going out alone. why does she need her boyfriend around?? pathetic imo", "NTA she is being selfish and entitled as well as dismissive of your needs.", "NTA. She’s selfish.", "Now you know who you are involved with. You cannot feign ignorance of her selfishness. NTA", "NTA - She's probably doing it to see if she's more important for you than your plans, not caring your mental health.", "I'm kinda wondering how much truth the mental health excuse has. She didn't seem bothered by it up until the actual day. The actual day comes, and she suddenly needs to go out for her mental health? And needs him to come with her? Seems kinda like she was lying to just make him change plans and go do what she wants.", "This is great, but I urge you to not frame it as being “lazy.” It is rest, not laziness. I think with our overwhelming capitalist society, we often equate resting/relaxing with laziness. If we aren’t actively doing something — often to the benefit of capitalism, we feel some level of guilt. Glad you and your wife “rest.”", "Nailed it. Every bit.", "It’s not about “her mental health”. Shes just wants you to “pick her”. I hate those stupid fucking games. I hope this is an isolated incident OP. If this happens often, reconsider your relationship.", "Not only that but being that she knew beforehand she just put a bad taste on OP entire day by pulling that shit.  So now he probably couldn't even enjoy the day off if he wanted to.", "100% agree.\n\nAlso is seems really odd that the day you specifically said you need down and to be left alone is the one she’s demanding you go out with her on. Honestly this feels really ‘relationship test-ish’ to me like she’s seeing if you’ll put her needs ahead of your own (which is crappy, manipulative and unhealthy).\n\nNTA you said you need this day off. You both have the next day off. She could go out with friends or make plans with family members or go on her own or she can wait one day - let you have the time you communicated that you need and you can both go tomorrow. \n\nThere is no reason whatsoever for her to insist on you changing your plans unless she’s just seeing if you will. I really don’t like this- is she typically one to play mind games and do the relationship test crap?\n\nIt just seems really off that the one day you already told her you need off to decompress and recharge is the one day she’s insisting on dragging you out. It feels like she’s trying to test you and this for me would totally ruin the relaxing vibe I was going for for the day.", "Just saw a post on r/wholesomememes  illustrating this point https://www.reddit.com/r/wholesomememes/comments/14yge4y/its_always_important_to_take_your_time/?utm_source=share&utm_medium=ios_app&utm_name=ioscss&utm_content=1&utm_term=1", "I'm impressed by the fact that the first comment didn't have the usual \"leave him, he's horrible comment\" good for you!!", "\\> this is not a topic to put off until a later date\n\nconsidering they are both stressed out and need to unwind, trying to tackle this problem immediately will make it much worse. they actually **should** put it off to a another day when they are both recharged and able to converse with each other rationally and calmly", "Absolutely not.  Don’t charge into discussions already riled up and ready for a fight.  Any relationship advisor would tell you to wait 5 minutes to cool your head and then discuss it.  None of them would say immediately launch into a deep inspection on your relationship while you’re already negative about it", "People are too quick to bring up their mental health in situations like this. One or both of them were probably just being dramatic about their stress levels.", "Also could be she wants him with to pay for whatever she wants do. I had a friend who brought her BF get him to pay and chauffeur her around.", "I think they are both failing at being partners supporting each other. Obviously it is reasonable to set a boundary and expectations. It is also not unheard of in healthy relationships to change plans and accommodate the other's needs. Neither of them seems willing to work the other and only prioritize their own needs.", "The compromise here is she goes out and he stays home. Your whole idea presumes he was deciding What They both do.", "I don't see what OP did that was \"exhausting.\"", "What about OP's needs? Why do you think they are less important?", "Uh yeah, taking some time to disconnect is bad for OPs mental health....  \n\n\n/sarcasm", "This isn't about spending time with his girlfriend. This is about respecting boundaries. OP TOLD his girlfriend explicitly his plans in advance. He did have plans. Plans to stay home are still plans. If his girlfriend has co-dependency issues and can't go out by herself, that's her problem as well.", "And when on Monday, GF says, \"hey, I'm still feeling antsy, I need to go out again\"?", "Cause he was burned out and needed to rest a day for his mental health? Did you even read the post?", "Especially because she waited till the day of. That clearly shows some sort of manipulation at play, whether intentional or subconscious. It would be one thing if she had brought it up when OP had mentioned it to her, because they could have worked it out then. But to wait until that day to wake up and then go “I want to go out!”, that’s just shitty", "Yup", "Yes! Recharge days are vital. :)", "Totally I do stuff alone all the time, if my partner wanted to be alone I’d ask him if he was okay and if he just needed to stay in and do his plans I’d be like okay we’ll I’m feeling a bit down so I’m gonna go to the gym do you need anything? And it’s like so chill, it wasn’t even like op and his gf already had plans he was cancelling on she just asked him last minute and got an answer she didn’t like", "I see a lot of these posts featuring partners/SOs who rely on their partner for meeting all their needs, even something like this which could be fulfilled by another person, and I'm just like \"well, I feel a lot better about being single\" 😅\n\nLike yes, obviously there are certain things that you'd like your SO to accompany you on/with, but like, I'd much rather \"have a day out\" with a girl friend/platonic friend.", "Might be that she doesn't have any/they're the reason she's feeling down?", "This is truly the best case scenario. Go out on my own? A day to listen to pods and hike, yes please. NTA", ">If this happens often, reconsider your relationship.\n\nThis!  Really the whole post, but especially this sentence!", "Nta\n\nIt seems like she's TA here for either trying a power move on you or just putting your mental health second.", "[removed]", "He did offer a compromise. She rejected it outright and did not offer another compromise of her own. You seem to be confusing compromise with capitulation.", "That’s probably not healthy for either of you. You’re two separate people, each with your own set of emotions and you can’t make yourself feel responsible for your partner’s emotions.  It’s healthy to feel empathy and compassion, but if your moods and emotions are mirroring his, then that’s an enmeshment gone too far. \n\nIt’s not selfish to want the best for yourself, too. It’s not actually good to give someone what they ask/demand all the time. It’s not healthy. It sets up unhealthy expectations on their part that inevitably leads to conflict when one day, you just can not give them what they want.  (And trust me, we all reach that day.  I reached it when I got the flu and my best friend at the time who was struggling with borderline personality disorder traits had a raving meltdown because I was too sick to attend to what was upsetting her that day). \n\nManaged expectations are what’s needed for a healthy long term relationship.  As someone who’s gone through post natal depression and now see my husband going through bouts of depression because of career pressures, we’ve had to figure all this out through our 30 years together as a couple.  \n\nI mean if you’re having a rough patch and feeling burned out and need a day to yourself, you’re not going to be able to fully relax and recharge if your partner insists on taking a slice of that day.  \n\nAnd why should they? When there’s a whole other day you can spend together after you’ve recharged.  It’s selfish of them to take that time from you.  It’s also not healthy for them to not develop sufficient self soothing and coping techniques to deal with their emotions on their own for the one day someone else isn’t available. \n\nYou’re a whole person.  You’re not an emotional support animal.  (And frankly even emotional support animals need consideration for their needs, too.  Untrained animals shouldn’t be dragged into stressful situations for the benefit of their owners). \n\nIf you keep giving up these bits of yourself you’re going to wake one day and realize there’s nothing left.  \n\nMaybe you haven’t reached that point of absolute burnout yet where you just freaking need your day or you’ll scream.  But OP seems to have. And so he’s right to defend his right to his day. \n\nThe goal for anyone in a healthy relationship, be it a parent or a partner, is to encourage and promote healthy independence and self sufficiency in their loved one.  Because life is uncertain and if somehow one of you is taken out of the equation, you’d want the one left to be able to stand on their own and not fail. And they can’t do that if they’re codependent for such basics as managing their own emotions and stress.", "It's been annoying me too", "Yeah agreed, it sounds like this is actually the worst possible time to have this conversation haha\n\nBoth parties need to recharge and then discuss. Hell, maybe after recharging she will apologize of her own volition. In a bad mental health time we can all be assholes", "It's not even about her mental health, she just wants him to entertain her. Probably take her out to eat and go shopping and do stupid shit she wants to do that has nothing to do with him.", "In my experience, people tend to \"be dramatic\" about their stress levels when they are... *drumroll*... in an unsustainable amount of stress. So it's very much about their mental health, but usually not about whatever it is they're being \"dramatic\" about.  \n  \nThe stressed person in the grocery store having a breakdown because they needed fuji apples and the store only has gala might be seen as dramatic, but it's not because of the apples. It was never about the apples, the apples were only what tipped them over.", "Yep agreed. This girl knows what she’s doing here", "AITA can't ever have the man be in the right though. If it looks like he's NTA, something else *must* be going on.", "But you have no idea about any other context in this relationship.  This could totally be a pattern and OP is finally putting his foot down, or OP could take every 4th day off for himself and drive his GF crazy.  It’s unfair to say they’re both failing off of this, so make judgements on what you see alone.  A boundary was made, someone tried to cross the boundary while writing off the other’s needs.  Pretty cut and dry here", "When I need a day to myself and to do my own things, I tell my partner \"TrumpHasaMicroDick isn't here; you see me but I'm not here. You go do whatever you want, but please don't ask me to go. I'm not here.\"\n\nI'll put on my headphones and concentrate on my work.\n\n\nI'd recommend something like this.", "Does she have friends or you it?", "My friend and I were just talking about this last night. Just because you aren’t doing anything doesn’t mean you’re available.", "I'm very sorry if you don't know how to adult.  This is a petty squabble where nobody's mental health is more important than the other's.  How hard is it to compromise?  Answer:  Not too hard, if you are an adult.", "They both just seem strangely rigid. \n\nThere's more to this story.", "GF was aware of that and still asked multiple times, presuambly because she was having a really bad day.\n\nNot sure about you, but I value people and help them out if I can.\n\nThere was nothing about that one day that was special to OP but the GF seemed to be in a bad space where it mattered. OP just chose this day because there were no plans that day, which was true the day after as well.\n\nIf the question is \"Is OP obligated to help his GF?\" the answer is no.\nIf the question is \"Would a normal human being help his GF?\", the answer is yes.\n\nMy definition of AH is being worse than a normal human being. Which funnily is a big chunk of reddit.", "Extroverts can’t live with them can’t live with them.", "I think waking up and realizing you need something is absolutely ok. We can’t always anticipate every need or mood change. \n\nWhat was AH behavior was trying to play trump with their differing needs. \n\nShe wanted to go out, but she didn’t specifically need him to do that. Her insistence that she did was codependent\n\nNTA", "If your ex was more like that they’d likely not be an ex lol.", "My pet peeve in this sub is \"main character energy/syndrome/etc\". Whatever happened to \"selfish\" or \"self-centered\"... Back in my day.... Grumble grumble.", ".... that's what a boundary is....", "Boundary. Gaslight. DARVO. Parentification. \n\nI wonder what the next AITA buzzword will be?", "/u/SuspectIndividF is a bot that copied part of [this comment](https://www.reddit.com/r/AmItheAsshole/comments/14yiy9d/aita_for_refusing_to_change_my_plans/jrt6ajc/)", "My guess is she wants to control him or \"train\" him to serve her interests.  The fact that OP needed to give her advanced notice in strict terms of \"this one day is mine\" tells me he anticipated exactly something like this.", ">How hard is it to compromise? Answer: Not too hard, if you are an adult.\n\nIt's actually literally impossible to compromise with someone who refuses to compromise. No matter how willing the original poster is to compromise, if their girlfriend refuses to compromise, no compromise will be reached.", "Didn’t OP offer a couple solutions? How’s that not compromising? And I’m very sorry you have poor reading comprehension.", "He Said he needed to relax Cause he felt burned out, did you miss the part where he is feeling bad and needs rest?", "Not an extrovert thing, just an asshole thing. I’m extremely extroverted, SO is extremely introverted. I just go do stuff on my own or, more usually, with our kid who is also extroverted.", "More of a respect thing IMO", "Yeah, I don't think that's the issue either.  Narcissim maybe, controlling definitely, selfish for sure.\n\nBut typical extroverts have plenty of friends they can hang out with or do things with.  They don't depend so heavily on their partner.", "Careful now fella…this is AITA…and it’s an inalienable right to misuse words here. 😉😉", "Stop acting so crazy. No one misuses \"boundary\". You're just imagining that.", "There are no coincidences.", "Don’t worry, you won’t have a girlfriend for much longer, and then your many needs can always come first.", "Ngl I couldn't even tell one emoji was wrong until you pointed it out 😂", "Especially prepositions, homophones, and adverbs.", "Control freak = anyone who once gets upset for seemingly no good reason when things don't go their way", "Thank you.  Lol.", "Gaslight = \"Gaslighting is a form of emotional abuse in relationships. It happens when one person convinces their target that they're remembering things wrong or that they’re misinterpreting events. The gaslighter is trying to manipulate the other person and presents their own thoughts and feelings as the truth.\"\n https://www.webmd.com/mental-health/what-is-gaslighting-in-relationships#:~:text=Gaslighting%20is%20a%20form%20of,and%20feelings%20as%20the%20truth.\n\nNarcissist = my mother 😂", "Aaaahhh I knew I was missing some things!!", "Asking for ONE DAY to rest and recharge after a busy week is not too much to ask. The girlfriend sounds needy and a bit spoiled, or at least lacking in empathy. \n\nAlways submitting to the wants and needs of one partner isn't healthy, nor is not taking time for yourself when you need it.", "She would be doing OP a favor because as it stands, she sounds selfish. If she really needs to go out, she can call a friend.", "What an asinine, chronically online child take.", "Yes, they're different and the ass talker is you", "You could also add:  \nBoomer = Anyone that's at least 2 days older than you and has an opinion you disagree with", "“Meltdown:” anyone throwing a fit", "/u/Upperside7974 is a bot that copied part of [this comment](https://www.reddit.com/r/AmItheAsshole/comments/14yiy9d/aita_for_refusing_to_change_my_plans/jrta67l/)", "All right all right.", "\"Blowing up my phone\" - someone texted me to ask what happened", "There IS a compromise. He offered to go with her on MONDAY when they’re also both free instead of Sunday. But she’s demanding Sunday.", "You tell your husband that you have plans on Saturday(for sake of example let's say it's Wednesday). He says OK. Saturday comes by and he wants you to change your plans because he wants you to go out with him. He won't tell you why or anything else. So you go out with them, canceling something that you told him about earlier. \n\nPersonally I'd talk about it but your responses make it seem like any plans your spouses make trump your own, which is sad\n\n*edit a word", "You should not be giving mental health advice and nobody, absolutely nobody should be listening to you. Literally every single therapist will tell you that when you're feeling burnt out, you need to take care of your own needs first. They even tell you that you're not responsible for the mental health of the people around you, including your partner and if your partner is trying to push their mental health needs onto you, that you need to push back, assert yourself and take care of yourself first. Your advice is terrible. Stop, just stop. 31 years of compromising your own needs doesn't qualify you to advise people on how to handle their burnout.", "So your needs are expected to come first even in your husband's time of need. You didn't make a post, but YTA in your life.", "The compromise should be that she can let him chill and go out and do stuff alone", "Hey friend, we've already set a boundary in this thread for people to stop misusing the term boundary.\n\nPlease stop violating our boundaries.", "What a pointless comment.\n\nFeel free to block me or move on then, go ahead and enforce your \"boundary\".", "NTA, possible shit test. Good that you stood your ground.", "NTA struggling with mental health doesn’t mean she has the right to use it as a manipulation tactic to try and get her way.", "NTA.  But it sounds like your burn out is from work and not her.  While you are technically correct, this is one of those step up for your partner situations.  You could have done a short activity with her then had the rest of the day to yourself.  Now there will be additional friction in your life so you can video game.  \n\nNTA and I know this will get flack in 2023, but manning up and being there for your partner will help when you look at yourself in the mirror.", "NAH but you both sound exhausting.", "NTA. She sounds like a big baby", "NTA. You need this time off and you told her ahead of time. She sprung this on you. If she wants to go out so badly, suggest she ring up a friend and go somewhere for the day. You're in need of a mental health day so stick to your decision.", "Maybe there is a compromise? Do something relatively quick and small?", "ESH break up you’re not compatible. You recharge differently", "NTA - But I totally read the title as \"for refusing to change my pants?\".", "NTA\nSo she respected your de-stress day by making an argument?", "Severely mentally ill, here.   You are absolutely NTA.", "NTA. No, you need to take care of yourself first before you can help take care of others. Why can't she go solo? Call a friend? She needs to become reliant on herself and look to you for 100% of support that she may need.", "NTA. As you said, she could go out by herself or with friends.", "NTA, I regularly need those days at home to do exactly those things: read my book, watch my show, and play my current video game. My partner is respectful of that. And when I was stretching myself too thin between work, activities, friends, family, he encouraged me to block off that day in my calendar and not schedule anything or make any plans no matter what. If he feels the need to get out while I need to stay home, he goes out alone or with friends. We also make sure to schedule time for the two of us.   \nYour mental health does matter too and it's good that you're taking steps to take care of yourself :)", "NTA. Sometimes I need a good lazy day to stay home and decompress. Other times I need to get out of the house and be social or adventurous. Either way, I don’t force anyone to join me or plan their days around what I need. \n\nYou could have had your mental health day at home, and your girlfriend could have gone out alone (or with a friend, family member, etc) and done what would have made her feel better. I don’t understand why you couldn’t both get what you needed separately. It doesn’t sound like much fun to drag someone around who doesn’t want to be there.", "This is a power struggle and you're winning. She is testing your boundaries to see if you'll put her first. Whether she's doing it consciously or not is the question.", "Sounds like she thinks unfair means not getting what she wants, including interfering with someone else’s plans.", "Not only she is TA but also but did she keep pushing for it after you said no? \n\nWhat pleasure would it bring her to hang out with someone who she knew would rather not be hanging out with her on that particular date? I'd rather entertain myself or call some friends then drag out someone who didn't want to see me that day.", "NTA. Is she incapable of entertaining herself?", "NTA! She is unfair and trying to use a power move.", "NTA. I’m an extrovert, my husband is an introvert. Most of the time on our days off, he stays in, sleeps and plays video games while I go out with friends. This is because we both relax differently. Sometimes we go out together, but we always plan it and I don’t spring it on him because that’s not how he is wired. There is nothing wrong with you wanting to recharge at home. She should realize that the two of you are different and she should make plans with friends or family instead. Nothing wrong with some time apart.", "NTA. She knew your plans for the day and she can go do her own thing or wait one more day when you offered to do it. She's mad that she's not getting her way.", "Yeah I can’t even assess the situation because now “mental health” is the reason anyone does anything that might inconvenience or make other people ill. If for example, the girlfriend has a history of major depression and she’s saying she needs to go out then I’d shift things around to make that work.", "You should exercise, drink less mountain dew", "Has anyone told you you whine too much?", "His plans: Do not impact her at all\nHer plans: impact him massively. \n\nShe's not compromising at all, all the compromise has to come from him. Why is that acceptable? Hint: it isn't.", "We call it \"Can't People Day.\"", "I read it.  Did you read the pert where he said he also had Monday off which could have been a mental health day as well?  Did you read the part where I ask what he had planned?  Do you even read?", "Legit question, if I may ask, why is this not an example of boundaries? I always thought that enforcing a personal rule, like needing a certain amount of alone time, qualified as a boundary. Curious to know if I’ve been misusing the word! D:", "Same! This is the kind of thing that makes me super thankful not to be in a relationship lol. I can’t imagine feeling this much pressure over resting on one single weekend day, unless it was an important event (partner’s sibling’s wedding, etc). NTA.", "You are talking as if OP is the only one in history to ever feel burnt out.\n\nAlso, you losers seem to miss the point that the definition of AH is \"me me me me me me me\" which is what you and OP are.\n\nYou do as you please, I'm just glad I don't have toxic people like you all in my life.", "Are you boundary-lighting me?!", "Need to set boundaries around your gaslights. Think of the children!", "Honestly not sure why you're being down voted, hell maybe I'm wrong and misunderstanding what boundaries are but when I communicate my plans and someone tries to overstep them and I stay steadfast in what I say and with what I need, seems like communicating boundaries to me.", "That's how i see it too.", "May I gently correct you on the spelling of the word \"healthy?\" The correct spelling is d o o r m a t.", "NTA all day", "NTA. I never understand this with couples why men’s mental health and well-being matters less than women’s.", ".", "Happy wife happy life, applies to gf too, NTA but you deal with the consequences of it, if you have the monday off that's also a day you can spend doing the much needed alone/ chill time", "ESH\n\nDoes no one learn how to compromise these days?", ">I told her no because I made these plans first.\n\nSo... that's not a reason to not adjust your plans. It's the reasoning of a child. If you could do it the next day and putting it off of hurts nothing, why not put it off? YTA", "We do a similar thing.  Respect for your partner isn't that hard, when you remember that they have needs, too.", "He tried to by suggesting going out the next day. She said no.", "Idk what it is with you and the other YTAs.\n\nThe rest day *WAS* the plan for Sunday. If they'd planned it for Monday, then the plans would be on Monday.\n\nThey shouldn't have to reschedule to Monday when Monday is available. OP gave gf the heads up, reserved the day. If the gf also needs a day, she doesn't get to hijack OP's day, that they've been looking forward to, and sending it to Monday.\n\nOP's plans take priority. If the gf needs a day out, she can either go without OP or can go Monday. THAT'S the compromise.", "Relax is good for your mental health. You sound wound up, dude. Don't have a heart attack.", "Maybe she can get off her rear and go out on her own or with a friend without interfering with OPs plans. OPs plans do not affect her in the slightest. Entitled much?", "Does no one learn to read these days lol", "He also said he wouldn't change his plans because he had made his first. No one in this situation behaved in an adult fashion.", "His comments and general tone/approach are exhausting.", "Mountain Dew is gross", "I mean this whole post ffs.  It's not that hard to both do nothing one day and both do something another day.  Fighting over which day, two days in a row?  If you can't resolve these small things wait until the difficult things raise their ugly heads.", "Then you can tell her no", "Plans change all the time.  It’s common in the real world.  He had the bandwidth to make the change.  At some point he’s going to have to realize that.", "If it is a pattern, it could definitely be contributing to OP’s burnout.", "I dont think anyone is thinking this lol.", "Why does there need to be more? Your tinfoil hat might be on too tight.", "Right, and the OP refused multiple times. Presumably because they needed to take the time they needed to decompress.\n\nIf you value people, do you think the OP is less of a person? Or do selfish people matter more?\n\nYa know what was special about that day? They picked it. They set it aside. They told their gf about it. They were looking forward to it. They needed it.\n\nGf was being flat-out selfish to try to upend that, make the OP reschedule on her whims alone. She could've gone out without the OP, or gone out the next day.\n\nYou're applying all these courtesies to the gf but not to the OP. Try being even the least bit not hypocritical.", "Presumably because she really need it, or because she's massively entitled and could still go out with a friend or herself but wants OP to sacrifice while she sacrifices nothing? You shouldn't put someone else's mental health above your own.", "It could have been the gf's day out as well. Sunday was already booked. Planned. Scheduled.\n\nOh but gf wants a day too. Gosh, if only Monday was available, since Sunday isn't! What's complicated about that?\n\nWhy does gf's day HAVE to be on a day that's not available? Why can't it be Monday? Why is OP obligated to uproot his mental health day? Why the seemingly sexist double standard?", "You need to stop crossing my boundaries about wanting to misuse that word. I have the agency to do whatever I want. It's a huge red flag that you would even say this. You will probably now gaslight me into thinking I am crazy and tell me that I should divorce my spouse immediately due to this issue. I will now grey rock you because I feel like you are trying to groom me for something that I, as a full-grown adult with auntomy, should be able to decide for myself.\n\nDid I miss anything? 🤣", "I find it so funny when people say that because, let’s be honest, most people are the main character and should be the “main character” in their own lives. It’s important to have good relationships, treat people with respect, help others, etc. But damn! You should be happy too and the idea that being the main character in your own life is a bad thing is a little upsetting. People deserve to do things that make them happy and that shouldn’t mean they have to sacrifice friends/family", "Because it’s a communication of your needs. Explaining what you need for your mental health and for a healthy relationship is just communicating your needs. \n\nA boundary is an interpersonal limit. This could’ve been made into a boundary if the conversation turned more towards the direction of “in order for me to feel respected and valued in this relationship, it is essential that when I ask for time to recharge, I receive that. I understand you too are a part of this relationship and am willing to have a discussion or help you with your needs, but it’s impossible for me to be helpful if I am also suffering.” \n\nA boundary is literally drawing a line in the sand that is not allowed to be crossed. This doesn’t count if you are claiming a boundary in order to control another person. Also if you have healthy boundaries and they are not respected, it is crucial to take it very seriously. Most people shouldn’t have 100 boundaries(this is because most people find themselves in relationships that are with people of similar moral values so certain things just wouldn’t ever be an issue). If you find you need a ton of boundaries in your relationship, it’s probably time to consider your compatibility with your partner when it comes to morality and core values. \n\nHope this helps! \n\nAlso just want to say I don’t expect the majority of people to communicate it in the way I wrote it out, that’s just an example, most people aren’t as robotic as me.", "The left one is angry.  Right one is smiling.  Lol.", "😭😭 I’m dead!!", "Being the main character in your own existence is one thing, expecting the world at large to behave like you're the star and they're NPCs to play backdrop to your fuckery is another.", "You're a hypocrite. You are talking about the gf like she's the only one with issues and are completely disregarding any feelings OP has. You also still haven't made a valid argument as to why the gf is more important. And being selfish is not the definition of being an asshole. Sometimes you have to take care of yourself and that's ok. I'm sorry that you're a doormat.", "Gas lights cannot be lit between the time of sunrise and sunset.\n\nHow's that for a boundary around gaslights?", "I think correlating a boundary with something that would be on level of dealbreakers isn't really fair to yourself or others.\n\nI would argue that a boundary is something, that if crossed, would create sanctions and could foster feelings of distrust, but I don't think it needs to be relationship ending to be considered one.\n\nFor example, if I tell my girlfriend not to eat the leftover food I made, I would consider that a boundary. If she then brings it with her to work for lunch and leaves me out to dry though, I wouldn't break up with her over it lol.\n\nI agree with you on the separation of communicating needs vs setting boundaries but I view it more as \"I need this\" and \"you can not do this\".", "I agree, I’m just saying it’s a funny sentiment", "NTA - bordering on NAH.\n\nIt sounds like you’re *both* not doing well & have diverging ways to decompress/feel better. I’ve been on both sides. On the one hand, I can see that you set your heart set on just making it to Sun so you can let everything out that you’ve been holding in. (And if you were to go out, you’d still have to hold your frustration/stress in & almost put in a mask in order for her to have a good day.) I can also see how when you’ve been feeling really isolated/crummy, the urge to pull yourself out of it can come very sporadically and disappear just as quickly. (And then you feel even more sunken into the sadness/bad feelings.) \n\nWhat I think is hard for her to see is that even if you 2 were to have gone out, it wouldn’t have been a fun day for either of you. She’d want you to be as invested as she is, and that would more pressure on you. Things are bound to implode in a situation like that because of where you both are mentally, and that’s not fun for anyone.\n\nI would say take your day to decompress, and when you’re feeling better, communicate your feelings as clearly & neutrally as you can about the situation: you recognize where she’s coming from, but there’s no way you could have pulled yourself together to be as present that day as she would have needed you to be. See if you can meet on common ground of care, understanding, and appreciation for one another. \n\nI really hope you both feel better soon!! God luck!!", "What a bad girlfriend. Completely dismissed his mental health needs for her own. Literally as if she should be coming before himself. Selfish.", "It's a double edged sword. I think the recent focus on mental health as a thing we need to watch is great, BUT we are responsible for our own mental health needs.\n\nWe don't all get an emotional support human at our beck and call. And we need to learn how to meet our own needs when an emotional support human isn't available or willing.", "Maybe try communicating and sorting that out? Marriage doesn’t have to suck.", "Why? Why does everything need to be a compromise? He told her his plans to do nothing because he felt burnt out. He tried compromising by suggesting the next day to do stuff.", "Hell no. It's 2023. Men deserve to have their needs met as well as women.", "What about her? Why can’t she put her plans off either? She knew about his plans and waited till day of to ask which makes it worse. The same should be for her. If she has a day off on Monday than why can’t she wait till then?", "They made plans for Sunday.\n\nWhy couldn't gf make plans for a day when, ya know, plans hadn't already been made?", "Key difference in each plan that you're not paying attention to though:\n\nOPs partner wants to leave the house. She does not need OP to do this with her. She can leave alone or go with a friend. It is NOT OPs job to put her mental health over his own, and in fact should be discouraged from doing that because if he's burnt out, he's no use to anyone. Basic care principle. \n\nOPs plan do not impose on his partner in any way. She still has full reign to do exactly what she wants, just without OP. Why should he sacrifice his mental health for another day just to accommodate someone who can do what they want anyway without him?", "One of the biggest game changers about being motivated to go to things for me was exactly this. Booking the Monday off to drive back or chill out if coming back on a Sunday after a weekend event. \n\nNo surprises my better half suggested it…", "or as a loving partner, you can communicate peacefully and plan to address it at a time convenient for both. “She can Stfu” isn’t good relationship advice.", "If she is half the manipulative abuser I think she is then yes it is.\n\nHe has made it abundantly clear well in advance that he finally needs some time to rest and she is mounting a campaign to rob him off that when he is already vulnerable.\n\nA boundary needs to be set and it is vital that she isn't allowed to pivot and rob him of his day of rest by her replacing it with a day of relationship drama.  A very firm \"not today, I'm resting!\" and literally nothing else is appropriate until she accepts that she can't take that away from him.", "What was he going to do that wouldn't lose self respect? He's burnt out and planned a day for himself and ok it a week in advance, the girlfriend then tries to take over those plans the day of, op suggests a great compromise of her going out with a friend", "How is that not acting like an adult? If anything the gf was the childish one. He made it clear a week in advance his plans for that day. He tried to compromise with her about going out the next day or even if she wanted to go without him or with friends she could. He was absolutely correct that his mental health was just as important as hers. She was trying to trample on that. Unless he was stomping his feet and whining like a little kid then he acted like an adult would.", "He says on a comment thread started by someone doing exactly that.", "Exactly what I was thinking", "Does maintaining one's self respect require intransigence? Does it require digging in one's heels? It still seems neither party behaved with any particular maturity in this situation.  Why does this opinion rankle so?", "No they refused multiple times because they were an AH.\n\nAnd going by your selfish views, why aren't you saying N A H or E S H if they are both acting similarly?\n\nBecause in your world, all you do is take care of yourself without giving a fuck about others. There's a word for that. It's called selfish. There's another word for that. It's called AH.", "Honey, how often do you do what she asks because of her mental health? How much of the mental load are you carrying? Is she getting support? Seeing a therapist? Talking to anyone other than you? Are you feeling burnt out because of this?\n\nYou're allowed to say no to your partner. You're allowed to prioritize your needs. Making plans for yourself on your day off does not make you an asshole. A good therapist can help you determine if this relationship is truly serving your needs or not. You deserve a soft life full of love and a partner who contributes meaningfully to that. You are worthy. ❤️  Be kind to yourself. NTA.", "Yea I recently realized I’m an extrovert (apparently when my mental health is good I actually can function lmao) and my roommate is an introvert. If I want to do something we either have to plan it a few days in advance so she can mentally prepare for it or I have to find someone else. \n\nAnd I know to leave her alone when she needs time because I’m not an AH.", "Let's see...DARVO and \"don't set yourself on fire...\" \n\nI'm sure there's waaay more.", "Lol. True. I also forgot FAFO 😄", "A boundary is just a line you don’t want people to cross. Some are deal breakers, some aren’t. A boundary of mine is don’t watch certain shows around me, but if someone forget, I just mention it. Others, like ultimatums, are basically deal breakers."]}