{"id": 22153, "submission_id": "14yu7t1", "title": "AITA for getting a guy arrested in a minor traffic accident?", "selftext": "Struggling to decide if IATA in this situation. Got lightly rear-ended turning out of the neighborhood yesterday. 35 yr old guy was super apologetic and there was very limited surface damage to my rear bumper. He agreed to pull into a nearby strip mall to exchange info but said he was in a hurry to get to work.  \n\nWe’ve been burned before in hand-shake accident info exchanges so my husband now insists I always get a police report just in case damage is worse than it appears.\n\nOnce dude realized I was calling the police he starts begging me not to because he doesn’t have a license and he can’t go back to jail and he needs to get to work (he’s dressed in casino deal uniform). He’s pleading and insisting it is no big deal and I’m going to ruin his life over nothing.  Keeps asking why can’t I just take his insurance info? Plus his dog is home alone?!\n\nI insist on the police report just as documentation and apologize that it isn’t personal and I can’t be responsible for his issues.  He was clearly panicked and calling work and his mom and someone to deal with the dog. \n\nOnce police arrive they quickly figure out he’s not supposed to be driving and is cuffed and put in the squad car. Shortly after an ambulance and fire truck pull up because he’s apparently having a panic attack.  😳\n\nSooooo AITA for not giving this dude a break? Feeling pretty terrible today. But at the same time, it is pretty standard to get a police report and dude shouldn’t have been driving.", "created_utc": 1689276975, "permalink": "/r/AmItheAsshole/comments/14yu7t1/aita_for_getting_a_guy_arrested_in_a_minor/", "score": 302, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I feel like this guy was honest about his situation and was begging me to help him out by not reporting such a minor accident. I believe I might be the asshole because I didn’t give in and insisted on the police resulting in apparent big trouble for him.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. If he's driving without a driver's license, he's most likely uninsured and may have given you false information. He's the reason laws are made in the first place. Don't do the crime if you can't do the time.", "NTA. That insurance card was fake. Insurance companies do NOT write policies for unlicensed drivers. And if the policy was someone else's, all that person has to do is say the dude didn't have permission to be driving it and the insurance wouldn't cover it.", "NTA. I'd like to believe he would have done the right thing and paid for your damages. But, if he's already breaking the law by driving without a license, chances are doing the right thing is not his thing.", "NTA.\n\nI mean, you're supposed to file a police report in any sort of car accident. You weren't in the wrong, you were rear-ended. Despite how lightly it might've been, it's still an accident. You did a good thing. He tried to guilt you into letting him go. Yes, it might've been true all that he says, but you have to make sure to cover all bases.\n\nAnd yeah, apparently he's not even supposed to be driving lol. Anyone who's not supposed to be driving should not be driving for a reason. You did yourself a fair one and saved other people from possibly getting injured/screwed over.", "NTA - But you're gonna live with that. Technically you were right, technically he had no business being on the road. But depending on what happens to him that is indeed going to be the cost of what you describe as \"very limited surface damage\" \n\nBut he was playing a losing game, all it would take is expired tags, a poor lane change, a California stop, what have you, any traffic infraction would land this guy in the same place. \n\nThat's a hard one bud.", "NTA\n\nIf he is driving without a license that means one of two things. He either couldn't pass the test to get one, or he had it taken away. Also I don't know where you live, but in a lot of places you cannot get any kind of insurance other than parking insurance without a license. \n\nIn most cases licenses are taken for dangerous driving infractions. Things like DUIs, or excessive moving violations. In some cases it is revoked or suspended due to failure to make child support payments, but that is extremely uncommon. Though the fact that he rear ended you strongly suggests that it was most likely revoked due to unsafe driving.\n\nBottom line is that this person didn't have a license for a reason, and should not have been driving. Period.", "NTA.  He doesn't have a license for a good reason and should be arrested.", "NTA - You followed your instinct and the law.  It's not up to you to cover that guy.", "NTA.   Driving without a license...he got what he deserved", "NTA. They just take your license for giggles. They take it for thinks like reckless endangerment and DUI... which means he should not have been driving.", "NTA.\n\nI'm not sure how likely it is that he has valid insurance and no driver's license.\n\nRegardless, it is not your job to decide which lawbreakers get to skate on which laws.", "NTA. He shouldn't have been driving.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nStruggling to decide if IATA in this situation. Got lightly rear-ended turning out of the neighborhood yesterday. 35 yr old guy was super apologetic and there was very limited surface damage to my rear bumper. He agreed to pull into a nearby strip mall to exchange info but said he was in a hurry to get to work.  \n\nWe’ve been burned before in hand-shake accident info exchanges so my husband now insists I always get a police report just in case damage is worse than it appears.\n\nOnce dude realized I was calling the police he starts begging me not to because he doesn’t have a license and he can’t go back to jail and he needs to get to work (he’s dressed in casino deal uniform). He’s pleading and insisting it is no big deal and I’m going to ruin his life over nothing.  Keeps asking why can’t I just take his insurance info? Plus his dog is home alone?!\n\nI insist on the police report just as documentation and apologize that it isn’t personal and I can’t be responsible for his issues.  He was clearly panicked and calling work and his mom and someone to deal with the dog. \n\nOnce police arrive they quickly figure out he’s not supposed to be driving and is cuffed and put in the squad car. Shortly after an ambulance and fire truck pull up because he’s apparently having a panic attack.  😳\n\nSooooo AITA for not giving this dude a break? Feeling pretty terrible today. But at the same time, it is pretty standard to get a police report and dude shouldn’t have been driving. \n\nThe real kicker? Once I looked at the guy’s info later, I realize I taught two kids who live at the house. So probably their teacher being a rule-follower got their uncle/brother/cousin or something arrested. 😣\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA but it is okay to feel shitty you ruined his life.", "NTA:   But you may have just kinda screwed yourself.  The guy can't pay if he has no job and in jail lol", "\"Keeps asking why can’t I just take his insurance info?\"\n\nIf he doesn't have a license, then he also doesn't actually have Auto insurance. Carriers run driving record reports and whatnot. If someone doesn't have a license, then nobody is going to issue them an Auto policy. He was probably going to give you bogus information. I've seen it happen many times.\nNTA.", "Lol NTA, that sounds like his own problem not yours", "NTA, although if it was solely your husband’s advice and not something you wanted to do then there’s definitely something you want to think about there.", "ESH\n\nIt is possible to be insured without a valid license. Its also possible to have a license suspended due to the DMV not processing their own paperwork in  timely manner", "NTA.  He tried to scam you, and you protected yourself.", "NTA He doesn't have a license and he has already been in jail. Sorry he needs to learn his lesson!", "NTA. Former Police Officer and have seen too many people wind up with having to pay for their own damage when the \"nice guy\" fails to pay for the damage they caused or wants to argue that the $3000 repaid should only be $1000. \n\nAs far as filing a police report, insurance companies will all want a report number. Police may respond to any crash call, even on private property depending on any local laws and department policy.", "Tough to make a valid ruling here. Police dont arrest for no license. They arrest sometimes for suspended license, meaning the person did something bad with a car or has a very long history of not doing something they are supposed to. So what did the guy do to get his license suspended? Did he drive drunk? Flee the scene of an accident? Run someone over? Or does he just have a history of not taking care of the things he is supposed to, like having insurance, renewing his license on time, paying child support, or? If it was for one of the former reasons, I would say N T A. People who drive drunk or leave the scene of an accident or hurt someone with a car deserve what happens to them. If it was a paperwork issue, maybe not so much. \n\nThe guy was clearly on his way to work. That says to me that he is trying to pull himself out of a hole. Maybe he dug that hole himself with his own two hands, but nevertheless he is trying. He also made no attempt to get away, but waited for the police knowing he would be arrested when they arrived. I don't think he was an evil person trying to take advantage of you. So you may have sabotaged his efforts to improve his life, just because you wanted to involve the police in a minor fender bender that could easily have been resolved with an information exchange. And if so, that would mean that Y T A. \n\nI'll let you decide which one you feel like as more info comes in.", "wait a sec?! driver doesnt have a license but has insurance?! downfall of murica. no wonder we cant make it great again. NTA.", "YTA purely because you say the damage was minimal. \n\nIf he'd totalled the car you gotta do what you gotta do. A scuff in the paintwork isn't worth destroying someone's attempt to get back on track.", "yta..... you should have switched info and let the insurance company deal with it.", "NTA.\n\n*dura lex sed lex*", "NTA. he most likely didn’t have insurance and you didn’t ruin his life, he knowingly drove without a license and this could’ve been so much worse for him had it been a bigger accident. it isn’t your fault that they chose to arrest him, that is a risk he took when he chose to drive without a license.", "NTA. I don't know about everywhere, but in one state I lived in, you have to report an accident to the police if there is damage over $x. I think it was $1,000 at the time? Anyway, if you aren't a mechanic or car buff, you might not realize that just a couple of dents in the right place can easily cost >$1,000. \n\nReporting it, even if the damage seems minor, is best. CYA people! I've been in a few minor accidents over the years, mostly fender benders. Call #1- police *non-emergency* line unless there are injuries or a traffic hazard, then use 911 or your country's equivalent.  Call #2- insurance.\n\nI had someone come flying out of a blind driveway and hit the side of my truck. Crumpled in a large portion of the passenger side, cab and truck bed. He not only didn't want me to call the police he didn't want me to call my insurance. He'd just pay for the repairs. Yeah, no. Not happening.\n\nNTA. He chose to drive without a license, now he has to deal with the consequences.", "I don't think \"very limited surface damage\" is worth potentially blowing someone's life up, so I'm going with the unpopular take that yeah, YTA. Worst case scenario if he was indeed scamming you is you have some unsightly scrapes on your bumper until you can afford to have it repaired. Sounds like his worst case scenario is a hell of a lot worse, with much more far-reaching consequences.", "switching information invludes drivers ñicense and identity. taking photo of plate and driver and damage", "You absolutely can get insurance without a license, and in fact if your license gets suspended you typically need to prove that you have insurance in order to get it reinstated.  Also, if you finance a car your lender may require it to be insured as a condition of the note whether or not you maintain a valid driver's license.  An unlicensed driver may not be able to get a policy from one of the big companies, but there are plenty of smaller (typically crappier) insurance companies that will write those policies.", "you do not need to file a police report in minor traffic accidents.", "The police won’t come if the accident occurred on private property. I don’t think you were taught correctly.", "This is where I'm at with this one too... OP is definitely NTA, but the whole system is fucked considering it's entirely possible Mr. No license's license was revoked due to a clerical error or an overzealous cop who saw he was in jail in the past during a traffic stop.\n\nThe US is brutal for ex-cons and the rest of it is brutal for anyone poor or minority. IMO this whole situation is going to end up needlessly hurting Mr. No license WAAAAAY more than is appropriate for what he did.\n\nI really wish our justice system was focused on rehabilitation and stopping recidivism instead of the hard-on for \"an eye for an eye\" mentality of punishment we currently have.", "Its not true at all that you cant get insurance without a license.", "He said he has insurance.", "This is actually not true. I have a good friend who has no license, hasn't in 20+ years, and not only has insurance but has financed numerous vehicles in that time. Nice vehicles even, from high end dealerships.", "Probably got his insurance revoked after whatever happened to make him lose his license.", "The license requirement is hardly \"harsh\"", "Yup. I hit a car 2 yrs ago and we took photos of eCh other license plate, sent each other photo of dl and insurance info. Then I called my insurance and they said to tell him they'd take care of it.\n\nOther than the deductible I was taken care of. My insurance went up but there have been crazy tons of carjacking so no way to know how much was that v my accident.", "In the US, driving without a license is illegal in every state. You have to have a license to drive on public roads (most states differentiate between operating a vehicle without a valid driver's license and driving a vehicle without proof of a driver's license (such as when a driver fails to physically carry their valid driver's license)). \n\nIn the U.K. it’s also illegal.", "It's a good thing that OP did so.  NTA", "If he doesn't have a valid license, he can't get insurance. That was just BS to try and get out it.", "But if he doesn't have a license, why is he buying cars?", "Your friend shouldn't drive without a license.", "the end result does not change.... the insurance companies can go after the individual civilly or a write off. Sometimes the car is insured , but not sure how that works.", "Yeah obviously it's illegal to drive on public roads without a license.  That doesn't mean you can't get car insurance if you own a car and get your license suspended.", "A person can definitely get insurance without a license, there are tons of rich people who have cars and a chauffeur and never drive", "how so?", "Yes you can in some places. Also, you can have a license and insurance and lose said license without the insurance company knowing.", "To drive them", "I agree", "Why (and how) is he driving without a license?", "Unpopular but YTA. \n\nTechnically, you’re right. Morally, I’d say you’re a massive AH. You potentially assisted in ruining him over what you admit is minimal damage.", "I just feel bad for the guys dog.", "ESH\n\nHe shouldn’t be driving without a license. \n\nIf it was truly minor surface damage, it wasn’t worth possibly ruining a life over.", "Unpopular opinion but I'm stuck between ESH and YTA. I'm going to lean towards ESH because you both could've handled this differently. \n\nHe shouldn't be driving without a license. Whatever reason he has for not having a license is his business that he needs to figure out. I can understand getting to work and errands especially in a place with no/limited public transportation. That makes him the AH in this scenario. \n\nYou absolutely don't need to fill out a police report in every accident, especially as minor as you're making this out to be. About a year ago someone backed in to me leaving a parking lot and ripped off my rear bumper and damaged the quarter panel. We exchanged licenses and insurance and went about our way. Insurance took care of my car and everything is good now. \n\nMy only issue with this situation is again leaning toward NTA - and that's if he has no drivers license, how are you supposed to get pictures of his drivers license?", "YTA I don't care that this is probably an unpopular opinion that will get downvoted out of sight, like, you know you fucked this man over and that's why you feel guilty", "Fuck that guy. You drive without insurance or a license, you are the worst kind of people", "Nta. Reading all the comments, whether or not someone can be insured if they don't have a driver's license, it doesn't  matter. If an unlicensed driver is driving, nothing will get covered. You made the right call.", "Honestly, could you have easily gotten your car fixed?  I mean, you didn’t get any money from him…YTA.  Simple mistake and involved the cops for no reason.  I’d understand if your car was totaled but ugh, you absolutely suck", "You did the right thing. Pretty sure his insurance would be void in any case, due to having no licence and all.", "NTA, I was saved by a police report after being rearended while in HS.  I was in a small compact car and the driver was in a large pickup truck.  They wanted to write down their info for me.  A couple that saw it go down, the man stepped in to defend me and the wife went to a pay phone to call the cops (it was the 80's). The cops took all the insurance cards from both of us.  It ends up the frame of my car was bent and was declared totaled.  You can bet if I took the info that he wanted to write down it would have been all fake.", "I got burned once with a collision, happened to be my first.  I've lost count on the number I've been in over the last 20 years, have put on a LOT of miles.\n\nEnded up she had a fake license AND her plate wasn't in the system.\n\nNow I take a lot of pictures.  License, license plate, vin, and ANY damage to thier vehicle even if it's in no way relevant (rear end collision, but they have a dented door?  Picture).\n\nWe used to have a rule of damage over $1000 needing police to respond for insurance purposes, but when it got that a 2\" scratch was $3000 worth of paint they changed that to any time a vehicle was undriveable or you suspect someone is impaired.\n\nBetter off making the call and having a report number even if you don't need it, than having to deal with insurance not having it.", "NTA. \nALWAYS get a police report in these situations. NO EXCEPTIONS!!!", "NTA. It’s just a sucky situation, OP. You gotta CYA, even when it’s against good people. Doesn’t make you an AH.", "I WISH all unlicensed motorists were arrested", "Nta you did what your supposed to do in an accident it not your fault he was driving illegally you didn't make him drive", "If it wasn't a plain fake, the policy may have been cancelled.   What if his license was suspended *because* he doesn't have insurance?", "I was rear-ended and there was mild bumper damage.  The car did not handle right as I tried to drive home. It ends up the truck hit my car just right that it bent the frame in such away the car was totaled.", "It is not a requirement at all to file a police report for a traffic collision.", ">you're supposed to file a police report in any sort of car accident\n\nI just googled this for where I live in the US - my local PD says after a collision to call 911 IF medical or police response is needed. They give a link where you can simply report the collision online if you want to (and you have to do so over a certain damage threshold). I do wish they'd include some guidelines for which situation require police response, but according to them it's not 100% of collisions.", "No you aren’t, stop spreading bad information.", "I mean not really, I didn't have a license for a while but I still have to get too work to eat and pay bills. Public transportation isn't everywhere and some people don't have family to rely on.", "Agree. Laws around having your car insured and driving with a license exist for a reason. Yes, some people don’t have a license because they can’t afford it, but that is the minority. I would hazard that MOST people driving without a license had their license suspended for a reason (DUI, extreme speeding, etc. etc.). There is a reason they have been deemed to unfit to drive a car because bad driving is inherently risky to other people. \n\nAlso, as unfortunate as this situation is, it’s not OPs responsibility to take on the (possibly large) financial burden of another person’s decisions and mistakes. Even a “minor” accident can cost thousands of dollars and also can impact the value of a vehicle when reselling. \n\nNTA.", "No, in many cases a license is taken away for being too poor to pay a minor traffic fine.", "It's much more likely that his license was suspended because he didn't have valid insurance.", "Shouldn't be driving without a license then. Actions have consequences and he learned the hard way.", "How would OP have screwed themselves?\n\nThe guy wasn't negotiating paying out of pocket for repairs.", "Agreed, but to add if it's just light surface damage without actual body damage (dents cracks etc) it can be buffed out eith rubbing compound and a cloth. Like 5 years ago someone rolled in to me because their foot slipped off the brake. Pulled over and he had some rubbing compound in his jeep, so I tried that first and it looked the same as before the bump, so we just split ways.", "This guy has a suspended license for a reason. The courts have decided he is unfit to be on the roads, yet here he is, driving on the roads. For all we know, he's a habitual drunk driver. Glad he got caught in a minor fender bender and not a fatal crash.\n\nNTA", "He's ruined his own life by driving on a suspended license. He knew the risk when he got behind the wheel.", "They also take it when you’re too poor to pay minor traffic fines.", "Not necessarily. Your license can be suspended simply for failing to pay a fine from another traffic ticket. I don’t know what the case is for the guy who hit OP, but people get their license revoked/suspended for lots of reasons that don’t include dangerous behavior.", "It's also possible that he's had multiple DUIs or been charged with wreckless endangerment. Dude had a suspended license. He shouldn't be driving.", "You absolutely can buy car insurance without a valid license in many places, including several states in the US. Having that insurance pay out when you're driving without a license is a different matter.", "This isn’t true, why do people keep posting this?", "Wife is a current insurance employee and no they don’t always need a report number.", ">you may have sabotaged his efforts to improve his life, just because you wanted to involve the police in a minor fender bender that could easily have been resolved with an information exchange.\n\nLol 🤣 only one person ruined their life and op isn't a part of it", "Modern cars have a litany of unseen safety devices that can be rendered unusable even if the outside of the vehicle looks fine.", "How do you know if the car's totalled when looking at it?\n\nAre you a mechanic? Auto expert? Repair shop?", "He had insurance.", "They will. But now it's a lot easier for them to find them, in prison", "If he's unlicensed, the insurance policy on the vehicle will likely not pay out.", "Policies will also cover collisions with unlicensed drivers. For context, I work in the insurance industry. We cover claims daily for people who no longer have an active driver’s license. The policy will most likely go up in cost exponentially at the renewal. People have policies and license expire or get revoked. It does not mean the policy gets canceled. Government agencies do not provide updates to private insurances companies regarding the validity of a license. People hear one thing one time in 1997 and take it as a fact for life.", "[deleted]", "Maybe you can get insurance but if you are driving without a license the insurance company will refuse to pay the claim. They will not cover if you are engaged in an activity that is breaking the law.", "You're nitpicking. Of course you can get it but it would be void if you're driving unlicensed.", "But those sorts of policies are to cover fire, theft etc. No insurer will pay out if you are driving without a licence. It's breaking the law and the terms of the policy.", "You can probably buy a policy without a license but no insurer is going to pay out if the driver is unqualified and, by the sounds of it,  committing a crime at the time of the accident. If OP doesn't have uninsured motorist protection on their policy they could also have issues.", "I think it's much more likely that his license got suspended for letting his insurance lapse, than that he has valid insurance and no license.", "Yup. I’m a former public defender and I represented so many people who were caught driving without a license or on a suspended license. They get caught in a cycle. That becomes nearly impossible to break free from. \n\nFirst, they get a traffic ticket for a minor violation like having a broken tail light. They live in poverty and are unable to pay the fine. They get their license suspended for failing to pay the ticket. They live in a city with a poor public transportation system and have no way to work unless they drive. \n\nBecause they live in poverty they also live in a high crime area where the local police tend to make a disproportionately high number of traffic stops looking for drugs and people with active warrants all under the guise of a legitimate traffic stop. Therefore, they get pulled over again because the cops ran their plate at a traffic light and see they have a suspended license. They are arrested and have a charge for driving on a suspended license with comes with the possibility of six months in jail and a hefty fine. \n\nThe court rarely sends people to jail for driving without/on a suspended license, but have no problem dishing out the big fines. They can’t get their license reinstated until they pay all their fines and pay a large “reinstatement fee” to the BMV. They also have to carry expensive high risk insurance. If they ever want to get their license back they have to work. But to get to work they have to drive……..and it just goes on and on. They often have little to no support system and limited options. \n\nObviously, they should not be breaking the law. But it really is more complicated than it seems at first glance. \n\nOP is NTA. It’s not their fault that the accident happened and they are not responsible for the guy’s life situation. I think OP is a good person because they seem to have empathy for the man’s situation. But it’s not their fault that the system makes things so difficult for so many.", "Someone hit the front of my car while it was parked. It drove perfectly after. When I got it fixed, the other driver’s insurance told me that had it been slightly more money, the car would have been considered a total loss.\n\nIt’s often not that the car isn’t fixable, but that the cost is higher than insurance wants to pay.", "Depends on where you are. Where I am, if there is more than $500 worth of damage, the police should be contacted. It doesn't take much to rack up $500 worth of damage", "It depends on where you live. Where we live, the first thing that insurance is going to ask about when you go to file a claim is “can we have a copy of the police report” as the police report often determines who is at fault. It would be leaving the scene of an accident to not file a report. My husband was hit by a driver last year who literally ran for it after he realized my husband was calling the cops. Turns out it wasn’t his car and car belonged to the passenger (his GF but she claimed not to know him?) grandmother. I don’t want to get other people in trouble but I’m also not in the position to take on that expense of the damage they caused to my vehicle (and in this case there were several witnesses all willing to say the other driver was 100% at fault and driving extremely recklessly).", "Maybe that depends on the state. I was hit on private property. The police came. They won't do an official report here, but will do a receipt of accident I think it was called? Like a report.", "You’re right, you can get insurance without a valid driver’s license. However (having worked in insurance), I can tell you that any person on a policy that does not have a valid license is typically not covered in the event of an accident. So a claim can be denied if the driver does not have a license with the exception of a permit with a licensed driver in the front passenger seat. So OP would need the police report (more than likely depending on her adjuster) to use her own policy to cover damages if the claim was denied.", "Again, that depends entirely on where you live. Which is why I explicitly said that. I also didn't say that you can't get insurance. I said that without a valid driver's license, in many places you are only eligible for parking insurance that covers things like theft, and fire. It usually doesn't cover driving collision insurance.", "If you're going to make that kind of claim, then please provide evidence of it being common to lose your license for a \"minor traffic fine\". \n\nAs where I live the only way they will take your license for outstanding fines, is if your fines total at *least* $2000-3000, which is in no way \"minor\". Even in the instance of a DUI, they usually won't take your license for a first time infraction.", "Ok or he got a parking ticket that he couldn’t pay and that got his license suspended. We cannot know why this person didn’t have a license, a lot of what I’ve been reading on this post has boiled down to “Well he’s poor so he deserves it.” I’m not saying that’s exactly what you’re claiming but do you really trust the courts cause I sure as hell don’t.", "If OP says the damage is minimal, the car isn’t totaled. Do you know what that means? Doesn’t seem like you do.", "arnt you heartless.\n\nThe joy that ozzes from your reply at the thought of some guy is in jail is revolting.", "not true...", "My blind uncle had his own car and car insurance. He often hired college kids to dive him around for work or whatever, and they often didn't have cars of their own.", "They're not saying driving without a license is legal - they're saying you can buy insurance on a vehicle without having a valid license.", "Yeah I'm a lawyer and do coverage work, among other things.  It's so funny how confidently wrong people can be.", "I doubt it says that.", "That's just not true.", "That's typically not true.", "Lack of a valid driver's license is not a typical exclusion for liability coverage in an auto policy, nor is breaking the law (with the exception of intentionally causing injury with your car, that is excluded).", "Not having a license is typically not grounds for denying liability coverage on an auto policy.\n\nEdit: also committing a crime is also not typically grounds for denial unless you are intentionally trying to injure someone with the car.  Hitting someone while dui or fleeing from the police, for example, are covered.", "true.... everything i said has an assumption that it took place in usa.\n\nIn colombia they have a rule that every accident needs to have police come and write a report,..cant even move cars from blocking the street for simple fender benders.", "This is wrong.", "OP isn't a mechanic. The only way to ensure the damage was minimal is by taking it to one.", "What's minimal?\n\nWhat about hidden damages?\n\nThere are lots of ways for a car to be totalled", ">arnt\n\nWhat?\n\n>ozzes\n\nWhat?", "[deleted]", "Because the driver in this instance was unlicensed, and the policy likely would not have covered this unlicensed driver?", "dont worry about it.😅😅😅", "If your license is suspended for not having car insurance, how are you supposed to get your license back without buying insurance?\n\nWorked for the DMV in Florida for years - you have to show proof of insurance to clear license suspensions all the time.", "not true,.. but even if it is.. the process of claims does not change. your insurance handles it the way they want to handle it...getting the guy arrested is probably a disadvantage to anyone seeking to get any payment from the guy.", "Bingo. Driving without a license voided his policy, he would absolutely not be covered.", "[deleted]", "look it up... just not true\n\nquote:\nWhile your car insurance won't be canceled automatically just because your license is suspended, you still can't drive legally. Your car is insured.\n\nSome states suspend your license without warning for parling tickets... i found out my license was suspended when i got pulled over for registration being late. Still insured the whole time.", "I never once said it was easy.\n\nYou said you cannot buy insurance without a valid license. I, as a DMV clerk, routinely took insurance purchased by unlicensed drivers to reinstate their license.\n\nEdit - lol did you seriously block me over civil disagreement about *car insurance*?", "[deleted]", "Look up sr-22 insurance", "This comment section is pissing me off so much. So many people are saying that since he has a criminal past he deserves to have his life ruined, y’all need to remember that felons are human too! Didn’t think that was someone that needed to be said but here we are. Honestly I don’t think there is an AH in this situation. OP has a right to protect themself from being scammed and the dude deserves to be able to get to work so that he and his dog don’t starve.", "YTA.", "YTA, and a massive one.\n\nLiterally all you had to do was photograph his stuff. You drastically escalated the situation and involved violent people for absolutely no reason. You caused this man to have a medical crisis. You very likely cost him his only source of income. Since he said BACK to prison, it is going to be very hard for him to find work.\n\nYou absolutely should feel terrible for a very long time. You ruined this guy's life over minor cosmetic damage to your car.", "Well, he hasn't been to jail, or he wouldn't be working at a casino...so that was a lie. Not to mention, if he doesn't have a license, he also doesn't have an insurance company that is going to cover the accident since he was driving while suspended. So maybe he has insurance on the car but the damage will not get covered for his accident if he's driving illegally.", "YTA.", "NTA, he shouldn't have been driving no matter what. In lots of places the police won't even show up for minor accidents, though.", "Sorry, but I think you were the AH. Your insurance will pay for your car to be fixed if you are hit by an uninsured driver. You photograph the license plate. You get his name, you confirm you have his real number, and you file a police report if he doesn’t come through. \n\nIn large urban areas, police won’t even respond to a traffic stop like that. They want you to either come by a station later, call, or file a report online. \n\nGetting him arrested, you are more likely to need to go through insurance and increase your premium. Not less likely.", "YTA.", "You know who ruined the guy's life? All the people who hit people, and promise to pay for it, then don't. Like OP said, \"been burned before\". It's just a different kind of paying it forward.", "You're massive YTA for calling the cops and hubby is too for insisting you do that.\n\nMost people would have done what you did also. So would reddit. Everyone is on your side. Doesn't mean everyone is right.\n\nMiddle class and upper class people are very difficult to deal with in terms of the self righteousness in situations like this. I have a crap car but whenever someone dents it, rich or poor, I let them go. If it were a hundred k car I'd do the same. I know what cops can be like and how broken the system is too. Reddit claims to be woke until there's a \"minor scratch on a bumper\" and then they're calling the cops on the working class and claiming (falsely) that you can't get insurance without a license.\n\nYou all have this crap on your consciences. Just because you don't realize you're all the problem doesn't make you innocent. My opinion.", "Definitely not true that unlicensed people cant get car insurance. My wife just got her license back, but we were required to have an insured vehicle before she was even able to get her license. We had an insured vehicle in her name for at least a year before she had her license (she's saying it was 3 years but I don't think that's right).", "Simply not true at all.", "I'm a licensed insurance agent and you are definitely wrong. People get Insurance all the time with no license. The company I work for does eventually require proof of active license to continue the policy but that is typically months later.", "Sometimes what looks like light surface damage can be more serious issues underneath. Why should OP take the risk for the other guy’s mistake?", "That's like saying stealing something cheap should be let off the hook. What happens when it's something like a purse is taken when the contents are completely unknown? \n\nThe OP suffered small damages this time, but this guy could have done way worse damage. The right thing to do is to get bad drivers like this off the road, licensed or not.", "We totally agree. Posts like this make me sad because I realize what a bunch of law abiding sheep everyone is. Where we come from, and where we live, you just don't call the cops on each other. Period. Unless someone's trying to hurt you I guess.", "Isn't that what the uninsured/underinsured motorist portion of your own insurance is for?", "You might be able to get insurance for a \"parked car\", calling yourself an \"excluded\" driver, or SR-22 (but difficult), or for others to drive your car The major companies don't give you car insurance with you as the driver if you don't have a liscense.", "The most expensive drivers license in the US costs $89. Most are like $30.\n\nIf you have access to a car why would you not go to the DMV and get a license?", "Given the events that just occurred, it's much more likely he was prone to accidents or other symptoms of poor driving skills. I wouldn't think twice about doing what the OP did (I've been burnt before), let alone make an uncertain reddit post.", "Hey that's cool info I didn't know before, thanks for the tip!", "He doesn't have a license so insurance will deny to cover him and since he be losing his job its very unlikely he be able to pay.....OP is screwed", "I hope people show you the same amount of grace you extend to others.", "Well, that's fine and if her company doesn't want one, good for them. I have yet to hear of a damage claim with two or more vehicles involved where they didn't ask for a report number. Doesn't mean that police responded to the crash, you can file a report on your own and in some places do that online. \n\nSo her company doesn't care about subrogation? Interesting.", "They don’t issue insurance to unlicensed drivers", "They do pay out those policies literally every day of the year.", "You are wrong.", "Depends on policy and laws, it's not the same everywhere.", "Policies do not say that at all.", "Most often it's a matter of can't get a license (traffic offenses, dui, etc) until some criteria is met.", "> a lot of what I’ve been reading on this post has boiled down to “Well he’s poor so he deserves it.”\n\nA gross misrepresentation of the opposing argument. Don't argue in bad faith.", "What we do know is he does have a suspended license and still chose to drive, knowing full well there would be consequences. He caused an accident (wow, shocker a dude with a suspended license caused an accident) and is now dealing with said consequences.", "As a former insurance worker in Australia, yes it is. As they said in training, we don’t cover stupid.", "I’ve caused an accident. Do I deserve to go to jail? Knowing there are consequences doesn’t stop someone from NEEDING TO EAT or are you gonna drive them around?", "In which case insurance would deny the claim anyway and OP would be in the same position as if he didn't have it.", "Actually this is not true.  Insurance companies don’t really care if the licensed driver is legal to drive.", "Why would you even ask if someone would drive them around? They're an ADULT ffs, that's their responsibility. If you were caught causing accidents driving around unlicensed, yes you should be removed, just like any public nuisance. \n\nUp until the accident, licensed drivers are doing nothing wrong. The entire time the unlicensed driver is on the road is challenge to the rule of law. This reveals very different people.", "Typically you can technically get the car insurance. It just won’t cover you until you’re legal to drive.", "Forget the payment, there's a reason why he was unlicensed. Whether it's revocation of privileges for past transgressions or inability to drive safely, both are dangerous to tolerate, simply for the fact that he was apologetic and has a job. If you could remove all unlicensed drivers in an instant, you would and this is just speeding that process along.", "I swear people with no knowledge of insurance policies or claims will just spew any old nonsense with such confidence.", "Yeah, no. Your insurance will not be canceled automatically sure, but your insurance does not have to cover the results of your intentional tort. Aka, you knowingly drive illegally and cause an accident, your insurance finds out, and will not pay.", "They would cover the unintentional tort though, i.e. the proximate cause of the accident which was the collision.", "YTA\nEveryone here is focused on the wrong issue-dude not being licensed. The true issue is: is this the reasonable response for this situation, fuck no. was your response an asshole response, fuck yes. You are not even “technically” right, none the less morally right. \n\nFor “very limited surface damage” -what, rolled into you and scratched your bumper-you do not waste law enforcement resources. Stop asking cops to do this dumb shit. \n\nIn many states, the rear car in a rear-end is at fault- they are responsible for the damage. \n\nHow you avoid being the asshole: You pull to a safe space, call your insurance, give them all info, take pics, and then move on with your day.  If your insurance needs- they notify law enforcement. \nBut you wasted time, community resources, and you ruined someone’s life. \nAlso:\nDepartments of Motor Vehicle- not courts, control license.\nA court will ask the court to suspend a license, or the laws might require it.  But the DMV is the ultimate arbiter for a license to drive.", "ESH\n\nI’m not saying you’re a bad person, but for this situation, I think you could have made a minor concession for someone. It makes your life so much more crappy once you get one thing onyour record and then because you are usually in poverty, things stack up. \n\nSure filling a police report is what you are supposed to do in a accident. But like, it was a minor thing and you could have made an exception for this person one time.  You can have insurance without a license. \n\nAnd your car would be just fine.  And it was a MINOR fender bender. It’s not like your car was totaled. Maybe this guy is trying to get himself out of a crappy situation and now you just made it worse. Sometimes life is just crappy AF and you find yourself needing to do stuff like driving without a license to make sure you can pay your bills. Idk if you have public transit but sometimes that isn’t accessible and ride shares can be expensive. \n\nThis was just unkind. I hope you don’t ever find yourself in a situation where you might be breaking the rules because you need to survive. You don’t know why this person doesn’t have a license or if what they were doing was justified. \n\nBut no, I don’t think your minor bump on your car is worth calling the police to document your accident when you know somebody is going to get thrown in jail. I would say NTA if your car got totaled or majorly damaged, but that wasn’t the case.", "All of you people are fucking fucked. YTA.", "What you ARE, is called Karma. Dude set himself up, rolled the dice, and the house, as usual, won... Being that he worked at a casino, you'd think he'd known how the deck was stacked against him... He gambled on driving instead of taking an uber, and lost. Bet he doesn't take those odds again...", "Yta!!!", "He shouldn't be driving without a valid license - I have no sympathy for that. \n\nHowever, as long as you have a photo of his id, his license plate and insurance info you shouldn't need the police to attend a accident this small. I'm shocked they even came, this seems a horrid waste of police resources.", "NTA. How did he get a job in a casino, with a record? Like others have said, insurance is probably fake. Your hubby has the right idea, always report it. If the other party gets arrested for something not related to the incident, not your problem.", "Yea, yta, cops are not our friends", "NTA\n\nSeriously? This chucklefuck should not be behind the wheel. Period. It's not your fault that he's made poor life decisions.\n\nYou've done the rest of us a favour. THANK YOU.", "NTA. If he wasn't supposed to drive since he has no license, he should not be in the road. Sorry but true. I was rear ended by guy with no license and insurance. Even if the damage was less than $50, get police report no matter what. It's other drivers fault and you are covering yourself. If he does not  have a license, pretty sure he has no insurance either.", "Honestly what is up with people driving with no valid license? I am 68F from CA and got my license at 16 and had to have valid DL, registration and insurance current or I did not drive. I made sure that I had it, in CA or NV you would get hauled to jail if you didn't and they would tow your car!  This is why on cops shows so many flee from traffic stops, I just don't get it.  If you want to drive, have your DL, registration and ins. current, OR DON\"T DRIVE!  Its unfair that so many people think they are above the law-play stupid games win stupid prizes (like jail time.)..come on people- ITS THE LAW. Why should some people think they can do this????", "He has a suspended license, has been to jail, and probably works at a casino. Seems like a great guy /s\n\nNTA even discounting all this. You have to look out for yourself and he did rear end you.", "I have never had a license but I have had insurance solely because the insurance company required my name be on the policy when I lived with my ex. I still can't figure out how we got a cheaper rate by including me.", "Right here with you. These people are total garbage humans.", "We agree completely. Humans are a horrible horrible bunch.", "Everyone on here knows they're wrong in their heart, but they'll die on the hill while this dude goes to jail over a scratch, and that's dangerous.", "This might be the first one I've read that made be legitimately mad. \n\nShe could've taken a photo of his ID & plate, copies of insurance and filled the report online. There's zero reason to go through with this knowing that kid was going to jail. \n\nYTA and I hope the guilt keeps you awake for days.", "Christ! It's his fault! Why should she have to pay the damages to her car when he caused it? Go to your safe space and pet a puppy.", "So she should pay out of pocket to get it fixed when she didn't cause the accident?\nOr better yet, claim it on her insurance and her rates go up?", "Hey hey hey, don’t go against the narrative!! Facts don’t matter here, only feelings!! We feel as an unlicensed driver you can’t get insured, so the truth doesn’t matter!!", "Nice victim blaming! Dude shouldn't have been driving, that was his choice not OPs. He risked driving knowing that if he got pulled up, he was going to jail and that is the least harmful consequence of his actions. Instead he went above that and crashed into OP, and went to jail. Think shit through and don't blame someone else for his poor choices.", "You also never know the person situation or why the dude had to drive with out a license. Can’t hurt to give people a break once in a while, always gotta be a do gooder about it all. I agree op coulda let one slide", "Wow, chip on your shoulder much?", "completely agree!! a vehicle is just a vehicle. she just cost this man his livelihood over a scratch", "Tbh, I agree with you.\n\nLike let's see:- Guy puts a scratch on a car\n\n\\- OP ruins his life\n\nYTA OP. Those things don't fucking balance out.\n\nI don't agree with excessively punishing people. Hell, people are way too selfish. There's no leniency, there's no second chances, there's no understanding of other people. We live in this world, we need to learn to tolerate other people to a certain degree. Sure there are exceptions, but in the end those are exceptions.", "That depends on where you live. In Utah you are supposed to call the police if there is at least $1500 in damage and that isn't a lot of damage.", "IIRC in Texas you're required to report an accident to the police if there's over $1k in damages (or if there's severe injuries, death, etc). Requirements for these things are gonna vary depending on where you are.", "You really should have totally put that guy in jail. You should have called the FBI or the CIA. Reddit told me that's what you're supposed to do.", "Dude have you just gone to every ESH and YTA comment to say this?", "Damn, sometimes people got to live. You don't know their life, bro. Assuming the worst from everyone isn't a good thing. Fuck I do it, but I don't pretend that it's healthy.", "I mean, sometimes people are put in the tough position of either driving without a license or losing a job (because public transport in the US is terrible). So I’m sympathetic to him. But I agree we can’t blame OP for that or make her deal with the consequences.", "A whole bag of Cheetos actually!", "*cost to repair is close to or higher than the vehicle is worth. \n\nEvery state has a regulation about when a vehicle is determined to be a total loss. Some states the repair cost is a % of the actual cash value of the vehicle, some the repair cost must be higher. Nearly every state requires the vehicle to be a total loss once it meets the specific threshold. It’s not that insurance doesn’t want to repair, in many cases, they can’t repair. \n\nAnd with parts shortages and backorders, repairs are very costly nowadays. Someone I know has been waiting on a taillight replacement for months. The part is made in Ukraine. So it could be another year or more to get it!", "If you're going to make that kind of claim, please provide evidence. Or is that just your rule for those who aren't you.", "Can't we just ban all poor people from the road? Wait we already have? OK cool so let's call the police to come enforce it.\n\nReddit is nasty.\n\nWe agree with you completely.", "Bad faith is 99 percent of reddit on this post, but they can't handle being called out on it.", "Ok so I’ll explain my thought process cause yea I can see how that’s a leap if you don’t live in my head. But a lot of people on the post are saying “he doesn’t have a license so he doesn’t have insurance so his insurance is likely fake so you did the right thing” (though as others have pointed out you can get insurance without a license). I see this is inherently anti-poor and anti-felon, (who surprise surprise are mostly poor) the automatic assumption that he’s lying and committing fraud and therefor ruining his life is justified with no actual acknowledgement of the nuances of the situation.", "That's not the case here in the USA. Here, stupidity is covered as long as it's an \"accident\"... Like the guy who couldn't pound a nail into the wall of his house on the first floor... Got out a drill, and whooops, right into the water lines...  Made a pretty expensive mess, but was still covered.", "Do you have a license?", "They really don't care. I caused an accident once, which you do get a ticket for, at least in my state. I did not get a ticket because the other driver didn't push it. They would have got a ticket for being unlicensed. So I didn't push it either. My ins still had to pay for the repairs.", "So if you lost your license tomorrow and had no access to public transportation what would you do? And obviously I wasn’t literally saying he should drive this dude around that’s ridiculous that was my point, y’all are shitting on this man for trying to go to work,which is something a lot of us do to ya know live, no one is going to come drive him places so he has to do what he has to do. Yea sure if he had repeat DUI’s and was actually going shopping for clothes yea he deserves being arrested 100% but we cannot know that. You’re taking the least charitable option I’m taking the most, we are different people.", "Or, and hear me out here, he lost it because he couldn’t afford to renew it?", "It's not that it's the least charitable, it's the most COMMON. Do you give any consideration to the distribution of cases where someone actually lost their license the day before? I'm willing to bet the vast majority of unlicensed drivers causing accidents belong in the group that deserve to suffer the consequences once the authorities arrive. You are very willing to get creative just to avoid giving credence to the obviously correct line of action."]}