{"id": 22152, "submission_id": "14ytmyw", "title": "AITA for going on my own trip while my girlfriend is on a girls’ trip?", "selftext": "Two months ago my girlfriend (26) told me (25) she was planning a trip with her 3 best friends to San Diego. I thought that sounded really great and wanted to go. Never been to San Diego but heard great things about it. My girlfriend then informed me that it was a girls’ trip and that her 3 friends also aren’t bringing their boyfriends. \n\n\nNot gonna lie, I was a bit miffed, but accepted it. My girlfriend understood. It’s not like we never do great things as a couple and I completely understand that me being there would affect (or ruin) the vibe. Told her to have fun and go. I trust her so nothing will really happen. \n\n\nA couple of weeks later I mentioned this to a friend of mine and he told me that 2 days after my girlfriend will leave they have a trip to Jamaica planned and he invited me to go with. It was a bit last minute, so it took a bit of effort to get everything sorted out. I told my girlfriend and she didn’t have a problem with it.\n\n\nWhen we were meeting at the airport (going with a group of 6 guys, me included) I realised that 3 guys brought their girlfriends along. I thought I fucked up and asked if they knew I was going etc. They told me it was fine, and that the friend I spoke with on the phone asked them (and their girlfriends) permission for me to come. They said it was fine for me to go with. The 2 other guys don’t have girlfriends so I wouldn’t be a third wheel.\n\n\nWe went to Jamaica and had an absolute blast. While on the phone with my girlfriend  during the trip, I told her about the situation and she didn’t appear happy but didn’t say much about it.\nThen when I came home last week, we had a fight about it. She wasn’t cool with me going while some of the guys’ girlfriends were also going. I told her absolutely nothing happened. She said I shouldn’t have gone at all, when I realised the girlfriends were also going. \n\n\nI asked why she thought something might happen, and she told me that one girl, is apparently, romantically interested in me and is flirting with me. I thought that is complete bs because she is in a 4 year relationship with my friend and because she has this vibe with everyone. She also didn’t trust another girl because she has a very promiscuous (wild) past. Also irrelevant because she is in a 2 year (monogamous) relationship with my friend. All in all nothing weird happened.\n\n\nShe still called me an asshole.\n\n\nNote: I replaced the colorful (offensive) language my girlfriend used while describing both my friends’ girlfriends sexual past and current behaviors, with better terms or left it out.", "created_utc": 1689275645, "permalink": "/r/AmItheAsshole/comments/14ytmyw/aita_for_going_on_my_own_trip_while_my_girlfriend/", "score": 363, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Going on a trip with my guy friends (and some of their gf’s) while my gf was unaware of it (initially). I could be the asshole because my gf believes two of the girls might be trying to be with me.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nPetty and insecure behavior from your GF.", "NTA - She may not have know these particular women were going to be on the trip, but she surely realized there are other women in Jamaica? It seems weird that she trusted you to be around random single women you might meet there, but not women who were traveling with their boyfriends.", "NTA and your should-be ex is insecure.", "NTA - It does not matter if she trust the other girls.\r  \n\r  \nShe eithers trust you or she does not.\r  \n\r  \nNo person or circumstance can make you cheat against your will.\n\nSounds like she is mad she missed out on a trip to Jamaica and this is the avenue she has chosen to express that.", "NTA. \n\nNo offense, but your gf sounds sketch.", "NTA your gf is mad you had the better vacation.", "NTA but your girlfriend is a massive Y T A for describing other women in that way. Her attitude is awful and if I were you, I would re-evaluate my whole relationship.", "NTA and she has shown you a massive red flag which you should not ignore. Not sure how long you’ve been together but if that happened she is going to make a huge issue out of it every time you’re around another woman without her.", "NTA, good for you for having the faith in your girlfriend that im sorry she doesn't have in you. Is your GF Jonah Hill?", "NTA. Did she really expect you to leave the airport after paying for everything because 3 of the dude took their gfs? Like really?", "Oh lord, the only person she needs to trust is YOU. She just got jealous about it. \n\nShe went on a trip. You went on a trip at the same time. Couples can do that! Omg!\n\nNTA.", "NTA. Nobody likes double standards.", "NTA All of the girls who went were traveling with their boyfriends. Your gf wouldn’t have been able to come anyway. I’m not actually sure why she’s mad.", "NTA what i’m getting from this is that she doesn’t trust you. there’s men in SD and there’s women in Jamaica and those women your gf talked down on, they’re all in a relationship so it doesn’t matter and the past is the past, people change. also your gf wouldn’t have been able to go with you guys anyway so i don’t really see why she’s upset", "NTA - one of my husband’s friends is a stripper. She’s in a committed relationship & is just an awesome person to be around. Even if she were to ‘try’ anything, I trust my husband and honestly don’t care. \n\nIt’s a question about if she trusts YOU or not. Frankly, doesn’t sound like she trusts you.", "NTA. Red flag for lots of reasons. Including that she might be projecting for something she did on her girls trip.", "NTA -", "NTA. You don't have to ask for permission to go on a trip", "In what world does this make you an AH, besides a delusional one?\n\nNTA. Glad you had fun", "INFO: What did your girlfriend tell you about her own trip to San Diego? Has she given you any details, have you had time to talk about it?", "You're right, she's wrong, and I wouldn't trust her.  NTA.", "She's insecure because she got some San ''D\" iego while she was on her girls trip and is now projecting her guilt onto you.", "NTA\n\nAs a woman, I am a bit shocked by how worried your GF is about you being around your friend's girlfriends while in a group. She has a right to feel what she feels but I don't think you did anything wrong. You told her you were going on a trip out of the country. Of course there are going to be other women around. It seems like you are trustworthy, that is all that she should be worried about.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nTwo months ago my girlfriend (26) told me (25) she was planning a trip with her 3 best friends to San Diego. I thought that sounded really great and wanted to go. Never been to San Diego but heard great things about it. My girlfriend then informed me that it was a girls’ trip and that her 3 friends also aren’t bringing their boyfriends. \n\n\nNot gonna lie, I was a bit miffed, but accepted it. My girlfriend understood. It’s not like we never do great things as a couple and I completely understand that me being there would affect (or ruin) the vibe. Told her to have fun and go. I trust her so nothing will really happen. \n\n\nA couple of weeks later I mentioned this to a friend of mine and he told me that 2 days after my girlfriend will leave they have a trip to Jamaica planned and he invited me to go with. It was a bit last minute, so it took a bit of effort to get everything sorted out. I told my girlfriend and she didn’t have a problem with it.\n\n\nWhen we were meeting at the airport (going with a group of 6 guys, me included) I realised that 3 guys brought their girlfriends along. I thought I fucked up and asked if they knew I was going etc. They told me it was fine, and that the friend I spoke with on the phone asked them (and their girlfriends) permission for me to come. They said it was fine for me to go with. The 2 other guys don’t have girlfriends so I wouldn’t be a third wheel.\n\n\nWe went to Jamaica and had an absolute blast. While on the phone with my girlfriend  during the trip, I told her about the situation and she didn’t appear happy but didn’t say much about it.\nThen when I came home last week, we had a fight about it. She wasn’t cool with me going while some of the guys’ girlfriends were also going. I told her absolutely nothing happened. She said I shouldn’t have gone at all, when I realised the girlfriends were also going. \n\n\nI asked why she thought something might happen, and she told me that one girl, is apparently, romantically interested in me and is flirting with me. I thought that is complete bs because she is in a 4 year relationship with my friend and because she has this vibe with everyone. She also didn’t trust another girl because she has a very promiscuous (wild) past. Also irrelevant because she is in a 2 year (monogamous) relationship with my friend. All in all nothing weird happened.\n\n\nShe still called me an asshole.\n\n\nNote: I replaced the colorful (offensive) language my girlfriend used while describing both my friends’ girlfriends sexual past and current behaviors, with better terms or left it out.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Nta", "NTA, but your girlfriend is. She is jealous you had a better time than she did!!! 😂. Ignore her. Go about your day.", "How can we say? We don’t know her. I can’t, in good judgement, say anything about your relationship. But I don’t believe YTA for this.", "NTA what a weird thing to have a problem with.\n\nand your girlfriend has some shitty misogynistic views to work through", "Info\n\nYou realize healthy relationships don’t even consider that “something might happen” when one goes on a trip, right? Yall are either trustworthy and loyal or you aren’t", "It doesn't matter if she doesn't trust the two women, she should trust YOU.   \n\n\nPerhaps you need to re-think this relationship. NTA.", "Nta\n\nControlling girlfriend. Get ready for more", "NO you not the asshole she went on a trip and you went on a trip. It is what is,", "NTA\n\nBut I'm almost certain she cheated while she was away. If she was always insecure about these 2 girls, she would've mentioned it before. I think she's feeling guilty and accusing you in the hopes of not being the bad guy.", ">She said I shouldn’t have gone at all, when I realised the girlfriends were also going.\n\nFfs. Yeah just dump all your effort and the money on your plane tickets because there are women nearby you. Gasp. NTA. They're with their SOs they don't want your junk.", "Yes, exactly this! Counterattack. Ask her whether she's making these crazy accusations so that you won''t ask what her group did with all those unattached men in San Diego. Sounds like she's trying to deflect guilt.", "Plus I happen to know the beach in San Diego in July is absolutely teeming with single men. Seems like some projection going on.", "Or that something happened in San Diego and she's trying to preemptively get the upper hand", "You know she was getting busy in San Diego.", "preach", "We have been together for 3½ years. This is the first time she made this into an issue and been this outspoken about it.", "That is exactly what she expected.", "Well OP wasn’t sad and alone waiting for her, worrying about how others dudes could seduce her.  \n\nHe trusted her, and went on his own vacation, having a blast. How dare he be happy without her. \n\nOP NTA - she might have been nice for the length of the relationship so far. However the true self she showed is quite concerning. Don’t forget people don’t stay in toxic relationship because it was bad from the beginning.\nShe went so nasty, don’t shrug it.", "We did talk about it. She went to several clubs and generally had a good time. Nothing to suspicious of, I suppose.", "Obviously there are no men in San Diego. Just... not at all 🤣", "Really makes me wonder what exactly she did in San Diego.", "yikessss 😬", "I think that is an unreasonable expectation. It sounds quite controlling. \n\nI think you are being quite sensitive to her feelings and she has no right to tell you what you can and can't do.", "She’s estupid", "[removed]", "ALWAYS!!!!", "She’s projecting. I’d be wondering what happened in San Diego", "Only if you're doing it out of spite", "NTA - insecurity at its finest", "So you were what going to have sex with these friend's girlfriends??? While on a trip together?\n\nNope I bet she thought y'all were going to have multi-person orgies.  Please, GF is being an AH.\n\nyou NTA.", "NTA   I find that when someone's partner is concerned about their partner cheating and it's completely innocent and always was (in other words no previous cheating), they're usually projecting their own behavior onto others.\n\nThink about it.", "Nta", "NTA. I'm laughing at the idea of you AT THE AIRPORT with your bags saying \"oh no there's women here, sorry guys I can't go after all\". And how would you explain that one to your friends? \"Sorry guys, didn't know any temptresses were going to be coming, I should stay home\"? Also, slut shaming other women is not a good look for your girlfriend here.", "NTA.", "Oh so she can go on trips without you but when you do it it's a problem? NTA", "Yeah. There are men in San Diego too.", "Lot's of hot military men.", "Hmm, I want to avoid the stereotype of girl's night at the club being the place where relationships go to die because there's a lot of misogyny behind that idea \n\nHowever, I also want to acknowledge that alcohol leads to the abolition of inhibitions and people make really shitty choices under those conditions.\n\nI won't assume she cheated, but her defensiveness and insecurity does seem like it's personal to her own behavior rather than indicative of anything that you've done. It's worth just keeping your mind aware of possible future \"accusations\" around being with people of the opposite sex.\n\nI'd sit her down and do a status meeting on where you guys are at and giving her space to discuss any feelings she may have.\n\nIt's possible that one of the girls may have said something to your girlfriend that has her feeling insecure, or she could just be uncomfortable that you went on vacation without her and she's using anything to justify her feelings without just saying upfront that she was uncomfortable with it.\n\nAt this point all you have is the power of deductive reasoning, especially if as you said in another comment, this behavior is out of the blue.", "*slowly fades out of existence*", "NTA\n\nYour girlfriend sounds controlling. Plans trips without you, but when you have a blast on your own trip, she attacks you for insecure ridiculous reasons. 🚩 is all I got to say.", "NTA. If someone wants to flirt on vacation, it's much easier to do when in a single sex group than a mixed group.  She would have had a much easier time picking up guys than you would have had picking up girls.  \n\nWith that said, all of this is irrelevant. She went on a trip, you went on a trip.", "Nta. She's acting like you went on a trip with only women. What did she think was going to happen with their boyfriends literally on the trip with you?", "NTA", "NTA. You shouldn’t have mentioned the women like you did. You turned a non issue into a problem.", "Hey man it sounds like your girlfriend is projecting pretty bad. Nta", "NTA - you did not realize it until all was said and done. I mean you were already meeting at the airport when you found out. In your post you say your GF does not trust 2 of the girls for whatever reasons she gives, but the big question is...Does she trust you? If the answer is yes, then she should not have an issue with who is around you. If the answer is no, then your relationship has a problem.", "NTA and your gf's insecurity is a huge red flag.\n\nIt's pretty messed up that she would think that 1) the other girl would cheat on her boyfriend, plus 2) try to steal a guy she knows is in a relationship, and that 3) *You* would cheat on her, 4) basically in front of all your friends on a group trip!\n\nAll for of those points together is just an insane leap in logic and shows a clear lack of trust in, well, basically everyone. It's not like you took the opportunity while your gf was gone to sneak away just you and this other girl.\n\nNot only does it show an insane level of distrust in you, but it also shows that if the tables were turned, you would most likely not be able to trust your gf. Cheaters very frequently project their own untrustworthiness on to others, because they think it's the normal way to view the world. They think everyone is doing it because they're doing it.", "NTA. still struggling to understand why she would give a shit", "I have concerns about projection her.  People who make irrational demands like walking away from the airport because couples are going on the trip makes me wonder what she was up to on her girls trip.", "Man Diego.", "I mean, on one hand making ridiculous accusations to get ahead of potential more justified accusations is a common abuse tactic, but on the other hand, making wild accusations to throw someone off balance when they make an accusation is also an abuse tactic, so… maybe it would be better to just avoid unfounded accusations?", "This is what came to my mind.  She’s projecting.", "She's jealous that you went to Jamaica, using the \"girls\" as a reason to yell at you is just convenient. \n\nShe was hoping you'd be a good boy and stay home.", "You should do some digging and find out what happened in San Diego. This sounds like her projecting to me, NTA.", "I can't believe no one else has upvoted this comment! I love it.", "Yep exactly what I thought, projection", "NTA, I'm gonna be honest here it really sounds like your GF is projecting. I'd be worried about what went down on her girls trip if I were you.", "She’s projecting into you what more than likely happened in SD. NTA", "NTA. \n\nShe probably got up to something and is now accusing you of what she might have done\n\nGuilty conscience type of thing \n\nGood luck", "I would ask her what they did on their girls trip. Sounds like some projecting and/or jealous. NTA", "NTA your girlfriend is a red flag.", "NTA. Unless you are leaving some trip drama out or a reason your GF doesn't trust you, this sounds like it is on her and should be a conversation about trust between you two.", "NTA I go on a vacation for 5 days every year with my mom, one of her friends, and one of mine. If my husband decides to go on a trip with his buddies that's perfectly fine. If it is OK for your gf it should be OK foe you.", "Tell her she can either trust you, and shut up about it.\n\nOr not trust you, and break up over it.\n\nEither way, you win.  She's unjustly accusing you of being unfaithful.\n\nFuck that noise.\n\nNTA OP.\n\nGirlfriend, IS an asshole, however.", "NTA", "NTA I really hate this sort of logic because it's predicated on this men have no control idea. Like whi care if the girls are flirty or if they have a past as long as she trusts you to say no. Like if they fling themselves at you of course you'll say yes. If anything if that is her concern she should be a more supportive partner because consistently receiving unwanted sexual advances isn't \"every guys dream\". \n\nAnd if she says she does trust them just not you that is even worse in a sense. That implies that she is concerned they will do sexual things without your consent. What an awful thing to think. It's also weirdly victim shaming. Like she's mad you still went on the trip. If you had gone on the trip and non consensual things happened would she still be mad at you for choosing to put yourself in a compromising position.", "projection?? guilt???\n\nThat's all I can think of when she's getting mad at OP for being around other people's girlfriends.", "A wee bit of projection.   \nGF fucked around", ">She went to several clubs and generally had a good time. Nothing to suspicious of, I suppose.\n\nBruh.", "Well obviously, they are all gay. So the real worry is did the GF have a fling with all those sharp dressed lesbians.", "The way your girlfriend spoke about those women is disgusting, but, even if what she said was true, does she not think you have a say in whether or not you give into any potential advances.\n\nShe's telling you she doesn't trust you, she's telling you she thinks you have no agency.\n\nNTA", "NTA!!! It would have been different had three unattached girls had come along, but here the girls can w/their bf’s.", "NTA- if she trust you then it shouldn't matter whether or not she trusts the girl or not. If she doesn't trust you well that a completely different problem that needs to be addressed", "NTA, red flag. Time to discuss and evaluate things further on. Especially financials if you're thinking of getting serious and perhaps a future joint account. Don't agree to that unless you're confident this behaviour won't repeat. \n\nIt's possible she got some guilty pleasure in San Diego and now is comparing and contrasting  it with your fun. No way to know that, girls' gang won't reveal easily. Or maybe she's just very insecure.", "Calling it now, she cheated on you during the vacation. Usually people who think you will cheat the moment you're out of their sight think that way because that's what they do.", "NTA boy your gf is cheating on you", "NTA- It honestly sounds like your GF doesn't trust you much, and instead of saying that, would rather slut shame the girlfriends' of your friends. She sounds insecure and acts like it too. She went to San Diego alone, and expected you to trust her, but you can't expect the same from her.", "Let's not forget the fact that he and his group are far less likely to get into the same troubles a group of all guys might.", "U cant be that dumb.", "or trust issues", "Oh no!  Did the Navy relocate or are they only allowing women to be stationed there now?", "It can be an abuse tactic, but situations don’t exist devoid of context and it wouldn’t be abusive to say what the person you’re replying to said. If you’re honestly going to argue that would be abuse just dont"]}