{"id": 2220, "submission_id": "yu52wj", "title": "AITA for asking for a divorce after my wife chose not to come to Thanksgiving with my family?", "selftext": "I am a 32 y/o female & have been with my wife (40 y/o female) for over 11 years. (Married 7 years) \n\nAll of my family lives in the same city as us. My wife’s family lives in 2 different cities that are driving distance from us. (3-4 hours drive) \n\nEarly on in our relationship we made a agreement that we would spend one holiday with my family & the other with her family and then rotate the next year. (Example: year 1 we spend Thanksgiving with my family & Christmas with hers. Year 2 thanksgiving will be with her family & Christmas with mine.) \n\nThis worked out really well for us & both of our family’s seemed to support us with this decision. Over the years we had a son and I choose to get lax with this agreement and we’ve started spending every Christmas with my wife’s family. The main reason for this is because my family has absolutely no kids. So Christmas seems to be a better experience for our son with all of his cousins/family on my wife’s side. \n\nSo this year my family chose to meet for Thanksgiving on Nov 17th due to conflicting schedules for other family members. We all (wife included) agreed on this date about 2 months in advance. My wife & I also agreed to host this gathering at our house as we normally do. \n\nMy wife recently told her sister she would go visit out of town for our nieces birthday on the same day as my family’s Thanksgiving. (I believe this was an oversight made by my wife and not done maliciously.) My wife has known about this “double booking situations” for a few weeks but finally decided today that she will be going to the birthday party and taking our son with her to see his cousins. \n\nIm really upset because she is leaving me to host Thanksgiving alone and didn’t discuss the decision with me prior to hear how I felt about it. On top of that, she also made the decision to take our son with her without discussing it with me prior. \n\nAITA for seeing this situation as another red flag & filling for divorce?\n\nEDIT:\n\nSo to help clear it up: My wife & I have been in marriage counseling for about 2.5 years now & one of the main things I keep communicating during our sessions is that I feel that she constantly chooses her family over me. \n\nBackstory: we previously would see the marriage counselor about every 4 weeks for a couples session. As part of our plan to address the issues we would also see the same marriage counselor every 2 weeks in our own individual sessions. \n\nMy wife decided several weeks ago that she no longer wants to see the marriage counselor for couple sessions or her own individual sessions. \n\nI will continue to see the marriage counselor for individual sessions and was planning on bringing this situation up.\n\nSo there is more history to this situation vs this being an isolated incident.", "created_utc": 1668353884, "permalink": "/r/AmItheAsshole/comments/yu52wj/aita_for_asking_for_a_divorce_after_my_wife_chose/", "score": 29, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Sorry I’m new to Reddit and this is my first post so I see how I made a mistake using “emotions” in my title. \n\nI tried to edit but instead made a new post that clarified my stance. The 2nd post was taking down as suspicions because it looked as if I copied and pasted another persons post. Sorry if that was the wrong thing to do. \n\n1. I filed for divorce based on the situation described & im wondering if I am the asshole. \n2. This action might make me the asshole because I am ending my 7 year marriage because my wife is going to our nieces birthday party.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Edit: I lean NTA based on additional information provided. I think it’s a massive overreaction to THIS ONE INSTANCE but if there’s a long-standing pattern of her invalidating and disregarding your feelings I can understand why you’re upset. \n\nINFO: What are the other red flags?", "Unless you've been unhappy in the marriage, it really seems dramatic to threaten divorce over bad scheduling. We're missing too much context to make a decision.", "While this incident is troubling, whether or not you're an asshole if you file for divorce over it, there's just not enough information to make that judgement.", "Based on the information you've provided, this sounds like an insane overreaction. Maybe I'm missing it but I see no other red flags in your post?\n\nBased on what's here, YTA for divorcing over double booking. Should she have double booked? No. Should she have taken your kid when double booked? No. Is that grounds for divorce? No.", "INFO:  is this it??  If this is the straw that breaks the camel's back, there must have been some other issues besides this.   I cannot believe if you truly love your wife that this would make you want a divorce.  Maybe try talking to each other and express that you are upset she has chosen to go to the birthday instead of thanksgiving, but if you go straight to divorce the YTA.", "YWBTA\n\nYou really gonna divorce over ONE holiday alone? Doesn’t that seem a little extra?? Express your feelings and hope for the best.", "YTA if this is the only issue making you want to file for divorce.  Assuming this is just the last straw; that you’ve told her repeatedly how the holiday arrangements are an issue and that you told her in no uncertain terms you don’t want her to take your son when you’re family is going to be there.", "YTA - this is not divorce worthy.  Do you always threaten divorce when you don’t get your way or get upset?", "YTA if there were no other issues prior. If you two were happy and your wife just made this mistake, then this is an overreaction and perhaps your wife should get out. However, if this was the final straw, you might not be the AH. \n\nThere's just not enough info to make a final judgement.", "NTA. I was positive based on the title that I was going to call you the asshole, but holy shit. She's the asshole. I can absolutely imagine her trying to minimize it and gaslight you and say you're overreacting, but no, what she did is beyond rude, uncaring, selfish, etc. You don't abandon your partner on a holiday that you're supposed to host together. You just don't. Besides, if you're considering divorce over this, sounds like this isn't the only issue. Ask for a divorce, but only if it's what you want. Don't use it as a tool to make a point and punish her, especially if you're not prepared for her to turn around and say ok. She might just do that by the sounds of it.", "Leaving you alone to host and taking your son without asking you (I assume you're both the legal parents?) is a major asshole move. It's a strong reaction on your part, but you've stated that this has been going on for years and honestly, I'd be pissed too. \n\nI will point out though that if your family is in the same town and hers is ours away, she might really miss them and not express that well. Still, she could go visit them on another weekend. \n\nAll in all, NTA.", "The title is misleading. It's not like your wife doesn't have a scheduling conflict and was in a hard position. You want her to double down. I'm gonna guess this is your first marriage. You don't seem to have figured out how to accept the thick and thin premise of marriage. You are also acting like you don't have a choice and you so in terms of hosting. You could have asked someone else to host in light of the scheduling conflict and tried to be supportive. You wife is your forever family. You're not treating her very nicely by portraying this situation like she's an awful person for wanting to take your son to his cousin's birthday party. \n\nIdk, I hate to call anyone the asshole here, but if there is one It's probably you. Be more supportive of your wife unless she's actually being an awful person. This doesn't seem to be a case where she is being an awful person at all.", "NTA", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI am a 32 y/o female & have been with my wife (40 y/o female) for over 11 years. (Married 7 years) \n\nAll of my family lives in the same city as us. My wife’s family lives in 2 different cities that are driving distance from us. (3-4 hours drive) \n\nEarly on in our relationship we made a agreement that we would spend one holiday with my family & the other with her family and then rotate the next year. (Example: year 1 we spend Thanksgiving with my family & Christmas with hers. Year 2 thanksgiving will be with her family & Christmas with mine.) \n\nThis worked out really well for us & both of our family’s seemed to support us with this decision. Over the years we had a son and I choose to get lax with this agreement and we’ve started spending every Christmas with my wife’s family. The main reason for this is because my family has absolutely no kids. So Christmas seems to be a better experience for our son with all of his cousins/family on my wife’s side. \n\nSo this year my family chose to meet for Thanksgiving on Nov 17th due to conflicting schedules for other family members. We all (wife included) agreed on this date about 2 months in advance. My wife & I also agreed to host this gathering at our house as we normally do. \n\nMy wife recently told her sister she would go visit out of town for our nieces birthday on the same day as my family’s Thanksgiving. (I believe this was an oversight made by my wife and not done maliciously.) My wife has known about this “double booking situations” for a few weeks but finally decided today that she will be going to the birthday party and taking our son with her to see his cousins. \n\nIm really upset because she is leaving me to host Thanksgiving alone and didn’t discuss the decision with me prior to hear how I felt about it. On top of that, she also made the decision to take our son with her without discussing it with me prior. \n\nAITA for seeing this situation as another red flag & filling for divorce?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "ESH but your response blows her lack of consideration out of the water. No marriage functions perfectly all the time. Sometimes there are disagreements. ~~You are wanting to make your life much, much more difficult, supposedly over one incident in the coarse of an overall loving relationship. This lack of commitment and stick with-it-ness will make any relationship you have short lived.~~\n\nEdit: Saw in the comments that there is more to the situation. That should’ve been explained in the post. Still talk about it in counseling before making any decisions.", "You should edit your post to include more info on the marriage counseling so the info doesn't drown in the comments. That additional info makes you NTA, and I'm sorry to hear you are in that situation.", "NTA due to info added in your comments Op. Do what you feel is right for you and your kid. And please update, I hope this situation gets better for you, one way or another.", "1. She recently decided she did not want to continue marriage counseling. We have been going for about 2.5 years. \n\n2. I tried to talk to her last night about some unrelated feelings. Instead of listening and validating, she flipped the conversation to tell me about things I’m doing wrong in the relationship. Validation of my feelings has been another huge thing I’ve been communicating to her in marriage counseling.", "Totally understand. It’s my first post so I see how I didn’t include important information. \n\nSee other comments for more context.", "Thanks for that feedback. \n\nSo to help clear it up: My wife & I have been in marriage counseling for about 2.5 years now & one of the main things I keep communicating during our sessions is that I feel that she constantly chooses her family over me. \n\nSo, my decision to file for divorce feels more like a last straw vs a overreaction.", "Not at all. We have been going to marriage counseling for 2.5 years to work through our conflicts. \n\nI didn’t include enough context in the original post but tried to clarify in the comments.", "Yes we are both legal parents to our son.", "Thanks for taking the time to comment. \n\nThis is my first marriage. We have been attending marriage counseling for 2.5 years. \n\nI will take some time to reflect on some of the things you brought up.", "Here's the thing: our partners don't exist to validate us. They're allowed to disagree, and have their own feelings that don't follow what we want.\n\nHow is she choosing her family over yours constantly? If it's just spending time with them.. that's normal. They raised her, that's her parents. She feels comfortable with them.\n\nBut if her family is actively meddling in your life? Different.\n\n We still need more info", "Yea this belongs on relationship sub not AITA.  There’s just too much and no real conflict to judge.", "The posted situation isolated, would make Y T A. However, since you have stated this is an ongoing issue, one that the both of you have been in counseling for years and there is no change on her end, you’re NTA.", "You should definitely add this to the post. It makes your actions seem much more reasonable", "Well then this is something you need to discuss with your therapist, they know your history & issues you haven’t said here. \n\nOn that note, if this is a pattern (which it obviously is from what you just said) & even with therapy your wife hasn’t made any effort to put you first then you may have to come to terms with the fact that she is selfish & doesn’t care about your feelings as much as you do hers & if you don’t want to deal with that anymore then you’re certainly NTA for wanting out if that relationship.", "It doesn't sound like she's choosing her family over you. It sounds like, abetted by you, the relationship with her family has been a lot warmer and closer than the one with yours.\n\nUsually that's not a situation that just arises because one side has kids and the other doesn't. It is usually a situation where the other family somehow makes the spouse feel unwelcome or uncomfortable, either on purpose or as a result of their disfunction. \n\nI do think YWBTA if you make a decision this big in anger. You should discuss this with your therapist, especially if I'm correct and your wife has a reason she would rather not spend a whole weekend trapped with your family.", "Yeah then definitely NTA, she can't just decide over the location of shared children without consulting you.", "Yeah I agree. I don’t want/need her to exist to validate my feelings. \n\nBut one of my expectations of my partner is to at least hear how im feeling, understand how a decision she makes can effect me & take that into consideration when making big or important decisions.", "Thanks for that feedback. I didn’t know relationship sub was an available resource.", "Backstory: we previously would see the marriage counselor about every 4 weeks for a couples session. As part of our plan to address the issues we would also see the same marriage counselor every 2 weeks in our own individual sessions. \n\nMy wife decided several weeks ago that she no longer wants to see the marriage counselor for couple sessions or her own individual sessions. \n\nI will continue to see the marriage counselor for individual sessions and was planning on bringing this situation up.", "Surprisingly, that’s not true. My wife has a very good relationship with my side of the family. So I don’t believe that plays into my wife’s decisions.", "That's fair, but given the limited context STILL (You haven't really laid out behavior that is concerning), it still seems an overdramatic response.\n\nSome spouses will never be close with their in-laws, or will try to minimize conflicts with them for peace.", "Regardless of what you choose I think you continuing therapy on your own is definitely a good thing. Dealing with people who treat you as if your opinions & your voice don’t count in the relationship can take a heck of a toll on your mental health & from what you’ve said there’s probably way more examples of her doing this to you. \n\nI still stand by my decision that you’re NTA if you decide to leave her, even more so now that you’ve said she even quit going to marriage counseling, especially if you asked her not to quit & she did her own thing anyway. \n\nI know you don’t have an easy decision to make. Whatever you do decide, don’t do it out of anger just from this one example. Look over your entire relationship - the good & the bad - & then decide if this is something you want to continue fighting for or not. That way if you do decide to leave her you can have more peace of mind & less second guessing yourself that you made the right decision or not."]}