{"id": 22228, "submission_id": "14zj5nq", "title": "AITA for getting my sister removed from the will because of her husband?", "selftext": "I(F24) have a sister(F29) who has been with her husband (M30)for 8 years. My sister is very hardworking with a good paying job, BIL however has been job hunting for at least 5 years. Personally, I believe it’s BIL’s ego and his laziness stopping him from getting a job. Any job I would offer would be rejected because “with his experience he at least deserves to be a manager & the money is too little”\n\nMy sister is no contact with our mum, completely understandable because unfortunately my mother can be manipulative and is a borderline narcissist (the worst is her victim complex), however the catalyst was when BIL lied to my sister and told her our mum gifted them $20k when in actuality my mum said she would loan it to them. \nMy sister sided with BIL and claimed our mum was being manipulative but our mum argued that it’s a ridiculous gift especially if it’s to buy a property (this would be their 3rd, mum already paid for 2) Mum then blew up because by this point, she was paying BIL $100k to be her assistant but he was barely working (about 5hr days, 3 times a week) & always coming up with excuses to skip. He then left after 6 mons which is when I started working for mum.\n\nRecently the talk of inheritance arose due to dads cancer diagnosis. My parents are separated but mum has lots of assets inclu $1mil life insurance $2mil home & 12 properties (this is under a family trust she manages)\nHere is where I think I’m the asshole bc I “convinced” my mum to split her assets equally between myself and my brother excluding the life insurance. \n\nSomehow my sister found out & has asked we contest the will or draw up a contract to share the inheritance. I refused because imo inheritance is earned besides, Mum is alive and healthy so she can change her mind. \n\nMy sister  is upset & says that she deserves it just as much as we do but I disagree. I work 12hr days with my mum, driving her around, managing everything whilst also being my dad’s caregiver. My sister also wants to throw mum into a nursery home whilst I would take her in. She said our brother didn’t earn his keep but he’s only19 and a student. Therefore the expectations should match that, plus he does the business artwork, chores & works part time. \n\nI told her she and her husband cant expect anything from someone they havent spoken to in a year and now her argument is that me and my brother already have enough (mum bought us 3 properties each) whilst she has to share with her husband & kids. \nMy sister says Im selfish, but I’ve worked my whole life under my parents. Honestly I think its the stress of being the only source of income for a family with two young kids that is getting to her. I do feel for her, she’s expressed she’s worried she might lose her job because she cant dedicate time to her career bc of the kids, but both go to childcare 3 times a week & if BIL is unemployed, I dont know why this is. \nOn the other hand, my sister & BIL have always been entitled, before when BIL worked for mum, they would take mums credit card for groceries and other shopping and not tell her. They also did the same with my dad. \n\nMore than anything I dont want BIL’s laziness to be rewarded with my mums hard work. Though I dont really like my mum (she’s a narcissist but still my mum, it’s all complicated feelings) I cannot deny she has set us up for life. To think of all the hardships mum endured migrating to Australia & juggling three jobs whilst pregnant to build her dream house & it could end up in BIL hands..makes my heart clench. \nSo am I the asshole? If it was my sister & kids I wouldnt mind, but her and BIL are a packaged deal\n\nNote: all family members (except sis and BIL) agree with this sentiment but I do feel guilty, I don’t know how to ensure only my sister benefits not BIL\n\n\nAnother note: The 12 properties are under a family trust as we built them ourselves, BIL is not included in our family trust however sis has put BIL name on the title of all properties mum has bought her. My sister will always get her fair share of the life insurance.\n\n\nAnother note: I mentioned this in a reply, but we specifically want the 12 properties to remain under myself and my brothers care so we can pass them down to my sister children and my brothers future children, my sister or BIL would likely try to sell them, they are not mortgage free properties and we still need to manage rem. Also I don’t plan on having kids so it’s pointless for me to have this. because I won’t have kids , my niece and nephew will inherit everything of mine. Currently the original loan for the properties have me and my parents liable.", "created_utc": 1689347828, "permalink": "/r/AmItheAsshole/comments/14zj5nq/aita_for_getting_my_sister_removed_from_the_will/", "score": 3004, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Am i the asshole because I somehow convinced my mum to exclude my sister from her will because of her husband. Her husband has been leeching off our family for years and If my sister is part of the will, he will gain even more from my mums hard work. Essentially this would punish my sister for who her husband is.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "I would love to judge but this is too 'first world problems' for my brain to process \n\nI have a job and three gifted properties, I want more inheritance!\n\nI've got three jobs and a mortgage, I want dental insurance \n\nSo I guess YTA", "YTA why did you convince  your mom of anything  you should have let her make her own choice and stayed out of it you said your sister  works hard and just because  you kiss your manipulative moms ass doesnt mean she has too.", "YTA inheritances by definition aren’t earned (except by the person whose money it is before they die unless they got it through inheritance) and none of you are entitled to anything. Your Mom can just donate it all or spend it all and that’s that. \n\nYou being a “slave” to your mother is your own choice when you’re working as her assistant for $100k per year. \n\nI guess you can view “earning” an inheritance by having a relationship with the deceased, and if your sister has gone NC with Mom, then, yeah, she isn’t entitled or deserving of anything just because she’s related.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI(F24) have a sister(F29) who has been with her husband (M30)for 8 years. Sis is very hardworking with a good paying job. BIL however has been job hunting for at least 5 years. TBH, I think BILs ego and laziness are stopping him from getting a job. Any job I would offer would be rejected bc “with his experience he at least deserves to be a manager & the money is too little”\n\nSis is no contact with mum, understandable because unfortunately my mother can be manipulative & is a borderline narcissist, however the crux was when BIL lied to sis & said mum gifted them $20k when in actuality my mum said she would loan it to them. Sis sided with BIL & claimed mum was being manipulative but mum argued that its a ridiculous gift especially to buy a property (this would be their 3rd, mum paid for 2) Mum blew up bc she was paying BIL $100k to be her assistant but he was barely working & always coming up with excuses to skip. He left after 6 mons which is when I started working for mum\n\nRecently the talk of inheritance arose due to dads cancer diagnosis. My parents are separated but mum has lots of assets inclu $1mil life insurance $2mil home & 12 properties \nI convinced mum to split her assets equally between myself and bro, excluding the life insurance. Somehow sis found out & asked we contest the will or draw up a contract to share the inheritance. I refused bc inheritance is earned besides, Mums alive so she can change her mind. Sis is upset & says that she deserves it just as much as we do but I disagree. I work 12hr days as my mothers slave, driving her around, managing everything whilst also being my dad’s caregiver. She said bro didn’t earn his but hes only19 & a student. Therefore the expectations should match that, besides he does the business artwork, chores & works part time. I told her she& her husband cant expect anything from someone they havent spoken to in a year & now her argument is that me & bro already have enough (mum bought us 3 properties each) whilst she has to share with her husband & kids. Sis says Im selfish but I think its the stress of being the only source of income for a family with two young kids that is getting to her. I feel for her, shes said shes worried she might lose her job because she cant dedicate time to her career bc of the kids, but both go to childcare 3xweek & if BIL is unemployed,I don’t know why this is. But sis & BIL have always been entitled, before when BIL worked for mum, they would take mums credit card for groceries and other shopping and not tell her \n\nMore than anything I dont want BIL’s laziness to be rewarded with mums hard work. Though I dont really like my mum, I cant deny she has set us up for life. To think of all the hardships mum endured migrating to Australia & juggling three jobs whilst pregnant to build her dream house & it could end up in BIL hands..makes my heart clench. \nSo am I the asshole? If it was my sis & kids I wouldnt mind, but her and BIL are a packaged deal\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "ESH and sound greedy and entitled. \n\nWith all that money, surprised your mom didn’t have a lawyer to recommend something like putting your sister’s share in a trust for her children.", "YTA - you call your sister entitled when you sound even worse, and desperately unpleasant to boot.", " YTA - rich AH's with rich AH problems....", "NTA, your mum has gone over and beyond to give a helping hand , sadly your sister has married a leech who was fine taking  a $100k salary for doing bugger all, and quite happily lied about the $20k loan, probably reasoning that some would fall their way from inheritance, and in the meantime has sponged off your sister for the past 5 years, or has he been looking after the kids? Your mum appears to have made provisions for their kids, so l think she is smart enough to know what your sister has married, and there is always the option to amend the will if she wises up and dumps the lowlife.", "NTA it sounds like sis and BIL already got their inheritance from mom when she bought them so much property.", "Good lord this is all first world problems. “I was given/gifted this many properties. I also have a job.” You know how many people don’t have this? You are incredibly lucky and honestly sound like you’re trying to squeeze more money out by getting her (your mom) to exclude them. I get your BIL is lazy af but seriously you are  trying to take away from a sibling. Don’t forget it is your mom’s decision so she can just as easily kick you out of the will and leave it to your brother and sister instead.\n\nEdit: YTA and spelling", "You’re too involved. It’s not your will. You’re lecturing your sister about someone else’s inheritance. Your feelings about BIL are irrelevant. \n\nYou’re also opening yourself up to sister’s future “undue influence” claims against you, depending on where you live. If you convince your elderly mother to remove sister from will, and sister challenges the will, she could win and then everything gets split equally. \n\n“I don’t want BIL’s laziness to be rewarded with mums hard work.” \n\nNot up to you in the slightest. Your opinion is completely irrelevant. \n\nYTA.", "YTA.\n\nThese are not your decisions to make. You’re destroying family relationships over greed, pettiness, and self-righteousness. You’re being a selfish AH.", "**YTA**\n\nYour mom seems like a very volatile person, what she says a year from now could be very different from what she's saying now.   There is really no reason for you to put stir up her shitstorm.\n\nIf your mom's real problem is that she doesn't want your sister's husband to benefit from her estate, there are plenty of ways to do that -- trusts for the grandkids administered by a non-parent, annuity for your sister in an amount that would only marginally enable BIL.   You say she's already purchased properties to you and your brother, why doesn't she just set up something to pay for her grandchildren's childcare and nothing else?    She could also purchase a property and will it to your sister as the sole owner, or make arrangements for her to live there in the event she becomes a single mother.\n\nThe bottom line is that instead of icing your sister out, you could be helping your mom to creatively exclude BIL from benefitting from her estate.", "YTA, it’s kinda shitty to do that to your sister and her kids, inheritance is inherited, not earned", "Wow.. YTA", "NTA in the end it is as you stated your mom‘s decision and I can see why you wouldn’t want to enable your BIL further. I can also feel that you attribute sentimental value to the properties, which I find really admirable given that you all have your own assets anyway.  To be fair to the next generation and maybe ease your mind, can you find a solution that you and your brother manage the properties until the children of your sister can take responsibility for them and then they go directly to them and potential income until then you can put into a trust or similar to support e.g., their education?", "ESH.\n\n&#x200B;\n\nBunch of spoiled brats arguing over who gets the most of mommy's money.", "YTA for manipulating your mother to disinherit your sister. Doesn’t sound like you even need more. You are just pathetically greedy.", "you and your sister sounds like a bunch of vultures, fighting over wealth you didn't help create, disgusting.\n\nESH, your BIL sucks but you suck even more for convincing your mom to take your sister out of the will just because you have beef with your BIL, let your mom make her decisions about **her money**", "I don't think YTA for not wanting it to go to BIL, but you easily could have persuaded your mother to just put your sister's share in a trust for your nephews/nieces. You are being greedy by having her split it between you and your sibling instead, so you are the asshole.", "I appreciate your concern but could your mom set up some kind of annuity that would provide a monthly sum to your sister with enough specifics thatBIL couldn’t touch it. It seems unfair to exclude her. NTA for your feelings. YTA for your actions.", "YTA.  It really is none of your business who your mother chooses to give the inheritance to.  Ultimately it's her decision, not yours or anyone elses.  You can put your 2 cents in, but that's it.  I don't know your sis's financial situation, but regardless of BIL, why would you want to do that to your sister?  Yes your sis & BIL are AH's, but it still isn't your decision.  You are being selfish.", "Absolutely my sister works really hard! everyone in our family acknowledges it but my mum also doesn’t want my BIL to inherit anything else from us. She was already on the fence about it, I think me saying “I convinced her” was perhaps putting it too strongly. Also, I think for you to expect someone to leave you something in death, you should at least be in their life?", "I agree, none of us are entitled to anything! I definitely view “earning” as having a relationship with the deceased which is why I’m in this turmoil and want to make things right.", "Honestly the money is pretty recent, perhaps within the last 4-5 years. The 12 properties belong to our family trust because we built it ourselves (mostly mum, a little dad) the Family trust doesn’t include BIL, but seeing how my sister has put her husbands name in the title of all the properties my mum has bought her, has made us assume she will find a way to share her inheritance with her husband. Hence why we’ve limited her to her share of the life insurance.", "Unfortunately I couldn’t explain with the limited word count, but the reason why I only asked to split the properties between myself and brother and not the life insurance is because one is our family home and the other (12 properties) was my mums life project. My sister will still get her share of the life insurance but the properties imo should be handed out to my brothers future children and my sisters kids when they’re older. I don’t plan on having kids and it would be pointless for me. That’s my attempt, but I agree it does seem like I’m icing her out and who knows, my mum’s mind could change. But I know my BIL hasn’t changed in nearly a decade and is still leeching off my sister and it would likely worsen if she gets more inheritance.", "It is still ultimately your mother's choice to how and to whom she wants to leave her assets.\n\nAlso: you say both you and your brother she gave 3 properties to, had that been after your sister went no contact? Because if it was way before, I get that she is angry about that.", "I’m going to say ESH, with that being said there are ways to go about splitting things with Sister. I do believe that Sister is enabling husband.\n\na trust can be set up in wife’s name to issue a certain amount of money every month setting up a trust for for grandchildren for college or whatever that they can’t access it 21 or whatever she decides.  Just make sure the trust is set up with a lawyer or a trusted friend because if it’s set up in the Sister’s name you know darn well the husband’s gonna take it.\n\nI did this with my middle child she’s 46 and still hasn’t figured out her life. She’s made many bad choices drugs included. I have set up a trust to help her get her own place and sustain herself. But I’m not going to give her a large amount of money in cash because she would be broke in a month.\n\nThis might be something to discuss with your mom. There’s ways to include Sister and exclude husband. Giving her monthly income from the trust is going to help her out too.", "That’s the thing. Your BIL wouldn’t be inheriting anything, your sister would. It is her choice what to do with that money once the estate has been settled and no one can say boo about it.", "You’re also not entitled to “make things right” or meddle an “convince” your Mom what to do with her money. That’s her business. Sure, if she asked you can give your opinion, but that does not involve convincing or actively coercing like you did. \n\nAnd your BIL is completely irrelevant regardless if he’s lazy or not just as any siblings spouse would be, including yours, if you have one. Grandkids are relevant, but spouses aren’t unless your Mom wants them to be.", "You’re not in the turmoil. You’ve inserted yourself by choice. There’s nothing for you to make right. Get over yourself. It’s not your estate. End of story.", "YTA. There is no “earning”. Greed is the only thing motivating you being an asshole to your sister and it’s a shitty thing to have done to her. \n\nYou’re in this turmoil bc you’re selfish.", "If they are married his will always be entitled to half of what she has.", "So \"we\" didn't build it then, your parents did.", "The life insurance will be cash that will benefit your BIL more than any other arrangement.   It would be much better to designate a trust for the children as beneficiary then construct a different settlement for her.   The trust could be set up to pay for their childcare only.   Your sister could be left a property with a life interest only -- in other words, she can live there but not sell it with the rest held in trust for the kids.", "Mother bought Sisters first 2 houses and helping with the 3rd. So they are all equal with the 3 properties. Plus gave her deadbeat husband a job making 100k that wasn’t good enough for him. Personally I wouldn’t give the daughter anything until she left her husband. The inheritance will be squandered in .5 seconds and they will be looking for a hand out again.", "We all got our properties within the same time period , over the course of about 2 years, this was when my sister wasn’t NC. I think I should have clarified, most of the assets are in a family trust that my mum manages hence it’s sorta a group decision. Quickly gathering I am the AH and now trying to figure out how to rectify this while keeping the peace.", "Unless she never really has it. Carefully constructed trust. She might get the income from properties (to share), but not the properties.", "Thank you for the clarification!", "YTA. You seem like the entitled and manipulative one. Rich people are so weird.", "OP, let me say you worded it very bad and it's only because the BIL's thing gave me a hint that I decided to read the comments.\n\nYou\"re not deciding to cut off your sister, but to protect the houses in order to keep your sister's children protected from their dad.\nI'm sure it can be done better, for example putting half of the houses in a separate trust for the nieces and nephews and making you and your brother the trustees or stuff, or split evenly and put sister's share in the trust, which would be the safest and fairest way to manage it\n\nEdit to vote: NTA", "NTA! \n\nYour sister cannot expect to be gifted something from someone they have had no contact with for a year. Your mom has already helped her with 3 properties and her husband needs to stop being lazy and work! You help and go over and beyond compared to what she is doing for your mom. She needs to check her husband because he looks like he causes a lot of problems when it comes to family and money.", "ESH", "EHS. You're all entitled brats. None of you earned any of this but your mother. I hope she writes you all out of the will and donates her money to charity.", "I don't want to call you an AH, but if  you wanted to, you could ask mom to make Trusts for your sister kids? In a way to prevent BIL to use/expend it?", "Everyone is TA. It’s MOM’s money and assets.  On,y she gets to decide what she does with them - while alive and after she passes.\n\nYour opinion is irrelevant", "YTA you sound entitled and should be building your own life instead of counting your mom’s inheritance and monitoring what your sister is up to.   \n\nYour mom sounds controlling and working 12hrs a day with her is not normal, perhaps that’s why your sister isn’t talking to her!    \n\nYour sister is busy building a life for herself and kids & doesn’t have time for the family drama.    Her relationship with her husband doesn’t concern you.   \n\nAlso:   Assets obtained during marriage become marital property!     That’s why her husband has claim to the three properties that were given to her.   \nYour spouse would have the same rights.   \n\nIf you don’t want to have joint marital property rights then don’t get married.", "If your mom is an intelligent woman of sound mind, as it seems she must be to own and manage her affairs, she is perfectly capable of making her own decisions. She would also be capable of determining who to inherit/disinherit based on whatever arbitrary criteria she desires. However, if she is mentally or physically compromised and the changes made are different than they would be if she were of sound mind, you are an AH and the will should be thrown out in favor of the will written when she was fully capable.", "The greedy little sneak gets a YTA", "YTA for posting something like this and expecting anyone to relate to it.", "I’m inclined to say NAH/YTA only if your mom asked your opinion. If she did, then no, you’re not the asshole for thinking sister’s estrangement equals less of an inheritance, but I get her being upset.\n\nIf mom didn’t ask and you offered your opinion anyways, then yeah. You’re an asshole. I also think it would have been different if she was considering distributing property now instead of at death. It does affect you and immediately so, so speaking up is important. But… this does seem a little petty. \n\n…I admit I’m also tempted to mention being a small business owner who is always open to investments…", "I don't have a good paying job.I don't have properties, a house or anything of real value.I don't have a sister.I don't have a mom, I don't have a dad.\n\nYou have everything, but I guess it's never enough.\n\nYou sound ungrateful and spoiled. 'give me money'\n\nTalking about inheritance like that's what important. Family is important, not their money.\n\nSome people have real problems. This isn't a real problem.\n\nIf you're all already rich as fuck, you could consider donating that money to charity or people who really need it, because not everyone is lucky in life. That way you also don't have to fight over who gets what or who 'deserves' it more.\n\nYTA", "ESH but YTA in particular. I get what you're supposedly doing but it's not your choice, it's not a problem for you to fix. Inheritance beigg earned is purely your opinion and you don't get to force that issue. Your mother seems perfectly capable of making these decisions for herself and as everything is hers she has the absolute right to do whatever she wants with it WITHOUT interference from anyone else. All you are doing is using your own bitterness to manipulate the situation in your favour. Frankly you're equally as awful as your sister and BiL, just in a different way.\n\nHonestly you sound like a toxic family.", "NTA - if you pretend it's just a case of a Lazy entitled leech of a sibling trying to gather their other siblings to contest a will, then finding out said siblings also think they're a leech and want her cut out; then OP wouldn't be the AH in this situation.", "ESH jesus she's still alive. I hope she donates it all and leaves everyone with $1 each in pennies", "After slogging through this list of entitlements, I say\n\nYTA\n\nthis was the selling point: \n\n>imo inheritance is earned\n\nyour \"o\" is part of your toolkit of manipulation and judgment, and imo, you are a greedy git.", "NTA What will happen will happen.", "I think you guys should hash it out over a family trip to see the Titanic.", "ESH\nDamn they raised some entitled little shits lol if you’re *that* worried about the money maybe your mom should put specifically what the money she gives your sis can be used for. Idk if that’s a thing, my fam isn’t rich af so I don’t have these problems", "I got to the part about owning 12 properties and decided ESH here cause y'all are hoarding wealth and nobody needs 12 homes.", "Boo fucking hoo", "lol y'all sound like entitled lazy people so ESH it is 😂", "ESH. Fighting over your mom's property while she's still alive, Jesus Christ almighty, this is disgusting. \n\nIt's her money/property, she can do what she wants with it. Until she's dead and you're legally entitled to whatever you're legally entitled to, stay out of it. And go to therapy if you can't figure out how to create healthier boundaries. Y'all are way too enmeshed in each other's business in your family. It's giving dysfunctional.", "ESH.   Sister and BIL dont deserve the money if what you say is true, but at the same time there was 0 reason for you to convince your mom against them unless mom specifically asked your opinion.  \n\n\n\nIts not your will and convincing her to cut them out honestly sounds greedy, even though i know youre doing it because theyre moochers and not because you actually want more money.  It just wasnt your place to give unsolicited advice to cut your sister out of the will", "Honestly posts like this make me glad my parents have nothing of value for me to inherit. The way some rich people seem to squabble as they divy up their parents' savings and possessions is disgusting. Especially when the parents are still alive and perfectly capable of making their own decisions. Anything you get is a gift, not something owed to you. Especially when none of you even seem like your mum. ESH let your mum write her will, get back to your own life and stop planning someone else's death.", "YTA. Her situation with her husband is between her and her husband. It’s not your place to decide what she gets and doesn’t get. \nYou are exhausting", "OP wrote - My sister will always get her fair share of the life insurance. – life insurance and the will are two separate things. If your sister is on the life insurance as a beneficiary she gets that money – you don’t dictate how much she gets. You say this - Sis is NC with mum, understandable  - my mother can be manipulative & is a borderline narcissist. You also wrote -  I dont really like my mum, I cant deny she has set us up for life.  And that in your opinion inheritance is earned – so have you told your mother you don’t really like her but you’re working for her for the big payoff when she dies? Sounds like your sister should get her share of the inheritance because she’s not a hypocrite.", "ESH\n\nAll of you are shameless unrelatable manipulators. This whole post grosses me out.", "I can see your point in not wanting your BIL to profit from the trust-- but I can also see how hurt and disowned your sister must feel and how it might look to an observer that you influenced your mom to disinherit her since you'll receive a considerable extra portion of inheritance.   Is there some way to put her share into a trust to benefit her children at a certain age-- maybe when they turn 25 that she and her husband wouldn't be able to access?", "Who cares. Each of you have enough that you shouldn’t bicker and argue over money. That’s ridiculous. Three houses are already enough. 300k is a lot of money. I don’t know why people get so obsessed about stuff, when they are not actually struggling.", "I feel bad for the mom. Kids are fighting over the inheritance (and discussing contesting the will) while she’s still alive and well. You’d think she’s on her deathbed after reading this post.", "Nta. Don’t listen to them op. Bil sounds like a mooch and a bum. People are forgetting that he STOLE and lied to his wife about the money the mom loaned out to them. He’s also a thief. He doesn’t deserve shit.", "NTA\n\nOn a side note, how much money do y’all have :)", "You know this is Reddit, right?", "Don't trust you at all there is a massive whiff of self entitled shit coming off your post.", "NTA-  this is your Mom’s decision and you voiced your opinion.  She has the final say,  she could accept your opinion or not.  If you’re sister is NC with Mom why does she think she would get anything.  NC to me means no contact including assets.  However, if your Mom decided to exclude you too that’s her decision.  It doesn’t have anything to do with earning anything.", "ESH.", "Seriously, OP's mom buys each kid THREE properties? What in the White Lotus is all this shit?", "Try looking it more as a \"I don't want my lazy, entitled and dishonest BiL to get more stuff.\" OP is not really demanding more... they just want their BiL and sister to get less because of their lousy attitudes and how they've treated the rest of the family... and I'd have to agree. In OP's situation, I'd prefer the BiL's share go to charity than see him be rewarded for being a lazy leech. NTA from me.", "Everyone sounds like entitled AH", "ESH \n\nI hate everyone in this post lol", "[deleted]", "Preach", "God id kill for dental insurance", "Totally rich people problems.", "OP is an AH because you're jealous? Such a weird take.", "Came here to say that. You gave the correct answer.", "Was thinking, man this is some rich people shit. Mom gave them 3 properties each like damn.", "It’s not your will. You’re lecturing your sister about someone else’s inheritance.", "This! Also, OP gets paid $100,000 annually to care for their mother. That's a lot of money. I get that BIL sounds like the most entitled of this group of entitled AHs but it's hard to have any sympathy for anyone in this story. \n\nYTA", "I'd prefer neither op nor bil get anything and it all go to charity but that's entirely irrelevant. OP is an ah", "Well that really has nothing to do with him.  His sister gets a third he is relevant. Op is the ah because it isn’t his money.  It will be but only at the rate of 1/3 until he spoke and pushed out his sister.  She was getting it and by extension bil.  It wasn’t going to him.", "I could understand taking off what they owe her, but beyond that, i dunno.", "[removed]", "I need to know what did you do to \"convince her\"?", "Your mom should see a lawyer. You do sound greedy af so YTA. Mom can alway set up a trust for sis so she can do what she wants with the inheritance", "So you're punishing your sister?", "There's no \"we\" involved Elon, your parents built it.", "'We' built it. Lol!! You did nothing.", "Ignore these people, they have a gender bias. You’re NTA.\n\nShe went no contact with her mother, you actually help and support your mother, she shouldn’t get the inheritance. Set something aside for the grandkids in a trust, they’re innocent.", "This is not for you to decide. You should be telling your mom “whatever you want to do. I don’t want an opinion. It’s your money that you earned and you should do what you think is fair.”  YTA", "Your 100k is payment for your contact with your mum, who you don't like, yet you present it as a sacrifice. What bullshit.", "I don't think it's unreasonable for your mother to cut out her daughter that doesn't speak to her.  That seems like a minimum requirement to get the gift of an inheritance.  And your mom seems like a strong-willed person, so perhaps you overestimate your ability to persuade her.  If your mom doesn't want BIL to get anything, what about setting up college fund trusts and the like?  She can help sis in a real way without giving $ to BIL.  She could also give her real property as life tenant, then she can't put his name on it.  She should talk to a lawyer and brainstorm about how to help sister without giving cash to BIL.  You'll feel better too.", "She presents looking after her mother, who she doesn't like, as charity when she's paid 100k to do it and THEN uses it as a reason to get in on the will.\n\nThis person is a greedy little fucker.", "But BiL is TA.  OP is just an AH.", "Your mother can give it as a personal asset, aka not a shared marital asset. Or put in a trust for the kids.", "NTA. \n\nYour sister is NC with your mum. So why would she expect to be in the will?", "NTA - it's ultimately your parent's decision, no matter how much influence you may or may not have. They are grown adults. I would hold the same opinion as well, it sounds like your sis and BIL are entitled and lazy (more so BIL)", "NTA. He’s a freeloader.", "NTA or ESH. If your sister cut off your mom and is no contact with her, i don’t know why she expects anything. Sounds like she’s using your mom for her money.", "Some major first world problems, I'd definitely say ESH.", "Nah I tried to care then you said your family owns 21 properties in a housing crisis", "Nta\n\nIs up to your parents, but if sis and BIL were active in her life, she would not change her mind so easily. It's not like they will be homeless since she also bought her three properties. She is not happy with the BIL and probably with the fact your sis has been nc with her.", "I get where you are coming from because you do not trust the guy. You sister should have her own protection in case anything happens.", "Look OP, I think ESH except your brother BUT there are ways to keep your sister in the will and ensure that BIL doesn't get anything. I had a boss who married into a VERY wealthy, old money family. The money was all in trusts. When boss and wife were engaged her dad had a talk with him informing him that her money is her money and will never, ever be his. Your mom needs a good lawyer and can write the will where it triggers a trust for your sisters money at inheritance. Or mom could even put all her assets in a living trust now with herself as sole beneficiary and iron clad rules for when she dies.", "INFO: what the fuck?", "I stopped reading after seeing the value of the insurance and the house and properties. This is rich kid problems that I couldn't possibly care less about. \n\n&#x200B;\n\nChances are you're all assholes.", "YTA, greed has pushed you to punish your sister for who she married so you can have more and her and her kids can just suffer for all you care. How can you type this and not know YTA.", "ESH", "ESH no one should be telling mom how to handle assets after dad passes. Let her make her own choices and respect them", "You come across manipulative as well, given that you convinced your mom to cut your sister out. And given how time works, even if she's been no contact for 1 year, that's still more time with contact than you or your brother have even been alive.", "YTA because no one except a lawyer should be consulting your mother with what she does with her money/assets. You shouldn’t be talking to her about it at all, it’s not your business. She needs a lawyer asap to protect herself from all of you", "YTA and you know it.", "Why was your 16yo sister with a 22 yo man?", "YTA. You exerted undue influence on your mother. If she wants to change her will to exclude your sister, that should be her decision *alone* and she better have an airtight reason for doing so otherwise her estate is going to be a mess of litigation when she dies if your sister decides to contest it.", "Why are you punishing your sister (AND her kids) for her husband’s behaviour? YTA", "YTA.", "YTA. \n\nInheritence by nature are not 'earned'. That is such a ridiculous notion. \n\nAlso, you aren't screwing over your BIL in this situation, but rather your sister. \n\nJust because you are okay with keeping a relationship with someone who is toxic and manipulative doesn't mean your sister has to suffer. Though then you are making her suffer because she chose to have healthy boundaries for herself? \n\nYikes. \n\nYou had no right to meddle whatsoever in this situation at all.", "YTA.", "YTA- again you have a trust and can restrict what the money is used for. Taking a job from your mom for $100k and suggesting someone else is entitled is amusing.", "YTA. Imagine having a sibling like this?", "YTA. \n\nThere's a lot of justification for you sticking your nose into your sisters business for you to get a bigger piece of the pie, though.", "You're better than me OP! I would tell her you would consider share if she divorced BIL!! Going NC means you reject all what implies that person, yeah behaviors but also Money!\nNTA!!", "YTA you l're saying you're earning your inheritance but your mother pays you $100,000/year to do the things you're doing for her. So you want to double dip and get paid to be her assistant AND take your sister's inheritance. You're greedy and selfish.", "YTA. No-one earns an inheritance. Why do you need to control what other people get? Just be grateful for your free money that you didn't earn.", "YTA.   you sound like a complete selfish ass hole.  You are 24 years old and your inheritence seems to be at the top of your priority list", "YTA. You dont have to leave her anything in your will. Her parents can do what they want.", "ESH. You all sound entitled AF.", "Ah yes.. Australia is in a rental crisis and your mum owns 12+ properties..  gosh wonder what it's like to deal with this first world problem. Like nobody is dead yet, why are y'all fighting over alive people's money?? \nYTA for acting like a bit of a spoiled brat, maybe be grateful you're getting anything at all :/", "Looks like your mother isn't the only manipulator in the family.\n\nYTA", "I just got a headache reading all this. Can’t think about who is worse.", "YTA. You shouldn’t be “convincing” your mom of anything. It’s not your money.", "YTA bro y’all are rich af", "Will contest for undue influence incoming! YTA. It's none of your damn business.", "She has 3 kids. You are not judge and jury. You don't get to decide who gets what. You are behaving like a self entitled brat. What you did was disgusting because you want all the money for yourself. \n\nAt least admit the truth. Your greedy. \n\nYTA.", "I've got to call a mid-to-mild YTA on this.  Why?  Because inheritance is not earned; it's a gift from the person who actually earned the money.  It seems a little greasy to influence your mother to cut someone else out of the will because you dislike her; as you work for her directly, there's also a possible case for undue influence.\n\nI'd advise anyone to keep out of influencing aged relatives' decisions about the will.  You can make it clear that you and sis don't get on, and how BIL is a jerk, but let your mother make her own decisions.", "YTA. It was not your choice to make. You manipulative woman.", "If you were being a good sibling you would want to protect your sister. Her share should go into a trust that BIL cannot touch, provide her with income and a way out when the day comes she has had enough of this guy’s shiftless ways. YTA right now but you can fix it by talking to your mom and an estates lawyer.", "What makes you any less of an entitled asshole than your sister or bil? You’ve connived your way into more of someone else’s money that you didn’t earn, using spite as an excuse for your greed. Yta. Raging asshole", "Yta", "Nta", "With the exception of your brother (he’s still a kid) you’re all assholes. Inheritance isn’t earned. It’s a gift that whoever leaves you because they love you and want to provide for you.", "[removed]", "Whats the acronym for “y’all all sound terrible”?", "Why not have your Mom put a portion into an educational trust for your sister’s children and that can be her share?  Mom should leave a nominal fee for her in the will to make it difficult to contest", "Nta. BIL doesn’t deserve anything, lazy as he is. Sister should dump his a, before he leaches more", "NTA make sure the BIL and sister get nothing!!! Go no contact with them.", "YTA. It’s not your money and you never know exactly what goes on in other people’s relationships. If your mum didn’t choose to cut your sister out herself, sadly no business of yours.  If your sister chooses to share her third with her husband, it’s none of your business either, even if you disapprove.", "YTA.  \n\nOn a separate note- this is why I cant buy my first house. First world problem for the win.", "Rich people’s constant need for more, more, MORE! Is something I will never understand. Y’all are gross.\n\nETA: ESH", "What a novel", "NTA but your BIL sounds like a deadbeat asshole", "Why not  split everything fair amongst 3 kids but subtract 20k from the life insurance?\n\nYTA", "I can’t comprehend this through the screaming entitlement. It’s too loud. \n\nESH.", "She better convince mum to put in the will, $1.00 to my daughter w/  Bil. Or they could have a case against the will, to contest it.", "Nta. I agree with you. Bil is the problem", "I was with you until you said you don’t like your mom. Y’all sound like a bunch of ungrateful brats", "Oof this makes me sad. Money makes everyone an asshole..", "Nta. Sister is already getting the inheritance, she will be fine. Maybe leave the half of whatever else she's asking for in a trust for her children.", "So you leveraged your mom's narcissism by saying\"they don't come around enough\" so you could acquire.more capital because you are judgemental of others living situations?\n\nYTA, you sound just as narcissistic and manipulative as your mom. Maybe you were just projecting and your mom is a good gal but I'm thinking the apple didn't fall far.", "Sis has three properties but her job is the only source of income… wow if only there was a way to earn more money when you own properties..", "Get the mom to leave it to their kids!", "Personally, I find any and all inheritance related discord to be assholish.", "ESH I hate everyone involved in this situation, this is too much \"first world problems\" for me to handle lol", "Y'all sound insufferable tbh", "Good grief this is the least relatable shit I've read in a while. Y'all are fucking more than set and you're arguing over more money before your dad is even in the ground.\n\nFrankly how your sister and BIL live their lives is none of your business. Step off and mind your business. Better yet, convince mom to give the money to some hungry families or something.\n\nESH.", "Yeah I don't think I can fairly judge here, fundamentally you manipulated your mother into writing your sister out of the will.  To me YTA.  Like your mother can decide to remove her from the will that is definitely her right, but it sounds like you championed it and encouraged it and not because of her, but because you dislike her husband.\n\nStill hard to judge it all but yeah if I was the sister I would probably consider YTA.  But at the end of the day your mother made the decision and she can decide that the BIL pisses her off enough that she wants to cut them out.", "YTA. You just want more $.", "INFO: why the fuck your family is filthy rich but you bust your ass by working 12h AND is your father's caregiver? can't you hire nurses like normal millionaires? if you are all so rich, how come $20k is a big deal? this whole story is insane. it sounds like everyone suck, not only BIL..... honestly, if i married into such a wealthy family, i'd complain about having to get a job too", "Is this Succession?", "Y'all have 3 properties each and stand to inherit 12 more plus all the other assets your parents have and you convinced your mom to disinherit your sis because of your idiot BIL? That is way harsh, and you know YTA. \n\nThere are trusts that can be made to include just sis and children without any type of way to add BIL to them, but your greedy tail couldn't have that huh? Then you ran to reddit to get validation from the internet? I'd delete this petty rich people problems post if I were you. \n\nWhat your sis and mom have going on between them has nothing to do with you. You should have kept out of it.", "NTA but maybe have a stipulation she can’t be with that man or have any money going to that freeloading loser who’s taking advantage of your family", "NTA. Sister chose to be with someone who’s willing to take advantage of the family… why should he receive any of the benefits… and it was all their decisions not just ops lol", "I can't weigh in on this entitled nonsense", "Had it ever occurred to you that your sister might have another perspective given that she is the older sibling? And perhaps her ability to set boundaries with her shit husband might be related to her life's experience with your mother's narcissism? I'd check out r/raisedbynarcissists to find out more. \n\nI'm the only child, my younger brother didn't speak to our mum for 6 years. I never once suggested my mother change the will (I'll be honest, it's probably a 10th of what your mother stands to leave you, but it's enough). My mother died. My brother inherited 50%, as he should've. Despite him having not helped with her previous mental health crises, her frequent house moves, her health issues (emphysema and COPD), her general day to day. He didn't chose her as a mother, neither did I.", "ESH. You’re all greedy pigs fighting over inheritance money while your mother is still alive. None of you deserve the money and your mother should just donate it to charity where it will actually help people.", "They built everything themselves.. mother OP and f family.. exception of estranged sister and BIL. why should they benefit from others hard work?  Mother worked her ass off even moved to another country! This isn't family money this is busy your but money did your kids can have a better life. Lazy BIL shouldn't get a dime. He had a 100k a year job he didn't show up too.. nope..\n\nNTA", "My grandmother had money from an unexpected windfall. While she was alive two of her children took took took and the others did not. When she passed, she left minimal amounts to the takers because they for their inheritance while she was still alive. \n\nThere was a lot of resentment from the ones who didn’t get anything but they also never added anything to her life. \n\nNTA.", "NTA. I don’t really agree with the reasoning but the sister/BIL basically stole from the mother. It sounds like it’s mainly the BIL who’s the issue but if the sister is sticking with him and has gone no contact with her mother then why should the mother include them in her will? The rest is just entitled rich person bickering and no one is going to end up destitute even if the mother gives it all to charity", "OP is greedy imo.  3 kids should be 3 ways.  Ugh money makes everyone awful.", "This is rich person problems. \n\nIf sis is that bothered and worried, sell a property.\n\nI want to say ESH due to the sheer number of properties at hand here. It's mad, but technically, NTA.", "NTA.", "Can’t relate to the money aspect of this but NTA for supporting your mothers wishes and not wanting an unemployed mooch to be rewarded with your mothers hard earned money.", "So this is what life is like for the rich. ESH. You shouldn’t convince your mom of anything, she should make her own choices. Your BIL needs to get his act together and your sister is also greedy. Inheritance is also not earned. The time you spend with your mom driving her around and what not is your job, that you’re already getting paid for. If someone else not related to the family was working that job, would they also be entitled to the inheritance? If I was your mom, I wouldn’t give either of you the money tbh, you both sound entitled and greedy.", "Rich people for you! ESH", "This is one whole heap of first world problem. I can’t even get my head around it. \n\nBIL is TA, you’re an AH, and this whole mess is just too rich.", "I work in wealth management.  Anything except a perfect division of assets in the inheritance is going to ruin relationships.  \n\nFix this if you can.  It’s only money and it doesn’t sound like you need it.\n\nYTA.", "You all sound like spoilt bratty assholes", "YTA, that isn't your choice. I also disagree that \"inheritance is earned\"", "NTA. For making sure that the BIL doesn’t get anything. YWBTA if you didn’t make sure that your nieces and nephew had something set aside for their future. Your sister made her choices, but I don’t think her decisions should impact them.", "“Inheritance is earned” is the exact opposite of what inheritance is.", "Ian on your side. Nta. Block him from getting anything through sis", "NTA- it is the mother's decision.", "ESH you all sound like privileged, entitled AH’s.\nAlso, this argument is ridiculous and being in Australia it’s redundant. When your parents pass, their estate can be challenged by your sister if she isn’t named. She’ll still get her share.", "NTA OP. Too many of these inheritance posts act like you put a gun to someone’s head. You told her that your brother is a slimy person and will benefit from any money your sister receives. Your sister is backing that said slimy person. You’re mother, who seems to be in agreement, whether you said it or not. Tell your mom to contact a lawyer to protect her money etc from his grubby hands.", "YTA. You do not get to interfere with someone else's Will period. It's none of your business.\n\nBesides: everything you have posted here suggests you have exercised undue influence on your mother to get your sister removed from the will. *This gives your Sister grounds for challenging the Will when your mother dies*, which means not only will your Sister get what would have been hers anyway, but you will have ruined any remaining feeling between you and her thanks to an acrimonious court case.", "ESH\n\nI think that your BIL is TA because (according to you) he a) took your mother's credit card, and used it to buy groceries and other items and didn't tell her, and b) worked for your mother as her assistant for six months, and then quit because he didn't feel like doing his job, c) hasn't worked in five years because (according to you) he is lazy and has a huge ego and seems to believe that most jobs are beneath him, d) doesn't seem to help your sister with the childcare, which I think is especially problematic, since he isn't working, and e) lied to your sister about where the $20,000 came from. \n\nI think that your sister is TA because she seems like an incredibly entitled, selfish person. Your Mom has already done a lot for your sister and BIL by buying them two properties and giving/loaning them $20,000. \n\nI think that you're TA, because, well, this entire post stinks of first world/ignorant, rich people problems, and I can't relate.", "YTA very entitled and spoilt", "ESH- I wish i had this problem.", "You know why you got Y T A'd to hell in this sub? Because you revealed that you are rich.\n\nAccording to reddit, rich = evil period.\n\nBut really, I would say NTA by giving you the benefit of the doubt with the below assumption.\n\nYou or your brother SHOULD NOT benefit from the sister's part of the inheritance. Give up her share for charity. That's fine. Otherwise, it's just manipulating facts for your benefit.", "OP please Google undue influence", "NTA. Your mother doesn't sound stupid so it is not like you forced her to do this.  Sis and BIL have already been given a lot and sound greedy.  I would stay out of it and keep doing what you are doing.", "NTA. I find it odd how people immediately wanna say OP is TA just bc it’s a rich family. OP isn’t trying to get extra inheritance, he just doesn’t want to enable BiL’s laziness. OP also explained that the mom was already considering excluding sister and BiL from the will and she never had to agree with OP anyways. OP explained he wants the properties to eventually go to his brothers children as well as the sisters children when they’re all old enough. The sister is also still getting her fair share of life inheritance and if she and BiL are no contact with mom, isn’t it more greedy for them to expect the same amount of inheritance as the people actively in moms life? \n\nThis inheritance was built off hard work, it sounds like those in the family also work hard with OP doing 12 hr work days and yet BiL has been job searching for 5 years? But somehow the kids still have to go to childcare 3x a week and sister is at risk of losing her job bc she has to take care of the kids. So what is BiL doing then?? NTA", "ESH \n\nIf you hold that much sway over your mother, why don't you suggest she puts your sister's third into a trust to be divided equally among her kids once they become adults? The kids didn't do anything that you disapprove of yet, did they? Why punish them?", "YTA. Your mother wouldn’t have removed her. You said what can she expect if she is NC but this has nothing to do with that. Sister got removed because YOU, meddled. Because you think you deserve it more despite sister having objectively less than you. Her husband doesn’t matter in this equation, you are just ridiculous. This isn’t your choice.\n\nAlso its a perfectly legit misunderstanding on bil‘s part. Apparently your mother has a habit of gifting ridiculous amounts of money so why would this case suddenly be a loan? And you make it sound like they got so much from mom already despite you having gotten just as much or even more.", "HUGE YTA. you’re manipulating your mother to cut your sister out because of you being jealous and that’s it.", "Yta. You aren't earning your inheritance just because you act as your mother's assistant. I'm assuming you get paid 100k just like BIL did, if not more. It seems really shitty and underhanded to purposefully cut your sister out for no reason other than you don't like her husband. You could have at least convinced your mother to leave her share in a trust to your sister's kids. You come off as hella greedy.", "ESH - rich people problems. Everyone in this story is greedy as hell - stop influencing your mom and just have her talk to an attorney. She could put whatever sister's share would've been in a trust that is exclusively for sister's children.", "YTA it’s her share of money, she may do whatever she wants to, including expending it with her lazy husband.", "NTA - they have received plenty and will still get life insurance money. Your BIL obviously doesn’t work because he doesn’t actually need to and is waiting on his unearned inheritance. \n\nI feel bad for your poor sister busting her ass while he does nothing.  I hope she leaves him. \n\nMaybe talk to your mum about splitting everything three ways and putting their third in an airtight trust for their kids. Because you know they’ll be broke by the time their kids are 18.", "Well I get what you’re saying about bil being a loser and your sister doesn’t even speak to her but it’s her money and she can do what she wants with it. Your best bet is to stay out of it. It’s between them, not you and your brother.", "You’re all AHs", "The guy hasn’t worked in 5 years!! Used to work with mom and scammed her for 6 months, then STOLE $20K from mom and essentially ended mom and sister’s relationship. And sis just let’s it happen all the while stressing about her kids as if her husband can’t find an in-betweener to help his wife.\nNo offense but fuck that guy. I wouldn’t want him to have shit in the inheritance either. And if sis can’t see this- then she needs to talk to her own mom about it. \nNTA. I swear all the y-t-a are mad you’re loaded (which fair, I can’t even begin to imagine), but encouraging a leech? No way. Mom might suck but this is legit the result of her hard work and kids really aren’t entitled to any inheritance to begin with. Your sister needs to handle this directly with her mom and husband. You’ve said your peace OP, so just nope out now. If mom changes her mind, don’t say anything at that point cuz you’d then be an AH.", "Light ESH. I think your sister could reasonably claim undue influence right now. I get what you are saying, and your BIL does sound awful, but your mother likely needs to leave them something to make it harder to contest the will.", "YTA\n\nGreeedy", "ESH, but don’t worry.  There’s always money in the banana stand.", "ESH. The way you and your family talk about each other is atrocious. And inheritance isn't necessarily transactional in that you need to earn it. Should be more like you don't do anything drastic to lose access to it. Ugh. The entire post is horrible.", "People who hoard properties like they're fucking candies get no sympathy from me. ESH.", "NTA, don't want to help the family, don't expect anything from the family \n\nShe made her bed", "God I hate rich kids ESH", "NTA.   \nIf your sister is concerned about her job that's all the more reason for her to encourage her husband to get a damned job!!    \nIf it hasn't been done, it might be nice to set up a trust for the 2 kids that you and your brother administer. they could gain control at 25 or 30. That would keep the money out of BIL's hands and your sisters hands.", "You are all assholes. You are just as manipulative as your mom and sister.", "ESH. You're all so self entitled and beyond selfish. You should be ashamed of yourself for even posting here.", "ESH. You for trying to control the inheritance, your sister for always siding with her lazy husband, her husband for being a moocher, and your mom for being a narcissist. Good grief.\n\nY'all need to get your heads out of your asses. A lawyer should've been the one handling all this with your mom, given that she's filthy rich. Your dad is watching his family bicker over money and inheritance while he's dying.", "You all are greedy. Mom has bought you three properties and you're whining? Who your mom leaves money to is not your business. She should leave $ to your brother and give the rest to charity.", "Rich people problems am I right?", "Bill Gates Sr. had some interesting and laudable views on inheritance and inheritance tax.", "YTA. Inheritance is not earned. That’s the point of inheritance. Income is earned.", "Why not make sure the grandchildren have a trust and you and your brother are in charge of it?  I’m wondering why your sister remains with said ‘lazy’ husband?", "YTAH\n\nYour sister doesn’t like Bill, either. \n\nIf you truly worry about your sister and her husband, leave her portion in a trust for her kids.   You seem to cut them all out so you can have more when you need to be drawing a salary…but aren’t you already being paid handsomely for your services?", "Narcissist don’t really set up their kids for life lmao you sound immature as hell. ESH", "Yeah yeah yeah rich people problems. Aside from how unrelatable this is, my radar went off when I saw your sister was NC. Based on my understanding of dysfunctional family dynamics, it sounds like she’s become the scapegoat. I’m willing to bet you’re the golden child. \n\nYTA. Stop influencing your moms will decisions. And unlearn justifying the mistreatment of your sister.", "YTA", "ESH", "Any way you could have the will written or a trust created that would give your hardworking sister a share if, and only if, she loses the deadweight? Like, organize it so that every year she doesn’t have a lazy, usurious partner she gets a payout amount?", "If you are doing work for your mother, you should be paid or have a contract written up that you will inherit X amount *for your labor*.\n\nFrom my point of view, my parent's estate will be equally divided among their children and that is, I feel, the fairest method. An inheritance isn't for rewarding the child who studied hard to become a neurosurgeon nor is it for taking care of the child who lazed around doing the minimum.\n\nSo, yes, I think YTA for having her (or want to have her) removed from the will... for whatever reason. At most, I would talk with sister about making out her own will in favor of her children. And if I could prove the theft of the credit card by BIL for the groceries and such, then I would certainly pursue it legally.", "ESH.  Have your mother put a third of her estate into a trust for your sister with a trustee instructed to NOT distribute any funds to the BIL  Sure, BIL might cajole your sister into spending money on him, but if she has to answer questions from the trustee (make it a bank or attorney) about what the money is to be used for, it could slow down her spending.  An alternative would be to put the money in a trust for your sister's children so they have funds for an education, to buy a home, etc.", "Succession: Down Under…", "ETA these aren't even first world problems.  These are rich people problems.  Mom can do whatever she wants with her will.", "YTA, This is crazy. Your sis is better off going NC with all of you. Rereading this you display all of the manipulativeness of the “flying monkey”(look it up) of the child of a narcissist. There’s so many red flags—“her fair share of life insurance”? Heavens know what your sis went through. You want to punish her and her children bc her husband is lazy? It isn’t surprising that the rest of your family agree. That’s how it goes. Bottom line, she had the audacity to not deal with a BN while you did.", "Why not by-pass sis & BIL and set up a trust fund or something similar for their kids but making sure your BIL & sis can’t get their hands on any of the money. NTA", "So only you and your brother deserve the inheritance because what? Your BIL being an AH didn't give you the right to cut your sister out of inheritance. YTA", "YTA.", "ESH\n\n\"Waah waah mommy (or in this case \"mummy\" I guess) bought me 3 properties and pays me a $100,000 salary to be her assistant but I'm gonna cry about how entitled and spoiled my sister is.\"\n\nJust admit that you're all entitled spoiled assholes and you and your brother convincing your mom to cut your sister out of the will is another example of your shitty entitled behavior. Cut the crap.", "ESH you all sound horrible.", "Yeah you all kinda suck", "Nta", "YTA- she could put it in a trust for her grandkids and by-pass the BIL.  $100k to take care of your mother.  My God.  All of y’all suck.", "If you had simply chosen not to split anything with her or write up a contract it wouldn't be an issue, but yta because you attempted to convince your mother and your own comments consistently come back to thinking she doesn't deserve it because of something you weren't a part of and don't know all the details or pain that might have been involved. You admit that your mother is a manipulator and borderline narcissistic but then automatically believe everything your mother said about the situation? And judge your sister for it?\n\nA few years ago my mom and I got in a huge fight and I stopped talking to her for a while because she refused to apologize or admit wrongdoing. It started over a political comment on Facebook that she misinterpreted and lost her shit over. My dad came to me and said he understood she overreacted but to not talk over a political comment was ridiculous. See that's all my mom told him. She never told him about the emails back and forth where she accused my husband of abusing me because she doesn't like him and accused him of cheating on me because he has female friends like I have male friends and made a lot of nasty comments about my husband and my marriage. My dad was thoroughly uninformed. He only had the barest crumb of information.\n\nPoint being you don't know exactly what went down. Yet you are being this judgmental of your sister. Sounds to me like you just want more of the money and it sounds like you may have inherited some of your mom's personality traits", "Assuming this is real... I'm not going to make a judgment. However, I am going to ask, have y'all ever thought about setting up an executor and trust for your sister's kids? So they can at least get the benefit, they are innocent bistanders in this situation, and your sister and bil are both excluded. \n\n\nThis would at least come off as less shitty of you, and less like you're trying to get more money, and more like the fact that you're driving home the point that your sister and bil aren't \"earning their share\". Just make sure to set up the trust that the kids can't get it till they're 18 and it's conditional, liwm going to college ect", "I don’t know if it’s just me, but I got serious golden child vibes from OP, and with the sister being the potential scapegoat child it might make sense that she would attract someone predatory like the BIL…\n\nBut yes, YTA", "ESH. Só Your mother is manipulative and a narcissist. But she let you and BIL work for her for a reasonably big paycheck. She's gifting you guys properties and you're all already fighting for who gets more while the person is right there, alive. You guys have mental problems ? Wtf is even this...", "NTA", "YTA. You didn't \"get\" your sister \"removed\" from the will. Only your mother can say who she leaves her estate to. It is entirely up to her and none of your business.\n\nYou say you're only 24. Just think of all the years ahead of you that you'll spend screwing everything up. Is that what will make you happy?\n\nIf you're real, which I'm not sure about, just stop it *now* before you make the family situation even worse.", "Wow. With the lack of punctuation and meandering story that was a wild ride to read.  ESH I guess?", "NTA.", "YTA and sound like the parentifed, greedy, golden child.", "YTA It is not your money. It is not for you to judge your sister. Seriously you are more than an AH.\n\nMy dad died 30 years ago when I was really young. My \"stepmother\" claimed there was no will and yet has never worked a day since. To believe that my dad did not care enough about me to leave me anything has been a horrific feeling to live with.\n\nSo yes, YTA over and over again. Damn.", "YTA \nnone of this money is yours.\n\nStay out of your BIL’s business. You have no idea why he’s so “lazy.” Your sister loves him. That’s ALL that should matter. \n\nAfter that, your opinion is irrelevant.\nTake what you were left and walk.", "YTA because you are manipulative. You ask say “imo inheritance is earned.” If you don’t see how ridiculous this sounds let me tell you that you have done nothing to earned the fruits of your parents labor. If I were your mom, I’d give it all to charity. Children aren’t owed inheritance and if they get it, that’s because their parents were considerate.", "With my family and dads diagnosis and probably only having a couple months left now. We never fought for other people to not have anything. No parent wanted a child to not have anything despite my shakey terms with my step mom\n\nEven with all this we still saw to provide for each other. I think you’re thinking more about money than people. The fact this is an issue is more telling than anything\n\nESH", "I couldn’t finish reading this but it became immediately apparent that YTA, and honestly everyone else, too. Wanna trade problems?", "YTA. Inheritance is not a right. It is a gift. And who are you to decide where what your parents worked for should go.", "YTA\n\nY'all. Your mom is still alive and kicking, stop circling like vultures and worrying about who profits the most when they die.", "If you want us to read this, try using proper grammar or sentence structure. This is essentially word salad.", "i stopped reading at 12 properties, hope you invest in anti guillotine neckwear, such as a titanium ruff", "I mean, YTA, because you’re cutting out your sister because of her husband- by your own words, you don’t want BIL to be rewarded. \n\nSo YTA because you’re being just as manipulative", "NTA. Your sister's husband is like a reverse Robin Hood, stealing from the hardworking and giving to himself.", "ESH... inheritances is neither entitled or earned. Vultures are already circling. Your parents should be able to give their money to those they want without being bullied or manipulated or people undermining them after they are gone.", "Set up a trust with 3rd party mutually respected individual as executor to handle and education only or such trust for sisters kids.  That will take weight off sister and not let BIL blow it. \nDo you think maybe sister isn't divorcing due to what he'd be entitled to after length of marriage and long unemployment?     \nESH.  your mothers money to give, not yours.  And if you are truly concerned about your sister and deadbeat husband you let your mother give her a saftey net tied up in a bow.", "Estates often cause shit between family but this one is a doozy.  \n\nSeems to me BIL and Sis won’t stave any time soon so despite the fact you over entitled assholes do t like them it appears you’ve made provisions for their kids.  \n\nAre you an asshole, well….I’d like to think so but your sucked up to mommy narcissist long enough and for that  I am sure you deserve your 30 pieces of silver.  \n\nEnjoy the cash, think about it every day, let the aroma of wealth permeate every waking moment until you are about to die and realise how much it didn’t make you happy.", "NTA, your mom is the only one who can make that decision. What she wants is the only thing that will matter to a court. Period.\n\nYour family is weird af. I always heard wealthy folks got no love for each other. \n\n..and your BiL sounds like a bum. Your sister is the enabler. I would never tolerate a man that doesn't work.", "Why are you even getting involved in trying to convince your mum what do so with her will?", "I get this. BIL benefitting from Mom’s hard work is hard to swallow. Leave sis her share - even if it’s not a full third - in trust. So that executor/rix decides how it gets spent. Or leave sis’s share to her kids in trust. Leaving her out altogether makes YTA.", "I wish I had this much money to complain about", "NTA mate, cheers cobber", "Everyone but Dad are TA. Greed is tearing your family apart, and you're dad is still living, despite his condition, and you guys are planning how to split the money when he dies. Don't use a cop out argument saying that it's going to pay for the funeral expenses, nah, your mom has TWELVE PROPERTIES. The excuse of your younger brother not deserving it because he's 19 and a student, how's that his fault? Maybe he was the best child to your dad? Starting this post by calling your BIL lazy and painting the picture that your mom is crazy just to make your case stronger, only reveals the fact that YTA", "An inheritance is NOT earned. It's bestowed, at the discretion of whoever is passing on their assets.\n\nThat being said, \n\nInfo: if you had said nothing at all to your mother,  would any changes have been made to the will?", "At this point, I wouldn't give anything to the sister either for two reasons:  1) She is NC with your mom and 2) BIL is a mooch and I wouldn't want him to profit from your mom's hard work either.\n\nHere is something to think about:  1) Your mom could set up a Trust for your Sister's children for their college educations.  Make it so there would be a Trustee/Trustees who are not your sister or BIL.  \n\nYour BIL is a complete AH who won't work and won't even be a father to his own children.  Your sister was an idiot to add him to her properties but that's on her.  He is her cross to bear as long as she can stand it.  I can't see what he even brings to the table, but that's on her.", "Your BIL is an enormous AH. I do believe you just don't want his lazy a$$ to become a millionaire because he married and impregnated your sister. \n\nHowever- it's your mom and dad's property to give to anyone they damn well please- including excluding said AH BIL. I don't see any problem with your mom's decision so long as she is of sound mind.", "Get the fuck out of here", "Fucking first world problems. YTAs who buy property and make a fortune off people trying to survive. I haven't read the comments yet but I bet a lot of them say the same thing. Reddit don't take kindly to you folks.\n\nEdit: called it. Not saying it isn't an issue but read the room.", "ESH - any time people are arguing over \"entitlement\" money while waiting for a \"beloved\" family member to drop dead is an AH. \n\nGreed makes people ugly.", "YTA, there’s a lot of manipulation going on and it’s not just the OP’s mom. On no planet is inheritance “earned ” because it’s not just for the next generation. Especially not millions. That can help the first generation and continue on to their children and keep growing or helping. I think that punishing the sis and her children (potential) because the OP doesn’t like/trust the BIL is harsh and assholish. OP you sound like a spoiled toddler that doesn’t think her sister should get any cookies because she didn’t help clean the room enough.", "YTA\n\nYou admit that your sister is struggling and stressed, but you still don’t want to let her get any help at all because you hate her husband? That’s a really shitty thing to do to someone you supposedly care about. \n\nYou’re behaving like a childish, greedy AH who has no empathy. You really ought to think about things with a bit more compassion rather than just focusing on how large your own inheritance will be.", "YTA. I can't believe you actually interfered to that extent. Shame on you!!!!", "I wish I could vote but I don't think Ill ever be rich enough to register whatever the fuck is happening here.", "NTA. Your sister's husband is a leech, and it's your mom's hard-earned money! Don't feel guilty.", "My mom tried talking about inheritance with me and I didnt even want to hear it. \n\nYou are already arguing about the Will before your mom has even passed away….\n\nEAH!", "Honestly, how your parents structure their will and who inherits how much is none of your business. YTA", "YTA. You shouldn't have any say when it comes to your mom's inheritance. She should make up her own mind as she pleases.\n\nYou say you \"earned the inheritance, because you work for mom\", but don't you get paid for that already? You're already rewarded for your work.", "ESH\n\nIt’s not your job to tell your mother what to do with her property. It’s hers to do with as she pleases. The irony of the person that wrote all this accusing someone else of being entitled…\n\nYou basically wrote a bunch of stuff to say you don’t want your sister to inherit because you disapprove of her. You are a terrible sister. And not a very good daughter, I suspect. Poor mother.\n\n#richpeopleproblems", "YAT for penalizing your sister, who you state is hard working, for her husband's faults.  She is supporting a family.  Is her decision to stay with this man poor?  *It doesn't matter!*  She is doing everything she can to support her family.  For you to manipulate the will to exclude her just because you don't like her husband is selfish, petty, and pretty disgusting.", "YTA. You are all her children and you are PAID to do things for your mum, it’s your job! Your sister also has a job.  Jesus with family like you, who needs enemies. Money grabbing at its finest. Wow. Just wow.", "ESH\n\nAt the end of the day, it’s your mom’s money and she can do whatever she wants with it. Including choosing who to leave money to and who not to. But you meddled when your mom should’ve come to whatever conclusion on her own and your sister is getting the short end of the stick. Which makes you an AH. However, the fact you were able to convince her to literally cut her eldest child out of her will does mean she agrees with your sentiments regarding BIL.\n\nPeople have been cut off (financially, emotionally, physically, etc.) since the beginning of time because family don’t approve of or like someone’s partner/significant other. So as unfair as it seems to your sister, tough luck. This isn’t new.", "NTA it seems like your sister has already received and spent her amount of the inheritance. It's obvious your sister and BIL can't be trusted with money. Make sure you're the one in charge of the will and have it in writing as well. Your sister needs to learn that she won't always receive a handout and will have to do things on her own.", "After reading everything, it does seem they will sell properties. \nI can see why you want them excluded, but.... they are entitled to something. A few bucks, a car, even property (contingent they live on said property for x amount of years and keep it maintained)", "Everyone in this whole situation is TA.\n\nI cannot imagine having so much money and assets that everyone is fighting over them while I am still alive. \n\nYou are all so far gone from what the majority of the people in this world have to live like, you have no clue. \n\nBy all means, continue to fight amongst yourselves, creating resentment, and making your parents feel as if their lives and hard work only centered around your future comfort. \n\nThe greed and self centeredness of humans never ceases to abhor me.", "NTA\n\nIf your mother actually wants to leave sis some part of the estate, she might want to talk to an estate lawyer. Maybe some property can be put SOLELY in sister's name, under the condition that if she tries to sell it, it reverts back to the estate, to be split equally between you and your brother, excluding sis from the will. Conditions that if anything happens to her, the property is to be held in trust for her children until they turn twenty five and not to be held by their father.", "NTA… entitlement to wills really bugs me… if I was your mum I would leave Sisters share in trusts for her kids", "Seriously, why was it your business to convince your mom to remove your sister from the will? That should have been something your mom chose on her own. So yes, you're the a**hole and greedy. What does the brother in law have to do with your mother's daughter. You should feel guilty, That was not your place to try and convince somebody else what they should do with their money. That's your mother's money and shame on your mother for listening to you because clearly, if she was gonna do it herself, it would have taken no convincing.  Seems like you might have been emotionally manipulating your mother.", "ESH because it’s your mom’s money and she can do what she wants with it.", "YTA because its not your money, not your will and not your business how your parents decide to leave THEIR money and property.", "YTA. What the actual hell is up with all of these inheritance posts full of petty bullshit on this sub? Are they a close blood relative? Yes? Were they 1000% barred from receiving anything at all per the wishes of the deceased? No? Just allow her a share. Being excluded from an inheritance is about more than just not receiving money/assets! Believe it or not, there may come a day where you feel guilty for being selfish, or that she will guiltily blame herself indefinitely for being estranged in that kind of eventful way, when it is in fact, your doing. \n\nFrankly, I find it disrespectful to your mother to have a tug of war over her the fruits of her lifelong labor. You all sound rich enough that it’s tacky as well.", "NTA. It’s your mothers estate and she’s under no obligation to split it between children, particularly one that doesn’t speak to her and has the lazy hubby. Sounds like Mom has helped them out quite a bit already.", "Do you live in a soap opera?", "Okay, Shiv Roy. \n\nESH. All of you are assholes. Cash in a property and spend it all on therapy. Y'all need it.", "NTA, I didn’t even have to finish reading this. \n\nThe dude quit a assistant job at 100k a year, if she’s still looking I’ll carry her on my back to the grocery store for 100k a year 😂.", "YTA  \nIt's incomprehensible to me that you're inserting yourself into your parents' inheritance plans this way.  You're virtually insuring that your sister will sue the estate and lots of money will need to be paid out to lawyers.  And frankly, they might have a good case.\n\nYou have no idea the rains of hell you're about to bring down upon your whole family just because you don't like your BIL.", "We talk about inheritance, BC dad’s cancer diagnosis. \nYes money is the first thing I really have to complain about when my father is potentially experiencing a life threatening illness.", "NTA\n\nBIL is an asshole, and your Sister is enabling him to take advantage of her.\n\nHe could be a stay at home Dad and take care of the children and the house, taking some of the load off your sister, it doesn't sound like he's doing anything.\n\nThat's not your fault.", "YTA--let your parents make their own decisions about their estate.\n\nThat said, I don't know why parents would leave $ to children who have gone non contact with them.", "NTA your sister has 3 properties and still has money problems? Sounds like they have a spending problem but her lazy, greedy, good for nothing husband is her biggest problem. Seems like her life would be infinitely better if he wasn’t an anchor around her neck.", "ESH because you quite literally are being an ass and giving yourself more, but your logic makes sense but this is too first world problem 😭as someone said if you haven’t talked to them about it and communicated you’re an asshole and your sisters husband is a lazy bum and an asshole.", "YTA. god i hate rich people.", "Geezo. . . I don’t have time to pick through quoting all the awful, downright miserable things you’ve said in your post.\n\nYTA, over and over. (eg. “Inheritances are earned” even though you actually don’t like your mother very much). Staggering.\n\nI think there’s an awful lot of background here about your sister’s relationship with your mother, and the rest of you. Your post screams of selfishness.", " How do you know narcissist mom didn’t offer the 20k and then rescind and say it’s a loan?", "Wow, the conversations you overhear while bussing tables at the country club, huh?\nIs incendiary bombing an option here?", "YTA\n\nYou've been gifted everything and you still want more. I love how you call your mom manipulative, but here you are convincing her to cut out your sister.\n\nLet your mom make her own decisions. She is an adult woman of sound mind and body, she can make her own choices on inheritance.", "YTA - Your mom's will, her choice. But maybe reconsider punishing your sister for her husband's actions?", "YTA on this one.\nno matter how well off your sister is, no matter how rich she is. no matter how shit her husband is or how shit she is. you all (the 3 siblings) still need to get equal share of the inheritence. it is technically her money and when she gets it, if she pleases to give to her husband thats her choice, if she pleases to throw it away thats also her choice, you do not get to decide what she and her family do and dont do with the money, you do not get to decide if she needs it or deserve it.\nHowever if I was in your position (I probably will never be in a similar position) I will probably convince my mom to not give her any properties or anything, just money. because she might sell those and I have a very special attachment to houses and things my mom owns. I can also maybe give more money to my brother and less money to her, but she and her family will get enough to live comfortably for the rest of her life. you can maybe give your sister some and give her kids some, I think thats doable but maybe Im wrong.\nBut to cut her off completely is wrong no matter how much of AH she is, and to convince your mum to do so is in my opinion very very wrong. I personally will never do this even tho my relationship with my sibling is not the best. and I will feel like absolute shit if my parents or siblings just cut me off because Im doing well in my life.\nAlso you all sound like you have enough money to share between the 3 of you and live like royalty for the rest of your lives", "Rich people problems.", "NTA.", "Every single one of you is the asshole. You are for trying to pit your mother against your family because of something stupid the brother-in-law did. Your sister is for using your mom and your mom is for not making up her own decisions.  You all sound extremely entitled and selfish.", "NTA.\n\nYour parents can do whatever they want with the money.\n\nGive it all to charity, give 8t to the cat... anything.\n\nI would stop talking about it, tell her \"Talk to Mom and Dad. Their money, their choice.\"\n\nHopefully they have specifically excluded her, or given her $1, to ensure she doesn't have an argument that \"it was an oversight \".\n\nA valid claim for natural born children in many jurisdictions.", "NTA - it’s your mums stuff to do with as she wants. Your right. You can’t go NC with someone and still expect a part of their will.", "NTA - As long as your Mother is of sound mind, it's her decision who she wants to inherit her property.  You've merely told her your opinion.  If your sister objects she can put on her big girl pants, talk to her Mother, and make her argument as to why she shouldn't be left out of the inheritance.", "Yes! Your sister is equal to you! You should be disinherited, spurned by your parents, feel rejected and judged less than by them.", "YTA.\n\nPeople shouldn't be influencing others to kick people out of their wills. Be honest with yourself. You just want more money. Now, your conscious is bothering you, so you're here for validation. \n\nYou cinvinced your mom to cut out your sister because you don't like your BIL. AND SURPRISE SURPRISE now you het 50% instead of 33.3%.\n\nI've worked at law firms that handle estate planning and probate. Your kind never ceases to amaze me.", "You're writing style is a little incoherent, but from a careful read it seems like you're planning to split the liquid cash from the life insurance payout among the three and then keep the properties in a trust with you and your brother as trustee so that the properties can keep appreciating and generating wealth after mom passes. At some point you have a plan to distribute the properties or the value of the properties amongst the grandchildren. \n\nI don't necessarily disagree with this as a financial strategy, but the reason why YTA is that as trustee you're probably entitling yourself and your brother to a yearly stipend for managing the trust, while leaving your sister out. Thats a lot of passive income that you're entitling yourself to that your sister doesn't get. \n\nI think if you have a yearly payout schedule and named your sister and yourselves as a beneficiary, while forgoing the stipend as trustee, as well as writing in very defined distribution and dissolution schedules would go a long way to making peace with your sister.", "YTA… I pray your sister ends up NC all of you.  You guys are the worst of humanity.   Greed over a sisters love.  Yes you are a gigantic AH.", "Of course YTA. You really believe the manipulative narcissistic person who is handling out houses like candy is the one lying about the so-called $20k loan? Come on now.", "ESH.", "I got very confused with the whole \"BIL was working for mom and being paid 100K but skipping\" like what? Does he work or not?\n\nThis all sounds like a load of poo.\n\nI suspect it's fake but whatever...YTA.", "Yta your parent money you pursuing them.either way because you want money is disgusting end of conversation. Your parent choice should of always been there not a  nagging g voice manipulating them in there ear as a  parent I would give all children somthing your sister is a  hard working woman and deserves happiness from her parent fortune not you taking it for yourself", "I quit reading after realizing how spoiled and rich this family is. Take your problems to country club", "Agreed with the ESH. Poor mother, her children are fighting over the inheritance and she's still alive and kicking. She's probably somewhere between 50 and 70 years of age.\n\nShame on everyone, except the mom. OP, be double ashamed. What your mother does with her money is her business, and convincing her to exclud one child because you personally dislike her husband is just cruel.", "OP also mentions that mom is manipulative.  For all we know, she treated the older sister far worse, or she was just smart enough to get out for her sanity.  Some might argue that puts you out of the inheritance, but I dunno.  If the sister had to deal with years of emotional abuse from her, I might argue she deserves it more.  BIL shouldn't matter.  While he sounds like an idiot, that shouldn't have any bearing on what kind of inheritance the sister gets.\n\nEdited to add: it seems like OP is trying to punish her sister because she doesn't like sister's husband.", "The mom should give her entire estate to a charity and let all of these entitled brats suffer with their multiple properties.", "Irrevocable trust for all the kids, in equal parts.  That would be the smartest answer.  \n\nHonestly, ESH is the best score.  Bunch of first world problems from what sounds like truly entitled and manipulative people.", "And moms not even dead yet! Lmao", "Doesn’t like BIL. Fucking over sis as a result is fine. Huge YTA", "I feel bad for the father figure. He's dying watching his family be awful towards one another.", "I got to “she bought me and my brother 3 properties each” and stopped reading WTAF. \nYTA you are being paid to look after your mom. Inheritance is separate. Mom’s choice but you are being so manipulative", "I was like YTA halfway through just because of how much money they all have it’s ridiculous. I need to whip out my electron microscope to see the GD violin I want to play to express how little sympathy I have. Did this person really expect any sympathy for the situation? Cry me a river, build a short pier, take a long car ride off it with the windows rolled down and a toaster plugged into the jack if this is so much for you to handle.", "I lost it when OP mentioned she already has 3 properties. She’s 24 ffs. Money isn’t everything, the company of your sister is surely more important?", "I stopped reading after the 3 gifted properties, although I would love to relate to op and her big money problems.", "I felt the same way. Like I want to make a determination, but at the end of the day, they all have multiple properties and 6 figure salaries. It's pretty hard to feel bad for anyone here.", "“I think my sister and BiL act entitled to my mom’s stuff so I convinced my mom to cut my sister out of the will and leave more stuff to me because I’m the one who is actually entitled to it.”  That’s basically how I translated all of this in my head.", "seriously? the fact this is top answer is just ridiculous. if you want to judge someone an asshole do it based on the facts, not because you're jealous that they have money and you're poor.", "OP is TAH for this reason.", "So you’d rather the entitled BIL who hasn’t worked in 5 years to be rewarded because you’re jealous? Lol", "Here come the Poors", "I disagree. BIL would likely squander any kind of inheritance. Examples include: selling any inherited property rather than renting it and then spending the money on something that would be a waste eventually (say, a sports car) instead of setting up college funds for their kids.\n\nI think OP is right to be concerned. BIL may even find some way to weasel funds or assets out of that inheritance.\n\nThe best thing to do in this case would be to set aside trusts for your sister’s kids. Get a lawyer involved to ensure that BIL and sis aren’t allowed any access and that the kids will receive the funds/assets at a reasonable age (I think 30 would bypass most dumb decisions made by 20 year olds) and do not inform them about it. By them I mean the whole family if possible. The reason I suggest that is simply because kids and spouses can be manipulated and I would not be surprised if BIL would manipulate them into giving up their inheritance.\n\nBy skipping a generation you hopefully will avoid having to involve BIL but still have the ability to give their kids a head start. Best of luck OP!", "ESH and I hope she finds a worthy charity if her kids are going to all squabble over handouts", "I would like to correct you a bit. You say “first world problems” but it’s really “rich people problems”. I technically live in a first world country but the wealth and income inequality is far too great a gap for me to understand this guy.", "They should sue each other and let the lawyers take it all", "i cannot stand this way of thinking she doesn’t owe you anything and she’s not an ah for having more than you do. your issues are yours hers are hers and she came here for an unbiased opinion not to be told she’s an ah just because she has money in the first place", "Especially the \"inheritance is earned\" wtf its not a job. You just said Sis works her ass off and has kids. Might leave deadbeat hubby (who sounds like own deadbeat sperm donor) one day and could use the support. Srsly rich ppl chill. YTA", "Are they the Australian Kardashians or sth with all that money?!", "I thought the exact same thing.", "Yea. I just shut down. I dunno figure it out. Sounds like there is plenty to go around.", ">I want dental insurance\n\nLisa needs braces!", "frrrrrrr", "I will never understand how a job can be too little money when the alternative is zero money  (or unemployment money) \n\nBut also mum bought OP 3 properties but OP says their mother obvs didn’t gift sis/BIL a third house it was just a loan … it’s too first world problems for me also and I feel crazy saying this … but if 1 person gets 3 properties why don’t they all ?", "\"Mum blew up bc she was paying BIL $100k to be her assistant but he was barely working & always coming up with excuses to skip. He left after 6 mons which is when I started working for mum\"  \n\n\nOP isn't BIL, just saying. Please reread original post.", "He stole and lied to his wife and so his *wife* should lose her inheritence?", "We love the kids so so much! Our thought process is if the 12 properties that are under our family trust is managed by me then I can distribute them to the my sister’s kids and my brother’s future children. I have no use for all this when I will likely not have kids my self. Basically, we’re trying to set up our next generation. However BIL has pretty bad financial literacy and would like try to sell the properties when he realises that his no income couldn’t support these loans. The properties are not mortgage free.", "I hope she spends it on cocaine and hookers and has nothing left to leave any of these brats", "Right?  Are people missing the “she went NC” part?\n\nLook, you go no contact, don’t expect inheritance.  Simple.", "OP had 3 properties purchased by his mother for him. His sister has 2. OP is also getting paid $100,000/year to be his mother's assistant. This is the same job he thinks he is owed extra inheritance for. So he wants to double dip. Get paid AND get his sister's inheritance for the same *work.*", "OP explained the properties will be going to brothers future children as well as sisters children when they’re old enough. So the nieces/nephews will have a trust", "Mum did not have to agree", "My sister knows I will not have a family of my own, so everything of mine will go to her children. Our family built the 12 properties under a family trust to start creating generational wealth for the future children. Unfortunately we aren’t old money lol. My sister has been on and off in our lives, but she doesn’t deserve to be punished for her husband. But BIL has a lot of influence over her, especially when she put his name on the title of the properties mum bought her. My sister alone is paying them off.", "The daughter went nc with mom after siding with with asshole husband… why should the mom love and provide for her?", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "I can almost guarantee mom sucks just as bad", "Yeah IDK what the deal is. OP said sister was on and off NC. So does she only come around when she needs money/help? She had be off NC to be gifted 3 properties and BIL got paid $100k to be mom’s assistant for 6 months. I feel there could be some manipulation on both ends going on but a parent’s manipulation is far worse and much more devastating/damaging. If OP’s mom is a narcissist, I could see how this could be some kind of “get back,” but I don’t know why OP would need to convince the mom to do it when she was originally going to leave assets to all 3 children.", "It's not your job to police how inheritances are spent. The audacity to think you should have even the tiniest bit of say in this is troubling. Check yourself. If your mom's like you I see why sis went NC.", "There is something wrong with your brain", "You don’t get to decide how she’s spend her own money. What a judgmental cretin to have as a sister.", "It seems like your mom could put something in a trust for your sister that would protect it from her husband? Who knows, that may be the money that helps her divorce that loser.", "Cutting your sister out bc your BIL is an ass is kind of cruel. What if mom dies and BIL gets worse, then your sister is left with nothing and no recourse and you guys don't even support her. Isn't there a better way to tie up mom's assets? Like a trust or something?", "Honestly, If I was the mom I'd try to leave the inheritance in a way that the BIL wouldn't be able to touch it in case of a divorce. Same for OP and brother.", ">my mum also doesn’t want my BIL to inherit anything else from us. \n\nWho is “us”? Anyway, that’s what trust funds are literally for. You cut your sister out because you were greedy and entitled not because it was necessary to protect “us” (I thought it was your mum’s money?)", "There can be stipulations put into the will for your sisters inheritance so BIL can't touch it. There are ways around it and for some reason I feel like you knew that too. YTA because you manipulated your mother. congratulations you seem to be just like her!", "Could just have her split it the three ways, minus whatever they still owe her from what she is claiming from the loan", "What you think should be irrelevant. You should have funk all to do with the distribution of your parents’ wealth. YTA without question.", "And they don’t even like their mom", "Clearly their mother drew a Black Lotus in mint condition.  That's why she's so rich.\n\nhttps://www.tcgplayer.com/product/8687/magic-the-gathering-beta-edition-black-lotus?Language=English", "INFO \n\nIf they left Sis' share to her kids, would Sis/BIL be able to control it? Or would they just have to keep it like a trust? No idea on local law in this case.", "How can you trust the reliability of a post like this when its clear OP doesn't live in the shared reality that the rest of us plebs enjoy?", "But why do they resent their older sister getting that $20k towards a third property when OP and 19yo brother were both gifted 3 properties each. Maybe sister and BiL felt they were entitled to it because they had only been gifted 2 properties when the siblings got 3. This whole thing is bizarre and even goes beyond first world problems into problems in the 1% club. I don't even know what judgement I'd choose because I think there's a lot more to this story, but I think it's pretty gross to want to cut the sister out because they don't like BiL.\n\nEdit: really thinking it's ESH", "Disagree- OP thinks that they should get the money instead of the BIL. ESH except the younger brother", "OP just wants more $ and maybe is entitled to more for being a caregiver. But punishing her sister for trying to make her marriage work is pretty nasty and absolutely manipulative of their elderly parent.", "If that's the concern, why can't sister's share instead be put into a trust fund for her kids? College and living expenses is a favorite stipulation for when the kids' parents aren't trusted, but it could also just go to the kids once they each reach a certain age. Don't punish the kids because their dad sucks, and that'll take pressure off of the overworked mother.", "They're rich, so technically, they're all lazy leeches. ESH", "But OP says that her mother is Narcissistic and she doesn’t blame her for going NC.", "Agree NTA", "It’s not OP’s business how her mother chooses to leave her estate.", "I made it somehow 3 paragraphs then dipped", "How entitled do you have to be(assuming this isn't another piece of AITA fiction) to come into a worldwide sub and complain about rich people problems when the majority of the people on here can't relate to a word of it.\n\nI can guarantee that a vast majority of people reading this would rather \"mum\" didn't give a dime to either of her entitled older kids and every penny just went to charity", "This is the top viewpoint here.", "I just want to know what ESH is? But I'm almost too afraid to ask", "Yeah, but OP is the biggest AH just for bringing this up on reddit. Sounds more like the intent was to make literally everyone jealous. Not to get a fair judgement.", "“In my opinion, inheritance is earned” - I mean, if that wasn’t their opinion, they would have to confront some serious entitlement , so that part checks out.", "The teen brother might be okay. I suspect not, given the people that surround him, but good luck out there, guy!", "It’s like $25 each month?", "He raised them to become the AH they are, though.", "THANK you. I dropped out of reading it at \"three properties each\". I just couldn't read any further. I know that's a me problem and accept that, and I thank you for your service. <3", "Eat the rich\n\nIf OP thinks their brother is a useless tool and wants to donate his portion to charity, great. But if they wants EVEN MORE yep, TA", "Dude got a bunch of handouts and then pretends like he’s the hardest worker in the world and screws his sister and her children over for more free shit", "The inheritance should be split 3 ways. The BIL will only get some if his wife shares it. She can do whatever she wants. I hate these dynamics. Split your money evenly among your kids. \n\n*(Yes, give more if you have special needs kids)\n\nAlso OP what right do you have to decide or influence this decision?", "That's still crazy entitled. Your mother may not be the narcissist here.", "And none of them are content. Just shows how there's no limit on greed. It's human nature to always want more I would be the same as well as most other people. Humans r Just greedy ppl", "“iMO” \n\nYou don’t get an opinion. It’s not your estate. You didn’t work for it. You deserve nothing. Any inheritance is a gift not to be depended on. And if you’re hanging out with your mom to “earn” your inheritance, you’re worse than your sister because you’re lying to and using your mom essentially. \n\nYou’re the biggest asshole I’ve seen on here in a while.", "Nah…you explained just fine.", "\"Mum blew up bc she was paying BIL $100k to be her assistant but he was barely working & always coming up with excuses to skip. He left after 6 mons which is when I started working for mum\"   \n\n\nBIL was getting paid that money, not OP.", "But she over looks it to get the money?", "\"We\" is rich kid talk for mommy and daddy, or grandparents, great grandparents, you know, someone a long time ago put in some work so she now benefits from it. We.", "I saw we, because my mum, dad and I are the ones listed on the loans. They are not mortgage free properties. My brother was too young and my sister was on and off NC.", "Underrated comment.", "Man my name is listed on the entire construction loan for 12 properties, I think I’m allowed to say “we” if I’m managing them", "That’s not how most places do money gained during marriage. He could potentially get half. Or even if he didn’t get the financial half, he’d be able to take the homes bought with it, etc.", "For bringing an asshole into the family, yeah she kinda had that coming.", "The best manipulative narcissist mom I've read about yet, set her kids up with million dollar insurance and gifted multiple properties to them and allows her kids to get $$$ working for her. Even gave BIL a cushy job but he was so entitled he couldn't even handle that.", "That's the part that gets me. People have different personalities. We're supposed to find the qualities we admire and lack within those differences. Their mother seems like a hard worker, who puts up with no bullshit. A quality that lazy/entitled people don't like. Of course if mom's buying your houses and financing your life she has influence regarding your choices. To me, that's why OP and the siblings don't like their mom. It's usually children who want all the perks with no stipulations that hate their hard working, expectational, parents.", "Ahhaaaa see what you did there.", "This is a great question. My grandmother kept my dad out of the will and we (grandkids) had a great relationship with her. What happened is her other child's (my aunt's) children got everything, and we got nothing. People dont realize that sometimes the inheritance ends up going to the beneficiary's survivor(s). (I don't care; I'm just making a point.) OP is YTA.\nETA: I do care a little. Who couldn't use $75,000? Cousins got $125,000 each instead of each of us $75,000.", "[removed]", "Sure, because if you were in OPs shoes, you'd TOTALLY give it all to charity.", "Lmao this is ludicrous. Reddit loves telling other people how they should spend their own money. I'm sure were you in OP's shoes, donating it all to charity is the first thing you'd think of doing.", "I like the thought of the sister's share going to charity (or perhaps being put into a trust so that she has limited use of it and it's protect from BiL?)\n\nWhen our younger brother died, a little more than a year before our mother, our mother arranged for what would have been his share of her assets to go to a landgrant style affordable housing non profit. (This was in Seattle, where affordable housing is a major issue.) \n\nI gathered that part of the intent was to make sure neither my sister nor I profited from our brother's death?\\* But it is a really great non profit, and we are in favor. The amount of money in play was a lot smaller, I gather - but then my sister and I are both doing pretty well for ourselves.\n\n\\* So... My younger sister and I are close, not in the least because we've been each other's sanity checks against family craziness most of our lives. We always tried to keep an eye on our ne'er do well younger brother - he had mental health issues, and also came out of our crazy family, so even if he was obnoxious, self centered and grandiose, it seemed like the thing to do. Up until he became a (gay) alt right hate vlogger, and threatened to kill each of us. That's just rude! So we went NC.\n\nOur mother wasn't the sanest or most decent person, and doted on him. She had feelings about how we each avoided him (why no, death threats apparently weren't a big consideration!)", "ESH because it should all be taken in inheritance taxes or go to charity instead of all these people who are too lazy to get proper jobs so they just hoard properties. OP is just an extra AH for getting his sister disinherited because he's greedy and wants a bigger cut.", "Okay but the parents earned the money? Theyre allowed to pass it on. Most people want to earn money and pass it to their kids so they have it easier. My mom grew up dirt poor, like below poverty. Im finally getting to a better place and when I have kids I want them to be better off. \n\nHow is that a bad thing?", "That’s not how marriage works", "OP is female.", "OP, let me say you worded it very bad and it's only because the BIL's thing gave me a hint that I decided to read the comments.", "This is the only correct solutions here", "So, impoverished peoples throughout the world should hate you if you're not donating further proceeds because relative to them you are incredibly rich?\n\nThat mindset is incredibly sophomoric and neither productive to yourself nor society.", "He’s not asking for even more. He wants the properties to go to sisters children when they’re old enough. Just doesn’t want BiL to benefit from it", "Most of the assets are in a Family Trust so it’s sorta a group decision however my mum is the executioner. A worry we have is with the properties mum has bought my sister, she has put her husbands name on the title despite that because he has no income, he has not contributed to. Wish I could have given more context in the original post but word limit.\nEdit: mum is the trustee not executioner my bad", "I think op absolutely has a right to not want her parents to be taken advantage of. I mean it’s def enough money to go around and these are SUCH privileged problems but no I would not my mom or dad to take care of someone who will stop talking to them bc they wouldn’t just hand them $20k.", "Even if you assume they are also making 100k it is kinda irrelevant because both of them are being paid the same for the same job and BIL refused to do the work while OP is in assuming is doing the work required for the job.", "With her switching places with BIL it's quite clear that she's earning that 100k now", "More than 3 generations back they say they are \"comfortable.\"", "Mother isn't the asshole, the OP should really stay out of it honestly and is an AH.\n\nThe BIL does sound like TA here though hopefully the sis will see that and get rid of his ass", "Too many people are ignoring that math lol", "Wait is this something in the comments about sister having these properties. If so that would completely change my judgment.", "And you think inheritence is earned? You are a collassal asshole. How exactly did you earn being born into the right family? Why do the rich always cope so hard, are so many of you really that pathetic?", "So...... as someone who has drug addicts in their family who expect to inherit money they don't deserve and the way they act I 100% understand why u would feel this way and do what u did\n\nYour sister works hard and u want the $ to benefit her? So put every penny she WOULD HAVE gotten and put it in equal trusts for ur neices and nephews. \n\nUr def entitled with the scale of $ ur talking about but paying for a child's education, their 1st house, security for their kids..........it's a great way to help ur sister by financially setting her kids up. So OP, ur BiL can be an absolute loser but that $ could still help ur sister through her kids and in an air tight trust he can't touch it. Ur sis and BiL will still have to support themselves but she won't have to work so hard to support her kids future's. If BiL is willing to lie about a 20k loan as a gift he'd definitely not put any of the $ aside for his kids. He would absolutely use it to continue his no work lifestyle and ur sister would use it to keep up a once sided financial relationship. I wish u luck.", "This is where knowing the jurisdiction is important. Where I live in the US, the inheritance would be considered separate property and would only belong to the sister.  But it appears that the law may be different in Australia and inherited properties received during the marriage can be considered a marital asset. \n\nHowever I believe they could still structure it so that BiL does not receive any of the property or money by putting it into trust for the sister.", "Hi, I worked in family law in the US. most states do not treat inheritance as community property unless it becomes commingled with other assets. The sister would get the money, and then it’s her choice whether to keep it separate or to commingle it with other accounts.", "The AHs were already there", "Feels a bit like an ESH judgment to me.", "I'd offer this alternative.\n\nTaking advantage of your dads cancer diagnosis to convince your mum to cut your sister out of her will... Way more of an AH than being lazy.\n\nBesides OP said she doesn't have any idea what BIL does just that he is unemployed. She's just assumed that her sister not dedicating time to her career means she's the caregiver of the children and he does nothing... It's possible BIL is the primary caregiver and sister just wants to take an active part in their upbringing and prioritise spending time with them, and actually have a relationship with them which is a reasonable thing to want. You can't do that if you're working all the time. \n\nBIL might be an AH, OP is TA.", "Poor ppl give more to charity on a regular basis than any rich person ever does. Daily. Giving $20 when they have $30 to someone who needs it. So yea, the people here saying they would probably already do.", "I’m sitting here thinking the same thing… Honestly wealth is usually built with two goals: to accumulate more wealth and to carry on your legacy. The second goal usually involves giving the generations after you a head start. \n\nMy parents were wealthy at one point because they worked for it. We weren’t remotely as well off as OP but the head start they gave us was a college fund, hand me down vehicles, a good education and travel.\n\nBasically as of now I have no debt and a good car. My head start is nothing compared to what OP’s parents will be able to provide for their children.\n\nI’m hoping that OP sets up trust(s) for their sister’s kids because they shouldn’t lose out on anything just because they have a lazy excuse of a father.", "Why is that a worry? Why do you care? Your sister should get as much as the rest of you and she is well within her rights to share it with her husband", "Yeah, my problem with that is OP admitting the Mom is narcissistic and manipulative. I must have misread because I thought she did give them $20,000. I mean, the mom is handing out houses to everyone like Oprah, \"a house for you and a house for you and another house for you etc\"  \n\nAnd I'm a bit biased because I had a MIL that gave gifts and then said they were loans when she wasn't getting her way. (LOL I wished it had been property.)", "But if you cut someone off, isn’t it weird to turn around and expect an equal inheritance compared to the people actively in that persons life? You’re NC when they’re alive but suddenly when they’re dead y’all were such great buds and you deserve assets from the life they built?", "Fuck em. They are rich. Be an asshole. Don’t be. They can all fuck off.", "What is ESH?", "Except once they have money they’re now amongst the wealthy.", "Yeah they all seem like assholes, but I only had a chance for one of them to see it so I focused on her.\n\nIt may be that sister doesn't deserve it, but that's not OP's business, and OP's mindset and the way she uses the word 'earn' was disgusting enough to remain fully focused on that.", "For real. I'm here trying to figure out if I can afford to fix my car, and go to a dentist, and they're there slap fighting over the family millions. My sympathy for their situation is pretty minimal.", "I call BS on op", "What an enlightened take. \"I'm jealous and envious so that justifies my anger\"", "Everyone sucks here.", "But OP also explained they mean earned as in be in the deceased persons life and I think that’s valid. If I had rich parents and cut them off, I wouldn’t expect an inheritance bc I wasn’t in their life", "Lol I’m not jealous or angry. I simply don’t give two fucks about someone with problems like this.", "It’s a borderline-fascinating insight into the mind of a rich- AH OP. YTA , OP, btw.", "Oh. So what is an ESH judgement? Is that like someone feeling sorry for themselves for ridiculous reasons? Like \"the world's smallest violin\" thing?", "Just no one is really the \"good guy\" or an innocent in the situation. They all suck for different reasons.", "YTA and NTA at the same time. \nI just really get the feeling this is about the BIL, he's sounds crafty.. calculated perhaps in what he's doing. He sounds like a freeloader tbh. \n\nThe place this is coming from, the reasons are NTA, but the way you have done it, YTA.\n\nCould she be allocated inheritance but have it put in a trust or something to protect it from BIL? Or put it in a trust for the sisters kids to have after they're 25 or something, or for college,  their first house? \nMaybe the kids could be left a house each in a trust so they can't be sold by the parents? If the houses were tenanted, the income from the rent (minus maintenence for the house) could go in a trust account so the income (savings) from the property would be available for kids when they are older, and they would be set up with a house. \n\n(Edit) Perhaps any inheritance from your dad could be included in a set up to go into the same trust sort of things for the kids?\n\nSo her family would benefit, but BIL will not be able to get his greedy ass hands on it.", "I guess it’s not clear.\nDid you or didn’t you go out of your way to get your sister out because of her husband?", "OP, I believe you have a point.  Your BIL has demonstrated his character in spite of an inheritance, so I can only imagine the outcome if your sister does inherit.  However, your sister is no less entitled to share in the proceeds of a family inheritance than you and your brother are.  If I were in your very rich shoes, I would suggest that my mother put sister's share in trust for her kids, that way it bypasses BIL's greedy, little hands.", "Yta. \"More than anything I dont want BIL’s laziness to be rewarded with mums hard work\". Its not supposed to be abt what you want or what you think. \n\"I “convinced” mum to split her assets equally between myself and bro, excluding the life insurance\" you went out of your way to stop your sis from benefiting. Because it means more for you. I caught a lot of contradictions in your post, so i wonder how you went about convincing mom. You stated he hasnt worked for at least 5yrs. Then you later talk abt how you took over after he quit, a yr ago. You talk abt what a hard worker your sister is, maybe this works best for them, with him at home caring for the children. That should be between them. And just because you assume something, doesnt make it fact. Maybe he downplays being a sahd because he is embarrassed or ashamed of not working. There are many, many ways for your mom to prevent him from directly benefiting from anything she has. Its quite simple. But i got a feeling you just want what should go to your sister", "You’ll never get an honest judgment here because Reddit is full of jealous people who are mad that you have money. NTA", "I doubt this is real, tbf. Not because I don't know rich people things (I totally don't), but because the OP's post and comments show a distinct lack of... um... grammar aptitude? I mean, if she's as rich as she says, there's no way her educators would have let her off with the slips she's making. And once they're beaten into you, you don't stop doing them. You backspace and correct, because it's habit. \n\nAh well, I'll take the downvotes if people don't agree. It's just a feeling.", "I just rolled at the statement \"inheritance is earned\"\n\n  \nThe fuck it is. They didn't earn shit. Their parents did, and their whole life is a series of hand me down privileges. I couldn't care less who gets the \"inheritance\" but their belief that they are owed anything is laughable.  \n\n&#x200B;\n\nThat money goes where the parents want it to go, kids, pets, charities whatever, they earned it, they decide.  \n\n\nIf you get some, great, but you fucking didn't earn it cupcake. (OP,not the poster I'm replying to)", "she sounds like she's projecting about her mom being manipulative", "I’m dying to know what qualifies OP to be earning 100k as an assistant. I can’t.", "sorry, you don’t get to cut off a relationship but still expect the benefits of that relationship, including inheritance. sis disowned her as a mom, she doesn’t owe sis anything, especially if it’ll just end with a non family member further mooching off the family 🤷‍♀️", "Properly rich people would have this sorted legally in separate trusts and not be squabling like a flock of hens over some grubs.", "Not first world problems, it's 1 percent problems.\n\nI agree, and I couldn't bear reading the whole thing.  YTA", "Came here to say exactly that. I had to reread some sentences to verify it was 12 properties here, and 3 there.. 😭", "I kept reading “gifted property this” and “gifted property that” and “12 properties total” and it’s like, damn, she can’t have just 1? You need all of them? First world problem for sure", "👏👏👏💯 I didn't think I knew what to say but apparently you said it for me..", "When they said “inheritance is earned,” I rolled my eyes so hard.", "I have a similar thought process but I wonder how I arrived at ESH while you arrived at Y T A :D", "Well, no one asked to hear about YOUR problems, now did they? This is the situation. Judge based on facts, not your choice to live in a backwards ultra capitalist country that doesn't value it's citizens unless they have jobs.", "\"It's too first world for me to judge, but now that I've given my sanctimonious commentary I suddenly have a judgement\"", "why tf is this the top answer? this isn’t what she came here for or what this sub is about. judge the conflict, not her privilege. it’s not about if she’s an asshole, it’s about if she is *the* asshole in this specific situation.", "Nothing like an Aita post to bring out the whiners. \"Op is weathy therefore their question is irrelevant, they are automatically an AH\". Eejits", "I’ve been contemplating this, if perhaps I’m overlooking something and if I’ve truly considered my sister’s perspective . I completely understand why my sister is NC. All of us were NC at some point. Classic narcissist mother, she won’t acknowledge that we have helped her get all her assets. Almost everything is in a family trust, the construction loan for the properties have me listed for the next 20+ years. Even my dad was removed from our family trust and won’t receive anything. The way I view “earning” is by keeping in touch and helping manage the assets. At the moment, only myself is liable.", "you mean like how sis destroyed the relationship by cutting mom off? she doesn’t deserve shit 😂", "I agrée with you. \n\nAlso, does she want to buy me a house? *joking*", "THIS. Ffs this should be at the top.", "We aren’t filthy rich. We have just starting coming into this money over the last 4-5 years. We work 12hr days, every day to one day become rich. None of the properties are mortgage free. Mum put down the deposit on all of them and ensures we get loans but it’s our responsibility after that. My monthly mortgage payments exceed $15k. Plus $20k is a big deal, it’s months of salary, just 3 years ago I was working in a call enter earning $55k, I couldn’t imagine saving $20k. I offered to refer BIL when I was working there but he said he was better than that.", "The assets I don’t want shared (12 properties) are in a family trust managed by my mother. They are not mortgage free and out of my siblings, my name is the only one listed on the construction loan that I’m obligated to for the next 20+ years. We are going to establish how we can ensure this trust benefits my sister and her kids only", "Mum asked for the family’s opinion but because no one liked BIL I guess it’s quite bias. She originally wanted to exclude her from her will, I’m guilty of giving her that push.", "My dad brought up how he’s worried one day BIL and my sister would inherit our family home (dad built it from the ground himself) BIL living in our parents room so he could carry on pretending he’s better than us. Which is why mum had the thought to update her will. Most of the assets are in a family trust so we all have say, but I did agree with and “convince” her to go through with removing my sister from her will.", "My exact sentiment, read the room; Australia going thru housing crisis & you arguing over how many properties you are entitled to. Also even if your BIL may be a bludger, your sister married him - her choice, just like she can divorce him. If she wants to share her wealth with him, it's entirely her choice. She is a grown adult & can decide her own fate. Let me guess, you think stage 3 tax cuts are warranted & fair.", "She asked for the whole family’s opinion because the majority of the assets are in a family trust she manages. Out of my siblings, I’m the only one helping my parents with paying back the loan of building the 12 properties. I’m also listed on the loan. My mother has bought us properties, but none are mortgage free.", "Sorry what am I jealous of?", "He hasn’t had a legit job in at least 5 years. His employment with mum was unorthodox with no real employment agreement. She would pay the same wages  regardless of how much work he did. Generally it was 5hr days 3 times a week. He is a great father, the kids adore him. However according to my sister, he doesn’t contribute to any household chores so that falls onto her as well. My sister will still inherit $340k irregardless.", "ESH go sort it with a lawyers, maybe wait til mother dearest is dead to be vultures. \n\nI had to use a food bank this week, got about £2 in my account for the next week and debt out my ass, so can't really relate. \n\nI hope to receive some inheritance from some long lost uncle one day, £100 would help lol.", "I appreciate it nonetheless, it’s helped me realise my privilege has blinded me in some ways and I’m in desperate need of a reality check!", "Mo money mo problems!", "I've made my fair share of typos so it could certainly have just been a mistake, but the fact that OP said in a comment that their mother was the \"executioner\" of the family trust makes me doubt they are actually a rich person lol", "Maybe maybe not. Majority of people don’t care how they type or following grammar online on forums or social media. Most are using phones, typing fast, etc.\n\nI’m educated, came from a decently well off family (although I’m not personally well off at all since my family lets everyone live their life after university; no trusts or handouts or such things - I’m pretty much middle class, sometimes lower middle class depending on the year) who paid for my university and had private primary and secondary. Father who was a diplomat.\n\nMy grammar is not the best unless I am writing a paper or a professional letter on company letterhead. And online? I don’t give a damn. Typing on a phone sucks, and I am usually typing fast and how I talk. And again, it’s a silly forum or silly website. Most don’t care as long as they get their point across and quickly usually. Because the internet.\n\nNot going to downvote you cause downvoting is silly 80 percent of the time. Just wanted to offer you a different perspective.\n\nAs for the OP. For sure is TA. Everyone seems to be in this scenario lol", "That doesn’t mean much. I have a friend who is a doctor. Her professional writing is top-knotch. Her not-professional writing (social media posts, texts, etc.) are what you would expect from someone in middle school.", "In order to fit the character limit, grammatical sacrifices were made lol also, we aren’t super duper omg rich. My siblings and I all went to public school. We recently came into money within the last 4-5 years, all the assets still have loans on them (of course the equity outweighs this) but we couldn’t possible own 22 properties between us mortgage free.", "You are worth as much as someone is willing to pay", "I’ve seen variations of this question pop us so I would like to answer. My BIL duties and mine were different, BIL role was to be my mum’s assistant (handle all communication, drive her around, make her schedule etc) however my role is more extensive due to my knowledge and qualifications. If it’s not clear, we work in real estate. I manage every team under our company, I’m the first point of call for over 50 people, I liaise with solicitors, brokers, bankers, vendors, developers and clients and also complete BIL duties. I earn the same amount as BIL did, BIL was given higher wages because mum wanted to alleviate my sisters stress of being the bread winner.", "Yes, so that would suggest OP is earning $100k?", "r/confidentlyincorrect, can you reread their response and show where u/similar_name4489 confused OP & BIL. \n\nOnly assumption they made is that the Mom would also pay OP 100K as an assistant. (Although I’d bet a pretty penny OP would demand to be paid more than 100K, bc they can’t be paid the same as lazy BIL /s)", "OP says she works 12 hrs a day with her mom, driving her around and managing everything. Sounds like she was given BIL's job.", "Mom has 12 million in assets. The death tax kicks in at 13 million. Gifting each of the kids 3 properties is estate planning.", "Tell me about it. The closest I've ever come to owning property was in Monopoly. I can't even afford a house; I have to rent, and OP is whining about all that inheritance? YTA\n\nAlso, Eat the Rich.", "I think I found them under my sofa", "Cool, commentary without judgment.", "After stealing 20k of course. I really hate when a majority of broke redditors band together against an OP and judge through the lens of their poverty. Same shit when they weigh in on relationships and you see the top comment being the most dogshit position to take, clearly made by someone who's either single or bitter as Hell.", ">We aren’t filthy rich.\n\n>My monthly mortgage payments exceed $15k. Plus $20k is a big deal, it’s months of salary\n\nLol you are delusional.", "BIL is sitting on his lazy ass, sis is choosing to stay with him while complaining she’s worried about losing her job. sis also severed the relationship with mhm. \n\nOP, on the other hand, is working 12 hours as mum’s assistant, manages upkeep for properties and the business, AND is dad’s caregiver. Fuck yes OP wants the inheritance. They’re actually doing shit for the family", "Actually that seals it for me. You can't be this dumb and this entitled without being rich.", "Does OP state that they took up the job BIL was getting paid for and are reaping the benefits of that extra income? No. Should we therefore assume that they have? There isn't enough empirical evidence to support a yes or no.", "You can specify at what age children get their share, who manages it for them in the meantime, and you can specify what it can be used for during that interim period.", "An asshole for being born in a rich family?", "/u/Emotionhg354 is a bot that copied part of [this comment](https://www.reddit.com/r/AmItheAsshole/comments/14zj5nq/aita_for_getting_my_sister_removed_from_the_will/jrycyzp/)", "The ONLY position I think Andrew Tate was completely on the mark with was that to raise a normal kid they have to be a little bit poor - sure take a private jet to fucking disneyland with them...but once there turn them down for a few sweets and toys as too expensive.\n\nI think OP - who is actually YTA here - has managed to go an entire lifetime without hearing \"no\" from parental figures and that's how you produce this bratty, disgusting entitlement \"I'll get my flesh and blood cut out the will because I don't like her husband because he is lazy and doesn't have a job\" - when they sound wealthy enough \"independently\" to have a bunch of passive income and money that just makes money, and why would you bother working for minimum wage and shit wages at that point? If I made idk 8k a month from rent, 4k a month from savings interest...I wouldn't be working for a penny less than 12k a month.", "Not where I live I wish it was", "I guess I should have prefaced with \"I definitely have a judgement\" to match your style.", "She's 25 and truly believes she's earnt all this.\n\nLike one of those articles you see just waiting for the punchline.", "Combined for 3 properties, $15k mortgage is expected but there is rental income so that soften the blow. I’m still paying out of pocket monthly (I would never expect the tenants to hold this responsibility- that’s the bare minimum, I want to be a “good” landlord) I actually appreciate this comment, I fear that my privilege makes me blind to many things.", "*working for mum* not volunteering", "I seriously doubt OP is working for free", "And getting paid 100,000/year for it. It's up to OPs parents to make that decision, not OP.", "Piss off. You used money given to you by your mum and a salary for working for her at 100k a year (lol).\n\nYou are basically her employee. You are not entitled to anything more then your sister and you elbowing her and her children out of your mums will is just awful.", "With the financial nous this OP supposedly has, would it be a fair assumption that they'd work for anything less?", "Considering how many narcissists will (try to) control people with money (we'll pay for your wedding if we pick the venue/let us see the grandkids or we won't pay a college fund/cut off your gay kid, or you're out of my will), that part actually makes a lot of sense. As long as they hold onto reality, a lot of quasi-narcissists also have a lot of drive to succeed.", "/u/ThemeAggxg5254 is a bot that copied part of [this comment](https://www.reddit.com/r/AmItheAsshole/comments/14zj5nq/aita_for_getting_my_sister_removed_from_the_will/jry9h02/)", "Yeah. BIL doesn't deserve anything because they don't have a $100K a year job driving mom around like OP does. \n\nDon't like BIL that's fine. Why do you need to punish your sister and her kids? \n\nESH.", "But it's not OP's money, or OP's call. And OP is preying on their mom at a time of stress to get her to cut BIL out of the will. Because OP says so.", "Ok, just because you can’t relate doesn’t make them an automatic ah. Some people are born with silver spoons, it’s not their fault and it doesn’t make their problems any less than ours. It just makes it not relatable. If you *actually* read the post, OP just doesn’t want her ungrateful, lazy, leeching BIL to gain from her parents’ deaths.", "This is a great comment. So many people here getting cross threaded because OP has more than they do. So what? I don’t have anything but that’s no reason to shoot OP down.", "I'm not telling anyone how to spend their money and I don't think it's a controversial opinion that I'd rather that money go to people that need it rather than some entitled money grabbers arguing over who 'earned' their inheritance. \n\nI live pretty frugally by choice and if I didn't need to work and had more money than I needed I would absolutely be doing a lot to help people.", "So you prefer government theft? Yikes", "Can't argue with that. Large amounts of inherited wealth are a detriment to society", "An arsehole for convincing her parents to leave her sibling out the will. For saying she earned the inheritance and for the point of why would the mum buy them 3 houses then later adding in the mum has bought her 3 houses.", "Are you in the U.S.? Try going directly through Humana or Aetna. You can check their websites now and see what’s available. Dental and vision are cheap it’s regular health insurance that’s criminal", "That's her problem not yours. Everything should be split equally amongst the 3 children.", "But her putting his name on the title is HER decision to make. That’s her choice and if he’s a loser as you say, that’s her problem in the future. \n\nIf your mum wanted to she could set up three family trusts. Put the allocated property in it three ways divided between her three children. \n\nShe can put your sisters name as trustee on her trust without her husbands name on it. The only person who can control the trust is the trustee. \n\nI think you need to allow your mother to go to a solicitor to sort out a fairer way. Stop manipulating your elderly mother this way. \n\nIf your mother passes away and leaves your sister nothing, she can, and will have grounds to sue. \n\nYou will all end up with nothing, all that money will end up in barristers pockets. \n\nOP, you are letting your hate for your BIL get in the way of fairness and rationality. \n\nIf one child was working in the mothers business and created the wealth the mother was able to accumulate, then they obviously get a bigger share. But it doesn’t sound like this is the case here. She has already gifted you some property you benefit from now. \n\nWhat if you had a shit partner? Do you believe you should miss out on inheritance if the shoe was on the other foot?", "I most definitely did not earn all this. I know I’m very fortunate that my parents have paved my way, very few are in the same position as me. Thank you for opening my eyes!", "Reread what I wrote, then reread the post by OP. Isn't that hard.", "It doesn't exclude it either and OP hasn't clarified. Therefore, I stand by OP getting paid to do the job and still wanting the inheritance", "I would not work 60 hours a week at one job, be a full time chauffeur, AND be a caregiver for $100k a year. That is 3 separate jobs and adds up to like $18 an hour divided but well over 40 hours a week lmao\n\nYou can’t force someone to make a decision. We can debate back and forth all day but at the end of the day, a person makes their own choices and mum made the choice she made.", "This!!!", "Exactly. I believe even her in the US, it’s state specific as to where the money can end up. My problem is that the only way to ensure he doesn’t get any, absolutely no benefit from the money, is to add excessive stipulations to it such as only after divorce or he’s no longer in the picture, making it be used purely for the children and their education/ future homes,et. Most people would be equally outraged by that, so it’s kinda difficult lol", "BIL tried to steal 20k from mom/ the familial trust and the sister sided with him. Who exactly are you claiming is the asshole? Everything we see here is a family protecting themselves from an outsider and a horrible daughter… I get the weird responses, but op telling her mom to be careful of the snake doesn’t make op the asshole.", "Very true. My parents tried stuff like this, they wanted to help me buy a car but as a form of control. The title would’ve been in my father’s name and if I ever got pulled over it would’ve looked like grand theft auto. Tried to chain me to them for 3-4 more years, and I would’ve had to pay them. 🫠\n\n[edit for clarification bc ya boi stupid: pay them through those 3-4 years for the help but regardless of how much I’d give they said if i messed up (aka pissed them off) they could just take it at any time]", "There's also no way Richie Rich here doesn't know that inheritance can go into trusts for grandkids specifically so that untrustworthy parents of those kids don't get the money.", "She didn't convince Mom.\n\nThat is what her sister is accusing her of, but no evidence that is what happened.", "Weird thing to get downvoted for... I guess people who want to hoard money don't believe that people actually exist who *don't* want to.", "What a lovely halo you have", "Sources?", "I see inference and assumptions to create an argument aren’t your strength.", "OP is entitled, whether you can see it or not. BIL sucks, no one is disputing that. I just feel sorry for the mother who’s worked so hard for a bunch of narcissistic, entitled kids to scrabble over her money while she’s still alive.", "We really don’t know if the sister and BIL are wealthy. I just commented idk if you can see where but it’s long so not going to write the whole thing again but basically something like this happened in my family where one of my grandmother’s sister’s (the youngest) married very well and was free to spend all her time with my wealthy great grandmother after my great grandfather died. The other 3 sisters all worked and had kids and saw there mother regularly but the youngest sister convinced her mother to cut them all out of the will and give her everything short of $50k each. This was upsetting to the point of traumatizing for many and destroyed many relationships. Has effected the family for 4 generations. It was a really sad and sick situation.\n\nETA- I am not saying $50k isn’t a nice inheritance, what I am saying is that the will was changed so 3 were given that while the youngest sister was given millions.", "OP says \"...I think I am the asshole bc I \"convinced\" mum to split her assets equally between myself and bro...\" (third paragraph). I think OP is talking about herself in this situation.", "I mean, there's no evidence that any of these posts happened. Op is mad that her sister and bil would have gotten more money on top of what her mom already gave them. That's what makes them TA", "https://www.philanthropyroundtable.org/almanac/who-gives-most-to-charity/#:~:text=Giving%20by%20income%20level&text=People%20with%20means%2C%20as%20you,of%20available%20income%2C%20that%20is.\n\nhttps://www.npr.org/templates/story/story.php?storyId=129068241\n\nhttps://www.thelondoneconomic.com/news/environment/poor-people-really-are-more-charitable-than-the-rich-according-to-new-research-93441/\n\nThis enough?", "I get the typical story of this shit happening, but reread the actual post. They really didn’t do nothing but point out facts of the situation. She didn’t threaten mom or even force her hand. Everyone in the trust agrees that the BIL shouldn’t be able to use the mothers wealth, which requires the sister to be cut off from the specific inheritance mentioned. There is no scrabbling. The only one that has issues is the sister who’s nc with mom and supporting the BIL. She doesn’t like the consequences of her actions, so she’s starting the fight over money, not op… mom could have chosen to keep shit the same, again op didn’t fucking do anything egregious. If anything, she’s admitting that she’s planning on making herself the defacto intermediary for the nieces and nephews, to protect it from their money hungry parents.", "haven’t been proper grocery shopping in almost a year now, cannot afford to go to the dentist and i am driving my car until it breaks down as i have no funds to fix even my tires. my sympathy for your situation is not minimal, as i understand everyone struggles at different levels and you shouldn’t hate someone for having something you don’t.", "I’m sitting here wondering if my $$ will last out the month so I can EAT! OP…set up Sis & BIL’s portion into a Binding Trust for her kids that Neither can Touch & be done with it.", "And yet you would be considered rich or privileged to many people as well.  Be thankful you have a car and access to healthcare, even if you’re juggling other expenses.  Many people don’t even have that. I believe gratitude can teach empathy and compassion for others in all stations of life.  Everybody hurts and is deserving of compassion.", "Some people just want a fairer society, it's very telling you can only understand that as jealousy. \n\nKeep defending the rich anyway, even though they generally don't give a fuck about the rest of us.", "So is English not your first language? First time on the internet?\n\nThen you can be excused for not knowing how \"quotes\" are used to indicate an ironic, sarcastic or contradictory meaning.\n\nSo now you know, it is an important skill to have on the internet.", "I understand by the context of what she's asking about she may be NTA. But I just concerned myself with the other ways she revealed her asshole behavior. It wasn't just being in someones life, she attributed her parents successes as her own hard work.\n \nAgain, any sort of earning of inheritance is an entitled take, because for most people a relationship does not result in an inheritance anything like this. It also still views relationships as transational (OP was there, sister wasn't therefore she deserves it) while OP is also mentioning that her mom was a bad parent in many ways. It seems likely Mom favored OP and thats why they are still on good terms. This whole situation reeks of greed and entitlement and society would be better off without this mindset. Nobody needs 12 properties while millions have 0. They are whats wrong with our society, but I digress because obviously that is based on ideology.", "These people don't sound like the super rich we should be mad at. Being mad at normal-wealthy people is a waste of time. Be mad at billionaires.", "How many fucks is posting on Reddit worth these days?", "I think the quotes are used wrongly here though. OP said she thinks she's the ah because she convinced the mum not that her sister thinks that.\n\nShe then rants how they don't deserve it", "I'm perfectly capable of being mad at billionaires *and* landlords. Two people don't need 12 properties, and rich AHs buying up property and jacking up the rent is part of why our housing crisis is so bad. OP's NTA, but they certainly are an AH.", "Just 1 haha", "OP is a little tone deaf to the struggles of her fellow Redditors. If I’m being honest this entire post feels like a humble brag. \n\nOP’s whole point in this post is  “I put up with my mum because she’s loaded and I stand to make a fortune with my inheritance. My sister doesn’t deserve an inheritance because she doesn’t put up with mum, and no one likes her husband.”\n\nEdit to add verdict: ESH", "24yo, \"worked hard her whole life\", already has 3 properties and a Milly in the bank. Get fucked you little shit, you wouldn't know hard work if it bit you in the ass. YTA!", "How could OP have worked her \"whole life\" under her parents? She's 24, not 60!", "ESH. Are your parents particularly elderly already? You all are in your 20's and unless you have reason to believe your parents are going to die young it seems a little early to be arguing over inheritance. My partner is in his mid 60's and his dad just passed this year. \n\nA lot can happen in the next 20-40 years. Your sister might get divorced, your BIL might get a job, your mom might decide to leave everything to her cat, your brother might join a cult and marry 5 women. \n\nMaybe you and your siblings should avoid trying to sway your parent's estate planning decisions and let them be.", "It sounds like your sister (and BIL) are expecting to be rewarded just because she was born into the family. Unfortunately there are many people in this world that are entitled and grifters. You are looking out for the business your parents created and work hard to protect them and their property. You should not feel bad.", "Changing judgement to esh. You may have nudged mom but ultimately it's up to her and dad to decide who gets what when they pass on one day. None of you are owed anything but your parents can chose what they leave behind.", "NTA and by the way. I am totally down for coming to work for your family lol", "I don't think you're wrong for accepting that your sister doesn't deserve anything from somebody she has cut out of her life. You can't have it both ways. Everybody knows that if you cut out your Rich family then you might be cut off from them too. Especially seeing as you said that you take care of your mother and your father and your sister and bil don't. I don't really think him not working is as big a deal as you're saying because who knows how their family dynamic really is and your sister might have even preferred him be the stay at home one", "NTA because of sister's entitlement but definitely YTA for going out of your way to leave your sister with nothing..", "~~Nobody caught that the sis was 16 and BIL was 22 when they got together, huh?~~\n\nEDIT: I need to invest in some better reading skills. Ignore my comment please.", "Exactly. I’ve asked me therapist this because we have some family property (not at all values like OP), and I’m frustrated that my sister, who has never been able to keep a job and lives with my parents for free, will probably get some of the money. My therapist has—while it’s a tough pill to swallow—told me it’s my parents choice to do what they want with their money and property. It’s not up to me. If they want to give it all to my sister, that’s their choice. \n\nOP is the AH for trying to convince their mom. There are lots of other ways to protect the property (like keeping them in a trust), but if the mom wants sister to have some money/property, that’s the mom’s choice. OP can’t control what mom does or sister does.", "This is the longest, most entitled, rambling post I've ever read on AITA....  YTA", "I hate that they can never admit they’re rich. It’s never “I’m wealthy” it’s always “I come a from a moderately well-off family and I’m a hard worker”", "Okay but nobody asked about your situation? Maybe try answering without projecting, or don't answer at all. 🤷‍♀️", "It’s YTA for me because it’s not her place to convince her parents of what to put in their will - it’s their business. \n\nInheritance is not earned - it’s the opposite of earned. It’s a gift you’re not entitled to, and it’s not your choice who gets what. \n\nWhen my mum had terminal cancer, I took care of her. I spent as much time with her as I could. We hadn’t had a good relationship but we sorted things out in her last couple of years and I’m grateful for that. \n\nMy sister lives hours away and works long hours, she did as much as she could. My brother lives locally and did nothing. He wouldn’t be there in her final couple of days because he found it too hard, and he didn’t come to the party she asked us to throw for her instead of a funeral. We hired a boat and released her ashes in her favourite place - it was beautiful and he missed it. They never made amends and now he can’t. \n\nShe left us her house which had tenants in it when she died as she was living in a flat. I managed that until they left and then we moved in and I paid my siblings rent until it sold. There was a huge amount of complex work that had to be done before it could be sold, which I did myself. My sister came back at weekends and decorated as I was pregnant at the time. My brother did a tip run once. \n\nThat house was split equally three ways because that’s what my mum wanted. I didn’t get more because I’d done more work, and I didn’t take care of her for money. I did it because it was the right thing to do and I could. \n\nOP, your mum was paying your BIL 100k a year to work for the business and now you’re doing it so it seems likely you’re being paid for your work. That shouldn’t have any bearing on inheritance. \n\nYou need to let your parents make their own decisions. You don’t need a bigger share of the inheritance - if anyone does it’s your sister since she’s got two kids and a shitty husband, but since they own three properties it’s not like she is living hand to mouth either. Not sure where they would be if she became disabled or too unwell to work though. \n\nRegardless, this is up to your parents. You shouldn’t be influencing them at all especially when you stand to benefit hugely from the decision you’ve “convinced” your mother to make. \n\nYou should apologise and tell your mother that you were wrong to weigh in on this and that it’s entirely her decision. \n\nCutting a child out of your will or favouring some children over others in a will is really not about the money - it’s an incredibly hurtful thing to do even if what’s being left is a few hundred quid and a stamp collection. Does your mother really want to leave her daughter with the impression that she cared less about her than her other two children? That’s how she must feel. \n\nIf your concern is really the BIL, there are ways around it - since you’re saying you will eventually leave things to her kids, your mother could put property / money in a trust for them. She could speak to a solicitor about how to deal with things for your sister so that she’s comfortable your BIL won’t blow his way through it (like an annuity or a trust that pays out annually or whatever it is - I’m sure there are options). \n\nYou’ve really overstepped here and need to fix it.", "He doesn't want more money. He just doesn't want that leech of a BiL to have money for doing nothing", "Yup. I stopped reading at the disclosure that they were each given three properties. Who the fuck even cares about what happens to these people?", "Esh/everyone sucks here", "Whether the inheritance is $10000 or half the oceanside properties in a big city, the core of this issue is the attitude about money. The parents have done well and made a fortune with their real estate business. OP is helping manage the cash cow and the brother at least seems to have work ethic. But the sister and BIL they act like they think rich people act. Spend here and there until it's all gone and BIL is worst, not only does he not have a job after 'searching' for half a decade but he doesn't even look after the kids as SAHD. Entrepreneurs need to breed entrepreneurs to keep the cash cow healthy and like it or not it becomes a job to manage those finances and keep it going. No amount of money will ever be enough for the sister and her family because it will be passed away.\n\nI had a similar situation (regarding a ton less money) where an aunt with a chronically unemployed husband who married in, was trying to force the sale of my grandparents house to cash out quick. But the other aunt who was left the house wanted to keep it since property values were rising so quick there would be so much more money if it appreciated. So she moved in, now twenty years later she revealed that in her will the house is now left to all of the grandchildren. She protected the asset (all siblings had jobs and houses already) since a little cash now would be worth a fortune later. The house has more than doubled in value since then.\n\nSo many people lack good money management and I can't blame that family for wanting to protect their golden goose, NTA.", "Parents are inherently meant to look after their kids. Kids don't go NC for no reason.. therefore, the very least a parent can do is care for ALL their kids (if they have the means to) when they pass away.  \n\nI really don't think people fully understand what has to happen for children to grow up and choose full no contact with a parent. It's rarely a cut and dried choice made for funsies.", "I agree, I most definitely need a reality check. Thank you for your honesty, this is something I feared I may have done and that my privilege has blinded me to. As it stands, I’m not asking my sister to necessarily be in my mum’s life. Mum is a narcissist after all and I have experienced first hand how cruel she can be, but it’s hard to divide the assets in a way that doesn’t benefit BIL who has never respected us.", "A lot of people share this notion that people with money don’t know hard work. This money is very recent, within the last 4-5 years. I’ve worked in call centres, hospitality and retails eating >50k up until 2 years ago. Ive worked for my parents part time since 15. I’ve been coach surfing and went to public school. I moved in with my dad last month to be his caregiver. I’m not that familiar with reddit so I wasn’t aware having money made you an automatic AH", "English is my parents second language, I’ve been working for them ‘officially’ part time since I was 15. And before then I was doing other things for their businesses but I was underage.", "My mum is in her mid 60s, but with how she’s raised us, talk of inheritance, money and property are very commonplace. She is quite healthy so there is plenty of time to change her mind, it’s with my dads recent diagnosis that has kicked things into gear. Similar to a worst case scenario.", "I mean if I was earning 100k a year I’d be working 12 hour days too", "Sorry for the confusion, I’m now sure where it says that but could you please point it out for me to rectify? My sister is 29 and BIL is 30. They have been together since she was 21 and him 22.", "No because it doesn't say that. **op** was 16 when her then 21 year old sister got with the then 22 year old husband", "TBH if the mum is actually cutting her daughter out of her will, then she should tell everyone when she’s alive and be forced to explain why. It would be so much more hurtful for the daughter and heir children if they found out that they’d been written out of the will after she died.", "Maybe I'm naive, but I'm pretty sure that's exactly when all this should be sorted out. I'm always hearing people say it's a conversation you should have long before youre on your deathbed, especially if you actually have assets or don't want to burden the family with funeral expenses. \n\nMom is right to do it now, she's also right to be clear with her kids. OP is incredibly greedy and the sister is feeling blindsided, but I think waiting till mom is dead to fight all this with so much money and emotions involved would be foolish.", "It's a butt kissing  contest  and rn Op is just winning 🤣 ain't nothing  about  that earned you are correct", "You've never met dumb rich people who make lot's of silly mistakes?", "Right? And we only have OP's word that BIL is lazy. If he really is qualified to be a manager, I wouldn't want to be PA for my MIL either. Maybe with all their privilege BIL can afford not to work", "I don't know where you live, but in most \"Western countries\" the inheritance goes to the child of the person that died and there spouse can't demand their part of it (unless of course, the money is used for the whole family: as in say they buy a house or a car and both their names are considered the owner (must be on a contract)). \n\nSo, BIL wouldn't inherit anything.\n\nBut more importantly: **why do you care?** You are not struggling at all. It isn't your money either. It's your parents and yet you made sure (read: manipulated your mother) that you get more and sister is no longer in the will. Of course YTA! \n\nAlso, news flash: if that they day comes and the will isn't changed by then, your sister does have grounds to appeal the will depending on how things are worded: don't count your eggs before they hatch!\n\nFor instance: where I live (European country)  you cannot disinherit your own children. Sure, you can give things or change ownership before a passing (at least 2 years before, if not the other children can go to court to get their fair share), but completely disinheriting your children is impossible (They can deny or refuse their right to it, wise if your parents only have debts, but the heir needs to decide that for themselves)", "You didnt answer the question, why not directly give it to the kids?\n\nIf they got mad at you and didnt talk to you for a year would you still give them the properties?", "New money problems.", "Yeah, \"I drive mom around and blah blah blah\" yes and YOU'RE GETTING PAID FOR IT. IT'S YOUR JOB.", "That ain't first world. I live in the first world. That's some next-level out-of-this-world problem.", "I couldn’t even read it all because literally none of it is normal human things", "> I couldn’t explain with the limited word count\n\nYou spent like 2 paragraphs describing your BIL in detail, but couldn't figure out how to put in how you actually convinced your mom to disown your sister in the post?\n\nWhy are you putting scare quotes around 'convinced' when you literally told her what you wanted to have happen? You did convince her, quite literally.", "Gracias! ESH!", "> Look, you go no contact, don’t expect inheritance.  Simple.\n\nWhy?  \n\nI’ve really never understood this concept. \n\nI have a daughter, she will never stop being my daughter, doesn’t matter how old she is or how often she talks to me.  I work to ensure she has some kind of inheritance, I bear the responsibility for her very existence, shirking that responsibility over petty disagreements seems unconscionable to me.", "Which is what you should have done in the first place, not getting her written out of the will entirely. I doubt the life insurance would equal to what she would get out of the assets, and knowing you, she'd only just get a third of that. \n\nDo the right thing here. Karma comes for rich people too.", "And this is why interest rates shouldn’t have been so low for so long. Property speculators buying up houses, driving the price up. Expecting the rental return to cover the mortgage needs to end with a few rate rises and forced sales to flatten it. \n\nProperty speculation contributes nothing and creates nothing for the economy. It’s all paper and no real productivity.", "An ex of mine once referred to his custodian account of half a million dollars as a \"janitor account.\" Intelligence is not remotely correlated with inherited wealth.", "Perhaps English as a second language?", "The use of the word mum implies they're UK, so I assume English is their first language. From there, for me it's not the typos, but the grammar. The way OP frames their sentence structure doesn't strike me as... being smart. As the person you're responding to said, it just becomes their natural voice when typing.", "The fact that in this time and place you even have more then 1 with a mortgage is insane. Do you know how many people are homeless in Australia right now because of the insane rental market? And you just casually have 22 properties?", "I am giving directly to her kids, my will stipulates everything of mine will go to my sister’s children. Alternatively, once I take over as trustee for the family trust I would add them, this is out of my control right now. As it stands I have no use to hoard this many properties, especially as I won’t have a family myself. \nAs for your second question it  depends, me and my sister only just started getting along since she’s become a parent. We hated each other growing up. If she was desperate then absolutely, but how I see it is that her situation could be easily alleviated if BIL would get a job.", "Similiar name is claiming that OP is working for 100k. If you read OP's post, OP states that BIL made that much... not OP. Do you think that means OP makes that much, without the obvious empirical evidence supporting such a claim?", "It’s human nature to compare yourself with others. It’s inequality that creates human greed, even though intuitively you’d think it was the other way around.", "Just remember op is in Australia so 1M AUS is only 684k in USD, they’re not that rich /s", "OMG me too! It's so far out of my sphere of experience, it's orbiting Mars right now.", "I read the comments then didn’t read a word of the post", "Literally all of the posts on here are rich people problems compared to most of the world.", "She’s the asshole because she’s wealthier than you? Not her fault her parents were more successful than yours", "There was a guy who’s wife had an abortion against his wishes because the baby would be an Aquarius. That woman is worse.", "Thank you!! All I see is people making judgement based on being annoyed by OP’s wealth and not judging the actions themselves.\n\nI see a variation of this in every subreddit and don’t get it. I once saw someone in an askreddit thread complaining about hating Taylor Swift. Checked their past comments and they were mad they didn’t get tickets bc of the ticketmaster fiasco 😂", "No you say we because you feel entitled. A signature on a mortgage has nothing to do with \"building\".", "I meant, if her kids, your nephews didnt talk to you or dont get along with you, would you still give them the properties?\nI get that Bil sucks and i want to circumvent him too.\n\nHonestly you dont sound very reliable.\nSince you say inherirance is earned, it feels like youll want your nephews to appease youe even if you were unreasonable as your mom is.. you have even said she is cruel... and still your sister hasnt earnt it.\n\nI know today you love em today and today you dont have a wife, and today you have no stepkids.\nBut that could change and it would be better if you could secure them.\n\nEven the motive was to create generational wealth. Since you convinced your mom to kick out your sis, maybe you could convince her to add her kids, your nephews.", "She's the asshole because she's already got so much wealth and she's trying to get an even bigger inheritance than she was originally going to get. Her greed makes her the asshole.", "It’s crazy to watch people be so bitter towards OP. Apparently you can’t be on this sub if you’re wealthy because everyone will freak out, as if 99% of these posts are incomprehensible to actual globally poor people. OP is just asking if she’s the asshole, but apparently she should just donate all her money (unlike everyone commenting)", "Yet, they haven't revealed how much or how little they are getting in exchange for whatever services they are providing, compared to the services their BIL was providing. Knowing the job market, females are very underpaid compared to their male counterparts even to this day. Without OP saying how much they are getting paid 100k, it is folly to assume they are getting paid that exact amount. If the parent in question is manipulative there is a chance they are getting paid less for more work because they were born a different gender and that role is expected of them (in some generation's minds :( ). We won't know unless they say how much they are making.", "And that’s the issue. She’s already been on his side and has cut off her mother (the one the money comes from) because of the BIL. There’s nothing stopping the sister from doing those things you said (and I’ll apologize, I meant similarly to what you said, but was being far too generic)… the easiest way for the family to nip him in the bud is to not give her the opportunity to give him a dime.", "This is rather grim, but I don’t anticipate seeing myself go into old age, hence the no family. So as it stands,  my niece and nephew have definitely “appeased” me for just being innocent children. I can’t share the same sentiment with a grown man I know is taking my sister for granted. My mother is undoubtedly cruel, however my sister has always been the same way back. I would say prior to her marriage she would have been entitled to it, but with her sharing everything to someone who has only shown disrespect not just to my mum but the whole family, she has lost that right. This is only my opinion, although the rest of my family share this sentiment so who knows.", "OP's mom is actually doing a great job of manipulating her daughter here. Her own daughter is justifying working 12-hour days and busting ass for her mom, and she's calling her BIL lazy for not putting up with the same treatment.", "That is a good point. I know someone who uses their money and \"generosity\" to get others under their thumb, roping them in to doing work for them and such.", "Yeah fr. I’m poor as hell, and I can relate to not wanting a shitty, neglectful (abusive) BIL to not get any of mom’s money when she dies. I’ve seen that first hand for people who own zero property.", "Apparently everything OP has is going to their sister’s kids. So that is happening.", "That’s hilarious that you think someone with $30 bucks is going to donate $20. I’m sure poor people are donating their food money for the week, that makes a lot of sense", "There's a major difference between \"it's unethical to own twelve properties when there are people struggling for housing (a basic human need)\" and \"donate all your money\"", "I see your point.\n\"Convince\" your mom to take out Bil and Sis and add nephews", "So well off people can’t post in this sub now because they’re rich so fuck them? Maybe you’d be happier if you were less bitter.", "I think that’s what she’s saying will happen, she’s saying she never plans to have kids so all her things will go to niece and nephew I.e sister and BIL’s kids", "Exactly.", "We do. Its hilarious that you assumed those same ppl with $30 by paychecks end (me) hasn't already bought groceries in this scenario of yours.", "You can’t expect someone to just give away property worth hundreds of thousands of dollars, and the reality is most people complaining about how rich they are wouldn’t give anything up either.", "Yeah, but she could have just...  convinced her mum to put her sister's 1/3rd of the inheritance straight into a trust for the sister's kids...\n\nas is, she's saying, give more to me, and I promise at some future date sister's kids will get it!\n\nWhy have it go through the inheritance process twice, when it could go straight to the grandkids, and they could use those assets for college or their first house, or whatever.  OP may be 101 when she dies and her sister's kids in their 70's or 80's before they see any benefit from the inheritance that will come through her.  Why not have it go straight to them so they can benefit sooner?\n\nOP says she's set for life, so what does it matter to her if she only has 33% of the inheritance, instead of 50% of the inheritance? That money will have a significantly bigger impact on the lives of the sister's kids, especially if their father isn't going to be in a position to \"set them up\" like OP's parents have.", "That sucks so much. I'm sorry you're having to deal with that. I'm not there yet but I also know the risk isn't that far off either.", "I don't hate them, but I also have no sympathy for a family with so much squabbling over the abundance they have. Instead of gratitude for how much they've got, they're grasping for more.", "I feel that on the car, somehow I've got to make it 2 more paychecks before I can replace my tires, but I need to drive to work in order to get said paychecks.\n\nSo here's to both of our cars not completely disintigrating into a pile of rust once we get the tires fixed <3", "I sincerely doubt that I would be measured as rich by many standards, and I don't need a lecture on empathy. I can be empathetic for the actual troubles they have, and not particularly so when they're being greedy, grasping turds who have no appreciation for how much they have.", "Not people who profit from the exploitation of others. They deserve a trip to the Titanic.", "You would definitely be considered that to plenty of homeless people.", "And of course you have never profited from the exploitation of others, right? Look deeper at yourself and gain some insight.", "They're slapfighting over something to the tune of $15 million split 3 ways. That's $5 million each, not including the properties *they already got*. Average S&P return is 7%. That's $350,000 a year. More than enough money to never even think about money without buying yachts and mansions. \n\nThey're all just assholes. They're all being handed a golden ticket and they're complaining because each other's looks shinier.", "Bout 3.50.", "NTA. While everyone argues over your money I'll answer you.  Plain and simple, you've done the work.  They stole and lied.  No matter how your mom acts , she shouldn't be expected to hand over things to someone who lied on her name, is too lazy to help her while being paid more than most would, and to give anything to someone who stole money from her, no matter what the reasoning .", "YTA. What happens if your sister's marriage doesn't work out in the long run?", "YTA. Caring for your parents is the responsibility you took on, not from a place of love but a contest to prove yourself the favorite.  You brother is 19; hardly a helpless baby.  Your sisters life probably sucks and your BIL sounds like a lazy ass.  But your mother made those decisions and you never mentioned that she was senile or suffering from dementia. \nDriving your mother around and looking in on your Dad, sounds like your doing the 100k job even better. There’s a payoff here.  \nPS:  Their money their business. Cancer doesn’t mean oblivious either.", "I stopped reading halfway through. YTA but so is everyone else you know so ESH. You're all entitled and I hope you guys have a substantial reduction in your wealth. Inheritance is earned?? Wtf are you talking about. You put money and petty bullshit ahead of a relationship with your sibling. \n\nFuck.", "YTA for making read this. Nobody gives a shit about the squabbles of people who have more than they will ever need while most people on earth struggle constantly.", "I’ll gladly put up with a shitty boss for 25 hours a week and $100k wtf", "I’m curious as to why you think this person sounds worse. The BIL literally couldn’t even handle working 15 hours a week for 100k lmao. He has been “job hunting” for 5 years because he doesn’t want to work. Oh and he stole 20k from his MIL. And then cut off contact with her. The sister sounds a bit delulu if she’s genuinely taking his side. They need to learn a hard life lesson or 2, or 5, to come back down to Earth lol. Also OP is protecting the sister’s kids from their father’s own greed.", "I just laughed so hard I scared my dog. Take my poor woman's gold.🥇🏆🎖", "If there marriage fails, likely my mum will amend the will again. She would still probably receive a fewer share due to their sour history.", "I love my dad with my whole heart. My mum is a complicated situation, you can love someone who hurts you and hate them at the same time. I’m looking after my dad because my brother is too young for that responsibility and my sister has enough on her plate. I think it’s gross to misconstrue being a caregiver to wanting a larger inheritance or playing favourites. Simply I don’t want BIL to benefit from their sacrifices.", "Doesn’t like mom but doesn’t have a problem taking handouts and eventual inheritance. Majorly YTA", "You have posted that same snippet a couple times, did your somehow do so without reading the last bunch of words yourself lol\n\nThe salary might not be exactly the same but it's a reasonable assumption people are making that if OP took over the assistant job they are now the one being paid that salary (or more).", "He hasn't worked in five years, it does smell a bit like he's waiting for his in-laws to pass away and set them up so he won't have to until he can draw on his own retirement accts...if he has any.", "Really BIL and sis should have their share out in a trust for the kids for when they turn a certain age. 25 would be appropriate unless anything college related is needed. This was entitled ahs can either still cry and complain or actually chill knowing their kids’ futures will be ok. \n\nYea, op is an ah as well for thinking their job as mom’s assistant should have anything to do with the inheritance. They already get paid a lot for the job.  \n\nThis is a ESH type of entitlement post.", "That's not for him to decide. It's not his money. It is a reasonable thought and he should be free to make the suggestion to his mother that the criteria she use to decide who gets what be trust or accomplishment or whatever else. If mom ultimately wants to give away her property because she likes a guy's ass that's her choice to make and no one else's. She can be as frivolous or responsible as she wants. It's no ones choice but hers. \n\nIf she wants to ensure the property stays in the family there are ways to do that in will. Wills can be excruciatingly specific. She can without a doubt stipulate that these properties go into a family trust and the executors or beneficiaries of that trust are so and so individuals not including BIL. She can further stipulate that if the executors of the trust choose to place BIL on the deed of any of the properties all executors and beneficiaries immediately lose access to the trust. My point is there are ways to do this without just cutting anyone out. OP almost certainly knows all of this. He comes from a wealthy family and manages multiple properties. So trusts and inheritance are probably not new to him. There's no need to cut her entirely unless he's trying to pull some shifty nonsense. \n\nOP is ignoring all the legal mechanisms to ensure HIS wishes get enacted and is cutting his sister out for reasons that are his own. They may be good reasons but they are his and not his moms. This is moms property and its her choice how it gets distributed.", "I mean she got 3 properties AKA handouts, and is upset that her sister also got 3 properties. I'm going YTA here.", "Or, “my dad has cancer and my parents are working through it; this is a good time to fight over their inheritance”", "They're in Australia. We have socialised health care here. If you're on our Medicare, all you'd need to do is find a GP clinic that will bulk bill.", "It’s actually an abomination and no one with an ounce of sanity should ever take a judgment to heart if that’s how the collective body operates nowadays.", "I genuinely don't have a problem with rich people, but even I found this 'problem' too boring to finish reading through, based on the convoluted subtleties plus how how non-important it was. And the non-importance is based on how rich they apparently all are. Whatever this financial problem is, I just don't care, and because I don't care I feel OP is an AH for wasting as much of my time as OP managed to waste, reading as much of that nonsense as I managed to read. \n\nAnd if anyone on here genuinely doesn't understand that the vast majority of humans on planet earth will have a similar reaction to hearing complaints like this from people with privilege like this, I honestly think it's healthy for each such person to read comments like the top comment, to just become *slightly* more aware. Even if they disagree with it and think the vast majority of the world are being meany-stupid-heads who are just jealous (or whatever)... read the room, because being an AH is contextual. And in the context of the global room, YTA.", "Honestly most people are defaulting to OP being an a-hole for the sole reason that they (and family) are rich, which yeah 1% problems, but we should actually be judging all content in a post.\n\nObviously I think OP is NTA", "But seriously…", "I don’t read the post that way. The sister would not lose out, she would be getting plenty of money from the life insurance. She can give her thief of a husband that instead. And why is she entitled to an inheritance when she hasn’t spoken or visited her parents for over a year? Even if it’s mothers fault partially, why would she want money attached to that.", "This is a very not-nice thing to do. You shouldn't screw your sister over like that.", "The worst part is that she’s also hurting whatever grandkids come out of that side. They didn’t even do anything wrong and they’re being punished", "Correct response, lol. What did the poster intend, for the mom to die then have an argument in court\"mom would've wanted ABC to have XYZ and not you!\"? ... Just a bunch of hearsay \n\nBut sis is in no contact with mom with a lazy husband. Makes sense for her to be off the trust.", "But it’s so hard to be nice to mommy because she’s mean!", "That could easily be autocorrect", "Have you heard Eric Trump speak?", "I'm an Aussie struggling through the rental crisis. OP and the parents are all massive aholes for their contribution to this crisis.", "Most places inheritances are shared unless it goes into a individual account and only pays for individual expenses, but some places it's shared automatically.", "You know the two don’t need to be mutually exclusive, right? You can both be very lucky in life AND be incredibly hard working.", "My step grandmother emptied my trust fund when my grandfather died. 👍 It wasn't a huge trust (Around $15k in the 90s) but it would have been fucking useful for college.", "yeah i thought that one was actually hilarious 😂 because no. that wouldn’t cross their mind at ALL, they’d either spend it all on needs and fun activities or start investing it like everyone else. i don’t know a single person that has given all their millions away to charity to be poor again lmao, not a single one. and none of these commenters would be the first 😂", "What?!\n\nEdit: found it. I only hope it's fake.", "I did read it, and that is why I said what I said. OP is quite clear in saying that the priority is not rewarding BiL for his laziness... and has said that they intend to see that her sister's kids get their share of the estate. OP has NOT said that they expect to get the sister's share. I wonder how carefully YOU read it, and how much you are reading into it.", "As opposed to lazy people like OP stealing from hard working individuals through rent? Yes. Even Adam Smith knew landlords are parasites.", "BiL is being called lazy for not finding a job OTHER than being a bad personal assistant. It'd help to have a weigh-in from him or the sister, but not having a job at all just lumps BiL in with the rest of the ESH pile.", "Yes, OP has not said that she gets her sisters expected share of it. That is my point. OP does not want her lazy leeching BIL to inherit anything from this. Thanks for proving my point?", "Thank goodness.", "Landlords provide housing to people who cannot afford to buy a home. The fact that you think wealthy people shouldn’t be able to pass down assets and landlords are “parasites” says a lot about you.", "I usually skip ones with will or inheritance in the title because I end up getting angry a third of the way through. Plus, for some reason, you're all assholes- redistribute your wealth isn't an acceptable judgment in this sub.", "That is... what I said. Please don't argue with people who agree with you...", "I think you have very different definitions of \"poor\" than the average person, my dude.  \"Average citizens of moderate income\" means middle class.   \"Poor\" is not defined as simply being \"not rich.\"\n\nAnd even by your own logic, you're wrong.   If a person were to be in OPs shoes (i.e. objectively wealthy) then they wouldn't be donating it.  It's all well and good to say what you \"would do\" with other people's hypothetical wealth, but let's just say I'll believe it when I see it.", "Landlords hoard houses, making them unaffordable for people who want to buy homes to live in. They do nothing to help people. They do the bare minimum to provide adequate housing and if there were laws allowing them to do less, they would.  Hell, sometimes they don't even meet the legal requirements as is. I've lived in places that violate fire codes, places with faulty electrics, places where half the burners on the stove don't work, places where the superintendent would put a hole in the wall to repair a pipe and not fill the hole for a year, places where the stove hood vented into the kitchen. I lived in a place where the heater would break every winter because it was an old and crappy design (that was inefficient to boot), but my landlord was too stupid to realize that it would be cheaper to just buy a new heater than to pay half the cost of a new heater every year to replace the part that wasn't in production any more. \n\nThe governments in most of the countries I've lived in provide me with health care, with education, with transportation etc. Governments have done way more to help me than any landlord has.", "You actually don't know that last part my guy- that's conjecture not actually supported by data. People who become wealthy from more humble roots, I mean. Also there is no genuine middle class anymore.", "Tell me you’re poor without telling me you’re poor. No one has harmed more people than governments.  You’re just a byproduct", "understandable. from my perspective i took this post as OP being upset that they are constantly mooching off their mom without gratitude and feeling entitled to their money, which is why i don’t think OP is necessarily an AH (although i don’t know what their situation is like) because of that. but i agree that it’s kinda hard to empathize with someone complaining in regards to their financial situation when they are living very comfortably and unaware that others struggle with so much more than just “it’s not fair that they get more inheritance than me” (not implying OP is like that tho).", "Ah. Got it.", "Dude, the best place I rented was government-owned housing. Landlords are terrible in every country I've lived in, which is probably at least four more countries than you.", "Rich people problems who gives a fuck. Why don't you use the money to help people less fortunate you greedy bastards", "ESH.\n\nThis whole family sounds greedy and entitled. Yuck.", "A living person has no heirs.  Your parents can do whatever they want with their money/property as long as they are of sound mind.  It's not up to you to disinherit your sibling/BIL and you're definitely an AH for talking your mother into that.  Whatever beef is between your mother and sister is their problem, not yours.", "Here's s thought, donate the lot to charity and then you can all start from a level playing field.\n\n\nI am a probate paralegal and very cynical about this sort of thing.\n\n\n*awaits downvotes*\n\n\n(Oh, and ESH)", "ESH\n\nY'all sound insufferable", "Does anyone else feel too poor to even be reading this?", "Oh the petty squabbles of the landed gentry", "‘Inheritance is earned’ it’s literally not tho…..", "Homie I just want one home, and like 20k must be fucking nice", "We should get a new tag for \"rich people nonsense\"", "ESH. All of you sound selfish. Your mother isn't even dead.", ">I refused bc imo inheritance is earned\n\n**Unfortunately you're wrong**, in fact of law. Inheritance entitlements are by legal relationship, and, depending on your location, it often doesn't matter if the child is estranged from their parent, they're still entitled to an equal portion of the inheritance. But the deceased wishes will of course be accounted for if they did leave a valid will. But that just means that unless YOU or whoever is left behind after your mother passes to disperse the will as the executor, will have to show **material and objective cause** why your sister should be excluded from the will, and it *can't just be because she's financially irresponsible*.  \n\n\nIf you're in Australia, and you draw up the will to exclude your sister, then you're leaving yourself open for her to bring contest to the courts, which she has case to do. And then can just drain the inheritance in legal fees.\n\nI can't say if you're an A H, but it seems to me ESH, because you all seem entitled, greedy, and lazy in aspects and honestly ignorant of estate law. IANAL, but I've been dealing with my own estate issues and I can tell you that you really stink of knowing way less than you think you do.   \n\n\nInheritance law doesn't work on what you think people should have or what you think is moral. It works on legal entitlements and is neutral towards your feelings on the matter. \n\nIf you really want to be bitter and punitive, go off and let your mother cut your sis out of the will. But brace yourself for going through 1-2 years of financial loss and perpetual headache when she contests the will, which she is fully entitled to do. If you're specifically named as the executor of the will, CONGRATULATIONS, B, you played yourself and you're going to have to deal with that mess directly.  \n\n\n**You don't get to say what's fair, the courts do.** Consult a lawyer and if you, your mother and family really want to attempt to cut your sister off from what she'd be entitled to in intestacy, then you'll lose not only whatever she receives from the judgement but all the legal fees from the fight. \n\nYou're better off, and will lose less money and time, putting the bog-standard entitlements in writing and just making peace with the idea that your mother's \"hard earned inheritance\" will be 1/3rd \"wasted\" by your own family. ESH and it will come back to bite you unless you start *actually* protecting the assets by coming in line with the law. You can't just do whatever you please with inheritance.", "YTA for \"I was gifted three properties\" line alone", "Everyone mentioned in this post should have to answer before a people’s tribunal.", "Read the room man.. we’re all just trying to eat. \n\nAll y’all suck lol.", "YTA for hoarding properties", "Someone book this family a submarine ride please.", "Urgh. Eat the rich.", "YTA. No one is entitled to mum's money. I hate this entitlement in children. You have worked your whole life. FFS, you're 24. You shouldn't even be involved in your mother's will making. How can you even be thinking about all this at your age? My beautiful mother is 78, and I would rather have her for 25 more years than her money. Shame on you. Succession law in most states of Australia allows your sister to make a family provision claim, so this argument is moot anyway.", "Why not start a trust for sister's kids that they get college tuition and get a chunk when they're 30 and the rest at 40-45? That way the kids end up with something that bypasses entitled sister and lazy BIL? That way sis can't complain because her kids are taken care of and she already has property from parents. As a bonus having a delayed disbursement pretty much cuts out SIL and lazy BIL from mooching off the kids? Good luck.", "YTA.\n\nAt the end of the day, it doesnt matter whether you think your sister deserves it or not. Shes your sister and you are purposely stealing what should be rightfully hers. Side note, if you truly love your niece and nephew and want them to still have some semblance of love towards you, you probably shouldnt screw over their mom, who most likely would poison how they feel about you.", "NTA.\n\nEveryone who’s saying wow such first world problems or calling you a spoiled brat has no idea what the hell they’re talking about. Money doesn’t come easy and just because it’s given to you, doesn’t mean that it’s easy to keep. I inherited a considerable amount of money and assets which I was expected to start a business with. I had to prove to my father that I had what it took to have that kind of money. I also made some mistakes in the beginning that I’m still paying for. My sister who had a reputation for mismanaging her money and also didn’t do a lot for the family when we needed her most got considerably less. I don’t understand how people can’t grasp that concept. You work hard and serve your family, you receive a great inheritance to do more and bring honor to the family name. \n\nAlso, inheriting property is a whole different game. It’s not just a lump sum of cash you can tuck away in a mutual fund account and it’s safe. It takes management, maintenance, care, and most importantly, ownership. You can lose it in an instant if you aren’t careful. Someone who does not put forth the effort in matters like this will not be able to manage a property. Even worse, they might just sell it at the first opportunity out of greed. Lastly, sure it’s not OP’s decision as to who gets the property but in times like this, I can imagine it’s pretty stressful no matter the circumstances and it’s important to discuss all of these things together. OP, this is the right thing to do here!", "You're incredibly privileged and absolutely should be selling those properties to first home buyers!! Do you know how fucked the market is right now here?? \n\nThat said NTA, your BIL is a moocher.", "Everyone in the comments getting in their feelings because they hate the situation and can’t fathom that wealthy people do exist. Inheritances exist. Don’t need to be rude to OP just because she’s a part of that circle and we’re not. Put emotional feelings aside and debate the judgment with non-biased fact", "Yeah, I'm going with all landlords are bad; therefore YTA. And seriously, you and your family come across as greedy and vindictive. An inheritance shouldn't be a reward for good behavior.", "This isn't a first world problem. This is getting into 1% territory.\n\nI mean, I don't hate people for having money, but  everyone except the younger brother and father sound awful. It is also hilarious to hear OP call her sister entitled. Looked in a mirror lately? Lmao", "Yeah I got halfway through before deciding that everyone here is so rich that they are de facto assholes.", "I am so fucking happy this is top comment. OP sucks. Eat the rich. I stopped reading after the parents purchased 3 properties each.", "Yep.\n\nYAH - You're All Assholes.\n\nPicking over the bones of your living parents and pontificating as to who deserves it more.  Let your parents be the judge of that, and worry about doing of something of worth within your own lifetimes.\n\nI'd love to be making six figures and have an entire property portfolio for driving my Mom around.  Jesus fuck the entitlement.", "Right??? OP’s mum owns 12 properties! Enough people do that, and it’s no wonder young people can’t find one affordable property to buy that’s not an asbestos-ridden fleahole. I can’t be impartial; none of them need the inheritance money. It’s just padding in their pockets.", "I’m more of the mind set of - it isn’t your will. It isn’t your assets. So STFU and let your mom decide what happens with HER will. Unless her mom isn’t of sound mind, and it sounds like she is, then there is literally ZERO reason for her to give any input at all. Stay out of it. JFC. Totally the AH.", "I agree. I don't know if it's only because my low-income family has nothing to pass down, but any posts arguing over someone else's will is disturbing to me. I can't imagine having a family member die and being concerned with who gets to benefit from it.", "ESH is viable too.", "Yes! Bananas4skail for the win, folks.", "yeah, this is rich people problems. I am too far removed from this experience to even approach it.", "Exactly this, I literally couldn't read the whole way through.\n\nI want to add, I'm first world and this 'problem' is too rich for me. This is a different level beyond 'first world problems'.", "Sounds more like the op is jealous of her sister’s independences and wanted to get the one up on her", "Why does everyone assume we don’t give back to those less fortunate… if I added in that we frequently donate you’d just call BS.", "Wow, I just realized the grotesque, nauseating irony of OP thinking they’ve “earned” more by putting up with rich toxic parent, while sibling should be denied any because she puts up with broke toxic spouse. Holy shit that’s actually a LOT worse than I initially thought.", "I scrolled down specifically to make sure this comment was here. Thank you for obliging.", "I’ve seen similar solutions to this and I agree a new trust is probably the best. I don’t see myself growing old hence I’ve already drawn up my will for my sister’s children to inherit all assets.  ATP, I should  set up a trust of my own so they can inherit my share.", "Hm I never considered that my sister could ruin my nieces and nephews image of me. At the moment my will stands for them (the kids) to inherit all my assets when they’re 21. Unfortunately I won’t be around when they hit this milestone so I’m my mind, as long as I can show them love now and experience that then I don’t mind what happens in the future when I’m  not around. If they hate me as adults that’s fine, I won’t be around to feel that and at least they won’t be empty handed.", "I'm betting OP is the golden child in that narcissistic family structure. Sounds like she's learning to be just as manipulative as the mom.", "I'm poor and my grammar is indubitably astounding. OK, I might be exaggerating, but money does not a bright mind make.", "Hahahaha. Yeah I was once a writer/copy editor for a wealthy person's wife. Money don't buy grammar.", "Honestly, yeah. Extremely disorganized for an alleged real estate tycoon", "Because you're stupid enough to put your problems on reddit in the first place, regardless if it's a throwaway.\n\nCongrats, you got your clout and a bunch of poor people pissed at you, want a gold star?\n\nWhy would you let other people decide for you?", "Where I live inheritances are exempt from divorce assets. Your BIL would not be entitled to the properties if/when they get divorced.\n\nIn fact, feeling “safe” that she will have an inheritance may make your sister more likely to leave him eventually. \n\nI don’t know these people, but it’s common for an emotionally abused spouse to be convinced they “need” the abuser, even if the abuser seems like a loser to you. Your BIL may be an emotional abuser. In which case I suggest you read up on it and what it does to the abused partner. Your urge to “punish” your sister may change as you learn about this.", "But you don't get to decide. What if she sold her inherited property, is that your decision? What if she decided to make them rentals, is that your decision? What if she decides to bulldozed and rebuild, Is that your decision? \n\nThis seems so unloving/heartless/controlling to pre decide what would happen to her inheritance, so you just cut her out because you \"worry\" what she'll do with it.\n\n* I hope your mom is not the executioner. 😆", "BIL refuses to get a job, lives the life of a happy parasite, and happily stole money from his MiL. Pretty hard to feel sympathy for the guy.", "No im not . we don't have insurance for just dental here . its a few hundred a month to go private care", "Not if the mum doesn't want it to. I think the mhm has every right to cut out her daughter if she wants to. She chose to add her husband to the deed and the consequences of that are being cut out of the will.", "Eat the rich is still a thing right?\n🍽", "Only in countries where \"socialism\" is considered bad so people vote against their own self interest.", "What is…dentist? I think I remember that word from my childhood long, long ago.", "So you don't need to reply on this thread then", "Then, why are you here?"]}