{"id": 22220, "submission_id": "14zgxio", "title": "AITA for firmly stating I'm taking time for myself today?", "selftext": "I'm getting married in October. My bride-to-be's bridal shower is on Sunday. Naturally, there is a lot to be done about this, as it's being hosted at my parents' house in their backyard, where I live. My bride and I live with our parents until we move in together after the wedding.  \n\nThe majority of the tables, chairs, kitchenware, dishes, etc. are all set up. People have their dresses and have RSVPed. Everyone who is attending knows when to be at my parents' house and where it is. The tent was built yesterday by a rental company, which I help direct. My bride and her mother are preparing food and things today and tomorrow, as is my mom. I have made it very clear with my bride that I will help how I can, whenever I can. I believe I've been accommodating and helpful and promise to continue to do so.  \n\nAs a hobby, I do creative writing, and had planned on doing it today. I understood that I will likely need to help out today, but my bride said it was okay to take some time to myself to do creative writing.  \n\nThis morning as I was brushing my teeth, my mom came over to the bathroom and told me she had a dentist appointment today and would be busy all day getting ready for the bridal shower. I chuckled at the coincidence and said that I have a dentist appointment, too, today. My mom asked me if I was going to do creative writing at the library today, to which I said I would be for a little bit, and I could help her afterwards.  \n\nShe stated she had a lot to do today, and asked me if I could not do any creative writing today. Which, I clearly and firmly responded that no, I planned out doing something for me today, and that was important. That the bridal shower was not for me at all, and I wanted to give myself some time to myself before I helped out, but still would.  \n\nMy Mom scoffed at my response, which I got upset over, and said, \"Why are you having a reaction to me wanting to do something for myself?\" She responded \"How she wanted to do things for herself too, today, but that we all have responsibilities to uphold.\" I repeated how, \"I'm doing this for me today.\"  \n\nShe scoffed again and stated that \"In a marriage, things for the other person are things for you, and how could I say this isn't for me when it's for my fiancée?\" To which I said, \"Mom, you can do things for yourself today, too, no one said you can't. I encourage you to do so.\" She stormed away, where I stated, \"You did not like my response, and I'm sorry, but you chose to have the bridal shower at the house. We didn't need to have it here if it was too much stress. You offered to help. I will help set up more, but I'm taking time for me today.\"  \n\nWhich my mom responded through half-strained eyes, \"And then this will be the last time I offer to help.\" Which I once again stated, \"You didn't like my response and you chose to react this way.\" She finally said, \"I'd like to stop talking.\"  \n\nAm I the asshole for firmly stating I wanted part of the day for myself and that the bridal shower wasn't for me?  \n\nEdit: Here is more info:  \n\nI planned on spending all day tomorrow assisting in the cooking process in whatever form that takes, decorating the tent, and making the house even tidier than it already was going to be. Today, a professional cleaner was coming by and to deep clean the house, which I was going to neaten up  before my dentist appointment.  \n\nEdit #2: I was going to spend 60 minutes to 90 minutes maximum writing today.  \n\nEdit #3: She wanted me to move a few boxes out of the cleaners way so they can clean, which she only told me after the fight via text, which I have already accomplished as of the moment of writing this comment.  \n\nThe only thing going on is the cleaners today. She wanted no one in the house while the cleaners came, which we are all accomplishing. She didn't tell me about moving any boxes until today, which I gladly would have done yesterday.  \n\nMy mother likes to entertain and the house is already in great condition. I never asked her to have the house deep cleaned.  \n\nEdit #4:  I should have been better and really need to be better. I'm rather sensitive about my writing time, as it's the only thing that I feel I get as alone time.   \n\nI have a lot of deep-seated stress with my mom that goes back a long time. This is just one of many moments where she has tried to control the wedding, my life, my career, etc. I would probably read the author of this as young, as well. She, unfortunately, comes up a lot in my therapy, and, sadly, always seems too busy to attend sessions with me together. I'm not the only person she's fought with over the years, including my father, brother, sisters, aunt, etc. Thank you all for your judgments.", "created_utc": 1689342449, "permalink": "/r/AmItheAsshole/comments/14zgxio/aita_for_firmly_stating_im_taking_time_for_myself/", "score": 10, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Am I the asshole for firmly stating I wanted part of the day for myself and that the bridal shower wasn't for me?\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "I take issue with you claiming that the shower is not for you at all. You won’t be using any of the household gifts or money that will be received? Everything is 100% for her?", "Info: how old are you and the bride?", "You sound insufferable. YTA", "YTA.  Your parents are hosting a bridal shower for you fiancé.  That is a really nice gesture to welcome her into the family, and ultimately is about you too since you are their child, she is your fiancé, and this is about your upcoming wedding.  Is this one day of writing really so critical that you couldn’t have compromised with your mom a bit?", "I need info. \n\nIt depends on what your mother wanted you to do. \n\nThe tent, table and chairs are all set up. \nYou’re not responsible for cooking food. \nDecorations can’t be done today. \n\nSo what did she want you to do?  Bridal shower things or general house things or something else?", "Edited to remove comment because this was meant to respond to a comment not to be a standalone post.  Will repost where it belongs.", "YTA.", "NAH.\n\nYou took some time in a day for yourself, but still plan to help.\n\nShe's stressed, and is looking for help to relieve some of that. I wouldn't call her an asshole either.", "If your bride is ok with you taking a little time, I think you’re good.  Your mom is right that ultimately the shower is for both of you (the gifts certainly will be), but you don’t mention if this is a girls only event or a couples thing.  Was there a specific task your mom wanted you to take over or did she just want you on standby?  The actual event isn’t until tomorrow?  If she just wants you on standby during a prep day, I’d think you were good to do your thing but be available to do a store run if they figure out the need something.", "Yta\n\nA marriage, and all the mini events are about joining of couples and joining of families. As such, the couples and families have their roles and responsibilities.\n\nDoes your mother volunteer for random lady's shower, no? She's doing this for you and your bride. And you're skipping out to spend quiet time instead of helping the whole time like everyone else.\n\nTake some time to yourself AFTER the event...", "NTA. You handled this really well. It's too bad your mom is looking for a fight. Keep an eye on her role in your marriage so she doesn't insert herself and her notions into it too much.", "Nts. You helped and she offered the home. Its very stressful and she could've had it at a venue. She should not be taking it out on you. But in the future just say you do have an \"appointment.\" Because people still think that writing, the arts etc. do not require time for ourselves and it is very important for you and your right to keep your mind healthy and creative.", "YTA. Why didn’t you just tell your mom you needed an hour or two and that you would help the rest of the day. All that BS about the shower not being about you is entitled and bratty. Your mother is trying to support your fiancé and build a relationship with her and her family.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI'm getting married in October. My bride-to-be's bridal shower is on Sunday. Naturally, there is a lot to be done about this, as it's being hosted at my parents' house in their backyard, where I live. My bride and I live with our parents until we move in together after the wedding.  \n\nThe majority of the tables, chairs, kitchenware, dishes, etc. are all set up. People have their dresses and have RSVPed. Everyone who is attending knows when to be at my parents' house and where it is. The tent was built yesterday by a rental company, which I help direct. My bride and her mother are preparing food and things today and tomorrow, as is my mom. I have made it very clear with my bride that I will help how I can, whenever I can. I believe I've been accommodating and helpful and promise to continue to do so.  \n\nAs a hobby, I do creative writing, and had planned on doing it today. I understood that I will likely need to help out today, but my bride said it was okay to take some time to myself to do creative writing.  \n\nThis morning as I was brushing my teeth, my mom came over to the bathroom and told me she had a dentist appointment today and would be busy all day getting ready for the bridal shower. I chuckled at the coincidence and said that I have a dentist appointment, too, today. My mom asked me if I was going to do creative writing at the library today, to which I said I would be for a little bit, and I could help her afterwards.  \n\nShe stated she had a lot to do today, and asked me if I could not do any creative writing today. Which, I clearly and firmly responded that no, I planned out doing something for me today, and that was important. That the bridal shower was not for me at all, and I wanted to give myself some time to myself before I helped out, but still would.  \n\nMy Mom scoffed at my response, which I got upset over, and said, \"Why are you having a reaction to me wanting to do something for myself?\" She responded \"How she wanted to do things for herself too, today, but that we all have responsibilities to uphold.\" I repeated how, \"I'm doing this for me today.\"  \n\nShe scoffed again and stated that \"In a marriage, things for the other person are things for you, and how could I say this isn't for me when it's for my fiancée?\" To which I said, \"Mom, you can do things for yourself today, too, no one said you can't. I encourage you to do so.\" She stormed away, where I stated, \"You did not like my response, and I'm sorry, but you chose to have the bridal shower at the house. We didn't need to have it here if it was too much stress. You offered to help. I will help set up more, but I'm taking time for me today.\"  \n\nWhich my mom responded through half-strained eyes, \"And then this will be the last time I offer to help.\" Which I once again stated, \"You didn't like my response and you chose to react this way.\" She finally said, \"I'd like to stop talking.\"  \n\nAm I the asshole for firmly stating I wanted part of the day for myself and that the bridal shower wasn't for me?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Listen everyone is allowed to take time for themselves. I think the main issue is your attitude toward the shower. She’s probably super excited about it and anxious about setting up, and would love if you could help. Anything she receives gift wise will be yours too. So it is partially about you as well.", "The gifts are for both of us, yes, and frankly ... in the heat of the moment, I probably poorly stated that.  \n\nI made a 3rd edit, if you haven't seen yet, in order to help your judgment.", "I'm not sure why other than if you're judging my post based on my age?", "Thanks for the honesty, friend. This is why I posted here.", "I mean ... I'm absolutely fine helping out today, and, frankly, the amount of writing I was going to be for 1 hour or 90 minutes maximum.  \n\nAnd, I'm ultimately going to spend the majority of the day helping.", "I'm also wondering exactly what it is that is going to have several people busy all day and night when they still have Saturday to prepare?", "Here is more info:  \n\nI planned on spending all day tomorrow assisting in the cooking process in whatever form that takes, decorating the tent, and making the house even tidier than it already was going to be. Today, a professional cleaner was coming by and to deep clean the house, which I was going to neaten up  before my dentist appointment.", "I'm not against this at all, and ultimately, I will be spending the majority of the day helping. No, not everything needs to mark territory, but I do have a very controlling mom, and I really just need and appreciate an hour or so to myself a few days a week.", "Thanks for the input.", "Fair enough, thank you. I've added more information in other comments.", "Here is more info:  \n\nI planned on spending all day tomorrow assisting in the cooking process in whatever form that takes, decorating the tent, and making the house even tidier than it already was going to be. Today, a professional cleaner was coming by and to deep clean the house, which I was going to neaten up  before my dentist appointment.  \n\nIt is a girls' only event that my bride asked me not to attend at all. I am not going to be there, per her request. My bride explicitly stated in a text and in-person: \"I'd rather you do something for you today so I can do stuff for me.\"  \n\nThe actual event is 2 days away, Sunday, July 16th. I'm absolutely fine running to the store and the like.", "Thanks for your input, although that's a gross overexaggeration, haha, and I get I didn't give enough information, although I don't know how I could with limited text.\n\nI have been preparing for this event all week. I took off of work for this. I spent about 6 hours yesterday. Everyone else is not helping the whole time, despite what you may think, and despite what my Mom may have implied.\n\nMy bride and I plan absolutely everything, and have done so since the beginning. I love my mother, my bride, and my future mother-in-law, and have helped and will continue to help whenever I'm needed, beyond actively looking for things to prepare and do.", "Here is more info:  \n\nI planned on spending all day tomorrow assisting in the cooking process in whatever form that takes, decorating the tent, and making the house even tidier than it already was going to be. Today, a professional cleaner was coming by and to deep clean the house, which I was going to neaten up  before my dentist appointment.  \n\nYes, she's already trying to insert herself and use statements like \"Bride should do this,\" and \"This is how we will set things up.\" Which my Dad has tried to tell her to not do.", "Here is more info:  \n\nI planned on spending all day tomorrow assisting in the cooking process in whatever form that takes, decorating the tent, and making the house even tidier than it already was going to be. Today, a professional cleaner was coming by and to deep clean the house, which I was going to neaten up before my dentist appointment.", "I believe I did say this yesterday, but I probably should have said it like you suggested. Thanks for the judgment and keeping me in check.  \n\nAs explained in my 4th edit (this is context, not as excuse), but I have a very strained relationship with my Mom. She and I both have OCD. She's undiagnosed and refuses to get a diagnosis. Frankly, my mom is both trying to foster a relationship with the two families, and also control things as she has throughout the wedding process.  \n\nI've had to talk to my mom at least 6 times that she's overstepping and telling my bride what should be done. My dad has spoken to my mom 2 times, I think.", "Oh, I am super excited for the shower and am currently talking with the cleaners who are here, and then leaving. \n\n\nI've stated a lot of edits that kinda give this a better picture that this isn't really about the wedding/shower/etc. but more so about my mom's continued controlling and overstepping behavior orlver the past 12 months, and unfortunately, I didn't handle it well.", "I suspect that they're asking because while you're not entirely in the wrong for wanting a little time to yourself (I'd probably judge this whole thing NAH, but I'm reserving judgement), your entire attitude and manner of \"speaking\"/writing/presenting your side of things makes you seem very young. At best I'd describe your tone throughout as \"childish and stubborn\" . . . at worst, just plain immature. \n\nHonestly, if you hadn't said below that you're nearly 30, I would have guessed that you were about a decade younger.", "The whole point of this sub is to judge. Why won’t you divulge ages?", "Okay, so why can’t you work with your mom instead of laying down lines?  Ask her what she needs help with today and figure out a plan for when you will get it done that also allows you some writing time.  Not everything needs to a battle and demarcating territory.", "I honestly don't know. Apparently, the decorations are happening tomorrow. I'm in the process of tidying up the house before the deep cleaners come to clean the entire home.", "That still doesn’t tell me what your mom wanted you to do. \n\nDid she want you in the home when the cleaners come since that’s the only thing going on today? \n\nI’m assuming she scheduled her dentist around that appt, since she was the one who scheduled the cleaners, so she was planning on being in the house anyway. \nOr does she want you to be there but didn’t bother to tell you until today? \n\nHonestly tho, deep cleaning the house before a party is a waste. \nThe party is in the yard so the only time ppl will be in the house is to use the bathroom really.", "All this time you're spending reading and writing on this thread could be used for your writing or doing whatever your mom requested. Not to be rude, seriously,", "After reading some of that, stand by the NAH/NTA. I still wouldn't say your mom is an AH. She probably just wants everything to be perfect, and you stepping out bothers her. I will follow up with the \"not my party\" thing as borderline YTA, but moreso if you had a complete hands-off approach.\n\nIt seems mostly everything is managed, and you're not stepping out for an entire day, or absent the day/morning of (where tying up the loose ends up is most crucial).\n\n&#x200B;\n\nEdit: I just read this event isn't even tomorrow, its Sunday. That's 2 days away.\n\nFully NTA.", "Then you’re definitely all good.  Here’s the key…you and your bride have clearly communicated your expectations and preferences.  That’s all that really matters.  \n\nNTA.  You’re not even really taking much time to yourself.  Ironically, you’re doing exactly what your mom wanted by getting out of the house while the cleaners are there. \n\nYour mom is likely stressed.  Not really your issue to solve, but maybe cut her a little slack.  Wedding stuff tends to make people a little crazed.  Hence her getting in a tizzy about some boxes.  It doesn’t sound like you’re angry or anything, just a bit baffled at your mom right now.", "How did that go for him? I bet you already regret having your wedding on her turf.", "It happens. Wedding planning and events are stressful! Sometimes we snap. Nothing you can do but move on. Enjoy the shower!", "Yeah, I thought 20.", "You're absolutely right, and I do understand that. I should have been better and really need to be better. I'm rather sensitive about my writing time, as it's the only thing that I feel I get as alone time.   \n\nI have a lot of deep-seated stress with my mom that goes back a long time. This is just one of many moments where she has tried to control the wedding, my life, my career, etc. I would probably read the author of this as young, as well. She, unfortunately, comes up a lot in my therapy, and, sadly, always seems too busy to attend sessions with me together. I'm not the only person she's fought with over the years, including my father, brother, sisters, aunt, etc.  \n\nThanks for your comment.", "We're both 29. I'm not against divulging anything, dude.", "Sorry about that. I should be more specific.  \n\nShe wanted me to move a few boxes out of the cleaners way so they can clean, which she only told me after the fight via text, which I have already accomplished as of the moment of writing this comment.  \n\nThe only thing going on is the cleaners today. She wanted no one in the house while the cleaners came, which we are all accomplishing. She didn't tell me about moving any boxes until today, which I gladly would have done yesterday.  \n\nMy mother likes to entertain and the house is already in great condition. I never asked her to have the house deep cleaned.", "My 3rd edit explained some of that. I'm not in the house per the request of it being deep cleaned.", "Well, I just hugged it out with my Mom, and she explained she was hurt by the \"not my party\" comment, which I didn't really mean.", "https://www.reddit.com/r/AmItheAsshole/comments/14zgxio/aita_for_firmly_stating_im_taking_time_for_myself/  \n\nMore context.", "https://www.reddit.com/r/AmItheAsshole/comments/14zgxio/aita_for_firmly_stating_im_taking_time_for_myself/jry4grq  \n\nPerhaps this would help? Only the bridal shower is at my parents' house.", "Thank you for the kindness!", "Yeah I thought they were probably 21ish.", "Fair point. I would probably have read it that way, as well. My other comment to the user has more information, if you're curious.", "YTA for your generally combative and immature attitude.", "Thank you for your input. I probably would have read it that way, as well.", "I would agree with that. I could have handled it better, and my history with my mother and her somewhat often overstepping and insertions during the wedding process made me too sensitive.", "Ok so it sounds like there’s a lot of backstory here that contributed to the situation. \n\nSounds like you need to start putting up boundaries with your parents. Next time, say no thank you to her hosting a party if you don’t want her so involved or to feel obligated to give her opinion deference.", "I'll give you more backstory. My dad paid for ⅓, my bride's dad paid for ⅓, and my bride and I paid for ⅓ of everything. My mom hasn't paid for anything. She uses my dad's money, and then, frankly, says it's hers.  \n\nOh, I absolutely tried to set up boundaries, but she insisted because, in her words, \"no one else was going to host it.\"  \n\nShe paid $2,000 of my dad's money (which he seemed kinda upset over) that she didn't need to spend, and I didn't want her to. I would have preferred to have it at a restaurant that cost far less money, which my bride and I would have paid for ourselves.  \n\nMy mom spent the money to mow the lawn, mulch, landscape, and deep clean the house. I have said over and over again to consider my bride-to-be's feelings and opinions, and my dad has explained to my mom that it isn't my mom's wedding. I've talked to my mom about the fact that my bride-to-be doesn't want certain things, and my mom is insisting.", "What do you mean it’s your dad’s money? Am I right in assuming there’s a cultural aspect here?"]}