{"id": 22243, "submission_id": "14zqbg1", "title": "AITA for making my son put a kids float back where he found it?", "selftext": "I will cut right to the chase. Brought my 3 kids to the beach. There was a kid, maybe 12, who had a donut float. He was sitting on the shore with it but got up to go hang out with his father at the picnic table. The waves start coming in and takes the float back out with it. A good 3-4 feet from shore, nothing major. My son, 7, grabbed the tube and starts bringing it back to the shore; at which point 12yo starts losing his shit about my kid touching his float without asking and tells my son to \"give it back\" and walking toward my son yelling. So I look at my son and say \"Ben, put it back where you found it\". He goes \"right where I found it?\" And I said \"yes\". So my son chucked the float back to the exact spot he found it- off shore and in the water. The father in the equation said I'm teaching my kid to be an asshole. I disagree. Respect is earned, not given. My kid did a good deed and the other kid was a dick, so he had it coming. AITA?\n\nETA: the kid knew his float was drifting off. His dad told him it was but the kid just stood there and watched it. That's when my son stepped in to grab it for him. Only then did the kid care about his float.", "created_utc": 1689364464, "permalink": "/r/AmItheAsshole/comments/14zqbg1/aita_for_making_my_son_put_a_kids_float_back/", "score": 415, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I feel like an AH because it could have been a teachable moment but I chose petty instead.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA your son tried doing a good deed and learned the lesson that no good deed goes unpunished. His son learned not to be a little Sh*t and expect people to take it. Good for you teaching 2 children 2 different lessons.", "NTA it sounds like you’re raising a helpful and kind kid who will learn how to deal with other people when they’re being assholes", "NTA you did exactly what he said to do. It’s malicious compliance and I personally love that. He left it where it could float away and that was nice of your son to try and help. If anything the dad should apologize to you.", "NTA.\n\nTeaching your son not to take crap in a delightfully petty way is not a bad thing", "NTA the other kid can kick rocks", "NTA", "Heroes, both of you. That little shit got what's coming to him", ">So I look at my son and say \"Ben, put it back where you found it\". He goes \"right where I found it?\" And I said \"yes\". So my son chucked the float back to the exact spot he found it- off shore and in the water.\n\nHAHAHAHAHAHAHAHAHAHA\n\nOkay, so it was probably not the best response to the other guy being an asshole, and honestly ought to give an \"everyone sucks here\" because you could have just said, \"it was floating into the ocean and my son was rescuing it for you,\" but that's just perfect.\n\nI'll say NTA, even though you really were one, because that's just too funny.", "Top tier parenting. Kid got what he asked for. That'll teach them nothing, probably. NTA, though.", "NTA. The other parent needs to teach his son responsibility and manners, both of which were lacking.\n\nPlay stupid games, win stupid prizes.", "INFO: Did everyone understand the donut had floated away? Sounds like the 12 yr old did not and only viewed it as your son using it.", "No good deed goes unpunished. \n\nNTA, clearly.", "NTA Perfect use of malicious compliance", "NTA- I love this. Your kid clearly understood the permission he was asking and your agreement is epic. It’s you and your son as a team. You proved you have his back. Now the other boy- his entitlement- waiting for someone else to do the work- was supported by his dad. Between the two, you’re doing a great job of parenting. Those boys learned a lesson. One to not be a tool, the other to not let ungrateful, brats bully him.", "NTA, as a father I would've done the same thing", "NTA. It's really a shame that your son tried to do something nice and got yelled at. Some people. . .", "I'd say NTA here, but this is leaning toward 'an eye for an eye' sort of justice. Sure, it's good to teach your kid that he deserves respect from people, but not at the cost of getting him hurt or killed if he comes up against the wrong person in the future, under less trivial circumstances.", "NTA.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI will cut right to the chase. Brought my 3 kids to the beach. There was a kid, maybe 12, who had a donut float. He was sitting on the shore with it but got up to go hang out with his father at the picnic table. The waves start coming in and takes the float back out with it. A good 3-4 feet from shore, nothing major. My son, 7, grabbed the tube and starts bringing it back to the shore; at which point 12yo starts losing his shit about my kid touching his float without asking and tells my son to \"give it back\" and walking toward my son yelling. So I look at my son and say \"Ben, put it back where you found it\". He goes \"right where I found it?\" And I said \"yes\". So my son chucked the float back to the exact spot he found it- off shore and in the water. The father in the equation said I'm teaching my kid to be an asshole. I disagree. Respect is earned, not given. My kid did a good deed and the other kid was a dick, so he had it coming. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA, maybe you or your kid could have said to the other child \"your floaty was being taken by waves; we were saving it for you,\" in case he didn't understand, but if he did and was just being a little butthole, you did the right thing!", "NTA.", "NTA but teaching malicious compliance to your kids is gonna backfire horrifically on you\n\nMC is so petty and embarrassing to read about. So good luck in the future when your son starts doing it to you", "ESH - try teaching your kid tactics to de-escalate tense situations. Your kid was trying to do the right thing. Why not encourage that impulse instead of teaching him to be petty?", "ESH except your son. He did good by trying to help. \n\nThe other kid was being a jerk and would have deserved it if no one went out and got the floater and he lost it. The dad was right, though. You were being petty.", "YTA \n\nWay to throw a temper tantrum over an interaction with a 12 year old dude. You do realize you were supposed to be the adult in that situation, right? Did it make you feel good? Getting your petty revenge on a 12 year old? The child did not ask for your kids help nor did he want it. Teach your kid not touch other people stuff and to ASK is someone needs help (unless they can’t communicate) before he takes it upon himself to insert himself in the situation that has nothing to do with him.", "YTA. . You are teaching him to be petty. You should have spoken to the father of the 12 year old like an adult. If he was half reasonable that 12 year old would have got a talking to. Now he learned to snap is ok, and your son learned being petty and not using words to resolve misunderstandings is ok.", "YTA. \n\nMy guess is the other kid didn't see the waves and just saw a kid on his float thing.  You made your kid be a jerk needlessly", "ESH", "YTA - just give it to the other kid. Why would you be so rude?", "YTA. Why did you let your kid grab the float to begin with? It wasn't his. \n\nAnd what's this bs about respect needing to be earned? *All* humans deserve a baseline of respect. Sure people can earn *more* respect, and can loose respect, but you shoukd respect all life as a starting point abd you should teach your children to respect others. Thats what decent humans do, they respect others, they treat others they way they want to be treated. Put out into the world what you want to get back.", "NTA. Great parenting! Maybe that other kid learned something (but doubtful).", "Are you teaching your son to be an asshole? No. He's just obeying his parent. This in no way means he will make the same decisions on his own.\n\nBut unfortunately, YTA and I think you know it. However... You are a justified asshole. It was a dick move but most people would understand exactly why you did it.\n\nThe 12 year old is also an AH, for what it's worth.", "That was perfectly handled. Nice work, and I appreciate your parenting. Well done, NTA of course.", "Agreed. I’m all for malicious compliance.", "💯. He learned his lesson. Don’t be an asshole because two can play that game 😂", "No, he saw it floating away. His dad actually commented on it floating away but the kid just stood there. That's when my son stepped in to retrieve the float for him.", "Embarrassing? How so?", "God, I love that sub \n\nWhat is embarrasing about it? \n\nWhat do you feel makes it petty?", "Bcuz \"ReSPecT!!1!\"", "No, my son's learned that you don't continue to do nice things for undeserving people. I'm not teaching my son to be walked on his whole life. He was doing a good deed and got slammed for it verbally. In no way will I ever tell my son he has to continue being the \"nice guy\" in those situations. To each their own but that's not us.", "Why reward bad behavior?", "As I said, respect is earned, not given. I'm not teaching my son to be walked on. He was trying to put the float on shore so it didn't drift off and the other kid lost his shit.", "because bending over and taking it is the coolest way to handle people being dicks I think is what they're trying to say", "Respect is earned both directions. Your actions and processes is childish and petty. Also, im not asking you if thaats what you did - its what you did. He was not being walked on at all - a child not understanding a situation and snapping isnt walking on or disrespecting your kid. A real \"nice guy\" communicates, which neither you or your son do well. YTA.", ">As I said, respect is earned, not given.\n\nYou keep repeating this.  \n\nand to a point, I don't agree. But you seem like one of those people who is so concerned about respect that you lose sight of just being a decent person", "I can't believe OP truly believes he's teaching some good morals here. Blows my mind how many adults act like literal children\n\nIt definitely probably looked like OPs kid took the float and a simple \"hey it floated out from the waves he's just returning it\" would've been the appropriate response. And y'know what, I bet the other dad would've understood and thanked OPs kid for the good deed\n\nPeople like this are why we can't just get along", "The stupid kid threw a fit, fuck this pollyanna bullshit."]}