{"id": 2235, "submission_id": "yua0sv", "title": "AITA for not babysitting in an emergency?", "selftext": "I (38f) received a call from one of my really good friends 'Kara' (36f) this morning. She said her husband was in an accident and had to have emergency (but non life threatening) surgery and she wanted me to watch her newborn (like, 4 weeks old) for the 5-6hrs he's in surgery/recovery. Note: Kara's family lives 3 hrs away, her spouses fam is in Florida. \n\nI am disabled due to an accident. I walk with a limp, I can't do anything high impact because my leg muscle won't support it, and even just walking I sometimes fall because my leg gives out for no reason. \n\nBecause of this I told her I don't think it's safe for me to watch her baby. I would be terrified of falling while holding it. I've never had any kids so I don't know how to care for one, though I'm sure I could look it up, but the safety risk to me is too much (to me).\n\nI offered to come stay at the hospital with her and watch the baby up there where she could still help out but not have to worry so much but she got angry and said I was just being a bad friend and trying to use my disability as an excuse because I didn't want to watch her baby. \n\nI feel bad because that wasn't my intention, all I could think of is the hundreds of ways I could accidentally hurt the baby. She finally got a hold of our other friend Cel (who has kids) who's willing to watch the baby but Cel texted me that Kara is still mad that I cost her extra time that she could have been at the hospital waiting. \n\nWas I TA? Like I said I don't really know anything about newborns and how much they need to be picked up or moved around, I was just really concerned about safety.", "created_utc": 1668364665, "permalink": "/r/AmItheAsshole/comments/yua0sv/aita_for_not_babysitting_in_an_emergency/", "score": 36, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1. I might be TA for refusing to watch my friends newborn when her spouse was having emergency surgery \n\n2. I might be TA because it cost her extra time and stress trying to find someone so she could get to the hospital.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nYour friend wasn’t performing the surgery. Waiting at the hospital is not any different than waiting at home.", "NTA. It doesn't sound safe for you to be taking care of a newborn. Not to mention that newborns, while sleeping a lot, can be care intensive for short periods of time. I hope that once she settles down and thinks about it a bit, Kara will be more understanding.", "NTA. Better to wait a bit to find alternate childcare than risk an injury to a baby if you accidentally drop him etc \nShe's stressed out and hopefully once she calms down, she'll come to her senses", "NTA.   Never having cared for a baby is a good enough reason to not babysit.  You also have a disability that makes you concerned you will drop the baby.   You offered to go help with her still around to help and she declined.  \n\nI would give her time.  It may be her worrying that is making her upset easily.", "NTA. She's stressed. Hopefully she'll come to her senses/", "I think your counteroffers were reasonable given the circumstances. She should realize that this was about her child’s safety and not about you being lazy. NTA.", "NTA. This was a safety issue. Her whole “lazy” accusation doesn’t have any merit. If you were just being a “lazy” friend you wouldn’t have offered to come to the hospital and help her there.", "NTA caring for a newborn is hard and you have no experience. Also, it wasn't one of those life or death situations, everything turned out fine in the end.", "NTA.  You have legitimate reasons for saying no and just think about what would happen if you actually did drop the baby.  That would be worse.  Not knowing anything about newborns and having one under your care for several hours would be nerve-wracking.  You came up with a very good solution which was ultimately rejected.\n\nKara is probably scared about what will happen with her husband and is lashing out at you.  I hope that she realizes that you were the best friend that you could be and that you get an apology.", "NTA - even if you didn’t have a legitimate reason, it’s not a small ask (especially with someone with no experience taking care of a child, like me). I would’ve been hesitant to accept either.\n\nIt also sounds like you were willing to compromise to help her, but she wanted it her way and was unwilling to meet you half way.\n\nDon’t doubt yourself. You can apologize for not being able to help, if you feel compelled to, but don’t backtrack on your reasoning, because that was valid.", "NTA\n\nYou weren’t comfortable about caring for a newborn when you have mobility issues. It’s understandable.  Honestly, as much as people want to be in the hospital while family members have surgery, there’s nothing to do but wait. Nurses can call with updates. Patients need to recover before they settle in their room, so she realistically had time to wait for her family to arrive before she went to the hospital. I can understand her wanting to be there with him. I’d chalk in up to overwhelming stress of the situation. Hopefully she’ll get over it and realize you had the best interest of her baby in mind.", "NAH (as of now)\n\nAs a fellow disabled person (RBKA) I lost friends who asked me to watch their kids before I got my prosthetic (I couldn’t maneuver my wheelchair in the apartment I was living then so I rolled around in a doctors stool, unsafe holding a bowl of soup and moving imaging with holding a baby!)\n\nWhen the emergency situation is dealt with, and she come to her senses, forgive her. \n\nBut if she doesn’t she is beginning to see your disability as you being to damaged to remain on her friends list. (Then it’ll flip to N T A)", "NTA \n\nYou had the child's safety in mind and didn't refuse to watch, just wanted to compromise and watch there", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (38f) received a call from one of my really good friends 'Kara' (36f) this morning. She said her husband was in an accident and had to have emergency (but non life threatening) surgery and she wanted me to watch her newborn (like, 4 weeks old) for the 5-6hrs he's in surgery/recovery. Note: Kara's family lives 3 hrs away, her spouses fam is in Florida. \n\nI am disabled due to an accident. I walk with a limp, I can't do anything high impact because my leg muscle won't support it, and even just walking I sometimes fall because my leg gives out for no reason. \n\nBecause of this I told her I don't think it's safe for me to watch her baby. I would be terrified of falling while holding it. I've never had any kids so I don't know how to care for one, though I'm sure I could look it up, but the safety risk to me is too much (to me).\n\nI offered to come stay at the hospital with her and watch the baby up there where she could still help out but not have to worry so much but she got angry and said I was just being a bad friend and trying to use my disability as an excuse because I didn't want to watch her baby. \n\nI feel bad because that wasn't my intention, all I could think of is the hundreds of ways I could accidentally hurt the baby. She finally got a hold of our other friend Cel (who has kids) who's willing to watch the baby but Cel texted me that Kara is still mad that I cost her extra time that she could have been at the hospital waiting. \n\nWas I TA? Like I said I don't really know anything about newborns and how much they need to be picked up or moved around, I was just really concerned about safety.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Nta! Very smart to not take on something that you feel and realize that you can't do. Not wanting to (spontaniously) babysit for a baby does not make you a bad friend, Not everyone is made for that. And her losing her time is on her for not accepting your reply.", "NTA- I was so ready to rip into you because of the title but then you explained the disability thing and it’s clear that you did the most responsible thing AND OFFERED AN ALTERNATIVE SOLUTION! You did the right thing, your friend is just super stressed and not thinking clearly. Hopefully you guys can talk this out. But just know you’re not in the wrong OP!", "NTA, she wasn't the medical professional. She didn't need to rush there. Your point is valid, the baby would not have been safe with you.\n\nBut the real point is, that is not your child. You have the right to refuse custody. Anyone she contacts to ask the babysit is allowed to refuse her if they are either don't want to or don't think they should. And really it sounds like Cel is trying to stir up drama. Because Kara is not saying anything to you, only this middle man is.", "Nta. You were thinking of the welfare of the child. You are absolutely right not to watch the child if you weren't sure you could do it safely.", "Nta\n\n\nShe's showing how ableist she is.", "NTA.\n\nYou are NEVER in the wrong for saying no to any one, no matter what the situation.  Your friend fabricated this whole mess, and I could see her trying to put her child in danger on purpose with you, so she could later try to hold you responsible.  Just a feeling...\n\nAnyway, your friend has no need to even go to the hospital.  What could she have done up there?  Nothing.  It was purely illogical for her to go up there and just wait.  She should have stayed home with her own child and just waited for her husband to be done at the hospital and simply left to go pick him up.\n\nI would terminate this friendship completely with her.  She is toxic and not worth having in your life.", "If you did this to me, I would be upset too.\n\nHealth issues are an understandable impediment, but your friend was obviously in distress, and a good friend should - occasionally - go out of their way, and out of your comfort zone - to help.\n\nYTA", "You’re definitely not the asshole because of you’re disability and your lack of experience in taking care of the baby especially because it’s new born you’re being responsible by saying you’re not capable of doing it! You offered to help differently and you’re friend has no right to be mad at you! If with you’re disability you would fall during holding the baby and there would be nobody else there to help it would be very unsafe. So no not the asshole you’re just being responsible. You’re friend is the asshole for not being understanding!", "Yta", "It was hard to get the exact details from her as she was talking a million miles an hour, but I *think* what I heard was that it was going to be 2hrs before surgery started as they were waiting on a specialist (he broke his arm and messed up something in his shoulder/neck - not sure if something is broken there too but I didn't ask too many questions). She wanted to get up there to be with him before he went into surgery was what I got out of it.", "And that's my thing, I think Cara will, and the poster wouldn't have even known about the best of emotion she had in that moment of stress if Cel didn't go out of her way to message the poster and try to get in her head. Why is this third person trying to start drama?", "It always boggles my mind when people try to force someone to babysit, if I'm not comfortable babysitting, why would you be comfortable with me babysitting?", "That's really what I'm hoping as well. I feel so guilty about it because I know she'd do anything for me, and for the most part I would for her too. This is just one of those things I felt I couldn't physically do.", "But do take with a grain of salt who the messenger of this was. A third party is telling you what she said, not the woman herself.", "OP is not a safe caregiver for a newborn, even in an emergency, and she knows it, she did the right thing. OP's friend would be a lot more upset if OP had said yes and something awful had happened.", "OP is literally disabled and has a hard time walking. The baby is barely a month old  and will need to be picked up at some point. WHY would you want someone who has trouble walking, carrying your defenseless baby around?? If OP goes down so does the baby, possibly ON the baby. Then what??", "I will not give my child to someone who for ANY reason cannot safely take care of my child. That mom had an emergency alright. If Op dropped her child, that will be 2 emergencies. I just have to believe that she is too stressed to think through her expectation of Op right now. \n\nYou on the other hand, I just believe you like the idea of your own sainthood.", "No need  to feel guilty  you did  the best for the both of you : you and the baby. \nNta"]}