{"id": 22365, "submission_id": "150z94c", "title": "AITA for taking away some privileges because my kid stole his aunt's medication?", "selftext": "This week my sister came over to visit us. She lives out of state so she stayed over for a few days. I have two kids, “George” (13m) and “Roger” (17m). During dinner George said he didn't feel well so I let him be excused and he went upstairs. I went up to check on him and he said he had a bad headache, zo I made him chamomile tea and sat with him for a little while until he seemed to be feeling better.\n\nLater when Roger was helping me wash dishes I asked him how George was doing. He said he'd thrown up but he felt better and that he'd taken something for his headache and fell asleep. We don't keep meds in the house so I knew immediately the “something” must have been my sister's medication.\n\nI confronted George about it and he confessed he had stolen one of his aunt's pills. I expressed to him that I was disappointed in him for taking something as important as medication without asking for permission first. I told him he needed to think about what he's done and that he was going to be grounded with no video games for 3 days.\n\nHe was annoyed and called me mean. My sister said it's just one pill and not a big deal; however, I don't want my son to even get into the habit of stealing something as important as medication and just 3 days grounded/no video games is nothing in the big scheme of things. I don't think it matters that he's mad at me, it's only temporary after all. That said I can be insecure in my parenting at times and I'd like a few other opinions that aren't biased. Was I the asshole for how I handled this?", "created_utc": 1689490790, "permalink": "/r/AmItheAsshole/comments/150z94c/aita_for_taking_away_some_privileges_because_my/", "score": 126, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > My son stole one of his auntie's pills so I took away some privileges for 3 days. I could be the asshole because my sister didn't think it was a big deal.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Fellow parent here. YTA. Your son was throwing up and your solution was “chamomile tea” because “we don’t keep meds”. It sounds like he wanted the benefits of modern medicine and taking his aunt’s pill (she didn’t mind) was the only way to get it. He doesn’t agree with your values and that seems to be what you’re really punishing him for not “theft”.", "Question: why do you not have any medication in your house?", "Maybe get rid of the folk-remedies and keep some actual medication in your house. No wonder your kid went looking elsewhere; what you supply is no help to anyone. YTA.\n\nYou sound like the kind of loving mother who's going to have a melt-down when you learn he went behind your back to get himself vaccinated.", "YTA. The one line about not keeping meds in the house is worrying, as is that your first reaction to a bad headache was tea. You have intentionally avoided mentioning what the pill was, and assuming it was something like paracetomol or ibuprofen, the more telling thing is that your kid felt like he had to steal something like that to get relief from his pain over any other option.\n\nBehaviour like this doesn't happen in a vacuum, and that you don't keep basic medication in the house makes me think something in your attitude towards medication has caused your son to come to the conclusion that stealing it from someone is easier than just asking you for some.", "YTA.\n\nYou are not TA for reprimanding George or grounding him for taking your aunt's pills, ~~which are presumably prescription medication~~ \\[UPDATE: they weren't. They were OTC. See below.\\]\n\nIt is a terrible idea to steal someone else's meds, especially when he's only 13, probably doesn't even know what they're for (they're not necessarily painkillers), and almost certainly has no idea of what the contraindications or side effects might be. You don't say whether you impressed upon him how dangerous that is.\n\nAll you said was you are \"*disappointed in him for taking something as important as medication without asking for permission first*\". If that's **all** you said - i.e. the only reason you're mad is that he didn't ask permission - then that's weak as piss, and you get an asshole point for that.\n\nBut you get an even bigger asshole point **for creating a situation where he needed some pain relief and you provided nothing he could safely use**.\n\nYou said \"*we don't keep meds in the house*\". Why the fuck not? You should have OTC meds in the house, such as a mild painkiller for headaches. All you gave him was chamomile tea. Poor kid, it obviously wasn't effective enough, and he had nothing else. He was probably desperate for some relief. What he did was wrong and very unwise, but you created the situation where he felt he had no choice. Take responsibility for that. Go buy a packet of Tylenol, FFS.\n\nEDITED TO ADD: When I wrote the above comment, OP had not yet said what type of medication it was. Many people, including me, assumed it was a prescription medication. It was not. OP wrote in a comment, since deleted, that it was an OTC med.", "Info: what kind of “pill” — otc, prescription? If prescription, what kind? Is there otc medication in the house? Chamomile tea doesn’t really do anything for a “bad headache,” does he get these often?", "Yta - you've put your kid in a position where he has to steal because he can't get necessary medication. \nAn over the counter medication: Tylenol, paracetamol ibuprofen etc is not even stealing. It's something that should be freely available and offered. If your kid had asked his aunt she would have (should have) said yes without hesitation. He couldn't ask because of you.\nYour son didn't steal prescription medication, that would have been different.\nLots of people keep over the counter meds in bathroom cabinets so people can help themselves.\nYou're also medically neglectful by denying your kids proper medical care.", "YTA.You don’t keep meds in the house?Where I live your children can legally go to the doctor on their own, and get prescriptions for meds.Yet you won’t even let them have a Tylenol and they feel compelled to steal/borrow it from your sister?\n\nMan… these ‘kids’ are going to grow up fast and move out the day they can. And then buy a box of Panadol and never have to drink wet grass tea again to cure a headache that brings on vomiting (migraine?)!  \n\n\nINFO: What was the med? That could make me edit and change… if it was a restricted drug of course you aren’t the AH then… but if it was something over the counter..?", "INFO or more likely YTA \n\nI can’t tell if you’re keeping pain killers away from your kid. I also don’t know the extent of how you might excuse your kids away from company. The language you used makes me feel like they can’t go to you when they might need you. \n\nI’m leaning towards YTA because your kid wanted relief. Stealing was a byproduct of a situation wherein your child wasn’t receiving the attention or care they needed. \n\nMaybe your child was really suffering. Why didn’t you, personally, check in on them? \n\nYour punishment isn’t harsh but who cares. You punished a kid who was seemingly desperate for help. \n\nBehaviors exist for a reason. This kid sounded like they were desperate for relief. So they did what they needed to do. \n\nIf stealing medication becomes a habit then you have a problem. Right now it seems like you should probably have a more respectful and trustworthy relationship with your child so they don’t resort to desperate situations again.", "INFO: What was the medication?", "INFO: What was chamomile tea supposed to do for his headache? And what do you mean you don't keep \"meds\" in the house? Do you not believe in them or something?", "YTA\n\nSo you're failing to provide your kids with adequate healthcare, and want to punish your child for taking care of themself? Tea ain't doing shit for a migraine. There is no reason that your kid should be *throwing up* from pain under your care. You're failing as a parent. Do better.", "YTA\n\nI kinda understand not having medication on the house, but the minute your child is suffering you should get out of the house and buy some OTC tylenol at minimum. A chamomile tea will not work into decreasing a headache so strong as to cause a child to puke.\n\nThat said, I'm left wondering here if you trying to adress a medical issue with your children with a tea instead of medicine is something new, or if this was the first time your ignored your children's suffering in lieu of your own convictions.\n\nYes, it's not OK for your children to steal, but if you aren't taking care of them properly, they are not the ones to be blamed on.", "YTA WTF get some meds", "Wow, \n\ni don’t even know where to start. You are not keeping medication at Home ?\n\nlet me tell you , as someone with real migraines, just reading this make me so angry.\n\nibuprofen is the only thing that works for me, otherwise I will find myself shaking in the dark trying not to throw up.\n\nThat your son is throwing up tells me he is in the same team and in can’t believe you gave him chamomille tea and let him suffer as if pain was a magical cleanser. You prefer let your son go through that level of pain rather than provide a simple pill.\n\nthat he had to steal and be punished for.\n\n&#x200B;\n\nparent of the year\n\n&#x200B;\n\nYTA\n\n&#x200B;\n\nYTA", "INFO What sort of medication was it? If it was Paracetamol or equivalent then that's on you for not having it in the house. Although, ideally he should have asked because it's his aunt's property. \n\nAnything stronger than that is potentially dangerous and you should come down on him like a  tonne of bricks. Especially, if it was prescribed to her.", "INFO: It depends… is this a Tylenol or a narcotic we’re talking about? Because the fact that you didn’t reveal what the pill was tells me it was probably Tylenol or something along those lines.", "Info: why do you not have sny medication in the house? Especially something as simple as an OTC pain killer? \nAnd what kind of medication did he steal?\n\nIt sounds like you could have prevented this if your answer to all ails/aches wasn't chamomile tea.", "YTA", "YTA for punishing your child for seeking relief when you refuse to provide it to him.", "With the given information, NTA. Like duh, taking anything without permission is bad. But taking PILLS without permission? That’s scary. \n\nThat being said, I make that judgement with some trepidation…I do question why your son had no other option than chamomile presented to him for a “bad” headache. It sounds like chamomile tea wasn’t going to cut it and he felt he needed something stronger. I’d be interested to know what medication he stole from your sister (Tylenol, Motrin, aspirin, opiates, something else) because I think context matters here. If it was something more innocuous like an OTC NSAID I’d be more concerned as to why he felt he *needed* to steal it. If it was something harder like OxyContin or Percocet, that’s a different conversation. \n\nIf you’re not providing him with safe options for pain relief outside of tea, YTA. But I’d appreciate some context.", "NTA, this is very bad behaviour if they don't know what the pills mean. However also;\nNAH, if they know what the pills do and are familiar with it. E.g. if it's just an ibuprofen there wasn't really any harm done. However you had no way of knowing it.\n\nIn general it is wise to keep some off the shelf pain medication (and indigestion medication) in the house anyway.", "NTA. Your position on not keeping meds in the house is worrying, but taking medicine from another person without permission is nevertheless extremely uncool, and you have managed to keep the focus on the theft without veering into antimedical nonsense.\n\nNevertheless, I am forced to question who you don't have some basic headache medicine on hand.", "NTA.\n\nDon’t take medication that might make you sick and deprive the prescriptee of their drugs.\n\nThis is a lesson he needs to learn.", "STEALING EVEN ONE PRESCRIPTION PILL IS A CRIME. Better nip that one at the bud. And people, you need to hide narcotics from your kids because we are all idiots at that age. \n\nI hid my narcotics from a visiting nephew based on intuition. He went home to Mom, stole her meds. Got caught selling them in a park to other kids AND GOT ARRESTED. \n\nDon’t take this lightly unless you don’t care if your kid becomes a DRUG ADDICT.", "NTA : Kid stole", "NTA.  This should be a big talking point for both kids about taking any type of medication without getting approval or at the very least asking if it one can take it.  Taking pills could be deadly if he takes the wrong ones.  I strongly recommend you sit with him and talk about why he shouldn't have taken the medicine.  Unfortunately, this could lead to him thinking it's OK to just take people's pill and surely do not want to go down that road .  He needs to know it is a big deal.  Aunt needs to zip it and let you parent your child. Seems like it may not be the first time he's taken aunties meds or she's given it to him w/o you knowledge.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nThis week my sister came over to visit us. She lives out of state so she stayed over for a few days. I have two kids, “George” (13m) and “Roger” (17m). During dinner George said he didn't feel well so I let him be excused and he went upstairs. I went up to check on him and he said he had a bad headache, zo I made him chamomile tea and sat with him for a little while until he seemed to be feeling better.\n\nLater when Roger was helping me wash dishes I asked him how George was doing. He said he'd thrown up but he felt better and that he'd taken something for his headache and fell asleep. We don't keep meds in the house so I knew immediately the “something” must have been my sister's medication.\n\nI confronted George about it and he confessed he had stolen one of his aunt's pills. I expressed to him that I was disappointed in him for taking something as important as medication without asking for permission first. I told him he needed to think about what he's done and that he was going to be grounded with no video games for 3 days.\n\nHe was annoyed and called me mean. My sister said it's just one pill and not a big deal; however, I don't want my son to even get into the habit of stealing something as important as medication and just 3 days grounded/no video games is nothing in the big scheme of things. I don't think it matters that he's mad at me, it's only temporary after all. That said I can be insecure in my parenting at times and I'd like a few other opinions that aren't biased. Was I the asshole for how I handled this?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA if you were doing it because he stole. YTA for not providing medication so your child felt he had to resort to stealing to get relief from being sick.", "YTA\n\nHaving basic over the counter meds on hand for children is common sense. Your child having a severe enough headache that they are vomiting is inexcusable that you would treat it with chamomile tea. \n\nYou forced your child to need to steal a basic over the counter medication to find relief.", "YTA. Your mom Facebook pages that don't believe in modern medicine are brainwashing you.", "YTA. Majorly. For not keeping otc medication in the house. People like you are medically neglecting their child. It’s disgusting. YTA for creating a situation in which he had no way of getting adequate help except to resort to stealing.", "YTA. Headaches are very painful and debilitating and require actual medication not just tea. You put your child between a stone (suffering without relief) and a hard place (stealing medication and taking it without the guidance of an adult which could have been dangerous). \n\nOn one thing we agree. Spending 3 days grounded is nothing in the big scheme of things... In the big scheme of things what matters is that you should give your children access to doctors, modern medicine, and meds.", "Or wanked…", "It was an over the counter med. Not a prescription. op mentions it in a comment.", "Op commented, then deleted, the\"stolen\" medication was over the counter.\n\nAnd op says in the post there are no medications in the house.", "She commented that it was over-the-counter.", "[deleted]", "OP said and then deleted, that it was an ober the counter med", "Op commented that it was over the counter. Then deleted it.", "Apparently it was over the \"over the counter but very strong\" (OP deleted his comment LMAO)", "Op mention it was over the counter. This isn't a prescription or anything.", ">deprive the prescriptee of their drugs.\n\nOP said in the comments that it was an OTC medication, and in the post that they don’t have meds at home. My guess is that OP doesn’t allow the kids to take medication, so the kid felt like he had to steal to treat the headache.", "The mom apparently refuses to let her kids have Tylenol or Advil or anything otc when they are sick and the kid “stole” some Tylenol, lol. Poor kids, all they are allowed when vomiting from headache pain is “chamomile tea,” apparently\n\nEdit: and not Tylenol w/opiates or anything prescription, just plain over the counter", "It was apparently an OTC medication, not prescription (OP commented this then deleted the comment once he started getting blasted LMAO)", "It was an over the counter med, not a prescription.", "So a simple pain or fever med, a basic stomach Gastro Stop or similar.\n\nOP is YTA for sure. These meds are largely non dangerous, and ~~children~~  all humans deserve to live pain free…", "Where? I’ve looked on her profile and there are no comments.", "\"Over the counter but very strong\" is a contradiction.\n\nAnd in any case, it doesn't answer the question. You were asked what the medication was. Why are you avoiding the question?", "Okay yeah NTA for telling the kid not to steal, but totally the AH for not providing adequate options for pain relief. I get terrible headaches where I end up throwing up and chamomile tea ain’t do shit. Get on that Excedin Migraine train, op. 👌🏼", "Op deleted it after several negative comments /reactions to this revelation.", "It was deleted", "If OP doesn’t answer I’m assuming it was like Tylenol or Advil in which case OP is absolutely the AH", "It sounds like the sister who he 'stole' from didn't even mind, and it's probably a situation where she would have said yes if he asked for it, but he couldn't ask because OP would rather her child puke from the pain of a headache (also note OP called it a headache, probably doesn't \"believe in\" migraines) than let him take medicine which has been thoroughly tested and proven effective.", "Yep. I'm sensing evasion here, and that always makes me suspicious.\n\nIt's human nature when posting to AITA for a narrator to tell the story in the way that reflects them in the best possible light. Which is why **facts matter,** rather than subjective opinions or vague terms that can be interpreted in different ways.\n\nIf OP says \"they were very strong\", and emphasizes the \"George stole them\" part of the story, then the collective AITA readership assumes it means prescription meds and gasps in horror, both for the dangerousness of the act, and the wrongness of it. I assumed they were prescription meds, when I gave my verdict elsewhere on this page.\n\nBut if they were over the counter meds, and moreover, they were exactly the kind of painkillers that people routinely take for a headache, then George's act becomes much less dangerous, unless he has an allergy, and his only crime was in taking something that didn't belong to him. (And for which I still have great sympathy for him. Poor kid, he was probably desperate for relief.)\n\nThe only way for us to know for sure what the truth is would be for OP to name the medication. Which OP seems surprisingly reluctant to do. I'm suspicious.", "Even if it’s extra strength something…AH", "YTA, you sound like an anti-vaxxer mom who'd rather have their kids get polio than trust modern medicine. Tea, really?", "YTA\n\nI started getting migraines right around 13-14 years old and yes there were plenty of people telling me that I was \"too young\" to be this sick and taking painkillers. Their solution was to take some rest, worry less and exercise more🤦 thankfully my parents were the most sane people in this scheme so I always had access to my precious ibuprofen.", "What that kid had kind of sounds like a migraine. If it was, denying him medication is absolutely barbaric. YTA.", "Yta. It sounds like he had a migraine. I don't have prescription meds for those unfortunately because the 2 ibuprofen and 2 excedrin migraine only bring it to tolerable levels for me. That crunchy granola shit you're doing isn't cutting it. Stop being a shitty mom and help your kids. What you're doing is abusive and needs immediate correction.", "YTA and if you keep acting the way you are you will find that your kids will hide more than just meds from you.\n\nI use folk remedies in conjunction with OTC medicine. For example, sore throat I will have a spiced ginger and honey tea, but I will also take some paracetamol for the pain.\n\nHeadaches and migraines are absolutely horrid and chamomile tea will not help alone. Please see an actual doctor who might be able to prescribe migraine specific medication or at least give him something for that pain.", "YTA.\n\nYou are the TA for punishing him, and you are TA for not having medicine for headache. As a parent you should be providing everything necessary for your son's health. That said it seems like your son was in a lose-lose situation that you created.", "YTA, obviously you should have dipped his earlier in olive oil while rubbing his feet with garlic. Everyone knows that's the proper treatment.", "YTA. Medicine exists for a reason you can’t just Tea a headache away", "YTA\n\nHe shouldn't have taken the medication but your response was controlling, excessive, unkind. What gives you the right to impose imprisonment on your child?", "~~INFO: Which medication was it?~~\n\nYTA. Why would you want your child to suffer instead of taking a common, safe OTC medication?", "INFO. What kind of pill was it?\n\nIf it was an OTC analgesic like aspirin, Tylenol/paracetamol or Advil/ibuprofen, then Y T A. These should be kept available for headaches and minor pain.  \n\nIf your kid stole a narcotic or otjer controlled substance, then N T A because that’s a slippery slope.", "YTA your kids already being punished if he's sick get him medicine.", "YTA\n\nVery troubling the kid lied and stole pills. The \"no medication\" thing in your home makes me wonder if he's curious and experimenting.\n\nYou need to actually teach your kids.", "Please, I'm not gonna scream that you are an asshole but just read this.  \nYou did well to punish him, but not keeping meds in the house? Your child felt so bad that he stole meds from his aunt.  \nI'm all for avoiding meds when you can, but seriously you're putting your kids health at risks. As much as I wish tea could fix things, you are teaching them they have to steal something in order to get better. \n\nNo one is a perfect parent, the fact you punished him shows you're better than a lot of parents out there.  \nBut for the love of god, that your child's health more seriously, you will never forgive yourself if something happened to your kids because they snuck around taking meds they weren't used to.\n\nTo help with sore tummy after throwing up I suggest some lemonade and gingernut biscuits. My mother taught me that trick to avoid painkillers after I had been sick.   \nPlease please look into safe meds for your family though.", "NTA for teaching your son that stealing is wrong and asking permission before taking something from someone is a must. AH for making your son steal to help him with his headache. You could have bought him some paracetamol in addition to the chamomile tea you gave.", "NTAH- taking medication not prescribed for him is dangerous- and in some cases can result in deadly consequences. Medications and dosages are prescribed for the person based on weight, known allergies, specific medical conditions. A dosage correct for your sister may be an overdose for someone smaller, or that is not accustomed to the medication - accidental od’s happen every day- many times with deadly consequences. \nYou definitely should not second guess your discipline in this- he needs to understand how badly this could have turned out and that he should never steal or take ANY medication gotten from someone other than a Dr treating him or by you - his parent. Not even Tylenol or Motrin. \nGood job Mom!", "Unpopular opinion … gonna say NTA for grounding bc regardless if it’s Tylenol etc if y’all don’t take medication he doesn’t know what he may be allergic too and that could have ended bad . Taking medication is serious and all these Y T A votes are ppl who clearly don’t understand the seriousness of it ! Anything could have happened \n\nOn another note I think you need to get some medications for you kids when situations like this occur bc not everyone can deal with a headache ( sickness ) the natural way !", "NTA. These people are out of their minds.", "YTA - Your kid stole because your refusal to use modern medicine has become harmful.", "YTA here, this kid needed relief that you were unwilling to provide. It sounds like he may have been having a migraine and you only gave him tea, poor baby. No wonder he felt like be needed to steal. He already came to you and you had a bullshit bandaid that didn't touch the issue at hand and he was in pain! I believe it's time for you to reevaluate yourself and instead of saying no medication at all, teach your boys how to medicate responsibly and how dangerous it is to not understand the side effects of certain medicines. You were the catalyst for this happening", "stupid anti science weirdos who don't believe in perfectly safe stuff like advil are always YTA and shitty parents", "YTA. YOU are the problem. Why don't you have meds in your house for something like a headache?!  You have put him in the position of having to steal because you are not looking after him properly. Sounds like he had a migraine and you gave him tea? SMH.", "That said, what exactly did this boy steal? Was it just paracetamol or was it morphine or codeine? He needs punished but the op also needs to get with the times and have suitable medication for his son in the house.", "[removed]", "I was thinking the same. A headache that makes you", "OP doesn't even have to get rid of the folk remedies, some are great IN ADDITION to conventional medicine. YTA OP", "I was thinking the same. A headache that makes you vomit isn’t just an ordinary headache. However, I am allergic to chamomile and I puke within 1 minute of drinking it.  That thought did go through my head.  Apparently it’s not a rare allergy.  But FFS this woman needs to have some proper medications on hand.  What happens if kid has a fever?  Does he get peppermint tea for that one?", "OP commented that the tablet the boy took was an over the counter tablet.\n\nWhen OP got even more criticised, they deleted that comment.", "While you are correct in stating that stealing medication (especially when you don't have knowledge of dosage) is wrong and dangerous, we should probably consider why the kid felt the need to take it in the first place. OP commented that it was an OTC medication and then deleted it. The kid was in so much pain that he was vomiting and OP wouldn't give them anything more than tea to alleviate the pain. At 13, this child is old enough to be informed of the risks of taking OTC medications and take it to alleviate pain (at the proper dosage) if they so choose. He felt like he didn't have any other choice, so he took it from someone he trusted- his aunt.", "Some OTC patent medicine. Nothing that required a scrip, according to a message the OP deleted.", "Where? On OP profile there are no comments..?", "I know. I saw. I responded to OP's comment, and then OP deleted it.", "Would be helpful to have clarified the Tylenol issue. Hard to discern with all the drama going on here. Sympathy seekers?", "OP deleted it because on negative coments.", "I’m going “extra strength Motrin”.  Of course it’s very strong! It says so right in the name!", "Oh thx ^^", "YTA get a grip.\n\nVomiting with a headache = migraine \n\nAnd you expect some herbal tea to fix that? Let me guess, you're anti-vaccine, too.\n\nAs a migraine sufferer, I think my comment might get deleted if I express myself the way I want to right now.\n\nYou forced your child to steal (presuming she didn't give permission, knowing his situation), rather than suffer. Great parenting there.", "YTA - for all the reasons others have said. Really annoyed me you made it sound like prescription meds, in which case anyone would be worried due to potential serious side effects but no - it’s OTC. \n\nAre you aware that chamomile tea can actually aggravate some people with headaches & sickness? \n\nYour child shouldn’t really have taken without asking as even an OTC may not have been suitable for him, but he was obviously desperate and it is absolutely ridiculous you couldn’t give him a paracetamol or whatever for his headache. Shame on you OP and your punishment is way over the top!", "I feel so sorry for children raised by the batshit insane. YTA for subjecting your children to abject misery in the name of pseudoscience.", "YTA - 'We don't keep meds' is exactly why I ended up in the hospital as a kid because my parents didn't believe in Ibuprofen or fever reducers. Welcome to the modern age.", "You’re the type that thinks your google search is more accurate than a doctor who has spent over a decade educating themselves on the subject, aren’t you?\n\nYou’ll be lucky to hold your grandkids at this rate hun.", "YTA. Your son had a migraine attack and you offered him tea??? Get him the proper medication and take care of him properly. You sound like a nightmare. Never downplay someone else's pain and educate yourself properly on how meditation works. Not everything is addictive or gets you \"high\". If someone denied me my medication during a migraine attack there would be hell to pay.", "YTA. I was going to go with e.s.h. here because prescription meds are potentially dangerous, but according to other comments, you wrote and then DELETED that it was over the counter medicine. So... You are an asshole who lets your kids suffer avoidable pain because you have some kind of control issue, or you think the millions of people who rely on basic otc medicine every single day are idiots and you're better than them. Or maybe you're just broke because you spend all your money on chamomile tea. It doesn't matter WHY you do it, really. What matters is that YOUR KIDS DON'T DESERVE TO SUFFER BECAUSE OF YOUR ISSUES. Get some therapy.", "You are horrible parent. Probably antivax too. Stop neglecting your kids. You must have pain killers at home. YTA", "Yep, YTA. Scrolled through the comments to see if my one biggest question was already answered, and it was.\n\nYou were being PURPOSEFULLY vague on what “pills” he took. You were PURPOSEFULLY being misleading because you KNEW the ONLY way you’d not be TA is if they were prescription meds.\n\nLady, do you know where the basis of aspirin comes from? “Native Americans chewed willow bark to soothe aches and pains. The active ingredient in the bark is salicin, a chemical that in 1897 formed the basis of the discovery of aspirin, the most commonly used drug in the world.”\n\nIf you’re gonna drink the koolaid, do some damn research.", "info: what was the medicine he stole? \n\nIt's not right to steal medicine, but if it's headache medicine I don't think that is a big deal.", "YTA. Not for the punishment but what the hell. Your son had a headache where he was throwing up, he had a migraine and you gave him chamomile tea. WTH, that is cruel. Next time give him some essential oil to take away his pain. \n\nWhat pill did he take?  You didn’t seem to show concern over that, I carry 500 mg naproxen in my purse, for a child that would be way to much. Other things I carry would more than likely require an emergency room visit (I have chronic condition).  So it sounds like he took. OTC pill. \n\nIf your child is getting headaches, please take him to a Dr to get checked out.", "George threw-up, but you only found out when you asked his brother. Your 13 year-old did not come to you when vomiting - ask yourself how that happens. Why are you more concerned about him \"stealing medicine\" than the fact that he doesn't tell you he is that ill? 13 year old kids don't get headaches and throw up unless there is something seriously wrong. Camomile tea isn't a solution, it's child endangerment.\n\nWhat was the \"medicine\" he stole anyway? Paracetamol? 5c a tablet? OMG\n\nYTA", "INFO: What medicine did he steal and why did you give him chamomile tea instead of medication yourself?", "NTA for grounding him for taking things without permission. Nobody should be touching anybody's anything without permission, especially medication. The boy might not have known he's allergic to an ingredient in the meds. YTA for the handling of your son's symptoms: headache, I can understand the wait and see approach, but followed by vomiting? Sounds serious. Did you call his pediatrician?", "YTA your son was suffering and resorted to “stealing” to relieve his pain because you refuse to keep proper medication in the home. Severe head pain/vomiting could indicate migraine, take him to a doctor.", "YTA. Why would he ask when you would obviously say no? Maybe he could have asked his aunt, but he might have been afraid she would say your rules had to be followed. \n\nAnd you gave him chamomile tea! For a headache. Number one, no tea by itself will make a headache, especially a migraine, go away. Second, while again, it should not have been your only response, mint tea at least helps with an upset stomach (personal observation). And aromatherapy blends marketed for headaches are always mint based. \n\nPlease don't blast me for the aromatherapy info, I am not advocating for it, just passing the info along. Teas, aromatherapy, prayer, laying on of hands. None of these should be the primary therapy for any physical or mental illness. While there are absolutely exceptions, for the most part, these are harmless, just pair them with modern medicine instead of going 100% medieval.", "NTA for grounding your child for stealing medication (he could have easily taken anything without knowing) \n\nBut YTA for not actually providing the medication yourself for them.", "INFO: Are we talking about Ibu or Oxy? That's a huuuuge difference.", "YTA\nGod it's absolutely frustrating when I see parents using little tidbits, for lack of a better word, instead of giving their kids simple medicines.\n\nI understand that they're worried about the possible side effects, but it's not worth your kid being in pain.\n\nThe way you kept talking about it, I honestly thought it was some sort of prescription medication, but it was just some OTC ffs.", "[removed]", "[removed]", "[removed]", "[removed]", "[removed]", "They're probably going to keep stuff like that in their locker at school or hidden somewhere mom won't find it once they can. Poor kids. I can't imagine letting my kids suffer. Natural remedies are great and all, but if they don't work you need to resort to medication that does and/or go to the doctor.\n\nYTA", "Yeah, the update changes things a bit. I don't think it can reasonably be considered \"stealing\" if it's just ibuprofen or acetaminophen!", "Seriously. The least serious reason for headache with vomiting is migraine. Migraine is a horrible debilitating neurological disease. One that is not helped by chamomile tea. How often does this kid get headaches and how often do you ignore him?\n\nAs someone who started getting migraines as a child and did not have it taken seriously, big fat YTA. Did you even ask your kid about his pain?", "Chamomile tea is also pretty much the last thing I'd think of when someone complains about headaches. Against the vomiting, alright, but that stuff is so nasty, it is more of a punishment to me than a treatment to me. I can't imagine that a teenager enjoys herbal teas.", "[removed]", "[removed]", "It should be NTA, really. While she should have kept ibuprofen in the house, it should be true that minors should not take any possible dangerous meds, unless desparately needed and when that happens, it should be very strictly controlled.", "Because he was suffering badly and no one was helping him.", "Seriously. If this was a migraine (and it sure sounds like mine) even ibuprofen 600mg does nothing for me. Chamomile tea???? I would probably just vomit sooner", "[Bot](https://old.reddit.com/user/CalmClock5874) stole [this](https://old.reddit.com/r/AmItheAsshole/comments/150z94c/aita_for_taking_away_some_privileges_because_my/js6mrit/)", "And you owe me one keyboard! Thank you for the morning mirth!", "Flat coca cola also helps against nausea. Just like ginger tea if eating os a challenge.", "[Bot](https://old.reddit.com/user/ApprehensiveAge3412) stole [this](https://old.reddit.com/r/AmItheAsshole/comments/150z94c/aita_for_taking_away_some_privileges_because_my/js6hc18/)", "[Bot](https://old.reddit.com/user/MinuteJudgment2339) stole [this](https://old.reddit.com/r/AmItheAsshole/comments/150z94c/aita_for_taking_away_some_privileges_because_my/js5ylwl/)", "His mom sounds like the type that goes for natural treatments.  As a person who has lifelong migraines, that don't work!!", "Well, technically it's still stealing, because it belongs to his aunt. (Who actually sounds like a nice person, and I'm fairly confident she would have given a couple of pills to George if he'd asked her. I'd have given it to him in a heartbeat, if he'd come to me.)\n\nGeorge does need to learn that he can't go rummaging through another person's stuff and taking what he wants. That was wrong, and as I said, potentially very dangerous if it had been prescription meds rather than OTC.\n\nBut when we're assigning degrees of asshole-ness here, George is only the tiniest bit to blame. That poor kid. My heart goes out to him. He's got a terrible headache, he's vomiting, there's nothing in the medicine cabinet he can take for it, he asks OP for help but all he gets is chamomile tea... no wonder he went looking for something to give him some relief.\n\nOP is a major asshole. This is really bad parenting.", "Very relevant. Big difference between tylenol and morphine.", "[removed]", "yep I started getting migraines aged 7 and even tho my mum frequently gave us paracetamol and ibuprofen she never gave any to me for migraines??\n\nI still get migraines occasionally and idk how little baby me did it without any medicine. usually I was just left alone to deal with it. \n\nlike I would fully get aura, photosensitivity, vomiting, and 10/10 pain and I was just left alone?? no hospital or doctor. and now I've got lesions on my brain!\n\nmoral of the story: give your kids proper fucking medical treatment, people!", "Yeah I have migraines, they almost never get bad enough that I actually throw up. But that’s because I treat them early with ibuprofen and some caffeine (or excedrin migraine, which is a similar combo). \n\nLetting your kid suffer with migraines because you don’t want basic OTC painkillers in your house makes you TA, OP. I don’t blame him for stealing one when you won’t provide an actually effective treatment option for a truly debilitatingly painful condition, any more than I’d blame a kid being starved by their parents for stealing auntie’s purse granola bar.", "[removed]", "[removed]", "Bot stolen comment: https://old.reddit.com/r/AmItheAsshole/comments/150z94c/aita_for_taking_away_some_privileges_because_my/js5zpp9/", "[Bot](https://old.reddit.com/user/Doublufgjat7180) stole [this](https://old.reddit.com/r/AmItheAsshole/comments/150z94c/aita_for_taking_away_some_privileges_because_my/js68ert/)", "Bot stolen comment: https://old.reddit.com/r/AmItheAsshole/comments/150z94c/aita_for_taking_away_some_privileges_because_my/js5zpp9/", "By OPs (over)reaction I assumed we were talking about vicodin or oxycontin or something", "The point is taking medication- even OTC meds from anyone can have lethal consequences. People od on things like Tylenol every day. My spouse works for a medical examiners office- he sees these cases every week- a kid or an adult/family member/friend has gotten their hands on some medication- thinks they know what they are taking, and wind up as a case or an ER as an accidental OD . \nEducating teens on not accepting medication - OTC or not- should be something EVERY parent does- as well as teaching them proper use under supervision of medication when needed. \nI don’t want to see another young kid die or wind up in an ER because they took something they shouldn’t. \nRegardless- the stealing of medication is a big issue here- he needs to understand that stealing ANYTHING is wrong- period.", "Doesn't need to be flat. Could just all be placebo effect for me because coke was my mother's first remedy for upset stomach. We were never allowed soda at home unless our stomach was upset. Then we got coke. It still helps today at 49.\n\n\n\n\nMy mother said that when she was a kid, she was hospitalized because she couldn't keep anything down... until they tried coke. She swears it is the only reason she lived. So, she passed it on to me. I have not done the same for my son because I'm sure it is just placebo.", "That’s YTA for OP then. Just keep some ibuprofen in the house like a normal person! Chamomile tea does nothing for a bad headache. \n\nOP is TA for neglecting her kid’s needs to the point that he had to steal to get his needs met.", ">Some OTC patent medicine\n\nPain, not patent,  right?", "[removed]", "[Bot](https://old.reddit.com/user/TrueProfessional358) stole [this](https://old.reddit.com/r/AmItheAsshole/comments/150z94c/aita_for_taking_away_some_privileges_because_my/js5x7oo/)", "u/SortStrage8151 is a bot.", "u/WholeNo8769po is a bot.", "[Bot](https://old.reddit.com/user/Educationuyer112) stole [this](https://old.reddit.com/r/AmItheAsshole/comments/150z94c/aita_for_taking_away_some_privileges_because_my/js6neom/)", "You’re a bot", "Ain't marketing grand.", "Nope.  Just a human with a very odd hobby that I'm very good at\n\nHappy Sunday morning  u/fart_machine_gun"]}