{"id": 22464, "submission_id": "151xcut", "title": "AITA for basically ruining my family's relationship with our extended family", "selftext": "I (24f) have been travelling abroad for about 4 months now. During this time I am staying with my extended family and we've been getting along really well. My cousin (f36) has been preparing to get married for about 8 months, in the country I am in the customs of marriage and dating culture are different from North America (where I'm from). During my stay I have been helping her pick out wedding dresses for photoshoots, attending photoshoots with her, as well as make the bouquets she will be using during those photoshoots. Now here is the current situation:\n\nAfter we finished with the photoshoot, which was about 6 hours long, we all went out to go eat and drink together. While some of the people we went with went out to smoke, my cousins fiance (m36) commented on how my cousin used to date people that smoked, and I remarked that it wasn't that big of a deal because she used to smoke herself. This one comment blew up more than I could possibly imagine. Apparently my cousins fiance did not know my cousin used to smoke and hates smokers as well. I then got an angry phone call from my aunt telling me that I may have just ruined their wedding and it's my fault if anything were to happen. My cousins was furious and refused to talk to me so I was unable to apologize for a while. But when I did try to apologize she said she had no interest in anything inhad to say, and told me she would do her best so she wouldn't have to come home until I leave (I leave in a week). We were also planning to go on a trip to another nearby city together as a family but she told me it's best if I don't go. \n\nEveryone here is upset at me because I divulge the fact that my cousin used to smoke, but no one seems to understand that I didn't know it was a secret in the first place. To make matters worse, my own sister (f36) who is back in my home country changed her instagram profile to say something that insinuated a threat, basically saying that she will return whatever our family gets tenfold. Whether that be treated good or bad. My aunt and my cousin both saw this and became even more infuriated, and now my cousin has forced her brother (my other cousin (m30)) and her fiance to block me on all social media platforms. I think it's important to mention that I probably became the closest with my male cousin over my trip, and now feel as though I have no family left to rely on. He also told me that he doesnt think he can drive me to the airport anymore which is 2 hours away, in fear that itll make the situation worse and his sister may become angry with him. I understand that the people involved cannot really do anything about this situation and it keeps getting worse. This situation has now spread to where my aunt and my dad are going to probably have a very serious phonecall, and depending on the conversation may go, we may go no contact with each other. I know that realistically I may not be the asshole, but I sure as hell feel like it.\n\nEdit: Just for more information my cousins fiance does not seem to be leaving her over this, and he understands that on my part it was an honest mistake. He is probably the most bothered that my cousin hid that she used to be a smoker but for now the marriage seems to be safe.", "created_utc": 1689587303, "permalink": "/r/AmItheAsshole/comments/151xcut/aita_for_basically_ruining_my_familys/", "score": 206, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Divulged a secret I did not know about, and as a result caused a cascade effect that made me the source of the problem therefore an asshole\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "This sounds like a damn Soap Opera. NTA, you didn’t purposely try to ruin the wedding. Your family quite dramatic and took things out of\nProportion. Unfortunately there is nothing you can do now. If I was you I would change my plane ticket. aSAP. You don’t want to be in that hostile environment, besides, your presence might be making things worse. I am sorry this happened to you. I hope things workout for the better.", "NTA. So he's ok with smokers in the family, ok with smokers at the photoshoot, ok with her dating smokers in the past, but wants to call off a wedding because she's personally smoked before?\n\nDid the Marlboro man kill his parents or something? For her sake I hope this wedding doesn't happen.", "NTA. How were you supposed to know? Not to mention, if the fiancé is calling off the wedding over your cousin being a former smoker, you prob did her a favor", "NTA. If you didn't know it was a secret you didn't know. \n\nIt seems like an honest mistake that got taken way out of control. Weddings are emotional minefields, but if something as simple as being a former smoker was/is enough for the fiancé to end the relationship, what was the relationship really worth. \n\nYour sister didn't need to add to it though. While she was defending you, it still wasn't appropriate to get involved via social media.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (24f) have been travelling abroad for about 4 months now. During this time I am staying with my extended family and we've been getting along really well. My cousin (f36) has been preparing to get married for about 8 months, in the country I am in the customs of marriage and dating culture are different from North America (where I'm from). During my stay I have been helping her pick out wedding dresses for photoshoots, attending photoshoots with her, as well as make the bouquets she will be using during those photoshoots. Now here is the current situation:\n\nAfter we finished with the photoshoot, which was about 6 hours long, we all went out to go eat and drink together. While some of the people we went with went out to smoke, my cousins fiance (m36) commented on how my cousin used to date people that smoked, and I remarked that it wasn't that bug of a deal because she used to smoke herself. This one comment blew up more than I could possibly imagine. Apparently my cousins fiance did not know my cousin used to smoke and hates smokers as well. I then got an angry phone call from my aunt telling me that I may have just ruined their wedding and it's my fault if anything were to happen. My cousins was furious and refused to talk to me so I was unable to apologize for a while. But when I did try to apologize she said she had no interest in anything inhad to say, and told me she would do her best so she wouldn't have to come home until I leave (I leave in a week). We were also planning to go on a trip to another nearby city together as a family but she told me it's best if I don't go. \n\nEveryone here is upset at me because I divulge the fact that my cousin used to smoke, but no one seems to understand that I didn't know it was a secret in the first place. To make matters worse, my own sister (f36) who is back in my home country changed her instagram profile to say something that insinuated a treat, basically saying that she will return whatever our family gets tenfold. Whether that be treated good or bad. My aunt and my cousin both saw this and became even more infuriated, and now my cousin has forced her brother (my other cousin (m30)) and her fiance to block me on all social media platforms. I think it's important to mention that I probably became the closest with my male cousin over my trip, and now feel as though I have no family left yo rely on. I understand that the people involved cannot really do anything about this situation and it keeps getting worse. I know that realistically I may not be the asshole, but I sure as hell feel like it.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "I also wish I could get like the next plane out or an AirBnb but this would stress out my grandparents who are like 85 and 90 respectively. If I were to actually leave this would INFURIATE them and then we have a whole other issue, so I can't really help being in a hostile environment. I also think that things were blown out of proportion but nobody here cares about what I think so I'm just keeping my head down and staying quiet for the most part.", "YTA \n\nSo he was criticizing smokers and you decided to point out that she used to be one.  For what purpose? \n\nIf you thought he already knew.... why point it out? The only reason to point it out is *because* you thought he didn't know. \n\nIf you thought he didn't know, then you knew telling him would cause conflict between him and your cousin, because he was expressing disapproval of the action. \n\nYou chose to tell on her when you didn't need to. You chose to induce conflict in her relationship. You are the asshole.", "....your family's crazy.\n\nThey're losing their shit over the fact that *she used to smoke.*\n\nUsed to=!= NOW.\n\nNTA, but you know that. How were you supposed to know that was some sort of taboo? Or is it a taboo for women where you are?\n\nAnd if \\*that\\* is enough to make them lose their shit, gods HELP them when a really serious subject comes into play !\n\n&#x200B;\n\n(And am I the only one who really wants to know where this is?)", "NTA\n\n&#x200B;\n\nTheir drama is NONE of your business,. Just ignore ALL of it.\n\n&#x200B;\n\nIt is not your fault your cousin lied to her husband. It is not your fault your cousin chose to marry a judgemntal AH. . NINE of this concerns you.\n\n&#x200B;\n\n&#x200B;\n\n\"and now feel as though I have no family left to rely on.\" ... YOu never had that, they are a bunck of AHs. So you did not lose anything.", "Way to much drama over nothing...", "NTA. But WOW. Like how were you supposed to know you just literally stepped into a minefield.", "NTA It's a cultural norm apparently you were unaware of.", "I honestly find it hard to believe that it escalated this much over her being an EX smoker, when it seems her fiancé isn't even that bothered about it now. \n\n&#x200B;\n\nSounds like this information slipping out was a catalyst for something else, but what I don't know. No one gets this worked up about someone being an EX smoker... I could understand if she was still smoking behind their backs, but to claim her past smoking habit \"almost ruined the wedding\", damn - that is some strong drama genes running through your family!\n\nNTA, by the way.", "He's not calling it off. He just seems pissed off she hid it from him. Which is fair enough imo.", "Your situation it’s heart breaking. I  command you how you are doing everything possibly to keep the peace. I would have probably lost my shit by now. I hope your last days there pass fast and peacefully", "This is ridiculous. NTA.", "NTA I’ll never understand these kinds of posts where the person keeping a secret from their spouse gets mad at the secret teller. How were you supposed to know she hadn’t told him?! Honestly once you get home I’d block the lot of them and make a social media post about it. It’s hypocritical to get mad at you for something that’s her own damn fault and her brother is being spineless for not taking you to the airport. She misrepresented herself/her values and if her fiancé is pissed then it’s her own damn fault.", "NTA. \n\nThat side of your family are dishonest people and they are upset that you accidentally revealed a small part of their lie. Distance yourself from them. They are not honest people - and without that, what are they? Who are they? You cannot really know, because they are liars.", "It's not a taboo, and socially, a lot of people do it, which is why I thought it wasn't a big deal. I was really wrong I guess", "The more logical explanation would be that he's upset she lied about it.", "NTA\n\nI was in a similar situation. My husbands friend got a new girlfriend and everyone thought we’d get along famously and kind of forced us to meet.\n\nShe had asked me what his last girlfriend did for a living and I didn’t think it was a secret. Well she was a stripper and the new girlfriend LOST HER SHIT- punched their bathroom mirror until it broke and I had to talk her down for over two hours.\n\nFucking crazy. Now the new girlfriend has hated me for like 10 years bc I ghosted her after that wild bat shit crazy display and says I’m the bad person.\n\nYeah, ok.", "Nta, your family is being absolutely batshit over nothing", "NTA.  Another example of people looking for a scapegoat & unfortunately, you're it.", "NTA if she wasn't trying to keep secrets from her fiancé this wouldn't be an issue. i dont understand why people decide to start off relationships with lies and then get all Pikachu faced when it comes back and bites them in the ass.", "NTA.   But it’s my experience that extended trips abroad that involve crashing at distant relatives homes usually end badly. No one can be on their best behavior that long.  Seeing each other at weddings is very different than sharing a bathroom for a month.", "NTA you did everyone a favour", "NTA. I once mentioned to my new sister-in-law that I hoped the third time was a charm. She had no idea my brother had been married twice before. I couldn't possibly have known he would have withheld that kind of information, and neither could you.", "A cigarette cheated on his mum with a younger woman and broke up their family/s", "Well he's getting married to her, ofc I though he knew already. Also he wasn't criticizing smokers he was saying how my cousin used to date smokers. Please learn to read properly before giving an informed response", "NTA, this is some classic soap opera bullshittery right here, you had no idea it was a secret and your family blew it way out of proportion", "NTA.\n\nIt wasn't your fault. If you were supposed to keep a secret, they should have told you that it WAS a secret.\n\nI don't see what the big deal is in losing contact with them. If they blow up over an accident, you're better off not knowing them.", "NTA\n\nWhen you have a family dynamic like this, where you’re too afraid of backlash to leaving when you’re mistreated and your cousin is too afraid of backlash to even drive you to the airport….. Don’t engage with them when they are like this. Honestly, consider not being around this part of the family at all. \n\nI’m glad that your sister and dad are standing up for you. They are not overreacting.", "Is your whole family this dramatic? Sorry but your whole family is toxic af. Not one brains in those head. NTA", "They decided that it's much easier to punish you for being earnest than it is for your cousin to admit that she screwed up by hiding something from someone who trusts her.\n\nThis really should not be that big of a deal, but it really shows how much you and your family's presence in their life is.  It truly took very little for them to want to punish you forever- and the wedding isn't even off.\n\nNTA", "NTA, but your family needs to butt out while you ride out the storm.  Them getting involved is just making it worse.  Your sister is throwing fuel on the fire.  Tell her to butt out.", "He's probably upset that she's been lying about herself to make a good impression more than the actual smoking, it doesn't exactly scream trustworthy.", "NTA\n\nit's not your fault your family sucks", "No. Your cousin was really wrong. If she didn’t want you to tell her fiancé she used to smoke, she could have told you he didn’t know and asked you not to mention it. It’s entirely her fault that he knows now, not yours.", ">He just seems pissed off she hid it from him. Which is fair enough imo.\n\nIs it, though?  If you don't smoke anymore, why would you mention it?  What relevance can it possibly have?  How is it such a big deal?\n\nUnless she was smoking meth and/or crack and he needs to know that there's a chance she's going to go off on a week-long bender at some point, it just seems like such a pointless thing to be upset about.", "Might be he is worried she is likely to start smoking again? Health issues further down the road? Unrealistic expectations of partners? Got spooked by the \"impacts of cigarettes\" commercial with the pictures/footage of cancer victims?", "NTA.  That side of the family is not only dishonest but also psychotic.  You and your immediate family will be better off without them.  Time to head home.", "Wow. Talk about an overreaction.\n\nNTA, OP.\n\nYour family, though...they sound like a bunch of assholes.", "NTA. You made an honest mistake. Your extended family has blown it way out of proportion. Come home and let the chips fall where they may but stay well out of it.", "NTA, it was your cousin’s responsibility to be open with her spouse", "NTA. If someone wants you to keep some big secret for them or to lie on their behalf, they kinda need to mention that. \n\nNot only is the cousin behaving like an ass, they’re also stupid and blaming you for their own stupidity.", "It’s not that she used to smoke it’s that the fiancé didn’t know she used to smoke. Apparently it was a secret OP didn’t know was a secret and let out the bag. The family is angry that the groom is angry about having a secret kept from him.", "Right?? I am someone who aggressively hates smoking, and even I think this reaction is dramatic.", "start off a relationship?\n\nI'm guessing this traditional culture likes to do arranged marriages.\n\nSo something along the line of \"I have a daughter.  non-smoker, well-educated in house-hold care.  Excellent hips, Mother had EIGHT healthy babies, sisters each have 3 so far.  We can give a X,Y, Z as a dowry.\"   s/", "Were there children with these Ex wives, just curious if he wasn't mentioning them either.\n\nBut yes, a woman deserves to know if SO has previous marriages(if for no reason other than to be sure he's legally cleared to marry again--sometimes papers don't get filed/snafus happen).", "> I also think that things were blown out of proportion \n\nThings weren't \"Blown out of proportion\" multiple people decided to decide that something meaningless was worth blowing up multiple familial relationships for.  This is seriously a non-issue unless these people are narcissists looking for ammo to emotionally control others.", "Maybe, but the hatred of people who *used to* smoke isn't completely rational in the first place."]}