{"id": 22471, "submission_id": "151zww6", "title": "AITA for telling my poor friend that he's actually the privileged one now?", "selftext": "One of my very close friends Nathan (29M) and I (28M) met during our first post-college job at a prestigious finance firm, and we immediately bonded over the long work hours, shitty middle management, and general soul-sucking nature of making PowerPoint slides and Excel sheets all day. For the next few years, a lot of our friendship revolved around us talking about work and how much we hated it.\n\nA few years ago, I decided that I just couldn't take the corporate grind anymore, and I quit my job to move into the nonprofit world. While I now certainly make less than I would have at my old job, I'm exponentially happier, healthier, and absolutely love the work that I do. I also still make a very good salary ($80K/year) which I feel is more than enough money for me and my needs. Nathan has been ambitiously climbing the corporate ladder, and recently became a VP at his firm. He makes well over $300K a year.\n\nNathan grew up in a very poor family, and his relatives are still financially unstable and often ask him for money. I, on the other hand, grew up in a comfortable upper-middle class suburb with parents who have always been financially stable. They're not millionaires, but if anything ever happened to me, they could (and would!) help me until I could get back on my feet. Nathan does not have that privilege.\n\nI recently got offered my dream job, where I would be making slightly less money than I am now ($75K/year). Despite the money, I am genuinely giddy about this job prospect, and was pumped to tell my friends. However, when I told Nathan, his response was \"I'm glad you have the financial privilege to take a pay cut.\" Not \"wow AncientMesopotamia, I know you've been really wanting this job for months now and have told me all about how excited you are about it, congratulations!!!!\" or anything along those lines. I'll admit that I snapped back at him and told him that he makes triple the amount of money I do, and that at some point he needs to realize he's now got privileges of his own instead of pointing out mine. The conversation got a bit heated, and we agreed to hang up and cool off before talking it over later.\n\nNow I'm wondering if I should apologize to Nathan for what I said, or if I should stand my ground. I'm feeling angry and a bit defensive, which I realize is exactly the reaction that a spoiled rich kid would have. However, I also do think it was a bit mean of him to say that at that exact moment when I was so excited. And while generational wealth does give privileges that income alone does not, he literally does make over triple the amount of money that I now make, so it seems a tiny bit hypocritical for him to be calling me privileged.\n\nAlso, as a final note, while my parents certainly are well off, they do not support me financially in any way, and have not since I graduated from college 7 years ago.\n\nSo, I leave the judgement to you all - AITA?\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\nEDIT - Woah, this really blew up in a way I wasn't expecting. I've spent hours reading as many comments as I can, and I thank each of you for your perspectives - I have really learned a lot about privilege and what it's like to grow up poor from some of your stories. While it is nice of many of you to say that I'm not the asshole, I do think I approached Nathan's situation with a lot of ignorance and potential assholery.\n\nu/Equivalent_Joke_9617 said it best:\"I don’t think it matters who’s ‘more right’ here. What matters is whether Nathan has been a good friend and one that’s worth keeping. If the answer is yes, a heart-to-heart talk should sort this out.Genuine adult friendships are hard to come by. Don’t let a misunderstanding ruin it!\"\n\nNathan's been my buddy for years, through thick and thin, and so I called him back up to apologize. I mentioned that I really didn't know what his experience had been like, and that I was so proud of him for all he's accomplished, and that I just felt a little hurt and unsupported when he called out my privilege from the get-go instead of being happy for me. It felt like he was minimizing my success, but it turns out he's just been having a tough time at work and didn't respond in the best way to my job news. He apologized too and we had a really nice conversation. I think that since we started our careers at the same place and time that it's easy for us to compare ourselves, and we're both guilty of the competitive comparison game with each other. Anyway, it's all good now and I think we've opened up a good dialogue where I can learn more about my buddy's past and what it's been like for him, and try and support him with some of the mental struggles of coming from poverty. Listen to u/Equivalent_Joke_9617 and have heart-to-hearts with your friends and learn from your mistakes!\n\nAlso Nathan and I will be going to a baseball game next week and he offered to buy the tickets because he's \"loaded\" and I'm a \"non-profit schlub\" (both his words, both said with love). ", "created_utc": 1689595124, "permalink": "/r/AmItheAsshole/comments/151zww6/aita_for_telling_my_poor_friend_that_hes_actually/", "score": 5691, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I told my friend who grew up poor that he's actually the privileged one when he told me I was \"privileged enough to take a paycut.\" I think this could make me the asshole because I do have access to generational wealth and he does not.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "ESH\n\nStop competing with friends. Who has what job. Who makes more/less money. Who is right or wrong. Who cares. \n\nNathan had a jealous reaction & that upset you. He’s right but he didn’t need to say it. You have the option to make choices he doesn’t because you have a safety net (parents). Doesn’t mean you will ever need it but it’s still there. Definitely makes life a little easier. Nathan believes he does not have a safety net so he’s still grinding away in a potentially miserable & stressful job. Misery loves company so it’s not challenging to understand the jealousy here. You’re happy, he’s not.", "NAH but you both are coming from vastly different money places. You accurately see that generational wealth has build you something he doesn't have. Something he is building right now so hopefully he can pass that security down to his kids. He can't really prioritize work happiness over pay with out cutting into that building he's trying to to do especially as the cost of living keeps rising.", "NTA. We can do all the mental gymnastics we want all day here, but damn, 300k???? C'mon Nathan.", "NTa", "NTA, been in your position almost exactly. It's amazing how quickly the new rich lose perspective and empathy. With the double whammy of not understanding how ridiculous their bitching is when they make $300k + Like what small percentage really make that kind of money. And if it's anything like my experience, it wasn't just one comment", "NTA. No matter what is “true/honest” or whatever, that’s still not what a friend says when their friend gives them good news. As far as you’ve written, you didn’t even say anything rude to him but just pointed out that he does have privileges now himself. Which if he thinks he doesn’t then he can eat dirt.", "NAH. He's right, you don't have any financial obligations to anyone other than yourself. If you lost your job, you know you'd have someone around to backstop your fall. He's still grinding at a soul sucking occupation because he doesn't have the opportunity to leave. He has others who depend on him to bail them out, but he has no one to bail him out. He's a little bitter about it.\n\nNone of this makes anyone an asshole, you just didn't understand the position he's in because you've never lived it.", "NAH", "OP, I don’t think you understand the difference between people who start their adult lives with massive student debt and who have nobody to rely upon if shit hits the fan ….and people like you. I’m an attorney, and I get the holier than thou attitude all the time from nonprofit and NGO attorneys. Most of them came from wealthy backgrounds. Unlike them, I had to take a corporate job because I had a lot of student loans at the very high government interest rate of 6.8% (thanks 2008 recession). And more importantly, if I fail, there is literally no place for me to go. I will be homeless. No backup family to take me in, nobody to give me a helping hand, just me. Your buddy is not only dealing with that, but also trying to help out his own struggling extended family. YTA for living in your privileged bubble where you get the luxury of doing what you want and then throwing it in his face for not being as pious as you.", "NTA. What kind of friend says that when their friends tells them they got their dream job.", "It sounds like Nathan resents the fact that you were able to make a decision he wasn’t able to. There seems to be a subtext of competition in this friendship, and that subtext came to the forefront. \n\nESH. Both of you could do with a bit more introspection before you say things, and I hope that you come back around and meet in the middle again.", "NTA he doesn’t sound like your friend. He sounds like he just wants you there to take his abuse", "I’m going to go with ESH.  Yes, Nathan should’ve recognized that your new job was important to you and been happy for you as a friend.  However, you don’t really know what it’s like being in Nathan’s shoes.  Growing up poor is very traumatic.  This is evident in Nathan-he’s in the top percentage of earners, yet he still has a poverty mindset.  He recognizes that anything can happen and can lose his job and comfortable income in an instant.  Try to be a bit more empathetic when he makes comments about money.", "NTA seven years out of college and you are both independent financially. He is still judging you by your parents income and not your current situations.", "NTA. Your friend doesn’t sound like a friend.", "NAH, but what kind of Eeyore do you have to be to make 4x what your friend does and still moan about how hard you have it?", "NTA. If he's a true friend, he'd be happy for you.", "YTA\n\nAnd Nathan is right", "ESH. He got his comment, you for confusing 'wealth' with 'privilege'. Your friend isn't privileged, he wasn't born to a wealthy family or landed a job due to nepotism or cronyism, he worked hard and you know that. His comment was out of line, but yours was just factually wrong and insulting to all he achieved. I think you both need to apologize.", "ESH yes you do have privilege to take a lower paid job bc you do have parents to ‘stop it all, yeah’ as the song goes. But Nathan was also rude. He’s also,likely going through something, feeling overworked and then his family have their hands out for his money. He’s likely burnt out and wishes he could have a better work/life balance but his background means he’s afraid of being poor again. So he’s stuck. You quit this job so you know yourself,\n\nSo please invite him to catch up and talk and make amends if you value him. I do think you should apologise but I’d like to hope hearing your side he also apologises for speaking his inner voice out loud to you.", "YTA.  You ARE privileged.  Being able to take a pay cut because you know you have a safety net provided by your family is privilege, much moreso than having a high income due to grinding hard.", "NTA\n\nYeah he needs to figure out that just bc you have your own issues, ie financial insecurity/trauma, you don't get to take it out on your friends. You don't just get a pass for being an A. \n\nAnd it's not privilege to do meaningful work. Otherwise we'd say oh look at all those privileged teachers making low salaries but they are so privileged bc they can clearly afford to do meaningful work. \n\nThe guy making 300K+ is not the victim here. He's fully entitled to make as much as he likes but he doesn't get to look down on others for it, even if he's living in survival mode or will always have financial insecurity. It's definitely a thing - my dad has a bit of it - but it's not an excuse to look down on others. It's only how you make your OWN choices.", "I'm just going to throw out there that 300k to support yourself or your immediate family is one thing, and 300k to lift your entire extended family out of poverty is quite another. If Nathan is doing the latter, and from what you wrote it sounds like he is, no he doesn't have the privilege to earn less money right now.\n\nI completely get what you're saying and to some extent these have been Nathan's choices. But I also think you're underestimating the amount of pressure that is on your friend to provide for his family.", "NTA- but I think you could approach this with a lot more compassion and leave with everyone’s pride and feelings intact. While it came across as (and basically was) an attack on you, it sounds like Nathan is under an extreme amount of pressure. His entire family counts on him and he’s working a job that most likely requires all of his time and energy.  While it’s not ok that he put that on you, sometimes friends need a space to vent and it sounds like he needs that. \n\nRather than saying ‘you hurt my feelings by implying I’m rich when you’re also wealthy’ maybe ask him where these comments are coming from*?  If he doubles down then yeah, you’re allowed to disengage and hope he figures himself out. BUT, if he says ‘thanks for asking, I’m actually really struggling right now’ then you know it wasn’t solely about you. As someone working full time to ensure his family is ok he’s probably looking at you, someone with a supportive family who won’t lose everything if you take a week long vacation, and spinning out a bit. It’s not your fault, but if he really is someone you want to see do well (again, not your job if you don’t want it to be) then it’s worth seeing if he will talk to you about it.\n\n*I love asking ‘who are you talking to right now?’ Cause it A) reminds the person to lower their tone if what they’re saying is disrespectful and B) forces them to acknowledge that they’re not mad at  *me* but at a situation I reminded them of", "NTA, but he may not have meant it that way. Plus, it was just one comment. You probably didn't need to start an argument just because he didn't give you the exact response you wanted.", "NTA. Your friend is jealous and scared. You said he hated his job. He grew up poor so it's really hard for him to take the leap and get a less paying job. Because he's scared of loosing it all. Still not your problem but it can make you understand that it's not that he's not happy for you. He just screwed up at that moment because he's too coward to do what you're doing. \n\nCongratulations on your new job!", "NTA. What the duck, Nathan", "ESH.\n\n He made a sly remark about how you can take a pay cut, so you snapped back at him. You both agreed that both parties needed to take a moment to chill and stop being offended before you have another conversation. Keyword here is *both*. You both know you did wrong, just call a brother up and apologize for snapping. If he stands his ground, he's a AH and just cut ties for a bit.", "Slight ESH, if you value this friendship you should talk this out with him and explain that you understand his past circumstances but it was still a rude thing to say to you about your new job", "I'm with Nathan, YTA. Not everyone has the privilege to prioritise a dream role over a comfortable income.", "I don't think either side is NTA here. He is probably stressing from the enormous weight of dealing with the job that he has chosen because it is fiscally rewarding and finds himself jealous that you indeed can chase what you would call a dream because you have financial security through generational wealth. Only somebody wealthy is lucky enough to get to do things like that. He is probably not happy doing what he does, but likes the money. You on the other hand get to do something you love because money isn't an issue. You hit the genetic lottery he did not. Trying to be understanding is the best you can do.", "This sub is truly something else lol. \n\nThere’s another post about a girl calling a man patronizing and condescending for assuming she had help from her parents buying a $1 million home and everybody is saying he’s a misogynistic AH, because he didn’t think she “worked hard for it.” \n\nThis post is about a friend *actually* being condescending about “privilege” and everyone is calling OP an AH for not “understanding how his friend feels.” \n\nWild. \n\nESH btw.", "NTA\n\nWhat he said was pretty rude and spiteful.  He's making 300k.  He's doing extremely well for himself.  If he's giving it all to his poor family, that's his choice and problem, not yours.", "NTA. Cry me a river to all the whiney bastards making $300K a year. The dream is to get that job and invest for 5 solid years so that you can retire out in the countryside.", "ESH but definitely not extreme on your end. \n\nHe should not have said that.he was being an A H by nit being happy for you. \n\nBut your anger toward his privilege is also somewhat misplaced. \n\nMy parents come from poverty. My mums mother was a widow with 8 children and my dad grew up in a village in India where the \"rich\" really owned a chicken and the whole village shared a well. \n\nMy dad ended up making around 200k with his IT job. That's obviously a huge amount. \n\nBut, unbeknownst to most of the world, he paid for the tuition of all my Indian cousins, he gave dowry money for my female cousins and his sister (yes. Dowry is outdated. Yes. He still gave it). He bought a small, 2 bd house for his mother, who cares for his brother with downs syndrome. He paid for my uncle to go to rehab and supported my aunty and their children for the whole year his brother was in rehab. \n\nWhich meant that a large portion was actually not going to him. From an outside perspective,  he is privileged to make what he does *and he is* but I also saw the pressure he endured trying to support his own immediate family + five siblings and his mother, which he wouldn't have been obliged/socialised whatever to do if they had money themselves. Sometimes I had to help my dad with paying rent because things happened in india (ie floods) that he paid to help with.\n\nAnd yes, it was his choice, but that's also somewhat of a privileged perspective to have - because it's sucks watching your elderly widowed mother try desperately to care for her adult disabled child and fear losing him because she cant afford to *live*.\n\nI realised this when I married my husband and his family is fairly wealthy. He never *ever* considered that his parents wouldn't be able to support him financially if something happened, whereas it was something that marred every choice of mine despite how much my dad made on paper. \n\nWhen I finally accepted the truth of that my life absolutely changed and I started taking more risks for my happiness. It doesn't sound like your friend is there yet.\n\nHe is still an ass because he is dragging your happy moment down. It's not the privileged Olympics. But you are acting as though your choice isn't influenced by the fact you have backup (even though you obviously still worked hard for it).", "ESH.  This habit of playing the 'who's got the privilege ' dick wag just needs to stop; it's stupid and divisive and fails to account for a lot of factors.", "Toss up between NAH and ESH, but I’m going with the latter. \n\nFirst off, you worked the job with him. Long, hard hours. You knew the deal. You know he has to work his butt off all week long for his paycheck, its not easy for him just because he stuck with it.\n\nSecondly, it was a little rude for your friend to say he’s “glad you can [afford] a pay cut”. Personally that does read a little backhanded, but at the same time can you see his perspective? He has to grind non stop at his job to make his money, so his old buddy who can afford to quit and work a job he enjoys for less than a third of the original salary is a huge slap to the face! \n\nThirdly, you saying he has privilege is ridiculous. How is he privileged, especially compared to you? You QUIT, didn’t get fired or anything. You CHOSE to leave, willingly giving up your position. I hope you realize this and apologize because he is not privileged, he has made his own life for himself without the safety blanket of a financially secure home. \n\nSo while ESH, you should still apologize for what you said, and hope your friend will do the same.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nOne of my very close friends Nathan (29M) and I (28M) met during our first post-college job at a prestigious finance firm, and we immediately bonded over the long work hours, shitty middle management, and general soul-sucking nature of making PowerPoint slides and Excel sheets all day. For the next few years, a lot of our friendship revolved around us talking about work and how much we hated it.\r  \n\r  \nA few years ago, I decided that I just couldn't take the corporate grind anymore, and I quit my job to move into the nonprofit world. While I now certainly make less than I would have at my old job, I'm exponentially happier, healthier, and absolutely love the work that I do. I also still make a very good salary ($80K/year) which I feel is more than enough money for me and my needs. Nathan has been ambitiously climbing the corporate ladder, and recently became a VP at his firm. He makes well over $300K a year.\r  \n\r  \nNathan grew up in a very poor family, and his relatives are still financially unstable and often ask him for money. I, on the other hand, grew up in a comfortable upper-middle class suburb with parents who have always been financially stable. They're not millionaires, but if anything ever happened to me, they could (and would!) help me until I could get back on my feet. Nathan does not have that privilege. \r  \n\r  \nI recently got offered my dream job, where I would be making slightly less money than I am now ($75K/year). Despite the money, I am genuinely giddy about this job prospect, and was pumped to tell my friends. However, when I told Nathan, his response was \"I'm glad you have the financial privilege to take a pay cut.\" Not \"wow AncientMesopotamia, I know you've been really wanting this job for months now and have told me all about how excited you are about it, congratulations!!!!\" or anything along those lines. I'll admit that I snapped back at him and told him that he makes triple the amount of money I do, and that at some point he needs to realize he's now got privileges of his own instead of pointing out mine. The conversation got a bit heated, and we agreed to hang up and cool off before talking it over later.\r  \n\r  \nNow I'm wondering if I should apologize to Nathan for what I said, or if I should stand my ground. I'm feeling angry and a bit defensive, which I realize is exactly the reaction that a spoiled rich kid would have. However, I also do think it was a bit mean of him to say that at that exact moment when I was so excited. And while generational wealth does give privileges that income alone does not, he literally does make over triple the amount of money that I now make, so it seems a tiny bit hypocritical for him to be calling me privileged.\r  \n\r  \nAlso, as a final note, while my parents certainly are well off, they do not support me financially in any way, and have not since I graduated from college 7 years ago.\r  \n\r  \nSo, I leave the judgement to you all - AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Honestly NAH. You both sound pretty self-aware and like nice people. \n\nApologise for being a bit of a bellend in the heat of the moment and acknowledge how your privilege showed, and I’m sure he will get past it in no time.", "NTA. He's certainly in the top 10% now. Reality is even in Western developed nations most people earn way less than even your new 75K salary. \n\nHe is privileged. If he wanted, he could pick a reasonable house, pay it off early. Spend 5 years working and saving. He could then work a part time fun job for the rest of his life", "I think the real question is, how well-off is your friend? How much is his family relying on him? Is he paying off debts for them, leaving himself with an income less than yours? Or is he just earning a lot of money but still in a poor man's headspace?", "I’m inclined to agree. \n\nThis reminds me of a few years ago when one of my friends and their spouse were able to buy a large, fancy home. Friend had worked hard but also is part of several privileged demographics and was able to climb the ladder at work. When this friend announced to the friend group about the house, we were happy for them. None of us said, “oh well, you’re the same demographics as all the corporate leaders at your job, you don’t have health issues, you are in a dual-income household, etc. So you’re just privileged. You don’t know what it’s like to navigate life with more obstacles.” There are better times to discuss such things.", ">because he doesn't have the opportunity to leave.\n\nHe makes 300k a year. He has plenty of opportunity. Not seing that is very privilaged.", "An AH\n\nOp, you are NOT the AH here…\n\nNTA", "I mean, no?   \nI empathise with his situation, but it's really no excuse to be a dick with your friend, he is not the one that put your family in a bad place when you were a kid.", "He has wealth, that is all the privilege anyone needs. Practically any benefit of other privileges can be sourced through wealth", "Yes! Privilege is less about what you manage to *earn* and more about where you start/conditions outside your control. The friend is creating privilege for his family but he didn’t come from privilege and if his salary dries up tomorrow, he can swing right back much more readily into poverty than OP, though economic privilege is an area where our situation can improve or decline, certainly, but OP doesn’t have to think about money like the friend because of existing privilege. \n\nI do think it might’ve been a bit much for the friend to say that to OP but it sort of depends on how OP frames things, too, about both their jobs, and OP doesn’t seem to really understand the friend may absolutely despise their job but feel they really need to earn due to scarcity they experienced. However, the friend should be happy for OP sincerely, and I’m not clear if the comment was snarky or how OP was framing the pay cut. It feels like OP is almost proud of making less in an important field? Idk.", "Love this answer and was my first thought too - privilege isn’t just $$ but also security. Whilst he might have financial security right now, his support system seems lacking. \n\nI would swap $300k a year job for my family all having comfortable, stable incomes.", "Yeah, ESH. Nathan didn’t need to say it, it was inappropriately timed, and it certainly does come from a place of frustration and jealousy, but it’s also 100% true. The fact that OP doesn’t get that illustrates how true it is. Saying Nathan is the lucky/privileged one now lacks any sort of self awareness. OP, you’re incredibly privileged. \n\nFeeling able to go to art school, leave a corporate job that makes you miserable, to take something lower paying or open a business, etc.; all these things speak to privilege. Nathan understandably feels like he needs to climb the corporate ladder because he only has himself to rely on, the only cushion he will ever have is what he creates, he likely had to take out a decent amount of loans for education, and may also feel responsible for taking care of aging family/ younger siblings. He doesn’t have the privilege to consider his happiness. It’s a lot of weight that OP doesn’t have and will likely never comprehend (unless his parent’s financial situation deteriorates).", " if you value this friendship you should talk this out with him and explain that you understand his past circumstances but it was still a rude thing to say to you about your new job", "So if my friend told me about a job he got that he was excited about, it would be totally fine and good for me to immediately shit on him for it? I don't understand how people can say it's anything but ESH. Maybe Nathan was correct in his point, that doesn't mean that he should just bash OP over the head with it anytime he's happy.", "Is $300k only considered a “comfortable” income?!", "This. OP doesn’t understand how it feels to have others depend on you. Growing up poor changes your mindset OP. You are in a constant survival mode. YTA", "You already noted that in the post you mentioned, OP was a girl, and the one here is a guy. People will say gender has nothing to do with it, but they are just in denial or simply not paying attention.", "[removed]", "5 years?? You clearly don’t know anything how little $300k gets you in a HCOL area. \n\nTo make $300k, you HAVE to live in a HCOL area first. Then it gets you an upper middle class lifestyle as a single person. \n\nYou can’t invest it and retire in 5 years lmao you know nothing.", "If he's giving it all to his poor family, that's his choice and problem, not yours.", "There are varying levels of privilege and yeah, new wealth isn’t the same as generation wealth but it quite literally does not matter what background you come from - anybody making 300K/year has some level of privilege. Pretending that isn’t true isn’t doing anybody any favors.", "You said it so much more eloquently than I could've. I completely agree.", ">you just didn't understand the position he's in because you've never lived it.", "That depends on how many of his family members depend on his income.", "Yep, there's a reason child development acknowledges growing up in poverty as an adverse childhood experience that can lead to CPTSD in addition to a ton of other baggage.", "Yes, in my experience the more people make the less empathy they have and they less they help people and more likely they are to cut people off", "Yes, he can.\n\nINFO: What do you consider a fair % to give to family? 10%? 50%?  After all, by your logic, if he can afford to give 25% to his family, he'd be a massively selfish prick to not give 35%!\n\nGo preach from your soapbox  elsewhere.  The world doesn't owe his poor family anything.", "I know there are people making work on $100K.", "NTA\n\nAlso...a 5 grand pay cut at 80k a year for your dream job, when you don't have children is just...not that big a deal? He's being an asshat. \n\nYou're supporting yourself, for years, and while yes you do have privileges, so does he. You didn't take a 35k job and have your parents make up the difference.\n\nHe needs better boundaries with his family and a bit of perspective. And should reevaluate his choices.\n\nYou don't shit on your friends when they share good news.", "NTA.   He’s doing great, You tell him your good news, and his response is a neg?  He couldn’t just come up with “congrats” and be happy for you?  Y’all may have bonded in the trenches, but he’s not a friend.  That’s not what a friend says when you land your dream job.   I would back away from that guy.  Find actual friends.", "NTA at all", "NTA\n\n1. You were happy about your new job and your friend couldn't bother to even fake happiness for you. You're happy but he's caught up in his financial situation\n\n2. He makes 300k, he's choosing his financial situation because his family constantly chooses to live outside their means knowing he will pick up the tab.\n\nHe makes enough to fund 6 full rides to college a year, 20 times over minimum wage. How much is his family taking and how little are they doing to change is when he could work a 100k job and still afford to throw his family 10k once in a while?\n\nHis bitterness is his own choice and it's unfair to take out his resentment with his family on you.", "NTA at some point in one’s life one should be able to be happy for others. One does not always have to consider if one self would or could want the same.\n\nI am assuming that Nathan did not apply for the job and did probably not even consider applying for it.\n\nI also assume that you did not take the job to rub your wealth in Nathan’s nose.\n\nSo why can’t he just be happy for you? Why must YOU feel bad for finally getting your dream job? Why was that his first and only thought? That you are privileged that you can afford to have a job that doesn’t pay as well as his job does? Is he not privileged that he makes 3 times more than you?\n\nYes you are privileged and so is he! And both are ok! You both worked hard to get where you are… so why is it that you can be happy for him, but he can’t be happy for you?\n\nAsk yourself this question: what must Nathan’s income be so that HE thinks himself so privileged that it is comparable with your privilege in getting your dream job that honestly pays peanuts?\n\nOr is it that you are not working for the peanuts but rather for the job satisfaction?\n\nNathan strikes me as being jealous. Poor family or not, envy green is not a good colour on him", "NTA — you were right.", "NTA. No whining on the yacht.", "NTA\n\nLet him know that you live within your means and a 5k pay cut is only $96.15 a week and you will adjust your budget accordingly.  A big salary is great, but you value you work/life balance and enjoyment of what you do. \n\nThe guy probably lives like he makes $300k. Higher rent spend, clothing etc…", "NTA he let his own issues cloud your good news.", "NTA \n\nHe can cry you a river lmao. He doesn’t get to pretend that he’s still Oliver Twist when he’s making 300k per year now.", "That's a weird comment for him to make saying that you're privileged enough to take a pay cut down to $75k, I don't think I know anyone who makes that much :O\n\nRegardless of his upbringing he's exceedingly well off just now, and you're pretty well off yourself. I don't think anyone's fitting of being labelled the AHole but I don't think either of your comments were very nice", "The friend's salary doesn't matter; he shouldn't have pissed on OP's happy and proud moment. NTA", "You gotta be a special kind of bitter to make 300k and roast your friend for wanting a job that pays *only* 75k.\n\nIt sounds like your friend has had some resentment stew cooking up for a while. Something tells me that if you were talking about a job that paid 300k, he'd respond pretty much the same 'must be nice to make 300k and not have to support anyone'.", "What’s the point of $300k if you’re miserable all the time? Sounds like he’s jealous.", "NTA. My daughter works at a non profit(drug addiction counselor). It is rewarding however low pay. Good for you for going into non profit at a lower wage. I’m wondering if maybe your friend isn’t so happy with his career and that’s why he made the snarky remark.", "Motherfucker, if he can't be financially stable at 300,000 a year give it to me because I can.", "YTA\n\nHe HAS to make that much money BECAUSE of all the intergenerational pressures on him that you do not have. Privilege isn't really about your own situation in a bubble, its about all the external forces that affect your choices. Here is an example: if your current job goes away and you can't find a new one immediately, your family safety net is much stronger than his in the same situation. So he has more pressure to take a higher paying job and save money in case he has to support himself without any family support if he loses his job. It's subtle things like that which make privilege, and that specific one is likely the biggest one on his mind when he snapped at you. Congratulations, you get to take the job you want because you have more intangible resources to help you in case of a setback.\n\nTry to talk to your friend, I have a feeling you will learn about privileges you have that you never thought about because one of the important features of this kind of privilege is that they provide the kind of peace of mind that you have never had to think about it.", "ESH:  You are talking to a man who knows that he has zero safety net.  Not only does he have zero safety net, he know that HE is the safety net for older family members.  That money all has names on it already--all $300K of it.  If he hates his job can he quit? No.  He's the safety net.  If his job ruins his mental health or if he hears about some cool opportunity elsewhere or whatever could he just drop everything and do it?  No.  \n\nYour friend has more to worry about than you do.  He doesn't have the luxury of following his dreams and what not.  Part of being priveledged is knowing that your family is cared for so that you can do the things that you actually want to do for yourself.  I don't think he should have been petty and made that comment to you because, clearly, you don't understand where he is coming from.  It's not a good idea for friends to have these talks.  \n\nIt is entirely possible that he is really not liking his job right now and is somewhat jealous that you have the freedom to change your situation like you have.", "NTA his still stuck in his head about his means. He needs a reality check.", "Tbh, ya’lls whole “privilege” culture is whiny, passive aggressive, and corrupt.  You and Nathan would both be hugely happier, better people of you would mutually agree to expunge this concept from your friendship.", "ESH - What he said to you was petty, mean, and out of jealousy, but you seem incapable of comprehending the level of privilege you have enjoyed your entire life and how it has impacted you.\n\nYou are likely guaranteed an inheritance someday. In 30 years you could get a free, paid off house that would take Nathan 30 years and a decent chunk of his salary to pay off. What constitutes your safety net in the present will become additional wealth later. Much of the difference between your salary and Nathan's is just going to be spent building up a personal safety net that you don't need to. \n\nClimbing the ladder and making 300k is always an option for you. Taking it easy without worrying about the future isn't an option for him. Your privilege is free and indiscriminate. His is hard fought and precarious.", "Having wealthy parents does in a way allow you to live this \"free\" life of making less money though. You know that they have got you, if things went belly up. \n\nAnyone I know who quit their job to pursue their passion, or always pursued their passion even if it was very low paying or risky (like starting up a business), had wealthy parents so if they failed it would be ok - they knew they would never be truly poor/ homeless etc.", "YTA. You said yourself that this friend always has his family asking for money. So you really don't know what his situation is, it seems that he is likely supporting his family. Sure he might make three times more but you really dont know what his life is like. Normal yeah I wouldnt feel bad for this person making $300K a year, he likely has to support alot of people on that.", "Both AH\n\nEven if your parents no longer support you, they did until after you graduated college. You had access to privilege for at least 21 years where you didn’t have to worry about anything financially (I’m assuming they also paid for your college). It sounds like your privilege still extends as you have a safety net.\n\nImagine if you didn’t have that privilege. You had to pay for college, help your family will bills, etc. You might still be paying off your student loans, while trying to support yourself and your family. You might not have the luxury of taking your dream job then because of how little benefit you receive from it. Your friend might be seeing way less than 300k if a lot of it has to go to bills, debt, and family (I’m making assumptions).\n\nHe could have been more supportive about you getting your dream job and brought up privilege in a more civil manner (making him an AH), but it doesn’t mean he’s not wrong.", "Fuck him, he’s upset because he found out that money doesn’t buy happiness. NTA and good luck on your new job!", "The title had me at wow you're a dick but the story? NTA. You're in the clear. $300k IS privilege. He doesn't need that to live on; he just wants to live on it.\n\nHope you're new job finds rocks, OP.", "I'm going to say ESH. Yes. He's got money now. But that comes with obligations to himself and his family. Plus I'd imagine he also has a certain amount of impostor syndrome happening, and feels like the money could be gone so fast. A lot of that needs to be worked out in therapy.\n\nYou, however, don't have that. You get to work your dream job despite the income. That is so incredibly privileged. Not saying you don't take care of yourself, but it's different. You never had to think about \"If I take this job, I won't be able to make bills or take care of people.\" It's privilege to get to do what you want rather than what you need to. (I say that as someone of some privilege, too.) \n\nSo yeah, neither of you are wrong, but neither are right. And I'd probably suggest in the future to try not to talk about money. You're both in two different places no matter how much either of you make.", "Do not apologize to him because why would he say that instead of congratulating you. L friend", "No one’s the AH here. I think both of you simply did not understand the other person’s perspective at that point in time.\n\nI don’t think it matters who’s ‘more right’ here. What matters is whether Nathan has been a good friend and one that’s worth keeping. If the answer is yes, a heart-to-heart talk should sort this out.\n\nGenuine adult friendships are hard to come by. Don’t let a misunderstanding ruin it!\n\nAnd congrats on getting your dream job!", "ESH I mean its true. Some people could not accept a great job if it meant to earn less money. And he's not \"privileged\" because work is hard (yk it) and he has so many people he has to take care of. You dont have to worry about your parents not being able to pay their medical bills or their rent. It's not the same for him, and it will never be. And knowing that your relatives rely on you is HEAVY. \n\nOn the other hand, that was rude from him to tell you that especially when you were so happy to have this job you like. What's the point ? To make you feel bad ? AH move.", "I would tell you to fuck off fucking asshole", " Slight ESH, you for failing to understand that supporting just yourself and supporting your entire family are wholly different situations, him for being resentful that you're pursuing your dreams and basically calling you spoiled for doing so.", "NTA But you shouldn't be having privilege competitions with your friends that's just stupid. The more successful, wealthy, comfortable, happy and \"privileged\" your friends are the better. The whole point of friendship is being on the same team in life.\n\nThough I don't think your friend was knocking you with that comment. He was expressing that he's jealous because he can't (or won't) do what you did for whatever reason. Its not uncommon for wealthy people to up their living expenses and bills to the point where they can't get out of their job without selling their house and car.", "NAH. My guess is that Nathan has also started to hate his job and would like to follow your path but feels he can’t due to his family situation. That doesn’t justify his lashing out at you though. You all should just talk", "To me, it sounds like to good friends are talking and having an healthy argument.  I don’t think any apology is necessary on either side. \n\nThat what friends sometimes do arguing without damaging friendships.", "ESH. He definitely didn’t need to say that, and your response wasn’t necessary either. \n\nMutual apologies and some kindness to one another. You are right, OP, to recognize that your privilege makes it really hard to understand how deep the well of need surrounding him may be, and how trapped and overwhelmed he may feel, BECAUSE of his high earning capacity. \n\nAnd he sounds overwhelmed by all that need, to have that be the first thing he says to you. It may have been heartfelt, but it was also not kind to say to you at that moment.", "Nah. You don’t understand his positions. As you said you have people to fall back on if you don’t make enough. Your friend sounds like he’s the person his family goes to when THEY don’t have money. His comments sounds like it comes from a place of “oh I’m glad you’re able to chose a job based on what you like, not how much you are making”. He sounds a little bitter/hardened. But you both have privileges. Yours is the privileg to leave a high paying job to get a low paying job that you love and feel ok if you ever hit a snag because you have your stable parents that you said you know would help you. Your friend has the privilege of now making 300k witch he sounds like he supports his family as well as himself. Different circumstances. Comments came from different ideas of what working/ how choosing a job happens. You only have yourself to take care of, which is also a privilege that your friend doesn’t have. It’s all perspective. But ultimately I think you got defensive.", "ESH, your friend should keep it to themselves if they're bitter about their upbringing in moments that should be celebratory but OP you could stand to navigate the world with a little more awareness of the fact that having a stable, well-off set of parents as a safety net changes the entire game. Both of you could use a crash-course in empathetic interactions.", "OP, what you seem to be missing is that your friend likely has to worry about providing for his parents and any siblings, and also knows that if he loses his job, there is no family support to fall back on.\n\nWhereas while you may not have had any support monetarily from your parents, you also know that if you take a risk and things work out poorly, you *can* fall back on them. And also you know you don't need do worry about helping your parents secure food and shelter for themselves with your paycheck. \n\nNAH. You're both victims of our human-devouring economic system. Talk it through with less heated heads and realize you're on the same side.", "NAH - \n\nNathan sounds burnt out. He's working his ass off because the money never feels like enough. As someone who also came from a poor family, no matter what, he knows it could be gone in a flash and he will have nothing and he never wants to feel that way again. OP, you have never felt financial insecurity so you have never had that persistent worry about what will happen to you. You know you have a safety net. Nathan has never felt that. His anxiety is coming out in ways he may not understand, but you're also nta for expecting a simple congratulations. As well, if he's living in a HCOL area to have this position, and you're in a lower COL area it could be similar in terms of budgeting anyways.", "ESH, when someone works their ass off and becomes wealthy, that isn’t privilege, that’s payoff for all the work you did to get there. And when someone values work satisfaction over money, that isn’t privilege, that’s peace of mind. You both suck for calling each other privileged", "ESH.\n\nYou really don’t know what it’s like to only have yourself to rely on. He feels he HAS to make tons of money or else what will happen if he gets sick and needs time off? Who will support him? However, he is an AH here because it was inappropriate and unsupportive to bring up his personal feelings in this moment where you expected him to be happy for you.\n\nYou are also an AH for being too thick to understand where your friend is coming from and pushing the issue. It IS a privilege to take a job that you are passionate about that makes less money. Your friend would never be able to do that.", "NAH", "INFO: What jobs have you had since leaving finance? Genuinely curious, I hate working for corporate too.\n\nYou’re definitely not the asshole, and I’m wary of saying Nathan is too, because 1) you both agreed to end the conversation before it worsened and 2) he’s surely still in that mindset of being financially unstable since he grew up in it. Maybe the new salary hasn’t hit him yet.", "ESH\n\nWas he being a dick? Yes. Was he wrong? No. You do have a certain kind of privilege that allows you to  make this kind of career move and not worry about things like a pay cut. Y'all out here arguing over who is the least privileged and it's gross. Take that energy and donate more money to a food bank in you community. This post is peak first world bs.", "ESH.\n\nYes, Nathan should have been supportive.\n\nBut also, Nathan's not incorrect: privilege is *not* just how much money you make/have.  Privilege is the social ramifications and the class values and attitude toward money that come because of money (usually a prolonged exposure to it such as upbringing): doing what you love at a pay cut, being able to take certain risks, having a financial safety net--that is privilege.  Honestly, it doesn't matter that your parents didn't support you: the fact that they could have and you knew it almost certainly influenced your decisions to this point, whether you realize it or not--and *that* is what privilege is.  There isn't anything wrong with it: the whole reason your parents did what they did is to give you more options in life--and if that has led you down a path where you're about to take your dream job, well, that was the whole point!\n\nThat leads to the main reason ESH: you (both) seem to be turning this into some weird competition, a contest of grievances in which having means is somehow a moral failing.  It sounds like you each have at least a little bit of a complex about the way you were raised and what you are doing now.  And you probably both occasionally have second thoughts about the things you each had to sacrifice for where you are in your careers (in your case salary; in his passion/time).\n\nThese are natural feelings to have, but keep in mind: you're not each other's enemy here.  It's just the fact everyone's life is different and people have to make choices.  Ultimately, it's simply the fact that, due to different upbringings, the two of you wanted different things with your career.  Why does one have to be better than the other?  Based on your story, it sounds like you're both doing extremely well for yourselves in pursuing what you respectively want.  If you two are really friends, just be happy for and proud of each other.\n\nCongratulations on your success, both of you.", "I mean if your so privileged you can take major pay cuts and still afford to live the way you want you are financially privileged.\n\nGuy making 300k a year how much debt has he accrued due to 0 family support.\n\nGrowing up poor typically means you have to drown yourself in heavy debts to get ahead in life.", "Dude maybe he’s helping his family with that paycheck and probably has little left to himself", "ESH. This whole trend of accusing people of being privileged as if they committed some sort of wrong against others just needs to stop. It's rooted in jealousy and is rudely dismissive of other people's hard work and accomplishments. You're both shining examples of that with the conversation you had.", "Slight YTA. I assume your parents paid for college or at least gave you a lot of help. It doesn't sound like he had that support so with college and law school loans he likely cannot afford to take a pay cut because of the debt he has. It also sounds like you stand to inherit a fair bit of money while he needs to fully fund his retirement years.\n\nI grew up in a very modest environment but I did have all the support my parents could give, financially and emotionally. I recognize that blessing all the time and am very grateful for the opportunity it gave me to well exceed my experience as a kid. Having that background has given me the chance to contract and really appreciate what I have now but the fallback was not there to allow me to fully take a job that I enjoyed. Again I was fortunate enough to find something that paid well AND I love but that's a bit of luck there", "ESH.\n\nYou’re both privileged in different ways. Nathan’s money trauma from growing up in scarcity is likely something that can only ever go away with therapy.\n\nYou do have privilege and you should not get defensive when it’s pointed out. Nathan should have shared in your excitement instead of immediately jumping to pointing out your privileged position.\n\nPrivilege isn’t black and white.", "ESH.\n\n\n\n\n\n\nHe may have income privilege now but you’ve benefited from inter-generational wealth and educational privileges.\n\n\n\n\n\n\nHis net worth is probably still less than that of your reliable family.\n\n\n\n\n\n\n\nBut his raining on your parade is an asshole move out of jealousy. You reacted with defensiveness in order to protect your inner child.\n\n\n\n\n\n\nBest plan of action is for both of you to apologize for each remark.", "So I need info before I make any type of judgment. Did you ask how he was doing before you jumped in with your exciting news? I always try to read the room before I give out any of my good news to make I’m not rubbing salt any open wounds. I do this because I know what it’s like having someone tell me their good news. It can suck horribly if life is extremely hard at them moment and wish they would have waited a bit and realized that this news would hurt me. You don’t tell someone you won a million bucks when that person is trying to keep the lights on. So I need to know if you read the room before jumping in with new job information?", "ESH. Friends should be supportive of one another's achievements. It's not a competition about who has more privilege, or who has led a more difficult life.\n\nThat being said, you do have certain privileges that he doesn't. You have a safety net to fall back on. You haven't used that safety net in 7 years, but if there ever came a time that you needed to use it, you could. That's an enormous burden off of one's shoulders. You likely have little to no student loans. You'll probably get a nice inheritance one day. Your parents will have arranged for their finances to be in line so that you won't have to care for them in their twilight years. \n\nMeanwhile, your friend has no one to fall back on if unforeseen circumstances make him lose his job and stability (and that could and does happen, even to people making great money). He has to get his own ducks in a row to secure his financial future, to help his family in the present, and also to arrange care for his family in their twilight years. That is an enormous burden to carry; one that someone who grew up with privilege would not understand. He's likely strapped with student debt. He'll receive no inheritance from his family. He's making great money, but in the back of his mind he is probably always afraid of losing it all. But he should be careful about judging those who had the fortune to grow up with stability and privilege. His kids will most likely be those people, especially if he partners up with someone with a comparable income to his. He should want that for his future kids, just as a good friend should want that for their friend too.", "NTA, but come on. \n\nYou guys are friends, but you're constantly comparing salaries, trying to under-privilege each other, getting heated with shitty internet buzzwords.\n\nYou guys are holding each other back. You're both stunted and stifled in your relationship with each other. You both sound like you behave repulsively and are super concerned with buzzword crap. This friendship should end.", "ESH.\n\nHe’s an asshole for not being excited for you  as a friend.\n\nYou are both so caught up in judging people based on their wealth and status it’s gross.\n\nBeing poor doesn’t automatically give you the moral high ground and not all middle class people are elitist privileged jerks.\n\nSomehow you both think income should be packaged with guilt. Reflect on that.", "Maybe unpopular seing most answer here but Id say ESH.\n\nYour friend obviously should have said something else, and try to leave his bitterness at the door.\n\nBut being privileged is not about your job or your earning, it has to do with how you are born. Maybe he feels that him too, could be doing a job he prefers if only  he had some monetary security, and feel frustrated to have to work this job to build it.\n\nIt might even be only in his head, maybe he over guess your family's money, maybe like many in his situation he still see himself as poor.", "Hate me if you want, but you both suck here (ESH).  You should both be apologizing.\n\nHe should’ve congratulated you and you shouldn’t have called him privileged.  He’s not “entitled”, he worked very hard to get that position - it wasn’t undeservingly handed to him or a privilege for him to get to where he’s at.  Growing up poor and achieving any success doesn’t stop the worry of money.  He might be concerned for you and communicated it very poorly due to thinking that your parents will be subsidizing your pay cut.  He probably holds some animosity with people that had a better childhood than him.\nGive it a day or two and discuss it with him.  Get to the root of the problem if the friendship is worth saving.", "So the fact your parents are financially stable does more than just give you a safety net. It means you don't have to be their safety net.   \n\n\nYour friend might make 300k but if shit hits the fan for his parents likely he's the one that then will be expected to step in and take care of them.   \n\n\nWhile I don't make anywhere near what you do much less what he does I do make enough that in my area I could afford my own place and live comfortably.   \n\n\nMy folks unfortunately do not. So like him I'm forced by familial link and societal pressure to keep them from being homeless. Both rely on social security which means they can afford half the rent. I pay for everything else and I can't use most of my home. The living room is pretty much theirs and everything else but my bedroom/office is communal.   \n\n\nI don't think either of you were the assholes you just have different pressures. From his POV you don't have to worry about financially supporting anyone but yourself so you can take a paycut and know that your parents are fine without your money and that you have them if your money proves to not be enough.   \n\n\nHe can't afford to take a paycut because if something happens to his parents or himself he has to be prepared to step up. You both have different advantages and disadvantages.", "I think you both share the YTA tag for blabbing about what you make to begin with. That's nobody's business but your own.", "YBTA - Your Bank Account's The Asshole. Money can't buy manners, my friend.", "ESH-Nathan for not being happy for you and you for acting like its privilege that hes working hard for something and getting rewarded for it.", "YTA.  You do have the financial privilege to take a pay cut.  What he said doesn't sound malicious.  Just factual.  And him working hard for year's to get ahead does not make him privileged.  Someone with parents that can take financial care of adult children who chose to make less money is privileged.", "ESH you are both privileged in different ways. It was super rude of him to be mean instead of happy for you but also uncalled for to be mean back. You chose different paths. Apologize and move on", "YTA for not understanding what privilege is. It’s a privilege not to have a scarcity mindset ingrained into you from childhood. It’s a privilege to not feel responsible for lifting up the rest of your family. It’s a privilege to be able to choose a job you love because you love it. \n\nPrivilege is not “having money.”", "ESH.\n\nYou are right to be annoyed that he responded to your job news the way he did. That wasn’t cool. And as you acknowledge in your post, you are both privileged in different ways- you grew up with family financial support and still have it if you need it. He did not and does not (and he has people who depend on him) but he makes a bunch of money. \n\nLook, he’s your friend, right? So instead of looking at it as black and white, apologize or stand your ground, so both by talking to him. Say hey man, it stung when you responded to my happy news the way that you did. Tell him how you feel and let him tell you how he feels. Don’t be defensive and encourage him not to be defensive. Try to reach and understanding. Because you’re friends.", "Not the question you asked, Ancient, but there’s no reason why you can’t set your sites on jobs that are rewarding and pay well. I felt bad that you’re taking a pay cut.", "ESH. How about you both just stop slinging privilege accusations at each other? Would eliminate so much petty interpersonal conflict over who has it worse.", "As someone who is in Nathan’s position, I totally get where he is coming from.  Generational wealth gives a safety net that allows for so many more choices and it can be hard to see your peers flourish in a way that you will never be able to because you have to be the provider, and only poverty waits if you fail to provide.  However, what he said was a jerk move, so I think he owes you an apology.", "I am you. I feel comfortable and unafraid to make any career choice I want, and also chose a lower paying job - as a direct result of the ease I feel thanks to my parents. YTA", "Leaning towards NAH or ESH. You two are friends, it’s not a competition. He should have been happy for you and not made a snarky comment. That being said, he’s likely dealing with things you won’t understand because you didn’t grow up poor.\n\nAs someone who is in a similar situation as your friend (grew up dirt poor but found “success” as an adult) he probably has a lot of unresolved trauma around money. It IS a privilege to be able to take a lower paying job that makes you happier. And it IS a privilege to make $300k/year, even if your friend had to fight tooth and nail to earn that privilege entirely on his own. \n\nYou both are different people with different life experiences and will likely not see eye-to-eye on this. Have empathy for each other and focus on your friendship, not on each others salaries.", "YTA..  doesn't matter how much money he makes..  you said it yourself in this post \" They're not millionaires, but if anything ever happened to me, they could (and would!) help me until I could get back on my feet.\"  Most ppl don't have this luxury.  If Nat was to lose his job..  he'd be fucked, well you get to rely on mommy and daddy...  See the difference?\n\nLast, never talk about income", "OP just admitted, \"Nathan does not have that privilege\" maybe, Nathan can't take a \"payout\" and pursue his dream job like op. Because he comes from a poor family, who ask him for money or is finacially reliant on him. , while op, if he ever needed financial help, his parents, while not millionaires will help him out and Nathan \"does not have that privilege\" so,  what Nathan said is true.  \n\nI think it's very lucky and privileged when a person, doesn't need the money and is able to pursue their dream or dream job, and not have to worry about taking pay cuts and knowing they have family to help them out, if you needed it. That's lucky. Maybe, Nathan feels op is rubbing it in his face. Nathan is the one still stuck in that job that they both hated but can't afford to leave because he's probably the only one making money, supporting  his family.\n\nYou're lucky you got out of that job and don't need it, OP. You don't have to be YTA and rub it in his face now. You already know your friend hates his job as that's the whole reason you guys became friends. If y'all are still good buddies, both of you should just apologize. Good for you. Sux for Nathan, he's still in that hell hole.", "ESH, he didn't have to rain on your parade and be an asshole even if his remark was right. Will you admit he was right though?\n\nNathan probably has to provide for his family and feels the stress or burden that it causes. You parents will be able to help you in a pinch, well that is probably Nathan now to his family/extended family. He has WORKED for everything he has gotten and you were born into a better situation. That is the privilege he is referring to.", "ESH. He shouldn’t have said anything and a good friend should be for happy for your happiness. It’s absolutely fine for you to make your displeasure with his comments known. Insisting he’s privileged when he’s not isn’t it though. He may have money now, but he still hasn’t enjoyed the benefits of growing up with money and having parents with money that you have.", "Honestly this struck me as a ESH situation. \n\nYou seem pissy that he makes a lot more than you do. \n\nOn the flip-side it sounds like maybe he doesn’t really like his job but can’t leave for a lower paying one because he knows his relatives need his financial support. He sounds pissy that he can’t leave his job to take one that he will actually like because of this. \n\nYour an AH for snapping at how he makes much more than you when really he may be stuck in that position because he feels responsible for taking care of his family. He’s an AH for not being happy that you found happiness in your career and seeming a bit angry that your family doesn’t need to depend on you like his does. You both seem pretty bitter.", "YTA. \n\n\nBut not a flaming one ;)\n\n\nFrom his POV, he's stuck in a job he hates.   He's learned that money won't make him happy after all,  but it will buy safety nets and nicer vices than he can get for 75k. He's stuck in a way, because if he walks away from 300k his family and friends will give him absolute he'll for doing so. \n\nGive him some grace. He cannot imagine climbing DOWN the ladder, it confuses and frustrates him to see his friend doing so.", "ESH. Growing up poor can have lasting consequences on a person. The children of the Depression developed all sorts of issues around material possessions, money, savings, thrift, and more. And he is still living with it, supporting relatives who haven’t gotten out of it. And maybe he hates his 300k a year job. Making more money does not equal being happier in life. \n\nBut, his comment was shitty, as well. You’re right. Should be happy for you (congrats on landing the dream… may it stay dream worthy). So, that’s why everyone sucks. \n\nIt’s good that you could both recognize the need to log off, cool off, and reengage later. Open with an apology that gets to why you said what you said, being hurt about his comment. That would be both kind and give an opening for him to apologize as well. \n\nNo assholes, just friends with a misunderstanding, saying shitty things to one another. ESH.", "ESH \n\n\nHe makes triple the amount of money you do because of both of your respective choices. You throwing that in his face seems whiney, because you chose to leave. He never had the safety net you state having in the OP, about how if anything happened, your family could take care of you. Your friend is in the position where he's taking care of his multiple family members with money.  \n\n\nHe *is* privileged. His response comes from jealousy. He wishes he could do the same, but felt too much pressure to provide for himself and his family that he's decided he's unable to ever do what you've done (get a job that he actually wants and likes, even if it makes less money). He was wrong to comment on that instead of congratulating you. \n\n\nYou *are* privileged to be able to pick any job you want without having to worry about your finances because you have a support system to help you if anything were to happen. Lot's of people don't have this. You're right to feel hurt since in the moment you were excited and looking to celebrate. Turning it around and yelling wasn't the best way to handle it.", "YTA\n\nPrivilege refers to a set of circumstances, and as you lay it out you've got the better circumstances. He shouldn't have snapped, but he can work decades and not build the wealth you'll inherit.", "YTA", "NTA. I can imagine where he's coming from - when you've been poor I think at the back of your mind there's always the risk you will be again, he probably genuinely doesn't think he'd be able to take a pay cut in that way just in case he loses a job and doesn't have a safety net. But it's an AH thing to say to a friend celebrating a success, and you're right that his high salary now puts him in the privileged category. Privilege comes in a lot of shapes and sizes.", "I dont think this is about privilege. You decided to take a job you’re dreamt about and wanted support/encouragement/celebration. \n\nYour friends comment probably stems from his situation, which in turn made his response about him instead of about you. Which is a bit rude but maybe he didnt realize. \n\nYou responding to that was probably unwise. I dont think the privledged or not discussion is helpful to your friendship. And your friend may feel he has to do the role he is based on his circumstances - which may be why he responded the way he did. But thats not on you - that is his issues to work out. \n\nYou both have chosen your own paths and your own financial pictures. So you probably shouldn’t compare them. You should talk about this issue and just discuss how his response made you feel and apologize for what you said in response.", "NTA. Doesn’t matter what his financial situation is. The only correct response to your news would be to congratulate you on the new job opportunity and move on. Nathan was projecting and needs to keep his personal hangups about finances to himself.", "I live on social security at $12k a year. I consider your “friend” extremely privileged but also you. \n\nPoverty isn’t a contest but you both lose if it was. \n\nESH", "NTA.", "a little bit of assholery from both of you, don't be angry with each other, talk it out and stay friends, it's obviously important to you both and a few sour words should not ruin that", "NTA, he should’ve been happy for you instead of calling you privileged. It also says a lot that you’re being thoughtful of your words.", "No he is the asshole, if you make six figures a year and can't take a pay cut the problem is your lifestyle. I have lived on 13.5 an hour it's not that hard.", "NTA, if he is actually making that level of money and not being responsible enough with it that he can't take a pay cut, he's in his own pile shhhhhhhhhaving cream.\n\nLook, anyone can live off that amount and comfortably.", "Nta, *he* is a privileged individual. It’s weird to me that his first thought was to mention your privilege when he is clearly the better off financially speaking out of you two. I get that not having a family who supports you and who you have to support can be draining but he doesn’t have the right to take his own personal feelings out on you bc you took a 5k pay decrease. Realistically you’re losing what, around 400 dollars monthly. That is a large sum but you’re still making a decent wage and it’s the job of your dreams. There are many people who struggle while having their dream job or even get another job to support themselves bc that’s what they want to do. Some things don’t boil down to just money.", "NTA", "NTA however,  if you value the friendship then I would suggest you take s step back from the actual words that have been used on both sides. Coming from a poor background he is driven by money and hasn't found his happiness. \nHow about starting a conversation with something along the lines of\nI want to talk with you about our last conversation,  it didn't go anyway that I am proud of and I hope you feel the same way. I value our friendship and apologize for my heated words. I hope that you really only want the best for me and my happiness. \nThen let him respond.", "NTA  he probably feels that you have choices that he doesn’t. But that doesn’t mean he should be shitty to you", "NTA\n\nTake away everything else. Down to the core.\n\nA friend is happy for you when something good happens to you. They don't try to belittle what happened or somehow make it about themselves. You have every right to be upset, because what they said was uncalled for.", "NTA\n\nAt 300k a year, he could lose 5k a year and not fucking notice.\n\nGrowing up poor will affect your default framework forever. That's engrained. But he isn't in those conditions anymore. Any ties he has are sentimental or one of personal obligation, but he isn't shackled there. He can leave. He has one of the most wealthy lives on the planet if you think broadly enough.", "NTA. Sounds like Nathan needs to examine the pressure he’s under (or feels he’s under) to be a high earner.  Obviously he feels he doesn’t have the option of taking a pay-cut and is jealous that you’re able to prioritize your happiness over money.  But none of that is your fault.\n\nIMO, he owes you an apology, but you could always clear the air and reiterate that you know he worked very hard to get where he is and that you’re not diminishing the that.", "NTA. But I think if you value the friendship you could apologize for the way you said it not what you said.", "NTA, specifically because you show a healthy level of self-awareness and are willing to reflect. He shot a dig at you that was out of line, you responded defensively (which is valid) and acknowledged that, and considered apologizing despite not being the one to commit the initial transgression. I think you’re doing fine, and your friend needed the reality check. I do empathize with him. I grew up very poor. Not just welfare poor, but spend-weekends-with-no-electricity poor. That sticks with you forever, and he is having a naturally difficult time seeing where he is now accurately. But he’s still pulling down a great salary and eventually needs to realize that.", "NTA. Sounds like Nathan is jealous of you achieving your dream job; a true friend would rejoice for you, regardless of the money they make - let alone when they make 3 times as much as you!", "NTA. Even without the debate of whether your friend is considered privileged because he worked hard for his money, that’s just not something to say to a friend who landed their dream job. He sounds bitter. Why did he even need to bring that up?", "Nta. You have nothing to apologize for", "NTA.  But I think the point you may miss is that if you were to fall there is always going to be someone to catch you.  Nathan does not and has never had that peace of mind.  Privilege can be connected to money, but typically involves a sense of well being and absence of fear.", "NTA but I think it’s time you start to distance yourself from Nathan. You have grown apart. Your values no longer align.", "both, he made a snarky remark and you called a man who worked out of poverty a privileged person.", "NTA. Nathan sounds bitter.", "NTA you worked hard to get this new opportunity! You were excited to share the news! He didn’t need to rain on your parade. \n\nI had a similar experience few summers ago I worked at wildlife sanctuary and it was absolutely incredible- but my bestie assumed my bf was paying my bills to allow this. Nope! I spent every dime of my savings to go through with this shitty pay, terrible hours opportunity- because it was truly a once in a lifetime experience, and we helped sooo many animals 💕 was expensive as hell and I had no trust fund to fall back on, but we all get to make our own choices. If this guys making 300k and not enjoying his life, he needs to set boundaries or start planning vaca he can’t still be jealous! Or maybe he wishes he could be doing the new role you got - but he’s so deep in the rat race he can’t afford a pay cut now? \n\n\nEither way, congrats on the opportunity OP!", "Nta, dude needs to wake up and realize how miserable he is and make changes if he wants something different.", "NTA - I like how you are reviewing and consistently thinking about your privilege. This resonates with me because I similarly started corporate, went nonprofit, and took a paycut to $75k to do something I wanted to do. He's absolutely right that you do in general have privilege, but in this moment you were asking him to be a friend, not to have a broader conversation about social ills. You're right to bring up that he's currently making $300k (crazy?!?!) - you both aren't in the same level in this life, even if you do have white/generational privilege. \n\n&#x200B;\n\nHe didn't respond in a friendly manner, and so you were almost obligated to respond to that rather pointed passive-aggressive response. NTA", "NTA. The difference between you and the whiney rich kids is that you at least acknowledged that what you said may not have been the best thing at that moment. And are mature enough to consider that you might be wrong. Whiney rich kids would not admit it and likely hold a grudge against you. Also, congrats on your new job!!", "Neither of you are the AH. You understand the pressures of those kinds of jobs and you don’t know what his financial responsibilities are re dept, family, mortgage etc I think it speaks volumes that that was his first comment: he’s not happy where he is and maybe he’s a tad envious of you. And I think most people would have reacted like you. But whilst I think you’re NTA I think you do need to apologise (as will he probably when you apologise) as I think Nathan needs someone to talk to (even if it’s just a rant about work to let of steam).", "\n\n>him that he makes triple the amount of money I do, and that at some point he needs to realize he's now got privileges *of his own* instead of pointing out mine (emphasis mine).\n\nNTA *if* you qualified it like this. \n\nOtherwise, as you said, generational wealth is not to be undermined or ignored. \n\nAnd, regarding this point, he may now be supporting other family members, which could make even *that* salary stretched pretty tight.", "Once a person comes to think of themselves as oppressed, a person of a different race/class will always be considered privileged, regardless of the current status of you or them.  You could be homeless, and they are in a mansion, it doesn't matter.  It's a psychological status.  When they use the word \"privileged,\" it is best to acknowledge, ignore, and move on.  You're not going to affect their thinking, and you shouldn't let it affect yours.", "Why is everyone here forgetting about taxes when they talk about how lavishly a single person can live in a HCOL area. I make nearly 250k in Seattle with no dependents. My tax bracket is over 30% and would be higher but I put max out my 401k, my health account and my catch up. There is no state tax but we have very high sales and gas taxes. I live on less than 40% of my gross. I live well with no debt but not rock star money.", "NTA... but that doesn't mean that your friend is AH either.\n\nObviously what's happened here is that you told your friend of this new development expecting him to be happy for you and what you got was pretty much derision, which is pretty rich coming from a guy whose making bank. I don't blame your reaction.\n\nThat said though if I was you and you cared about this friend I'd take a little bit of a longer look at why he said what he did. Seems to me from the little you've given on the matter that he seems pretty stressed at his position in life and might even feel that he's trapped, especially if he's funding a bunch of family member's from his income.\n\nIt might have felt like you bragging your freedom to him by saying what he might interpret as \"I've got this great job that I voluntarily took less money to take and things are still great look how good my life is\" when he, for all liklihood, could be drowning under living expenses, debt, and giving handouts every which way.\n\nNot saying that you're wrong in anything here - you're not - but it might be worthwhile to look at this at another angle or something.", "I’ll NCBH inever", "NTA, but consider that Nathan might also not be the asshole, and if you value your friendship, offer an apology. He might surprise you and also apologize.", "NTA. \n\nAt best, that was a shitty response from him.  \n\nAt worst, he is trying to play the oppression olympics even though he is a 1%er", "NTA I think in his heart he hates his job and even though he likes the money he makes, he's a wee bit jealous of your joy and contentment so he made a petty comment.", "You've made the choice to be happy in life and have a work life balance, there is nothing wrong with that.   Your friend is privileged, that is his choice. \n\nNTA, people need to stop being surprised when they are told the truth.", "NTA. he's privileged in a way and so are you but he needs to keep his nose out of it and worry about himself. \n\nCongrats on the job!", "Personally I think neither of you have room to talk at this point.", "NTA. he wants to play victim(and sure in his younger days it sounds like he was) but hes the one with the privilege now. he needs to under sand that not just be some ahole", "NTA, but maybe you should've used your silver spoon for something other than stirring the pot! 🥄😂", "NTA he is probably envious that you are pursuing your dream while he is still trying to reach his.", "NTA\n\nIt sounds like he's jealous deep down that you have a job that brings you happiness, whilst he slaves away at a job that drains his soul. Sounds like it's made him bitter and miserable and unable to be happy for others.\n\nMaybe he feels he has to earn so much, and keep a job he hates to help his family and is thinking your privilege is that of only supporting yourself. But even then. He's the A and he needs to work on himself.", "NTA. He’s probably unhappy but knows he has no support system if he wants a change. I’m guessing it was a bad day. He should apologize.  Congratulations on the job", "NTA. He makes an (I’m assuming very stable) $300,000 a year and has lots of room to save for a crisis since his family can’t help him. He doesn’t get to cry about the fact that making that much makes him privileged when it very much does.", "NTA. \n\nUnfortunately, he's experiencing a thing a lot of poor families do. They exploit the kids who get out. \n\nHappened to both my mum and dad, my dad now struggles financially.\n\nBut all their siblings benefitted. It's family comes first, until you've been bled dry and they don't need you anymore. \n\nMy parents just assumed they'd help them when they needed help, the same way my parents helped all those arseholes. As kids we all watched our extended families get nice things whilst we lived in poverty as a result. When my mum died, all the people who owed her money acted like they didn't. \n\nNow my dad needs help, from his siblings and they've all conveniently disappeared. I'd help but I'm out if a job and applying. \n\nYour friend needs to realise it's not his job to support them all, but he won't hear that because he's been brainwashed into this since he was young. After all, family always comes first.", "NTA but some people never get over having been poor\nHe may never feel he has enough money", "INFO:  What does their and your debt look like?\n\nYou said your parents haven’t helped you *since* college.  That implies to me they paid for your college.  That could be wrong though, but if it is, your friend didn’t have that same support.\n\nAnd if living in a HCOL, is potentially still paying off that debt.  Especially coming from a poor background, that increases the chances of poor financial decisions earlier due to lack of understanding long term consequences.\n\nSo while you may have come out of college debt free able to do whatever you like, he may not be in the same boat.  And depending on the interest rate, may have a lot to pay off.\n\nI had two associates who were married, and while their parents weren’t poor, they weren’t able to help them much in college.  Combined they had somewhere between 200-300k in debt from college (I don’t recall the exact number).  \n\nThey will be paying that off for decades even with decent jobs.  That could be the case your friend is in which is why they said that.\n\nOr they might just be a dick.  Hard to say lol", "NTA Granted he left himself out of the statement, but his mindset no longer mirrors his circumstances and he can't play the \"Oh woe is me\" card when it no longer applies to him or judge others falsely based on his preconceptions.", "ESH. Your friendship should be worth more to you than your salary comparisons. You should apologize to each other.\n\nI wasn't there but all he said was \"I'm glad the pay cut doesn't mean you can't accept your dream job.\" I don't actually even understand how that's offensive. Especially since the only way he could make that comment was if you were being weirdly explicit with your salary information in the first place.", "You are both privileged in different ways.\nGood for you.", "NTA. For context, I grew up in extreme poverty and still fall well below the poverty line. I would never in a million years DREAM of saying some shit like this to a friend who just got a new job. Who does that?? What happened to, “Congratulations! That’s awesome. So happy for you!”??? It’s that simple dude.", "ESH. It's not fair for him to crush your excitement about your job, an appropriate response would have been \"Congratulations\" and he could've kept his comments about your privilege to himself.\n\nHowever, you absolutely are in a privileged position still. By your own account you have the freedom to make risky job changes because you have a safety net. He makes a lot of money, but if his industry were to collapse and he lost his job, he has no one to help him like you do.", "Meh. NAH  Neither of you are saints here but you’re not total assholes either. He needled you about your privilege and you essentially called him out for starting poor. Y’all need to grow up.", "NTA. I'd say no in this situation. However, my typical governing beliefs are:\n\n1. we don't punish the vulnerable, and that doesn't mean in the moment, it means evaluating people over their lifetime and acting appropriately around their circumstances. In this sense, laughing it off may have played off better- you give him the acknowledgement he needs knowing he might never have the opportunity for his dream job if it means a pay cut.\n2. considering we can't just let people walk all over us, there is some nuance to setting your boundaries, especially for sly comments that come off rudely. In this sense, \"I also do think it was a bit mean of him to say that at that exact moment when I was so excited.\" This is exactly what you should have said in that moment.\n\nOverall, ya, it was rude of him, and vulnerable people need to lead with vulnerability- otherwise their situations come across as rude, ie; this scenario exactly. So, not the asshole because rightfully you did not initiate. However, the whole thing seemingly could have played out better.\n\nRegardless, good luck with your friend! I hope you guys get over it and continue supporting each other.", "NTA. He sounds bitter without reason.", "NAH.  Feeling secure is privileged.  Earning $300K is also privileged, but after a lifetime of financial insecurity it might not feel like it.\n\nI'd just let it go with a resolve to try to see the best in each other, ask for what you need from the other and agree you won't always be able to relate to each other but you can always try.", "NAH ...he's making good $ but most likely still unhappy so his knee jerk response was to shame you about your 'privilege' instead of simply celebrating your good news.  People take jobs for less money for all kinds of very logical reasons and dream job is a good one!  He was probably just having a bad day and had the wrong mindset at the time hope you can talk it out and be ok.", "NAH while he may not have financial issues anymore, how he was raised is likely a big reason why he is so financially ambitious, and how you are raised is a big reason why you aren’t.", "YTA here is the thinh OP. You still are the financially privileged one. You KNOW you have a safety net (privilege), you do not have to be the safety net for others (privilege), you can afford to take a pay cut (privilege), and were supported by your parents through college (privilege).  Paul has no safety net, is the safety net and is actively.supporting others, didnt get support in college, and cannot afford to take a pay cut. He is NOT privileged compared to you. And he told you that. Your response was to call him a liar. You were a tone deaf, classist, privileged, clueless asshole.OP, time to apologize.", "YTA, even when making 300K he still has a poor mindset, that can only tell my he takes less than 300K home, be it from savings, helping his family, debt, etc. And he know his world would come down if he lost his job, and he doesn't have somewhere or someone to fallback on.\n\nYet you come and tell him that you will gladly take a paycut for a dreamjob, would you take another bigger paycut if it was for a more dreamy job than your current one? Most people don't have that luxury.", "NTA\n\nIn no world were you being an AH or insensitive. Your friend was being both. It’s ridiculous to think anyone will feel sorry for him. If he supports people, fine, he still makes a fortune and has choices.", "ESH. He was an AH first with his reaction to your news. But you also have a safety net that he doesn't. If you both lose your jobs, you'll be better off then he is because you have family to support you. All he has is whatever savings he set aside. He has no one to rely on except himself. Your comment that he was privileged is true, but blind to the effects his impoverished upbringing still have.\n\nAll in all, you both sound like a couple of privileged assholes being jerks to each other.", "Nta.  Speaking as someone in Nathan's position it's hard (granted I'm making close to 100k).  You don't know it till you're there.  I think you both need to cut each other some slack.  He's 25 and that money doesn't seem real yet.  He's still probably scared to spend it and has a lot to work thru.  You on the other hand haven't had that experience.  You've been able to chase your dreams without the pressure of poverty on your back.  It doesn't mean you don't get to be happy but it is hard for Nathan to understand how you aren't scared and flaunting your fearlessness and proceived generational wealth.", "ESH, don't tell your friends how much you make. You can still discuss work without the money. If you want to talk stock & investments, you can still do that without the #.", "NTA.\n\nThe means and ability to criticize other people for their 'privilege' is a privilege in and of itself.", "Yeah he makes $300K but do you know how many people he 'supports' on that salary? How many relatives have their hands out and guilt him into supporting them?  A house here, maybe college tuition, need some money for food, Uncle Joe is in the hospital, etc. He makes an astounding amount of money but he might not be able to spend it all on himself now.\n\nYou, however could 'afford' to step away from a similar high paying job into a series of lower paying jobs. Yes, your parents do not support you financially now, but if you needed it, they could support you. If Nathan quit his job tomorrow or was fired, who is going to support him? You also are only supporting yourself at the moment- could you support a wife and a couple of kids on the salary from your dream job? Could you keep up with the rent/mortgage, food, clothing and educational needs of your children on that salary? Or would you feel pressured to stay in a job that you didn't like because you have to support other individuals?\n\n$300K is an unimaginable salary to most people but we do not know how thinly he is spread. Yeah he makes a lot but he may also be responsible for maybe 20 other people. He should cut most of them off but he didn't write in to ask for advice. You are also privileged by having grown up in a financially stable upper middle class family and having them to fall back on when times are tough. You didn't have to worry about being kicked out at 18 and worrying about how to pay for college while working or being stuck in a soul crushing job because you have student loans to pay back. You can 'afford' to have a 'low' salary because you have a safety net- a lot of people don't.\n\nThere are many different types of privileges and you and your friend represent two types. You might think that he is unaware of his privileged status now but you are also downplaying your own privileged back ground. A lot of people here would love to be able to take a job that they liked without having to worry about finances. If you want to keep this friendship, you'll need to agree to disagree.", "Yta. All his family is still poor. He needs to take care of his parents retirement.", "NTA\n\nEveryone has different struggles and hardships in life but that doesn’t mean Nathan should slap you in the face with his. His struggles are not your fault. Idk why people here are saying you also need to apologize to him, because who wouldn’t get snappy and defensive when their friend says something completely unnecessary when you’re excited to share good news with them and didn’t do anything wrong? I also don’t know why people are saying E S H just because you have the privilege to take a lower paying job. That doesn’t make you part of the blame here. You wanted to share exciting news with a friend, he just gave you an unnecessary and resentful reply back when he should’ve said congrats. Privilege on either end or not, that makes him the AH and not you.", "Nta, in my opinion, it's important to recognize privilege.\n\nThat said, most people don't bring it up in conversation in good faith. It's almost always used to cause argument and division.\n\nYou are not adding value to a discussion by telling a  white person on welfare they have white privilege. \n\nEither they're too racist to understand and care, and you're just throwing shit, or they understand and likewise you're still just throwing shit. \n\n\nI don't think it's good for finding common ground or understanding to accuse people of having privilege. \n\nThere's always a better way to explain things.\n\nIf someone is saying something like \"I was poor and worked my way up, why can't you do it too?\" Rather than saying you had X privilege, try explaining the advantages they had that others didn't.", "NTA", "ESH.", "I don't think anyone's an asshole but I definitely relate to your friend. Growing up in poverty changes how people think and it seems your friend is supporting his family. It's great you found a job you love but growing up poor you never have that option. It's all about the dollar amount. I know I'll never have the opportunity to have my dream job. Even though my husband and I make a middle class living, we both grew up very poor. Money is and will always be an insecurity for us. So I get both sides", "NTA. No amount of money will ever be enough if you don't manage it correctly. Nathan is probably financially overextended. I'd also guess he's unhappy at his job, and seeing you're neither of these things has made him unkind.", "NTA All these y ta saying his friend on over $300k isn’t privileged please tell me how much do you have to earn to be classified as privileged then. I’m not going to comment on where they live because it wasn’t stated in the post. I will ask if it turns out they live in a locol area will they change their judgement to NTA? Another way to look at it if his friend is helping his family because he has a great wage then his friend might not be privileged but if they can say op is privileged because his family can help him if he needs it then his friends family is privileged", "NTA, his comment was on the snarky side.  That said, I guarantee that even though he makes a good salary now, internally, your friend probably still feels like the poor kid.", "Dude. You need to go and read up about intersectional theory.\n\nYou absolutely are in receipt of privilege to have a safety net that generational wealth provides. He is disadvantaged.\n\nHe is absolutely in a position of privilege to earn what he earns. But he is clearly disadvantaged to not have a safety net.\n\nStop looking at privilege as a linear hierarchy.\n\nI experience white privilege because I am a white person. I also experience discrimination and disadvantage for being a woman who is also LGBT. It's not binary.\n\nYou're also failing to see it from his perspective in your argument as well. Not having a safety net is fucking scary. It's also probably fucking scary to take a big pay cut for a job you want. There's not a trophy for the most disadvantaged person.\n\nSoft YTA. Mainly because you are only seeing your world view and discounting feelings and opinions that may differ to yours, and THEN using terminology about privilege that you clearly don't understand beyond what serves your opinion.", "NTA just because he grew up poor does not mean he needs to shit on your dreams. All these comments are showing people's biased, if anything it's NAH because he's been through some tough times. It's not OP's fault he grew up poor.", "ESH. Him busting his ass to get to where he is is not a \"privilege\". You are indeed privileged to be able to make the decision \"I'll just make less, if it goes wrong my family got me\". That's what financial privilege is. He's probably working his ass off to be able to give his kids your privileged life. \n\nHowever. His remark towards you makes him just as big as an AH. That's not what a friend says to a friend when he lands his dream job, even if it is possible by financial privilege. That financial privilege was gained by someone back ik the day who earned it all the hard way. He can't fault you for being born into a family like that.", "ESH in my option. It was rude for him to say that, and I never would... However, I'm in a similar position to him and I can say that making his salary while having no financial cushion in terms of family (at least the first maybe 5-10 years at that income level), you'll still feel like you're living without a safety net. It's not a mindset you quickly leave behind. Ask folks who lived through the Depression or other similar circumstances. Certain kinds of financial duress stick with you. \n\nI grew up dirt poor and struggled financially until well into adulthood. I had relatives who constantly needed support from me if/ when I had the means to help. I still do. Now my husband (grew up lower middle class,\nstill no family safety net whatsoever) and I have an income not quite at your friend's level, but in that general range. We have no kids but we live in a HCOL area so that income level is by no means comfortable. It was okay-ish before inflation but not now. \n\nWe had several family emergencies this year. It feels very scary. Our income is no match for the COL where we are thanks to inflation and these emergencies. \n\nWhen you grow up without a safety net as we did -- you feel it. We hadn't had time to build up a safety net when the economy took a turn, when inflation rose, when the emergencies happened. So do we feel like my husband could switch jobs to one where he loved the work but took a pay cut? No. We are barely getting by as it is. (I am a WGA writer and we are on strike. So, I am desperately seeking work outside my field. But generally speaking it's my husband's income that reliably pays the bills.) \n\nI understand where your friend is coming from. I would never say something rude or unkind as he did. But his current paycheck doesn't erase the poverty he might feel as a result of the way he grew up. It doesn't just disappear because now you make money. It might take years of savings for him to feel safe. He might never depending on the severity of his circumstances. \n\nWe have friends who come from significant generational wealth -- some were gifted homes or down payments in one of the top 3 most expensive housing markets in the country. We cannot even dream of home ownership because we don't make enough to have extra. We don't have any hope of any money coming from somewhere other than paychecks. No inheritance, nothing, \n\nBecause of the needs of family members outside my 2-member immediate household our income always got spread a little thin. Your friend might feel the same way. So, I relate far more to his mindset than yours because I grew up similarly to him. \n\nStill, I wouldn't have spoken like he did. I would have kept that observation to myself. As I do all the time now that I see others with family help getting to buy homes and do vacations abroad while my husband and I struggle on what should be a good income... but just isn't enough to cover the COL where we live beyond just paying the bills. \n\nIf your friendship is valuable, have a calm conversation about the fact that you wanted him to be happy for you and you were hurt by his initial response. But that you also understand that YES it is a privilege to switch jobs and afford to take a pay cut. (We had a friend do that recently. She comes from great wealth.) He was rude to say it, but it's not untrue. You both need to apologize and deal with each other more kindly.", "ESH. You're both being insensitive. He's jealous of your new job, and it's because his \"privilege\" is very much dependent on never taking a job like yours.\n\nSounds like his entire extended family is dependent on his income and you know full well he has no safety net if anything goes wrong, while you can openly admit yours will never need your help and in fact would easily solve any financial trouble you get in to. You're in very different places. Him making $75k a year would by no means make you equal, it would mean you're a lot better off than him. You get that, right?", "Doesn’t seem like a good friend tbh", "Back to the topic. Op is NTA but I hope you two can patch up because old friends are the best friends, and this was just a little dust up, not a big deal. I think the friend wasn’t trying to be mean, but rather was truly happy for OP and maybe it came out a little clumsy but his heart was in the right place. OP, I think you didn’t need to get all huffy about it but NTA.", "I don’t really feel that terrible for anyone making 6 figures. But I do think you probably have some privilege that you can afford to do whatever will make you happy, and only worry about himself. It sounds like his family has become his financial responsibility, which has forced him to stay in a soul sucking job that he’s not happy with. There’s probably a lot of pressure and guilting involved for him to provide for everyone. But he still should have put that jealousy aside and been happy for you as your friend. Overall I would say NAH. Congrats on your job, and hopefully he can say the same after you both cool down, but he’s also not wrong about you being lucky to have the freedom to pursue your dream job.", "“Privilege” in most instances is a bullshit concept.  This is one of them.\n\nESH.", "ESH.\n\nYour friend sucks for giving you that crap when you told him about your dream job. But you called him privileged when he seems to have worked his way into the position he is in. That's hard work, not privilege.", "You totally overreacted and snapped at an innocent comment.", "INFO: does he have college loans to pay back and do you? If your parents paid for, or are still paying off, your education costs while he has loans he’s paying then yes that is a privilege he doesn’t have to take such large pay cuts for a better mental (and often physical) health situation doing something you love working fewer hours", "ESH \n\nNathan for popping your excitement bubble- that was a bit mean-spirited to say the least. \n\nYou... well, you touched on it in your description. Yes, Nathan is earning four times more than you will be- but transgenerational wealth is absolutely priceless. You learn things from an early age that us poor kids might not find out about well into adulthood- how to speak, how to carry yourself, who to talk to, how to BE. If things go drastically wrong for Nathan there's no one to bail him out- he's on his own. \n\nMy parents were poor, their parents were poor, _their_ parents were poor- basically, my entire lineage is peasantry. So when I was the first person in my family to go to university there was no one I could ask about things I didn't get, no way for me to find our the things I didn't know I didn't know! The wealthiest person I'd ever met was an auntie we thought was rich because she had a BMW.\n\nGo back to your friend and let him know that while you didn't appreciate having your parade rained on, you take his point- if you do.", "You are privileged to be able to accept a dream job because you’ve never lived with a fear of not having enough. My neighbor’s kid is going to NYU studying Social work. Costing $90k a year to eventually make $60?  My kids have always felt they have to pick a major that will afford them a good living   Their majors are demanding,  her child has no stress and never has. Mom is going to subsidize her daughter’s salary if needed. When my kids finally make a good salary I would hit the roof if my neighbor tries to say my kids are now the privileged ones. Do you actually think you’re not benefiting from a safety net and a safe future? You’re unaware of what it’s like because of your privilege.", "I think what he said to you has little to do with you and all to do with his insecurities. It doesn’t matter how much money he makes, he wish his family had the stability and prestige of generational wealth and that he can’t buy. I feel sorry for him - he clearly feels he is never going to be good enough. \n\nI would brush it off completely and maybe even apologize to see if that cools down and repair the relationship", "YTA but a little one, not massive TA for two reasons\n1. Nathan told that because it might have occurred to him a lot of times of he could relax or step back or prioritise peace. He can't because he doesn't have the cushion to fall back. Even though he is earning 3 times more than you, he might still not be in a position of privilege, considering he supports his family too.\n\n2. You could afford to do that because you know nothing might harm, not you will push your family and create inconvenience to your family. So that's real. \n\nGenerational wealth and support comes a long way. Though you don't take any support for family, they are also not dependent on you. But Nathan can't do that he might bring back his family to poverty if he wants to. He definitely is shouldering a bigger financial and mental burden.\n\nKindly be empathetic. Having said that he should have congratulated you on getting what you wanted for long.", "ESH. He is def privileged making 300K a year, but so are you in that your family is of means and you do not have to worry about supporting your family (and they would be able to support you if anything were to happen). Sit down and make up. both of yall are lucky to be where you are.", "ESH. \nNathan sounds bitter and shouldn’t have reacted in that way. \nBut I also think that I can see Nathan’s side, even if it’s clouded by bitterness. Time and time again we see people who have come from financial privilege feel free and able to make choices like go into risky fields like the arts, or take a pay cut to do something they are truly passionate about. This in itself a privilege. Nathan may be making a lot of money, but he is compromising his lifestyle for it. \n \nHe knows what it feels like to be poor and never wants to feel that way again, even if it means selling his soul to corporations. I don’t think he’s as privileged as you are so I agree with him. \n\nI don’t think you’re the only one that owes the other  apology - but a good conversation about it with him would be good for the friendship. Something along the lines of, “hey I get where you’re coming from, I shouldn’t have said you are more privileged than me - but it really hurt me when you reacted that way when I was excited about my job etc”", "YTA You lack self-awareness and clearly don’t understand the position your friend is in. He’s under a lot of strain, while you keep taking pay cuts and quitting your job. How do you think that would feel to you over time? People who have generational wealth don’t get it.", "NAH\n\nComing from an impoverished background doesn’t give you the right to be mean when your friend tells you about a major positive life change. But it also doesn’t make him a bad person, probably just a tired/jealous one who wishes he doesn’t have to corporate-grind away fears of falling back to poverty + any potential obligations to family. It also doesn’t make you a bad person for feeling bad your friend’s not happy for you. \n\nJust talk to him, if he’s your friend then I’m sure he is happy for you but just unhappy and jealous in the moment. And I think jealousy is okay, but if he actually does resent you for not having to support your family + can have them support you in emergencies then he’s not a good friend. \n\nAlso absolutely don’t base your perception of Nathan’s choices on people here who tell you he’s “not obligated” to support his family and its a “choice he made” as if anything like this is as black and white as a single decision to be made. Bunch of misanthropes with no regard for other people’s situations or feelings.", "The kind with a chip on his shoulder. He may be earning a lot but inside he's still that little poor boy with an inferiority complex and it makes him angry that *his* happiness is tied into his net worth while OPs is not thus the pay cut not being a problem.", "The kind that can’t let go of his resentments", "The kind that wants to quit their job and do something similar but can’t because he has a ton of people relying on him. He’s bitter about his own circumstances. I’m not saying his response was appropriate but OP could extend a little more grace.", "This is the answer. It's very likely that he has unresolved issues about how he grew up and/or family pressure that could be really frustrating or toxic. But a friend doesn't take that out on a friend who has something to be legitimately happy about.", "Working in finance at a large firm changes people, and not for the better", "I mean we don't know OP's friends actual circumstances. OP himself said that his family relies on his income and we don't know whatever loans he's gotten to get himself in the position he's in - so while 300k is a whole lot of money, you don't know how much of that he gets to keep after all of his costs. Especially since being a Vice President of a company does entail needing to spend a lot of money to maintain a lifestyle that befits that position, which may seem like a \"oh poor you\" moment but in higher up positions if you don't live the life those around you live then you won't be keeping that job for long since it all relies on connections and perceptions.", "The guy wasn't whiney.", "[removed]", "LMAO 300k is in NYC or another major area. Nathan is prob paying 2k plus a month to share an apartment, has massive college loans, and is funsing his family. There is zero way to reture in 5 years even if all expenses were paud.", "As someone who makes $200k with low expenses, this isn’t nearly enough time to build the kind of “retire early and live off it” level of wealth. It definitely makes things comfortable, but it’s not a magic bullet. When I was making 29k/year I figured this level of wealth was fuck you money, but the reality is most of this higher level of income just serves to moderately save for the future and properly take care of things all of us should have access to.", "I'm confused by the whole giving him grief over a 5K pay cut.  I recently took a job with a 5k Pay cut, but my take home is more now because the benefits are so much better.  I now pay monthly what I used to pay weekly for insurance.", "You need to work the time you need to get vested in the retiree insurance plan.  You don’t just quit thinking you have a ouch because one good illness/accident will leave you broke", "I don't even make half of what OP does, my jaw was on the floor when I read the guy making 300k is talking about privilege 😂", "u/AncientMesopotamia\n\nEveryone is debating who is more privileged between the two of you, but I don't think that's the point.\n\n* You are privileged. I hope you recognize that. Many people hate their jobs, find it exhausting, and find that it's sucking the soul out of them. Not many people can decide to quit that job to get 30% of what they would have been able to get otherwise. The fact that you can make that decision and then take ANOTHER pay cut without thinking of future considerations, means you have a privilege that 99% of people do not have. I hope you understand this.\n\nAll this doesn't make you an asshole though. Maybe just a tiny bit out of touch with reality.\n\n* Now, Nathan is clearly feeling something. I don't think he needed to express that to you. I think \"Congratulations\" should have been the word that came out of his mouth. For that you are NTA - he is.\n\nWe all get defensive, and your response to him was defensive and in some ways, true. I think it's important to have a conversation about this if you value this friendship. \nHe certainly owes you an apology for how he handled his resentment. But I think it'll help if after this apology, you at least acknowledge that you understand where he is coming from. The fact that he makes $300k a year doesn't mean he gets to see even half of that, and that may be a frustration that has bled into your relationship.", "Probably he feels pressure to stay in a job he doesn't enjoy to help out his family. Which does suck, but this is not the place to express that.", ">He is still judging you by your parents income and not your current situations.\n\nThis, so much this. The OP has parents who could potentially help him if he needed it, but it doesn't sound like they are funding his lifestyle so he can hop from non-profit to non-profit. OP made a choice for their life and that very likely came with a downshift in lifestyle. \n\nThey value enjoyment over money. OP's friend values money over enjoyment. Neither choice is wrong, but since Nathan is the one being judgemental he's the asshole.", "Nathan just made it. He has no one to fall back on and is likely the backbone of his family. People who haven’t been and will never be in that position have no idea what it’s like. OP can afford a pay cut because he know he has a support system if things sour.", "This answer is pitch perfect.", "I understand his bitterness at working a shitty job and feeling jealous of a friend who is able to work a better job for less… but expressing that bitterness in this way makes him an asshole. \n\nAs we age we will ALL have lots of things that we feel bitter about.  Much of that bitterness is even justified.  Managing bitterness and not letting it curdle is a core part of not becoming a giant asshole.", "I would go with ESH because as someone who grew up poor AND OP is taking a paycut TO my current salary thereabouts, I'm not interested in asspatting two rich guys having a slappy fight over who's got less riches.\n\nBut I will say that my job pays me fine, I'm perfectly OK, and still the idea of leaving this job without another one that pays just as well waiting for me to land me on my feet is terrifying. I'm one restructure away from being not only poor again with no support, but poor with no support and student debt. So yeah, it kinda is op's privilege to know he can just leave a job and get a new one that gives him less and know if he screws up, parents are there for him. Bit that's hardly a moral failing! Both these guys sound insufferable anyway so ultimately who cares.", "This. The guy might be an AH but he’s not privileged. Making 300K doesn’t necessarily make him privileged. We have no idea how much support his family needs or what his student loans are costing him. He’s not in a position where he can take a pay cut to pursue a dream job, without bad stuff happening to his family. That is a privilege OP has and his friend does not.\n\nAlso, privilege usually refers to things outside your control, not something you earned by working for years.\n\nEdit to add: He’s not more privileged than OP.", "You are extrapolating a lot from limited data. And so what? Even if you are right he straight up trashed op out of nowhere for getting a job opportunity that they'd been working on for a long time. That is the definition of a shitty jealous (asshole) friend. Op is nta, and there is absolutely an ah here.", "Completely agree with this.  I feel op's friend's pressure.  I have to make as much as I can because no one in my personal orbit is reliable.  I would love to take a charitable position or a research focused one,  but if something happens to me there are a lot of people with big problems suddenly.  I make a lot, I'm comfortable,  but OP does not understand the eternal gun to your head of it could all go away so quickly.", "The friend is still the AH for making that comment when he did. I can understand why he is bitter, but that doesn't mean he can take that out on his friend. I have a feeling OP never would've said what he did if his friend didn't make that comment first, right after hearing of OP's new job.", "I agree with NAH. On its face, what the friend said was true. Depending on how it was said, it could be supportive or a dig. The friend may have been genuinely happy for OP that he was able to do this (maybe it’s different where y’all are, but where I am $75-80k is a solid living for a single person - it sounds like neither of you are experiencing financial hardship). The friend is probably jealous that OP is able to work his dream job, but that doesn’t mean he isn’t also really happy for him. \n\nOn the other hand, it could have been an insult like how OP interpreted it. It’s hard to judge without being in the conversation. Either way, this doesn’t seem like something worth ending years of friendship over. I think y’all can talk it out, just be open about your feelings.", "Yeah, it is true that it's Nathan's choice to give money to his family, but what OP and a lot of other people here don't seem to want to acknowledge is that it's a privilege to never have to choose between giving your family money and knowing that your mother won't be taking the medicine she desperately needs this month because she can't afford it. Like yeah I guess that's a \"choice\" but come on.\n\nThat said, NTA. I can relate to Nathan but that's no reason to be a duck to my friends.", "And can we all acknowledge it's 300k gross. I make 6 figures and am totally happy to pay my fair share of taxes but that all said and done i get 55% net after taxes, paying for benefits, and 401k contributions.", "He absolutely is underestimating the pressure and reality of Nathan’s situation. People who come from comfort often do. I’d never feel comfortable taking a pay cut. There’s no one to fall back on. I can’t put that pressure on my mother. OP doesn’t get that. He’s clearly  free to do whatever.", "Op never said he wasn’t privileged tho, he’s just pointing out the irony in someone who makes 300k saying he’s privileged. He literally said “he’s got privileges of his own instead of pointing out mine” OP acknowledges he is privileged, but his friends comment was out of line. I don’t see how OP is at all wrong", "Dude's making 300k, he can stfu and be happy for his friend. I get that he has to grind for his family, but he can keep it to himself instead of being such a dick.", "Idk if being able to make only 75k a year is a privilege.  That's good money. Making 300k is definitely privileged.", "This sub is incredibly sexist to be fair.", "I see where Nathan is coming from. And being someone who also doesn't have a safety net to fall back on, I would never use a moment of happiness to tell someone they're lucky to be privileged. It was something OP was happy about. \n\nNathan didn't have to use that moment to focus on how he needs to work so hard to build generational wealth for his children. \n\nSo I think OP is NTA.", "So why would OP be an asshole? Nathan called out OP, not vice versa.", "Honestly Nathan makes 300k a year. He chooses to support his poor family (theres also no indication if this is his innediate family like wife kids and parents or his whole extended family) and in the end thats his choice and the reason why he feels like he \"cant afford\" to take a pay cut. Even if Nathan is jelous of the support OP has, if he was really a friend he wouldnt of taken the opportunity to make a jab at OP for getting their dream job. Not every person gets this opportunity and would kinda expect support from people who call themselves your friend. OP's feelings arent any less valid on his friend being rude than nathans are about his own situatuon.", "I think the other part of it that people have a hard time understanding about the corporate world, especially at that level is poverty-mindset with the constant pressure to keep climbing. If you’re not actively doing better quarter after quarter there is this overarching threat that you will be pushed out of the industry. Keeping up with your peers and grinding out the competition is so exhausting, I can see how he feels resentful, bitter and feels like he’s trapped.\n\nBut also, he shot the first shot so to me he is first and foremost TA.", "What a stupid take", "That guy is earing 300k a year he has a safety net, it's called money. He could literally put 200k a year aside and still have a well above average income. I would argue that in this point in time he has a bigger safety net than OP because if OPs family is middle class then they for sure don't have 200k laying around.", "There are so many comments in here about how Nathan is *choosing* to help his family, so that’s on him… It’s really gross. Like sure I guess he could choose to watch his loved ones suffer while sits on a pile of money. Maybe these responses are split between people who would do exactly that and people who would never consider that an option. I appreciate your Dad’s story.", "I also want to say there is a difference between supporting your immediate family who may be working as hard as possible but just hasn't gotten the break they need and supporting a deadbeat family member who just refuses to try. I feel like it is the former with Nathan. Plus if he is helping his family they can eventually buy a home and get their own security from equity and maybe living closer to work so that overtime the burden isn't as high for Nathan.", "It’s not OPs problem at all if Nathan is CHOOSING to continue to spend significant amounts of money helping family out. And if he’s giving away any significant amount of that 300k then he’s a fool", "Regardless of privilege, it's rude to make such a remark about your friend getting his dream job.", "Nope, Nathan is rude", "In what way does OP seem pissy that Nathan makes more money? How did you possibly extrapolate that?? OP only said anything about Nathan’s privilege after Nathan needlessly and rudely dumped on him getting his dream job for no reason \n\nYour back must hurt from reaching", "He also has family asking him for money, whereas OP doesn’t. Makes you wonder if he’s saying yes a little more often than he should and may not be as financially stable as he looks as a result. That may be part of why he resents OP.\n\nOf course, this still isn’t OP’s problem and he’s still a bad friend for reacting the way he did.", "This is the real cause of any wedge in the friendship. ^", "Agreed. It was still an AH comment to make to a friend who is calling you with good news but when you have to pay a parent’s rent or they’d be homeless you don’t have the luxury to pick and choose your job. You often feel stuck. If you lose your job you could be homeless is also a scary thing to feel every day. You don’t get to take that dream job at a lower pay. You stick it out no matter how miserable you are until you can find something slightly better for the same pay if you’re lucky. (I am very familiar from personal experience.) \n\nI hope they can salvage their friendship. Letting the friend know they were hurt by their comment but also asking them how they’re managing with having to support family on their shoulders.", "That’s interesting, because I live in a LCOL area and have several friends who make well over $300k. One is in sales and another is a doctor. They both bought very nice, very large homes for under $300k, and are definitely going to retire early. I have no idea where you came up with this wild idea, and why people are upvoting you.", "You really don't lmao, my gf's dad is making 300k a year while living in buttfuck nowhere Ohio.", "$300k is definitely not upper middle class in an HCOL area as a single person lmao. If you had a family, then sure, but on your own that puts you solidly in the 1%, even in expensive cities like NYC and San Francisco.", "They said and retire in the *countryside*. There’s plenty of LCOL areas outside of cities", "It's ridiculous what they've done to the system that 300 fucking grand a year isn't life of luxury money.", "I agree (from experience) that $300k doesn't get you as far as you might think in place like SF or NYC, but there's nicer ways to go about saying it. No need to personally insult anyone.", "No offense, but you sound absolutely ridiculous and out of touch. $300k isn’t middle class in any metropolitan area in the United States. I live in one of the most expensive ones", "I do not live in a HCOL area. People absolutely make $300k here.", "Found the insecure rich person", "Is it really. 300k in a hcol is still an insane salary. You cant retire in 5 but most likely in 10 and  very comfortably in 15.\n\nLets say you want to live very comfortable while you work;\n\nRent; 5000 a month\n\nAll utilities internet etc etc; 900 a month\n\nGroceries: 500 if solo 800 if with two.\n\nInsurances etc etc; 1200 a month at most\n\nClothes/other luxuries like going out to dinner; 1000 a month\n\nCar gas etc; 1000\n\n\nAnd thats taking it broadly.\n\nYou'd still save 10k a month so 120k a year. In 10 years with interest you probably have 1.5mil and can retire in the countryside with ease. Hell maybe even get a mortage for 3-4 rental units to increase income. If you stack money for 15 years you have well over 2mil.\n\n\n\nAnd if you live a bit more normal (ie not having a ridiculous car and going out often) you can have much more.", "um...that's not rude at all...", "No you don't. Get up an extra 2 hours early for your commute.", "Damn who pissed in your cornflakes buddy", "This was a very rude way to say that.", "You can commute to that type of job. Where I live in NJ lots of people commute to NYC. Here an average single family home mortgage is $2100 while a 2 BR apartment in Manhattan is pushing $6000 already. Saving 4k on housing a month while adding 2 hours to your day in commuting time is how you retire early. You can also cook your own food and keep your entertainment expenses down by just having quality conversations with friends rather than going out.", "This is only if you're not budgeting your money properly. You can find a pretty nice 1 bed apt in San Francisco (you can also live in the suburbs for much cheaper) for $3500. That's $42k a year, or less than 15% of his income. The issue arises from people over spending on things they don't need to over spend on. You don't need to go to whole foods everyday. You don't need to get a high rise 3 bed apartment for just yourself. You don't need to let your family mooch off of you. If you budget and invest your money wisely, you shouldn't have to work until 65.", "Bad bot", "That’s what I was thinking , and either way it’s not OPs problem. There have been studies that even when minority groups make more money than their white counterparts they still have less wealth because they are paying for their families who don’t have anything. It’s unfortunate that the  privilege of being able to provide for your extended family turned into a burden he feels trapped in.\n\nEdit: there not they’re", "Yeah, my cousin's husband is in the same situation. My cousin/his wife is so materialistic to the core, to the point to where it's obnoxious. \n\nYou can tell he's miserable and his dream was to be a football coach. Well he's trapped now because he has to support her lifestyle, and she would definitely leave him if he didn't make what he's making now. She only dated rich guys, and it would not surprise me if she left him if he decided to work a normal job.", "My parents make millions some years and they sure as heck don’t give me money to help. Not that I need it my husband makes a comfortable salary so I can stay home and raise our spawn. But just cause someone makes money doesn’t mean they will give money to family that has less. FYI I’m their only kid.", "Nobody is owed help. Nope, not even family. 6 figures isn’t even very much nowadays.", "Oh no, how will he support his family with his humble finance VP job!?", ">I'm not interested in asspatting two rich guys having a slappy fight over who's got less riches.\n\nThat made me laugh.", "Privilege is layered. I think both of them are privileged in different ways but it is true that if he loses his job tomorrow and can't find a new job in 12 months he will see most of his savings (hoping he at least has a decent amount) go away. \n\nAlso, we don't know if his family still is working hard but is just not able to climb out of a poorer situation. I know plenty of people who work their asses off and are still not able to make a livable wage and others who barely work and are making 300k. \n\nMaybe it was poor timing to say that to OP. Could have been he recently had to help out his family in a big way and is a bit bitter. But this doesn't mean that both aren't privileged in their own ways and yes having a family who can help you in a heartbeat is also very privileged. I agree with NAH. \n\nAlso let's remember if he is making 300k a year half of that is likely net income after taxes, benefits (like insurance premiums), and 401K. Yes 150K is still a lot but rent can be upwards of 2.5K a month and COL is still is very likely high. Hopefully he is still saving 1-2k a month (which is very doable) in case he finds himself out of work (which right now white collar jobs are having big layoffs) and won't be in a bad situation with no one to fall back on if he can't get a new job right away.", "If he is having to support 20 people on that, it wouldn’t go very far.", "You all sound quite poor ngl. 300k is good but not that good 😂. Sure your friend said something a bit smart and should've been a bit nicer, but idk bout y'all if my friend took a worse job and then complains and how I'm privileged now and came from a way worse background how are you gonna be complaining about bro. He told you a fact and you got mad and seems like you're kinda insecure deep down that he could stick it out and now is reaping the benefits. YTA", "I think what they’re saying is that now the 300k friend is taking care of his family (mom dad, siblings, aunts etc)\n\nWhether they asked him too or not, he is, and now he feels obligated to do so and the only way to do so is to continue having a high paying job.\n\nSounds cold but he doesn’t have to.. I know that seeing a family struggle when you have is hard and selfish. But if this is going to effect his mental health and he’s going to be bitter about it. He should stop", "> We have no idea how much support his family needs \n\noptional expenses do not undo privilege", "Wish more people understood the nuance of privilege.", "Yes, making that much money is a privilege, but having your family to support you if you lost your job or got ill is a priceless security to fall back on. If OP lost his job he'd still be fine. If his friend lost his job he could be in big trouble financially quite quickly. The stakes are simply not as high for OP.", "That and I think people side with the rich entirely too often lol", ">You already noted that in the post you mentioned, OP was a girl, and the one here is a guy. People will say gender has nothing to do with it, but they are just in denial or simply not paying attention.\n\nThe two posts you are referencing have literally nothing in common.", "Yea the girl in the other post implied the guy would not assume she couldn’t afford the home if she were a man or a bit older. \n\nBut like… the economy is terrible right now lol", "I think Nathan misread the moment. This was his buddy he bitched about work with. He was trying to vent about how he hates work and slapped op in the face.", "Exactly. Just because you come from a difficult background that doesn't mean that you get to bring your friends down when they are sharing good news with you\n\nedit NTA", "Agreed. He took something that was happy for OP and ruined it bc of his own issues. It’s weird to jump to “you’re privileged” when you get the job you’ve been wanting.", ">thats his choice \n\nYou might say that it's a privilege not to have to make that choice.\n\nESH. Two people who are privileged in different ways arguing who is the least privileged. Puke.", "There is no way with taxes and the pre-tax benefits you have to pay you are making net 200k, let along to put aside. I would argue he makes 150k net (especially if he is single and has a higher tax credit - as I am in this situation), assuming that he is putting a decent percentage into a 401k which is a very responsible thing to do. I could argue he can put maybe 1-2k a month aside but that is still 12-24k a year, not even 200k.", "Without knowing where Nathan’s money is going no one can know what kind of safety net he has. He could supporting his entire family.", "You do not know how taxes work….", "This comment can’t be real…", "Being born into money is privilege. Working hard to secure a finance job where you work 60+ hours a week to make 300k a year after growing up poor is not privilege. Nathan is not privileged, his kids might be.", "It's a rude remark to say unprompted. It would make sense if OP got on his friend's back about working in high finance, but it wasn't. OP is privileged, but that doesn't make him TA, he wasn't gloating.", "So just because OP doesn’t have people depend on him, it’s okay for the friend to just shit on him out of nowhere? That’s not how friends (or even remotely polite strangers) would ever interact with each other", "No. I bet that rich friend abandoned his family the second he got to  100k. That's their usual behavior", "Agreed. He may feel the burden of supporting an entire extended family, either by guilt or by choice, and OP can focus only on himself.\n\nDoesn't excuse his actions, but may explain them.", "This is what I was thinking. After all, OP mentions that he knows his family would support him if something were to happen to him, and that knowledge (that he always has a safety net) IS a privilege that his friend doesn't have, so I can understand why he's jealous that OP can take the risk of taking the lower-paid, less-stressful jobs without worrying about what'll happen if something goes wrong and his savings run out, or someone in the family has an emergency, etc.\n\nNot that that gives him an excuse to be a jerk to OP about it, but I feel like OP claiming his friend is now \"the privileged one\" now when he's only had a few years of higher income (And likely has had to spend some of those paying off college debts that OP might not have had to) makes this closer to ESH than NTA for me.", "Oh wow your girlfriends dad?!? That changes EVERYTHING", "It's a salary that pulls you from middle to upper class, but not all at once. If you keep it up for 10 years, then yes.", "You have no idea what you’re talking about, I live in San Francisco. \n\n[As a household, you need to make $800k a year to be in the 1%](https://www.cnbc.com/2017/06/14/how-much-you-have-to-earn-to-be-in-the-top-1-percent-in-the-biggest-us-cities.html).\n\nI’m not saying he’s starving on $300k. Just that he is nowhere close to retiring and will probably need to work till he’s 65.", "But that’s like totally not true, is it now? At least check basic stats out before talking nonsense with such confidence.", "300k is absolutely life of luxury money…. Their point is that you would probably spend a decent amount of it living in a hcol area and aren’t retiring in 5 years. \n\nI make 1/2 that and my life is pretty “life of luxury” by most standards", "You should be able to save at least a 100k a year doing that, even in hcol.  I live in a hcol area and I know people making it work for 40-50k. They should be able to retire in 10 years or less fairly easy.", "The Northeast dominates the top 10 highest middle class salary ranges, with many middle class salaries between $60,000 to $170,000. Meanwhile, that same middle class bracket falls between about $35,000 to $100,000 in many Southern states. \n\nMaking 300k a year puts him above that", "[$200k a year is middle class in San Francisco.](https://sf.curbed.com/2019/2/25/18239828/report-middle-class-income-ranges-sf-bay-area-salary). \n\nThe guy in responding too thinks you can “retire to the countryside after 5 years making $300k” has no idea what he’s talking about. \n\n$300k a year in The Bay Area/NYC and you can finally start affording a decent 4 bedroom house after saving for a few years.", "Yes but not very many, they might be the 1% that do.\n\nPeople in HCOL areas also make $600k a year. We’re talking about OPs friend here who is still TA btw.", "No, but like OPs friend I’m what’s called a HENRY. \n\nOPs friend is TA btw, he should’ve congratulated OP for getting his dream job.", "1.5 million is pretty tight to retire before you’re 40. You’re going to spend the next 30 years hoping nothing bad happens and not really doing any travel. And also hoping it’s only 30 years, so maybe have to spend more money to take up smoking or something.", "Not to play devils advocate but your math doesnt math right. 300k is usually before taxes. So paychecks if we’re going off biweekly if we’re living in California on the bayside is approximately 6628 dollars every 2 weeks so 13256 a month. So they’ll only save approximately 4600 a month. Which is still a lot but no where near 10k", "So this person pays no taxes?", "Not if you’re paying 40% of your salary in taxes and putting aside pre-tax contributions, which you’re conveniently leaving out of this calculus. That will take you closer to 50ish% take home pay.\n\nNot arguing for not paying taxes, I think a high tax rate in this bracket is appropriate.\n\nBut someone making 300k/yr in a HCOL area is probably taking home 13-15k/month. Which means not saving the amount you describe, probably saving max 3-5k with the lifestyle you describe.", "Who wants to retire to the countryside?\n\nr/fatFIRE would like a word.   Maybe even r/HENRY.", "Yes, after 15 years, just abandon your family, friends and everything you know to live in a remote countryside village after. /s\n\nYou haven’t even factored in a spouse and maybe 1-2 kids.\n\nPeople want to retire where they lived their whole life, or at least something similar.", "It’s not about “making it work”. The ignorant person above me believe you can RETIRE IN 5 YEARS off $300k a year which is dog shit. Especially in a HCOL area where you have to be to be a successful banker.", "Nobody is talking about \"the world\", and who \"owes\" who is a stupid thing to care about. It is a good thing to help your family when they're in need. This extremely self-centered approach to personal finance that we've landed on as a society is pretty awful for anything other than the very short term.", "I hope your parents have other children. If your family does right by you your whole life, abandoning them in need is a massively horrible thing to do. It’s not about giving a constant percent, that’s such a greedy way to think about it. It’s about helping in ways like food, car repairs, healthcare, and actually trying to help improve their quality of life. Because I’m actually grateful for mine? Sorry you don’t have anything to be grateful for I guess.", "Maybe a different perspective is that the more people see people doing well, the more they start seeing $$$ signs in place of their humanity and those humans begin cutting off people who are all about their $$$ and less about them as humans.", "Comments like these only further prove my point that everyone on Reddit is a selfish cynic", "Sure, you can create some weird unlikely scenario where 300k isn't an amount that opens a ton of doors for his future.", "He'd be in trouble quickly?\nWith 300k he should have a healthy savings account for that very possibility. He'd be in trouble if he refused to do basic budgeting...but there is a chance he doesn't know how to do that but that isn't OP's fault.\n\nOP NTA", "Bc they think one day they’ll be Rich too, odds are they won’t but still they’ll side with the rich for the 0.01% chance that they become rich one day. Edit: lol I pissed off the people that think they’ll be rich one day", "Not saying its not a privilege. But its also Nathans choice. The bottom line is that nathan wasnt a supportive friend and OP was upset about it. Op didnt have to snap back, but he was hurt because his friend was just disrespectful about this opportunity.", "That's fair I assumed he makes 300k after taxes because we're I'm from we tell people how much our take home pay is and not want we make before taxes but assuming he makes 300k before and not after taxes, that would mean after taxes he has a 180k take home pay. Which is still a lot of money. But entirely useless as long as we don't know where he lives because that money could either be upper middle in HCOL areas or rich in LCOL areas. Either way, if OP is \"comfortable\" with 75k I would argue that 180k is more than enough.", "He could but if he is, that's not OPs fault. It's his money he can choose how to spend it. Of course growing up poor is awful but when you reach a place in life where you're clearly in a privileged position and then tell others because you once struggled that they should check their privilege, then that's kinda hypocritical. Getting out of that mindset can be difficult but letting your frustration out on others that can't do shit about your situation is not right either.", "But that’s his choice to make", "Plus taxes are very real... I am fortunate to earn 6-figures but not as close as 300k and even my paycheck is net 55% all said and done. Then I have to pay for student loans, rent, and just living expenses.", "Sure it is. Some people work 60+ hours a week for minimum wage. Making $300k for any job gives you wealth, and wealth offers you privileges someone on minimum wage does not have,", "But you are now a rich person, it doesn’t matter if you struggled for 40 years and one day your boss finally promotes you to CEO and you’re rich af. You struggled yes, you had to eat dirt and scramble for Pennie’s, and that struggle is apart of your journey in life. *But* you now are rich. You earned it yes, but that does not mean you somehow are free of privilege. Being born into privilege and having privilege are not one in the same. Many people have privileges that they were not born into, there are people that have health insurance, that’s a privilege bc others don’t have it. Some people have cars, others don’t. Those are privileges that no one gave to you, you earned those but that does not at all take away the fact that it is, now say it with me, *privilege*", "He is privileged *now*\n\nNot a soul on this earth who makes that much money can claim to “not be privileged”\n\nGet the hell outa here with that mental gymnastic crap", "Do you not even realize how big of an assumption you just made before posting that? I swear Reddit, especially this sub, loves to think they know everything about a person’s life. You don’t even know OP or his friend.", "You can make $300k in Chicagoland and it's MCOL. You can save a ton if you make that amount and live below your means.", "People at the higher levels of the tech ladder are also continuously drowning in imposter syndrome. It's not a particularly mentally healthy world to be in. Friend probably has some combination of recent wealth, not knowing how to manage it (due to childhood finances), and golden handcuffs.", "This is misleading, as household income generally is constituted by more than 1 person living there, I think the base is like 2.5 people. So given that $800k for the household, divided by 2.5 for the people in the house, gives us $320k. Right about what OP’s friend is making. \n\nA lot of the costs that are factored into household income, are things like day care, more than 1 car, insurance for everyone in the household, that kind of stuff.", "Dude I lived in the Bay Area with 300k, you can retire early if you make certain lifestyle choices for 5-8 years", "I live in an HCOL area on 80K and consider myself to be solidly middle class", "1% is upper class, not upper middle.", "Bro literally read an article about SF one time and acts like it’s the only city someone can make $300k…what a goober.", "[deleted]", "You seem to forget that the person making 300k can still live like someone who is broke in that hcol area and save up for that 5 years. Then take that money to a lcol area and live a comfortable middle class life in retirement.", "Or you could calm down and not get so worked up over a reddit thread lol", "Exactly. In the Northeast, $300k is a ton of money", "i’m in russian hill (san francisco, for the other people) and make ~$85k/yr doing service, and i live pretty damn comfortably. i won’t be able to retire in 5 years but shit, with my current lifestyle, if i made $300k i’d probably be able to get ‘er done in 10. \n\nsf isn’t as criminally expensive as you and other people make it out to be. and also it’s unfair to base the financial success of an individual on *your* cities statistics. seriously, i don’t know why you’re being so elitist about this. you sound like one of the techies that just got laid off.\n\nedit: also… i live with my girlfriend", "Single people who are middle class don’t have 4 bedroom houses. How is this even a debate?", "Imagine being middle class, then making an extra 100k on top of that", "Sure, if you define \"middle class\" as \"making twice the money as 50% of the populace in your area\".\n\n300k even in a HCOL area is comfortably upper class. If you're saving up wisely it's enough to get a pretty large nest egg together after 5 years.", "[deleted]", "You should quit your day job and work full time on moving the goalposts", "Oh boo hoo. “High earner not rich yet”. You refer to 300K as barely anything meanwhile thats almost 10x the median income. You live in a fantasy land.", "Damn I didnt know the taxes are over 50% nowadays in america..\n\nThat ofc changes a lot.\n\nI expected it to be in the 25-35% tax range.", "Granted I thought the taxes would be lower. But its still 197k a year without deductibles if I put the numbers in the tax calculator.\n\nSo sure you can save a bit less. But again this is accounting for a  fairly luxurious lifestyle where you go out for a fancy dinner atleast once a week. Drive a nice car etc.\n\nBut again depending on lifestyle its still doable comfortably.", "Lmao, they don't pay 50% taxes.  \n\nIgnoring any type of claims or the standard deduction, he'd pay 37.7% taxes ***IF*** he lived in the highest taxed County in the US.  \n\nAnd that number goes drastically down with each deduction.  \n\nHe's bringing no less than $14.5k home every month, likely closer to $15.5k", "Where do you live that someone is paying half their salary in taxes lmao. Even in states with high state income tax I can't make the math crack 38-40% on the extreme high end. If you live in a HCOL city like Seattle without state income tax, you're paying less than a third of your salary in taxes.", "ehhh a loooot of people want to retire in peace with a little garden.\n\nBut even if you DONT want to. You can retire in cities like nyc with  a few mil.\n\nIf you have 2mil you can for sure get a 100k a year in interest and you can for sure live off 100k (post tax) a year in nyc comfortably, not luxury.", "We were talking abour retiring country side no?\n\nYou are changing the goalposts.\n\n\nBut even with  a few kids its a non issue. A kid will add at most 1000$ a month. Lets say 3 kids then it means you can still save 90k at minimum a year. In 10 years thats still a milion which is enough.\n\n\nYou were talking about needing to work till 65 which is even more ridiculous. You dont need over 10mil to retire with comfort.  Hell maybe even in new york. You can probably buy a few units of 500-1.2mil then and live like a god.", "I am pretty certain that if you gave everyone the choice of when to stop working with the guarantee they'd have the same monetary resources regardless *everyone* would say, \"Right this second.\"  Who wants to be 70 when they retire?  If I could retire today I'd have done so already.", "Some bad takes in this thread already, and everyone's circumstances are different.\n\nI'm fortunate enough to make a bit above that salary in HCOL city (after growing up very poor), but have 2 kids and one of them is completely disabled. No way in hell I could retire in 10 years on my savings.", "Spouse, kids PLUS \n\n(Let’s assume they buy since their salary is “insane”):\n\n401, taxes, childcare, preschool, food, 529, property tax, property maintenance, mortgage, utilities, life insurance, healthcare, vacation, car payments, blah blah blah \n\n[Wealth management blog with detailed infographic arguing that 500k in Boston, is indeed middle class because after all this you’ll have $6k “fun money”](https://www.thrivewealthstrategies.com/500k-is-a-comfortable-middle-class-income-for-boston/#:~:text=As%20you%20can%20see%2C%20without,expected”%20middle%2Dclass%20lifestyle.)", "You’re so angry and replied multiple times about Sam Francisco when neither OP or the comment you’re replying to said SF…\n\n…almost as if there’s different places people can work or retire to!\n\nWow crazy idea…", "Bro it’s just a post about two people you don’t know, you don’t have to be so angry lmao", "Damn dude, calm down a bit, it’s just numbers", "That’s the thing—we don’t know what friend gives money to family for. If it’s need based that’s one thing, but if family feels entitled to that money for their wants, that’s a whole other ballgame.", "What is \"in need\"? If my father isn't starving and has a roof over his head but can't afford to go to the movies every weekend is it \"abandoning\" him?", "Yeah that's the keyword there. \"Grateful\" A lot of people aren't grateful for their parents because their parents or families suck, they're not automatically a dick if they don't share their wealth with their family. Even if you had a loving family, at the end of the day, you're responsible for YOURSELF first. I've seen alot of families try to raise their kids up for success just to mooch off them(or just straight up mooch), so maybe I'm a bit cynical in this area. It's great if someone wants to share what they have, when it's voluntary. If someone's giving out of guilt of a sense of obligation that's not being grateful or kind. And if someone doesn't give, that doesn't necessarily make them greedy or ungrateful, because it's not their job or responsibility to financially care of their family.\n\nSorry to get on my soapbox here, but I come from a culture where you take care of your family, send them money when they need it, and take in your parents during old age. I've heard alot about sacrifice, seen my mother and grandma scammed out of money from relatives they trusted, and alot of entitlement too. I often get pressured hints dancing around the fact they want me to take my grandma in and live together (something I desperately needed to believe in when I was young in an abusive household), because her 3 children aren't doing it. Most of my sister's paycheck goes to rent while she works 40 hours under the table and has practically dropped out of high school at this point (all the result of my mother's lack of responsibility, parenting, and sacrifice mentality). My brother desperately wants a job to take over her responsibilities and be \"the man of the house\", and his friend, who's barely turning 18, already pays all the bills in his house, takes care of his autistic brother, while his mom is jobless and only calls to use his stuff.\n\nAgain, sorry for getting on my soapbox and the rant, but as someone who's heard alot about sacrifice and taking care of your family (financially and otherwise) it rubs me the wrong way for you to imply that someone is greedy, ungrateful, or automatically dick-ish for not doing so, if you do, great! If you don't, that's your choice to be respected. Something that took me a long time (and still is) to work through is that at the end of the day other people are not our responsibility, not even friends and family. We can't control them, and we don't run their lives, we're responsible for ourselves and our wellbeing first. I've dealt with alot of guilt about not giving my grandma and mom money, of not going over there to help more, of not being grateful for the good things they did, while I can barely get out of bed some days and struggle to even hug my mom sometimes. I'm grateful for them, but I know my boundaries and limits, you're not a dick because you have them, every healthy person does, and if you don't give that doesn't mean you love or care for them any less.", "I love my parents, we have an amazing relationship and they would NEVER accept money from me. Unless parents are genuinely living in poverty and can’t afford housing, utilities or food, they really shouldn’t be asking their children for money. My parents would genuinely have to be unable to pay for necessities before they’d ever allow me to give them a penny.", "My ex, who went from dirt poor before I met him to around $150k, up to $300k when I left him because I was afraid for my physical safety. I once watched him walk past a homeless guy. A block later he says that was one of his friends from high school and it was the first time he'd seen him in a decade. He didn't not just not offer him money. He didn't acknowledge him as a person", "No, that is the narrative they want you to believe though", "I’m really happy for you that you have a good family that takes care of each other. I have an abusive family that interacts like the Roy’s on Succession. You are viewing this based on YOUR experience that family is wonderful and you should help them. Some families suck. Some families are abusive. And nobody is owed anything just because they are family.\n\nEdit: my bad. Different commenter. Sentiment still stands. It’s not selfish or cynical to protect yourself from leeches. Blood related or not.", "It's not a made up scenario, it's in the OP...", "If you think that's an unlikely scenario, that's a pretty damning indictment of your awareness of the world", "People who **don't** make 300K are likely to over-estimate how far 300k gets you, because people cannot relate to that amount. \n\n300K is almost never 100% cash compensation. If he's in finance, he could very well likely get half of that in commission or bonus, which means his base salary is closer to 150K. 150K in Idaho could go very far, but in NYC where your rent is $3k for a bedroom, it does not go very far.\n\nThe other 50% is banking on him working his ass off for the rest of the year to qualify for it and that is a **maybe**. \n\nSure, there is some privilege in being able to make that much, but IMO there is a much bigger privilege in not **being** a safety net but having one.", "We don't know how much he's giving to his family or how much student loans or car payments, etc, are costing him. If he's in an area that's already high cost of living (which is likely, given that he's even making that much to begin with) then with those extra expenses added on, he's probably not able to save that much per month. This isn't OP's problem, but I can see how them having a better-off family that could help them get back on their feet if they needed it, vs Nathan having to keep working hard because not only could his family not help him but they need *his* help... is stressful. I think they both kinda suck here.", "I never said it was OP's fault lol. But if friend is helping his family and is young he may not be managing his finances as well as he should be or have a lot of savings built up yet. Having something to fall back on and not having the pressure to keep your job or else is an incredible privilege. Doesn't make OP the AH but I think he's wrong.", "The availability of choices is a product of privilege. If you have to choose between heating or eating then that's your 'choice', but it's a privilege not to have to make it. Agree that Nathan didn't need to be an ass about it, which is another reason why I'm ESH.", "Personally, I just think it’s weird to get in to a “whose life is harder” competition with anyone. Everyone has their own struggles. It’s appears neither of the people are having an extremely tough life.\n\neta — the mindset in this particular situation has already been set. OP felt comfortable making decisions regarding his financial future. Nathan does not feel he has that same opportunity. He has money now & can’t lose it. These people have very different life goals. OP’s goal is job happiness. Nathan’s goal is financial security. It’s not hard to see why Nathan would be jealous. Not the best reaction though. Obviously, OP is not stopping anyone from finding their own happiness... but misery loves company!!", "It’s everyone’s choice what they do with their money.... well outrageous taxes, insurance, etc. are not things most people willingly choose to pay. \n\nRegardless, of where his money goes it does not change the fact that he was raised in a financially insecure family. Perhaps, Nathan doesn’t spend a dime & needs millions of dollars to feel secure. Who knows?", "You don’t get to divide your major expenses equally by number of people; the cost of housing doesn’t straight line by number of people living there, not does insurance, a car, all the major expenses. The single tax is very real.", "It's more complicated than that. But it also depends how you want to live with that money. You can pretty easily make 300k a year, live in a shitty apartment for 30-40k a year(not out of line for really high col areas), pay another 30k for food/expenses, and invest 150k a year into retirement. At that point you can retire pretty comfortably in 7-10 years in a lower cost of living area. But it all varies and depends how much you're willing to sacrifice the now for the future. And living in abject poverty while making 300k doesn't feel great. But also... You can make life work really well on a lot less money.", "Because your half a kid is gonna bring in $160k", "Yes most people want a wife and children. And if OPs friend is supporting his broke family, then he effectively isn’t in the 1% anymore.", "15 years ago, SF was a different place.", "Making 300k a year puts him above middle class", "The northeast AS A WHOLE. Butt hose jobs arentnin rural Maine they are in NYC or Boston", "Because they live in San Francisco and are forgetting that San Francisco isn’t actually the whole world", "\"It's only 100k more, basically the same thing\" -- that guy", "Tax brackets are progressive. You will never make less money by increasing your salary", "What goalpost did I even change in the comment you’re replying too?", "Actually depends on the tax bracket! My husband and I are in the range where only 25% of our paycheck goes to taxes. However the more you make the more money goes to taxes. So basically everyone’s screwed unless you’re in the 1%", "By \"save a bit less\" you mean about 1/4 of what you originally claimed?\n\nYou'd have to cut the expenses by 50% to achieve the kind of savings you're talking about.\n\nAlso missing something as obvious as taxes leads me to believe that you don't really know anything about high earners or what type of unexpected expenses they might have. Like being required to wear suits to work, or expected to attend expensive social events, or that their income may be partially in stock with special conditions, or 100 other possibilities you don't know about.", "[deleted]", "In this bracket in NYC and the Bay Area, if you’re being honest by your taxes, which young people often are, it can be north of 40%", "How do you reliably get 100k interest a year from 2 mil?", "First of all you forgot about income tax. If you stick exactly to that budget you will net $70,000-$95,000 depending where you live. \n\nSo at the highest take home you will have $1,045,000 in 11 years. \n\nIf you can manage to find an investment opportunity with a 7% return you could now earn  $73,150/year on interest. Now you have a take home pay of $58,693. You have to live the rest of your life on less than $60,000/year. It’s not realistic when you’re supporting a child, likely even without a child, especially if you’ve been accustomed to a life where you’ve been living on ~$180,000/year.\n\n$300,000/year is a crazy amount of money for most people. You’re going to be comfortable for life with that salary. No one is retiring after 10 with that money though. Retiring on $1,000,000 is hardly feasible anymore especially if you still have to support a family. It’s pretty much only reasonable if you’re 60+ if you have no dependents and no debt.", "It takes 2 to tango, or to pointlessly argue on the internet about topics they know little about.", "Not making $300k a year as a banker. You need to live in an HCOL area. \n\nYou’re not getting the point. Why are you cherry picking random aspects l?", "Nah I just fucking swear and am passionate. You clearly don’t live in a metro area we all talk like this.\n\nAlso, OP is still NTA. His friend doesn’t need to make snide remarks like that instead of congratulating his friend for getting his dream job.", "[deleted]", "Still proved my point that ppl on Reddit are cynics, right? Lol\n\nI don't mean that as an insult to you, just an observation", "T H I S", "It's not in the OP that he has to support so many family members that a 300k salary is just enough and leaves zero room for other opportunities.", ">that's a pretty damning indictment of your awareness of the world\n\nThe world or the U.S.? Because in the U.S. he's in the top 2.3% earners and he's not even 30 yet. That's not privilege?   \nIf you want to talk about 'the world', the salary you need to be in the 1% globally is somewhere around $34.000. He makes 10x that at 29.\n\nThe dude is extremely privilaged and you calling me out for my 'awareness of the world' is nothing short of ironic.", "Wild the mental gymnastics you have to go through to try and argue that a 300k salary is not extremely privilaged.\n\nBut go ahead, write 4 more paragraphs explaining why I should feel sorry for the 300k dude because he might have a very expensive appartement.", "I mean, this is certainly true. But he also doesn’t need to pay for childcare, an extra car, they could live in a 1 bedroom, instead of a 3. You definitely get breaks for having more than one person on your insurance (like instead of it being 2x for 2 people, it’ll be like 1.3-1.5x), and stuff like that, so while it isn’t a straight line, there are a lot of tradeoffs. \n\nPlus I was trying to keep it as simple as possible for comparing household income vs individual", "Did you forget about taxes? If he’s living in NYC he’s bringing in about 190k after taxes. CA is about 183k. For 2k /month rent in NYC he will be living in a one room shoebox with cockroaches and mice. I’m not sure how much better 3k/month is. He needs nice clothes for a position at that salary. So what I’m saying, is there’s zero chance this guy can save anywhere near 150k/year unless he’s living in a homeless shelter  \n[https://www.talent.com/tax-calculator?salary=300000&from=year&region=California](https://www.talent.com/tax-calculator?salary=300000&from=year&region=California)\n\nworst of the worst but amusing to see what 500-3k can get you in nyc\n\nhttps://www.ranker.com/list/worst-rooms-ever-offered-for-rent-in-nyc/ashley-reign", "30-40k rent in a HCOL????  A cheap 2 bedroom in those areas is 5 grand a month.", "I mean, if it was a living vertical half of a child, they could definitely make some income off of that.", "No your half-a kid is costing you 160k per year, so you need to earn that much more to afford it...", "no but they will cost that much or close to it", "You're also assuming OPs family is living in San Francisco. \n\n10%-20% of his salary would be enough to help out even several family members especially if any of them own a house.\n\nAlso, one can retire to a place that's not San Francisco too. Most people would work that job for more than 5 years but it's not insane to say one could retire that way.\n\nYou seem like you need to take a walk.\nIdk", "“most people want a wife and children” lmao or a husband? or a partner? your misogyny is showing", "Yeah I'm sure. I just didn't realize it had gotten so bad that even a $300k salary for a single person would only put them in upper middle class lol.", "I mean, come on, read your comments, that redditor is just correct. First you said you have to live in a HCOL area to make 300k. When they said that's not true, you said \"yes, well, that's because in HCOL areas they can even go up to 600k!\" You moved the goal post from 300k to 600k.", "I thought taxes capped at 30% tbh.\n\nTime to read a bit i guess.\n\nIn my country we pay around 35% till the 70k mark. But healthcare is mostly paid from tax (i pay 2000 a year if I get sick and 1700 if I dont get sick). Also our higher education is capped at 2000 a year. So a full degree with a masters is at most 14k.\n\n\nHere you pay 1% on your yearly profit though so if you have wealth you pay next to nothing. The people who pay income tax are getting fucked over. I have a rich uncle who pays 3.5% a year here while I pay in the 30% range on 1/50 off his yearly take home lol.\n\n(Just put in the calculator and 300k salary means 197k take home and thats without deductables, which is already 30k more than you said it would be, which is another 300-320k over 10 years)", "I have an accounting degree btw and worked on quite a few big private accounts. Hence why I was blown away by the % taxes paid on these incomes in america. Iirc it was a lot less.\n\n\nBut still. With my example which is a very luxurious lifestyle you can save 70k a year. Which is indeed 50k less than I originally had in mind. \n\n\nBut it all depends on what you want. You can live an upper middle class lifestyle without working a day in your life again its comfortable with 1mil in 99.9% of the world. Places like nyc or la in the fancy neighborhoods is not going to happen.\n\n> like being required to wear suits to work, or expected to attend expensive social events\n\nThats all deductable.\n\n> or that their income may be partially in stock with special conditions, or 100 other possibilities you don't know about.\n\n\nThey also might have a sick mother that costs 5mil a year etc etc lol. We are talking about 300k take home without extra memes.  Else theres no way to ever make a calculation lol.", "I literally looked up top taxes in the US and used the bracket system.   \n\nI didn't even claim the deductions so this is higher tax than would actually be paid.  I included county taxes, city taxes, SS, Medicare, etc.   Total taxes paid in.  \n\n\nIf you need to learn how brackets work, we can go through that math.  \n\nFor the bonuses, they're taxed higher up front and you claim it back when filing taxes.  You should have your W4 set up to balance that.  \n\nIf he's getting options, things would be taxed even less.  Long term capital gains tax is so much lower.", "5-7% is very doable with funds or buying property.", "My estimates put them at retiring in around 20 years. Definitely agreed that 1 mil isn’t enough to retire on these days, unless you’re retiring at like 75 or 80.", "You sound angry tho", "He doesn't have to spend it all to be in a weaker position than his income indicates.\n\n1. he uses up money out of pocket to support family members. Remember that with taxes, making 3 times the amount doesn't mean remotely close to 3 times the take home.\n\n2. He has no safety net so has to have a much larger security fund stashed away to operate.\n\n3. His family members probably have little in savings for retirement, he probably at least saves some for his parents (I do, and I'm in a similar predicament).\n\n4. No inheritance means he has to aggressively save for his own retirement if he wants to keep a good living standard.\n\nCouple that with OP likely getting help with funding education, first car and perhaps down payment and the difference grows even larger.\n\nSure, he isn't poor. But he has a high hill to climb even with his income to make up for the advantages OP has.", "It depends on where he lives. In a high cost of living area, he might still be having a hard time supporting his family, paying for himself, and saving for retirement.", "So you're saying it depends on how many family members depend on his income.", "What do you mean by 'other opportunities' though? Investments? Uncertain return. Property? His salary might be enough to invest in a second home I suppose and provide some security in retirement.\n\nWealth trumps income every time.", "Are you arguing in bad faith on purpose? Like, raw numbers with CoL mean nothing, and I'm pretty sure you know that. But more importantly, people from poor backgrounds who \"make it\" very often have a lot of folks in their family who they have to support. You're ignoring that, or pretending to be unaware. \n\nBut yes, you're right, if he was making $300k in a poor country that would be a different situation we would react differently to!", "A horizontal half, even.\n\nI'd pay to see a pair of legs just walking around.", "Medical costs to keep half-children alive are very high and insurance only covers about half the cost.", "Even if daycare was 50k a year there’s no way that kid is going to cost anywhere near another 110k per year.", "It’s a story about two men you silly goose", "I mean, this post is about a guy, so I think the previous comment was specifically about that, not being exclusionary", "Or it could be that the person In the story is male....", "No my point with the $600k is that anecdotally saying “one can make $300k in a LCOL area” is like saying “you can also make $600k in an HCOL area”. Just because you can doesn’t mean it’s realistic. Maybe I didn’t convey that properly. \n\nWho the fuck lives in bumfuck nowhere making $300k a year? Unless they got lucky with their remote job which the vast majority are recorrecting salaries based on location.", "I “made” $230k last year, but a large chunk of that was in stocks/RSUs as my salary is $160k. Bonus was taxed very aggressively at 45%, and I paid over $80k in taxes last year. And that was with getting married to allow us to be in a different tax bracket. My actual take home allows us to rent, save a couple thousand per month, and have no debt. Which is phenomenal however it’s Bay Area in CA so we will likely never own a home even though we are close to $300k before taxes as a married couple, especially once we have kids and have to pay for childcare. \n\n$300k is fantastic money, but if it’s a HCOL or VHCOL area then taxes, rent/mortgages, groceries, even gas are more expensive. The same loaf of bread is $4 in one county and $2.79 25min away. It all adds up, and OP has a safety net that their friend does not. And I assume friend has college loans to pay off still…", "It's insane that people like you can be so blind to his privilage.\n\n&#x200B;\n\n1. He has the privilage to spend money to support family members.\n2. He has the privilage to be able to build a safety net.\n3. He has the privilage to save for his parents\n4. He has the privilage to be able to save for his retirement.\n5. He has the privilage to be in the top 2.3% of earners in the U.S. at 29.\n\nYou people are going through some wild mental gymnastics trying to deny he's extremely privilaged.", "I'm saying it's highly unlikely that the number of family members that depend on his salary is so high that a 300k salary does not provide ample opportunity. I'm saying it's so unlikely that it's weird to assume that.", "They don't *have* to support anyone, they're choosing to spend their money a certain way, you could say they have the privilege to do that in fact.", "They don't *have* to support anyone, they're choosing to spend their money a certain way, you could say they have the privilege to do that in fact.", "This is the only good reply", "you said “most people” not “the men in the story” you silly duck", "it’s the ‘most people’ in the comment, as if women aren’t included in people. obvs the post is about a man, but the comment makes a generalization about ‘people’", "Privilege is not all or nothing.\n\nHe is privileged compared to many of us, in the ways you listed. But his friend is privileged over him in the ways the person you’re responding to listed. \n\nHe likely is resentful of his friend’s particular privileges, which allow him to be less worried about having a lower income. And OP likely wouldn’t mind making $300k himself.\n\nThis is why NAH, though I think the friend was an asshole in the moment for expressing his resentment rather than happiness for his friend.", "The Temporarily Embarrassed Millionaire Grindset at work.\n\n$300K isn't shit only to the same people who view the 1% as \"menial\" instead of upper class. For the vast majority of any country, a $300K annual salary is a damn good one.", "And OP has the privilidge to not have to do any of that. His family can support themselves. He already has a safety net. He will get inheritance probably so his retirement is easier. He doesn't have to save for his parents.\n\nNow Nathan doesn't have to do any of that but he feels obligated. To him it isn't a privilidge it's a chore. I am not saying Nathan is being rational. But to him the privilidge is a curse. \n\nOp is not the asshole. But cause Nathan earns a lot of money doesn't mean he can't have problems (including money problems). \n\nHe is not the asshole. But I think it would be a good idea for op to try and understand and help Nathan.", "This conversation makes me so sad. I don't know why I'm reading it. lol. I would be happy with literally 10% of the amount he makes right now. I agree with you and these comments are giving me the same vibes as when my ex who makes $100K a year was crying to me about being broke during a year when I only made $16,000 (2020)", "It's insane to me people always presume someone else has it easier\n\nBeing able to reject an opportunity to make $300k and instead do something you like that pays peanuts - **THAT** is privilege.\n\nBeing forced to do a soul sucking job you hate to make $300k because you don't have a safety net - That is a great position to be but in no way more privilege", "It wouldn't necessarily take many at all. One elderly family member in a nursing home could take the majority of that income.", "I make about 23K yearly and I have family who make even less than me, so I support them with what I can. Does that make me privileged too?  \n  \nIf he wasn't supporting his poorer family with his money, you'd trash him for being callous.", "damn what a thing to be mad at", "Okay, you're right. The 300k a year dude is very unlucky and absolutely not extremely privilaged for being in the top 2.3% of earners in the U.S. at 29. \n\nHonestly I'm not sure what point you're trying to make.", "What tone did he use when he said  \"I'm glad you have the financial privilege to take a pay cut.\" and how did the conversation play out after you responded?  \n\n\nHe might have meant, \"good stuff, youve gotten to point financially, where you can take a pay cut and do something you really like and be happy without financial worries\" - he might not have been referencing your family wealth....  \n\n\nBeing free of the grind and being able to be happy without big money worries is a big achievement.  high five and well done.  but if hes referring to your family wealth - thats a bit dickish.", "Seriously, if the friend doesn’t want his family freeloading anymore then he either needs to stop giving it to them or make stipulations for his support. *You want money, I’ll pay for you to go to trades school or I’ll give you X for the next 6mo and that’s it*\n\nNTA", "The friend is huge AH for trying to take the OP down a peg for being happy about his dream job.  \n\nIt doesn't matter if the friend is making $30K or $300K, or what his upbringing was or who he feels indebted to.  It is always assholish to play the \"must be nice\" card when someone is innocently sharing good news.  The OP shouldn't have to tolerate this shitty behavior just because there is a story behind it.  We all have stories behind our actions.  That doesn't mean we can't be judged.", "The other person has a financial backstop, and if they don’t it really is their fault. Let’s say that this person needs to help their parents, so they give them $50k a year. They still have $250k in income, which is probably $15k a month after taxes. \n\nIf this person truly cared about their financial stability and a “back stop” they could easily be saving $5k-$8k a month. That’s $60k - $96k per year.\n\nThis person has the opportunity and earning power to do what OP did. They decided no to.", "I’m a teacher making low pay. I’ve seen a LOT of teachers leave because of low pay, and most of them are trying to support others and have no support of their own. I have almost no support, but I’ve rarely had to support others. It is a privilege that I can continue my low pay job because I don’t have to help my mom with her lights. Even though I’m not privileged and constantly worry about money, I have privilege. \nNot trying to be an ass, but it sounds like you sorta understand. The more we do, the better we can take down the system. It’s not Nathan making 300k that’s the issue; it’s Don making 300 mil (or bil, nowadays)", "Nathan is now VP at his firm making 300k/year. He’s not grinding long hours like he was at the beginning of his career. I’m not saying he’s not working hard but he’s not at the beginning of his career anymore— he’s an executive. \n\nYeah OP was able to quit a soul sucking job to find something he loved and that is a privilege. But an executive cannot honestly believe his friend is more privileged than him. Absolutely OP is NTA.", "even working class people can be happy to take lower-paying jobs though, especially if it comes with plenty of job satisfaction. Nathan does not get a pass for whatever \"trauma\" he has. Nathan's issue is more the inadequacy he felt when he first became OP's friend.", "And not only does Nathan not have a safety net, he is likely his relatives safety net", "Had to scroll way to far to find this response. This is it in a nutshell.", "Fr. Sounds like a bunch of white clowns complaining about privilege. Like shit I am white and I fucking despise white people talking about privilege. Especially op when he literally has a way better family. His friend would rather have that I bet than a job where he is killing himself", "Valid point! Those expenses add up too. You have to travel a lot for work in those positions. That means you have to have the good travel credit cards, an appropriate wardrobe, an appropriate appearance which also means upkeep, etc.", "Fund your family if you want to, but don't let your golden handcuffs chaff you to the point where you're upset at other people's privilege.", "You can easily save half of your income anywhere at $300k a year...", "Not 5 years, but 10-15? Absolutely.\n\nI’m in a place comparable to SF and make 80K (and, indeed, may be moving to SF without a pay raise) and at 300K, I could set aside 100-150K/year, depending on emergency expenses.\n\nI’d presumably leave the HCOL area upon retiring. And, granted, I’m not financially supporting my parents. But OP’s friend is firmly upper-middle-class bordering on rich.", "As a solidly middle class person, upper middle class absolutely can retire in 5-10 years if they live like lower-middle class and invest the rest.  \n\nI'm living lower-middle class and investing and it'll take me 20.  I'm very privileged but I recognize that at least.", "If I can live on 25k in a LCOL city then I’m sure 300k is fantastic to have in a HCOL area.", "He could door dash for some extra spending money.", "Lmao what?? My dad makes 700k living in Cleveland which is not a HCOL area…. You do not have to live in a HCOL area at all.", "> upper middle class lifestyle\n\nWhat prevents you from living a much cheaper lifestyle while working at that job, though?  I mean, I agree with your post for the most part, but it seems that no matter what job you take on, your lifestyle is not set in stone (aside from where you have to live unles you want a crazy long commute, etc)", "My guy, that's like 15k/month before taxes. That's top 2.3% in income or 4.3% in HOUSEHOLD income. That's not middle class at all. That's the definition of upper class", ">To make $300k, you HAVE to live in a HCOL area first. \n\nThis is simply not true. Both of my parents are very high earners and live in a medium sized Midwest city. I’d say it’s on par with Indianapolis. Father is an airline pilot and pushes nearly $400k per year. Mother is a business owner and makes minimum $200k per year, depends on the year. So no… I think you’re wrong there. As others have said, people absolutely make >$300k per year outside of HCOL areas\n\nEdit to add a few things", "This guy is 29. Even if he has mortgage at a low interest rate (w 300k his credit will be super high) he is probably pocketing excess of 100k annually. On-top of whatever equity he's building because you'd be stupid to rent with that amount of money.", "Lol I know a man who makes $300k and lives in the middle of nowhere. You don’t “have to” live in a HCOL area. Also nowhere in the US of A is 300k upper middle class, that’s wealthy money. The only reason you wouldn’t be able to retire in 5 years is that most people change their lifestyle with their income. If you live like you’re making 50k a year when you’re making 300k it’s pretty doeable", "OP's friend was an asshole first, but OP countered with some assholeness himself. Both of them are privileged, just in different ways. They are damaging their friendship by trying to weaponize each other's privileges.", "This! Reading through the comments made me feel crazy.", "But he would have to make way more sacrifices than OP did to take a 75k dream job.", "Not that simple.\n\nRead up on things like black tax. Even if you take race out of the equation, people can still be stuck with helping their family with medical bills, mortgage, children etc.\n\nThe story sounds like a crock of shit but as a matter of principle, not all people share the same financial obligations.", "I mean how much do you make and are you maxing out your 401k? That can easily be 22% if your gross which means you’re tax is 23% not 45% as your post implies…", "That salary can disappear at any time, as many learned over the past three years, and Nathan would have no one to turn to. OP has the privilege of just quitting his job and not having to worry. OP still has more privilege and doesn’t see it, which is a privilege in itself.", "A privilege is inherent and a given, new wealth is earned. Therefore, everything that comes with new wealth is earned. \n\nNathan may have ‘privileges’ as an extension of his job/salary, but he doesn’t have inherent, given privileges beyond everything he has built for himself.", "Some level of privilege? You mean \"earned benefits\"? People need to start learning the difference between these two things. A privilege is what you get in return for doing nothing. This dude worked and is still working his ass off to be where he is, those are earned benefits at this point. OP is definitely privileged though as he can actually stop working and still be able to comfortably live. So he gains something, for having done nothing.\n\nSee the big difference?", "Privilege is an unearned advantage, like being born to a wealthy family, not working your ass off for a good salary", "Yes. They don’t take him $300k. If he comes from poverty, he’s likely not just taking care of himself. There’s also COL. If it’s high, there’s not much left over.", "Also lady, you don’t even like you or your husband’s family so why are you even commenting? Your perspective offers nothing", "[deleted]", "I live in one of the most ridiculously overpriced cities in America and if I made 300k I would literally pay off my mortgage in two years and aggressively save for retirement", "It is luxury money but wealthy people constantly prefer to be referred to as working class or anything other then wealthy, its a bad look.", "It is luxury money it’s just not retire at age 40 money.", "Spoiler, unless life of luxury to you means grossly irresponsible and destructive, it is. You don't need seven mega-yachts to have a luxurious lifestyle.", "And what happens if he loses that job? He's done incredibly well to be in the position he is now but if he loses it then his family lose that support and he has zero support either. \n\nHe will always feel the pressure to keep earning and earning because he knows there will be no fall back if he loses it.", "Agreed, generally.  The way OP tells the story, it sounds like friend attacked OP unprompted when OP was announcing exciting personal news, so I don’t necessarily blame OP for countering by comparing privilege, but it’s an ugly game.   \n\nIt’s also impossible to know the full dynamic of the relationship. Maybe OP has a history of acting holier than thou for leaving finance for less evil employment, and friend is sick of it.", "Supporting your family financially is not an ‘optional expense.’", "On that salary Nathan should be able to save more in an emergency fund than OPs family can lend though. At the end of the day, it doesn’t exactly matter where the resources come from. Nathan is making MUCH more per year than is needed to live comfortably. Even if he gives a lot to family he should be able to create a large emergency fund. If he doesn’t have one, I’d say it’s his choice to be living at the edge of what his salary can afford and not a question of privilege but of poor financial management. \n\nThink about it this way; if Nathan lived on OPs budget (~50k after taxes) then he could save 6 figures in one year which would mean he could cover all his expenses for 2-3 years after that. That’s a huge cushion to have and he could build that up in just a single year! \n\nHowever, I doubt he is doing this and probably has a much more expensive car & housing situation than OP which is how you get people making this much money feeling like they are living paycheck to paycheck.", "I do know, I just assumed 300k is his take home pay. If this is what he earns before taxes, then he has round about 180k after taxes. Which is less but still plenty and if OP is comfortable with 75k, then this guy is more than comfortable with 2.5 times as much. (if they are living in places with similar costs of living)", "Ridiculous, once you have the salary you can use that to buy any number of the things people would consider a privilege. Privilege is almost always the whine of a person who is jealous anyway. But the notion that a person pulling in 6 figures still gets to rant about privilege is a nonsense", "Either it’s a HCOLA and OP is practically poor as shit or it’s a LCOLA and the friend is basically rich AF", "Exactly. Even if someone has more privilege than you do, that does not mean that you can just use them as a punching bag whenever you feel furstrated about your own life. **If(!!!)** the friend has PTSD from growing up poor, as the comment above suggests, than they can spend a portionn of their high salary on a very skilled therapist.", "i think growing up poor for some people never really leaves them - most people i know who grew up poor or in poverty have things they've brought with them to their adult life that they can't quite shake, even when they're financially comfortable", "I had to scroll for this take, Oof. \n\nAlso poverty quite literally traumatizes you and fucks up your head in SO many ways. I never knew we were poor when I was growing up but I struggled badly for my first few years on my own, and I still have trauma around money that I’m unpacking, almost two decades later.\n\nHaving enough comfort and a safety net that you feel safe taking a pay cut for a job you will love—that IS privilege. Massive privilege. Huge.\n\nThey both suck TBH.", "I dunno why a study on income inequality in 2013 is being used to judge \"not starving\" in San Francisco, or why \"top 1%\" is the threshold for being able to retire before 65 (because, it isn't.) Actually the whole point of that study was showing how terribly skewed the top 1% is relative to like, the 99% of others, the top 5% of which are still, very, very, very comfortable. That top 1% is skewed by the fact that it includes people with $5 million in assets and people with billions of dollars. Impossible to get a reasonable \"mean\" out of that.\n\nAverage rent in SF in 2022 is \\~$3,000. Average costs outside of rent for a single person no kids are $1,500. At $300k he's not looking for average, so let's assume doubling the rent ($6k) and tripling the outside costs ($4.5k) like a good bachelor would.\n\nSo then he's spending $126k annually on good housing with lots of discretionary spending. With fed and state taxes taking \\~117k he's still saving \\~57k a year.\n\nAssuming no raises, literally 0 return on investments, currently 0 savings, and continuing to live the lavish bachelor life renting, in 30 years at age 30 he will have saved $1.7 million. Only enough to live at 126k/year for \\~15 years. (though this does not factor in Social Security)\n\nNow, realistically, that number will be with just a modest (5%) return on investments more like 6-7 million.\n\nThis 60 year old bachelor could continue spending 126k/year on 6-7 million in retirement savings for another 50 years.", "That was also from 2017. And it’s not like upper level incomes have gone down in the past 6 years.", "Thank you for reminding me why I still live in a rural state.  The national image the poor red state gets may be bad, but the living experience in wonderful. \n\nI own a business and the commercial property its on. I was able to but the property with cash that fit in my pockets.  My truck is parked outside of my business right now. It is unlocked. They keys are in the ignition. I'm not worried at all about someone stealing it.  And I'm not in the middle of nowhere. I'm on Main Street in the Town my business is at.  I manage to take home 50K a year from my business.  It could be more, but I invest most of the profits from it back into the business so it can grow.  That 50K is plenty to pay by bills and buy anything I need.  I own my home, so no mortgage.   Being in a LCOL location is pretty great if you can get over the racist elderly population lol.", "I live in San Francisco and I've made 30-40k the last five years. If I was making 300k I would be able to save for retirement in a heartbeat, are you kidding?? I can understand people with kids having more expenses but that's still a lot of money in San Francisco just like it's a lot of money anywhere else.", "why are you taking  the top 1% as a baseline?", "I clearly said I live in a LCOL area. Also, OP never mentioned the cost of living in their area, and this person automatically assumed it was high, because “to make $300k you have to live in a HCOL area” which is utter nonsense.", "My family is in NJ, my parents have consistently been *very* comfortable, and dad (who made a bit more) never had anything close to a $300k salary.  Like, I'd class our family as \"well above standard middle class\" and they were nowhere near 300k.\n\nMeanwhile, here I am a public school teacher making....not that lol (I love my job, wouldn't change it, but I didn't get into teaching for the money lol)", "Oh hey, I actually read the article you shared, which says:\n\n\"In 2018, the single-person median in SF was $82,900 per year, while a family of four is $118,400. Applying the two-thirds to double formula gives a rough “middle class” range of anywhere from over $55,000 to $165,800 for one person, or between $79,000 and $236,800 or a four-person household.\"\n\nThis person is under the age of thirty and living alone. He's at nearly double the \"rough middle class\" range for San Francisco. \n\nSo yeah, he's upper-class. He is, in fact, in the top 5-10% of income for a single person.", "Middle class is typically judged on “can afford a decent house”", "LMAO this guy doesn’t know how tax brackets work", "If you're paying a 40-50% tax rate your accountant has failed you!", "That doesn't give him the right to lash out to OP.", "He can get a new job? We acting like someone making $300k is unemployable?", "If \"family\" doesn't refer to wife and child(ren), then yes it is. I agree that it is the only reasonable option if you're in OP's friend's position, but he is under no legal obligation to lend his aunt money for groceries, for example.", "If you can’t support your family with a 300k then yes you’re privelaged, you’re spending WAY too much money.", "300k is probably closer to 150k as I already have 55% taken out for all taxes benefits and 401k (don’t forget the importance to save for retirement). \n\nI agree. We don’t know more about COL whether Nathan had student loans, how much he is supporting his fam, and if he is smart should still have enough to save. \n\nAlso 75k has a lower tax burden. My friends in that range make like 55k take home. Agree he likely is comfortable compared to the millions of people making 75k but just want to add a perspective of how money tends to quickly go as you add things to your financial obligations. I would be disappointed though if he didn’t put money aside for a rainy day as that is what is the safety net he needs to have a that OP has with his family. No excuse to not save with that income.", "They don’t necessarily live in the same city either. And taking less money when you can always go home to mommy and daddy vs making less mo way when if you lose your job you end up homeless is very different. One medical event could make OP’s friend homeless if he couldn’t work and his family is relying on him. The pressure is entirely different.", "I think this is accurate. My friend is on £43k a year - more than double the country’s average income. He keeps striving for more and more because he spent his whole childhood in abject poverty, like poor poor, he now panics that he will be without again", "Yes I relate to this. I was yelled at for shopping at a thrift store while driving a luxury car and it kind of put it into perspective for me. I still have a lot of anxiety around spending money on certain things and I have to move on and realize I just don’t belong in some spaces anymore.", "Yep, income is relative to base expenses.", "Is it really. 300k in a hcol is still an insane salary. You cant retire in 5 but most likely in 10 and very comfortably in 15.\n\nLets say you want to live very comfortable while you work;", "At 300k a year he can live in a studio apartment for 2.5k/m in NYC, 30k a year total in rent. That’s 10% of his income, where the average family pays 40% of their income in rent. He also works at a high end investment bank so obviously gets great benefits that further reduce his costs. No need to pay for food/healthcare/extra living space for any dependents. OPs friend has a lot of walking around money that he wouldn’t have if he had a spouse and kids.", "Please explain the income the .5 is bringing in? Are you seriously attempting to claim that about 50% of the top 1% of info San Francisco households have 3 income earners? \n\nI’d love to see your math and read how you are going to explain this.", "Also, funny to take only 1% as a measure and not 10% lol", "[removed]", "In NY or San Fran you're lower-middle to semi-poor fam", "  1.5 million is pretty tight to retire before you’re 40.", "It’s not the baseline I’m replying to the guy who is talking about 1%??", "Imagine making $300k a year being single with no kids and having people in the comments saying $300k is middle class when in fact that’s way above the bracket.\n\nEdit typo", "They bought their house thirty years ago dude. It’s different.", "Always take more money. Tax brackets incremental.\n\nIf 0-100k is 10% taxed and 101k-200k is taxed at 20% you would only pay 14k in taxes if you made 120k, not 24k\n\nTax paid on first 100k = 10k\n\nTax paid on remaining 20k = 4k", ">I'm trying to stay under the max salary for the next tax bracket.\n\nThis is stupid. The way tax brackets work you only get taxed the higher amount on every dollar in that bracket so you are not worse off when going up a bracket.", "If you got married specifically for tax reasons you probably should have consulted a tax expert first. It seems you don’t even understand the most basic fact that only the income you make above the 22% bracket is taxed at 24%. You gain literally nothing by keeping your income below the cutoff.", "Not how progressive tax brackets work smh.", "I live un the Bay Area and my actual take home is close to half when you factor in benefits and 401k contributions in addition to taxes.", "/r/confidentlyincorrect \n\nIn NYC the highest earners [the top 1% starts around $500K] *do* pay close to 50% once you add up federal taxes, state taxes, and city taxes.", "If you’re referring to me, I’m not a guy.\n\nAnd I do understand how tax brackets work.\n\nTo be clear my take on this situation is somewhere between NTA and NAH", "My point is it is unlikely to want to make that extreme move away from loved ones and lifestyle. It sounds like we’re talking about ambitious individuals (FIRE types tend to be) here who may not adjust to the countryside lifestyle easily.\n \nA few million suggests about 3 million.  The interest off that isn’t significant enough to stay comfortable there.  The dividend income could be a saving grace but that involves active management even if you go the three fund portfolio.  Are you really retired if you have to constantly monitor to make sure you don’t have to return to work?  I don’t think that sounds too peaceful l.", "Assuming two working parents: Bwahahahahahaha. A kid adds $1000/m max? I’m in a MCOL city and average day care for an infant is $1500/m. Then you need to add diapers, food, formula, clothes. You also likely need emergency babysitter(s) for when your kid is sick and can’t go to daycare and you can’t miss work. If you can get away with a kid only costing 2k/m then you’re doing great. Montessori preschool in my city can cost 10k for a 3 year old going 3 hours a day during the school year. It’s closer to 18k/yr for a 5yo. And then you need to pay for care for all the time they’re not in school. Additionally your insurance costs go up and suddenly you spend a lot more on medical care. Not to mention paying medical costs for pregnancy and labor and delivery. And possibly also for short and long term medical issues that arose from pregnancy/L&D. And even if you thrift what you can there’s a layout of money to start: crib, car seat, baby clothes, bottles, diapers, etc. \n\nIt’s literally more economical for me to stay home with my kids than to work because of the cost of care. I literally don’t have the earning power to afford for my kids to be in childcare. And my kids aren’t signed up for any pricey activities or schools. \n\nNow, we’d be pretty damn flush if my husband earned 300k. I cannot imagine an economic worry at all if he earned close to that. But kids are $$$$. My kids are little and I shop at Aldi and still our grocery bill is ridiculous compared to just feeding two adults. I only buy their clothes on sale from already cheap places (Old Navy, Target) or from consignment sales or thrift shops. It’s still several hundred dollars a years.", "I agree, but it also doesn't make him privileged either", "I live in one of the most expensive cities in the world. Even assuming US student loan repayments I struggle to see how someone couldn't save a significant chunk of a 300k salary barring exceptional circumstances", "This is what privileged people tell the poor/underprivileged.", "Chicago is cheaper than many metros, and WAYYYYYYY cheaper than SF.  I can understand if you only knew NY and SF as expectations on cost of living, my understanding is it's stupid expensive in those towns.  But Chicago? You can get a really nice 2b apartment for $1500-2000, with utilities and bills, you can easily live on say $4-5k a month living decently.  That's what? $60k cash, call it $100k a year with taxes.  I'm not sure that's retiring in 5 years, but you can definitely make an amazing nest egg quickly.", "Don't even need to invest that much every year, you could do like 60k/year (starting at 30 and with 0 savings already) and be very very comfortable retiring at 60.", "Do you understand how averages work? It’s not literally a half a person.\n\nWhere do you even see me trying to say “50% if the 1% are 3 income earners”. I am talking about a NATIONAL STATISTIC. 2.5 people is what the average household in America is. The original comment is talking about **household** income, aka what the average household in America is comprised of. \n\nSo if the *household* income to be considered part of the 1% in San Francisco is $800k, and the amount of people in said *household* is 2.5 people, then 800,000/2.5 = $320,000. Which, as I was saying above, is what 1 person living in San Francisco would need to earn to be considered a 1%er.", "I’m not doing that? I’m saying that people acting like 300K in an HCOL area doesn’t make you rich are incorrect.", "Agreed. He may feel the burden of supporting an entire extended family, either by guilt or by choice, and OP can focus only on himself.", ">Butt hose jobs\n\nI had to read this three times, pondering butt hose jobs, before I figured out the typo", "The kind with a chip on his shoulder. He may be earning a lot but inside he's still that little poor boy with an inferiority complex and it makes him angry that his happiness is tied into his net worth while OPs is not thus the pay cut not being a problem.", "“ How much could a banana cost? Ten dollars?”", "How does one get a job paying 120k without even need to understand tax brackets? Asking for myself.", "What do you make?   \n\nBenefits should eat roughly $500 and 401k would max at $1875.  \n\nThose would be if you were paying top amounts and still isn't taxes like they were talking about.\n\n----\n\nAlso, 401k will drive down your tax rate.... so....", "You should use that sub on your own post /u/cranberryskittle\n\nJust looked it up and used the bracket system on his earnings.   Doesn't even hit 40%.\n\nYou do realize that the bracket system makes the overall tax less than the top bracket, right?  Do you need to learn how to use the brackets?\n\nDo you not know the difference between Marginal vs Effective tax rates?", "I honestly think if 100-200k a year isnt enough its a \"you\" issue. \n\nBut the real ambitious types dont want to retire anyway..", "Three. Thousand. Hundred. Bucks.", "Yes it does. If he loses the job then he will no loger be privileged. As long as he has it he is very very privileged.\n\nWith the money hes making, and a few good investment, he could retire and still support his family.", "Which part? Whose life is harder? It’s a stupid competition. Why would anyone want to win?\n\neta — I am sincerely asking. I could have said something stupid...", "Idk where in NYC you're looking at but I live in a 2k apartment, 1 bedroom, and I am living in an amazing place. My family and I are getting by on 70k and I still am able to save some, and this is after having a kid. No roaches, no rats. I also live outside of Manhattan (but close enough that it takes 15 min by train to get there) so I would stop listening to ppl who only think that Manhattan, downtown Brooklyn, and LIC are the only places that exist. \n\nDon't get me wrong, it is hard, and my husband is looking for a job, but we're making it work on less than 300k, as do many others in this city.", "At 300k, he can afford a tax attorney who can ensure he pays no taxes.", "Yes?  If it is you live in one bedroom of a four bedroom house.  You pay maybe $2k/month plus 1/4 utilities.\n\nIf your housemates are also working long hours like you, you barely see them anyway.", "why do you need 2 bedrooms lol? and Having lived in silicon valley for 10+ years, you can get 2br for a LOT less than 5k/mo.\n\nthe whole point is to live cheaply to maximize your earlier investment years, and you're renting extra bedrooms and paying premium apartment rates. NO. people doing FIRE with great jobs live with roommates and keep up the college crappy apt. lifestyle for 5 years, specifically because they're saving for retirement.", "At least our doctors can take care of half children nowadays. [This boy from 1946 wasn't so lucky](https://youtu.be/cNSYLivf7Ac)", "Good point, very important to specify which half", "I'm remembering SNL Samurai divorce court. But not finding a link.", "However, they'd probably get only half of the child tax credit, so it's a wash, really?", "I understand very well how averages work. That’s how it would be 3 income earners in 50% of the households and 2 in the others. That would make the average 2.5. You see?\n\nWith that being said, the average household may be 2.5 people but that is not the average income earner. This is where you are completely going off track. You don’t divide the average income by the average amount of people living there. You divide it by the amount of people earning an income.", "Lol so did I but we got it lol", "It gets to near 50% when you add all the types of taxes together. Sure, federal income tax will never go higher than a 37% effective rate, but another 3% or so for Medicare (SS tops out), 5-10% for state taxes, and in some cites another 1-4% for local tax.", "You’re not correct about this one, sorry. But I’m happy to chat you with details.", "Not for someone who is bent on fatFIRE, an implicitly frivolous lifestyle during retirement.\n\n$100k-200k/year in Dallas is plenty but not for LA, San Francisco or NYC if someone is really planning on a frivolous lifestyle.\n\n\n…and I agree most ambitious types probably won’t retire.", "You’re fucking crazy if you think he’s struggling on 300k even while helping family members. Only way it’s tight on money is if they’re living lavish, which 100% is not necessary", "This. Depending on what debt burden he has and how many years he's been at this salary, the first few years of making real money can still feel uncertain when you grew up poor. (I grew up poor.) \n\nAlso, no one is guaranteed a job. People seem to assume that once you make $300K you will always make that salary. Half my friends have lost their long-term jobs this year. This friend with the corporate job might still be in survival mode. Poverty takes time to leave your mindset: some people never feel secure financially after growing up poor or in uncertainty. I think it's entirely possible the friend with the good paycheck doesn't yet feel 100 percent financially secure. It's not about the numbers in the bank. It's about the years he has spent in an uncertain financial situation.", "if you're grinding in finance or law, you won't have time for a social life, anyway. drink with your coworkers at your desks like the rest of us lol\n\nif you're grinding in tech, your employer provides plenty of socializing activities, and you should be working, anyway.", "Insurance will cover your half child? Mine declined coverage as apparently being a half-child is considered a preexisting condition :(", "I did total them all together.  \n\nLet's look at San Fransisco with no claimed deductions, shall we?  \n\n$300k is in the 35% marginal bracket.  \n\nFederal, \t35.00% Marginal, \t24.74% Effective,  \t$74,221 in taxes \n\nFICA,\t2.35% Marginal,  \t4.79% Effective,  \t$14,364 in taxes \n\nState,  \t9.30% Marginal,  \t8.06% Effective,  \t$24,195 in taxes\n\nCity,  0.38% doesn't specify marginal or effective so using as flat rate,  $1140 in taxes \n\nTotal taxes:  $ 113,920\n\nTotals to shy of 38%\n\nSo please.  Show me your math.\n\n\n\n-----\n\nNYC\n\nFederal\t35.00%M\t24.74%E\t$74,221\n\nFICA\t2.35%M \t4.79%E \t$14,364\n\nState\t6.85%M \t6.12%E \t$18,356\n\nLocal\t3.88%M \t3.73%E \t$11,193\n\nTotal Income Taxes\t\t39.38%\t$118,134\n\nStill below 40%.\n\nShow me your math.\n\n-----\n\nEdit to Add:\n\nThis is the highest, FYI.  It'll go lower with 401k contributions, credits, claimed deductions, etc.", "Feel free.  I'm happy to teach you how effective tax rates work.", "Where did I say he's struggling?", ">$300k is in the 35% marginal bracket.\n\nThey said \"the highest earners\", so I'm not referring to this earner in particular. The *effective* federal rate for $1 million AGI with the standard deduction (I know, they would really itemize, but for simplicity) is 32.5%.", "If you think 80k is peanuts you're even more privilaged than OP and his friend.", "No one is saying Nathan is crying over being poor. He just has a larger mental load and started from a lower place given his background. My sister makes 1/4 of what I make and I don’t complain to her at all. But guess what she also has a credit card under my account for her for any emergencies or months things may be tight. She’s only used it once but I’m happy to give her at least that. \n\nWe both also grew up in the same situation where our parents can help a little but if something happens we both have to grind. Don’t have the same safety net OP has. \n\nWe are talking about two very privileged people and their relative privilege to one another as they literally started with same salary and job and have that connection about bitching about work. I’m fairly sure neither bitches around people who are fundamentally struggling in a way neither could compare.", "Seems like you’re arguing that he is worse off than op financially when if spending responsibly like a normal person, simply isn’t possible. Unless his entire family simply doesn’t work at all and stays at home. In which I still don’t feel bad", "I say NAH (no ass hole involved), clarifying that the differences in understanding are indicitive if the class/wealth divide in society right now.\n\nYou acknowledge you have the ability to fall back on family, and admit that you have a somehwat privileged background - and that he does not have that same sense of security, and in fact know he is the one others rely on. But you fail to understand the stress that causes him. Just because he has that level of wealth, he is not able to enjoy it or feel secure at all. He may hate his career and want to make a change that would be healthier for him, but is forced to stay where he is at.\n\nAnother aspect is that you may have had financial assistance to pay for the education, where he may have had to pay out of pocket or get student loans. So he probably has less financial freedom than you realize.\n\nI understand why you are hurt that he reacted the way he did, but I also understand the perspective he has - he does not have the ability to make the same kind of change in his life, even if the opportunity presents itself.\n\nNo body is an ass hole, but there is a lack of contextual understanding from your perspective.", "NAH. Hear me out: you were not wrong but Nathan will need more than money on his bank account to move past the probable financial worries that shaped his relationship to money from a young age. There is also one thing that you seem to have missed: you say that your family could support you should you need it some day whereas his can't, but there is a wider picture here because he also most probably knows that not only will they not support him, he will also have to support them at some point, which is not something you have to take into account in your professional choices.\nGenerally speaking people from well off backgrounds will take more \"risks\" with their career because they have a safety net. Nathan does not have that and he is probably still in survival mode in a job he doesn't like but feels stuck in.\nYou two need to talk it out and clear the air because none of you is the baddie, you just come from 2 different perspectives and that's ok.", "Unpopular opinion but ESH. He shouldn't have said that to you while you were excited and happy about your new job. As a friend, he should've been happy for you.\n\nYTA for what you said and for not recognizing your own privilege. You outlined it in your post but you didn't seem to grasp it.\n\n> They're not millionaires, but if anything ever happened to me, they could (and would!) help me until I could get back on my feet. Nathan does not have that privilege.\n\nYou literally just called out the same privilege in this post that Nathan said to you. I get why you were mad, because the timing and place of his statement could've been better. But he wasn't wrong about what he said.\n\nAnd he IS lucky to be making that much money, but you have to understand that it's like a ball and chain to him. He can't leave. He has a whole family depending on him for that money.\n\nThere's not enough empathy in this thread and from you to understand where he's coming from. People just check out when they see \"300k\". You don't see the fact that he's trapped.", "ESH - you're both exhausting finance bros.", "You’re the asshole for being petty about it and bringing your friend’s financial situation into it when the real issue was that you felt hurt that he didn’t say something positive about your new job. Just say how you feel or what you need from your friend instead of trying to diminish him. That’s what real adult friends do. \n\nAnd it’s the truth though, right? You say it yourself that you make plenty of money to cover your needs and be happy, and you have resources in the form of family/community as a safety net. You likely get financial help from your family in indirect ways—second hand furniture? Family meals at their house? Financial advice and education? Your friend does not—not that’s it should even be at issue nor is it a competition. \n\nDid he say it in a jerky way, or just matter-of-factly? It sounds like you were the one who decided to bring him and his situation into it to compare, so I wonder if you are harboring some jealousy towards him and then overreacted because of it. Your friend should be happy for you, but without you characterizing the delivery of his comment as negative or positive, it’s hard to say. \n\nPrivilege is something that is granted to you without you having earned it yourself. Your friend works hard; you also work hard. You were privileged in how you got there; your friend was not. But again, his situation should have nothing to do with yours. Stop comparing them and be supportive of each other instead.", "NAH\n\nThis may be a great time to have a heart to heart with Nate and ask him if he is *really* doing okay, and if he needs your support (as one of his closest friends, per your view). I’ve got a few friends and several colleagues in your former industry and his current industry, and I’ve seen first hand how much the pressure, the expectation and the relentless competition can grind people’s souls into dust.\n\nI reckon your friend lashed out, inappropriately as it was at you, because a) you were the most readily available target, and b) he is probably feeling immense pressure not only from his work and bosses, but more likely his family.\n\nNo doubt his family feels entitled to Nate’s money, and are probably guilting him in any way they can to get him to submit to their needs. It’s… …its not an uncommon scenario for poverty kids who have managed through incredible personal efforts to get themselves out of that deep, deep hole.\n\nThe fact that you both agreed to cool off before talking again gives me hope that Nate realized he crossed a line and hurt someone who has been a source of support form him in the past.\n\nI beg that you consider forgiving him for this incident, and instead approach him with compassion and a shoulder to lean on. Perhaps even some guidance about standing his ground and making boundaries with his family.\n\nI’m totally guessing here, mind you, but I’m thinking Nate would do well to have you and your other friends in his corner.\n\nGL to you both and congratulations to you on getting your dream job!\n\nEdit: wanted to add, after gathering my thoughts—\n\nI recognize it’s not *fair*, necessarily, to you for me to ask you to reach out to Nate to see if he needs help. I’m going by what I’ve seen on many of the r/ask posts types where men are asked what are some difficulties specific to men—asking for help has been a big reoccurring submission, because of the many social-connotations that men are often subjected to for “daring to ask for help!”\n\nIt’s possible that Nate may not *know* how to ask for support or help because he feels that he may not deserve to since he recognizes just how well “on paper” he looks, nowadays.\n\nSo, that’s why I suggested that it may be worth approaching him with compassion and reaching out the metaphorical hand of support to him.", "ESH Nathan is right but is extremely rude he didn't have to say it and you don't even recognise that being able to work a job you love without worrying about money or your family and quiting a well paying job by choice just because you don't like it and not caring about anyone else is privilege that not many people have", "ESH \n\nAlthough his response could be more appropriate. He should have congratulated first and then later some time could mention what he did right away if he really wanted to( better not mention at all) \n\nBut you did agree yourself you have certain privilege coming from financially stable family. That has allowed you to change the course of your whole career and choosing something that gives you mental peace even if there is huge pay cut. Coz at end of the day, you know you have family to support you if this career move fails. He, on the other hand, may have wanted to also get out of co-operate grind but cannot as he knows there is no one to financial support him if it doesn’t work. \n\nAlso 300k wouldn’t all of sudden make make him financially secure till he works of decades, saves, invest to build up a good amount of saving to fall upon. This 300k doesn’t just all come in hand as now he is on higher tax bracket then 80k salary. Some unfortunate sudddn stroke of bad luck and he can loose the job and the 300 k turns into 0 \n\nSo his point is fair but delivery timing was really bad. His statement maybe from place of some jealousy that you have privilege of doing what you want and he doesn’t ( which is not wrong) and your over reaction is from fact that you don’t want to acknowledge that your decision to change into more comfortable/ cushioning professiona is not from just your bold / brave decision but also made possible by and underlying privilege", "Esh!\nI have to say your update made me cry. It is hard to have such good friendship and you two are great ones at that.\n\nI wish we had more people like you and Nathan in the world. \n\nAll the best with new job!", "Wonderful update. Congratulations on your dream job!", "Op, I just wanted to say that you seem so incredibly mature and level-headed. Thank you for being so thoughtful and considerate, even after having been hurt. Sometimes it is difficult to be our best selves. It appears that the two of you had a brief hard moment. I am so glad your friendship with Nathan hasn’t been damaged over a normal bump! Thank you for being open to and sensitive about different perspectives and experiences.", "ESH\n\nAs some who grew up trailer park poor I do admit I had to get substantially older before I was willing to take less pay for a job that had a better work/life balance. While classmates of mine from high school still make about 40K less, took jobs that were more geared toward being socially conscious or family friendly right out of college.  I was so busy planning to support extended family, wanting to actually own property and retire without having to be dependent on my children I never gave myself that \"Luxury\" to working just to sustain. Most of those friends also knew they would have inheritances from grandparents, parents or money of some kind while I knew I wasn't going to have that potential windfall. \n\nJust from what you say about your friend even though he makes more then you he still has more of a substantial burden of having family that need his support so he needs to keep working a grind job that pays.  He can't do like you and relax at a lower paying job that only provides support for himself.  I also think that he has that poor person mind set that can't feel comfortable cause he is always waiting for that unforeseen disaster so he is always working to make sure he had enough to hand. He fears he can't rely on help so he has to plan for the possibility.  \n\nSo just by what you said, I can see why he still thinks of you as more privileged.", "Surprise wholesome AITA. Who knew.", "NTA.\n\nIt sounds like you are/were both focused on different things and the privileges they bring. \n\n~ He makes more overall but has me other family members dependent on his financial assistance for survival. \n\n~ You get to pursue a dream position in your field of interest without worrying you'll be letting others (dependent family members) down with a salary cut.\n\nThe grass is always greener. \n\nI hope you both cool off and reproach this conversation. \n\nCommunication is so powerful. \n\nFriendship can be difficult, but they only get stronger when you both are honest and care.\n\nMaybe try thinking of a way to describe how his comment made you feel feel without being accusatory. \n \nExample: \n\n\"*I* was very excited to receive this dream offer. *I* wanted to share my excitement with my friend. \n\nWhen *I shared with my news your response that I was \"\"privileged to be able to take a job with a paycut\"\" felt very dismissive and hurtful. \n\n*l* worked hard for this opportunity, and *I* had hoped you would be happy for me and share in my celebration. \n\nI would like to understand why you responded in such a negative way to my joyous news?\"\n\nMy guess is that your friend was struggling in some way and did not realize he was raining on your parade the way he did. \n\nThe only way to find out and work through it is to talk it out when you are both calm and collected. \n\n#CONGRATULATIONS ON YOUR NEW OPPORTUNITY!!! I'M SO PROUD OF YOU!!!", "Did you read the part where OP says their friend supports family members who are financially unstable? The only people who are able to do FIRE are people in OPs position who are not carrying other responsibilities. For their friend, however, when that many people depend on you, $300k looks more like $180k, if that. That's before you begin to consider that someone from a poor background who makes it to that point, on top of supporting relatives, likely has a lot of debt. Reassess your assumptions,  privilege looks different depending on where you're standing, and your comment is dripping with it.", ">invest for 5 solid years so that you can retire out in the countryside\n\nlmao, okay...", "Hey thanks for your really nice response. I honestly said almost exactly some of the things you wrote down when I talked to Nathan on the phone and we had a really nice talk where we both apologized. This was very nice of you to write", "Hey man, thanks for the response. Just wanted to let you know that you're totally right - I really didn't understand the situation he was in and the ways that it's still affecting him today. We had a nice call and both apologized, and I'm gonna work to try and support him a little better and try to understand his side of things.", "100% this. OP is definitely not the asshole but privilege is a difficult concept. Friend worked their butt off to get to the position he’s in right now, I don’t see any privilege in the position he’s at because if he left he’d be fucked. Privilege is more of what you’re born into than what you’ve earned.", "I hate how no one understands this, but having a safety net is absolutely a privilege. It doesn’t matter if they’re both financially independent. If both of them got fired from their job, one of them has their parents income to fall back on while the other doesn’t. It’s literally as simple as that.", "Are you missing the part where the man makes over a quarter of a million dollars a year? Because I feel like you're ignoring how vast of an income that is", "Oh *please* give me a break\n\nNathan’s not doing grunt work for peanuts, he’s a VP at a firm….he’s doing the cool stuff everybody envisions doing while grinding during school and internships and soul-sucking data entry roles. If he loses his job, he’ll quickly find another one. And if he can’t, it’d be because he did something extremely illegal or unethical and destroyed his reputation. \n\nThis comment section is so baffling to me", "I ain’t apologizing to an asshole. He chooses to live lavish and be tight on money. Even if he’s supporting his family they are living lavish too if 300k makes you struggle. They need a financial advisor lmao", "Hey man just wanted to say thanks for taking the time to write up this response. Honestly, I made this post right after our phone call and I was feeling pretty heated and defensive, but you're totally right - I was not being the most supportive of friends when I wrote this. We've had a call and I did apologize to Nathan and I do see his perspective. Honestly, we never talked a lot about his past because I don't think he liked talking about it, but I'm hoping to change that so I can understand him better. He's my buddy.", "Cool so that means you’re allowed to be totally in the wrong and an asshole to your good friend?", "I think this is an angle that’s being neglected - poverty-mindset and classist chips on your shoulder take a lot of therapy to navigate and unravel. Not ever having safety nets makes you an entirely different person for your entire life if you don’t come to healthy terms with it. Even if he’s making enough now, it can be hard to undo the damage and trauma associated with being poor, and everyone important to you being poor. I think he was a massive dick about it but I don’t underestimate the work it takes to undo years of necessary self preservation. Just because he’s doing well now doesn’t mean he forgot what watching his and his family’s constant struggle felt like. Knowing you’re the beginning of possible generational wealth can also be pressure. Again, though, he should have celebrated his friend and I hope he finds the mindset to eventually do that naturally.", "Hello desert\\_red\\_head, thanks for your perspective bro. I agree with everything you said, and I talked to Nathan and said I wanted to understand him a little better. I read a ton of the comments here and honestly didn't realize the huge affect poverty can have on people mentally and financially for decades. He also said he was sorry for not being supportive and next week we are going to go see a baseball game so hopefully we can talk more then", "I'm baffled by how many people want us to cry for a fucking VP in whatever the corporate fuck who gets 300k a year,  im wrecked trying to save 30k to deal with medical issues. And dont get me started on my mum working 20 hour shifts to be able to afford feeding and housing her kids.  Fuck this rich guy, he doesnt get to bitch and cry when the rest work just as hard but live hand to mouth.", "OPs friend shouldn't have said what he said, so NTA, \n\n but this gets to the crux of the psychology of what OP said. He will never be privileged because he did not grow up with money. Therefore, taking a cut in wages wouldn't be an option for him due to the mindset he grew up with. If every penny counts, its pretty tough to get out of that way of thinking, so the friend is still not privileged in mindset. OP has the privilege of feeling secure/ relaxed with money, due to upbringing, which has allowed him to take the new job. Often with privilege it isn't the circumstances you end up in, its how you feel getting there and when you get there.  OPs friend potentially gets judged by his family for earning loads (you've changed etc), judged by his peers for his upbringing and maybe never feels quite like he fits in anywhere.\n\n&#x200B;\n\nNTA because its a shitty response to a shitty thing his friend said, both should apologise, get a beer and forget all about it!!", "I don’t think it’s a complex. \n\nWhen you grow up comfortable but earn less as an adult, you have a safety net in your family. \n\nWhen you grow up poor but earn more as an adult, you *are* the safety for your family. \n\nThe friend may have the privilege of wealth now, but he very much does *not* have the privilege of taking a pay cut to follow his dreams and knowing he’ll still be OK. No, he wasn’t the most supportive friend at that time, and OP is justified to be disappointed. But he’s not wrong that OP had privilege in being able to take that job.", "Yeah for me this is an ESH or NAH.  Everyone is focusing on the numbers, but a lot of privilege is about mindset and opportunity.  I’m legit making very little right now, but because I come from an upper middle class upbringing*, I can take the risk continuing to work in an industry that is really up in the air right now, taking lower paid things and continuing to network and build my portfolio while others have to take survival jobs.  I also have a friend who left the non-profit sector for the finance world.  He hates it, but he wants to make sure his mom is taken care of (immigrant family) in her old age.\n\nI hope both OP and his friend can find some compassion for each other; they both have different privileges in their situations.", "Hey thanks for your comment, I think this was a lot of what was going on in Nathan's head. I also wish I had extended a little more grace, but we've talked and I apologized and so did Nathan. I think he's just sad and feeling stuck like you said, but I am trying to help him through it since he's my friend, and this was just a one time misunderstanding", "Just because OP is privilaged, doesn't mean Nathan isn't also very privilaged. Which he is. Very much so.", "hey purpleyish, I totally agree with you here. I honestly wrote this post when I was feeling upset and defensive, and you're right that I focused on the wrong thing, which was this hard-to-define idea of privilege. I think Nathan and I just hit on each other's insecurities in that exchange, and we've talked in out on the phone. \n\nYou're absolutely right that I'm incredibly privileged, and I would have admitted that more if I had more than 3000 characters in the original post lol. And you're also right that I didn't know a lot of where Nathan was coming from, so I'm hoping to fix that in the future. Thanks for your comment bro, you didn't have to write all that and it was helpful for me to read", ">Nathan is prob paying 2k plus a month to share an apartment\n\nOh no! Only 276k left. The poor bastard.", "If you lived off 29K a year, you could easily retire in 5 years. The simple fact is that you've grown into your paycheck, statistically with a partner who is happy to help you spend that \"extra money.\"", "If you support financially unstable family members, you could make a billion dollars a year and still be broke.", "hey snowfairyhacker, thanks for this comment. truly I did not realize this about privilege and the way it's \"layered\" like someone else said. I guess that shows I've got a lot to learn! But I talked to Nathan and apologized so hopefully I can learn more from him if he is willing to talk more about his experience", "Okay? That doesn’t give him the right to be snarky when OP is sharing good news.\n\nAnd besides, Nathan’s in tbe big leagues now, likely surrounded by colleagues who come from wealthier backgrounds than OP. Is he making backhanded comments to them about their family money, too? I’d bet my life savings on NO", "No I get it but my point was that OP making a more modest but not low wage salary doesn't make him privileged if he can cover his own costs and debt. He's choosing meaningful work vs financial ease and it's not privilege to make that decision.\n\nHe may be like said teachers and eventually have to change to a job that pays more but that isn't out of privilege.", "He’s probably doing the cool stuff that he dreamed of doing while in school or working that shitty first job after college!!!!! It’s not like he’s scrubbing toilets and fetching coffee lmao", "I always wonder if people on reddit know what family means would you prefer it if he just turned his back to his family and for himself only leaving everyone else in poverty", "6 figures if we are talking 120,000? No. 6 figures if it's north of 300,000? Yeah. I don't know how you could make 300k and look at your family (assuming they aren't shitty) that is struggling and just be like \"hmmm...that sucks. Anyway.\" I would probably try to help them out in ways that isn't money first, for the sake of trying to set up a better situation for them, instead of just having them dependent. But that just feels a little selfish to do nothing. Just because you don't owe them, doesn't mean it doesn't suck to not help.", "Highly ignorant statement here. \n\nMy cost of living is low compared to others in my position, but going from having multiple children sharing bunk beds with no other space in their room in a 2 bedroom home in a bad neighborhood, to a space that is just big enough for all of us in a decent but still working class neighborhood is not “growing” into a paycheck, whatever that is supposed to mean. You also make a lot of assumptions about my health that automatically presumes I’m not now spending a good portion of my income in that area.", "LOL your funny. To be a 1%er as a single you need to make >$600k a year.\n\nIt is not the income at question here it the ability to take an almost 7% pay cut.", "How would you be able to save 150k a year? Taxes combined with basic living expenses already takes you over that", "Yes $300k doesn’t go for privilege in HCOL. Sure I’ll take it in a heartbeat over less, but it’s NOT privilege", "Seems very privilaged to me if he's able to take care of his entire family on one salary.", "This! A lot of people are not able to even consider their dream job/career because of low earnings and so they feel stuck in the corporate grind even if they hate it. OP _is_ privileged to know he has a safety net, even if it's one he's never had to use. From what he says, I'm assuming he's never had to worry about not having enough food, or fearing homelessness.\n\nHis friend was an AH for not being happy for OP when he shared the news, but I can understand the bitterness and envy that the friend likely feels. He knows that if he fails, there is nobody there waiting to catch him, and as if that's not enough, it would probably also negatively impact his family, if they're also depending on him for money. I can't blame OP's friend for being traumatized by growing up poor, that shit fucks you up.", "OP’s friend is miserable making that money solely for the purpose of needing to help his family. Do you think his happiness is worth less than his family’s need for financial assistance? Feels selfish to expect someone else to kill themselves in a job they hate just because you need financial help. Don’t ya think? \n\nA lot of people who help their families financially end up living their lives for their family and not for themselves. I think it’s way more selfish to expect someone to drastically alter their own dreams in an effort to make sure you’re taken care of.", "There it is. You literally have a growing family, so you're growing into the larger paycheck. This is completely normal and good, and hardly a \"highly ignorant\" statement as it's just statistically fact. If you were 28 as OP's friend is, the health problems would be the anomaly.", "“I live in one of the highest COL cities in America, obviously I know everything about how salaries work everywhere!!!!” Get your head out of your ass dude. Remote work is a thing, which you should know if you live in SF. Plenty of people working remotely, making a shit load, living in low COL areas.", "200k might be middle class if you’re trying to buy a home in a trendy neighborhood and support a family of 7. Yes housing is high, yes food costs are more, but if you are single you can rent an apartment, cook your own meals, and save the vast majority of that income.", "Even that decent is dependent on the real estate market. From the experience of a sibling who makes \\~$300k, she was just able to afford a 3 bedroom, 1 bathroom 1k sq ft house in East Bay.  She could only afford that after various parties took out a total of $80k in equity just to get the house to a more affordable price. \n\n&#x200B;\n\nSo, no, $300k is NOT anywhere near 1% or upper class and retiring to the countryside after 5 years. Plus now even the countryside is getting expensive!  A townhome in flipping Oroville of all places going for nearly $500k (which is INSANE for the area).", "Depends on what kind of support you’re giving, and whether or not your family is capable of taking care of themselves but choosing to mooch off of you instead.", ">but it’s NOT privilege\n\nIf you think it's not a privilege to earn 300k anywhere in the U.S. you're either blind to privilege or in denial.\n\nPrivilige is always having food on the table. Always a roof over your head. Always money for medical care. Enough money for fun activities, holidays. Nathan has all that and more. Heck, he even has enough money to support his loved ones, all on a single salary. \n\nTalk to the people earning < 80k in HCOL areas and come back to me to talk about Nathan's lack of privilege.", "I don’t disagree.. I also don’t know what level of “care” we’re talking about. I just think his privilege has turned into a burden (for him) and that’s the snap that OP is getting back", "I don’t feel bad if you can’t support a family with 300k stop buying all the luxury shit and you can EASILY live on that money", "If he’s making that kind of money, he probably has a skill set that’s in demand enough that finding a new job won’t be a problem, even if the job does pay a bit less.", "No one in this thread seems to actually understand privilege. Privileges are granted, not earned. Any wage you make isn’t a privilege.", "Totally.  I know people who grew up chubby and are skinny and still  \"watch their weight\" and think of themselves as \"chubby\" ... as opposed to me who grew up skinny and now have 20lbs but still think I'm thin and athletic!   \n\nThat childhood feeling doesn't leave you. My parents are depression era babies and with $2M in the bank, mom still clips coupons and is just this side of a hoarder.\n\nAlso, I'm better off than most of my relatives ... and I don't think of them as a burden ... but am absolutely grateful I'm in a position to help them out now and again so they don't lose their homes.  They don't ask, so it is a bit different, but I offer and tell them to keep it on the down low (don't want those hands out).\n\nBut I'm a bit weird, I also feel grateful when I need to spend a $1000 on a new water heater ... so happy I can write that check without worrying about food or clothes for the kids.\n\nSometimes the more money you make, the higher your expenses, the more insecure your job (because everyone is competing for it) ... it doesn't lead to that feeling of security.\n\nI wouldn't have snapped like OP because I understand my friend ... I'd have asked how much he needs to make to feel secure ... and give him something to think about. \n\nI'm in a HCOL area and the medium income for a family of 4 is 75k.   He makes 4x single ... is there ever going to be enough to make him feel secure.\n\nThat's sad.", "It doesn’t sound like the friend is complaining about paying for his family though, he just seems upset that he doesn’t have the same safety net that OP does. I mean if it makes you feel better to imagine that he only pays for their luxuries then go right ahead, but healthcare costs alone are a massive reason families struggle", "The post said that his family is in poverty, which makes it seem like him rubbing his wealth in their faces  without offering them help would be an asshole move. I would feel very bad if I was wasting my money on a lavish lifestyle while all of my loved ones lived in squalor and didn’t know where their next meal came from. \n\nGlad you don’t know how truly miserable starving is", "Oh I don't think that the friend owes it to them to work that job. But I do think that if he is working that job and chooses to have a martyr complex over it...he's still an asshole about it.", "Yeah 300k anywhere as a single person makes you rich. My partner and I make about 160k together in a hcol area and money isn’t tight. Granted we’ve made it tight by choosing a convenient apartment over a cheap one and I have a horse- but we aren’t hurting for anything. If we had double what we make??? I’d def be considering us rich.", "Plenty of people are and will lose their jobs and all that security goes away. In HCOL you’re not saving enough to keep that security if you get laid off. Let alone if you have other households you worry about. Privilege would be having mommy and daddy to help you when you lose your job and when they pass away you’re left with a retirement fund.", "The only way 300k isn’t enough is if they’re spending it on wildly expensive things. You can’t live lavishly and complain about money. Which is clearly what’s happening.", "It's really hard to get rid of that anxiety, even when you are financially secure. It sneaks up on you.", "And if it makes you feel better to imagine that he’s paying for healthcare costs, go right ahead.", "Ok so you bring in $190k after taxes, spend $30k on rent, let's say $25k on food & drinks and $10k on other miscellaneous expenses (which is unrealistically low, but whatever).\n\nSo that's $125k/year leftover after expenses if they're being extremely frugal.  So after 5 years you'd have $625k in the bank and own no property.  That's nowhere near enough to retire on.", "Oh my God. I make $50k a year and reading this killed me.\n\nETA not a high cost if living area though.", "Sorry, I meant 30 years \\*after\\* age 30, so at age 60.\n\nYes, retiring at 35 on this friend's salary is definitely inadvisable. He \\*may\\* be able to do it by living super frugally,  investing very well, and then moving somewhere with a lowww cost of living and maintaining a low CoL lifestyle, but that would be a lot just to try retiring at 35. Retiring at 45or 50 on that plan is much more realistic/would be more enjoyable.", "Paying for your private health insurance and retirement isn't the same as paying taxes. \n\nI mean look at my take home after rent, bills, groceries...lol \"damn government\"", "I live in SF and easily have over 1/2 my total paycheck after taxes/benefits.", "Why would you factor 401k contributions? Those are savings, not an expense.", "Honestly I was going with NTA not because of anyone’s income. Even if OP’s friend was dead broke this would be such a nasty thing to say to someone when they’re excited about something. I can’t fathom saying this to a person I care about.", "It really does and especially when it comes to parenting my kids. I don’t feel like I can rely on my instincts for any decision and have to try to research and think logically before making a parenting choice involving money.", "Well that’s if he makes zero personal investments with his 625k. Considering he’s an investment banker it seems unlikely that he’d just sit on half a million dollars in cash. I’m not saying he’d retire after 5 years, but he’d definitely be upper class especially relative to his age group. How many 20 something New Yorkers have 625k in savings?", "Someone trying to save for early retirement isn't going to spend $480 a week on food for a single person.  And it's *definitely* not \"extremely frugal\".", "Pfff you should exchange your kid then. Mine make 400k on tiktok.", "This entire thread seems insane from outside the US even with the relative conversion.", "If retiring 20-30 years early I would be very uncomfortable assuming I could take out 5-7% per year indefinitely. That is not a typical FIRE assumption.", "No he can't. If his 300K is salary, he's not avoiding taxes on it. He can only chip away. The people who really don't pay taxes are the ones who make their money from non wage income.", "Why, that's just a quarter of a child!", "Aren’t the cost divided by two? And which half are you talking about? The upper one or the left one?", "Mine had an accident.", "You were both TAH in the moment, but if you stop and think about it for a few minutes, it is not big bump to get over if you would like to stay friends with him, just some serious reflection.\n\nYou have the choice to do lower paid work that you enjoy, as you currently only have to look after yourself and you still have a great back up system if things go to shit.\n\nYou have grown up with a safety net all your life and it is still there for you.  Nathan never had that option and still does not have that option if things go to shit.\n\nYou know is was not like for Nathan and he still does not have a safety net.  In fact he is now the safety net for his poor and financially unstable family.\n\nFrom your post it sounds like he has taken on the burden of being the breadwinner for his relatives and as such does not have the choice of taking a pay cut to get his dream job.\n\nTry showing a little kindness and empathy.  Your life plan sounds like it is totally on track and his is not.", "Truly never thought I’d read a thread full of people saying “I make 300k per year and I’m poor:(“ but here we are\nWhat a wild ride lol", "YTA. So you grew up with money and can still rely on mommy and daddy to bail you out but let’s take offense when someone who has no one to bail him out, mentions your privilege.", "NAH. I love the update so much!  May you and Nate have many more years of friendship ahead.  You handled this extraordinary well.", "I don’t understand why everyone is so focused on the actual numbers with their income. At the end of the day, Nathan losing his job is MUCH more likely to lead to homelessness than yours because he still has no one but himself to rely on. You do. And while he was rude about it it is indeed a HUGE privilege to know someone has your back and will keep you safe. There’s a reason he’s staying in a job he hates. NAH/ESH", "Nah. The update is lovely and is exactly how a situation like this should be handled! No one is right or wrong, but you talked it out and realised everyone's POV - that's how friends work. I'm glad it worked out between the both of you.", "Wow!!! I have tears in my eyes reading this. I don't think I want to read any of the comments. What a cool post to read, and a real eye-opener. Thanks!", "Honestly, the best comment in this whole thread.", ">How is he privileged, especially compared to you? \n\nWhy does it have to be a comparison? Both are very privileged.", "Thank you for your reply.  I’m glad that at least one person understood where I was coming from and what I was trying to say.  Most of the people who replied back to me seemed to think I was condoning Nathan being an AH to OP, which would go against my ESH response.  Of course Nathan was an AH in this situation.  At the time, Nathan really should’ve put his thoughts on the pay cut aside and congratulated his friend.  OP, however, chose to respond to Nathan’s comments in probably the worst possible way-by telling him he is privileged.  Even though you make more than the average person, you never forget your past, nor do you unlearn the things you learned and the values you developed while you were trying to survive.  No, it is not a pass for Nathan to be an AH, but it is giving insight to OP as to why his friend reacted as he did.", "Right, obviously, but that’s not really the issue. This isn’t “who’s the more privileged one. It’s how they communicated. If Nathan was poor and said the exact same thing, would it be ok? OP is happy about his career change and would still hope people would congratulate him. Nathan obviously hurt his feelings, even if unintentionally. That doesn’t change due to the size of Nathan’s bank account. \n\nI think everyone is getting off track by focusing solely on Nathan being rich. This is a communication problem.", "What's your secret to paying 0% taxes?", "It’s takes roughly 1 million dollars a year to be considered comfortable in NYC. In my neighborhood alone which is nowhere near upper middle class or upper class, there hasn’t been a house sold for under 1.2 mil in 10 years. Even illegal basement apartments go for almost 2k a month without utilities. \n\n[300k absolutely does not put you in the 1%](https://www.businessinsider.com/how-much-money-needed-to-live-in-new-york-city-2022-7?amp)", "In the Bay Area you can't even afford to buy a house on $300k. Maybe a condo.", "You do not know what the 1% truly is.", "You realize that the cost of a 4 bedroom house in SF means absolutely nothing if you take your cash and move to the country, right? It only matters *if you stay in SF*.\n\nI did exactly this in the UK. Spent a few years earning London money and living on a shoestring, took my cash and moved to a cheap area - I'll be retiring at 40.", "This. \n\nIm sorry but if you did absolutely no investing or saving with your $300k/year, leaving you broke, that’s 1000% on you and not a matter of privilege", "I think it’s worth remembering he’s trying to help his family, so while he’s technically single, he could be trying to support half a dozen households on that $300k while OP is only supporting himself on $75k. It doesn’t make the friend’s comment appropriate, but it may make it more true.", "One of the most amazingly stupid things our fellow Americans do is think that anything in this country gets worse for you the more money you make. They seem to fundamentally not understand how this country works.", "Yep, the only time you can lose total income by increasing your salary is if you're on some kind of gated low-income or disability benefits.\n\n(Although it \\*is\\* true that if you are married to someone who makes a lot less money than you, your combined tax bracket can result in fewer taxes overall, because you can apply deductions from the lower-income spouse to the higher-income spouse's taxes.)", "FYI, I live in a 3.5 bedroom 2 bathroom in Manhattan. Elevator building, live in super, pretty nice view, 5 minutes walk to three subway lines, huge kitchen with tons of counter space. Including hot water and gas, the monthly rent is $3500. It’s not rent stabilized, haunted, or full of vermin. :)\n\nYou can get a one bedroom like this for 1.9k:\n\n https://streeteasy.com/rental/4175570", "So they can cry poor lol.", "This is so bizarrely callous I’m sort of speechless", "Don’t you understand that if you make less than half a mil a year post tax in any of the 50 largest cities in the US you’re literally starving to death and likely already dead?! Won’t someone please think of poor OP’s friend making more solo than the vast majority of *households* in the country??!1", "Also live in NYC. I pay 1700 a month for - at the time of purchase - a three bedroom house. There are still places in the city where you can buy a home in a good neighborhood for 500-700k. Which is definitely affordable for one person making 300k, even with higher interest rates today and the mortgage payment would probably cost about as much as a smaller apartment.\n\nAnyone who’s stupid enough to pay the Manhattan premium is just not worth talking to, IMO. “OMG, I’m spending 5k a month for a crawl space!” It’s a big City; no one says you have to pick the most expensive part of it to live in!", ">I'd pay to see a pair of legs just walking around.\n\nAs luck would have it you can! Just pay whatever Disney+ costs and watch Onward.", "The audacity of my existence! The audacity of the other 9.5 million new yorkers existence!!!", "Depends on if it is a half because of a recent divorce."]}